[
  {
    "start": 7.435,
    "end": 18.952,
    "text": " hello everyone it's december 13 2022 we're in active book stream number 1.02 on the book governing continuous transformation off to blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.796,
    "end": 21.636,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.216,
    "end": 31.038,
    "text": "We are the Active Inference Institute, a participatory online learning institute that is learning, practicing, and thinking about applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.878,
    "end": 34.479,
    "text": "You can reach us here at all of our media links.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.879,
    "end": 42.26,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve upon our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.901,
    "end": 49.782,
    "text": "All backgrounds and perspectives are welcome here, and we will be following good video etiquette for livestreams, hopefully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.89,
    "end": 63.418,
    "text": " Get in touch if you want to participate either in this book stream or the dot zero contextualization contextualization streams or in another live stream or maybe in the discussion stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.958,
    "end": 67.641,
    "text": "You can reach us always at active.org or by email.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.586,
    "end": 71.929,
    "text": " Okay, so here we are, Bookstream 1.02.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.209,
    "end": 82.119,
    "text": "The sections will go through the book map and the roadmap, the keywords and the claims, and we'll be continuing the discussion of governing continuous transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.283,
    "end": 93.171,
    "text": " So I don't know if we want to just maybe mention a couple of things, one or two things that we're excited to discuss more today or learn more about from this section of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.552,
    "end": 95.893,
    "text": "Tyler, is there anything that stood out for you specifically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.074,
    "end": 102.479,
    "text": "Or maybe we want to give an introduction and then maybe say one or two words about the book, the chapter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.123,
    "end": 103.603,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.704,
    "end": 104.744,
    "text": "So I'm Tyler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.764,
    "end": 113.412,
    "text": "I work more on the applied side of thinking about governance, organizational design, both work in the DAO tooling space and also protocol design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.432,
    "end": 117.055,
    "text": "I also work in a lot of corporate settings as a strategy consultant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.416,
    "end": 129.746,
    "text": " I think for today, what I'm excited about is that I went to business school, something that I hear a lot about, like some of these organizational design frameworks that Bijan references in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.067,
    "end": 135.371,
    "text": "It's really interesting to compare that directly to free energy governance and compare and contrast, see where the gaps are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.391,
    "end": 137.053,
    "text": "So I'm excited about exploring that more today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.534,
    "end": 138.975,
    "text": "What about you, Boo?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.27,
    "end": 158.749,
    "text": " I am really excited to kind of link, and so I'll do this right up in the very beginning, but to link what we have talked about in the Active Inference Institute over the last couple of years about biological organization and hierarchical information flow in biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.809,
    "end": 160.05,
    "text": "I'm excited to connect that to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.703,
    "end": 163.104,
    "text": " how that works in an organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.244,
    "end": 172.147,
    "text": "So I just, as I was reading the book, that was something that stood out to me as something that's maybe necessary for like a more elaborate discussion of the text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.487,
    "end": 173.707,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.147,
    "end": 174.888,
    "text": "Daniel, anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.908,
    "end": 180.43,
    "text": "I'll have a comment at the roadmap, but I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.77,
    "end": 184.151,
    "text": "I'm a researcher in California and just looking forward to this discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.511,
    "end": 185.751,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.971,
    "end": 186.311,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.232,
    "end": 187.512,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.992,
    "end": 190.373,
    "text": " So here we are at the book map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.453,
    "end": 195.694,
    "text": "We are in Chapter 2, Sensing, Sensemaking, and Strategic Renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.015,
    "end": 200.016,
    "text": "And the roadmap for today is just two sections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.096,
    "end": 207.159,
    "text": "These were structured actually by the author, Strategic Cognition, Sensing, and Sensemaking, and the second section is Strategic Renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.719,
    "end": 211.96,
    "text": "Did you want to make a comment here, Daniel, at the roadmap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.922,
    "end": 216.342,
    "text": "Not yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.642,
    "end": 216.942,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 218.46,
    "end": 220.622,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.202,
    "end": 221.362,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.382,
    "end": 224.965,
    "text": "So lots of keywords in today's discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.105,
    "end": 234.593,
    "text": "So we'll just jump right in and hopefully we put them in an order that aligns with the order in the book and included some commentary and claims from the text as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.613,
    "end": 236.514,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.734,
    "end": 239.597,
    "text": "So Tyler, do you want to read this first part of the abstract?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.469,
    "end": 241.729,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.949,
    "end": 249.471,
    "text": "Sense and sense-making form one unitary act, and together can be considered a non-operational cognitive medicate ability or dynamic capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.011,
    "end": 258.532,
    "text": "There's no sensing without sense-making and vice versa, and there's no organizational sense-making in the absence of a clearly defined, deep, existential corporate purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.172,
    "end": 269.474,
    "text": "Generally, the processes of top-down, bottom-up, hypothesis-sensing, prediction-error minimization, rather than top-down juristic simplification, are guiding the path navigating a discontinuous world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.154,
    "end": 286.626,
    "text": " There's neuroscience's predictive coding that allows us to take management researchers' strategic cognition and, more specifically, the nexus of structure and cognition one step further to provide a more complete and practice-relevant framework for applying sensing and sensemaking in the context of strategic renewal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.539,
    "end": 289.64,
    "text": " I'm going to take the next part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.04,
    "end": 290.6,
    "text": "Sure, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.88,
    "end": 291.901,
    "text": "Daniel, do you want to read this part?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.701,
    "end": 292.861,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.902,
    "end": 295.583,
    "text": "Okay, I'll do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.083,
    "end": 305.808,
    "text": "Effectively, sensing and sensemaking are empowered by the circular causality of top-down knowledge structures, prediction models, predictions, hypotheses, and guesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.588,
    "end": 329.399,
    "text": " and bottom-up stimuli data stemming from resource markets by default uncertainty and complexity are subjective concepts but are consistently deployed in management research as objectively determined environmental sensing and sense making are nonsensical in the absence of having set the firm's purpose and context in the first place once we define sensing sense making and strategic renewal in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.867,
    "end": 344.271,
    "text": " form of action centric circular causality linking purpose prediction models predictions and prediction error minimization a new logic of strategic renewal emerges dynamically connecting structure hierarchy cognition and capabilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.435,
    "end": 350.118,
    "text": " And so I just really wanted to bring this in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.858,
    "end": 360.165,
    "text": "We're talking here about top-down and bottom-up, and I know that there's management styles and structures that are associated with top-down and bottom-up management styles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.906,
    "end": 368.091,
    "text": "But I really wanted to bring up this paper, The Information Theory of Individuality, by David Krakauer and colleagues at the Santa Fe Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.744,
    "end": 373.748,
    "text": " And I bring this up because really they try to define what is an individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.868,
    "end": 384.437,
    "text": "So even in a biological system, an individual like we are, we have more or just as many cells inside of our body that are not human as we do cells that are human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.057,
    "end": 385.217,
    "text": " right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.377,
    "end": 390.622,
    "text": "But like, if you were to take all of those non-human cells out of my body, like I would not be the same person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.642,
    "end": 392.803,
    "text": "Like I would not function optimally at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.244,
    "end": 396.867,
    "text": "So I'm more maybe than just what is my DNA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.907,
    "end": 398.948,
    "text": "Like there's a, I'm a colony, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.988,
    "end": 401.41,
    "text": "Not, not necessarily like I'm one organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.49,
    "end": 403.772,
    "text": "I'm many organisms to function appropriately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.052,
    "end": 408.076,
    "text": "And so really these guys tried to define how you like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.596,
    "end": 410.097,
    "text": " contain an individual?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.197,
    "end": 412.457,
    "text": "What is worthy of this Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.477,
    "end": 417.679,
    "text": "We talk about the Markov blanket as the boundary between internal and external, but where do you put that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.759,
    "end": 422.52,
    "text": "Am I drawing it around my human cells, between my human cells and my non-human cells?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.54,
    "end": 424.001,
    "text": "That doesn't really make sense, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.101,
    "end": 437.005,
    "text": "And so they talk in this paper a lot about, and they do it in a hierarchical way, which is why the biological levels of organization are here, because you can define an individual at the level of a cell or a tissue or an organism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.018,
    "end": 439.619,
    "text": " population, community, and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.659,
    "end": 442.66,
    "text": "And this even applies to organizations like a company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.78,
    "end": 451.244,
    "text": "So here, what is critical for it to be defined as an individual is this bi-directional information flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.264,
    "end": 454.185,
    "text": "And I think that this paper is very elegant and great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.225,
    "end": 462.889,
    "text": "So you have to have information flowing top down, and you also have to have information flowing bottom up to be like worthy of a Markov blanket and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.689,
    "end": 465.79,
    "text": " considered an individual in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.89,
    "end": 473.535,
    "text": "And so I really just kind of wanted to bring that in because they talk about, Bijan talks a lot about how you need this bottom up and top down and they have to work together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.555,
    "end": 478.058,
    "text": "And he talks about that a lot in the book for a firm to persist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.719,
    "end": 482.261,
    "text": "And so like really it's necessary for anything to persist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.301,
    "end": 487.484,
    "text": "Like you have to have that bi-directional information flow to earn your Markov blanket, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.004,
    "end": 490.306,
    "text": "So I just wanted to kind of bring that up here before we jump in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.987,
    "end": 495.428,
    "text": " to the additional context talking about top-down and bottom-up in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.048,
    "end": 497.369,
    "text": "Did you guys have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.789,
    "end": 499.069,
    "text": "Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.91,
    "end": 512.033,
    "text": "Yeah, but I was going to suggest that the roadmap was a quote from the abstract, Subjective Concepts Pragmatically Applied, which I think deals with a lot of informational concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 512.173,
    "end": 514.874,
    "text": "And then, like you brought up, if you define self,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.313,
    "end": 542.127,
    "text": " spatially or genetically you're going to get some boundaries which may be relevant in certain situations but also might give a misleading or partial view of the total system and then the challenge is when we move to this informational or statistical theory of nested selves then organizations and their niches can have many different looking causes and components",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.927,
    "end": 562.869,
    "text": " so it's very challenging and it's not the org chart it's not the computer access chart it's something that's some how different and I think that'll be relevant to pull out what is being described and what should people's consideration be what do we actually gain by saying that systems are nested which isn't a novel insight",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.516,
    "end": 567.136,
    "text": " Yeah, that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.216,
    "end": 584.003,
    "text": "And, and then like, also, you know, in talking about that, like, you know, bi-directional information flow, like the, there's a certain amount of salience that has to be there also, like information can be flowing both directions, but if the information is irrelevant, then, then that's going to, you know, not, not be the cause for perseverance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.104,
    "end": 584.304,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.324,
    "end": 587.245,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.22,
    "end": 596.132,
    "text": " Okay, so here we are, strategic cognition, sensing, and sense-making, and just an early quote from this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.152,
    "end": 597.194,
    "text": "Do you want to read this, Tyler?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.214,
    "end": 597.574,
    "text": "Is that okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.263,
    "end": 601.004,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.024,
    "end": 620.936,
    "text": "Strategy, initiation, and formulation, defined as a complex activity consisting of scanning, sense-making, and strategic decision-making, are at the heart of the firm's collective interpretive power, emphasizing its core capabilities, timely and accurate reading of expected environmental change, and the corresponding need for resource reconfiguration and pursuit of adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.277,
    "end": 623.538,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.618,
    "end": 624.018,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.483,
    "end": 636.654,
    "text": " Okay, so strategic cognition, they used the definition presented in this paper, the cognitive perspective in strategy and integrated review, and they referenced this paper quite a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.734,
    "end": 643.82,
    "text": "So I just pulled out this diagram of strategic cognition and pulled up the definition that was used in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.261,
    "end": 647.784,
    "text": "So they say strategic cognition is discussed in terms of its constituents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.165,
    "end": 650.407,
    "text": " structure and process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.808,
    "end": 661.387,
    "text": "By structure, we refer to the relatively stable characteristics and repeated patterns of behavior and by process to the cognitive activities taking place in organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.55,
    "end": 677.18,
    "text": " Just to note on that, the focus in this book is on kind of a certain type of corporation with a board of directors, for example, which is an important category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 678.101,
    "end": 683.284,
    "text": "This, I'm also just imagining someone who is navigating spatially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.205,
    "end": 701.378,
    "text": " as part of like working in a taxi service also strategic cognition is coming into play though the wording might be framed a little differently but it's similar questions about sense making and just different implementations of different kinds of organizations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 703.817,
    "end": 711.243,
    "text": " And I wonder how strategy, in terms of this kind of strategic cognition, is related to the systems engineering approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.683,
    "end": 714.085,
    "text": "Is it aligned with that or maybe not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.785,
    "end": 717.667,
    "text": "That's something to be interesting to know more about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.687,
    "end": 719.789,
    "text": "Do you have any comments here, Tyler?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.809,
    "end": 731.635,
    "text": " Yeah, that's something that, to build on Daniel's point, like how specific what Bijan is talking about is to boards specifically versus other organizational structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.035,
    "end": 748.325,
    "text": "And just like a comment on that, my initial feelings on so far where we are in the book is that it's really not, I'm not seeing why we need to reduce the scope to just like organizations that have boards, especially since like most companies I've been in, a lot of the important decision making is really happening at the level of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.473,
    "end": 752.896,
    "text": " really more of the executives in the C-suite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.717,
    "end": 756.12,
    "text": "And Bhajan might argue like, hey, that's actually a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.16,
    "end": 758.203,
    "text": "It should be more coming from an active board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.084,
    "end": 765.252,
    "text": "But it's kind of interesting to see where are the limits of what Bhajan is talking about and how specific is it to a specific kind of organizational structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.519,
    "end": 788.484,
    "text": " or another angle is in the body the decisions are being made in a distributed nested way and so that kind of organization i think we'll read on to find will have resonance with this however who should the strategic communication and cutting edge research on the strategy governance upstream decision making",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.284,
    "end": 812.414,
    "text": " there's a very certain audience i think it makes sense to communicate that too and also this is the threads being linked for a first time in a dissertation style book and i could imagine different kinds of presentations and implementations being presented differently not necessarily like an academic published dissertation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.485,
    "end": 821.609,
    "text": " And that leads me to wonder, perhaps strategic cognition can take place at many levels in a hierarchical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.669,
    "end": 829.754,
    "text": "Like maybe an individual, like a project or a team is doing strategic cognition on the execution of their goals and tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.094,
    "end": 839.26,
    "text": "And that happens at the level of the individual and the team and the project and the department and then the firm and then the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.68,
    "end": 842.962,
    "text": "So perhaps it occurs in several places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.387,
    "end": 851.733,
    "text": " So, like, when I've been reading board, when Bajon says board, I read that as, like, counsel, and that's my, like, interpretation of that, and that can happen at many levels as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.635,
    "end": 855.716,
    "text": "I mean, like, when you say counsel, I think attorney.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.817,
    "end": 857.358,
    "text": "Like, why do we have lawyers involved?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.678,
    "end": 861.0,
    "text": "I mean, counsel is in, like, high counsel, supreme counsel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.548,
    "end": 865.229,
    "text": " All right, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.429,
    "end": 872.374,
    "text": "Okay, so sensing, I pulled this out to Tyler's, you know, protests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.715,
    "end": 893.791,
    "text": "I wanted to just maybe talk a little bit about sensing and sensemaking and talk a little bit about them separately, but they are sensing and sensing, sensing and sensing and sensemaking form one unitary act and together can be considered a non-operational cognitive meta capability or dynamic capability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.211,
    "end": 900.032,
    "text": " And this reminds me of the time that I asked Carl about like when I'm sensing, what am I sensing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.072,
    "end": 911.755,
    "text": "Like if I am I sensing like when I look at a red balloon, am I sensing red balloon or am I sensing like 700 nanometer wavelength of light and like round oval shape?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.795,
    "end": 915.055,
    "text": "Like what is actually being perceived via the senses?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.596,
    "end": 919.076,
    "text": "And so like there is actually and Carl answered me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.156,
    "end": 922.437,
    "text": "He said red balloon, like go away from the red light and go more toward the red balloon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.047,
    "end": 930.489,
    "text": " And so like that, that answer really says like, okay, there actually is not sensing without sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.529,
    "end": 940.553,
    "text": "Like they are inextricably linked because if I'm actually sensing red balloon, like then I'm actually like, I'm going beyond what like my eyes see or like what my nose smells or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.573,
    "end": 941.733,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.793,
    "end": 951.496,
    "text": "And effectively sensing and sensemaking is a form of organizational learning, action centric hypothesis testing that connects the individual level with that of the firm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.703,
    "end": 954.483,
    "text": " Do you guys have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.663,
    "end": 958.804,
    "text": "We can move on to sense-making or stay in sense-making maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.824,
    "end": 962.645,
    "text": "All right, Tyler, this is yours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.045,
    "end": 964.946,
    "text": "All right, sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.066,
    "end": 973.007,
    "text": "So purpose-goal-directedness, so the world's models, underlying prediction models, fundamental to sensing and sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.467,
    "end": 980.049,
    "text": "So dissonance is a function of a preset goal generating predictions and submitting those predictions to continuous error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.749,
    "end": 993.863,
    "text": " Sense-making models are constantly adjusted through error and deviation querying feedback loops, coupling top-down predictions and bottom-up stimuli, and circular causality is the sole objective in minimizing prediction errors and surprise, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.923,
    "end": 994.464,
    "text": "free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.025,
    "end": 998.648,
    "text": "Fundamentally, sense-making is about designing and noticing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.509,
    "end": 1022.123,
    "text": " um and so a quote that i really liked from the paper that um is actually from wake i'm not sure if i'm pronouncing that right is sense making is about how people deal with situations where there are too many or too few meanings um and this is something that i've experienced a lot especially in like startup contexts like you can think of it and they're actually kind of the same situation too many or too few meanings like if you're in a startup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.583,
    "end": 1046.841,
    "text": " and you're trying to figure out what you do next like your strategic directions are like kind of infinite because you haven't really built that many so like there's like all these things directions you can go things you're hearing in the ecosystem like oh look we did this look we did this and like that all could be meaningful but at the same time it all collapses into like what are we actually doing like are we even building anything right now like what's the point of any of this um and so a lot of how that kind of shows up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.922,
    "end": 1061.477,
    "text": " in your, like in the, for example, in a health context, I would show up in the body as kind of like illness or the feeling of agitation, anxiety, and you kind of have that same embodied feeling both in yourself and in the organization of like, hey, like what we're doing isn't working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.957,
    "end": 1064.04,
    "text": "We're having all of these like communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.561,
    "end": 1082.243,
    "text": " kind of issues where like the breakdowns where i'm not you're not receiving what i'm telling you that the information i'm telling you about problem isn't being received correctly and acted upon and this like boils up into becoming a bigger issue to where something needs to to happen and some action needs to be taken",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.164,
    "end": 1111.212,
    "text": " and so it's really like this social process not something that's like the ceo being like wow like let me like go in here and like figure out the root issue like a plumber would and then like tell you tell the organization what happened but it's more of this kind of like feeling of agitation that happens throughout the organ uh the organization and through the social process being like what is going on what are we doing people getting increasingly flustered uh something is birthed in that process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.892,
    "end": 1134.855,
    "text": " and something that i actually had like a personal realization when i was reading uh this chapter because i used to work as a strategy consultant and strategy consultant what i kind of realized about that job is that it's purely about sense making so a lot of times people think of strategy consultants as like oh you're doing like a complicated quantitative analysis you give that to the board of directors they make a decision super top down but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.976,
    "end": 1150.261,
    "text": " actually where we spent most of our time on was socialization like kind of talking to people like kind of knowing when we went into the organization like roughly what was going on in a certain way we would collect data kept talking to people but even when we like we're pretty sure we had the answer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.441,
    "end": 1175.569,
    "text": " most of the job was actually framing and communication and like talking to a bunch of people and using the language that they use and making sure that there's a shared narrative between everyone and so like that was where the real work is i was like oh that's interesting like management consultants are professional sense makers and i think a lot of times a lot of organizations are actually embedding management consultants within the organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.269,
    "end": 1187.007,
    "text": " as a way of like sense making as like a capability that an organization uh would have and so like an example of something i had as a management consultant where you kind of feel this dissonance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.895,
    "end": 1190.336,
    "text": " was I worked for a lot of health insurance companies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.977,
    "end": 1196.62,
    "text": "And so health insurance companies were having this problem where, well, at least in the US, skyrocketing healthcare costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.68,
    "end": 1199.401,
    "text": "And if you're a health insurance company, you're basically a payment processor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.521,
    "end": 1201.922,
    "text": "And so you don't really have any levers to fix that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.543,
    "end": 1208.186,
    "text": "And so there's this issue of like, okay, well, we need training costs, but we don't have any levers to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.046,
    "end": 1213.709,
    "text": "And so what that means is that you have to become more of a care manager to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.409,
    "end": 1237.456,
    "text": " and like that is a totally different way of like contextualizing like who you are both on the organization level and on the individual level of like what is my purpose here in this role in this organization was this organization trying to do and getting to the care management side like totally needs to shift that and so that shows up in the organization that's a lot of dissonance a lot of angst and also like a lot of pain um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.116,
    "end": 1263.352,
    "text": " and it ends up meaning that both the organization needs to change but also this individual needs to change themselves and how they relate to that organization and so that's why i like this cartoon of like i've been restructured it's like a lot of times it's like you are have to recontextualize yourself while so the organization is recontextualizing like what it's trying to do um so yeah i'll leave it there uh daniel and louis you have anything to add on the slide",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.548,
    "end": 1266.429,
    "text": " Well, that's very insightful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.99,
    "end": 1274.895,
    "text": "And it reminds me of the two ways that the entities can reduce free energy by changing their mind and changing the world through action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.755,
    "end": 1283.16,
    "text": "And this is an approach where we can describe that process happening at multiple nested and interacted levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.321,
    "end": 1286.783,
    "text": "And even if the niche changed around one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.294,
    "end": 1289.154,
    "text": " the world would be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.194,
    "end": 1290.715,
    "text": "The regime of attention would be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1291.335,
    "end": 1293.176,
    "text": "The action perception loop would be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.276,
    "end": 1298.018,
    "text": "And that would at the very least induce anxiety and uncertainty cognitively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1298.678,
    "end": 1300.579,
    "text": "So it's really interesting what you added.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1302.479,
    "end": 1305.1,
    "text": "And I just love your cartoon that you pulled out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1305.14,
    "end": 1305.5,
    "text": "It's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.641,
    "end": 1307.881,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.022,
    "end": 1312.283,
    "text": "So here is a claim from the book, from the chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.004,
    "end": 1318.53,
    "text": " On a more operational level, sense-making's very effectiveness is shaped by three critical dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.011,
    "end": 1322.034,
    "text": "First, the clarity of a timeless corporate purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.615,
    "end": 1328.481,
    "text": "Second, a dissonance-centric quest for and optimization of filtering anomalies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.222,
    "end": 1332.185,
    "text": "As anomalies become shared, sensibleness should become stronger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.334,
    "end": 1336.616,
    "text": " and C, an inactivist worldview, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.736,
    "end": 1344.78,
    "text": "environment is not exogenously predetermined, but is enacted through the social and action centric construction of shared meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.602,
    "end": 1350.583,
    "text": "And so like, let's talk about dissonance a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.405,
    "end": 1355.266,
    "text": "Going back to this quote, unless you guys have comments here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.306,
    "end": 1356.826,
    "text": "No, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.367,
    "end": 1357.507,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.723,
    "end": 1367.785,
    "text": " Fundamentally, firm-level sensing and sense-making, grounded in dissonance theory, are a social process rather than a singular activity dedicated to detecting anomalies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.865,
    "end": 1371.405,
    "text": "And I think that this goes back to what Tyler was actually just talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.165,
    "end": 1376.086,
    "text": "But I looked up the theory, and this is the citation that Bijan used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.786,
    "end": 1385.928,
    "text": "And in this text, Festinger says, in short, I'm proposing the dissonance that is the existence of non-fitting relations among cognitions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.568,
    "end": 1388.569,
    "text": " is a motivating factor in its own right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.989,
    "end": 1395.513,
    "text": "By the term cognition here and in the remainder of the book, I mean any knowledge, opinion, or belief about the environment, oneself, or one's behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.013,
    "end": 1407.699,
    "text": "Cognitive dissonance can be seen as an antecedent condition, which leads to activity oriented toward dissonance reduction, just as hunger leads to activity oriented toward hunger reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.354,
    "end": 1414.299,
    "text": " It is a very different motivation from what psychologists are used to dealing with, but as we shall see, nonetheless powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.56,
    "end": 1424.747,
    "text": "And so when we talk about sensing and sense-making being grounded in dissonance theory, this was something Tyler and I had discussed offline, back channel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.668,
    "end": 1435.396,
    "text": "We were talking about dissonance theory, and what we're interpreting this to mean here is that it is this disjoint activity, like a mismatch,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.077,
    "end": 1450.986,
    "text": " between maybe like individual and firm level cognition or firm level cognition and like societal expectations or anyway, like there's a gap that causes like a kind of discomfort that needs to then be filled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.886,
    "end": 1458.55,
    "text": "But I would be excited to hear maybe Bijan talk more about how it's grounded in dissonance theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.013,
    "end": 1466.963,
    "text": " just because it was kind of unclear from the text, like what exactly that might mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.983,
    "end": 1469.587,
    "text": "But if you guys have any comments here, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.629,
    "end": 1494.538,
    "text": " yeah um in active inference we might think about dissonance as being related to a divergence like a kl divergence and so dissonance isn't a state of exception and kind of a binary switch there's always some non-zero level of divergence between expectations and incoming sensory data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.258,
    "end": 1498.82,
    "text": " if only because the generative model is coarse grained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1499.24,
    "end": 1506.043,
    "text": "So in the decimal points, the world always is gonna be somewhat surprising or at least evaluatable in terms of surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.783,
    "end": 1524.01,
    "text": "So again, instead of centering, for example, absolute value attainment, and then seeing uncertainty as a secondary characteristic, we use divergence-based statistics to incorporate this idea of dissonance or divergence-driven",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.75,
    "end": 1550.911,
    "text": " behavior and put that at the center of the imperative for action yeah i i interpreted uh bijan's bring a dissonance theory as like way of bridging both the individual cognition to like the social cognition and like how the feeling of anxiety manifests in an organization and so like i think dissonance theory at least in this quote might be referring to the individual specifically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.771,
    "end": 1579.18,
    "text": " um and have that individual but anxiety of like hey I thought I was going to get a promotion this year I didn't get a promotion this year something is wrong or like hey we I worked really hard on this feature it didn't increase conversions in the way I thought it would that feels bad that's not motivating for me right that's like on the individual level but then you can there's another way you can interpret that dissonance on a more of like a social level as a way and like more of a social cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.138,
    "end": 1584.238,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.258,
    "end": 1585.3,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.061,
    "end": 1587.143,
    "text": "Non-uniformity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.864,
    "end": 1588.204,
    "text": "Tyler?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.307,
    "end": 1590.708,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.032,
    "end": 1593.372,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.392,
    "end": 1599.776,
    "text": "It's critical that the environment throughput, listening to what wants to emerge, is neither logic nor goal-trapped, but open to non-uniformity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.016,
    "end": 1604.499,
    "text": "In fact, the throughput of non-uniformity is a measure of firm survivability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.519,
    "end": 1617.827,
    "text": "Uncertainty and surprise are not to be avoided, but to be minimized through action and hypothesis testing-centric engagement with the world as the underlying world model consequently and generatively gains an informational edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.942,
    "end": 1632.675,
    "text": " And so we talked about this a little bit during the last book stream, but a lot of leaders want to imagine that they're like slowly ironing out non-uniformity and that like you're creating this perfect organizational design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.695,
    "end": 1636.438,
    "text": "And it's actually kind of funny, like there's this trap that a lot of leaders get into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.498,
    "end": 1638.62,
    "text": "And I've actually gone into this myself where like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.361,
    "end": 1641.223,
    "text": " it's kind of like utopia design almost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.504,
    "end": 1652.316,
    "text": "Actually, it's exactly the same thing as utopia design, where you're like, I'm going to have this model of where I'm going to, all these problems I perceive in the world, I'm just going to fix by just top down, just god mode figuring it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.376,
    "end": 1653.938,
    "text": "And then everything is going to be better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.978,
    "end": 1655.52,
    "text": "And we're not going to have to worry about anything anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.54,
    "end": 1656.12,
    "text": "It's going to be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.462,
    "end": 1664.567,
    "text": " And then like invariably, like your two weeks, you create a new org design, two weeks, and it works for like a week and people are excited about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.647,
    "end": 1669.59,
    "text": "And then like, you start seeing kind of ripples at the edge, you start like trying to patch things up and then it like all disintegrates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.052,
    "end": 1673.633,
    "text": "And then like, I think a lot of leaders are like, oh, like, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.744,
    "end": 1701.257,
    "text": " people we have the wrong people people aren't you know following process like I want them to right and it gets really frustrating um but I think even when it goes well it's just like you were missing out on kind of like how generative that non-uniformity can be uh and where basically like if people are too rigid in their process you're you're not carving out space for anything new um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.566,
    "end": 1712.975,
    "text": " And so the way that he talks about non-uniformity in this case is that you minimize it through kind of action oriented hypothesis testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.175,
    "end": 1714.976,
    "text": "You're not wallowing in this uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.996,
    "end": 1721.742,
    "text": "There's a way that you can capture that and take ownership over uncertainty and use it for something that's really beautiful and productive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.442,
    "end": 1747.953,
    "text": " um and so like for example you know i've had jobs where i was a product analyst and i worked for this like consumer logistics company where we like go into people's homes and like pack up all of their things so it's like a very very complicated job right and so we would have we would like figure things out like okay wow our um times for this kind of job in the city are going up a lot and we would see that in the data and we're like wow this is really inefficient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.633,
    "end": 1752.278,
    "text": " And that would manifest itself as some kind of anxiety or dissonance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.818,
    "end": 1757.764,
    "text": "And then we would start, we do analysis and we'd be like, oh, it's this kind of job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.824,
    "end": 1759.406,
    "text": "It's this kind of job with this kind of furniture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.707,
    "end": 1764.453,
    "text": "Then you talk to people, talk to some of these movers and you find out, oh, they don't have the right equipment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.253,
    "end": 1791.981,
    "text": " on this uh they don't have like this kind of wrench on these particular jobs they're like that's interesting then you socialize that that information figure out from operations that that wrench isn't consistently being returned and they're actually losing a lot of uh their equipment to be able to do that job then you find out like uh from other operational leaders that they're not being funded appropriately they don't have like discretional spending to be able to like actually pay for those kinds of that kind of equipment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.461,
    "end": 1809.658,
    "text": " right so it's like through that that anxiety you kind of like are action oriented and can figure out like hey like this is not something that the situation isn't totally screwed like we can actually keep moving forward and like testing figuring out like what's going on and taking action accordingly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.519,
    "end": 1836.546,
    "text": " it makes me think of pain and soreness and redness in the body like signals have to propagate in order for things to change and that could be in an allostatic or an anticipatory or in a reactive or in a traumatized way from the organism's perspective but the only way that we're going to find out about it is through this kind of like active perception",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.29,
    "end": 1851.083,
    "text": " individuals or nested levels above them making an action-oriented decision to like sense out different information and control attention which is actually seen as a policy selection over cognitive states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1857.799,
    "end": 1858.88,
    "text": " Sorry, my mouse was sticky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.921,
    "end": 1864.625,
    "text": "I am also reminded of biological systems, but maybe for a different reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.685,
    "end": 1870.01,
    "text": "So in biology, non-uniformity is critical to existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.851,
    "end": 1875.095,
    "text": "You have a system at equilibrium in a biological system, that's death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.316,
    "end": 1878.498,
    "text": "So this non-uniformity, and I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.859,
    "end": 1882.14,
    "text": " He even brings it up as critical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.2,
    "end": 1887.202,
    "text": "I don't know if I quoted it here, but he brings it up as critical to survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.242,
    "end": 1888.703,
    "text": "You have to have non-uniformity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.743,
    "end": 1892.444,
    "text": "If everything's the same, it's like dull, bored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.744,
    "end": 1896.026,
    "text": "It's so important to have variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.346,
    "end": 1898.967,
    "text": "Variety is the spice of life, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.947,
    "end": 1900.548,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.588,
    "end": 1901.948,
    "text": "All right, purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.688,
    "end": 1905.81,
    "text": "So purpose and goal-directedness, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.87,
    "end": 1908.551,
    "text": "the world model's underlying prediction model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.446,
    "end": 1912.047,
    "text": " is fundamental to sensing and sense-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.047,
    "end": 1915.728,
    "text": "And this is the world model's underlying model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.768,
    "end": 1918.549,
    "text": "So I just wanted to point that out that there's some nestedness going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.409,
    "end": 1926.511,
    "text": "Dissonance is a function of a preset goal, generating predictions and submitting those predictions to continuous error minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.752,
    "end": 1934.894,
    "text": "Environmental sensing and sense-making are nonsensical in the absence of having set the firm's existential purpose in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.414,
    "end": 1939.015,
    "text": "Purpose, not strategy, is the reason an organization exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.719,
    "end": 1944.341,
    "text": " its definition and articulation must be top management's first responsibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.601,
    "end": 1951.944,
    "text": "And this reminds me of our management organization in the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.424,
    "end": 1954.185,
    "text": "What is the purpose of the institute?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.025,
    "end": 1958.347,
    "text": "And just trying to kind of outline and highlight these key things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.567,
    "end": 1962.388,
    "text": "We can't have a strategy without having a goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.509,
    "end": 1965.189,
    "text": "What is that strategy trying to achieve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.249,
    "end": 1966.11,
    "text": "What is the point, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.09,
    "end": 1968.891,
    "text": "If you guys have comments here too, that'd be awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.247,
    "end": 1980.329,
    "text": " It's just that, is this meant to be a sentence in one language or another language, even in the same language or a formal language?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.169,
    "end": 1983.03,
    "text": "It will mean different things to different people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.17,
    "end": 1997.813,
    "text": "It'll be associated with different envelopes and portfolios of risk and positive or negative consequences also deemed positive and negative by a different worldview and contingent upon all these unknown unknowns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1998.573,
    "end": 2004.874,
    "text": " So I think amidst that is where we can explore a lot of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2006.158,
    "end": 2034.942,
    "text": " interesting experiences I'm sure and what has worked and what hasn't worked in the applied settings and then also start to synthesize it with the research on cognitive science and organizational cognition and that's I think what this book is about like moving beyond just recognizing that complexity and starting to apply active inference and propose free energy governance as an approach to step in here and be useful as well as grounded",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.202,
    "end": 2062.817,
    "text": " yeah just to add on that like i think i'm curious if john ever gets to a point in the book where he really gives some guidelines for thinking through how to design purpose more explicitly um because generally this is done extremely poorly even in like major corporations where they're like our purpose is like bringing smiles to our consumers or something like something just like super big and big use that like actually doesn't really help you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.377,
    "end": 2084.048,
    "text": " at all it's more of actually like a branding exercise um and more like a corporate social responsibility maybe not really anything about like purpose and when purpose is done well it's really more like i mean you guys might disagree with this this definition but like i think it's kind of more like a heuristic it's like a decision rule of like we do this and not this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.968,
    "end": 2091.413,
    "text": " And it's a way of collapsing information and just being like, let's not think through everything we could possibly be doing right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.473,
    "end": 2092.694,
    "text": "We already decided this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.055,
    "end": 2093.875,
    "text": "This is what we're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.915,
    "end": 2096.557,
    "text": "And it's a way to not think about things too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.538,
    "end": 2101.661,
    "text": "And so I found this to be especially important in decentralized context as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.162,
    "end": 2112.029,
    "text": " And I think this is kind of what free energy governance is getting towards is like where you have more bottoms up stimuli that you're processing and changing like these top down models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.449,
    "end": 2126.099,
    "text": "And it's really important in that context because you can't be managing everybody like really intensely like this is exactly what you have to do, but rather you have to give a decision rule that a decentralized group of people can use independently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.799,
    "end": 2143.355,
    "text": " um so especially as we get into more like a free energy governance kind of world like purpose is super important but like daniel touched on like it's not always totally clear what like a good purpose even looks like and i hope john has a very crisp answer later on for what good purpose is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.134,
    "end": 2148.377,
    "text": " So here I am, the non-business person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.678,
    "end": 2158.488,
    "text": "And Tyler, you said you don't read business books, but I've read more than I ever wanted to read, just in my own little startup side venture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.429,
    "end": 2166.116,
    "text": "But I read Jim Collins' Good to Great book, and he really talks about purpose is really as defining what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.576,
    "end": 2167.997,
    "text": " you do and what you don't do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.117,
    "end": 2170.777,
    "text": "And he really, I mean, it kind of affronted me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.518,
    "end": 2173.598,
    "text": "He talks about the fox versus the hedgehog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.559,
    "end": 2177.54,
    "text": "The fox does lots of things very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.56,
    "end": 2179.641,
    "text": "He's very clever and can do many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.941,
    "end": 2182.041,
    "text": "And the hedgehog only has one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.121,
    "end": 2182.822,
    "text": "They do one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.522,
    "end": 2183.802,
    "text": "That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.842,
    "end": 2185.342,
    "text": "They roll up into a ball, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.362,
    "end": 2186.703,
    "text": "That's all a hedgehog ever does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.143,
    "end": 2193.144,
    "text": " And so like in this Fox hedgehog analogy, like as a company, he says, you want to be a hedgehog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.164,
    "end": 2207.768,
    "text": "And I'm like, but, but I want to do so many different things, but, but really that having, especially like when I think about a decentralized thing, like we do one thing, like, I don't know, he talked about like many different companies, but, but like, you know, Wells Fargo as a bank was a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.828,
    "end": 2208.268,
    "text": "Like we.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.088,
    "end": 2211.77,
    "text": " are creating the best bank in the United States of America.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.81,
    "end": 2212.811,
    "text": "We're never banking outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.211,
    "end": 2216.073,
    "text": "And like, maybe it started regionally and expanded a little bit or even Southwest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.113,
    "end": 2217.734,
    "text": "We are only going to fly in the Southwest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.814,
    "end": 2224.199,
    "text": "Like they just defined one thing that they were good at, that they could just be better than everybody else at and just ran with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.279,
    "end": 2228.382,
    "text": "And that is kind of like one of the defining factors of a great company in his view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.491,
    "end": 2230.351,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.431,
    "end": 2233.872,
    "text": "To build on that a little bit, it's been a long time since I read Good to Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.212,
    "end": 2243.474,
    "text": "But Jim Collins is kind of like the prototypical top down or what some would call an orange style of management, where it's very achievement oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.494,
    "end": 2251.636,
    "text": "It's very much about the CEO as being the hero, forcing their way and telling the organization what to do and focusing everybody really intensely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.236,
    "end": 2270.349,
    "text": " and so when you talk about the fox and the hedgehog like it's interesting he says you want to be the hedgehog because usually when i hear people talk about the fox and the hedgehog it's like you don't want to be the hedgehog like forcing everything into your narrow world model um and so i think when he says be the hedgehog it's really coming from this top-down perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.709,
    "end": 2277.234,
    "text": " And it's really not getting into the free energy governance model of where ideally you want to be both the fox and the hedgehog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.375,
    "end": 2284.721,
    "text": "Where you really want to have a unified world model that you're like, hey, this world model is not true, by the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.941,
    "end": 2290.986,
    "text": "We all know that this is subject to change and we're going to be actively changing this, but we all have to be on the same page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.006,
    "end": 2299.373,
    "text": "And so we're going to have this somewhat arbitrary belief of what our purpose is, that we're going to continuously evolve over time in a fox like manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.813,
    "end": 2320.583,
    "text": " and so it's like that's a really hard thing to communicate uh and it's like very subtle and i've tried to communicate this in the past often and effectively um and so yeah i'm really curious if there's like ways to you know better combine that fox and hedgehog you know model so like totally now we're spinning out on a tangent but i just have to say like i don't know like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.91,
    "end": 2323.511,
    "text": " I get the whole fox thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.591,
    "end": 2331.095,
    "text": "I am very much aligned mentally with how a fox type of behavior, because I'm just like, oh, squirrel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.916,
    "end": 2332.556,
    "text": "Let me go chase that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.156,
    "end": 2340.56,
    "text": "But the hedgehog thing, I was thinking, okay, do you really want to be a fox and a hedgehog, or do you want to be multiple hedgehogs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.12,
    "end": 2349.085,
    "text": "I had this vision of dropping water on the hedgehog, like the little gremlins, and you drop the water and then they multiply, and then you have a little field of hedgehogs that are all doing...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.866,
    "end": 2353.714,
    "text": " many different things in a very great way, but all siloed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.774,
    "end": 2354.977,
    "text": "And, you know, they're one little thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.678,
    "end": 2355.879,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.219,
    "end": 2357.302,
    "text": "We have to, we have to go on earth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.883,
    "end": 2359.547,
    "text": "We can talk about gremlins all day long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.732,
    "end": 2367.055,
    "text": " Well, so for heuristics, I mean, this actually fits into purpose because you could think of purpose like as a heuristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.315,
    "end": 2369.536,
    "text": "And I'm not sure if John would agree with that, but that's how I think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.816,
    "end": 2386.044,
    "text": "And so Reed, at least a few, his definition was cognitive heuristics are a form of cognitive simplification or rules of thumb and tools that empower the human mind with what the poet John Keats called negative capability, the ability to survive and thrive in uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.064,
    "end": 2411.612,
    "text": " um and so yeah there's just a way of like collapsing information overload and finding a way forward despite like not having the ability to process everything at the same time um but then you know bajan goes on later to say that heuristics are fundamentally anchored in world view of environmental adaptation rather than enactment so resolving uncertainty is rather treated as a matter of adaptation to an exogenously determined game this book rejects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.892,
    "end": 2419.536,
    "text": " environmental adaptation as a viable survival strategy in a perpetually discontinuous one-shot interactions environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.696,
    "end": 2429.4,
    "text": " And so to just like illustrate this a little bit so that, you know, obviously I think we could all understand like a heuristic may not be very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.5,
    "end": 2442.707,
    "text": "You could use the wrong heuristic and have, you know, but just like to make this more concrete about like how heuristics can be confusing is that here are like two like really common heuristics for financial planning, especially in the context of startups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.247,
    "end": 2445.829,
    "text": "So one is called Default Alive, and this was from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.21,
    "end": 2449.533,
    "text": " Paul Graham is the founder of Y Combinator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.234,
    "end": 2458.324,
    "text": "And so he says, okay, a company should cut costs such that if you assume constant revenue growth, the company is going to make it a profitability with the money it has left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.905,
    "end": 2464.413,
    "text": "And so that totally makes sense, especially in a startup context for extreme uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.583,
    "end": 2469.808,
    "text": " But then there's like another decision rule, which is more about expected value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.349,
    "end": 2479.62,
    "text": "So a company should choose the financial decision with the highest expected value, expected payoff of outcome X, or an outcome times the likelihood of the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.041,
    "end": 2481.422,
    "text": "And so these aren't like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.163,
    "end": 2502.142,
    "text": " necessarily incompatible um well like they can be complementary to each other but they could tell you to do very different things uh especially if like an expected value of like hey we can crater the business right now is like a 10 likelihood but we can also have or a 90 likelihood but 10 likelihood we make a you know 100 billion dollar company right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.882,
    "end": 2529.842,
    "text": " um and so like that would lead you to do a different thing than default alive and so a lot of times business leaders are like juggling both of these at the same time and not necessarily like realizing that they are contradictory heuristics and that they are there are limits their heuristics um so yeah i'll leave it there i think actually a couple other things that he says to you are that like you know simple heuristics can outperform more complicated ones as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.962,
    "end": 2546.254,
    "text": " And it's like actually not even clear on an organizational level how effective heuristics are, because a lot of times when they do studies on heuristics with individuals where everything is, there are not other intelligent actors who are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.034,
    "end": 2569.037,
    "text": " making anticipations about your strategy whereas in like a a business setting there are and so to take like a very simple example of this like with design there's for a long time was this movement of like the heuristic for design was like oh everything needs to be super legible and clean um and like you would use like helvetica 16 point font like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.577,
    "end": 2590.353,
    "text": " really like we want this to be clear and we want information hierarchy and like that matters far and above everything else but then the problem is that everyone was doing that and it got really monotonous and so the actual optimal strategy in that case was to design something totally wacky and insane and so over the last three years there was like this especially with the web3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.394,
    "end": 2616.825,
    "text": " just like absurd like looked like they were like geocities pages from the 90s where it was like looked awful and it was like not accessible and it was gross but it was really interesting to look at um and they were using fonts that were totally unreadable but it was interesting and it was this competitive situation where like the obvious heuristic but in a competitive situation made the optimal strategy doing the opposite of that heuristic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.911,
    "end": 2619.932,
    "text": " Oh, just a few notes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.972,
    "end": 2621.493,
    "text": "There's so many great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.813,
    "end": 2631.62,
    "text": "One is the game theory Elferal bar problem where there's a bar and you want to go if it's under half full, but not over half full.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2631.64,
    "end": 2632.28,
    "text": "It's not fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2632.32,
    "end": 2633.121,
    "text": "You can't get a drink.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.761,
    "end": 2648.251,
    "text": "And it turns out that that's like an unwinnable game because if you go, well, if it was busy yesterday or if it was busy three nights ago, all decision rules, if you just hold to them, get adapted around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.151,
    "end": 2667.676,
    "text": " and i think then that's a very interesting light to reject environmental adaptation as a strategy position of the book because i think adapting to the environment sounds like something biological it sounds like something that would be successful organizationally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.533,
    "end": 2679.707,
    "text": " And then I think that will also lead us to some discussions of how does the free energy minimization imperative transcend the default alive expected value dialectic?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.727,
    "end": 2686.576,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.816,
    "end": 2687.137,
    "text": "Vuka?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.078,
    "end": 2699.14,
    "text": " all right VUCA so this is an acronym for volatility uncertainty complexity uh and ambiguity start for some background noise right now by the way um so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.658,
    "end": 2701.978,
    "text": " I'm just going to read a quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.998,
    "end": 2706.699,
    "text": "This is actually a full disclosure from my aunt, who's a leadership and organizational design consultant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.119,
    "end": 2717.661,
    "text": "She wrote this post called Intrepid Explorers in VUCA Territory, and I really liked how she framed this, where most of us in the West were trained in the professional model that prized expertise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.101,
    "end": 2720.661,
    "text": "Today, being an expert and a specialist is not enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.821,
    "end": 2730.123,
    "text": "And worse, it can make you part of the problem because today we are dealing with the frontiers of humanity, a place where no one has been and no one could possibly be a content expert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.763,
    "end": 2738.71,
    "text": " And so what I really like about this is that we're entering this world that is increasingly volatile, increasingly ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.13,
    "end": 2747.498,
    "text": "But at the same time, that really runs up against how we're individually motivated as professionals, where a lot of us really want to get good at a thing and have mastery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.418,
    "end": 2769.504,
    "text": " and it really like requires handling this uncertainty complexity that volatility is like a personal discipline as well as an organizational discipline as far as like that personal resilience and handling that uncertainty and complexity is what is going to make the organization uh resilient and that's actually quite hard to build it's a very rare skill set um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.79,
    "end": 2780.554,
    "text": " And a lot of it's about, you know, one, and I really like how this graph frame this of like, how well can you predict your actions and how much do you know about the situation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.094,
    "end": 2787.317,
    "text": "And like on both of those axes, it's becoming increasingly so that you know very little about the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.697,
    "end": 2791.279,
    "text": "You really can't predict your actions and like the ability for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.54,
    "end": 2798.523,
    "text": " for expertise to really navigate through that is difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.764,
    "end": 2799.664,
    "text": "It's much less effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.724,
    "end": 2803.487,
    "text": "It's much more about cross-functional collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.747,
    "end": 2806.428,
    "text": "Daniel and Blue, did you want to take anything on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.49,
    "end": 2809.791,
    "text": "Cool."
  },
  {
    "start": 2811.271,
    "end": 2811.532,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.712,
    "end": 2813.593,
    "text": "I'm going to read this claim from the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.233,
    "end": 2818.316,
    "text": "Generative processes of top-down, bottom-up hypothesis testing, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.356,
    "end": 2819.817,
    "text": "prediction error minimization,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.319,
    "end": 2826.242,
    "text": " rather than top-down rule-based simplification are guiding the path to navigating a discontinuous world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.742,
    "end": 2827.963,
    "text": "I'm just going to read these yellow parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.203,
    "end": 2832.244,
    "text": "In fact, rather tame uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.825,
    "end": 2834.886,
    "text": "In fact, heuristics rather tame uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2834.946,
    "end": 2843.97,
    "text": "Heuristics reinforce dominant logics in the form of pattern recognition and tend to disregard dissonant bottom-up stimuli as noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.85,
    "end": 2848.372,
    "text": "In fact, heuristics may reinforce the phenomenon of deliberate ignorance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.099,
    "end": 2854.823,
    "text": " And tame curiosity is information enriching drive as a foundation for prediction error minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2855.723,
    "end": 2867.971,
    "text": "I really liked this quote from the book and thought that it kind of maybe sums up like the argument against heuristics and also this top down, bottom up circular causality that we've been discussing through the chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.972,
    "end": 2869.252,
    "text": "Danielle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.276,
    "end": 2876.18,
    "text": " A little bit uncertain about heuristics for information enrichment and epistemic drive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.941,
    "end": 2879.183,
    "text": "Can that be a heuristic?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.804,
    "end": 2882.405,
    "text": "If so, would that close the loop?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.586,
    "end": 2885.267,
    "text": "So that's like the reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.287,
    "end": 2891.451,
    "text": "I mean, we've had this discussion many times, like, you know, the epistemic and pragmatic value when you knock out one side of the equation, what do you have left?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.531,
    "end": 2895.594,
    "text": "And so, yeah, can your heuristic merely be info sampling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.955,
    "end": 2897.736,
    "text": "I think that that's probably fair, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.528,
    "end": 2900.75,
    "text": " A subtle technical detail, probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.291,
    "end": 2903.492,
    "text": "Tyler, cognitive maps?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.512,
    "end": 2904.392,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.633,
    "end": 2913.919,
    "text": "Cognitive maps are closely related to heuristics and can be considered the potent form of visualizing sense-making in form of graphic representations that locate people in relation to their information environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.12,
    "end": 2918.963,
    "text": "Maps provide a frame of reference for what is known and what is believed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.106,
    "end": 2940.363,
    "text": " um so you know i've actually made a a lot of cognitive maps myself on various consulting projects and what's kind of funny about cognitive maps is that they're actually really useful to make as like the person who is making them like as you go through the process of making a cognitive map you feel like oh like i understand the complexity of this organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.384,
    "end": 2965.647,
    "text": " um pretty well at this point i can actually like hold it all in my mind at one time uh but the problem with that is that oh there's two problems one is that no one has understands your cognitive map at all it's only useful to you uh and then the other problem is that it it basically immediately becomes outdated and does not reflect how the organization actually actually works uh and so even like a month two months later it's like completely useless even to yourself um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.668,
    "end": 2975.295,
    "text": " John has a good quote of this where he really says that this cognitive map isn't really useful for the purposes of free energy governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.655,
    "end": 2986.343,
    "text": "So he says, cognitive mapping is representative of the deterministic view of the world akin to a physical cause and effect chain, and should be considered rather anti-clocked in the face of discontinuous market environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.924,
    "end": 2991.807,
    "text": "So yeah, it's really not something that you're going to be able to fully map out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.148,
    "end": 2997.389,
    "text": " how governance works or how an organization works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.469,
    "end": 3008.871,
    "text": "This is actually something that I'm thinking a lot about for the past couple of months in the context of DAOs of like, can you model the flow of value and power completely within an organization as code?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.711,
    "end": 3012.691,
    "text": "And I think what Dajon would say is probably not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.711,
    "end": 3017.312,
    "text": "It's not fully like this deterministic model of cause and effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.712,
    "end": 3023.033,
    "text": "It's really something more of a social process that's a little bit more ambiguous and fluffy and hard to nail down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.877,
    "end": 3025.684,
    "text": " Daniel, Louis, do you have anything to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.234,
    "end": 3033.919,
    "text": " So like on the one hand, I don't know, like cognitive maps, like when I was taught about them in college, they made no sense to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.939,
    "end": 3034.399,
    "text": "I hated them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.439,
    "end": 3036.08,
    "text": "I was like, this is the dumbest thing I've ever heard of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.501,
    "end": 3045.368,
    "text": "But then like when you get into process flow, like in writing code and in like system design, they kind of like make sense, like an experimental design chart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.508,
    "end": 3049.311,
    "text": "So I don't know, I'm back and forth on the, can you read your own cognitive map?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.411,
    "end": 3054.395,
    "text": "Sometimes, like if you can't, I would argue that if you can't read your own cognitive map, that it's not a good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.776,
    "end": 3055.136,
    "text": "How about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.461,
    "end": 3057.801,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.822,
    "end": 3060.082,
    "text": "Claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.262,
    "end": 3060.482,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.742,
    "end": 3077.228,
    "text": "It is neuroscience's predictive coding that allows us to take management research's sensemaking perspective, as well as nexus of structure and cognition, one step further to provide a more complete and relevant framework for applying sensing and sensemaking in the context of strategic renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.688,
    "end": 3089.695,
    "text": " Effectively, sensing and sensemaking are empowered by the circular causality between top-down knowledge structures, prediction models, predictions, hypotheses, and guesses, and bottom-up stimuli data stemming from resource markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.475,
    "end": 3092.556,
    "text": "I just thought it was important to include this claim here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.576,
    "end": 3096.138,
    "text": "I feel like it sums up a lot of what is written in this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.158,
    "end": 3097.679,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.405,
    "end": 3101.708,
    "text": " So we'll talk a little bit about abductive reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.728,
    "end": 3115.558,
    "text": "And this picture on the left shows like inductive reasoning, which is like when you have a specific observation, you come to a general conclusion about that specific observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.559,
    "end": 3127.787,
    "text": "Like if you see, you know, three men wearing white shirts in a room and then you might say like, oh, all the men wear white shirts, but it might just be a coincidence, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.456,
    "end": 3141.131,
    "text": " Um, and then like deductive reasoning, um, where you have a general rule and you come to a specific conclusion, like, you know, all the men have to be wearing white shirts in this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.69,
    "end": 3144.912,
    "text": " And so you conclude that the men in this room will be wearing white shirts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.592,
    "end": 3147.453,
    "text": "So that's a deductive reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.793,
    "end": 3157.358,
    "text": "And then you have this abductive reasoning, where you have this incomplete observation, where you see some of the men in the room wearing white shirts, and you don't know anything about the rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.198,
    "end": 3162.28,
    "text": "And so you have this incomplete observation, and you make your best prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.727,
    "end": 3169.234,
    "text": " Like, oh, I guess some percentage of the men here like to wear white or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.575,
    "end": 3173.081,
    "text": "So this incomplete observation coming to this best prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.361,
    "end": 3177.508,
    "text": "I probably did a horrible job at specific examples, but those were just like, sorry, off the top of my head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.743,
    "end": 3181.165,
    "text": " So that's like this reasoning logic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.625,
    "end": 3187.909,
    "text": "And a quote from the text, abductive reasoning usually begins with a surprising observation or experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.369,
    "end": 3193.852,
    "text": "This is what shatters our habit and motivates us to create a hypothesis that might resolve the anomaly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.333,
    "end": 3204.939,
    "text": "Abduction is an inferential procedure in which we create a conjecture that, if it were, would make the surprising anomaly part of our normal understanding of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.799,
    "end": 3210.323,
    "text": " So I liked this idea of linking abduction to surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.063,
    "end": 3219.07,
    "text": "And I just wanted to point out the, the live stream number 47 about active inference and abduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.271,
    "end": 3222.733,
    "text": "And we discussed more than one paper in this live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.833,
    "end": 3229.538,
    "text": "So just to read a quick quote from this specific paper, this paper it's a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.302,
    "end": 3234.144,
    "text": " Piatarnan, I probably butchered that, and Majid Beni.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.465,
    "end": 3236.486,
    "text": "And I think Majid was on that stream with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.626,
    "end": 3247.953,
    "text": "And this paper says, the focus is on the allegiance between the nomenclatures of active and abductive inferences as the proper place to begin reaching at the wider target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.373,
    "end": 3256.658,
    "text": "The paper outlines key conceptual elements involved in a naturalistic rendering of Pierce's late semiotic and logical notion of abductive reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.393,
    "end": 3268.358,
    "text": " and targeting a cognitive biological model of abduction, which preserves the functional integrity of an organism and fulfills existential imperative for living beings' evidence of existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.298,
    "end": 3275.48,
    "text": "And this paper was awesome, like totally mind blowing, and I can't do it justice in like, you know, the five minutes or whatever time we have here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.52,
    "end": 3281.843,
    "text": "So if you want to learn more about abduction and the relationship to active inference, I suggest go check out this live stream or read this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.465,
    "end": 3311.001,
    "text": " unless you guys have comments here we can move on forward yes one comment on that is that like i found it really challenging often to like in an organizational context to toggle between inductive deductive and abductive reasoning where it's like a lot of times people get confused which kind of reasoning you're actually using and if you do something that is kind of more abductive like hey like here's what i'm seeing here's my best guess like throwing things at the wall like then you get trapped into these things like well how do you really know that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.741,
    "end": 3338.728,
    "text": " that's true you're like yeah like that's the point like i don't like i don't know that's true but like we're like really just trying to like this is a creative act we're doing together of like trying to come up with some hypothesis um i've just like this is a really specialized skill set and it's like quite hard so yeah and funny in the book i don't think we pulled this quote out i almost did but i was like i'll leave it be but like bajan i don't know if he's quoting someone else or he just says like you know abductive reasoning it's like any hypothesis is good enough",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.79,
    "end": 3343.612,
    "text": " whatever, like, like, so it's just kind of like, you know, I don't know, shooting arrows in the dark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.912,
    "end": 3345.472,
    "text": "It kind of made it sound like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.512,
    "end": 3350.074,
    "text": "But but there actually can be quite a bit of art and science to abductive reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.094,
    "end": 3353.476,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.516,
    "end": 3367.201,
    "text": "So john lays out a few different frameworks for thinking about collective sensemaking, and specifically, like how you connect different levels of the hierarchy together, like since we get one of the individual and like, you know, leveling that up through organizational sensemaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.062,
    "end": 3368.302,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.102,
    "end": 3386.901,
    "text": " he talks about these like six different models of collective sense making and wasn't necessarily saying like hey i am fully behind each one of these but he's more just talking about like prior work and um how to think about like the gaps and how they line up to free energy governance so let's go through each one of them right the four eye model um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.899,
    "end": 3394.848,
    "text": " So the four I models, this is the intuiting, interpreting, integrating and institutionalizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.968,
    "end": 3403.239,
    "text": "And so this is really thinking about how sense thinking flows through the individual level and then bubbles up through different levels of socialization up into institutionalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.06,
    "end": 3425.576,
    "text": " uh so crossings for i model including interpreting integrating and institutionalizing as applied to the context of strategic renewal provides a framework for the process of transmorphing individual sensing and sense making cognition to firm level strategic action intuiting and interpreting a hypothesis starts at the individual level and subsequently the interpretation sense making process becomes centralized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.116,
    "end": 3430.539,
    "text": " integrated and institutionalized at the firm level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.32,
    "end": 3435.202,
    "text": "And so this whole process is goal directed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.262,
    "end": 3442.907,
    "text": "It's not just taking bombs up stimuli and then somehow magically transforming it into institutional processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.248,
    "end": 3453.414,
    "text": "It is really goal directed and hypothesis driven of really inactive and saying, hey, this is what we believe about the world and seeing it is actually the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.368,
    "end": 3473.698,
    "text": " And I think John has an interesting point about the score model that like a lot of times organizations really don't view themselves as being active creators of their of their world are really especially when in context of like the board views themselves as more passive receptacles of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.718,
    "end": 3483.164,
    "text": "And so this whole process of sense making from the individual level to the organizational level is really like an active process for it, especially driven by the board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.343,
    "end": 3486.404,
    "text": " Blue or Daniel, do you have anything to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.666,
    "end": 3491.408,
    "text": "All right, tension-based view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.008,
    "end": 3499.713,
    "text": "So tension-based view, this is another model that is similarly connecting both the individual level of cognition to the institutional level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.013,
    "end": 3502.715,
    "text": "It just has like a different spit on it and different emphasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.235,
    "end": 3505.017,
    "text": "And so in this model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.977,
    "end": 3525.83,
    "text": " the idea is that you need attention to make decisions right like you need to put some focus and energy to make a decision but individuals and consequently firms have limited attention right so like this is just like this fundamental constraint on your ability to make decisions is that you just don't have the time or energy to devote to every single decision um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.92,
    "end": 3550.188,
    "text": " and so you know your individual cognition is constrained and because your individual cognition is constrained uh so your social cognition and like that social cognition is shaped by different factors that is like social factors cultural factors economic factors and that social cognition those forces that shape like situational contacts that shape your social social cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.948,
    "end": 3572.754,
    "text": " those manifests and are institutionalized in the organizational cognition and that is like rules the positions the players and the resources so if you guys are familiar with like Eleanor Ostrom's model of like thinking about um kind of how common resource organizations develop it's kind of like the same exact framework that she uses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.966,
    "end": 3583.629,
    "text": " So this is really, this is very consistent with free energy governance, though it doesn't really capture like that inactive process of reality construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.029,
    "end": 3588.67,
    "text": "It's much more about just like thinking about attention and how that bubbles up through different levels of the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.231,
    "end": 3592.311,
    "text": "Blue Daniel, anything out here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.772,
    "end": 3595.332,
    "text": "All right, dynamic capability view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.983,
    "end": 3605.808,
    "text": " So the aim of dynamic capabilities research is ambitious to understand how firms can sustain a competitive advantage by responding to and creating environmental change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.088,
    "end": 3613.352,
    "text": "This is from HALPAT, who is one of the main proponents of this type of dynamic capability view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.993,
    "end": 3622.457,
    "text": "They also go on to say that dynamic capabilities are the capacity of the organization to purposefully create, extend, and modify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.278,
    "end": 3624.018,
    "text": "It's resource-based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.439,
    "end": 3634.042,
    "text": " So this is very consistent with how I learned about organizational design and evolution in a business school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.383,
    "end": 3640.985,
    "text": "It's much more about, hey, we have these kinds of resources, kind of like a Settlers of Catan model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.005,
    "end": 3648.048,
    "text": "We have these resources and these constraints in our environment, and this is how we can extend that resource base and grow over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.708,
    "end": 3652.149,
    "text": "And it has a little more of a deterministic bent to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.67,
    "end": 3681.49,
    "text": " and it's about like how you survive in a quickly changing environment so in that sense it's like similar to free energy governance uh but it's really more about like strategic change it's not really about like the individual cognition like it doesn't really talk much about individual cognition um at all so it's like missing it's like an interesting like theoretical framework but it's not really uh as embodied as free energy governance and as like um is missing that relationship to the individual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.675,
    "end": 3685.796,
    "text": " Blue, Daniel, want to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.137,
    "end": 3687.417,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.157,
    "end": 3688.737,
    "text": "OKRs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.338,
    "end": 3693.48,
    "text": "So OKRs are objectives and key results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.5,
    "end": 3698.983,
    "text": "So the idea here is that you have a main... So every single level of the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.283,
    "end": 3704.866,
    "text": "So let's say that your company, top level of the hierarchy is like... I will just use this example on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3705.286,
    "end": 3706.907,
    "text": "You want to... You're the head of the brand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.027,
    "end": 3708.868,
    "text": "You want to get 1,000 new signups, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.908,
    "end": 3711.63,
    "text": "That is your objective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.041,
    "end": 3715.124,
    "text": " Or your objective is increasing brain activations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.204,
    "end": 3719.431,
    "text": "And the key result, like the quantitative way you measure that, is get 1,000 new signups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.791,
    "end": 3721.254,
    "text": "So that's at the top level of the organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.294,
    "end": 3726.822,
    "text": "And then in each level of the hierarchy below that, you have the subcomponents that would need to be true to get 1,000 new signups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.065,
    "end": 3749.827,
    "text": " so the things that would need to be true to get a thousand new signups are that uh well one you have to on the head of content you have to get your click-through rate above some threshold implement 10 12 new mediums post old or new content on the partnership side you have to get 10 000 event registrants uh by sunday right sorry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.665,
    "end": 3760.82,
    "text": " So it's basically a way of thinking about like how goals cascade from the top level of the organization and filter down through the other level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.721,
    "end": 3762.463,
    "text": "Jesus Christ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.565,
    "end": 3764.046,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3765.916,
    "end": 3766.557,
    "text": " Very persistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.898,
    "end": 3772.181,
    "text": "And so this is actually really popular in a tech world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.122,
    "end": 3774.764,
    "text": "This is pioneered by John Doerr.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.164,
    "end": 3779.047,
    "text": "Larry Page wrote this book called Measure What Matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.228,
    "end": 3783.992,
    "text": "It's about a quantitative way of thinking about organizational design and goal setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.023,
    "end": 3788.926,
    "text": " And so I've actually done this a lot at different organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.607,
    "end": 3790.988,
    "text": "And it can be powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.008,
    "end": 3792.269,
    "text": "And I think Bhajan really likes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.249,
    "end": 3804.238,
    "text": "He says, OK, ours have proven to be an invaluable and dynamic tool to foster informal exchanges at the field level of resource markets approximating self-organization, because each level of the hierarchy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.918,
    "end": 3829.064,
    "text": " is has the responsibility for themselves to set their own okr that aligns with the next level of the hierarchy right so it can be like really dynamic that and uh have that self-organ organizing quality however a problem with it and this is not something that jean brought up is something from my own experience is that like especially in a startup context things are moving so quickly that okrs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.124,
    "end": 3833.287,
    "text": " very, very often become outdated pretty much immediately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.728,
    "end": 3837.211,
    "text": "And so you'll set an OKR for a quarter, and then you're a month down the line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.251,
    "end": 3838.692,
    "text": "And so much has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.712,
    "end": 3843.296,
    "text": "The context is so different that this OKR obviously doesn't matter anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.977,
    "end": 3845.559,
    "text": "And that's a huge problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.599,
    "end": 3848.721,
    "text": "And so you need some way of changing your OKRs dynamically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.761,
    "end": 3854.226,
    "text": "But the problem is that OKRs take a lot of work to set up and to socialize and to measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.247,
    "end": 3859.251,
    "text": " And so then you really don't have the resources necessarily to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.451,
    "end": 3861.152,
    "text": "And that is a huge challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.993,
    "end": 3874.403,
    "text": "There's also huge issues with doing OKRs in that it's like some version of good arts law where when your measure becomes a target, it ceases to be a good measure, whereas these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.123,
    "end": 3892.037,
    "text": " different levels of the organization can over optimize for some like arbitrary metric that they need to get a promotion which sometimes that can be aligned with the organization but like in quickly changing environments it can become quickly not aligned with the organization actually needs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.797,
    "end": 3918.318,
    "text": " so there's like a lot of pushback for okrs right now it's unclear like i think there there's probably some formulation of okrs that's more dynamic and more responsive to bottom-up stimuli um but they they can be really hard to operationalize but theoretically amazing way of connecting different levels of the words jesus christ all right different levels of the organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.483,
    "end": 3922.559,
    "text": " All right, let's go to the next one, collaborative intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.474,
    "end": 3951.588,
    "text": " All right, so the drive for self-organizing mechanisms gradually moved from employee empowerment and collective intelligence in form of crowdsourcing, deploying the power of information technologies to tap into the collective knowledge base, to collaborative intelligence, CQ, emphasizing the need for a shift in the leadership model from having all the answers to raising the right questions, as digital tools are increasingly deployed to enable goal-directed intelligence deliberations in distributed multi-intelligence systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.877,
    "end": 3968.684,
    "text": " And so to think about what this actually means in practice, oftentimes it's not the case where it's like you have some really huge robust system where every person in the organization is seamlessly sharing their insights and their data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.724,
    "end": 3969.884,
    "text": "That's not really how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.424,
    "end": 3979.788,
    "text": "It much more works that it's like you have specialized sense makers within the organization and consistent ways of processing data and sharing that data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.048,
    "end": 3981.189,
    "text": "So for example, you'll have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.329,
    "end": 3992.297,
    "text": " An IT team, they create, they have like a central data warehouse where they put all the data together, they clean it and sanitize it in a consistent way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.777,
    "end": 4002.604,
    "text": "And then you have embedded kind of sense makers, like kind of consultants or analysts at different levels of the organization, processing that data, sharing insights with each other, socializing across the organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.025,
    "end": 4007.368,
    "text": "And that tends to be kind of like how it's generally structured, especially in like a lot of tech companies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.858,
    "end": 4014.099,
    "text": " An open strategy is kind of an extension of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.219,
    "end": 4017.24,
    "text": "It's like the extreme extension of collaborative intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.561,
    "end": 4026.583,
    "text": "So open strategy is categorically different from traditional top level strategizing and qualitatively different from bottom-up strategizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.183,
    "end": 4034.986,
    "text": "So open strategy is unique in its overall transparency, wide inclusiveness, and central use of social IT to effectively enable mass participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.646,
    "end": 4042.208,
    "text": " In summary, open strategy is rather project-centric rather than a coherent new strategy governance framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.769,
    "end": 4056.334,
    "text": "The very limitations transpiring through the various case studies suggest that open strategy is likely to battle with Schwarmer's three enemies or inner voices of resistance, the voice of judgment, the voice of cynicism, and the voice of fear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.654,
    "end": 4062.456,
    "text": "So like open strategy is this kind of idea where it's like, A, the strategy can emerge through this kind of like bottoms up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.996,
    "end": 4085.642,
    "text": " information processing if we all had the information available to us wouldn't be purely on top-down decision maker for like synthesizing all of this but rather we could all do that together and something more robust will emerge through that process uh and this is like especially a popular concept in like among like teal organizations or Holacracy that that kind of decision making is like the gold standard for how it should happen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.781,
    "end": 4102.614,
    "text": " um though like he brought some interesting use cases about uh things like ibm i think it's pepsi a few other different use cases where their experience with this is mixed and when he says this is a project centric rather than a coherent new strategy governance framework like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.314,
    "end": 4130.565,
    "text": " it's easy to do this more in a project setting because you can think about what the relevant pieces of information are and who all the stakeholders are that you want to involve but to do that dynamically means that you're like continuously bringing in new information changing a new stakeholder responding to decision making processes between those stakeholders that's super hard to do like on a continuous basis rather than like a limited scope project basis so it's like a kind of unclear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.002,
    "end": 4135.809,
    "text": " how to make open strategy work over like a long indefinite period of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.875,
    "end": 4139.457,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.958,
    "end": 4141.962,
    "text": "Blue, Daniel, anything to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.284,
    "end": 4153.53,
    "text": " Yeah, I mean, just one last point here is that I really like how you brought the inner voices of resistance, the voice of judgment, the voice of cynicism, and the voice of fear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.111,
    "end": 4164.958,
    "text": "And that's really been kind of this feeling I've had as I've been reading this book of like, yes, this way of integrating top-down and bottom-up stimuli together sounds great and is totally the right way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.899,
    "end": 4193.561,
    "text": " to do it but sometimes the reality of being an organization is that you're dealing with people's like personal fear and that really holds you back from being able to um to like dynamically change like people want stability people want mastery um people want things to be the word the way that they were the same in the past and like that's like a very deeply i think human thing i'm not sure if that's something that's you know unique about modern organizations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.661,
    "end": 4202.168,
    "text": " And you're really going up against that when you're trying to develop these more dynamic systems of thinking about purpose and meaning and sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.188,
    "end": 4208.152,
    "text": "And to me, in my mind, that feels like the central challenge of free energy governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.293,
    "end": 4212.676,
    "text": "I'm not sure if John would agree with that, but to me, that feels like the huge hurdle you have to overcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.9,
    "end": 4217.22,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.38,
    "end": 4222.064,
    "text": "So moving into the second section, which is much smaller, so we'll try to be fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.016,
    "end": 4223.576,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.917,
    "end": 4225.197,
    "text": "There's a claim here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.217,
    "end": 4237.303,
    "text": "Strategic renewal is an iterative process of belief, action, and learning where periods of incremental adjustment, single loop learning are broken by bursts of revolutionary change, double loop learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.103,
    "end": 4251.45,
    "text": "It is only when we start expressing beliefs as probability distributions and action as a state that precedes perception conditioned by a Markovian boundary, intermediating the internal and external states all dedicated it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.809,
    "end": 4257.492,
    "text": " all dedicated in circular causality to continuously optimizing the updating of beliefs, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.552,
    "end": 4261.033,
    "text": "learning, a mathematically self-consistent model emerges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.654,
    "end": 4271.598,
    "text": "So strategic renewal is, he is using, Bijan is using a definition put forward in this article by Schmidt in 2018.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.438,
    "end": 4280.062,
    "text": "This book adopts a cross-hierarchical, capabilities-driven and action-centric learning perspective in defining strategic renewal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.558,
    "end": 4282.139,
    "text": " which is best captured by Schmidt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.739,
    "end": 4301.327,
    "text": "Strategic renewal involves a transformation of the firm's core capabilities associated with competitive advantage, concerns the entire organization and has implications across organizational levels and is essential to break past dependence and ensure the firm's long-term survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.348,
    "end": 4306.97,
    "text": "And another claim he makes here is to approach strategic renewal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.498,
    "end": 4311.24,
    "text": " as an upper echelon centric top-down only challenge is nonsense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.801,
    "end": 4325.71,
    "text": "Given the importance of social interactions to knowledge development and organizational learning, we believe that renewal can be understood best as a system of relational or social exchanges, which is effectively the essence of reality construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.45,
    "end": 4335.756,
    "text": "Indeed, once strategic renewal is embraced as a system of relational or social exchanges, the need for a cross hierarchical connect emerges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.577,
    "end": 4339.139,
    "text": " And I just wanted to bring up this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.199,
    "end": 4345.962,
    "text": "This is like the action perception loop from thinking through other minds, a variational approach to cognition and culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4346.562,
    "end": 4349.164,
    "text": "We've had this on the live stream before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.204,
    "end": 4351.925,
    "text": "I can't remember and didn't look up which live stream number it was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.026,
    "end": 4362.531,
    "text": "But in this paper, they really illustrate how this relational and social exchanges",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.984,
    "end": 4370.186,
    "text": " like interaction with the niche environment helps us come to a mutual consensus in a social kind of way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.266,
    "end": 4374.647,
    "text": "And so if you would like more information there, I recommend this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.667,
    "end": 4381.969,
    "text": "Okay, and then Bijan talks about top-down versus bottom-up strategic renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.869,
    "end": 4392.312,
    "text": "The more dominant a top-down directed induced rather than bottom-up inspired autonomous strategic renewal process, the more likely that critical intelligence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.639,
    "end": 4400.361,
    "text": " form resource markets, maybe that should be from resource markets, is ignored and transient and transformation bearing market signals are lost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.282,
    "end": 4419.107,
    "text": "In the absence of a circular top down, bottom up organizational learning, the firm may become trapped in top leadership's dominant logics, highly dependent on M&A, joint venture driven innovation, and increasingly disconnected from the very intelligence the firm's field close to resource markets beholds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.848,
    "end": 4421.288,
    "text": "Eventually, financial control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.906,
    "end": 4435.579,
    "text": " M&A and alliancing is likely to squeeze out strategic control, in-house innovation, making the firm potentially rather more than less vulnerable to survival risk as innovation can no longer can be generated from within the firm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.36,
    "end": 4437.521,
    "text": "Did you guys have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.661,
    "end": 4438.902,
    "text": "Top down versus bottom up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.143,
    "end": 4442.205,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.446,
    "end": 4445.508,
    "text": "And financial versus strategic control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.829,
    "end": 4447.09,
    "text": "Tyler, do you want to read this one for me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.243,
    "end": 4449.124,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.184,
    "end": 4454.066,
    "text": "Financial and strategic control, respectively, correlate curvilinearly to firm performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.287,
    "end": 4457.248,
    "text": "Too little or too much of one or the other is potentially entropy bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.789,
    "end": 4466.353,
    "text": "The firm is challenged to find an optimal balance between external and internal innovation to power continuous strategic renewal as a stable foundation for firm performance and survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.834,
    "end": 4475.619,
    "text": "Indeed, the question arises, how does this balance financial and strategic control and whether the board of directors potentially assumes a critical and unique strategic role in the process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.392,
    "end": 4498.224,
    "text": " So, yeah, I mean, I think just something to add here to you is, um, like a lot of times it's frames build or buy and the, the startup, the traditional sarcasm of like how you might balance these two decisions of like build versus buy as that, like build is we call that strategic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.264,
    "end": 4501.646,
    "text": "Like these are the things that are like the core and central to your purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.987,
    "end": 4505.269,
    "text": "This is like the core, like engine of how you create value in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.889,
    "end": 4529.543,
    "text": " um and by are the things where and by can mean a couple of different things it doesn't actually mean necessarily it can mean more like partnerships and plugging into the external ecosystem and so that'd be like using someone else's api for something that is not necessarily central to you like stripe payment processing right and so it's this way that you can like both have the sustainable advantage while at the same time um kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.005,
    "end": 4536.188,
    "text": " not using your resources and your energy and your attention for something that's not core to who you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.208,
    "end": 4539.571,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.552,
    "end": 4544.494,
    "text": "OK, I think this is our final claim from the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.314,
    "end": 4558.523,
    "text": "Strategic renewal research is in need of a more comprehensive framework structurally resolving the hierarchical top down, bottom up learning disconnect, cognitively embracing environment as a matter of enactment and in terms of capabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.973,
    "end": 4563.554,
    "text": " balancing financial and strategic control, as well as exploitation and exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.075,
    "end": 4569.776,
    "text": "The board of directors should be integrated as a distinct cognitive variable into the community of interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.257,
    "end": 4578.639,
    "text": "But more importantly, the question arises whether the board possesses the right capabilities to be of strategic relevance in discontinuous market environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.98,
    "end": 4581.58,
    "text": "I think that that's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.72,
    "end": 4586.842,
    "text": "So if you guys have any comments, if not, we can move into some concluding thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.606,
    "end": 4617.517,
    "text": " sure well the book is subtitled reframing the strategy governance conversation so i think we're getting chapter by chapter a clear review of the positioning and the contribution of free energy governance and towards the middle of the book things get really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.698,
    "end": 4624.041,
    "text": " detailed with respect to the applications of the Active Inference Framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4624.542,
    "end": 4644.474,
    "text": "So far, we've seen more of a introductory opening salvo and a call for need for integration above and beyond the current existing practices, which I think Tyler did a great job conveying some of the real world's strengths and weaknesses and challenges of all these different strategies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.041,
    "end": 4655.37,
    "text": " yeah and to add to that like i'm really excited for um how we move this into an applied setting because kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.569,
    "end": 4659.51,
    "text": " combining the fox and the hedgehog model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.291,
    "end": 4663.992,
    "text": "This is something I've actually thought about a lot to a little success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.633,
    "end": 4669.155,
    "text": "And it's a huge problem, especially things like OKRs, how quickly they become updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.495,
    "end": 4676.319,
    "text": "How do you create a model of the world while simultaneously communicating like, hey, this model is subject to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.799,
    "end": 4679.52,
    "text": "This is a work in progress that we're co-creating together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.357,
    "end": 4686.361,
    "text": " And like kind of going against people's individual resistance of not wanting change and wanting things to be stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.401,
    "end": 4689.884,
    "text": "Like I don't have a clue of how you actually really do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4689.944,
    "end": 4690.424,
    "text": "I'm curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.624,
    "end": 4692.405,
    "text": "I really hope that Sean has a good answer for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.088,
    "end": 4695.368,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.588,
    "end": 4699.271,
    "text": "Well, we'll see you guys next week for chapter three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.732,
    "end": 4707.337,
    "text": "Peace and enjoy your rest of your day or night, wherever you might be in your temporal existence.",
    "speaker": "SPEAKER_01"
  }
]