[
  {
    "start": 6.411,
    "end": 7.071,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.371,
    "end": 13.654,
    "text": "This is ACT-INF Bookstream number 001.06 on Governing Continuous Transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.174,
    "end": 15.195,
    "text": "It's January 17th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.535,
    "end": 17.836,
    "text": "Off to you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.877,
    "end": 23.078,
    "text": "Good morning, everyone, or good whatever time of day it is for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.638,
    "end": 31.682,
    "text": "We are the Active Inference Institute, a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.332,
    "end": 38.835,
    "text": " These are all of our social media links where you can find us if you're looking for us outside of the stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.395,
    "end": 45.438,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.138,
    "end": 55.823,
    "text": "All backgrounds and perspectives are welcome here, and we will be trying to follow good video etiquette for livestreams, other than my cat who feels free to interrupt whenever she sees fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.414,
    "end": 64.61,
    "text": " You can reach out to us if you would like to get involved with any of our ongoing projects or live streams or propose a new project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.219,
    "end": 71.002,
    "text": " And today we are going to discuss, this is book stream number 001.06.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.783,
    "end": 79.528,
    "text": "So this is our sixth contextualization video or the contextualization video over chapter six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.508,
    "end": 93.637,
    "text": "And we are going to study governing continuous transformation, reframing the strategy governance conversation by Bijan Kesri, who was nice enough to join us and discuss some of his ideas with us last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.532,
    "end": 98.475,
    "text": " This video is just an introduction to some of the ideas presented in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.555,
    "end": 102.438,
    "text": "It's not in a review or a final word in any way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.039,
    "end": 107.202,
    "text": "So we're just going to jump right in and introduce ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.502,
    "end": 108.944,
    "text": "So I am Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.324,
    "end": 114.548,
    "text": "I am a researcher in New Mexico, and I will pass it off to Danielle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.206,
    "end": 118.646,
    "text": " I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.906,
    "end": 124.89,
    "text": "I'm a researcher in California and looking forward to the continuation of the series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.411,
    "end": 125.691,
    "text": "Tyler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.552,
    "end": 128.873,
    "text": "Hey, my name is Tyler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.973,
    "end": 130.734,
    "text": "I'm a practitioner, not a researcher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.794,
    "end": 133.876,
    "text": "So I lead product and protocol design at 4K Protocol.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.337,
    "end": 138.079,
    "text": "And I also do governance on the limits of DAO tooling with MediGov.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.8,
    "end": 139.34,
    "text": "All right, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.222,
    "end": 142.522,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.416,
    "end": 152.424,
    "text": " So today we're going to get into part two of the book, so Free Energy Governance, and we're going to discuss the first chapter in part two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.925,
    "end": 154.185,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.867,
    "end": 163.653,
    "text": "So part two, Free Energy Governance, and we're discussing chapter six, and there's kind of two sections, and actually Bijan broke chapter six for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.134,
    "end": 168.838,
    "text": "So there's two sections of chapter six, the upper echelon view and the predictive processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.08,
    "end": 191.81,
    "text": " And here, just a little intro to part 2 free energy governance, free energy governance introduces a novel cross hierarchical generative framework that uniquely applies the triplet of structure cognition and capabilities as the building blocks of the firm's generative model specifically in the context of continuous strategic renewal in distributed and discontinuous market environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.37,
    "end": 198.014,
    "text": " Essentially, six core theoretical perspectives together lay the foundation for this new conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.534,
    "end": 201.777,
    "text": "Structure, upper echelon view, and prediction processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.397,
    "end": 203.998,
    "text": "So that's what we're going to discuss today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.218,
    "end": 221.33,
    "text": "And then I'm assuming that the next chapters going forward are going to focus on cognition, which encompasses attention-based view and an activist approach, and capabilities encompassing dynamic capability view and antagonistic neural networks perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.398,
    "end": 227.361,
    "text": " Structure, cognition, and capabilities form one integrated system under free energy governance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.821,
    "end": 231.102,
    "text": "Failure in any one domain is likely to challenge firm survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.603,
    "end": 247.251,
    "text": "The framework's core propositions, outlined at the end of this chapter, summarize free energy governance's ambition for a practice-relevant theoretical contribution as both the generative logic of organizational governance as well as an early warning system predicting corporate decay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.971,
    "end": 251.993,
    "text": "So, Tyler, do you want to jump in and read the abstract here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.241,
    "end": 263.304,
    "text": " The upper echelon view and prediction processing framework address free energy governance structural dimension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 263.664,
    "end": 266.525,
    "text": "Indeed, upper echelon is the site of strategic decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.166,
    "end": 270.328,
    "text": "However, UEV suffers from several limitations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 270.668,
    "end": 282.855,
    "text": "There is no explicit consideration for the board of directors and the linkage between the upper echelon and the rest of the organization, i.e., the coupling of governance and operational challenges, is unidirectionally top-down and therefore, at best, incomplete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.635,
    "end": 289.598,
    "text": " How the field data can systematically talk to upper echelon and influence their values, perception, and attention remains a black box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.238,
    "end": 300.623,
    "text": "Prediction processing framework embraces structure more holistically, addressing the hierarchical disconnect, and more importantly, the circular causality between top-down predictions and bottoms-up stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.643,
    "end": 305.106,
    "text": "I'll just read the second part here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.326,
    "end": 307.667,
    "text": "Dissonance-bearing messages...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.497,
    "end": 309.757,
    "text": " Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.558,
    "end": 320.384,
    "text": "Dissonance-bearing messages occur at the firm's stimuli level, bottom, close to its resource markets, long before top leadership has any sense of a looming challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.964,
    "end": 324.486,
    "text": "Prediction processing framework is determined by three categorical imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.986,
    "end": 329.249,
    "text": "First, upper echelons prediction models and predictions must be explainable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.809,
    "end": 334.072,
    "text": "Second, each of the hierarchical layers must have formal and informal interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.892,
    "end": 350.668,
    "text": " Faces coupling each layer to the next layer and 3rd, the firm's generative model is the firm's eco niche prediction processing framework provides an entirely new perspective and language embracing strategic renewal as a matter of bottom up top down prediction error minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.109,
    "end": 355.233,
    "text": "Not least setting 3, the full potential of the human machine interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.773,
    "end": 357.135,
    "text": "Um, and it's interesting here, like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.075,
    "end": 375.543,
    "text": " I wonder what he means by human machine interface, like humans as a functioning machine, like as an organism, maybe, or as like a, I don't know, or like directly like the human computer interaction, like how we interface with our technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.903,
    "end": 382.786,
    "text": "So I was curious, like this, I found this human machine interface clause kind of like threw me for a loop a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.286,
    "end": 384.447,
    "text": "You guys know any comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.121,
    "end": 394.688,
    "text": " I've kind of been inferring that Bajan imagines a world where you're very tied in with the AI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.429,
    "end": 410.401,
    "text": "And I personally haven't witnessed this myself, being embedded in an organization where that is a seamless integration, where you might use a machine learning framework, but rather that it is a dialogue between the ML model and then the human.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.782,
    "end": 412.163,
    "text": "I think that's what he's kind of imagining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.062,
    "end": 434.61,
    "text": " um but i think it's a little bit unclear i think you're right blue so like i've i've like studied and taken like courses in intelligence with people who study like their course of study is like human computer interaction like the interface between humans and machines and like it's always like um you know that their topics of study are very different than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.55,
    "end": 458.696,
    "text": " um like thinking about themselves as a firm right right like they they think about like their their topic of study like interacting with like a wellness robot like you've seen like the health like little robot you know for elderly people that like checks up on them and it you know it's like the how how do elderly people best interact with computers and children and they have a very different level of interaction both like the older generation and kids",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.136,
    "end": 483.239,
    "text": " they have different ways to interact and interface with computers and like they do it best in an embodied kind of machine which I found super interesting like where you know in the mid-range we can just talk to we have no problem talking to Alexa and it could just be like a microchip like speaker in the wall and it wouldn't be a big deal but like they want something in a teddy bear or some kind of like machine that that like looks has a face",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.619,
    "end": 484.32,
    "text": " or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.36,
    "end": 488.123,
    "text": "And they interact with it in a much different way, much more efficiently, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.223,
    "end": 489.384,
    "text": "So I found that super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.404,
    "end": 498.11,
    "text": "But this is what I think about when I think about the human-machine interface is the actual Markov boundary between humans and machines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.491,
    "end": 501.613,
    "text": "And so what is the potential of a Markov boundary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.753,
    "end": 502.374,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.394,
    "end": 504.035,
    "text": "Anyway, so sorry, I'm rambling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.895,
    "end": 506.597,
    "text": "OK, so just a few keywords here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.797,
    "end": 508.718,
    "text": "Upper echelon view, prediction processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.039,
    "end": 513.242,
    "text": "We'll go back and revisit double-loop learning, look into optimization, organizational sense-making,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.782,
    "end": 520.348,
    "text": " And I think the biggest chunk of new information that Bijan brought into this chapter, what were these habits of mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.368,
    "end": 526.034,
    "text": "Okay, so do you want to read this for me, Tyler, Upper Echelon View?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.92,
    "end": 527.12,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.26,
    "end": 532.683,
    "text": "So UEV defines the organization as a reflection of its upper echelon, i.e., its top management team.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.283,
    "end": 537.786,
    "text": "UEV's central premise is that executives' experiences, values, and personalities affect their field of vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.846,
    "end": 540.507,
    "text": "Their one field of vision, the directors, they look and listen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.967,
    "end": 543.749,
    "text": "Selective perception, what they actually see and hear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.869,
    "end": 547.211,
    "text": "And three, interpretation, how they attach meaning to what they see and hear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.671,
    "end": 555.375,
    "text": "So essentially, UEV embraces sensing and sensemaking, not only as an essential leadership qualities, but as a foundation for strategic choices and firm performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.117,
    "end": 558.317,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.437,
    "end": 562.119,
    "text": "And so there are a couple of claims kind of associated with this upper echelon view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.459,
    "end": 568.722,
    "text": "Bijan says, however, upper echelon view suffers from several limitations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.962,
    "end": 574.024,
    "text": "In particular, there is no explicit consideration for the board of directors as part of the upper echelon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.484,
    "end": 581.167,
    "text": "The many dimensions by which a non-executive chairman relates to the CEO, for example, are likely to determine strategic choices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.747,
    "end": 592.236,
    "text": " He goes on to say, while upper echelon view has neglected the board of directors, free energy governance emphasizes the importance of the board as part of a firm's upper echelon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.636,
    "end": 600.182,
    "text": "Top management tier and the board of directors, here jointly labeled as the upper echelon, are together the locus of strategic decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.757,
    "end": 614.186,
    "text": " More importantly, the board of directors can potentially assume a unique cognitive role in strategy process in the form of dynamic board capabilities that is highly complementary to that of senior executive leadership's strategic capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.586,
    "end": 623.852,
    "text": "And I was wondering, Tyler, maybe if you have any comments here on like, you know, normally the board is not included as the upper echelon and Bajan is like making the case for their inclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.932,
    "end": 627.695,
    "text": "Is that typical in like organizations or what do you think here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.528,
    "end": 630.37,
    "text": " Uh, no, that, that's not common.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 630.41,
    "end": 633.652,
    "text": "And I think Bajon like touched on this in our last call with him.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.672,
    "end": 642.299,
    "text": "The last discussion is that like, usually you see the board as more of like a sounding board as that there are a, they give a final sign off a rubber stamp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.68,
    "end": 646.202,
    "text": "They make sure you're not doing anything totally illegal and irresponsible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 646.222,
    "end": 649.405,
    "text": "Uh, but they're not really there to like really be in the weeds with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 649.425,
    "end": 653.648,
    "text": "Uh, whereas what Bajon is arguing is like, no, actually like they have the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.449,
    "end": 667.736,
    "text": " by virtue of being kind of separate from the day to day work, they can give you a more unbiased view of like what you should be doing strategically, like the capabilities you should be building and that they actually are like a really integral part of your whole strategic process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 668.456,
    "end": 673.218,
    "text": "And so it's unusual to think of them as like these two really critical halves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.438,
    "end": 680.582,
    "text": "Usually people think of the board as it's like nuisance that they have to appease, not as like a real thing that can actually add value to the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.277,
    "end": 684.959,
    "text": " Awesome, thank you for that input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.545,
    "end": 695.652,
    "text": "Okay, so a couple more things to say about UEV, and we just kind of excerpted from the text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.833,
    "end": 699.257,
    "text": "Upper echelon view is far too restrictive and one-sided, top-down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.83,
    "end": 704.394,
    "text": " to explain through the lens of leadership qualities, the anatomy of success and failure of strategic renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.855,
    "end": 724.694,
    "text": "This book invites to a new stream of upper echelon view centric research that operationalize upper echelon views impact on performance, not so much in terms of antecedents and consequences of team diversity, but as a function of structure, cognitively coupling governance and operational channels in the form of top down, bottom up circular prediction error minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.274,
    "end": 744.817,
    "text": " second cognition embracing environment as a matter of action-centric enactment and third capabilities developing duality management as a dynamic board capability to rewire the plane while flying it he goes on to say the prediction processing framework allows us to embrace structure more holistically i don't know if you guys have any comments here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.03,
    "end": 746.371,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.151,
    "end": 762.41,
    "text": "Let's just say that we're in a tripartite firm with the upper echelon consisting of the higher management and or the board of directors, middle management, and then the front lines, as Bijan mentioned last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.855,
    "end": 791.1,
    "text": " overly emphasizing in a given eco niche any one of those three sections is going to lead to maladaptive decision making and implementation so the question that i see these repeated structure cognition capabilities returning to is about striking an adaptive balance amongst",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.076,
    "end": 812.672,
    "text": " the upper echelon, the middle management implementational layers, and the frontline day-to-day experience, just like the body and the organism strike a balance between the primary perceptual organs, the intermediate processing, and then the central processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.175,
    "end": 816.916,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.541,
    "end": 823.697,
    "text": " Alright, so moving on to the prediction processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.737,
    "end": 825.442,
    "text": "Tyler, do you want to read this for us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.582,
    "end": 825.903,
    "text": "Do you mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.676,
    "end": 834.198,
    "text": " All right, so neither governance or strategic renewal research have addressed the hierarchical disconnect of the top-down, bottom-up, circular causality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.838,
    "end": 848.481,
    "text": "Certain exceptional contributions aside, PPF opens the processual black box of how shared meaning and expectations are constructed and optimized in pursuit of optimizing the performance, sustainability, and strategic renewal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.142,
    "end": 854.163,
    "text": "In management science, PPF's epistemological origins can be traced to Argus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.103,
    "end": 863.07,
    "text": " Agares' theory of action perspective, specifically the concept of double-loop learning, defined as a form of learning that challenges the existing routines and status quo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.75,
    "end": 867.514,
    "text": "Action-centric learning is at the heart of the cross-harchical prediction processing framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.134,
    "end": 871.877,
    "text": "There is a need for a fundamentally new organizing framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.458,
    "end": 883.287,
    "text": "The system's preparedness to unlearn powers the receptivity of the corrective feedback of the decision-making unit, and hence is critical to PPF's top-down, bottom-up learning prediction error minimization challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.786,
    "end": 887.026,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.066,
    "end": 888.287,
    "text": "Daniel, do you have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.068,
    "end": 889.348,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.429,
    "end": 895.693,
    "text": "In Bayesian learning, learning really is unlearning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.953,
    "end": 898.595,
    "text": "You have to move the distribution around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.256,
    "end": 905.941,
    "text": "And so Bayesian learning isn't just throwing more papers onto a stack or onto a knowledge pile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.401,
    "end": 910.124,
    "text": "But when we have to update how likely we think things are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.945,
    "end": 936.49,
    "text": " that is an unlearning so it's interesting to see how it's connected here to like openness to the unknown negative capabilities and the way in which in the single loop which i know we'll get to you can implement and do local maximization and maybe be locally adaptive but if we really want to pull back and amidst these discontinuities continue to find success then we need to engage in that kind of double loop learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.714,
    "end": 943.739,
    "text": " You totally took the words out of my mouth and actually just said it so much better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.839,
    "end": 951.491,
    "text": "So I also was really reminded of Bayesian learning here with unlearning because for all the reasons you just stated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.113,
    "end": 958.878,
    "text": " Okay, so double-loop learning, just to revisit, I think we talked about this maybe not last week with Bijanba, just a couple weeks ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.799,
    "end": 967.285,
    "text": "So double-loop learning occurs when, in order to correct an error, it's necessary to alter the governing values of the master programs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.766,
    "end": 979.156,
    "text": "So in this little figure, it's just like single-loop learning is actions assess the consequences, actions assess the consequences, actions assess the consequences, where the double-loop learning zooms out to kind of see like what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.816,
    "end": 983.539,
    "text": " Governing variables influence the actions that are being taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.559,
    "end": 988.903,
    "text": "So it's kind of like the setback in a hierarchical control model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.124,
    "end": 999.01,
    "text": "And Bijan says that we need error feedback loops to adjust predictions and, more importantly, to eventually update prediction models, aka double loop learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.468,
    "end": 1007.13,
    "text": " Okay, so Bijan goes on to make the claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.69,
    "end": 1013.233,
    "text": "He says, upper echelon remains the centralized purveyor of predictions, as well as trustee of prediction models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.653,
    "end": 1019.516,
    "text": "Hence, the prediction processing powered free energy governance framework is distributed at the bottom, but centralized at the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.996,
    "end": 1029.261,
    "text": "However, for prediction error minimization to work, each hierarchical layer must be dedicated to one simple first order principle, minimize free energy to minimize error and surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.981,
    "end": 1040.981,
    "text": " consequently prediction models will generatively evolve by way of self-learning this is the essence of unsupervised self-organization any comments here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.975,
    "end": 1067.92,
    "text": " sure so in terms of communication what are these different parts of the um what are the different parts of the organization or organism sharing with each other so they might just be representing what they're perceiving like everyone is just filling others in on what they're getting so that's one imperative it's just unbiased pass through a communication um another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.92,
    "end": 1082.388,
    "text": " imperative might be give the other person what they expect so here the management is saying we expect that you're gonna sell 10 cars and then the front line says yes we sold 10 cars um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.272,
    "end": 1108.169,
    "text": " where free energy minimization as a way to minimize or bound error and surprise comes in is that says actually the communication imperative shouldn't be simple pass-through and it also shouldn't be conformist but rather what is communicated should provide information about to what extent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.192,
    "end": 1115.441,
    "text": " the expectations of your communicating partner are being violated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.102,
    "end": 1122.792,
    "text": "So if they say, we expect 10 cars, the minimum communication might just be yes, if that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.823,
    "end": 1130.108,
    "text": " And then maybe there's a dial that can be turned depending on whether it's fewer than that or more than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.909,
    "end": 1140.717,
    "text": "And so that puts communication into an interesting setting where we're explicit about what the, in this case, top-down predictions are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.737,
    "end": 1153.147,
    "text": "And then we situate the bottom-up communication as reflecting the adequacy of those expectations rather than just being plain pass-through or conformist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.858,
    "end": 1161.299,
    "text": " Yeah, just to build on that a little bit, because in my experience, like there's like, like you said, only two kinds of communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.339,
    "end": 1165.38,
    "text": "There's one of like very clear, like, hey, this is what we're expecting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.54,
    "end": 1167.101,
    "text": "Did you meet that like a very clear prediction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1167.121,
    "end": 1174.142,
    "text": "And there's another one that's more just like dissonance, like things just like aren't working well and people don't fully understand why.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1174.162,
    "end": 1180.824,
    "text": "And it's in my experience, like really trying to communicate in a very clear linear way, like through each stack of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.004,
    "end": 1208.279,
    "text": " uh about like trying to warn someone of a of an issue for example or communicate like the new world or new like how you should update your generative model that tends to not work nearly as well as just things not working well and people bumping up against uh discontinuities and dissonance themselves and people really like oh there's like a problem in the system this is a signal that we need to fix it and usually that's in my experience like how communication happens between the hierarchies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.079,
    "end": 1212.186,
    "text": " And it feels really bad and it feels very chaotic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.266,
    "end": 1216.274,
    "text": "But at the end of the day, I think that's how the organism of the firm processes information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1217.935,
    "end": 1246.51,
    "text": " yeah it's asking too much for the skin cell to provide a situational report on the wound all it can and must do is report a difference from expectation that gets clustered with other incoming sensory modalities and integrated by the upper echelon to make a decision about okay now we're going to get a band-aid so understanding that the skin cell is not going to tell you to get a band-aid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.15,
    "end": 1257.895,
    "text": " but also the Band-Aid decision-making unit isn't going to have direct access to the skin, can that be implemented at the firm level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.899,
    "end": 1269.845,
    "text": " So I also am reminded of communication here and how that coupling between different layers of the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.365,
    "end": 1271.486,
    "text": "Man, can I talk today?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.886,
    "end": 1274.748,
    "text": "The coupling between the different layers of the hierarchy, how should that work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.368,
    "end": 1283.113,
    "text": "So just for example, the skin cell doesn't necessarily need to know what is happening in the liver, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.653,
    "end": 1285.575,
    "text": "It's not like a direct coupling there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.295,
    "end": 1309.129,
    "text": " um and so how how do you selectively choose like it as like a management like what to communicate down the chain like if i'm in the upper echelon like what does the board communicate to the top management tier what is the top management tier then communicate like downstream and how do you filter that information so that it's like like how do you like prioritize salience here and just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.171,
    "end": 1337.361,
    "text": " um not like open up a fire hose like here's all the information because that's not like effective for communicating but it also like like that disconnect like any kind of filtering can lead to like a level of disconnect that's maybe unwanted so how do you like prioritize that information flow um down layers of the hierarchy and like i um always am interested in this so like whether it's biological or organizational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.157,
    "end": 1340.119,
    "text": " I have a couple of examples to illustrate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.479,
    "end": 1350.586,
    "text": "So for example, I worked at a company called, actually I won't name any names here, but it was a tech company and it was probably like 400 people and it was structured very hierarchically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.387,
    "end": 1358.993,
    "text": "And so basically from the bottom rungs to the top, you would have each person would report up to their unit and have like, hey, this is what we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.433,
    "end": 1360.954,
    "text": "These are risks you should be aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.374,
    "end": 1362.715,
    "text": "And this would happen on a weekly basis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.196,
    "end": 1365.778,
    "text": "And then that would get bubbled up into the next",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.378,
    "end": 1371.244,
    "text": " of the hierarchy, which would be, it keeps getting synthesized and refined at each level of the hierarchy until you get up to like the CEO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.284,
    "end": 1371.484,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.905,
    "end": 1382.017,
    "text": "Which is presumed like ostensibly like, uh, condensing all of this information from 400 people up to like one report that the CEO gets of like five bullets of takeaways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.237,
    "end": 1382.437,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.078,
    "end": 1389.924,
    "text": " And so what happens, and Bijan even talks about this in the chapter, is that it gets so filtered by that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.964,
    "end": 1397.711,
    "text": "And also each rung in the hierarchy has their own incentives and things that they're trying to politically maximize for that becomes not even that useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.113,
    "end": 1404.055,
    "text": " What's a lot more useful, though, is when things... Well, I guess two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.596,
    "end": 1413.58,
    "text": "One is if things go wrong, like say there's a bug in the app and a fire needs to be put out right away, that's information that skips all the wrongs and goes straight to the CEO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.101,
    "end": 1420.044,
    "text": "Another one is when people would... A lot of times executives would schedule meetings with just random people in the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1420.464,
    "end": 1422.145,
    "text": "So you'd have an executive...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1422.725,
    "end": 1431.349,
    "text": " who's like the CFO would schedule a meeting with some engineer and just to like basically cross the chasm of all the different levels of the hierarchy, just be like, Hey, like what's going on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.529,
    "end": 1435.331,
    "text": "Like, tell me like what you perceive the problems to be in your subunit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.951,
    "end": 1442.334,
    "text": "And that's a way for them to kind of get like this unfiltered view of like random people by sampling random people across the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.094,
    "end": 1446.535,
    "text": "So I think there are like ways you can do this, but yeah, it's really, it's really difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1451.658,
    "end": 1451.758,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.778,
    "end": 1452.238,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.112,
    "end": 1455.894,
    "text": " So moving on, we'll talk a little bit about optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.054,
    "end": 1462.717,
    "text": "And I just put up here the distributed versus hierarchical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.422,
    "end": 1482.272,
    "text": " levels the networks um okay so bijan says the challenge is not only one of building intra-firm connections between upper echelons top-down predictions and field management's bottom-up stimuli but optimizing the top-down bottom-up process within each and every layer of the hierarchy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.393,
    "end": 1485.034,
    "text": " Why do I keep saying that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.094,
    "end": 1487.714,
    "text": "Of the hierarchy in form of feedback connections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.355,
    "end": 1490.855,
    "text": "Optimization is central to prediction processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.176,
    "end": 1495.397,
    "text": "This optimization makes every level in the hierarchy accountable to others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.897,
    "end": 1513.003,
    "text": "While the generative sense-making processes and capabilities are a critical performance element at every level of the hierarchy, the efficacy of such capabilities is determined by top-down belief propagation and bottom-up message passing within and across organizational layers or business units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.149,
    "end": 1534.194,
    "text": " Yeah, so I think like that optimization for like, maybe information or I don't know, like, what are you optimizing, optimizing the connection, optimizing the flow of information, optimizing the link between up and down, like, like, what are we really optimizing for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.594,
    "end": 1534.914,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.785,
    "end": 1540.147,
    "text": " Yeah, it's a little bit vague in how he talks about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.187,
    "end": 1549.635,
    "text": "It's honestly something I got kind of a little bit frustrated with because like actually building that top down, bottoms up kind of connective tissue is like a huge area of research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1549.655,
    "end": 1552.537,
    "text": "And there's like all of these like different approaches for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.837,
    "end": 1555.179,
    "text": "So like a really famous one is Holacracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.199,
    "end": 1557.081,
    "text": "I'm not sure you guys are familiar with Holacracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.121,
    "end": 1562.425,
    "text": "Holacracy got famous because it was implemented by Zappos to like mixed results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.805,
    "end": 1588.155,
    "text": " potentially but what a cool way that they do it is that it's not like a very traditional pyramid hierarchical structure but each like subunit will kind of dynamically form bonds with other levels of the hierarchy kind of arbitrarily depending on needs as they arise so like but they have a whole system for how those uh those bonds can form and how you generate links across different levels of the hierarchy and so that's just to say like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.835,
    "end": 1593.338,
    "text": " This is a huge area of research and experimentation that no one really has a great answer for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.961,
    "end": 1600.444,
    "text": "This is a huge open-ended question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.706,
    "end": 1608.569,
    "text": "There's no general strategy for a bug.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.27,
    "end": 1615.835,
    "text": "It doesn't seem like there's going to be a general organization chart or communications platform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.141,
    "end": 1628.917,
    "text": " and technology is changing so rapidly and intelligence augmentation this is helping us like sketch the first lines on our notebook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.918,
    "end": 1633.962,
    "text": " that takes us into a discussion and an adaptive process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.883,
    "end": 1638.987,
    "text": "And that is the reframing of the strategy governance conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.487,
    "end": 1643.431,
    "text": "It's not, this is the strategy playbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.412,
    "end": 1654.021,
    "text": "It's not the homework problems, but it's bringing some ideas to the table that are mixing it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.306,
    "end": 1665.695,
    "text": " So like, I don't know, I think about optimizing like sense-making at each level because of like the quote that's stated here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.775,
    "end": 1667.317,
    "text": "And so like, how do you like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.797,
    "end": 1671.998,
    "text": " optimize sense-making across layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.018,
    "end": 1677.46,
    "text": "It definitely has to do with information prioritization, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.58,
    "end": 1680.481,
    "text": "But it's how to selectively choose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.601,
    "end": 1683.602,
    "text": "I guess it's a very open-ended question, but I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.702,
    "end": 1685.603,
    "text": "I would like some concrete examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.663,
    "end": 1688.164,
    "text": "It's something I would like to drill Bajan on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.724,
    "end": 1696.307,
    "text": "Have you ever seen this done and what worked and what didn't as far as optimizing this hierarchy flow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.624,
    "end": 1719.513,
    "text": " as to what is being optimized one sort of capital maximalist approach is like profit is to be maximized or risk discounted profit or a triple bottom line like there are imperatives for the organization to optimize but that doesn't mean that that becomes the imperative at every communication step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.473,
    "end": 1742.964,
    "text": " And kind of the dream or direction of informational free energy minimization would be you'll be doing as good as you can in the niche from like a energetics and metabolism perspective when you're informationally optimizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.425,
    "end": 1748.827,
    "text": "If you're a bear making the best possible decisions, you will survive in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.666,
    "end": 1770.983,
    "text": " And so it's kind of like recognizing the difference between the ecological success of an organization or organism, recognizing that that embodied success and death isn't the informational imperative, but for things that work and not things that don't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.128,
    "end": 1780.576,
    "text": " Fulfilling the informational imperative should lead to the embodied success because it's defined in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.744,
    "end": 1792.231,
    "text": " So it's easy to turn to maximizing profit as a firm objective, but I think that that is short-sighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.771,
    "end": 1795.113,
    "text": "I definitely think that there's many other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.193,
    "end": 1807.564,
    "text": "If you're making the most possible money producing light bulbs, so say I'm making a light bulb and I'm maximizing profit on the light bulb, and I'm producing a million of them for pennies, and they're selling for $10 each or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.145,
    "end": 1831.043,
    "text": " um but i'm like polluting a river because i'm making the light bulbs so cheap like i'm not like adequately disposing of waste or whatever then like that's gonna have blowback like later either through like epa or through like customers saying i don't want that because it's not sustainable or whatever so like if you're just exploitative or exploitative um then it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.463,
    "end": 1846.497,
    "text": " not gonna work out in the long run so like maximizing profit is a very like delicate thing like especially in terms of like company persistence and sustainability like sustainability not like an eco-friendly way but like sustainability of the company itself yeah i mean this oh sorry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.963,
    "end": 1848.784,
    "text": " I was thinking of fermenting bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.564,
    "end": 1857.028,
    "text": "Initially, certain strategies work, but then that can lead to the production of metabolites that that strategy will no longer be optimal in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.708,
    "end": 1860.389,
    "text": "So one has to consider like externalities in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.05,
    "end": 1868.173,
    "text": "And of course, all of this is just a statistical framework that's way before we get into ethical imperatives or preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.194,
    "end": 1874.576,
    "text": "Yeah, I mean, so this is something I think we covered in the third live stream, but it's like, okay, how do you...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.039,
    "end": 1889.945,
    "text": " how do you herd cats basically and get all of these different levels of the organization to move in the same direction and kind of balance that these different things you might want to optimize for that in the longterm, maybe it goes for profit, but you might have like sub problems that you need to solve that are not strictly profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.405,
    "end": 1893.027,
    "text": "And so one of the most famous ways of doing this is OKR.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.067,
    "end": 1894.467,
    "text": "So like objective key results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.967,
    "end": 1900.03,
    "text": "And so like at your top level of the organization, maybe it is profit or maybe it is like some kind of double bottom line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.85,
    "end": 1904.772,
    "text": "But then as you go into like sub units of the organization, like say you have customer service,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1905.752,
    "end": 1908.054,
    "text": " Your customer service team is not optimizing for profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1908.074,
    "end": 1912.718,
    "text": "They're optimizing for a customer experience score, like CSAT, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.018,
    "end": 1916.141,
    "text": "And your legal team is not optimizing for profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.161,
    "end": 1922.646,
    "text": "They have their own measure that they're optimizing for the number of cases they win or legal risk avoided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.666,
    "end": 1924.048,
    "text": "I don't know how you quantify that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.048,
    "end": 1929.553,
    "text": " But there are ways that you can kind of break the bigger the problem of profit into sub problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.674,
    "end": 1935.598,
    "text": "And rather than having, you know, everyone going towards profit at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.618,
    "end": 1938.821,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.861,
    "end": 1939.942,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.182,
    "end": 1945.307,
    "text": "Oh, so perfectly perfect segue into organizational sensemakings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.962,
    "end": 1946.523,
    "text": " I'll read this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.683,
    "end": 1957.172,
    "text": "Organizational sensemaking is not about optimally approximating an objectively defined external reality, but developing and enacting models of reality by way of top-down, bottom-up predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.773,
    "end": 1961.075,
    "text": "Effectively, the future arrives in the present and becomes the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.596,
    "end": 1964.959,
    "text": "Time moves at different rates in the brain's hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.101,
    "end": 1967.122,
    "text": " as is true for the firm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.602,
    "end": 1975.607,
    "text": "While time has strictly no speed, humans project speed onto time as relations and interactions increase in intensity and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.187,
    "end": 1985.792,
    "text": "A firm's very existence is determined by its curiosity-fueled interaction with its external environment, fast at the reflex low level, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.013,
    "end": 1990.275,
    "text": "resource markets, and more slowly at higher cognitive levels, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.315,
    "end": 1991.636,
    "text": "strategic decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.276,
    "end": 2009.095,
    "text": " um and this you know reminds me of um like a paper that uh daniel and i have been working on um and just how how um temporally active inference and the fep operates at different um fast and slow speeds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.996,
    "end": 2020.779,
    "text": " It kind of reminds me of how in pretty much every company I think I've ever worked at, there's always this tendency for the bottom rung of the organization to think that the top rung are just like a bunch of like slow bumbling idiots.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.539,
    "end": 2027.341,
    "text": "There's like this temporal disconnect of like the bottom rung of the organization is getting feedback immediately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2027.361,
    "end": 2031.662,
    "text": "And like they're running little tiny experiments every single day where they're getting immediate feedback.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.242,
    "end": 2040.728,
    "text": " Whereas like the top rung is like the board, maybe they're meeting quarterly and then they have like some mandate and they don't really get feedback synthesized to them until like another three months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.388,
    "end": 2049.214,
    "text": "And so like there's always this tendency for like there's always this temporal disconnect and it always creates this kind of like boundary or disconnect between the bottom and top of the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.721,
    "end": 2065.354,
    "text": " this point of time having no speed is quite interesting we talk about oh it's the food is taking it's too slow or slower time scales faster time scales longer distances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.701,
    "end": 2086.798,
    "text": " like it feels natural to talk about the rate of speed but even without going into too much uh reconceptualizations of speed it just isn't necessarily that way and then in the brain as to like time moves at different rates in the brain's hierarchy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.719,
    "end": 2109.421,
    "text": " we could think about a neural firing pattern that takes place over some number of milliseconds and then there's slower waves and rhythms they compose and they influence each other they're all happening at once technically it's all happening in the same way at the same place the same exact input outputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.353,
    "end": 2138.046,
    "text": " but still it makes sense to talk about some of these slower or larger waves and some faster waves like in the EEG rhythms so striking a balance between the everything all at once real time unfolding and then these day week month year decade nested time scales is a big part of sense making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.342,
    "end": 2143.862,
    "text": " Definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.122,
    "end": 2144.362,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.802,
    "end": 2145.723,
    "text": "Habits of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.743,
    "end": 2151.225,
    "text": "So I liked this because I've read Good to Great, the Jim Collins book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.305,
    "end": 2161.108,
    "text": "And when Tyler and I were first starting out the series, we talked about how that's very leader centric and very top down, like the ideas that are presented in that book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.509,
    "end": 2167.912,
    "text": " And so I was excited to see this book, Good to Great to Gone by Alan Wurzel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.972,
    "end": 2175.036,
    "text": "I have not read it, but he talks about companies like, I think specifically like Circuit City is the company, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.196,
    "end": 2176.717,
    "text": "Oh yeah, it's here on the cover of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.357,
    "end": 2181.522,
    "text": " But Circuit City was like one of the companies that Jim Collins went through and good to great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.582,
    "end": 2183.964,
    "text": "And then now like there is no more Circuit City.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.004,
    "end": 2189.29,
    "text": "And so he, I guess, kind of outlines like the failings of like what makes a good company a great company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.33,
    "end": 2192.873,
    "text": "And now like they're obsolete and maybe why they're obsolete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.953,
    "end": 2196.037,
    "text": "And so he outlines these habits of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.578,
    "end": 2204.123,
    "text": " And I don't, I haven't read the book and I don't know enough, but they're listed here if you want to read them and maybe read the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.764,
    "end": 2211.309,
    "text": "But these habits of mind that are like necessary to stay relevant, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.31,
    "end": 2224.801,
    "text": "So Bijan says that habits of mind may equally explain why upper echelon is generally resisting strategy process as a matter of top down, bottom up prediction error minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.721,
    "end": 2236.53,
    "text": " And he goes on to make the claim that five out of Wurzel's 12 habits of mind are foundational to prediction processing framework, fostering success of strategic renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.431,
    "end": 2239.512,
    "text": "And he briefly summarizes these habits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.213,
    "end": 2243.215,
    "text": "Tyler, do you want to read these for us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.476,
    "end": 2243.776,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.796,
    "end": 2245.617,
    "text": "So first one, be humble, run scared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2245.797,
    "end": 2247.639,
    "text": "So continuously doubt your understanding of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.159,
    "end": 2250.601,
    "text": "Business success contains the seeds of its own destruction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.741,
    "end": 2253.263,
    "text": " Two, curiosity sustains the cat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.383,
    "end": 2254.564,
    "text": "The world is constantly changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.584,
    "end": 2256.686,
    "text": "Be open and curious and strive to learn from others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2257.527,
    "end": 2259.389,
    "text": "Three, evidence trumps ideology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.61,
    "end": 2264.535,
    "text": "In business as in politics, decisions are too often based on unproven assumptions about what works and what doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.095,
    "end": 2267.938,
    "text": "We all need operating assumptions about human nature, the economy, and the like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.559,
    "end": 2273.446,
    "text": " But when things do not work out as planned, we need to determine whether our assumptions were based on evidence or ideology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.107,
    "end": 2275.949,
    "text": "Four, confront the brutal facts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.55,
    "end": 2278.192,
    "text": "The worst person you can fool is yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.513,
    "end": 2280.776,
    "text": "Ignoring or denying reality does not help it go away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.216,
    "end": 2282.698,
    "text": "Five, chasing possible dream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.139,
    "end": 2285.903,
    "text": "Do not be limited by the tyranny of the or.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.184,
    "end": 2291.345,
    "text": " So I thought this was cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.785,
    "end": 2297.167,
    "text": "I think a lot of these habits of mine speak to the ability to rewire the plane while flying it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.147,
    "end": 2301.288,
    "text": "I don't know what Bajan stressed earlier in the chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.308,
    "end": 2304.17,
    "text": "Do you guys have any additional comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.492,
    "end": 2312.353,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.513,
    "end": 2315.354,
    "text": "Okay, so another claim, and this might be who it might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.303,
    "end": 2318.205,
    "text": " Oh yeah, getting close to the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.725,
    "end": 2328.974,
    "text": "Okay, Bijan says, it is the circular causality of belief propagation message passing where prediction processing frameworks effectiveness in the organizational context most likely breaks down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.535,
    "end": 2334.319,
    "text": "Neither the bottom-up message passing nor the top-down belief propagation are unobstructed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.819,
    "end": 2340.684,
    "text": "We fail to appreciate how organizational friction, which he defines as high levels of free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.565,
    "end": 2349.908,
    "text": " compromised firm performance due to, first, top-down enforced predictions and prediction models that are not receptive to bottom-up challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.588,
    "end": 2357.831,
    "text": "Second, weak top-down bottom-up lateral generative sensing and sense-weaking capabilities in the form of error signaling and processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.171,
    "end": 2365.954,
    "text": "And third, poor communication and absence of a language that is suitable to leverage prediction processing framework for strategic renewal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.175,
    "end": 2370.616,
    "text": "So I thought that that was kind of neat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.757,
    "end": 2375.819,
    "text": " Like, how, how the, these are the faults, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.119,
    "end": 2384.184,
    "text": "And then he goes on to say in the organizational context, prediction processing framework is determined by 3 categorical imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.244,
    "end": 2387.565,
    "text": "And I've abbreviated these kind of just shortening them so that they fit on the side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.446,
    "end": 2394.829,
    "text": "1st, upper echelons prediction models and corresponding predictions must be explainable and explicitly articulated and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.718,
    "end": 2402.264,
    "text": " Yeah, so that goes into the communication salience prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.765,
    "end": 2410.759,
    "text": "He says the language and communications layers are critical to resource configuration, firm performance, and eventually firm survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.989,
    "end": 2419.271,
    "text": " He also says, each of the hierarchical layers must have formal and informal interfaces that couple each layer to the next layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.771,
    "end": 2432.355,
    "text": "For a given hierarchical structure of a firm to have any legitimacy, generative top-down, bottom-up sensing and sensemaking at every hierarchical level should equally make sense before an error message travels to the next level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.055,
    "end": 2436.736,
    "text": "There should not and cannot be any bypassing of hierarchical layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.195,
    "end": 2440.097,
    "text": " I guess that's like, don't go over someone's head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.518,
    "end": 2450.626,
    "text": "But also, yeah, I wonder about the bypassing, about the information flow and the throughput, and how big does that channel have to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.467,
    "end": 2454.63,
    "text": "And lastly, he says, the firm's generative model is the firm's eco-niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.69,
    "end": 2462.516,
    "text": "When we perceive the world as uncertain and unpredictable, it is a mere reflection of the inadequacy of our generative reality model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.559,
    "end": 2469.025,
    "text": " So I think that that's how to avoid the errors mentioned in the previous slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.045,
    "end": 2472.57,
    "text": "Do you guys have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.111,
    "end": 2474.673,
    "text": "Final thoughts on the material?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.061,
    "end": 2483.55,
    "text": " One thought is I like number one, where it's talking about how you have to articulate and communicate top down what your actual model is so it can be challenged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.051,
    "end": 2493.904,
    "text": "And something that I've noticed is that oftentimes people will communicate their predictions, but not necessarily how those predictions were generated or the components of that, like the components of the assumptions that went into that prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.544,
    "end": 2500.408,
    "text": " And that makes it really hard for other levels of the hierarchy to like even know what was going on and what they should be challenging at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.689,
    "end": 2503.491,
    "text": "And a lot of times you'll just assume like, okay, like they probably know what they're talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.511,
    "end": 2504.331,
    "text": "Like they're the experts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.351,
    "end": 2505.472,
    "text": "So like, let's just hope for the best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.273,
    "end": 2506.933,
    "text": "But I really liked that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.973,
    "end": 2509.695,
    "text": "He said like, no, you have to explicitly say what your model is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.175,
    "end": 2511.096,
    "text": "So it can be challenged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.158,
    "end": 2516.42,
    "text": "To the going over someone's head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.99,
    "end": 2522.393,
    "text": " On a previous slide, it said organizational friction is high free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.553,
    "end": 2538.706,
    "text": "We might want to finesse that by saying relatively high free energy, because in general, we're not interested in the absolute value of a free energy calculation, but rather the gradients and the direction at which we could act to improve or increase it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.566,
    "end": 2560.644,
    "text": " so it's not about the total amount it's about the relative amount so let's just say it turned out that somebody from an org chart perspective did go over their head that could be understood as a policy selection authorized or not to structurally rewire the communications architecture of the firm now that rewiring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.866,
    "end": 2569.915,
    "text": " in a situation may be associated with a decrease in organizational friction and therefore a decrease in the free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.295,
    "end": 2575.06,
    "text": "So it may be an adaptive decision because no org chart is the final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.64,
    "end": 2584.089,
    "text": "But that doesn't mean that every time somebody tries to rewire the communications architecture, it would decrease friction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.91,
    "end": 2609.509,
    "text": " if people were just getting all these side messages and there would be so many issues as well so it's it's not to say to do or not to do it's giving the areas of consideration the structure cognitive and capacity oriented aspects that we can have that ongoing conversation and some principles that help us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.004,
    "end": 2626.722,
    "text": " take selection and still do things in an uncertain world with this little fun caveat that the perception of the world as uncertain and unpredictable is actually an inadequacy of our generative reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.362,
    "end": 2634.566,
    "text": " I mean, even skipping different levels of hierarchy could be something that you explicitly plan for as well and build processes around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.767,
    "end": 2638.87,
    "text": "So for example, I worked at a company that they call it like the big red button.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.25,
    "end": 2648.817,
    "text": "Whereas if you were at the bottom rung of the organization and you saw something was going terribly wrong, you could basically push this big red button and it would file this report directly to the C-suite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.537,
    "end": 2652.16,
    "text": " and would skip all the levels, and then they would follow up with you directly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2652.841,
    "end": 2658.188,
    "text": "And so they explicitly said, hey, we know that there are going to be things that are shielded from our view, and we want to know about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2658.609,
    "end": 2660.931,
    "text": "And they built a process explicitly around it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.835,
    "end": 2665.657,
    "text": "So in terms of, sorry, go ahead, Damian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.223,
    "end": 2673.866,
    "text": " that reminds me of cells signaling and then the ultimate red button is like when the cellular contents are spilling out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.546,
    "end": 2682.169,
    "text": "It's like my only message to share is that I am no longer and all my insides are like spilling onto you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.189,
    "end": 2689.471,
    "text": "So it's like, if there's a protein that's usually internal and you're being bathed in it, that's the red button that you needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.551,
    "end": 2694.353,
    "text": "So yes, that kind of emergency or a conditional rewiring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.798,
    "end": 2725.463,
    "text": " maybe there's many patterns and motifs where we might want to embed that kind of flexibility into the communications architecture so even though it is a dynamic communications architecture at a higher level it's actually not changing in its dynamics like different people are going to be in different video calls but that doesn't mean that the communications architectural plan is changing it just means that different individuals are connected differently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.111,
    "end": 2743.722,
    "text": " So in terms of sharing the model, Tyler, when you were talking about sharing how the top level will share their predictions, but not necessarily how those predictions were generated, I'm really reminded of academic research in which it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.708,
    "end": 2762.621,
    "text": " i feel like everyone is so like shielded from what's going on like you have the principal investigator they like write a grant the grant has like three specific games it's just an example so then like those three specific games they'll each grad student will be working on one of the aims right or maybe they'll have a team working on achieving one of the three specific aims right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.241,
    "end": 2767.846,
    "text": " And like these teams are doing totally like work that they think is totally unrelated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.886,
    "end": 2770.689,
    "text": "Like they have no idea, like the overarching process of the grant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.929,
    "end": 2775.794,
    "text": "Like, I wonder how often like the PI shares like the entire grant with every student.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.834,
    "end": 2778.637,
    "text": "Like, I mean, that's not something that I typically see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.677,
    "end": 2782.861,
    "text": "And I think like that there's a lot of shielding going on and I don't, I don't really know why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.922,
    "end": 2783.923,
    "text": "Like, is it, is it like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.463,
    "end": 2804.086,
    "text": " because it's just too much information or because like they just want the focus on to be on that one thing like they want this the students to have this myopic view or and i just wonder daniel like what is your experience there like do you think that like pis generally share the entire model or they just share a piece of it like what is your experience and do you think that that makes research dysfunctional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.994,
    "end": 2829.216,
    "text": " interesting i've seen some investigators who shared the grants or other ongoing strategy documents or not it reminds me of a computer program like if you could perfectly isolate every variable and for loop and you can really clearly say this is the scope of this script and all of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.419,
    "end": 2855.84,
    "text": " that may work in a computer system but humans are always curious about the context and the past and the future and alternate futures so that kind of strict information encapsulation approach might increase overhead decrease context have to spend a lot of time re-explaining things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.534,
    "end": 2886.012,
    "text": " It's not that one strategy is going to be in general better than the other, but it seems like it could be a better professional conversation if the lab strategy governance were framed in a way that accounting for people's differences in like familiarity with grant writing or with experiment design, at least giving lab level awareness doesn't seem like it'd be a bad thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.472,
    "end": 2891.996,
    "text": " Yeah, there's an analogous problem within a business organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.016,
    "end": 2897.82,
    "text": "And so remember we talked about OKRs, where you take this big goal you have, let's say it's growth, and you split it up into subcomponent parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2898.501,
    "end": 2902.704,
    "text": "So one problem I've had in one organization, actually multiple organizations, is on the growth funnel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.784,
    "end": 2908.069,
    "text": "So how you get leads and then how you convert them into actual conversions and sales, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.729,
    "end": 2914.536,
    "text": " And so what often happens is that there's a trade off between getting more leads and the quality of those leads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.017,
    "end": 2917.72,
    "text": "And so what you'll do is you'll have a top level growth initiative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.74,
    "end": 2918.381,
    "text": "We have to grow by 10%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.461,
    "end": 2922.486,
    "text": "And then you're like, cool, marketing people, increase your leads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.987,
    "end": 2926.811,
    "text": "And then product people, increase the conversion on this funnel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2927.652,
    "end": 2934.398,
    "text": " But what actually happens, though, is if the marketing team increases their leads, they often get more poor quality leads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.438,
    "end": 2937.101,
    "text": "You're dipping into lower quality leads to increase your leads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.581,
    "end": 2941.404,
    "text": "And so that actually reduces the conversion of the next step of the funnel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2941.885,
    "end": 2947.51,
    "text": "And so they're both narrowly optimized on their one little piece of the puzzle, but they actually really directly impact each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2947.97,
    "end": 2960.316,
    "text": " And then you get into these really painful conversations between your marketing team and your growth product team, which is really like if they just had this more holistic view to begin with, like, no, we're just trying to grow, guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.436,
    "end": 2961.356,
    "text": "That's what we're trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.376,
    "end": 2963.517,
    "text": "We don't care about your little piece of the puzzle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.117,
    "end": 2970.96,
    "text": "And so there's often this time where by breaking things off too narrowly, you really miss the bigger picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.0,
    "end": 2972.181,
    "text": "And this is super, super common.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.454,
    "end": 3003.826,
    "text": " yeah alas well having having the um the a priori partitioning means that you are saying like uh not even the structure of the problem is going to change again if you only have to partition the problem one time then maybe it can be cut and dry but those kinds of dependencies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.542,
    "end": 3034.908,
    "text": " are why we need these kinds of composable partitioning strategies so that different parts of a Bayes graph can be identified because we're looking at a lot of text, but all of these notions of a generative model, generative process, we can also see that kind of a Bayes graph representation in the background, especially as these types of perspectives move closer to application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.136,
    "end": 3039.456,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.716,
    "end": 3042.898,
    "text": "Well, that's the end of the content here for Chapter 6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.579,
    "end": 3049.782,
    "text": "We will delve into Chapter 7 next week, unless you guys have any final things to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.802,
    "end": 3051.703,
    "text": "That's it for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.143,
    "end": 3060.748,
    "text": "So thanks for being here, and I'm looking forward to carrying on, pushing forward, learning more about free energy governance and future discussions with the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.967,
    "end": 3068.208,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.528,
    "end": 3068.849,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.15,
    "end": 3069.711,
    "text": "Till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.973,
    "end": 3071.074,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]