[
  {
    "start": 6.971,
    "end": 7.652,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 8.612,
    "end": 10.033,
    "text": "It is January 31st, 2023.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 10.133,
    "end": 14.417,
    "text": "We're here in Active Bookstream number 1.08.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 14.797,
    "end": 17.379,
    "text": "Off to you, Blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 20.442,
    "end": 28.067,
    "text": "So we will be discussing this book, continuing our discussion of this book, Governing Continuous Transformation by Rajan Kesari.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.788,
    "end": 31.971,
    "text": "We are the Active Inference Institute Governing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.864,
    "end": 38.669,
    "text": " Participatory Online Institute that is communicating, learning and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.15,
    "end": 41.652,
    "text": "You can reach us at all of our social media links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.232,
    "end": 44.774,
    "text": "This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.814,
    "end": 47.817,
    "text": "So please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.358,
    "end": 53.262,
    "text": "All backgrounds and perspectives are welcome here and we will be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.512,
    "end": 62.995,
    "text": " Again, if you would like to participate in this project or any activities that are ongoing in the Active Interference Institute, please reach out to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.435,
    "end": 65.716,
    "text": "There are plenty of ways to get connected and involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.697,
    "end": 75.36,
    "text": "Okay, so the goal of today's book stream is to continue our discussion of this book, and we will just be going through it as usual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.8,
    "end": 81.443,
    "text": "Just as always, this is not a review or a final word over this material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.463,
    "end": 84.424,
    "text": "It's just an introduction to some of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.332,
    "end": 90.995,
    "text": " Okay, so just quick introductions for those of you who don't know us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.135,
    "end": 92.016,
    "text": "I am Blue Knight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.496,
    "end": 96.638,
    "text": "I've been involved in the Active Inference Institute for quite a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.159,
    "end": 102.882,
    "text": "I'm an independent researcher in New Mexico, and I'll pass it off to Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.204,
    "end": 105.784,
    "text": "Hi, Daniel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 106.004,
    "end": 107.525,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 107.645,
    "end": 108.546,
    "text": "I'll pass to Tyler.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 110.247,
    "end": 111.027,
    "text": "My name is Tyler.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 111.147,
    "end": 114.089,
    "text": "I'm a critical designer and researcher in California.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.898,
    "end": 118.218,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.479,
    "end": 122.6,
    "text": "So today we're moving on to chapter eight of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.361,
    "end": 126.903,
    "text": "The title of this chapter, it's in part two, the free energy governance section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.063,
    "end": 131.185,
    "text": "And the title of this chapter is Capabilities, Duality Management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.265,
    "end": 137.208,
    "text": "And we'll talk more as we go on as to what duality management kind of means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.764,
    "end": 149.453,
    "text": " Okay, so there are two sections outlined by Bijan here in this chapter, the dynamic capability view and antagonistic neural networks perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.514,
    "end": 154.737,
    "text": "There's a whole bunch of keywords, and we'll just jump right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.417,
    "end": 157.479,
    "text": "Tyler, do you want to read this part of the abstract for us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.44,
    "end": 158.62,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 158.951,
    "end": 168.193,
    "text": " All right, so abstract dynamic capability view, DCV, and antagonistic neural networks perspective, ANMP, address free energy governance capabilities dimension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.653,
    "end": 178.034,
    "text": "The board's cognitive capabilities in terms of meta-managing interdependently opposing logics as unity are increasingly relevant to continuous strategic renewal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 178.574,
    "end": 187.796,
    "text": "Duality management, such as the vacillation between exploitation versus exploration, and balancing financial and strategic control is established as a dynamic board capability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 188.516,
    "end": 191.719,
    "text": " Effectively, FEG extends DCV to the board level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 191.939,
    "end": 195.481,
    "text": "More importantly, by adopting a free energy principle power perspective, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.641,
    "end": 204.288,
    "text": "redefining the firm as an inactive inference machine, DCV is tripled sensing, seizing, and reconfiguring assets as operationalized such that the firm is engaged as a whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 207.162,
    "end": 207.422,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.122,
    "end": 219.567,
    "text": "So antagonistic neural network perspective is established and applied as the neuroscientific basis for duality management, managing the existing while contradicting the present to develop the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.327,
    "end": 225.469,
    "text": "This task positive network slash, what is the other one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.289,
    "end": 229.15,
    "text": "GMN, dynamic mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.31,
    "end": 229.83,
    "text": "I can't remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.53,
    "end": 231.091,
    "text": "Antagonism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.531,
    "end": 231.871,
    "text": "What is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.356,
    "end": 236.237,
    "text": " default mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.297,
    "end": 237.438,
    "text": "There it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.658,
    "end": 252.072,
    "text": "Default mode network antagonism between exploitative task execution and explorative, explorative, abductive thinking is a neurological representation of the contradictory demands that challenges company sustainable outperformance and survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.493,
    "end": 258.419,
    "text": "The board's traditional monitoring and advisory roles must be explicitly complemented with a duality management mandate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.462,
    "end": 261.543,
    "text": " managing both of these networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.023,
    "end": 274.549,
    "text": "More specifically, the board's dynamic capability of duality management lays the foundation for the board's newly established governance purpose in discontinuous and distributed markets, quote, duality stewardship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.709,
    "end": 282.612,
    "text": "Yeah, and so we'll get into these task positive and default mode networks as we get in later to this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.482,
    "end": 307.342,
    "text": " right um so this is a dynamic capability view i looked it up i found this cool image um so bijan says sensing strategic opportunities in dynamic market environments seizing the opportunity and reconfiguring a firm's resource base accordingly are dynamic capability views three central pillars and he cites this reference um so here we see these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.285,
    "end": 313.268,
    "text": " sensing, seizing and managing, or I guess that's reconfiguring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.449,
    "end": 316.45,
    "text": "These are the three pillars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.61,
    "end": 324.735,
    "text": "And then they give some micro foundations, like what is this sensing, seizing, reconfiguration or managing threats?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.855,
    "end": 330.958,
    "text": "So I don't know, Tyler, do you have any like thing to add here or maybe like specific examples?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.458,
    "end": 337.262,
    "text": "I mean, I see like, to me, this is a very abstract like diagram and I'm like, what's going on here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.846,
    "end": 366.806,
    "text": " yeah i mean i think this makes it more seem more difficult and complicated than it really is where a lot of times it's sensing a lot that's where that's like that abducted reasoning we're saying like hey there's something here what could be true here like how do i explain kind of this like these disparate signals i'm getting from the environment how do i make sense of this and we're seizing is like actually building the thing and managing threats and performing is like managing that thing you built over time and i think actually in the next slide it gives a really good example with um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 367.608,
    "end": 368.268,
    "text": " Amazon Kindle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 368.768,
    "end": 372.069,
    "text": "And then actually, maybe if you could just go to the next slide, I think it explains it well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 372.929,
    "end": 390.754,
    "text": "So for example, it says, for example, Amazon's launch of the Kindle 2006 involves sensing the impending threat of its core bookselling business, seizing the opportunity through rapid development of the first generation ebook reader, and gradually reconfiguring its internal activities to ensure that the Kindle became an integrated part of its overall market offering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 394.571,
    "end": 395.231,
    "text": " Nice, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.892,
    "end": 411.815,
    "text": "Bijan goes on to say, in a similar manner to that in which organizational learning research distinguishes between single-loop and double-loop learning, capability research also distinguishes between operational capabilities and dynamic capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.315,
    "end": 423.878,
    "text": "And so in the text, he gives some examples of operational capabilities, like mergers and acquisitions and other things that are outside the scope of this dynamic capability view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.775,
    "end": 428.596,
    "text": " Um, okay, so start reading these claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.677,
    "end": 445.665,
    "text": "So he says there has lately been a shift in dynamic capability view from behavioral to cognitive interpretations, explicating the cognitive micro foundations, underpinning thesis 2007, 3 core pillars of dynamic capabilities, sensing perception, seizing sense, making and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.508,
    "end": 449.971,
    "text": " asset configuration, language, communication, and social cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.311,
    "end": 458.597,
    "text": "So this is like reframing again, those three pillars kind of more towards the active inference or free energy governance perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.657,
    "end": 460.338,
    "text": "He goes on to say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.041,
    "end": 477.671,
    "text": " With respect to dynamic managerial capabilities for seizing and reconfiguring in particular, we have emphasized ways in which top management can shape aspects of the organizational context, such as by encouraging cooperation, lowering resistance to change, designing a business model for a new venture,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.271,
    "end": 498.529,
    "text": " and investing in new skills and assets this suggests that managerial cognitive capabilities may function as mediators of the relationship between changes and organizational context and strategic change which in turn can affect firm performance do either of you guys have any comments here should we move to the next one okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.011,
    "end": 500.231,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.591,
    "end": 508.598,
    "text": "So I had to look this up because the term industrial vertical was like brought up and I was like, what is industrial vertical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.738,
    "end": 511.88,
    "text": "And I think like it's more commonly called an industry vertical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.14,
    "end": 515.363,
    "text": "You can have it like in the industrial field and then it's like something different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.383,
    "end": 518.865,
    "text": "But an industry vertical is also known as a vertical market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.286,
    "end": 526.531,
    "text": "And it's like a unique business niche that serves a specific set of consumers or customers and their particular needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.072,
    "end": 528.853,
    "text": "And there's like tons of examples of that, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.352,
    "end": 537.178,
    "text": " I don't know, organic food and I don't know, like solutions for a biology lab or like there's, you know, all these like niche markets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.298,
    "end": 545.785,
    "text": "And it's like if you're trying to sell chemicals to a biology lab, like, you know, you're selling them like HPLC purified acetic acid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.605,
    "end": 552.63,
    "text": " And you're not selling that acetic acid to someone to use in their kitchen for a salad dressing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.05,
    "end": 559.635,
    "text": "It's a totally different, even though you're selling acetic acid, those are two totally different markets of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.055,
    "end": 565.92,
    "text": "So you don't want to make a product that's bought by everyone because then it actually is not useful for anyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.14,
    "end": 567.721,
    "text": "That was kind of my understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.821,
    "end": 568.802,
    "text": "Do you have anything to add, Tyler?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.56,
    "end": 571.981,
    "text": " Yeah, it could give like a little more color of examples here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 572.061,
    "end": 578.883,
    "text": "So like an example of an industry vertical could be like movie making business where like on the top end, you might have like where the movies are consumed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 578.903,
    "end": 579.644,
    "text": "It's a movie theater.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 580.084,
    "end": 581.564,
    "text": "And then you have how it's produced.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 581.584,
    "end": 587.326,
    "text": "So you have studios, you have screenwriters, you have the people who are actually creating the equipment and making the film, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 587.666,
    "end": 595.669,
    "text": "So it's basically like this big kind of almost supply chain or these interrelated businesses that are all supporting each other to one final product.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 596.169,
    "end": 597.99,
    "text": "So one thing I would add here too that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 598.809,
    "end": 605.551,
    "text": " I think Bijan would probably agree with is that in a more discontinuous world, the idea of an industry vertical is becoming a little bit more fuzzy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 606.071,
    "end": 613.473,
    "text": "And so for example, like in the past, you might say like, well, I have this, I make research, I make chemicals for biology research, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.834,
    "end": 617.895,
    "text": "But it could be the case that you also make chemicals that are used for like hair products.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 618.655,
    "end": 623.076,
    "text": "And so like your verticals are increasingly becoming more fuzzy and intertwined.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 623.396,
    "end": 628.098,
    "text": "And it becomes harder to think about like, like, where do I actually like, what niche do I actually serve?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 628.198,
    "end": 628.318,
    "text": "Like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 629.577,
    "end": 631.518,
    "text": " what is the market I'm in, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 631.538,
    "end": 632.758,
    "text": "And it can be really hard to think that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 632.798,
    "end": 649.823,
    "text": "And that's where sensing really comes in handy is because you could be like, oh, well, I thought I was making biology research chemicals, but it turns out, because I'm sensing and using my abductive reasoning and my best FEG perspective I can, that I'm actually in the haircare market.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 649.963,
    "end": 651.223,
    "text": "And that's where I really should be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 652.824,
    "end": 657.445,
    "text": "And so it's kind of the idea of a vertical becomes harder to define over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 659.56,
    "end": 671.511,
    "text": " This website actually gave a lot of examples about how industry verticals allow companies that would sometimes be competitors to collaborate with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.911,
    "end": 678.277,
    "text": "They talked about how the Samsung Glass is used by the Apple iPhone, or maybe it's the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.377,
    "end": 685.263,
    "text": "But either way, the Samsung phones and the Apple phones are normally competitors in a market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.743,
    "end": 702.259,
    "text": " um i don't even know that they compete anymore like either you're a mac person or you're an android person like i don't i don't think that there's any competition there but maybe um so but how that you know they're collaborating with the use of the glass and making it accessible to everyone just because everybody needs glass right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.659,
    "end": 728.248,
    "text": " um okay so they also bishan also brought up um oh yeah here is the industrial vertical so let me read this from the from the book it says indeed independently of industrial vertical the increasingly distributed and discontinuous nature of market transforming forces cannot be overestimated however market velocity velocity is too generic of a concept and so like i was trying to understand um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.423,
    "end": 747.957,
    "text": " like how he was using this term market velocity like here and like so market velocity like when you google it it's like it indicates the level of market activity in individual nasdaq stocks by measuring the frequency and share volume in aggressively priced orders it can indicate changes in market direction momentum or liquidity in each stock enabling users",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.417,
    "end": 776.094,
    "text": " to imply future price movements and trades so like that's how like fast the market's moving i guess um and then like it's also a company that recycles and like velocity is a measure of two dimensions right the speed of change and the change in direction so i don't know um like the concept of market velocity here like he can he goes on to compare it to um environmental scarcity he says a more suitable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.355,
    "end": 791.104,
    "text": " dynamic capability concept is environmental scarcity, inspired by Cameron and Zmudo in 1983, meaningfully relating sensing and sense-making as meta-capabilities, respectively, to eco-niche dynamics and strategic renewal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.665,
    "end": 799.25,
    "text": "So I don't know how environmental scarcity and market velocity, how those two relate to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.27,
    "end": 804.774,
    "text": "I don't know if you guys can offer any insight here, but this is something that I would hold out and ask Vijan about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.928,
    "end": 817.554,
    "text": " Yeah, I think with, with market velocity, like a lot of times when people talk about discontinuities and like, like people who are not coming from an FEG background, I'm talking about, Hey, like things are moving really quickly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 818.515,
    "end": 819.715,
    "text": "It's more uncertain than ever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 819.916,
    "end": 821.556,
    "text": "They talk about market velocity, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 821.597,
    "end": 823.157,
    "text": "Like things are just changing all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 823.177,
    "end": 828.28,
    "text": "And I think what Bijan is saying is like, just saying that things are changing very quickly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 828.4,
    "end": 829.361,
    "text": "Isn't very helpful to you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 829.521,
    "end": 830.381,
    "text": "Cause you're like, okay, cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 830.401,
    "end": 831.242,
    "text": "Like life is hard.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 831.402,
    "end": 831.742,
    "text": "I get it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 831.842,
    "end": 833.323,
    "text": "Like now what do I do with that information?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 834.062,
    "end": 840.785,
    "text": " Where when you present environmental scarcity, it's becoming a little bit more specific in like how you can actually be more action oriented with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 840.865,
    "end": 849.508,
    "text": "Cause you're like, okay, well like what's my niche and what are the meta capabilities I have to create to manage this uncertainty and create my own niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 849.568,
    "end": 854.75,
    "text": "Whereas market velocity is just kind of like being overwhelmed by uncertainty and being like, I don't know, things are hard.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 854.81,
    "end": 855.89,
    "text": "Like this is scary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 856.931,
    "end": 857.611,
    "text": "That's at least my take.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 860.387,
    "end": 862.948,
    "text": " So he goes on to, oh, sorry, go ahead, Danny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.448,
    "end": 881.195,
    "text": "One related angle to connect back to what we've discussed elsewhere is this concept of generalized coordinates, which is the value that something is at, and then the first derivative, which is the velocity, and then the acceleration, higher derivatives, and so on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 881.615,
    "end": 889.258,
    "text": "And so that allows you to track one variable, like the temperature or the salinity of the water or the funds in the bank account.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 889.818,
    "end": 912.488,
    "text": " and look at it not just where it is but how fast it's moving and how fast it's changing how fast it's moving and then you can learn certain things like oh the third derivative is always within this range so that puts certain bounds on timelines that the primary indicator might change by a certain amount or not and we see some of those things like um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 914.039,
    "end": 921.622,
    "text": " The gradual decline, sudden decline, those are differentiated not by their starting point, but by the rate of their decline.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 922.102,
    "end": 927.684,
    "text": "So velocity is something that we can talk about in Bayesian physics actually as a speed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 932.145,
    "end": 938.766,
    "text": " And then he goes on to outline this environmental scarcity from this Schmidt et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.786,
    "end": 946.788,
    "text": "2016 reference, which says combining the type and rate of decline allows us to distinguish four environmental scarcity situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.368,
    "end": 959.57,
    "text": "Environmental dissolution, which is the gradual decline in shape, environmental erosion, gradual decline in size, environmental collapse, sudden decline in shape, and environmental contraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.18,
    "end": 988.764,
    "text": " sudden decline in size and so like i was trying to like picture this as like a like a um i don't know maybe like a market right like and so like the market um changes shape like what would it mean for a market to change shape really um i get like the market changes size like all of a sudden you know there's not a market for cds anymore because everybody's listening to mp3s so like that's like a um well i guess like that's a change in shape and size",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.344,
    "end": 991.244,
    "text": " I'm not sure how to really think about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.264,
    "end": 998.646,
    "text": "So to use that example, like that would be a change in shape or like, for example, imagine the same number of people were listening to music, but the format changed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 999.086,
    "end": 1004.967,
    "text": "So it's like the market is music, people who listen to music, but the shape is a little bit different of like how they're consuming it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.408,
    "end": 1010.509,
    "text": "Whereas it could be a change of size and shape as if like you move to MP3s.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1011.029,
    "end": 1016.41,
    "text": "Now, because it's MP3s, more people can access the music, the market grows, and that'd be a change of size and shape.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1019.574,
    "end": 1023.395,
    "text": " Or like the market totally disappears because we can just stream whatever we want on YouTube now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.615,
    "end": 1025.396,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.676,
    "end": 1028.257,
    "text": "That's also a change in size and shape, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.817,
    "end": 1029.677,
    "text": "But yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.857,
    "end": 1030.117,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.137,
    "end": 1030.678,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.758,
    "end": 1035.079,
    "text": "So environmental scarcity is more suitable than market velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.199,
    "end": 1040.401,
    "text": "And I guess I can see why that that is because it's more nuanced as to like what is actually changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.501,
    "end": 1041.121,
    "text": "Is it just like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.841,
    "end": 1055.266,
    "text": " up or down and how fast or like the shape and the size um and like the rate i guess all of that is taken into this environmental scarcity concept um okay uh do you want to read these claims tyler",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.215,
    "end": 1056.495,
    "text": " Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1056.816,
    "end": 1064.565,
    "text": "So while slow and gradual market changes tests in particular our sense of capability, more sudden changes challenge a firm's sense-making capability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1065.906,
    "end": 1074.516,
    "text": "There really is no objectively uncertain market environment and certainty is an actor-dependent mental experience facing one's very limitations of the dynamic interplay between sensing and sense-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1075.049,
    "end": 1079.132,
    "text": " Therefore, independent of the degree of market velocity, dynamic capabilities are critical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1079.612,
    "end": 1090.719,
    "text": "He goes on to say, the stronger and sudden the impact of environmental scarcity, the higher the urgency to act and hence the stronger the tendency for strategic renewal to be rather financial control centric, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1090.979,
    "end": 1093.921,
    "text": "M&A and other forms of alliancing, precisely for two reasons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1094.241,
    "end": 1101.105,
    "text": "One, the existing resource base is too trapped in the past to unlearn advanced renewal from within and without.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1101.827,
    "end": 1109.732,
    "text": " Or two, the opportunity for market consolidation is too irresistible, as JP Morgan had demonstrated during the 2007-2008 financial crisis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1109.912,
    "end": 1111.253,
    "text": "And time to action is critical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1115.055,
    "end": 1115.255,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.436,
    "end": 1123.08,
    "text": "So yeah, I guess that kind of sheds more light on the environmental scarcity concept here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.366,
    "end": 1127.868,
    "text": " OK, so just I wanted to define this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.888,
    "end": 1133.412,
    "text": "We kind of talked about the tyranny of the or last time, but we didn't really elaborate on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.532,
    "end": 1146.06,
    "text": "And so we last time we talked about this good to great to gone book, Circuit City and the tyranny of the or is actually Bichon keeps quoting this Wurzel book about the tyranny of the or.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.12,
    "end": 1147.181,
    "text": "But I had to look it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.241,
    "end": 1152.625,
    "text": "It's actually from the not good to great Jim Collins book, but like another Jim Collins book that I haven't read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.266,
    "end": 1154.007,
    "text": " built to last.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.167,
    "end": 1164.259,
    "text": "And so here the tyranny of the or is the rational view that cannot easily accept paradox, that cannot live with two seemingly contradictory forces or ideas at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.679,
    "end": 1170.306,
    "text": "The tyranny of the or pushes people to believe that things must be either A or B, but not both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.318,
    "end": 1189.226,
    "text": " And so I think that this concept kind of goes like is like a light introduction and we'll dive deeper into it about like duality and duality management, like being able to hold two simultaneously opposing or maybe seemingly opposing or necessarily contradictory opinions or views.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.426,
    "end": 1194.928,
    "text": "OK, and here we go right into duality management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.732,
    "end": 1218.892,
    "text": " um so vision says in fact at any point in time a firm is challenged to balance strategic organic r d driven innovation and growth with financial control external growth and innovation by way of forms of strategic partnering there is no tyranny of ore it is the duality a continuous balancing act that is mutually reinforcing and with perspective in time and space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.52,
    "end": 1220.38,
    "text": " forms a unity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.86,
    "end": 1227.162,
    "text": "Free energy governance establishes duality management as a dynamic capability, specifically as a dynamic board capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.742,
    "end": 1237.264,
    "text": "Duality management, such as vacillation of exploitation versus exploration, and balancing financial and strategic control, is established as a dynamic board capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.704,
    "end": 1246.286,
    "text": "The goal-directed, action-centric, and generative circular causality of top-down, bottom-up, and lateral sense-making processes, prediction error minimization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.886,
    "end": 1250.407,
    "text": " forms the basis for leveraging opposing logics in the form of duality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.427,
    "end": 1257.489,
    "text": "And duality management in contrast with strategy management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.769,
    "end": 1258.869,
    "text": "Do you want to read this one, Tyler?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.889,
    "end": 1261.07,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1261.27,
    "end": 1273.813,
    "text": "So indeed, strategy management has traditionally embraced one, environmental co-creation versus co-alignment, two, exploitation versus exploration, and three, financial versus strategic control as dualism or paradox rather than as duality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1274.451,
    "end": 1279.074,
    "text": " gets the background of a world that is increasingly distributed, discontinuous, and inescapably interdependent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1279.394,
    "end": 1291.64,
    "text": "Persistency in contradiction of interdependent elements, which is the defining core paradox, is potentially nonsense and therefore severely limits the theoretical as well as practical relevance of a strategic paradox lens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1294.982,
    "end": 1295.322,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.443,
    "end": 1303.347,
    "text": "So I think that this is like, you know, the old way and as opposed to duality management, which is the new way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.64,
    "end": 1333.682,
    "text": " do you guys have anything to add here this is kind of like paradox is attention to balance unity is plural and at minimum two rather than paradox is something that must be resolved one way or the other so it's really compatible with a lot of qualitative things people say about wisdom and balance and i think the question will be how is that enacted in organizations and how does that connect to active",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1336.055,
    "end": 1336.335,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1336.455,
    "end": 1345.481,
    "text": "I mean, one thing that's interesting about duality management is that there's also like a strong cultural tendency to be decisive or a bias to be decisive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1346.482,
    "end": 1355.068,
    "text": "And that like the perception of kind of going, not wanting to make a choice can be seen as weak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1355.188,
    "end": 1363.373,
    "text": "Whereas like you haven't really, so like there's even if, I think a lot of people would recognize the duality and say like, yeah, like, I don't know, it's kind of both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1363.513,
    "end": 1364.874,
    "text": "Like you want to exploit or you want to exploit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1364.894,
    "end": 1365.755,
    "text": "Like I think a lot of people would,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1366.638,
    "end": 1375.724,
    "text": " would recognize that, but when you're in a meeting and you're not like really committing to something where you're not like really, a lot of people feel like they're not really offering like a new perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1376.105,
    "end": 1379.147,
    "text": "Like they're not putting their stake in the ground saying like, this is how I feel about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1379.627,
    "end": 1381.869,
    "text": "And this is where I'm gonna like, you know, push behind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1382.709,
    "end": 1385.691,
    "text": " And so I feel like a lot of people feel this pull to make a call.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1386.272,
    "end": 1391.896,
    "text": "And so that's one, even in an executive level, you can feel that, especially too when you're on the executive level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1391.916,
    "end": 1403.144,
    "text": "And even if you recognize this duality and you're communicating what you want to do to the broader organization, duality is a really hard thing to communicate and say, yeah, we don't really know what's going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1403.264,
    "end": 1405.366,
    "text": "It could be one of these multiple things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1405.426,
    "end": 1406.587,
    "text": "Let's figure it out together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1407.047,
    "end": 1407.768,
    "text": "I have done this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1408.408,
    "end": 1409.929,
    "text": "I have communicated this before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1410.029,
    "end": 1410.81,
    "text": "It's a hard road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1411.348,
    "end": 1412.348,
    "text": " to go down, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1412.388,
    "end": 1414.169,
    "text": "We were like, Hey, yeah, we're all just figuring it out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1414.209,
    "end": 1417.269,
    "text": "Like it's going to be like, let's just kind of be fluid about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1417.289,
    "end": 1421.27,
    "text": "A lot of people don't like to hear that because it sounds like, well, this person doesn't know what they're doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1421.99,
    "end": 1425.071,
    "text": "And I don't even like know where we're going.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1425.171,
    "end": 1426.251,
    "text": "This is really scary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1427.171,
    "end": 1439.214,
    "text": "Um, and so I do want to touch on this later, but like, it's one thing recognizing duality in yourself and on a small management team, how you talk about duality in a broader organization is like a whole different animal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1440.234,
    "end": 1442.595,
    "text": " And so I hope we can talk about that more a little bit later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1442.615,
    "end": 1447.636,
    "text": "Yeah, thanks for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1450.936,
    "end": 1461.899,
    "text": "Okay, so we talked last time also about the quantum duality and what does Bijan mean, and we knew that he would really kind of unwrap it here in this chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.88,
    "end": 1469.366,
    "text": " I guess like we've seen duality like we are able to like hold simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.546,
    "end": 1471.989,
    "text": "It's simultaneously a one and a zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.009,
    "end": 1479.637,
    "text": "And so we were wondering if what was really meant by duality like in the quantum sense was more like this superposition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.422,
    "end": 1499.677,
    "text": " um angle and so it it seems like yes um uh based on even this quote from the book so bajan says it is important to appreciate that many dichotomies that have divine defined the science and practice of strategy management such as firm versus environment executive leadership versus non-executive board",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.598,
    "end": 1519.553,
    "text": " individual versus firm, exploitation versus exploration, financial control versus strategic control, formal versus informal channels, and flexibility versus stability, for example, are less and less dichotomous in a distributed and discontinuous world, but coexist in superposition as duality or synchronicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.754,
    "end": 1525.457,
    "text": "So I think that this kind of maybe answers that question for us from last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.498,
    "end": 1527.559,
    "text": "Do you guys have any comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.578,
    "end": 1533.039,
    "text": " Okay, so, oh, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.02,
    "end": 1542.385,
    "text": "Yeah, some of those dualities are raised as a partition, like firm from environment or organism versus environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1543.045,
    "end": 1546.067,
    "text": "It's a partition that is an integrated whole.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1546.907,
    "end": 1557.394,
    "text": "And so that is part of this framing question, seeing it as an integrated unit, but also containing separate aspects.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1558.274,
    "end": 1585.237,
    "text": " and then also quantum carries a lot of baggage whether somebody's familiar with what it technically means or not dualities in the quantum space could refer to wave particle it could refer to observer observed and so i think it needs a lot more operationalism to have utility beyond a sort of like evocative quantum management and then again to come back to tyler's point which i want to hear more about um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1586.098,
    "end": 1589.119,
    "text": " If you say, well, we're actually doing all the strategies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1589.499,
    "end": 1590.139,
    "text": "It's like a wave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1590.459,
    "end": 1592.62,
    "text": "You thought we were going to go to one strategy or the other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1593.1,
    "end": 1595.581,
    "text": "We're going to be probabilistic across all of them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1596.141,
    "end": 1597.082,
    "text": "How does that work?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1603.504,
    "end": 1604.964,
    "text": "Tyler, I'm waiting for your comeback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.124,
    "end": 1606.905,
    "text": "Oh, well, I mean, honestly, like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1608.583,
    "end": 1610.244,
    "text": " I have actually a strategy of how I do this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1610.824,
    "end": 1616.047,
    "text": "And I just don't necessarily communicate broadly that we're doing all of the strategies probabilistically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1616.407,
    "end": 1622.79,
    "text": "Like, like, I might know that and maybe a couple other people know that we're like, kind of like, keeping our options open for a bunch of different avenues.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1623.37,
    "end": 1625.511,
    "text": "But you communicate something that's much more clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1626.831,
    "end": 1628.652,
    "text": "You can't, I don't think you get to do both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1628.932,
    "end": 1630.213,
    "text": "You don't get to communicate that broadly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1632.833,
    "end": 1638.081,
    "text": " it's just not consumable by other people and it doesn't give them like, it's not really actionable by them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1638.141,
    "end": 1641.566,
    "text": "So you can't say we're doing all the strategies because they're like, cool, but how do I fit into this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1641.586,
    "end": 1646.813,
    "text": "You have to say like, well, this is broadly what we're doing and this is how you're going to fit into it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1647.414,
    "end": 1647.795,
    "text": "And so, yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1649.13,
    "end": 1653.353,
    "text": " Also, action helps cut this knot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1653.874,
    "end": 1662.08,
    "text": "So for any given search space, it's not possible to have one parameter value that is maximizing exploitation and exploration.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1662.32,
    "end": 1675.751,
    "text": "That gets into the sort of like, I'm everywhere on the number line at once type thinking, but action allows us to say, well, our strategy is we're going to move quick, but as soon as criteria one, two, and three are met, then we're going to lock in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1676.471,
    "end": 1686.174,
    "text": " So that's actually a plan that you can have precision about that embodies in another variable space, explore, exploit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1686.714,
    "end": 1692.436,
    "text": "But where we have precision about is about action, which is what his whole emphasis is on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1693.979,
    "end": 1701.38,
    "text": " Actually, and that reminds me, another strategy I use too is that you explicitly frame it around exploration and that you're waiting for something to exploit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1701.42,
    "end": 1706.741,
    "text": "So you're saying like, hey, all right, we're going to build this thing and we're not sure like who's going to even use this, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1706.781,
    "end": 1707.601,
    "text": "But we're going to build this thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1707.621,
    "end": 1712.382,
    "text": "We have a hypothesis that these kinds of people might use it and then we're going to see who uses it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1712.762,
    "end": 1717.943,
    "text": "And that's like the experiment we're running together as a company is this like defined scope explore stage.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1718.523,
    "end": 1721.124,
    "text": "And then once we run that experiment, then we move to exploit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1721.684,
    "end": 1726.973,
    "text": " And so you can kind of clearly do that within an organization of how you're switching between these different modes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1731.621,
    "end": 1731.861,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.083,
    "end": 1733.164,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.012,
    "end": 1746.377,
    "text": " Bichon says, therefore, to effectively operationalize dynamic capabilities triplet of sensing, seizing and reconfiguring, we need a model that dynamically links dynamic capabilities triplet with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.777,
    "end": 1749.958,
    "text": "This is free energy governance's underlying and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.658,
    "end": 1751.719,
    "text": "One, active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.398,
    "end": 1765.929,
    "text": " acting sensing two sensory states perception sensing sense making and seizing the opportunity and three internal states firm resources resource configuration and four external states unknown hidden",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.86,
    "end": 1774.228,
    "text": " are all linked in circular causality conditioned by the internal external Markov blanket and governed by free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.749,
    "end": 1776.511,
    "text": "And so I just thought it was interesting here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.551,
    "end": 1783.92,
    "text": "Like we can go back and look here at the three pillars, like the sensing, seizing and like reconfiguring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.821,
    "end": 1787.504,
    "text": "And like for me, like the sensing part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.026,
    "end": 1799.063,
    "text": " like goes here, like in this action sensing or sensing is like in sensory states, but like seizing the opportunity as a sensory state, like totally threw me off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.218,
    "end": 1810.527,
    "text": " Like, is it just me, like a sensory, like sensing the opportunity is like one thing, but like leveraging an opportunity as like a sensory state, like that seems more like an action state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.987,
    "end": 1814.43,
    "text": "I don't know if it's just me or like what you guys think about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.211,
    "end": 1819.094,
    "text": "Because I was kind of like, whoa, seizing the opportunity is a sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.994,
    "end": 1822.977,
    "text": "Well, for example, in seizing, he included like creating your business model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.891,
    "end": 1828.635,
    "text": " And so that is, I think, part of sense-making because you're like, this is how we relate to the ecosystem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1829.295,
    "end": 1832.738,
    "text": "So it's like action, like it is action-centric, but this is also sensory or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1832.958,
    "end": 1836.181,
    "text": "Well, this is the kind of like information that we're going to collect from the environment as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1837.061,
    "end": 1842.385,
    "text": "And so I think you're kind of doing both the action and perception when you're doing season.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1842.405,
    "end": 1844.367,
    "text": "Can you say like, this is how I'm going to relate to my environment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1844.387,
    "end": 1850.972,
    "text": "I'm not sure if that's exactly what you're saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1851.761,
    "end": 1859.091,
    "text": " I think this is an attempt to coerce, for better and for worse, a triplet",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1860.504,
    "end": 1889.705,
    "text": " into the particular partition where blankets are defined as graph bayesian graph where there are nodes that make two other sets of nodes conditionally independent and i think we've seen in the philosophical and application settings a lot of challenges with people simply coercing a naturalistic understanding of how things are in the world with this bayesian graph formulation like here we have active states action slash sensing",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1891.067,
    "end": 1895.088,
    "text": " action states are the outgoing statistical dependencies of an entity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1895.108,
    "end": 1896.848,
    "text": "So yeah, they are action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1897.649,
    "end": 1904.13,
    "text": "And if you think about active sensing, then they're sort of elusively related to sensing, but it's not a sense state.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1904.83,
    "end": 1911.732,
    "text": "And so how much are we going to have both feet in the technical formalism of the particular partition",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1912.512,
    "end": 1921.765,
    "text": " And to what extent are we kind of leaving one foot on the formalism and then pivoting around and trying to draw in some other frameworks and draw concordances?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1925.35,
    "end": 1932.454,
    "text": " So I agree that it's like a coerced, like moving the triplet into this particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.755,
    "end": 1939.098,
    "text": "But I just don't know if seizing the opportunity is something that I would include as a sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.239,
    "end": 1947.043,
    "text": "I think that that's something that I would put, like even in constructing a business plan, like that's still an action that you take on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.123,
    "end": 1952.626,
    "text": "So that's something that's outgoing, not something that's necessarily incoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.767,
    "end": 1954.888,
    "text": "And that's just how I would frame it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.948,
    "end": 1958.089,
    "text": " or like the way that made more sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.169,
    "end": 1963.91,
    "text": "So I just found this a particularly curious area to put it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.971,
    "end": 1972.072,
    "text": "But yeah, we can move on and talk about, we can ask Bijan why he put it there, hopefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.292,
    "end": 1975.953,
    "text": "And then we can talk about this antagonistic neural networks perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.572,
    "end": 1988.92,
    "text": " So Bajan says, antagonistic neural network perspectives is established and applied as the neuroscientific basis for duality management, managing the existing while contradicting the present to develop the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.401,
    "end": 1997.686,
    "text": "It is the form of organizational learning that strategic management literature has labeled ambidexterity, co-managing exploitation and exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.627,
    "end": 2026.566,
    "text": " In neuroscientific terms, the antagonistic relationship is between two large-scale cortical networks, the task-positive network, TPN, and the default mode network, DMN, which, simply put, are neuroanatomical representations of top management's day-to-day task-specific focus on exploitation, the task-positive network on the one side, and the rather non-routine divergent and creative thinking that initiates exploration and strategic renewal, the default mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.377,
    "end": 2035.663,
    "text": " And so I thought this was super interesting and took like a deeper dive into like looking up the reference for that quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.744,
    "end": 2048.494,
    "text": "And so here in this paper, Antagonistic Neural Networks Underlying Differentiated Leadership Roles by Boyatzis and Rochford and Jack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.295,
    "end": 2066.559,
    "text": " They say the antagonistic relationship between the task positive network and the default mode network creates a fundamental neural constraint on cognition that is highly relevant to the different roles and capabilities that effective leaders must astutely juggle and deploy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.159,
    "end": 2074.461,
    "text": "An important consequence of this constraint is that an overemphasis on task-oriented leadership can prove deleterious to an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.041,
    "end": 2094.378,
    "text": " in particular when openness to new ideas people emotions and ethical concerns are important to success on the other hand the over emphasis on relationship oriented leadership may prove deleterious to focus and the execution of clearly defined goals um and i thought that this was really cool um i i just have never like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.27,
    "end": 2121.278,
    "text": " thought about leadership like this but but it's definitely there's like the people component and like the gsd component like getting stuff done um and and like leadership requires both and like you can't like you need to have both and i also thought like that the ambidexterity here like where bishan talks about is like interesting because like you think about like organizations and you always hear like the phrase like the left hand doesn't know what the right hand is doing and i wonder if like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.778,
    "end": 2130.201,
    "text": " That's why this different management role or dichotomy is labeled ambidexterity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.882,
    "end": 2133.863,
    "text": "Which came first, the chicken or the egg here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.883,
    "end": 2135.403,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.423,
    "end": 2136.604,
    "text": "Do you guys have any comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.585,
    "end": 2146.788,
    "text": "One thing I thought was interesting here is on one level, there's this analogy between the default mode network and the test positive network with what you might find in an organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2147.577,
    "end": 2164.664,
    "text": " But I thought what was interesting too is thinking about how the individual relates to the organization and that like, you know, the creativity that an individual or leader can exercise is kind of constrained by the antagonistic relationship between their own task positive and default mode network, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2165.504,
    "end": 2165.644,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2166.328,
    "end": 2171.729,
    "text": " You know, it's one thing for people to say like, yes, like you need to have this antagonistic relationship and there needs to be this balance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2172.309,
    "end": 2183.631,
    "text": "But the people that's the ability for the organization to do that is constrained by the people within that organization, their own individual abilities to kind of switch between these two these two systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2184.571,
    "end": 2186.692,
    "text": "And, you know, it's it's kind of a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2186.972,
    "end": 2194.913,
    "text": "I guess you're basically like the organization's ability to do this runs up against the biology of like the individuals and their own ability to switch between these different modes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2195.475,
    "end": 2199.797,
    "text": " And I think that ability to kind of run in these two modes in parallel is quite rare.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.817,
    "end": 2207.161,
    "text": "And it's one thing to ask your leaders to have it, but to ask your entire organization to have it, it's like a whole much different and much bigger ask.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.841,
    "end": 2219.147,
    "text": "And so one of my things I keep thinking about when I'm going through this book is like, to what extent does the full organization need to have internalized like duality management, or is it really just the leaders?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2219.187,
    "end": 2220.908,
    "text": "Or I think what Bajon would say is like the board.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2221.621,
    "end": 2226.004,
    "text": " But that doesn't seem to connect each level of the hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2226.064,
    "end": 2232.668,
    "text": "It seems like each level of the hierarchy should be able to manage these two different modes of processing, but it's a rarer skill.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2232.688,
    "end": 2234.189,
    "text": "So how is that even possible to do?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2236.33,
    "end": 2239.732,
    "text": "Yeah, few more.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2239.972,
    "end": 2247.056,
    "text": "One is the switching, which is sometimes even potentially faster than a second.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2248.283,
    "end": 2270.985,
    "text": " of our own behavior or neurophysiology from task oriented to mind wandering and to what extent we sometimes just zone out thinking daydreaming reflecting integrating looking at our schedule looking at our inbox like it's not task driven but that is like a space that can then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2272.577,
    "end": 2298.674,
    "text": " transition into a task not always the task we want but it can transition to a task so that's kind of cool and antagonistic is one way to frame it you could also call them synergistic or synergetic because they're part of that unity is plural and at minimum two angle where no single neural network could be tuned to be able to be both diffusive and task oriented",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2299.534,
    "end": 2313.756,
    "text": " So why not have some type of oscillatory process that enables those two modes, like having a forward and a reverse in a car instead of trying to make one gear that can do two things that are contradictory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2318.885,
    "end": 2321.167,
    "text": " Yeah, it's a super good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.748,
    "end": 2330.898,
    "text": "And in this paper, they really talked about, they went in greater detail about the task positive network and the default mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.038,
    "end": 2336.324,
    "text": "And they said that the task positive network is activated during a broad range of non-social tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.824,
    "end": 2342.088,
    "text": " and is thought to be important for problem solving, focusing attention, making decisions and control of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.188,
    "end": 2343.75,
    "text": "In other words, for getting things done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.27,
    "end": 2351.375,
    "text": "However, activation of the task positive network also has a deleterious effect on other cognitive functions that are essential to leadership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.556,
    "end": 2355.739,
    "text": "It suppresses activity in the default mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.643,
    "end": 2365.527,
    "text": " And similarly, the default mode network plays a role in emotional self-awareness, social cognition, and ethical decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.987,
    "end": 2370.009,
    "text": "It is also strongly linked to creativity and insightful problem solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.369,
    "end": 2377.893,
    "text": "And then the activation of the default mode network, they said elsewhere, inhibits the task positive network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.033,
    "end": 2382.976,
    "text": "So I thought that there's like this like need, and it is like, you know, unity, you need both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.356,
    "end": 2386.758,
    "text": " You can't constantly be focused on a task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.898,
    "end": 2388.358,
    "text": "You guys know how that feels, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.378,
    "end": 2390.319,
    "text": "To just be like, ugh, I'm out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.479,
    "end": 2391.44,
    "text": "You have to have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.14,
    "end": 2396.742,
    "text": "You need to have work and play in order for some kind of balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.122,
    "end": 2400.844,
    "text": "It is unifying to be balanced, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.996,
    "end": 2418.733,
    "text": " Just one thing that's made me remember, I think I've actually mentioned this in a previous stream, but in regards to switching between the two gears of the car rather than trying to run them both at the same time, one way that this was phrased to me by one of my previous CEOs was,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2419.253,
    "end": 2421.395,
    "text": " you have like art projects and you have science projects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2421.915,
    "end": 2427.038,
    "text": "And so like your art being your default mode projects, your science being your task positive projects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2427.359,
    "end": 2430.04,
    "text": "And like explicitly saying like, we are in art mode right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2430.441,
    "end": 2432.322,
    "text": "Like don't hold us accountable to any metrics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2432.782,
    "end": 2438.346,
    "text": "Like this is an art project we're exploring versus science, which is like, hold me accountable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2438.426,
    "end": 2440.247,
    "text": "And that means hold me accountable to metrics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2440.708,
    "end": 2443.77,
    "text": "Like I'm going to set a number and I'm going to hit that number.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2444.37,
    "end": 2446.271,
    "text": "And like, that's how I should be evaluated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2446.631,
    "end": 2448.593,
    "text": "And so I think there are ways you could probably like frame,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2449.273,
    "end": 2472.238,
    "text": " switching between these modes in an organization yeah thank you tyler and one biological angle on this sometimes this type of oscillation is called a winnerless competition and it's modeled using predator prey type dynamics uh latke volterra is the name of the dynamical formalism and in the spm",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2472.967,
    "end": 2477.19,
    "text": " textbook and package from Carl Friston and colleagues earlier work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2477.77,
    "end": 2485.615,
    "text": "There's a lot of examples of winnerless competition, Laka-Volterra models being used to model activity amongst different brain regions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2486.275,
    "end": 2492.459,
    "text": "And this winnerless competition is an interesting framing on everything from attention to sleep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2492.959,
    "end": 2497.502,
    "text": "It's like sleep is not trying to be 100% of the time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2497.962,
    "end": 2499.904,
    "text": "Wakefulness is not trying to be 100% of the time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2500.424,
    "end": 2501.385,
    "text": "They inhibit each other",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2502.634,
    "end": 2530.633,
    "text": " until there's a phase transition and then it's like a dwell in one state and then that inhibition shifts and one oscillates back and so similarly like a predator doesn't over the long run really want to eradicate the prey but their populations fluctuate and that's a winnerless competition and in fact that's a co-winning competition and just one last point um i remember in the selfish gene some of the discussion of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2531.676,
    "end": 2550.229,
    "text": " out there on the savannah look at the cheetah eating the gazelle how can one say that that's like a mammal level selection at play that doesn't make any sense it's like but actually if that ecological relationship weren't there then neither population would have the resilience",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2551.314,
    "end": 2564.598,
    "text": " So how we frame things and especially the level of holism that we bring is going to set the stage for whether we see something as sustainable or unsustainable, adversarial or non-adversarial.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2570.22,
    "end": 2571.721,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.681,
    "end": 2575.162,
    "text": "Okay, so moving on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.147,
    "end": 2592.48,
    "text": " Bijan says, free energy governance is firmly rooted in the belief that in a discontinuous and distributed world, the marginal benefit of structural reorganizations as well as structural compartmentalization of exploitation and exploration are rather suboptimal or possibly counterproductive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.941,
    "end": 2601.087,
    "text": "Competitiveness and survival are increasingly determined by the extent to which a system is rather less rule or top-down supervised learning based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.708,
    "end": 2605.411,
    "text": "Exploration happens increasingly in real time within exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.051,
    "end": 2612.194,
    "text": " In effect, the emergence of the new is essentially hypothesis testing within the existing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.354,
    "end": 2624.761,
    "text": "And I really liked this, like, like, Daniel, you had mentioned earlier about, like, is this a partition or is this like a nesting and like this exploration and exploitation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.702,
    "end": 2633.026,
    "text": " is a partition and also is like a nesting based on what Bijan says here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.867,
    "end": 2646.214,
    "text": "He also says, in a distributed and discontinuous market environments, the real leadership challenge is to de-antagonize the past positive network default mode network dichotomy in the form of duality management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.234,
    "end": 2649.016,
    "text": "Do you guys have any comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.036,
    "end": 2653.319,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.338,
    "end": 2655.058,
    "text": " Moving on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.118,
    "end": 2656.899,
    "text": "Do you want to read these claims, Tyler?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.739,
    "end": 2657.979,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2658.379,
    "end": 2669.002,
    "text": "FEG's cross-hierarchical connectivity logically concludes that managing the TPN-DMN antagonism is not a top-down challenge calling for structural compartmentalization, but one of duality management.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2669.242,
    "end": 2679.245,
    "text": "By vacillating between or among discrete formal organization nodes, which is centralization and decentralization, the organization may increase dynamically the levels of exploration and exploitation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2679.901,
    "end": 2683.662,
    "text": " beyond those achievable through an approach based strictly on a static design choice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2683.962,
    "end": 2689.443,
    "text": "In summary, we must conceive organizing as an informally deep learning and self-designing compass.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2689.883,
    "end": 2701.025,
    "text": "Centralizing intelligence at any hierarchical level of the organization can be counterproductive, increasing free energy, promoting entropy, and eventually capitulating to TPN, DMN's antagonistic forces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2702.946,
    "end": 2703.506,
    "text": "So I think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2704.255,
    "end": 2718.759,
    "text": " One thing you might have been referencing here is when you're structurally trying to create your DMN and TPN and having them separate from each other, this is what's traditionally done in companies with having an R&D department, where this is where all the new ideas come from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2719.499,
    "end": 2724.58,
    "text": "And so I think he was juxtaposing the FPG approach to that very traditional model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2728.762,
    "end": 2728.942,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.231,
    "end": 2734.912,
    "text": " So we'll move on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.453,
    "end": 2741.898,
    "text": "So he gives here the free energy governance response to the task positive network default mode network challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.988,
    "end": 2745.67,
    "text": " And it's this threefold response and he says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.49,
    "end": 2758.817,
    "text": "Sensitizing the entire organization in regard to upper echelons, tendency to top down extrapolating is dominant, supervising knowledge structures, logic and past experience as a guide and prediction for future success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.398,
    "end": 2762.74,
    "text": "A fallacy that task specific exploitation tends to reinforce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.695,
    "end": 2776.278,
    "text": " Embracing strategic renewal as a matter of continuous deep learning in the form of cultivating cross-hierarchical processes, empowering purpose-directed and action-generated bottom-up market stimuli as a basis for double-loop learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.458,
    "end": 2779.259,
    "text": "Question the very models that generate the top-down predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.819,
    "end": 2788.781,
    "text": "And three, default abductive attentional engagement at every level of the organization forms the basis for effective top-down bottom-up prediction error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.521,
    "end": 2810.585,
    "text": " After noticing an environmental change is essential to question 1's understanding of how the subsystems of the environment technology and markets and the organization knowledge and goals are linked without losing sight of the fact that environment is not objectively defined, but a product of action generated and socially constructed shared meaning and expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.596,
    "end": 2835.749,
    "text": " so i think this is like how the duality management works essentially um that's kind of what what i took home here tyler do you have comments yeah and just that like these are all really big asks to make up an organization at every level like i think it's one thing to say like yeah i agree that this is the answer and if this could be done like be like hell yeah like i'm all for it but i again feel like you're kind of running up against",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2836.294,
    "end": 2843.98,
    "text": " people's individual abilities to manage duality just within themselves and that will constrain your ability to do this within the organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2849.264,
    "end": 2857.991,
    "text": "It's funny because I think about the cognitive cone that we talked about with Michael Levin and it's funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.657,
    "end": 2862.179,
    "text": " What you just said, it's like the flip of the cognitive cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.219,
    "end": 2873.945,
    "text": "So usually it's like the, you know, the, the larger structure, or, like, the more top level hierarchical structure will cognitively constrain, like, things that are nested within it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.005,
    "end": 2878.488,
    "text": "So the shape of that cone, the shape of the individuals within that can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.041,
    "end": 2882.603,
    "text": " be any other shape, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.643,
    "end": 2886.026,
    "text": "So they can't come out of the cognitive cone of the entire organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.847,
    "end": 2901.041,
    "text": "But it's interesting to think about how what is happening at the individual level, like the shape of the individual cognitive cone also lends itself to the configuration of the higher level cognitive cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.842,
    "end": 2902.623,
    "text": "Daniel, do you have comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.643,
    "end": 2903.624,
    "text": "I see you're writing furiously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.784,
    "end": 2903.864,
    "text": "No?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.743,
    "end": 2909.806,
    "text": " Drawing furiously, doodling furiously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.288,
    "end": 2916.352,
    "text": "Okay, so Bichon goes on to say, talk about a salience trap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.752,
    "end": 2921.376,
    "text": "He says, while salience is critical to an active inference, it can nonetheless",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.117,
    "end": 2933.62,
    "text": " potentially increase free energy to empower abductive sensemaking so that weak signals can serve as an information-rich enhancement to predictions processing, listening to what wants to emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.06,
    "end": 2946.403,
    "text": "Organizational design is challenged to neutralize the tendency of experienced managers and board members to over-confidently superimpose the potential fallacy of their historic and self-confidence-powered pattern recognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.083,
    "end": 2976.256,
    "text": " since the human brain's task positive network and default mode network spheres are antagonistically related the only way to embrace antagonism as duality is by linking in circular causality top-down predictions and bottom-up stimuli um and so here is it i think that um bijan is really uh maybe kind of criticizing or or like the maybe not criticizing maybe uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.478,
    "end": 2993.97,
    "text": " I don't know, maybe criticizing is the right word, like how experience leads you to prioritize, like leads you to place importance on things that and maybe perhaps miss things that are important in an adaptive organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.99,
    "end": 2995.111,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.131,
    "end": 2995.932,
    "text": "Do you guys have comments here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.305,
    "end": 3020.135,
    "text": " drawn to the salience not to the meaningful or adaptive necessarily we hope that our salience field can be aligned with what's adaptive and meaningful but i think we found out that that is not always the case",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3023.883,
    "end": 3026.786,
    "text": " And it's funny, like I think about just in scientific discovery, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.826,
    "end": 3028.107,
    "text": "Like how we're so attuned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.308,
    "end": 3030.87,
    "text": "We're looking for the signal that we're looking for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.89,
    "end": 3039.038,
    "text": "It takes like a very perceptive and adept scientist to not fall into that salience trap and perhaps notice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.939,
    "end": 3062.872,
    "text": " um what's going on in the periphery right like even though this is the center this is what we're focusing on there's a lot of peripheral things happening that that might actually be important or as important or maybe more important than than the central thing that we're focused on um yeah i mean i guess the other thing i say is that this is just like another it's one of those things where i agree with this and like theoretically but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.141,
    "end": 3066.583,
    "text": " There's so much stress going to many of these decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3066.623,
    "end": 3073.289,
    "text": "For example, if you have to do layoffs, for example, it is very time sensitive and the stakes are really high.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3073.81,
    "end": 3080.516,
    "text": "And so going off your previous experience can be really helpful in there because you have to just make a really quick decision.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3080.656,
    "end": 3084.939,
    "text": "And it's often going to be heuristic space, which may be not necessarily optimal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3085.64,
    "end": 3089.062,
    "text": " But you really are often constrained by your time and resources.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3089.082,
    "end": 3096.086,
    "text": "And really processing all of your bottom up signals, even with the best intentions, is really hard to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3096.946,
    "end": 3100.508,
    "text": "And so again, it's not to say you shouldn't try to do it or it can't be done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3100.568,
    "end": 3104.77,
    "text": "But it's another one of these things where like, hey, this is a really big ask.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3104.85,
    "end": 3109.153,
    "text": "I just want to call out this is really, really, really, really hard to do, especially when you're under the gun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3114.591,
    "end": 3117.358,
    "text": " Yeah, I can see this is in the ideal world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.419,
    "end": 3118.481,
    "text": "This is how it works, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.707,
    "end": 3123.094,
    "text": "Okay, do you want to read this claim for us, Tyler?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.166,
    "end": 3144.321,
    "text": " All right, so indeed, this real-time switching and vacillation process cannot be relegated to a single person, be it a CEO or executive chairman or upper echelon as a team, but must be the result of an unsupervised and FEP-determined learning process that relates top-down predictions and bottom-up data input in circular causality that dictate resource reconfiguration accordingly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3144.781,
    "end": 3149.805,
    "text": "Consequently, the board's potentially unique DMN dimension cannot be ignored, but must be integrated into the process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3150.445,
    "end": 3179.009,
    "text": " at the very top the board of directors given this cognitive diversity and composition and cognitive distance firms dominant tpn exploitation logics emerges as a monitoring surveyor of the system that is centered around managing the dynamic interplay of dual forces exploitation exploration and financial and strategic control um yeah i mean something i thought was interesting here is that like you know why he's making this claim and which he's been doing through the whole book about like hey the board is in this really unique position to be this kind of like an integrated unit",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3179.969,
    "end": 3184.55,
    "text": " that kind of comes back to what you were saying earlier of like, okay, who was actually doing this duality management?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3185.01,
    "end": 3195.193,
    "text": "And so in one sense, I'm like, okay, it makes sense that the board would be doing this because you can hold them accountable to holding these different ideas in their head at the same time, uh, managing duality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3195.853,
    "end": 3203.235,
    "text": "But it seemed, I would think that you would need that duality management to be going down the hierarchy, not just at the border as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3203.455,
    "end": 3206.036,
    "text": "And that each level of the hierarchy is managing duality in some sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3206.796,
    "end": 3206.896,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3208.235,
    "end": 3212.196,
    "text": " So I very much want to ask for John that when we get on a call with him.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3217.478,
    "end": 3218.798,
    "text": "Blue, Daniel, anything to add here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.86,
    "end": 3226.061,
    "text": "No, but this is one sentence that I pulled out randomly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.045,
    "end": 3234.167,
    "text": " from the chapter that just like struck me and like he just like threw it in here and didn't unpack it or anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.587,
    "end": 3238.268,
    "text": "The firm is the generative social field and emerges in language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.628,
    "end": 3240.948,
    "text": "And I thought that this was like really profound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.089,
    "end": 3243.289,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.369,
    "end": 3246.89,
    "text": "I just put it in here because like, just like, wow, that's very deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.67,
    "end": 3248.831,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.851,
    "end": 3254.112,
    "text": "I don't know if you guys have comments or this is something like I would ask Bajan to expand upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.172,
    "end": 3277.761,
    "text": " could ask a hundred people with different backgrounds what this invokes for them and see where that goes that sounds like a fun project it was just like a like a sentence that seemed very like yeah deep and like just casually thrown in there yeah so i'm gonna get this tattooed on my chest",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3279.747,
    "end": 3309.334,
    "text": " right put it on your next business card that'd be awesome that'd be an awesome like statement for a business card right um that'd be great what so what is it you say you do i don't know i guess that's true this is a business philosophy awesome so do you guys have any final like comments questions tyler did you tell us all the things you wanted to tell us no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.895,
    "end": 3310.355,
    "text": " That's it for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3310.375,
    "end": 3311.896,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3312.996,
    "end": 3315.316,
    "text": "Yeah, we're moving along through the structure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3315.336,
    "end": 3330.46,
    "text": "I'm looking forward to more conversations and also some digestions and reflections, making some schemes to visualize at a high level what we've been coming away from because this is like our eighth session.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3330.54,
    "end": 3337.582,
    "text": "And I think we're starting to see his patterns and style of laying out what he wants to convey and integrate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3340.401,
    "end": 3343.882,
    "text": " Yeah, I definitely think we're getting like the repeat, like repeat the message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.022,
    "end": 3347.783,
    "text": "And so, so it's starting to drive some of it home for me at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.123,
    "end": 3358.565,
    "text": "So coming up to the end of the second part of the book next week, and I'll be looking forward to that and to hopefully discussing with the author at his convenience that that part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.866,
    "end": 3361.226,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.386,
    "end": 3362.446,
    "text": "Well, thank you, Blue and Tyler.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3362.546,
    "end": 3362.886,
    "text": "Farewell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3364.107,
    "end": 3364.267,
    "text": "Bye.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3364.427,
    "end": 3364.567,
    "text": "Bye.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3374.502,
    "end": 3375.21,
    "text": " Next week, same time.",
    "speaker": "SPEAKER_01"
  }
]