[
  {
    "start": 9.144,
    "end": 10.424,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.205,
    "end": 13.545,
    "text": "It's December 27th, 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.006,
    "end": 18.767,
    "text": "We're in Act-Inf Bookstream number 001.03.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.707,
    "end": 24.789,
    "text": "We're in the third in a series of discussions on governing continuous transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.109,
    "end": 30.291,
    "text": "Off to you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.351,
    "end": 31.531,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.551,
    "end": 38.273,
    "text": "So this Bookstream is going to be part of an ongoing series of Bookstreams at the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.909,
    "end": 47.513,
    "text": " So please get in touch if you would like to participate either in one of these dot zero contextualization videos or an upcoming discussion over the material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.154,
    "end": 51.295,
    "text": "And these are all of our links here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.655,
    "end": 54.396,
    "text": "This is a participatory online lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.756,
    "end": 62.9,
    "text": "We are open to interacting with anyone, no matter what your level of expertise is in active inference or governance or other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.52,
    "end": 66.942,
    "text": "So the goal of this book stream is to discuss chapter three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.671,
    "end": 72.992,
    "text": " We're going to go over the book map and roadmap and the keywords of the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.012,
    "end": 77.653,
    "text": "And then there's two sections that kind of fell out of this chapter three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.133,
    "end": 79.153,
    "text": "So we'll split those up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.833,
    "end": 83.574,
    "text": "So we can just maybe introduce ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.794,
    "end": 84.934,
    "text": "So I'm Blue Knight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.994,
    "end": 88.615,
    "text": "I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.195,
    "end": 91.055,
    "text": "And I'll pass to Tyler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.075,
    "end": 93.735,
    "text": "How's it going?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 93.935,
    "end": 94.716,
    "text": "I'm Tyler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.776,
    "end": 97.076,
    "text": "I'm more of a DAO practitioner out of California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.502,
    "end": 122.289,
    "text": " i'm daniel i'm a researcher in california and as this is our year closing book stream and this is going to be focusing on some board and strategy related topics i think it'll be interesting to talk about reflection and how do we look back how do we now cast how do we look forward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.382,
    "end": 125.642,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.702,
    "end": 138.225,
    "text": "Yeah, I'm definitely excited to align the material that is presented in the book with the ongoing development of strategy and governance in Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.445,
    "end": 140.766,
    "text": "So that's for me what I'm excited about today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.827,
    "end": 153.469,
    "text": "OK, so this chapter is Micro Foundations of Strategic Governance, and the two sections are the role of the board and models of board cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.158,
    "end": 158.001,
    "text": " So Tyler, do you want to read this section of the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.781,
    "end": 159.041,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.442,
    "end": 159.962,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.982,
    "end": 161.904,
    "text": "So there is no universal governance model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.024,
    "end": 169.21,
    "text": "The strategic role of the board does vary as a function of culture, laws, governance, orientation, ownership, structure, and firm context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.77,
    "end": 183.001,
    "text": "The period of 1998 to 2001, the time of financial markets, irrational exuberance dominated by governance orientation centered around stock price considerations has given birth to today's compliance-driven governance logic ruling public companies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 183.701,
    "end": 190.663,
    "text": " Simply put, ever since corporate governance has been estranging the board, that's a uniquely integral part of the strategy process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.724,
    "end": 202.967,
    "text": "Coincidentally, during this very period, management research started complementing their two demographic input-output models with behavioral and cognitive dimensions, opening a new conversation around the cognitive micro-foundations of board effectiveness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.287,
    "end": 209.369,
    "text": "To this day, the study of the board's strategic role remains confined to the boardroom and treats environment as an exogenous variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.95,
    "end": 212.07,
    "text": "Lou, you want to take the next half?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.286,
    "end": 229.598,
    "text": " The top-down cultivated hierarchical disconnect so characteristic of traditional corporate governance and strategy processes is more likely to fuel prediction error, reinforcing the perception that the world is unpredictable and uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.439,
    "end": 239.567,
    "text": "Indeed, the very limitations of corporate governance research may be an astute reflection of the very real and often self-inflicted limitations of the board's strategic role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.407,
    "end": 244.968,
    "text": " Shareholders are challenged to ensure that the board's full strategic potential is not wasted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.528,
    "end": 250.45,
    "text": "More specifically, there is a need for a new self-organizing governance logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.731,
    "end": 254.031,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.251,
    "end": 256.832,
    "text": "Tyler, do you want to read this, the role of the board?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.972,
    "end": 258.392,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.492,
    "end": 265.314,
    "text": "So the first section here is the role of the board, and then we'll go into really different models of thinking about board cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.654,
    "end": 268.235,
    "text": " So we'll start this quote from Sean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.735,
    "end": 270.355,
    "text": "There's no universal governance model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 270.375,
    "end": 282.778,
    "text": "The strategic role of the board does vary as a function of culture, laws, governance, orientation, ownership, structure, public, private, equity, founder, family led, controlled or combination thereof in firm specific context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.939,
    "end": 285.839,
    "text": "All right, let's go to the next one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 287.376,
    "end": 288.857,
    "text": " Yeah, this is upper echelon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.017,
    "end": 295.961,
    "text": "So, you know, not being familiar with like a lot of business like vernacular, I just stuck this in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.041,
    "end": 298.542,
    "text": "So it's the high level of command authority or rank.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.323,
    "end": 303.885,
    "text": "And this can be like top level management or the board of directors or both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.606,
    "end": 310.049,
    "text": "It seemed like that there was not like it wasn't specifically defined in the book as we're reading it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.169,
    "end": 313.991,
    "text": "But Tyler, do you have any thoughts on that specifically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.051,
    "end": 315.212,
    "text": "Like, what do you think Bajon means?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.112,
    "end": 323.058,
    "text": " Yeah, my understanding is that it was a combination of both the board and the top management structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.879,
    "end": 326.061,
    "text": "So yeah, you left it pretty vague, but that's my understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.143,
    "end": 333.126,
    "text": "All right, so we'll start off talking about what a board could be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 333.787,
    "end": 338.591,
    "text": "And so this is Bijan's definition of what a board could mean and not necessarily what it does mean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.091,
    "end": 342.214,
    "text": "So the board of directors is a unique integral part of a firm's operatulon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.987,
    "end": 355.791,
    "text": " It asks from within and without the firm as a boundary spanner and should encapsulate strategy processes, constructive tension between organization and an active environment, exploitation and expiration, as well as financial and strategic controls.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 357.152,
    "end": 360.253,
    "text": "And so I think even people outside of an active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 360.993,
    "end": 370.659,
    "text": " free energy governance context would probably agree with roughly this, this definition is that like, a board should be this collective governing body that use their collective wisdom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.679,
    "end": 380.304,
    "text": "Because that the idea is that is greater than just like one person at the top, making all the decisions and that that collective wisdom, something interesting and unique comes out of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.225,
    "end": 383.366,
    "text": "That's not necessarily what always happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 383.426,
    "end": 384.847,
    "text": "Oftentimes, it's not exactly what happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.967,
    "end": 386.368,
    "text": "So let's go to the next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.108,
    "end": 391.955,
    "text": " we're talking about different, so these are different ways of thinking about how a board like actually functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 392.616,
    "end": 401.689,
    "text": "And there's like a lot of different ways, like board, the board's role and like what they actually do, an organization varies considerably across a lot of different dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.421,
    "end": 407.523,
    "text": " So one different way you could look at it is the cultural background of the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 408.323,
    "end": 418.627,
    "text": "So this is from a study, I think they did this on Dutch Royal Company, which had branches both in England and then also in the Rhine and like Germany, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.522,
    "end": 434.351,
    "text": " And so they found that top managers having the Anglo-Saxon corporate governance orientation are more likely to pursue exploitative and external growth strategic renewal trajectories, while those having Orion corporate governance orientation are more likely to pursue exploratory internal growth strategic renewal trajectories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.132,
    "end": 446.759,
    "text": "So I think what they're implicitly saying is that they're facing similar strategic contexts, they're the same company, but for some reason, culturally, they're more oriented to doing certain kinds of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.331,
    "end": 451.612,
    "text": " Then you can also think about it just by the context of the business, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.912,
    "end": 456.173,
    "text": "There might be certain boards that have different roles that are more appropriate for certain kinds of contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.453,
    "end": 458.013,
    "text": "So some might be more administrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 458.873,
    "end": 462.274,
    "text": "Maybe it's kind of like a legal requirement to have the board and that's kind of why they're there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.294,
    "end": 466.075,
    "text": "They're more of just making sure that everything is running on time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.735,
    "end": 469.536,
    "text": "More of an entrepreneurial where they're actually taking a more strategic role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.716,
    "end": 471.236,
    "text": "There's directing and controlling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.276,
    "end": 474.857,
    "text": "We can imagine that they're more kind of integrated with management.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.819,
    "end": 486.185,
    "text": " And then there's supervisor, which might just be, hey, making sure that everything is going okay, that there are no outrageous fraud that's being committed within the company.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.965,
    "end": 491.868,
    "text": "Though a very common issue too is that the board often doesn't have much of a role at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.689,
    "end": 502.134,
    "text": "And so this is a quote from one of the studies that Dijon cites, that managerial hegemony theory argues that boards are legal fiction dominated by management.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.434,
    "end": 505.136,
    "text": "So the idea here is that management actually runs the show,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.882,
    "end": 508.664,
    "text": " You have a board, they have to check some boxes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.704,
    "end": 510.266,
    "text": "They're often legally mandated, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.306,
    "end": 515.93,
    "text": "So like for a 501c3 or a C Corp, like you have to have a board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.831,
    "end": 520.614,
    "text": "But they're like, okay, like let's just appease regulators and have this board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 520.815,
    "end": 523.156,
    "text": "We're not actually giving them anything substantial to do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.079,
    "end": 533.048,
    "text": " This is actually a really big problem in nonprofit board management as well, because it's very unclear what nonprofit boards are supposed to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.068,
    "end": 544.96,
    "text": "And oftentimes, nonprofits will put a lot of donors on their board in a lot of ways just to appease these donors' egos in exchange for getting more funding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.437,
    "end": 559.433,
    "text": " without having a clear sense of like what they're actually supposed to do and this actually matters quite a lot because they don't know what they're supposed to do but they have all the power in the organization like the board runs the organization in a non-profit uh and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 560.7,
    "end": 564.521,
    "text": " they have like no accountability, unclear responsibilities, but all the power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 565.121,
    "end": 582.427,
    "text": "And so what that often dissolves into is that the CEO or the executive director is actually running the show and the board is there just kind of like checking boxes and more of a formality, which does not really get as a greater cognition that Dijon is hinting at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.447,
    "end": 584.767,
    "text": "It could be possible by having a board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.188,
    "end": 585.888,
    "text": "So that's unfortunate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.908,
    "end": 588.028,
    "text": "All right, let's go to the next one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.048,
    "end": 589.489,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.127,
    "end": 591.61,
    "text": " Okay, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.987,
    "end": 595.348,
    "text": " This was the first of John's claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 595.608,
    "end": 604.771,
    "text": "There's a danger, however, that the compliant board is breathing formalism, groupthink, and risk aversion at the expense of the operational understanding, strategic focus, and independent thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 605.452,
    "end": 609.133,
    "text": "Effectively, the board has been distanced from initiating and directing strategic renewal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.453,
    "end": 622.298,
    "text": "Unless lawmakers evolve corporate governance guidelines in tune with the requirements of a distributed and discontinuous world, the board is either relegated to a strategic irrelevance or increasingly represents a source of inertia, reflective of the struggle with growing complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.167,
    "end": 628.148,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.548,
    "end": 633.451,
    "text": "So let's just unpack what Jean meant by irrational exuberance from that claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.412,
    "end": 640.475,
    "text": "So irrational exuberance, this is a famous quote from Alan Greenspan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.635,
    "end": 644.277,
    "text": "And this was from the 1996 when this was like the beginning of the dot-com boom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.317,
    "end": 648.9,
    "text": "Like the dot-com boom still had a couple of years left to go before it really kind of petered out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 649.58,
    "end": 652.022,
    "text": "But he said, irrational exuberance has unduly escalated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.922,
    "end": 668.036,
    "text": " asset values um and so during this period it's like the late 90s yeah all these companies that uh well one there's like wild speculation in these companies but also there wasn't great strategic or financial controls by the by the boards and so you had companies like enron and taiko",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.288,
    "end": 672.072,
    "text": " that were very much misrepresenting their financials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 672.632,
    "end": 679.74,
    "text": "And so the end result of this after the dot-com bust was the Sarbanes-Oxleyad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.92,
    "end": 681.702,
    "text": "I always mispronounce this, Sarbanes-Oxleyad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.372,
    "end": 699.601,
    "text": " which what that did was that it created the number of like audit and regulatory controls, especially over the board, making sure the board doesn't have conflicts of interest, that they're actually overseeing the organization effectively, which is all wonderful in many ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.641,
    "end": 700.501,
    "text": "That can be great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.521,
    "end": 701.422,
    "text": "Those are good things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.242,
    "end": 706.424,
    "text": " But there's also a ton of regulation that imposes on these companies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.484,
    "end": 712.888,
    "text": "And it also imposes a certain model of what a board is supposed to be doing to these corporations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.468,
    "end": 721.093,
    "text": "And so John does not like some aspects of that, some of the way that enforces what a board can and should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.062,
    "end": 734.596,
    "text": " And so he says, the 2002 Sarbanes-Oxley Act, the United States has been the most prominent legislative product resulting from irrational exuberance, composing draconian measures on the audit and financial representations of publicly listed companies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.697,
    "end": 750.386,
    "text": " I think what a lot of what Bijan is saying about this period is that before 2002, Four Star Games, obviously, you had a lot of misrepresentations, a lot of rational exuberance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.926,
    "end": 758.092,
    "text": "But something interesting that did happen during that same period was that you also had a lot of experimentation on what a board could and should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.012,
    "end": 766.817,
    "text": " And so you get a lot of research during the same time, thinking about what managerial cognition, what board cognition actually looks like, what the board's role could be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.837,
    "end": 774.403,
    "text": "And that kind of free and loose culture also created a more expansive view of what a board is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.143,
    "end": 784.228,
    "text": " But then once you get into 2002 and you get all these regulations from Sarbanes-Oxley, that really constrained the idea of what a board could be and put all of these other burdens on top of the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.688,
    "end": 790.091,
    "text": "And so it really kind of diminished their potential strategic and cognitive role within the company.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.912,
    "end": 793.913,
    "text": "Blue, Daniel, do you have anything you just want to add here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.406,
    "end": 802.308,
    "text": " All right, so that was talking about the role of the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 802.749,
    "end": 809.594,
    "text": "And that's all just to say, like, the role of the board is often extremely unclear, like any, like, nonprofit or corporation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.615,
    "end": 819.062,
    "text": "And so now Bajon's kind of switched his gears and says, okay, well, let's think about different models of board cognition and different ways that you can think about how a board could operate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.082,
    "end": 821.784,
    "text": "So let's go to the next one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.804,
    "end": 822.565,
    "text": "Luke?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.798,
    "end": 825.058,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.279,
    "end": 836.669,
    "text": "So Rendova, 1999, was among the first to link managerial cognition to corporate governance, distilling the board's distinct cognitive contribution to strategy processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.176,
    "end": 840.678,
    "text": " specifically in terms of environmental scanning and interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.298,
    "end": 859.909,
    "text": "Her contribution can be considered seminal, laying grounds for a stewardship-inspired corporate governance approach that is now widely adopted by leading private equity firms, where top management team and board strategize together, often in highly complementary ways and based upon cash-financed, equity-centric alignment of interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.447,
    "end": 862.008,
    "text": " as opposed to free call options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.588,
    "end": 868.411,
    "text": "Private equity is more of a governance than a financing model, explaining its public market equivalent outperformance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.171,
    "end": 872.613,
    "text": "According to Rendova, board directors do impact decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.403,
    "end": 880.69,
    "text": " And so this, I thought that this idea of managerial cognition was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.71,
    "end": 886.938,
    "text": "It just like speaks to my interest in hierarchical cognition at different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.699,
    "end": 893.046,
    "text": "So this is a reference that Bijan gives that is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.286,
    "end": 898.928,
    "text": " the managerial response to changing environments, perspectives on problem sensing from social cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.328,
    "end": 901.788,
    "text": "So looking at like what is managerial cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.248,
    "end": 911.071,
    "text": "So this paper characterizes managerial problem sensing and necessary precondition for managerial activity directed towards organizational adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.651,
    "end": 915.454,
    "text": " as composed of noticing, interpreting, and incorporating stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.875,
    "end": 923.081,
    "text": "And I liked this like definition of cognition really as like noticing, interpreting, and incorporating stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.121,
    "end": 926.483,
    "text": "Although like in the paper, they don't say managerial cognition directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.503,
    "end": 931.948,
    "text": "I think that it's attributed largely to this paper as very seminal in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.193,
    "end": 938.278,
    "text": " and then environmental scanning and interpretation from the previous claim also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.859,
    "end": 943.465,
    "text": "So this is the Rendova paper that Bijan cited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.486,
    "end": 947.73,
    "text": "And it says, the cognitive perspective in this paper proposes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.059,
    "end": 956.385,
    "text": " Proposes suggests that directors contribute to dealing with the complexity and uncertainty associated with strategic decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.925,
    "end": 962.99,
    "text": "It argues that directors possess valuable problem solving expertise, which they can apply to a variety of contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.55,
    "end": 971.457,
    "text": "Directors make their cognitive contributions to strategic decision making by performing along with the firm's managers a set of cognitive tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.077,
    "end": 974.199,
    "text": " scanning, interpretation, and choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.08,
    "end": 978.744,
    "text": "And I noticed, again, this environmental scanning, interpretation, and choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.764,
    "end": 985.791,
    "text": "How does this relate to noticing, interpreting, and incorporating stimuli?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.211,
    "end": 990.376,
    "text": "I think that maybe you can, it's like a rephrase, scanning, interpretation, and choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.341,
    "end": 1010.268,
    "text": " Okay, and so another claim that Bijan makes in the paper, he says, Rendova appreciates the dynamic nature of strategy process when she postulates that board participation in strategic decision-making rises with increasing environmental complexity and uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.928,
    "end": 1021.432,
    "text": "However, Rendova's approach is rather static as it falls short of connecting the board table to the rest of the organization and interchangeably treats perception as interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.512,
    "end": 1027.377,
    "text": " A free energy governance lens instantly exposes the obvious shortcomings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.017,
    "end": 1029.159,
    "text": "Maybe Tyler's going to tell us how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.33,
    "end": 1036.292,
    "text": " All right, so let's go through a couple more of these different models of forward cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.952,
    "end": 1038.813,
    "text": "One of them is called stewardship theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1038.833,
    "end": 1045.416,
    "text": "So I'll do a little quote here from one of the original papers about stewardship theory, Davis 2007.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.956,
    "end": 1054.02,
    "text": "So economic approaches to governance, such as agency theory, tend to assume some form of homo economicus, which depicts subordinates as individualistic, opportunistic, and self-serving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.58,
    "end": 1061.683,
    "text": "Alternatively, sociological and psychological approaches to governance, such as stewardship theory, depicts subordinates as collectivist, pro-organizational,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.483,
    "end": 1082.698,
    "text": " and trustworthy um and so like there's i think a couple different lenses you can think about search theory like one is kind of more of this like communist version of a more collectivist world where they actually were not all fully selfish we actually have more uh we also have like collectivist aims and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.476,
    "end": 1086.878,
    "text": " people it's like a different way of thinking about like individual motivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.318,
    "end": 1094.522,
    "text": "I think another one too, is that where this is really shine and become, um, actually important in like applied practice has been in private equity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1095.143,
    "end": 1098.945,
    "text": "And so in private equity, like the owners are the same as the management.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.965,
    "end": 1110.071,
    "text": "Uh, and this actually ends up mattering because what they've seen these states have found, I can find this quote here is that actually impacts, um, performance quite a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1110.932,
    "end": 1111.132,
    "text": "So,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.601,
    "end": 1114.844,
    "text": " I think, sorry, we already read that quote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1115.304,
    "end": 1127.638,
    "text": "But the idea here is that when management and ownership are combined, the management acts as more stewards rather than people who are just paper pushers, but they're actually really taking care of this investment and more aligned with the board interests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.749,
    "end": 1132.95,
    "text": " Okay, the next one is absorptive capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.031,
    "end": 1141.276,
    "text": "So absorptive capacity thinks about the board as like a cognitive, cognizing unit that's informed by the experiences of its members.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.336,
    "end": 1149.521,
    "text": "So similar to what Blue said earlier, that the board's expertise and the board's cognition is informed by the diverse experiences of its board members.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.225,
    "end": 1158.329,
    "text": " So the ability of a firm to recognize the value of new external information assimilated and apply it to commercial ends is critical in its innovative capabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1158.489,
    "end": 1165.252,
    "text": "We label this capability firm's absorptive capacity to suggest that it's largely a function of the firm's level of prior related knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1167.113,
    "end": 1178.619,
    "text": "It goes on to say, it's from Rendova, director's contribution as a source of requisite varieties to increase the pool of available interpretive frameworks on which decision group",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.622,
    "end": 1180.923,
    "text": " which is the decision group control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.943,
    "end": 1188.329,
    "text": "So the idea here is that there's limited information that any individual or any group can process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.91,
    "end": 1194.634,
    "text": "You should get more people with more diverse experiences so you could process more information through different models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.355,
    "end": 1197.897,
    "text": "And that will lead to more enhanced cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1199.939,
    "end": 1202.821,
    "text": "I could add a note on that previous slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.679,
    "end": 1220.676,
    "text": " the mention of the requisite variety in the rindova quote is from cybernetics and ross ashby's law of requisite variety which is the idea that for a system to be a good regulator",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.357,
    "end": 1248.533,
    "text": " adaptive in a given environment that it needs to have internal states that are of the order of magnitude of external states like if there's 100 positions that the food could be in but you're you can only conceptualize of 10 then you're not going to be able to have a granular or nuanced enough perspective to like find the food so um that ties the managerial and strategic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.514,
    "end": 1270.789,
    "text": " practice oriented areas which frankly dominate society to some of the more theoretical perspectives and system independent perspectives on cybernetics and cybernetic systems as cognitive systems which is what brings this entire discourse into the active inference area",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.142,
    "end": 1283.027,
    "text": " Yeah, and I think that's also another important lens when thinking about board diversity, because a lot of times board diversity is often seen through a more of a political lens when there's also like a computational lens as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.447,
    "end": 1284.287,
    "text": "That's really important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.05,
    "end": 1289.19,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.21,
    "end": 1291.551,
    "text": "Okay, so moving on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.451,
    "end": 1296.333,
    "text": "Forbes and Milliken's contribution is relevant in three regards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.933,
    "end": 1300.815,
    "text": "First, it is impossible to meaningly infer board performance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.837,
    "end": 1307.2,
    "text": " from demographic variables in the absence of a process model linking demography and output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.94,
    "end": 1315.124,
    "text": "Second, the board's role as a group is essentially a cognitive role and is therefore a cognitive rather than behavioral perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.584,
    "end": 1318.505,
    "text": "It's critical to better understand the essence of board performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.986,
    "end": 1326.309,
    "text": "And third, effort norms, cognitive conflicts, and the use of knowledge and skills are important process variables underlying board performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.01,
    "end": 1331.372,
    "text": "I think Tyler's going to tell us about effort norms and cognitive conflicts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.532,
    "end": 1345.376,
    "text": " All right, so effort norms, i.e., the intensity of cognitive resourcefulness on the task performance behavior, cognitive conflicts, the leveraging of differences in perspective, and the use of knowledge and skills are important process variables underlying board performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.716,
    "end": 1348.317,
    "text": "The dimension of effort norms cannot be stressed enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.758,
    "end": 1355.76,
    "text": "The sheer presence of the collective pool of competencies and experiences is rather meaningless unless actively and purposefully exercised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.9,
    "end": 1359.001,
    "text": "So the idea here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.6,
    "end": 1378.062,
    "text": " Even if you have a diverse set of perspectives on your board, even if you have computational firepower, theoretically, if the board isn't actually inclined to acting on that and processing that information, it's just not going to happen and that power you have, that potential power just doesn't really matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.206,
    "end": 1390.231,
    "text": " I think this is important too, because a lot of boards see themselves in a more passive, in a more passive way where like the CEO is feeding them information and kind of giving them things to rubber stamp approve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.931,
    "end": 1396.433,
    "text": "And so even if you have people who have that, those capabilities, that capacity, it's not really even being used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.834,
    "end": 1404.737,
    "text": "And so you have to have a board that's actually inclined to taking more of an active role to really get that cognitive potential from your board members.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1407.056,
    "end": 1432.227,
    "text": " know blue anything out there yeah one thought by analogy to the brain and the central nervous system is like the usage of resources for cognition and the brain is still using a lot of energy slightly less but a lot during sleep so what exactly are these cognitive conflicts what is the resource in the case of the board",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.927,
    "end": 1436.831,
    "text": " Is it the limited time in a meeting where people can speak?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.111,
    "end": 1439.894,
    "text": "Is it limited attention to different decisions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.896,
    "end": 1445.8,
    "text": "What is it that's actually conflicted?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.021,
    "end": 1453.247,
    "text": "And how do we gain insights from thinking about the board as a cognitive entity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.132,
    "end": 1460.113,
    "text": " So I think we'll, we'll get some of those soon when we talk about inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.914,
    "end": 1466.996,
    "text": "Um, but I think you're right in that, like the time, the limited time constraints are a huge factor of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.016,
    "end": 1474.338,
    "text": "We're just like, you're less inclined to actually do a very like high cognitively tasks, you know, a very demanding cognitive tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.838,
    "end": 1477.439,
    "text": "You have a couple hours every month to really talk about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.08,
    "end": 1482.281,
    "text": "Or in the case of a 501 C three, like board members are unpaid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.952,
    "end": 1488.377,
    "text": " And so if you're an unpaid member, there's probably like limited time you're actually willing to put to actually thinking about some of these problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.157,
    "end": 1492.3,
    "text": "So I think that they're all a lot of dimensions to it, but we'll talk about that shortly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1494.715,
    "end": 1520.172,
    "text": " So I think like this last end of this quote, the competencies and experiences of the collective pool is meaningless unless it's actively and purposefully exercised, really speaks a lot to collective intelligence and how like within a company, a board, a managerial system, there is this collection and you're not like contributing to the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.031,
    "end": 1532.398,
    "text": " like emergence of the group intelligence if you're not using all of the different expertises of the different people in the group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.919,
    "end": 1535.06,
    "text": "And so I think that it's really limiting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.141,
    "end": 1543.486,
    "text": "But I also wonder, you know, like we might have a board that's like a very diverse group of people and we all have different tasks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.046,
    "end": 1568.845,
    "text": " in management different skills in management but like we also can do things like crochet and bake and like paint and and so like to what extent are these other skills that might be present in the board like relevant or necessary for like management to to thrive and um like really to enhance the collective for for the group i don't know yeah one one last short thought on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.85,
    "end": 1596.226,
    "text": " recalling the earlier quote how there's no universal governance model it's like if we were talking about ant colony strategies is it better to simply have more nest mates or fewer or bigger brain per body size or smaller it's like there isn't a universal answer because there's different strategies in fact multiple strategies that might be adaptive in a given niche but it doesn't really make sense to even talk about one without the other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.246,
    "end": 1600.508,
    "text": " whether you're talking about chess or ant colonies or the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.928,
    "end": 1620.32,
    "text": "And so that's where the particular partitioning of active inference helps because it reminds us that the cognitive process of perception, cognition, including action selection, and then action and action is happening within the context of a generative process in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.72,
    "end": 1623.362,
    "text": "And that can't be just like left for later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.622,
    "end": 1626.404,
    "text": "That's an intrinsic part of the particular partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.972,
    "end": 1641.274,
    "text": " Okay, so here, Bijan makes a claim that essentially, there are three important conclusions to take forward from Golden and Zajac, 2001.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.935,
    "end": 1643.775,
    "text": "I don't know if I said that right, probably not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.595,
    "end": 1649.697,
    "text": "First, demographic and procedural variables impact strategic change rather curve linearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.377,
    "end": 1656.939,
    "text": "Second, power relationships are critical to understanding the impel versus impede debate and strategic renewal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.419,
    "end": 1660.42,
    "text": "And third, attentional focus and engagement in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.956,
    "end": 1673.247,
    "text": " An Ocasoian linkage of cognition and structure, and that's in this reference, Ocasio, 1997, are a promising venue upon which to pursue future research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.208,
    "end": 1685.537,
    "text": "And then this linkage of cognition and structure from this paper, it's toward an attention-based view of the firm from William Ocasio, 1998.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.74,
    "end": 1695.305,
    "text": " Here he says, the central argument is that firm behavior is the result of how firms channel and distribute the attention of their decision makers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.866,
    "end": 1700.089,
    "text": "What decision makers do depends on what issues and answers they focus their attention on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.609,
    "end": 1714.26,
    "text": "What issues and answers they focus on depends upon the specific situation and on how the firm's rules, resources, and relationships distribute various issues, answers, and decision makers into specific communications and procedures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.761,
    "end": 1733.256,
    "text": " And so that, that like pushes salience, I think to the forefront, especially with regard to like, you know, board collective intelligence, like maybe the crocheting and knitting and baking and all those things are not really relevant, or maybe they could be, maybe this is the explore part where active inference comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.057,
    "end": 1743.084,
    "text": "Another, another link here with attention and structure and cognition is attention to something that's more dynamic and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.615,
    "end": 1754.185,
    "text": " but it requires the structural connections like between brain regions or at the synaptic level or APIs that call each other in a computational system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.885,
    "end": 1760.77,
    "text": "Those pipes have to be in place for attention to be dynamically allocated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.471,
    "end": 1779.857,
    "text": " and so the structural aspects of the firm are more like its morphology and then the attentional and the more rapidly changing aspects are more like perception and fast changing cognition and so that's going to be like a theme that gets built upon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.837,
    "end": 1792.249,
    "text": " are the faster changing more perceptual and decision-making like components of the firm and the slower changing more structural elements of the firm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.331,
    "end": 1811.985,
    "text": " Or just to build on that a little bit, like something I've noticed from fire companies that even if you have a very engaged board, like a board that we say gives a lot of attention within the firm and has a high attentional capacity, like they may not actually be linking that to the structure of the firm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.206,
    "end": 1820.994,
    "text": "So for example, something I've often observed is that you'll have like two people putting together the quarterly board deck for a company of like a thousand people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.955,
    "end": 1832.348,
    "text": " So everything gets processed through this tiny funnel of two people who have to synthesize everything on behalf of the board, where they're essentially just making the conclusions for the board at that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.949,
    "end": 1838.836,
    "text": "And so if you're not really linking both the attention and the structure, you're really missing out on the potential power of your board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.737,
    "end": 1843.997,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.418,
    "end": 1845.459,
    "text": "Uh, inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1845.959,
    "end": 1849.582,
    "text": "So inertia, you can think of that really as just like reluctance to change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.223,
    "end": 1859.151,
    "text": "And it's similar to the idea of like bounded rationality, uh, is that there are certain constraints, which you have to reason that board often reasons with them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.212,
    "end": 1865.277,
    "text": "So read a couple of quotes from, um, I think it went off presentation mode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.38,
    "end": 1868.48,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.505,
    "end": 1872.007,
    "text": " So I'll read this quote from Hannon in 1977.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.547,
    "end": 1880.352,
    "text": "He came up with the original idea of organizational inertia, which, again, isn't specific to firms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.412,
    "end": 1882.573,
    "text": "It's really an idea that can apply to any collective system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.273,
    "end": 1886.655,
    "text": "So there are a number of obvious limitations on the ability of organizations to adapt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.735,
    "end": 1890.618,
    "text": "That is, there are a number of processes that generate structural inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.73,
    "end": 1904.88,
    "text": " And Bajon says that, indeed, corporate governance best practice guidelines may rather fuel governance inertia rather than freeing the board as an impactful variable supporting continuous strategic renewal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1905.36,
    "end": 1910.384,
    "text": "And so to make this a little more concrete, we can kind of go through a couple of different examples of inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.524,
    "end": 1916.449,
    "text": "And these all come from Hannon's 1977 paper where he kind of defined this idea of organizational inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.443,
    "end": 1919.085,
    "text": " So I'll list a couple of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.305,
    "end": 1922.327,
    "text": "One was that previously made investments aren't easily transferable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.988,
    "end": 1926.091,
    "text": "There are constraints on the information decision makers receive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.631,
    "end": 1928.053,
    "text": "There are political constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.793,
    "end": 1932.637,
    "text": "There are costs of history to allocate tasks and create procedures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.657,
    "end": 1935.139,
    "text": "So you've basically done all the work to figure out who's doing what.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.439,
    "end": 1936.8,
    "text": "It's a lot of work to redo that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.122,
    "end": 1946.649,
    "text": " There are legal constraints, perceptions of legitimacy, if you were to change course at this point, unclear how your strategy will succeed in competitive environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1946.669,
    "end": 1948.491,
    "text": "So if we do this, how will others react?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.031,
    "end": 1953.836,
    "text": "And so all of this just creates a sense of anxiety that people just don't want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.276,
    "end": 1958.681,
    "text": " confront and they feel good and comfortable pursuing something that they already understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1959.002,
    "end": 1961.365,
    "text": "And so you can think of that as organizational inertia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.785,
    "end": 1972.718,
    "text": "And this is particularly a problem with boards, because especially if you have a board with limited attentional capacity, like they're not going to be putting the time to really think through and work through that anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.078,
    "end": 1975.82,
    "text": " They're not going to be like actually doing the hard work to overcome that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.26,
    "end": 1979.382,
    "text": "And so you end up just defaulting to something that people already understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.323,
    "end": 1986.487,
    "text": "And so there's often something that you hear in organizations where like, okay, well, we could do this really ambitious thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1986.607,
    "end": 1991.471,
    "text": "And like, there are people who might be actually excited about this more exploratory initiative that you could do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.131,
    "end": 1993.993,
    "text": "But like, how are we going to sell that to the board?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.881,
    "end": 1995.081,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.521,
    "end": 2004.164,
    "text": "And oftentimes it's the CEO has to put their reputation on the line to sell something that's more exploratory and risky to the board who has limited attentional capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.564,
    "end": 2005.584,
    "text": "They're anxious about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2006.045,
    "end": 2009.546,
    "text": "So they just kind of have to trust this one person to say, yes, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.586,
    "end": 2010.086,
    "text": "It's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.426,
    "end": 2017.608,
    "text": "And so again, you're not really unlocking that cognitive power potential of the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.928,
    "end": 2022.75,
    "text": "One more aspect there on inertia to connect to the Bayesian physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.891,
    "end": 2037.977,
    "text": " Inertia is something that physical objects have in classical mechanics, like whether it's a ball at rest that requires some force to push or whether it's a bicycle in movement whose inertia allows it to stay upright.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.235,
    "end": 2042.077,
    "text": " inertia is an aspect of physical objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.877,
    "end": 2053.182,
    "text": "And by analogy in the Bayesian physics, the inertia is like the resistance of a prior to be updated to incoming observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.803,
    "end": 2061.927,
    "text": "So a prior distribution with a high inertia, it's like a heavy distribution, it's immovable to new stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.287,
    "end": 2064.889,
    "text": "And that corresponds to having low attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.569,
    "end": 2091.402,
    "text": " because it's like as new information comes in the prior has high inertia it doesn't update a lot whereas when there's high attention paid to the incoming stimuli in the extreme the prior just updates to whatever the new stimuli says that's our new best estimate so that's ultra high attention and also very very movable and that's um like a light object",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.443,
    "end": 2110.446,
    "text": " And so there isn't a general answer, but this puts us into a framing where we can think about this structural and attentional inertia as part of the morphological and dynamical cognitive process of the board and the organization more generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.151,
    "end": 2114.992,
    "text": " Yeah, that I really like that perspective on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.092,
    "end": 2128.02,
    "text": "And it makes me think about how why Bajan is spending so much time thinking about the board, because it's kind of this combination of low attention, high responsibility for updating, like the beliefs of the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.04,
    "end": 2135.364,
    "text": "And so that's where like a lot of any like continuous change or transformation would have to happen start the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2135.384,
    "end": 2140.907,
    "text": "So I understand why Bajan is spending so much time thinking about this and time on different models of board cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.31,
    "end": 2150.571,
    "text": " Hopman et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.092,
    "end": 2164.802,
    "text": "2019 make an invaluable contribution in moving away from deterministic models that suggest which specific board configurations and leadership concentrations enhance board effectiveness, firm performance, and a firm's overall strategic capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.442,
    "end": 2174.189,
    "text": "Instead, they focus on the board's better capabilities, such as self-evaluation and self-reconfiguration to power continuous strategic renewal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.674,
    "end": 2177.874,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2178.154,
    "end": 2190.719,
    "text": "The board's power vis-a-vis management is strongly related to the board chair, initiates self-evaluation and self-reconfiguration, thereby ensuring that the board can still critically evaluate strategic proposals and reconfigure strategies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.359,
    "end": 2193.32,
    "text": "So unfortunately, though, Hotman et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.88,
    "end": 2197.482,
    "text": "do not go far enough since strategic renewal remains bottlenecked by the board chair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.802,
    "end": 2203.69,
    "text": " We need governance processes that neutralize the over dependencies on the chairman and the CEO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.19,
    "end": 2212.201,
    "text": "So oftentimes within an organization that has the board, the chairman is kind of running the show on the board and their counterpart is the CEO.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.361,
    "end": 2215.665,
    "text": "And they do love the agenda setting for how the board actually operates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.246,
    "end": 2222.19,
    "text": " how much attention that they're actually giving on to problems, the kind of information that's to be incoming and available to the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.971,
    "end": 2227.774,
    "text": "And so a lot of responsibility relies on the board of like how cognition can actually happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.675,
    "end": 2238.481,
    "text": "And like I have been in this position myself, I've been a board chair, a lot of responsibility kind of ends up being on you for how well the board and consequently the organization can run.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.062,
    "end": 2239.342,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.881,
    "end": 2247.202,
    "text": " what's unfortunate and something I've actually tried to do myself is like spread the responsibility of the board chair throughout the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2247.262,
    "end": 2253.944,
    "text": "So that cognition doesn't rest on like a single person, but it's actually more spread out through that entire, you know, cognizing unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.984,
    "end": 2256.744,
    "text": "And that is difficult to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.764,
    "end": 2262.765,
    "text": "So I'm curious if Dijon later on in the book has some recommendations on how to structure that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.866,
    "end": 2267.086,
    "text": "Daniel, do you have anything to add here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.937,
    "end": 2282.765,
    "text": " I'm curious, Tyler, with respect to the DAO world that you live in, what are some governance processes that do neutralize that over-dependence on the chairman and CEO of a company?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.125,
    "end": 2285.647,
    "text": "Can you maybe say a few words about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.73,
    "end": 2313.187,
    "text": " yeah so one i mean there's like a lot of different governance processes but like we kind of talked about a couple of them so one is that like if you're doing especially like token or token based voting like the nfts or the rc20s like any generally most people can make a proposal not anyone can make a proposal but like a lot of times the agenda setting can be done in a distributed way so it's not necessarily the board chair and the ceo determining hey these are the things that we're bringing up to a vote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.667,
    "end": 2325.584,
    "text": " but that can be done more dynamically and oftentimes there's a quorum like a rules about who could propose so it's not like fully decentralized but in a sense like that agenda setting can be done more decentralized",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.975,
    "end": 2336.418,
    "text": " And there's also ways of creating salience as well without having a single person at the top saying what is salient and what matters and what doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.598,
    "end": 2348.201,
    "text": "There are ways, there are different governance strategies where salience kind of like bubbles up and you can kind of determine certain governance rules like your quorum, for example, in a more like dynamic way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.584,
    "end": 2352.206,
    "text": " And so there's a lot there of how it can work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2352.426,
    "end": 2354.707,
    "text": "Then there's also how it actually works in practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2355.187,
    "end": 2361.651,
    "text": "And in reality, a lot of times with DAO governance, usually often it is a couple of people making a lot of the proposals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2362.391,
    "end": 2371.436,
    "text": "And so what's interesting is that even if you want to be in a more distributed way, sometimes there's this pull of gravity towards centralized decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.216,
    "end": 2381.181,
    "text": " And it really just is that there's like limited attention available, even if like you're not saying you're not legally mandating some kind of centralized structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.261,
    "end": 2388.885,
    "text": "There's just like only a couple of people who are really willing to like actually synthesize all this information at any given time, especially within DAOs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2388.905,
    "end": 2394.948,
    "text": "Like DAO proposals are often extremely technical and there's often limited people who can even like do that if they wanted to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2396.209,
    "end": 2408.398,
    "text": " So, like, it's something that I've been personally struggling with is thinking about like, okay, well, there's a world that we want to live in that's maybe more decentralized and less hierarchical and more connected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.818,
    "end": 2416.764,
    "text": "But there's also just these constraints on like, human time and attention, effort capabilities, that constrains the kind of structures that you can have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2416.784,
    "end": 2416.844,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.682,
    "end": 2419.982,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.423,
    "end": 2429.529,
    "text": "And hopefully later in the book, John will have some good recommendations on how you construct your organization, your board to kind of mitigate that like pull towards centralized processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.529,
    "end": 2433.071,
    "text": "But it's just something I witnessed a lot in like the data world as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2435.553,
    "end": 2438.014,
    "text": "Cool, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.334,
    "end": 2441.637,
    "text": "So I think that that's the end of the material today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.397,
    "end": 2445.359,
    "text": "So next week, we have the chapters quite a bit longer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.419,
    "end": 2446.6,
    "text": "This one was pretty short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.176,
    "end": 2454.422,
    "text": " But yeah, we're looking forward, I think, to what Bajan's going to tell us about free energy governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.543,
    "end": 2458.467,
    "text": "And he's setting the stage now for delineating the problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.587,
    "end": 2460.849,
    "text": "And now, like, how do we go about solving them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.17,
    "end": 2464.013,
    "text": "I'm curious to delve into this next section with you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.534,
    "end": 2467.817,
    "text": "Can I bring up a few points and questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.837,
    "end": 2468.958,
    "text": "Of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.978,
    "end": 2469.038,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.881,
    "end": 2498.966,
    "text": " all right so one of them was it described the board as a spanner earlier on and i wondered whether the board was kind of like at the heart of the onion insulated by more and more layers or whether the board is on the front line interfacing more publicly in the actual position or that person perhaps serving in a different position as well like wearing multiple hats so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.387,
    "end": 2503.172,
    "text": " Feel free to give any thoughts on that, or we can just raise the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.256,
    "end": 2505.356,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.436,
    "end": 2511.647,
    "text": "I mean, my understanding of, well, there's like how it actually works out and then how it can work, how it actually works out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2511.667,
    "end": 2513.791,
    "text": "I think it's often more like in the onion,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.067,
    "end": 2521.33,
    "text": " where they're getting more refined and more refined information that filters through a hierarchy until it finally gets to the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.211,
    "end": 2530.995,
    "text": "And what I think Bajan is hoping for is something that resembles more of like a motherboard, this integrating unit where there's all these connections from other parts of the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.015,
    "end": 2535.517,
    "text": "There's still that hierarchical structure, but it's not insulated from the rest of the organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.597,
    "end": 2537.278,
    "text": "And I think that's what Bajan is getting at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.258,
    "end": 2564.7,
    "text": " uh but from my understanding of board governance like that is less often the case and it's really hard to build so i think that that's like a really great question um and i'd like to really kind of explore it more in more detail when we get into our discussion section so i think we should add that to the dot one um list so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.218,
    "end": 2589.737,
    "text": " right another topic is there was the mention of a compliance board as well as how a board could be like dissonant or impel versus impede and so how to balance between uh simply going with what the body provides",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.055,
    "end": 2619.081,
    "text": " towards totally wishing things were different it's like in the extreme neither's gonna work so there has to be some middle path but there's no universal model so that's just kind of one point um and then uh another one was the market centrism of a for-profit company means that in some sense but please suggest if otherwise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.382,
    "end": 2628.992,
    "text": " the financial success on the broader market will define the persistence and the growth of the company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.234,
    "end": 2639.024,
    "text": "So that is kind of like projecting this very high dimensional space of strategy and composition and attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.731,
    "end": 2666.875,
    "text": " projecting down onto a number line like did the stock price go up or down and so to what extent do um for-profit and not-for-profit organizations or components of organizations have clearer or more alignable measures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.261,
    "end": 2683.063,
    "text": " Because it's just like if the only criterion of cognition was this one test, then you kind of get the Goodhart's Law situation where other measures can fall by the wayside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.543,
    "end": 2689.164,
    "text": "So how does that get prevented or ameliorated in for-profit endeavors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.865,
    "end": 2698.286,
    "text": "And then on the other side, how does that not get ignored when there are very real material constraints in nonprofits as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.778,
    "end": 2700.118,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.198,
    "end": 2710.882,
    "text": "And I forgot to mention this point earlier, but it's a really important one that like a lot of our model of like shareholder governance is often very like culturally specific to America.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.282,
    "end": 2714.823,
    "text": "So there are other ways you could think about, uh, board governance, corporate governance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.343,
    "end": 2727.567,
    "text": "So for example, in, uh, especially like in Germany, there's like a stakeholder governance model where, for example, you're legally required to have a board member in Germany who is a representative of the workers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.527,
    "end": 2728.747,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.927,
    "end": 2740.361,
    "text": "And so this is more aligned with like, and you could think of that, you could expand that model too, of like stakeholder governance, but that can mean, so that's just Germany's model where they're like, Hey, workers' rights need to also be important in addition to profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.381,
    "end": 2741.081,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2741.622,
    "end": 2746.167,
    "text": "But you could also expand that to think of, okay, well, what if we had an advocate for the consumer on the board?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.227,
    "end": 2746.347,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.388,
    "end": 2749.371,
    "text": "Like you could expand that idea of what a for-profit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.046,
    "end": 2752.568,
    "text": " the company's stakeholder governance model can look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.208,
    "end": 2757.051,
    "text": "In Japan, for example, there's a lot of for-profit companies that are also family run.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2757.511,
    "end": 2764.816,
    "text": "So there's these family considerations on top of the for-profit incentives as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.357,
    "end": 2776.284,
    "text": "So then between a C corp, like for-profit company, and then a nonprofit, there are different legal structures that kind of bridge the distance between the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.904,
    "end": 2778.866,
    "text": "So one of the famous ones is called a B corp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.656,
    "end": 2783.419,
    "text": " And so a B Corp, it's essentially the same thing as a C Corp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.5,
    "end": 2785.16,
    "text": "It can make money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.2,
    "end": 2786.881,
    "text": "It's a for profit company.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.522,
    "end": 2793.466,
    "text": "But in the bylaws, they are not legally mandated to only maximize for profit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.167,
    "end": 2798.09,
    "text": "They can also maximize for other they call it like double bottom line initiatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2798.23,
    "end": 2802.353,
    "text": "So there's other things that this for profit company can try to do aside from just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2803.291,
    "end": 2803.691,
    "text": " get money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2803.711,
    "end": 2809.256,
    "text": "And then there's like, a lot of different permutations of that, like a lot of different legal structures can have that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.456,
    "end": 2816.602,
    "text": "And same with a nonprofit to even a nonprofit couldn't have ways that is trying to get revenue, and think in a more for profit way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2817.303,
    "end": 2821.807,
    "text": "Even though there are people who are shareholders who are going to profit from it, but they can, they can act in a similar way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.367,
    "end": 2823.789,
    "text": "So I think often, like the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.707,
    "end": 2838.489,
    "text": " the distinction between nonprofit and for-profit can actually become quite fuzzy in the way that we think about for-profit governance is often very like culturally centric on how we've done things in the U S and in England, not necessarily on like how it can be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2840.714,
    "end": 2850.158,
    "text": " And as to your first point, Daniel, I think like what, I'm curious to know, like what goes into defining or creating a compliant board or like a dissonant board?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.419,
    "end": 2855.341,
    "text": "Like, I mean, I would think that it's like not structured to be a compliant board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.381,
    "end": 2863.665,
    "text": "I mean, maybe they write it into the bylaws that the board just agrees with everything that everyone does, but I think it's more of like an emergent property of the board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.426,
    "end": 2867.431,
    "text": " And like, does the entire board need to be replaced?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.551,
    "end": 2874.141,
    "text": "If like you say you have a compliant board and you want more of like a strategy driven governing board, like, do you have to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.938,
    "end": 2893.894,
    "text": " completely interrupt like the the norms right like we were you know it like bijan had said the norms if the norm is to be compliant like you have to just erase everyone to bring in like a whole new crew to develop new norms otherwise like that one person who's like oh let's just go along with whatever everybody says like they'll keep that culture alive right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.416,
    "end": 2908.784,
    "text": " To clarify that, I think what Bijan meant was compliance board, which is more like if you're a nuclear power plant, for example, you want to have a compliance-centered board who's making sure that you're following all the rules and regulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.004,
    "end": 2912.687,
    "text": "But I think to your point, Blue, a compliant board is also important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.707,
    "end": 2914.908,
    "text": "A lot of boards function as compliant boards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.928,
    "end": 2918.891,
    "text": "They're just rubber-stamping approvals, and that is not super useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.911,
    "end": 2921.112,
    "text": "So yes, I think that's also a good point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.97,
    "end": 2944.188,
    "text": " and one fun topic I think to do a little research into is how did we even get here with a board I mean isn't a board or the table that was also mentioned those are just like rectangles how did we get to this point where the meeting table architecturally and the people gathered around it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.109,
    "end": 2950.552,
    "text": " have become legally required and then even sub-constrained from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.493,
    "end": 2974.167,
    "text": "And so really just thinking broadly, as I think in the DAO and other spaces people are, thinking broadly about what organizational morphologies and what developmental trajectories and ecosystems of shared intelligence facilitate adaptive cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.322,
    "end": 2994.154,
    "text": " and what boards do and how they both build on the legacy and stay within that lane of what may be legally required for compliance, as well as innovate and move beyond some of these, um, like shortcomings and fallacies that boards can fall into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.775,
    "end": 2995.975,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.135,
    "end": 3001.038,
    "text": "I've actually looked into this a little bit about like how, like why boards are a thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.542,
    "end": 3005.23,
    "text": " And like, for example, in nonprofit boards, like they were just designed for like a different time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3005.782,
    "end": 3010.866,
    "text": " When a lot of times you were just getting, you're like basically foundations that had a bunch of money that they were going to allocate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3010.886,
    "end": 3017.53,
    "text": "And they were like top down driven models, not necessarily like dynamically responding to the world around them and dynamically changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.851,
    "end": 3027.398,
    "text": "And I think a lot of for profit corporations, it was kind of like a similar idea is like, we are going to try this boat and we're going to go to this other country and we're going to do trade there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3027.418,
    "end": 3028.338,
    "text": "And we're going to like come back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.398,
    "end": 3028.538,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.578,
    "end": 3032.181,
    "text": "It was a more simple and like linear model of thinking about planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.799,
    "end": 3034.28,
    "text": " And so they're just made for a different world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.82,
    "end": 3038.242,
    "text": "And like, I think now there's a lot of legal infrastructure that has built up around them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.282,
    "end": 3040.703,
    "text": "So like actually innovating around that's really difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.123,
    "end": 3046.045,
    "text": "So for example, one thing I've been working on a nonprofit recently, we were like, well, we don't want to have a board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.085,
    "end": 3047.526,
    "text": "We want to be more community driven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.566,
    "end": 3048.447,
    "text": "We want to be a co-op.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.047,
    "end": 3055.05,
    "text": "And so then we looked into being co-op and actually the legal infrastructure for setting it up is actually just like not developed at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.47,
    "end": 3059.812,
    "text": "You basically have to have a lawyer spend thousands and thousands of dollars to actually figure out how that's going to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3060.27,
    "end": 3063.612,
    "text": " And it's also very precarious, even though if this thing is even going to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.092,
    "end": 3076.199,
    "text": "So it's just really this well-trodden path has just been beaten down over and over again because it's the path of least resistance, but not necessarily the optimal one for cognition within a company or a nonprofit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.222,
    "end": 3080.344,
    "text": " I was going to say earlier, like, how did we get here to this board?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.584,
    "end": 3080.824,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.145,
    "end": 3086.008,
    "text": "And it's a script that like it's a script that has become solidified into law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.949,
    "end": 3090.751,
    "text": "And it's the same thing, like when you have a compliant board, like the rubber stampers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.892,
    "end": 3095.254,
    "text": "And that's just also a script that they have followed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.394,
    "end": 3096.995,
    "text": "So that's why they're all compliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.536,
    "end": 3102.459,
    "text": "So and not really kind of leveraging the type of governance that would be maybe optimal for the strategy of the company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.358,
    "end": 3134.238,
    "text": " okay cool yeah any other final final thoughts or we can hold it table it for the upcoming discussion rhythms of cognition rhythms of the year the agenda setting the agenda communicating with the board board communicating with the organization organization communicating outside the organization it's great topics and i think we're um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.73,
    "end": 3156.031,
    "text": " deep into the series and we're just going to continue to see how the scholarship and the legacy of a lot of conventional and even heterodox thinking and management is taking the next step with this book and the contribution that takes it into the free energy governance space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.182,
    "end": 3163.264,
    "text": " Well, thanks, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.484,
    "end": 3167.831,
    "text": "And we'll see you next week for getting into the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.851,
    "end": 3169.133,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.774,
    "end": 3170.034,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]