[
  {
    "start": 9.411,
    "end": 10.472,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.892,
    "end": 11.933,
    "text": "It's March 28th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.674,
    "end": 17.198,
    "text": "We're here in Active Bookstream number 1.012.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.499,
    "end": 19.139,
    "text": "Off to you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.681,
    "end": 20.921,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 21.141,
    "end": 27.446,
    "text": "So we will be continuing our discussion of the book, Governing Continuous Transformation by Bijan Kesri.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 27.706,
    "end": 30.869,
    "text": "And this actually is going to wrap up our coverage of this book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 30.889,
    "end": 37.695,
    "text": "We're not going to go into the interviews covered in the final section, but we're going to just cover this concluding part and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 38.174,
    "end": 38.874,
    "text": " wrap it up now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 39.014,
    "end": 44.658,
    "text": "And then in a few weeks, we will rejoin for a discussion section or a discussion session.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 44.758,
    "end": 53.002,
    "text": "So if you've been following along with the live streams to this point, please get in touch with us so that you can come on and discuss some of the contents of the book with us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 53.102,
    "end": 55.023,
    "text": "And hopefully the author is available to join us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 56.264,
    "end": 64.348,
    "text": "So we are the Active Inference Institute, a participatory online institute that is communicating, learning and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 64.848,
    "end": 67.75,
    "text": "You can reach us at social media at all of these links.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 68.491,
    "end": 74.437,
    "text": " This is also a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 75.078,
    "end": 83.566,
    "text": "All backgrounds and perspectives are welcome here, and we will be attempting to follow good video etiquette for your livestreams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.487,
    "end": 91.154,
    "text": "Again, there's many ways to participate and collaborate with the Active Inference Institute, so if you are interested in active inference and are not yet collaborating with us,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 91.704,
    "end": 100.19,
    "text": " just get in touch, activeinference.org is our website, and there's a link to fill out a form if you want to contribute in other ways to the Institute, besides joining us on the live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 100.21,
    "end": 106.494,
    "text": "All right, so the goal of this book stream is to conclude our discussions of this book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 107.075,
    "end": 109.957,
    "text": "So we are going to cover chapters 12 and 13.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 111.078,
    "end": 113.079,
    "text": "I want to skip to the right back.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 113.579,
    "end": 118.343,
    "text": "So we're going to cover chapters 12 and 13 in this part three conclusion of the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 118.403,
    "end": 118.543,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 119.076,
    "end": 127.138,
    "text": " Chapter 12 is the future research agenda, and Chapter 13 is outperformance and survival as a matter of self-organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 127.638,
    "end": 131.558,
    "text": "So we can just quickly introduce ourselves before jumping into the contents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 131.818,
    "end": 132.278,
    "text": "I'm Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 132.358,
    "end": 136.899,
    "text": "I'm an independent research consultant in New Mexico, and I'll pass it off to Tyler.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 138.28,
    "end": 138.82,
    "text": "I'm Tyler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.84,
    "end": 142.18,
    "text": "I'm a protocol designer and DAO researcher also in California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.7,
    "end": 143.22,
    "text": "And Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.061,
    "end": 145.821,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.168,
    "end": 148.949,
    "text": " Did I say California?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 149.149,
    "end": 150.029,
    "text": "I meant to say New Mexico.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 150.409,
    "end": 150.99,
    "text": "I think I said New Mexico.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 151.49,
    "end": 152.211,
    "text": "Did I say California?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 152.291,
    "end": 152.711,
    "text": "Oh my gosh.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.032,
    "end": 154.812,
    "text": "All California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.852,
    "end": 156.573,
    "text": "I'm probably getting confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.914,
    "end": 158.955,
    "text": "Maybe I said California.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 159.015,
    "end": 160.456,
    "text": "I'm having visions of the beach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 160.696,
    "end": 165.719,
    "text": "Okay, so chapter 12 has a few different sections.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 165.839,
    "end": 167.64,
    "text": "Again, this is like future research directions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.121,
    "end": 175.345,
    "text": "Bijan discusses language and communication, embodied cognition, artificial intelligence, board capabilities, developmental paths.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 175.525,
    "end": 176.206,
    "text": "And then chapter 13 is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 177.119,
    "end": 188.408,
    "text": " is really just a provocative conclusion section and reminds us of some of the things that we've learned in the book so far, and also outperformance and survival as a matter of free energy minimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 188.488,
    "end": 190.69,
    "text": "So we will jump right into the content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 191.63,
    "end": 195.133,
    "text": "Tyler, do you want to read this first part of the abstract for us?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.153,
    "end": 196.014,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.384,
    "end": 208.307,
    "text": " SEG is the product of a multidisciplinary research project connecting the dots among strategy, governance, and neuroscience research, opening a new conversation of headlines, introducing the free energy principle of strategy management.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.327,
    "end": 222.592,
    "text": "SEG redefines the nexus of structure and cognition, ABV, so attention-based view, advances the dynamic capability view, and from the managerial to the core level, and establishes strategy as an inactive Bayesian inference challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.854,
    "end": 227.496,
    "text": " In terms of future research, four areas should advance the optimization of FEG.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.876,
    "end": 233.819,
    "text": "One, language and communication, in particular, explainability of corporate purpose, prediction models, and predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.399,
    "end": 241.543,
    "text": "Two, body cognition in terms of a deeper understanding around the neurobiology underlying leadership's world engagement, as well as false inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.704,
    "end": 245.145,
    "text": "Thanks, and I'll leave this next part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.131,
    "end": 253.533,
    "text": " So the third area is artificial intelligence, in particular, the strategy application of AI-powered machine algorithms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 254.013,
    "end": 261.254,
    "text": "And fourth, board capabilities developmental paths, in particular, the board's ability to collectively develop meta capabilities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 261.895,
    "end": 269.396,
    "text": "Free energy governance as a framework provides the fundamental building blocks that empower a firm to implement free energy minimization as a self-organizing principle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 269.877,
    "end": 271.937,
    "text": "Structure, top-down, bottom-up connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 272.357,
    "end": 276.118,
    "text": "Cognition, environmental enactment, and capabilities, duality management.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 276.84,
    "end": 284.343,
    "text": " Within the FEG framework, many vibrant strategy research topics lend themselves to be repurposed as a matter of optimizing free energy minimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 284.803,
    "end": 289.265,
    "text": "More specifically, survival rather than just performance is the critical dependent variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.586,
    "end": 300.529,
    "text": "So getting into the first section, language and communication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 300.549,
    "end": 305.631,
    "text": "So I just pulled a couple of sentences out of this section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 306.52,
    "end": 322.186,
    "text": " Bijan says that the effectiveness of free energy governance is critically determined by transparency in communication, specifically around the explainability of corporate purpose, prediction models and predictions to obtain the most possible human energy for productive effort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 322.806,
    "end": 329.609,
    "text": "And I think like this is really something the communication overall is an area that I would like to discuss with Bijan further.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 330.549,
    "end": 334.411,
    "text": "But he does really kind of clarify some of the questions that we've been having over the last couple of weeks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 334.997,
    "end": 348.262,
    "text": " here in this section and even maybe the next section about what specifically needs to be communicated to all members of the firm and at all levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 348.442,
    "end": 350.483,
    "text": "So he really does kind of clarify.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 351.623,
    "end": 357.445,
    "text": "He says, if organization is emergent in communication as we believe, then it is not a being, but a becoming.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 357.565,
    "end": 360.106,
    "text": "And that's a quote from Taylor and Van Every 2000.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 360.587,
    "end": 364.228,
    "text": "And then he also says, language is not a tool, but a force.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 365.324,
    "end": 378.711,
    "text": " And with this, I think he specifically is referring to like a force that holds the firm together, like contributes to the self-organizing purpose and sustainability of the firm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 379.912,
    "end": 392.198,
    "text": "And really he does talk a lot about the purpose of the firm, both in this chapter and the next as like everybody needs to know what is the point for the firm's existence or for the corporation's existence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 392.691,
    "end": 405.195,
    "text": " And so I think that that is one aspect that might not necessarily be like a governance strategy or like something that's like internal, like a method of operation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 405.215,
    "end": 411.437,
    "text": "That's like, you know, we think about like the top level executives, but something that like, why are we here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 411.497,
    "end": 412.118,
    "text": "What are we doing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 412.418,
    "end": 415.219,
    "text": "What purpose are we serving as a corporation, as a company?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 415.559,
    "end": 422.141,
    "text": "And I think that like, that is like one reasonable thing that can be communicated to team members at all levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 422.551,
    "end": 424.511,
    "text": " I don't know if you guys have any thoughts here or.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.992,
    "end": 441.256,
    "text": "Yeah, so one thing that was like not really clear on about what the genre is getting at here was what it means to have explainable purpose, because on one level, like the F.E.G., like ultimate purpose, as I understand it, is just like survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.936,
    "end": 445.777,
    "text": "I'm not sure if he meant purpose in like some other sense of like survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.417,
    "end": 453.624,
    "text": " I don't know, if we are improving our customers' access to healthcare or something like that, that style level of purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.984,
    "end": 455.405,
    "text": "And I wasn't quite clear what he meant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.485,
    "end": 456.987,
    "text": "And he didn't quite give that many examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.047,
    "end": 460.65,
    "text": "So I'm not sure if you guys have any thoughts or a clear sense of what he meant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.474,
    "end": 466.895,
    "text": "Yeah, very good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.935,
    "end": 468.156,
    "text": "It does seem to be like there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.356,
    "end": 496.33,
    "text": " competing communications around what purpose is is purpose in this deflationary sense merely survival and persistence at which point the clear communication would just be around whatever we are we need to continue even if that involves change versus more sub purposes or topical performances which then might resemble",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.501,
    "end": 521.922,
    "text": " standard non-survival oriented purposes like to deliver the most x in y yeah I'm sorry so I would question also if survival is the purpose of free energy governance or if free energy minimization is the purpose like I think about you know when a firm swallows another firm like you know in M&A right like so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 522.366,
    "end": 525.99,
    "text": " you know, that then the little firm is not, the purpose is not to survive, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 526.19,
    "end": 532.536,
    "text": "Like the purpose is to become like amalgamated or whatever, subsumed by the larger corporation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.796,
    "end": 534.758,
    "text": "Sorry, sorry if I cut you off or interrupted your thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.8,
    "end": 539.723,
    "text": "Yeah, and I guess something that I feel like has been not,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.764,
    "end": 548.428,
    "text": " Maybe I just haven't gotten it, but not necessarily consistently communicated as whether purpose is at the highest level of organization or at sub levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.988,
    "end": 554.071,
    "text": "So in the same way as a pancreas cell may not know the meta purpose of the pancreas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.512,
    "end": 557.773,
    "text": "I don't know anything about biology, so I'm not misstating something here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.894,
    "end": 566.639,
    "text": "Is it necessarily true that an individual team has to always keep in mind the larger meta purpose of this organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.518,
    "end": 572.102,
    "text": " Or is it really OK to have something that's more relevant to its subunit organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.043,
    "end": 576.004,
    "text": "And that hasn't always been clear to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.024,
    "end": 577.366,
    "text": "I'm still kind of struggling with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.289,
    "end": 592.537,
    "text": "Yeah, so I do think that Bijan specifically, when he was talking about purpose, and I think that it comes more in the next chapter, but it might have been this chapter, I don't know, it's all blurring together, just one big chapter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 593.035,
    "end": 597.758,
    "text": " but he talks about purpose being on the front lines.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 597.959,
    "end": 604.283,
    "text": "The people that are on the front lines are as much determining the purpose as they are communicating the purpose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 604.323,
    "end": 609.147,
    "text": "So it might be not a top-down directional communication method, it's a reciprocal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 611.069,
    "end": 617.891,
    "text": " Like communicating the purpose of the organization is probably like a bi-directional information flow, ideally anyway.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 618.411,
    "end": 625.634,
    "text": "So like if the people at the top don't know what the people at the bottom think the purpose is, and the people at the bottom don't know what the people at the top think the purpose is, like there's no unity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 625.794,
    "end": 628.855,
    "text": "And then the firm has a divided purpose, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 636.078,
    "end": 636.818,
    "text": " Yeah, I think that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.878,
    "end": 647.423,
    "text": "I mean, my take on what he's saying is like, it's like this co-created, maybe amorphous thing that you're not necessarily like pinning down and defining and putting on like a landing page on your website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.923,
    "end": 650.784,
    "text": "Maybe it's something that's more of like a shared felt and sense thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.504,
    "end": 657.126,
    "text": "And so like, that's what I think he's saying, but like, he doesn't explain it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.147,
    "end": 658.147,
    "text": "So I'm not totally sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.66,
    "end": 667.125,
    "text": " Yeah, so these are good questions that we will, I think, hopefully have the opportunity to discuss further, for sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 667.145,
    "end": 682.196,
    "text": "Okay, unless there's anything else, we'll go to embodied cognition, where he says, brain, body, and environment together form one integrated cognitive embodied inactive extended system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 682.957,
    "end": 689.542,
    "text": "Recasting the phenomena of false inference and institutional psychosis as a matter of impaired prediction error minimization",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 690.154,
    "end": 701.556,
    "text": " may highlight how critically firm performance is also a function of upper echelons embodied cognition as determined amongst other by psychological aspects, as well as neurobiology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 702.196,
    "end": 713.938,
    "text": "So like in this section, there was like a big, like a whole bunch of like neuro neuroscience, like about dopamine and the reward system and prediction error minimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 713.998,
    "end": 718.279,
    "text": "And obviously like a firm doesn't have like dopamine as a prediction error, like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 720.201,
    "end": 721.602,
    "text": " or reward, but they do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 721.862,
    "end": 731.466,
    "text": "The whole firm isn't getting a dopamine hit, but the individual members within that firm are getting that dopamine, I guess, when their predictions are correct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 732.106,
    "end": 746.192,
    "text": "So, yeah, this was kind of like a... It was like a big stretch for me to jump into... I guess the embodied cognition of the firm is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 747.932,
    "end": 755.578,
    "text": " the embodied cognition of the upper echelon, but shouldn't it be like the embodied cognition of all of the firm members?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 756.099,
    "end": 764.906,
    "text": "Or how do you get that like bi-directional integration of information without like the bottom mattering just as much as the top here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 764.926,
    "end": 765.686,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 766.007,
    "end": 767.348,
    "text": "This was like fuzzy and weird for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 769.875,
    "end": 778.179,
    "text": " Well, so, I mean, I think like at one level organization, it's, you know, like all each member's individual, like dopamine receptors and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.219,
    "end": 778.359,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.399,
    "end": 793.526,
    "text": "But then at the next level, like you can abstract that away and say, maybe it's like the response to, uh, financing, like maybe having more access to like venture capital funding, for example, is a way of like motivating action for an organization or, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.567,
    "end": 819.464,
    "text": " visitor growth on a landing page it's like the signal like hey like you're going in the right direction like double down here and keep keep moving or keep exploring so that's maybe how I would think of it at like an organizational level uh in a way that maybe feels kind of like at a different level than just the sum of the dopamine receptors of all of its members",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.755,
    "end": 848.841,
    "text": " Yeah, like hearing you on the gamification metrics for the organization, like hits on the landing page or the number of subscribers or the number of viewers or the number of Twitter followers, all those things that we know that are like rewarding us personally with dopamine, like why, I guess like that, that's like an easy bridge to cross regarding like dopamine and institutional success or prediction or minimization, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 850.319,
    "end": 852.379,
    "text": " Well, what I mean by that is a little bit differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.399,
    "end": 861.461,
    "text": "It's not like, yeah, like on an individual level, like if you see more hits on your landing page, like that's going to have a dopamine response with you as an individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.102,
    "end": 876.465,
    "text": "But I think some of these things, like for example, like press coverage or getting venture capital funding, for example, like those produce systemic changes in an organization that aren't just merely about the dopamine response in the individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.426,
    "end": 881.588,
    "text": " And that's something that I feel like is like a higher level change that is like harder to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.608,
    "end": 894.534,
    "text": "I'm struggling to come up with the words for it, but just like when you get like a lot of funding into an organization or a startup, or you start getting traction on something, like it produces a kind of like social contagion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.554,
    "end": 901.577,
    "text": "I don't know if that's the right word that is more than just the sum of its parts of dopamine changes of its individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.239,
    "end": 906.359,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.19,
    "end": 909.951,
    "text": " Anything else here, or we can move on to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.375,
    "end": 915.396,
    "text": "Artificial intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.077,
    "end": 927.466,
    "text": "So here, Bajan says, free energy minimization is a machine logic in its own right, empowering living as well as artifactual organisms to optimally resist entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 929.608,
    "end": 934.112,
    "text": "And this is, I think, a shout out to the many",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.102,
    "end": 943.286,
    "text": " people who are working on using active inference in machine learning instead of reinforcement learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 943.566,
    "end": 945.587,
    "text": "So that's kind of great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 947.968,
    "end": 961.594,
    "text": "And like he really talks about like the ethics of that, like what happens when we like, you know, have like, he talks about the singularity, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 961.614,
    "end": 964.496,
    "text": "Like when machines become like smarter than us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 966.239,
    "end": 974.745,
    "text": " And he says that effectively the challenge is moving from coding, like programming with even with active inference, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 974.905,
    "end": 988.455,
    "text": "So coding to ethics, like how are we going to ethically like program the machines so that, you know, they're not like self-driving cars aren't running over, you know, people or whatever, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 988.475,
    "end": 991.937,
    "text": "Like, so there's the ethics and then to survival, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 992.52,
    "end": 995.122,
    "text": " like to human survival, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 995.182,
    "end": 1002.547,
    "text": "Like why, like, yeah, if the machines get to a point where they don't need us anymore, like why should they follow the ethics that we've programmed into them?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1002.567,
    "end": 1003.808,
    "text": "I guess, Daniel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.592,
    "end": 1007.474,
    "text": " Yeah, this was a very interesting section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.654,
    "end": 1018.245,
    "text": "First, we can imagine a kind of trolley car problem with some organization and some people and eventually the kind of decidability that's gonna have to come into play there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.746,
    "end": 1023.39,
    "text": "And the other provocative aspect in this from coding to ethics to survival",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.131,
    "end": 1027.272,
    "text": " is we often hear you can't get an ought from an is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.892,
    "end": 1034.334,
    "text": "So no amount of mechanic definition is going to result in an ethical imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.434,
    "end": 1035.475,
    "text": "Can't get an ought from an is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.095,
    "end": 1040.836,
    "text": "And that kind of describes this codings to ethics difficulty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.436,
    "end": 1044.697,
    "text": "You can't really get an ethic just from how something is encoded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.498,
    "end": 1052.32,
    "text": "But in a way, survival is being proposed as a post-ethical imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.297,
    "end": 1080.317,
    "text": " a first principles we couldn't necessarily go from is to ought but we can go from is through ought back to is which is survival and so it kind of re-insinuates a type of first principle ethic more like a work ethic than like a moral ethic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.452,
    "end": 1093.503,
    "text": " but that opens up a lot of questions about what kinds of ethics are of what statuses under or after the survival imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.049,
    "end": 1099.329,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.41,
    "end": 1099.97,
    "text": "It's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.99,
    "end": 1100.331,
    "text": "Cause like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.564,
    "end": 1107.346,
    "text": " I think with active inference or free energy governance specifically, there are two ways where I think it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.446,
    "end": 1116.928,
    "text": "One level is thinking about an organization as an organism where it's independent of my human experience of that organism, of what makes this organism survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.948,
    "end": 1125.811,
    "text": "And then I think the reason why I care about it the most, which is my own human experience of how meaning is created for me in an organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.863,
    "end": 1129.684,
    "text": " And I think ultimately, that's personally at least what I care about the most.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.704,
    "end": 1143.829,
    "text": "And then when I think about AI, I'm like, okay, well, even if you have an embedded AI on your system, if it doesn't mean something personally to the humans in that organization, I don't really care, even if it makes the organization survive more, or more likely to survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.849,
    "end": 1147.15,
    "text": "So it's just interesting, these two different takes of like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.146,
    "end": 1155.671,
    "text": " okay, even if it makes the organization more likely to survive, why do I care if that isn't meaningful to me as a human in that organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.012,
    "end": 1156.812,
    "text": "Not sure if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.199,
    "end": 1176.646,
    "text": "Yeah, so then Bajan also says, first order principles, such as AI's free energy minimization, will lay the foundation for governance models to increasingly self-organize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1177.27,
    "end": 1181.171,
    "text": " Um, so I think that like the, the, like, this is very meta.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1181.231,
    "end": 1187.513,
    "text": "It's like the, um, how Daniel was saying, like, we go from coding to ethics to survival.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1187.633,
    "end": 1202.798,
    "text": "I think like maybe ethics is like the fog between like coding and survival, um, where like free energy minimization, um, like is about persistence, um, and like can be used in coding and like will.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1203.502,
    "end": 1206.343,
    "text": " lay the foundation for governance models to increasingly self-organize.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1206.363,
    "end": 1211.123,
    "text": "So like self-organization based on free energy minimization, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1212.324,
    "end": 1213.804,
    "text": "Yeah, the section was interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1213.864,
    "end": 1221.185,
    "text": "And I do think that there's like, John is super excited about AI and like we got a long way to go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1221.205,
    "end": 1222.806,
    "text": "I mean, we'll get there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1223.086,
    "end": 1224.466,
    "text": "It's not impossible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1224.486,
    "end": 1226.886,
    "text": "It's just going to take some time, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1228.907,
    "end": 1230.887,
    "text": "Any other thoughts here in artificial intelligence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.237,
    "end": 1241.803,
    "text": " I mean, I have lots of other thoughts here, but I think like getting Bashan's perspective will be really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1243.427,
    "end": 1248.91,
    "text": " Yeah, I guess I'm just not, I think the thing I really am not quite understanding here is the explainability piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.13,
    "end": 1259.737,
    "text": "And I think I was trying to mention this earlier of like, if you have an AI that's like bubbling up insights about your organization, saying like, hey, this is what's going on, or like, this is the right answer of what you should do in this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.577,
    "end": 1264.019,
    "text": "But it isn't like understood by the people in that organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.78,
    "end": 1265.76,
    "text": "Like, does it even matter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.121,
    "end": 1268.442,
    "text": "And is that what Bajon means by explainability, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.462,
    "end": 1272.585,
    "text": "Like, even if AI gives you the right answer, but it isn't like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.59,
    "end": 1279.833,
    "text": " understood and integrated into the people in that organization, is that AI actually useful in that organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.055,
    "end": 1283.956,
    "text": "And that's the tension I've been grappling with here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.216,
    "end": 1285.316,
    "text": "And I don't quite understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.336,
    "end": 1289.238,
    "text": "And he talks a lot about explainability of predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.879,
    "end": 1292.32,
    "text": "I'm not sure if that's exactly what he's talking about or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.42,
    "end": 1294.281,
    "text": "But good question for Bijan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.522,
    "end": 1296.923,
    "text": "For sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.924,
    "end": 1302.946,
    "text": "And then the last section for future",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1303.629,
    "end": 1307.19,
    "text": " development is the board capabilities, developmental paths.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1307.65,
    "end": 1318.772,
    "text": "So he says indeed the board is ultimately responsible for anticipating the firm's future capability constellation, including that of the board itself to sustainably succeed with continuous strategic renewal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1318.832,
    "end": 1330.574,
    "text": "However, to avoid the cognitive traps related to individual board profiles that layman and wallet and identified, we must study the cognitive micro foundations of capability development at the board level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1331.397,
    "end": 1337.76,
    "text": " To date, this area represents a void in both strategy and governance research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1340.421,
    "end": 1357.448,
    "text": "So I thought that this was cool, especially with respect to the Active Interference Institute, as we are fleshing out our own board, and the board decides what this and future boards will be capable of doing now and forever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1358.27,
    "end": 1361.875,
    "text": " And like, they can always, all this stuff can be changed with approval of the board.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1361.915,
    "end": 1362.115,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1362.155,
    "end": 1369.583,
    "text": "So I think that, um, I liked this like capability constellation, um, phrase.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1369.623,
    "end": 1375.23,
    "text": "I thought that that was kind of neat because there's a lot of like, there's a lot of little like, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1376.277,
    "end": 1378.458,
    "text": " like sub capabilities within the board.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1378.478,
    "end": 1383.599,
    "text": "Like there's committees and this and that, and like everybody can do or take care of many different things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1383.759,
    "end": 1385.759,
    "text": "Or like, what don't we want the board to do?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1385.819,
    "end": 1401.643,
    "text": "Like the possibilities are pretty like endless and expansive, but like what is purposeful and what will gain like the most bang for the buck in terms of what should the board focus on?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1402.683,
    "end": 1404.624,
    "text": "That's kind of, I don't know, crazy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1406.811,
    "end": 1413.374,
    "text": " And then he outlined a little bit of these cognitive traps, but I didn't go too far into them here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1416.936,
    "end": 1419.357,
    "text": "Do you guys have anything here on board capabilities?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.479,
    "end": 1425.639,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.659,
    "end": 1428.66,
    "text": "Oh, so I did go actually a little bit into them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1428.74,
    "end": 1434.983,
    "text": "So what capabilities are required at the level of the individual board member when the necessary firm capabilities are not",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1435.905,
    "end": 1436.505,
    "text": " yet developed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1436.566,
    "end": 1442.29,
    "text": "And so as Bajan was thinking about this, he goes to this theory U, which I had never heard of before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1442.43,
    "end": 1448.094,
    "text": "And so he outlines three of the principles developed in this theory U, and it looks like that there's quite a few.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1449.355,
    "end": 1462.544,
    "text": "But he talked about like, what are the capabilities required at the board member level when we're defining the firm capabilities, like the board capabilities for now and forever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1462.764,
    "end": 1463.905,
    "text": "And so these I really liked.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1465.161,
    "end": 1468.362,
    "text": " So he says, number nine, practice, principle number nine is what it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1468.422,
    "end": 1470.162,
    "text": "Practice deep listening and dialogue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1470.302,
    "end": 1472.423,
    "text": "Connect with your mind and heart wide open.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1472.903,
    "end": 1477.223,
    "text": "When connecting to other people and contacts, open up all four channels of listening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.704,
    "end": 1485.285,
    "text": "Listen from what you know, from what surprises you, from the whole, and from what you sense wants to emerge, the emerging whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1485.385,
    "end": 1488.986,
    "text": "And I really liked this, like four different ways of listening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1489.006,
    "end": 1489.306,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1490.379,
    "end": 1491.44,
    "text": " something that we don't always think about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1491.46,
    "end": 1492.04,
    "text": "We just listen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1492.62,
    "end": 1494.621,
    "text": "And we listen in one way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1494.781,
    "end": 1496.362,
    "text": "We're just like, I listened, I heard this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1496.882,
    "end": 1504.326,
    "text": "But when you're looking at listening in different aspects, it's different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1505.427,
    "end": 1506.707,
    "text": "Listening from what surprises you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1506.827,
    "end": 1512.33,
    "text": "Can you listen to it four times and pretend like you don't know anything?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1512.45,
    "end": 1515.212,
    "text": "Pretend like, how does this relate to what you already know?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1515.812,
    "end": 1516.913,
    "text": "I thought that this was really nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1517.033,
    "end": 1517.753,
    "text": "I don't know if you guys have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1518.066,
    "end": 1524.773,
    "text": " but like if you were excited about it as I was as excited, or I can read a collective sense-making next.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1525.333,
    "end": 1529.057,
    "text": "Or maybe Tyler wants to read collective sense-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1530.629,
    "end": 1554.51,
    "text": " yeah sure and I was just gonna say I really love the convergence of like new AG and corporate governance uh literature kind of converging in free energy governance it's wonderful um all right so number 10 collective sense making so use social presence in theater and embodied knowing so whatever process you use to make sense of the learning Journey what matters most is that you pay discipline attention to all the voices and manifestations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.43,
    "end": 1581.165,
    "text": " of the field uh paying discipline attention means that you are intentionally holding back all inclinations to mix your own interpretations or solutions just spend all that because you want the data of the field to speak for you the data this field cannot the field cannot speak to you if your mind is too busy so that was also cool and then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.233,
    "end": 1582.473,
    "text": " Oh yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1583.534,
    "end": 1588.836,
    "text": "But the data of the field cannot speak to you if your mind is too busy expressing opinions and proposing solutions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1589.057,
    "end": 1590.437,
    "text": "Oh, that cuts to the core.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1591.978,
    "end": 1592.258,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1592.678,
    "end": 1592.939,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1593.259,
    "end": 1595.14,
    "text": "I guess I cut that off and then whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1595.54,
    "end": 1599.322,
    "text": "My slide making capabilities were subpar.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1600.903,
    "end": 1604.064,
    "text": "And then the last one, the last principle is principle 22.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1604.104,
    "end": 1607.106,
    "text": "I'm like, now I'm like, I want to read this theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1607.126,
    "end": 1608.126,
    "text": "You're like, what is this all about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1608.146,
    "end": 1611.308,
    "text": "I'm like totally interested in learning more about these principles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1612.386,
    "end": 1618.252,
    "text": " Number 22 is create enabling infrastructures that allow the system to sense and see itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1619.533,
    "end": 1627.66,
    "text": "And he quotes, making the system sense and see itself can change the coordination dynamics among the players in a field, moving them toward ecosystem awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1628.26,
    "end": 1638.89,
    "text": "As traditional governance models are increasingly uprooted in a discontinuous world, there is not only a need for a new governance logic, but correspondingly new board capabilities, developmental paths.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1639.688,
    "end": 1645.07,
    "text": " specifically duality management as a dynamic board capability demands dedicated research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1646.43,
    "end": 1651.372,
    "text": "Um, and that duality management just to like remind everyone is like financial and strategic control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1651.952,
    "end": 1657.214,
    "text": "So it's like both of those things, not one or the other, like they, they both work together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1657.434,
    "end": 1657.674,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1660.595,
    "end": 1666.817,
    "text": "And then we can go into chapter 13, or if you guys have more thoughts about this, these theory principles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1667.977,
    "end": 1668.057,
    "text": "No.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1669.563,
    "end": 1672.229,
    "text": " We can go into this chapter 13.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1672.269,
    "end": 1675.134,
    "text": "Tyler, do you want to read this portion of the abstract first?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1676.073,
    "end": 1684.099,
    "text": " Classical cause-effect determinism, upon which the paradigm of strategy management, as well as governance research, has been built, is uprooted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.76,
    "end": 1700.112,
    "text": "The parian academic's relentless pursuit of empirically establishing, qualifying, and then falsifying mechanistic cause-and-effect relationships is struggling to inspire the business community, which is itself reeling too often with the self-inflicted limitations of its own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.672,
    "end": 1723.872,
    "text": " of its very world models together academia and practice are challenged to reconnect organizing to that self-evidencing dimension of the universe's uh information system ifg is as valid for business organizations as it is for political contracts or for that matter matter navigating geopolitical dislocations and debt cycle disruptions thank you and i'll read this last piece",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.989,
    "end": 1746.508,
    "text": " It says any organism that suffers from one top-down bottom-up hierarchical disconnectivity and a top-down dominance of supervised content prescriptions, two, an urge to adapt to the outer world amid an incapacity for an active inference, and three, the non-existence of both a timeless deep purpose as well as meta capabilities is naturally entropy bound.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1747.569,
    "end": 1751.493,
    "text": "In the absence of a generative Bayesian model, we become incapacitated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1752.014,
    "end": 1757.878,
    "text": " Indeed, camping on seesaws is the categorical imperative of survival pursuing self-organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1758.558,
    "end": 1760.84,
    "text": "Organization as a means, not an end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1761.5,
    "end": 1766.784,
    "text": "It is right here where the fundamental difference between traditional corporate governance and free energy governance models lie.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1767.544,
    "end": 1774.949,
    "text": "Free energy governance sees through formal organization as organizing manifests itself as self-organizing generative model operating as a whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1775.509,
    "end": 1782.151,
    "text": " within and without the firm, embracing self-organization as a self-evidencing universal information system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1785.452,
    "end": 1793.875,
    "text": "And so he makes like, I just pulled out several claims that he made in this chapter and a couple like little summary sections, because this is like the official summary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.795,
    "end": 1804.658,
    "text": "He says, together, academia and practice are challenged to reconnect organizing to that self-organizing or self-evidencing dimension inherent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1805.14,
    "end": 1812.623,
    "text": " inherent of the universe's information system to purposefully create, extend, or modify the firm's resource base.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.483,
    "end": 1814.943,
    "text": "And that's a quote from Helfet et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1815.144,
    "end": 1816.704,
    "text": "And he says to thrive and survive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1817.764,
    "end": 1824.167,
    "text": "Purposeful behavior is one of life's defining features, but it is only possible if living systems operate as a whole.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1824.727,
    "end": 1833.37,
    "text": "It is only by managing information that the cell can impose order on the extreme complexity of its operations and therefore fulfill its ultimate purpose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1833.732,
    "end": 1835.773,
    "text": " purpose of staying alive and reproducing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1836.273,
    "end": 1837.213,
    "text": "And this is a quote from Nurse 2020.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1837.534,
    "end": 1855.841,
    "text": "And like, I just, I don't know, this is so hard because, and like, I'll always go back to like Mike Levin's beautiful explanation of like the constraints imposed by the larger system on a smaller system, because a cell's ultimate purpose is not staying alive and reproducing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1855.921,
    "end": 1858.262,
    "text": "In fact, like if it's one cell, sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1858.362,
    "end": 1862.124,
    "text": "Like, but in a multicellular organism, some cells, like the purpose of the cell is to die.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1863.049,
    "end": 1867.851,
    "text": " Like, I mean, we all start off with like webbing between the fingers and that webbing is cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1868.011,
    "end": 1869.752,
    "text": "And then that webbing, you know, goes away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1869.872,
    "end": 1876.875,
    "text": "Like, so that cell in like the construction of our existence, our morphology, like its purpose is to die.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1877.395,
    "end": 1891.381,
    "text": "So, um, I guess that that's, well, like we were talking about MNA earlier, like the purpose of the smaller firm that gets subsumed by a larger firm is also to like die or become incorporated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1891.795,
    "end": 1895.158,
    "text": " or to somehow integrate with the current larger firm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1895.618,
    "end": 1899.361,
    "text": "And so these constraints, I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1899.381,
    "end": 1912.692,
    "text": "So like the nested hierarchical levels, like each top level or each larger level constrains the function of the inner level and also that information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1912.712,
    "end": 1919.017,
    "text": "So, sorry, I have to just like say that because it's otherwise, it's not,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1920.086,
    "end": 1922.007,
    "text": " Staying alive and reproducing is not the purpose of sauce.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1922.147,
    "end": 1922.247,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1922.267,
    "end": 1924.909,
    "text": "I don't know if you guys have thoughts here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.59,
    "end": 1930.032,
    "text": "I can move on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.953,
    "end": 1945.042,
    "text": "Bichon says, free energy as an information theoretic rather than thermodynamic measure is uniquely positioned to measure and guide a firm's survivability as a self-organizing information as well as belief system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1946.255,
    "end": 1949.057,
    "text": " And he quotes this book from Lindsay 2021.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1949.117,
    "end": 1949.857,
    "text": "Daniel, have you read this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1949.897,
    "end": 1953.019,
    "text": "I haven't read it, but it's like a Friston memoir, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1954.32,
    "end": 1956.941,
    "text": "He says, Friston recalls a thought he had as a teenager.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1957.282,
    "end": 1960.483,
    "text": "There must be a way of understanding everything by starting from nothing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1960.924,
    "end": 1965.987,
    "text": "If I'm only allowed to start off with one point in the entire universe, can I derive everything else I need from that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1966.527,
    "end": 1971.61,
    "text": "In Friston's world, the free energy principle is now the nearly nothing that can explain almost everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1972.405,
    "end": 1974.006,
    "text": " I like this quote from this book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1974.146,
    "end": 1977.007,
    "text": "And also, I've got to go read it now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1977.047,
    "end": 1978.748,
    "text": "I don't know, is it a Friston memoir?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.788,
    "end": 1981.869,
    "text": "Maybe it's just an interview or a long article or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1981.889,
    "end": 1990.233,
    "text": "But I haven't read it, but it's someone else giving a detail of Friston's life and ideas, I guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.253,
    "end": 1993.335,
    "text": "I don't know if you guys have thoughts here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1997.176,
    "end": 1997.857,
    "text": "No, yes, no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.757,
    "end": 1999.877,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2002.634,
    "end": 2011.12,
    "text": " So I just want to just call out, we just talked about like very early on, like maybe it was like the fourth video.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2011.56,
    "end": 2013.842,
    "text": "We did talk about like, you're going, what are we talking about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2013.882,
    "end": 2022.327,
    "text": "Like thermodynamic versus information, theoretic, free energy, like go back because we really did get into that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2022.347,
    "end": 2023.868,
    "text": "So if you're going, what are we talking about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2023.948,
    "end": 2028.271,
    "text": "We did talk about that quite a bit in one of the early videos.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2028.531,
    "end": 2031.994,
    "text": "So now might be a good time to just like refresh your memory that we did detail that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2032.912,
    "end": 2036.834,
    "text": " if that's looking weird to you, go get a refresher.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2036.854,
    "end": 2039.815,
    "text": "Okay, and then claim here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2040.436,
    "end": 2056.663,
    "text": "In summary, the inferential discovery of informational dissonance as an error minimizing source for optimizing the accuracy of posterior beliefs, rather than explaining dissonance away, is essential to firm survival in discontinuous environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2058.328,
    "end": 2061.23,
    "text": " And I liked this like informational dissonance part.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2061.27,
    "end": 2066.634,
    "text": "This was like a couple videos ago, not that far in the past, but yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2068.676,
    "end": 2073.279,
    "text": "So this like brought up the initial communication question for Bhajan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2073.319,
    "end": 2076.001,
    "text": "Like, does everybody need to know everything all of the time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2076.021,
    "end": 2085.108,
    "text": "And also like your information getting updated with like the outside information to like resolve the dissonance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2086.649,
    "end": 2087.89,
    "text": "Anyway, there's that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2088.2,
    "end": 2089.021,
    "text": " Do you guys have thoughts here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2089.041,
    "end": 2095.588,
    "text": "All right, I'm gonna make somebody else read these because I'm tired of talking, tired of hearing myself talk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2096.549,
    "end": 2097.571,
    "text": "Tyler, do you wanna do this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2097.591,
    "end": 2099.933,
    "text": "This is the building blocks of an active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2099.953,
    "end": 2104.078,
    "text": "So this is a nice little summary recap of what we've learned so far.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2104.904,
    "end": 2105.184,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.284,
    "end": 2106.685,
    "text": "Building blocks of an active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.025,
    "end": 2119.393,
    "text": "So one is the four states that's active action, sensory perception, internal from resources and external, the hidden unknowns to one internal external, external Markovian boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.573,
    "end": 2127.739,
    "text": "The site where actions upon hidden states generate outcomes that feed in circular causality, our perception and allow the precision enhancing, updating of prior beliefs, predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.68,
    "end": 2136.886,
    "text": " Three, one first order principle, free energy minimization as a measure of minimizing equivocally error and uncertainty, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.906,
    "end": 2140.508,
    "text": "the divergence between predictions, prior beliefs and outcomes, posterior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.988,
    "end": 2143.09,
    "text": "Eventually, everything becomes miserable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.11,
    "end": 2146.933,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2147.473,
    "end": 2147.673,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.293,
    "end": 2150.415,
    "text": "And so Bijan makes this claim.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2151.274,
    "end": 2169.749,
    "text": " that once managers start approaching exploration in the form of an active inference linking in circular causality all four states conditioned by the Markov blanket and governed by free energy minimization, we can straightaway see that success in exploration is critically determined by the level of sophistication of a few things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2169.909,
    "end": 2177.675,
    "text": "First, prediction models, a self-evidencing eco-niche model that connects corporate purpose with the very predictions the firm stipulates.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2178.442,
    "end": 2206.638,
    "text": " second the bounded set of external states that the firm decides to act upon to bottom up sample the world and test hypotheses with the least required computational resource investment and third belief updating resulting from the consequences posterior beliefs that the firm's actions generate and so this is also like a nice little summary section i thought um and this can he continues to say it is now self-evident to appreciate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.13,
    "end": 2208.951,
    "text": " that action is central to perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2209.471,
    "end": 2215.314,
    "text": "More importantly, the firm's generative model and actions control ambiguity and uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2215.755,
    "end": 2218.036,
    "text": "The firm's generative model is the firm's eco-niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2218.356,
    "end": 2221.798,
    "text": "The firm is more in control than it traditionally resists to believe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2222.718,
    "end": 2225.279,
    "text": "The perception of uncertainty is actor-observer, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2226.0,
    "end": 2226.92,
    "text": "firm-specific.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2229.061,
    "end": 2234.724,
    "text": "And I did like that, like real uncertainty versus the perception of uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2234.784,
    "end": 2235.845,
    "text": "And when we're talking about like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2236.3,
    "end": 2238.601,
    "text": " embodied, enacted, extended cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2239.542,
    "end": 2243.464,
    "text": "It's all about like your perception of uncertainty versus actual uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2246.665,
    "end": 2254.469,
    "text": "So like, you know, unless you can count cards, you're uncertain of like, if you're playing blackjack, you don't, you don't know what your chances are of getting 21.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2255.27,
    "end": 2257.611,
    "text": "But like, if you can count cards, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2257.631,
    "end": 2258.932,
    "text": "Like it's just, that's just one example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2258.972,
    "end": 2263.014,
    "text": "Like you're less uncertain if it's a single deck blackjack, like you're less uncertain as to what,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2263.846,
    "end": 2290.647,
    "text": " are the possibilities as the game continues to unfold it's also interesting there with the um kind of declaration of independence like self-evident appreciation that reflects the real bright line between passive inference and active inference and it's like that claim does one agree or disagree and then if they did agree",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.327,
    "end": 2310.698,
    "text": " then they have already seen their own eye movement and decision to seek out this information as central to their perception of that expression so it kind of serves as like a koan of self-evidencing and then there are some downstream implications for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.31,
    "end": 2321.842,
    "text": " one that he attacks many times throughout is that the external world is not uncertain there's not uncertainty in the commodities market there's an observer dependent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.722,
    "end": 2350.42,
    "text": " uncertainty about external states and about action selection and active inference is just is a generic family of strategies for jointly resolving uncertainty about external states and actions that bring alignment aka provide pragmatic value so many of those implications of feg are downstream of the acceptance or acknowledgement that action is central to perception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.208,
    "end": 2358.249,
    "text": " Very nice, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.29,
    "end": 2367.293,
    "text": "Okay, so he lists these requirements for outperformance and survival.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2367.873,
    "end": 2369.094,
    "text": "Tyler, do you wanna read these for me?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2370.254,
    "end": 2370.474,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2371.555,
    "end": 2374.356,
    "text": "All right, one, a timeless, deep purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.037,
    "end": 2380.559,
    "text": "Two, generative top-down, bottom-up prediction error minimization, form of free energy minimizing and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.979,
    "end": 2385.762,
    "text": "Three, principled values and aspirations determining eco-niche prosperity and sustainability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.522,
    "end": 2397.947,
    "text": " If all three elements are articulated in simple, explainable language and communicated to all members within and beyond the firm's boundaries, then the firm's long-term prospects will be sustainably enhanced in form of a self-organizing and generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.507,
    "end": 2404.47,
    "text": "The board of directors, rather than executive leadership, only must ensure that those elements come to life, and more importantly, stay alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.612,
    "end": 2410.953,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.253,
    "end": 2413.154,
    "text": "And oh, wait, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2413.516,
    "end": 2417.937,
    "text": " So this goes back to, um, like we were talking about purpose earlier and like, where does purpose come from?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2417.997,
    "end": 2419.477,
    "text": "Who decides what the purpose is?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2419.917,
    "end": 2424.418,
    "text": "Uh, so this, it was more talked about, I think a lot in this chapter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2425.478,
    "end": 2427.959,
    "text": "Um, and, and we've also talked about it before through the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2427.999,
    "end": 2431.059,
    "text": "So this is a nice little, um, wrap up section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2431.079,
    "end": 2438.401,
    "text": "Um, and then Bijan goes on to make the claim that free organization, free organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2438.901,
    "end": 2439.061,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2439.788,
    "end": 2447.233,
    "text": " I've said organization so many times, I think like if I were to count, like I probably have said the word organization like a thousand times in this live stream, maybe not, maybe 150.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2447.313,
    "end": 2459.501,
    "text": "Free energy governance is as valid for business organizations as it is for political constructs or for that matter, navigating geopolitical dislocations and debt cycle disruptions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.462,
    "end": 2465.085,
    "text": "Any organism that suffers from a one top-down bottom-up disconnectivity is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2465.598,
    "end": 2469.882,
    "text": " Two, top-down dominance of ideological and supervised content prescriptions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2470.562,
    "end": 2476.887,
    "text": "Three, dominant logic to adapt to the outer world amid its self-inflicted incapacity for an active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2477.108,
    "end": 2493.361,
    "text": "And not least, four, non-existence of a time's purpose as well as Medicaid abilities, such as listening to what wants to emerge in the web of random interactions and observing the observer, is naturally entropy-bound and incapacitated to navigate macro disruptions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2494.972,
    "end": 2500.894,
    "text": " So he gives that like recipe for survival and outperformance here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2501.274,
    "end": 2504.195,
    "text": "So, and in the last requirements for outperformance and survival.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.715,
    "end": 2508.876,
    "text": "So I think that those are just like the three, those are just like the inverse statements of each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2508.956,
    "end": 2509.817,
    "text": "Like, this is what we need.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2509.837,
    "end": 2511.017,
    "text": "This is what we can't have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2512.978,
    "end": 2523.961,
    "text": "So that's a nice like way to wrap up, like how free energy governance will contribute to the firm's outperformance and survival in the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2524.622,
    "end": 2526.023,
    "text": " competing with other firms and such.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2526.043,
    "end": 2528.705,
    "text": "Do you guys have any thoughts here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2531.266,
    "end": 2532.807,
    "text": "Good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2534.008,
    "end": 2534.168,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2534.208,
    "end": 2539.991,
    "text": "And then I just pulled this final quote out and we kind of alluded to this earlier.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2540.012,
    "end": 2551.699,
    "text": "It says, does the uncertainty that humans face come from the inherent instability of the human landscape or from the perceptions and belief systems that we have about the human environment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2552.219,
    "end": 2553.18,
    "text": "And this is kind of nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2554.679,
    "end": 2584.168,
    "text": " like what what is it that's unstable like where is the uncertainty is the uncertainty like in our perception or is it in the world somewhere so um i don't know this is a nice like thing to think about and um how to in resolving that uncertainty through action i think like gets to kind of the core of free energy governance um here at the end of the book so thanks",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2584.619,
    "end": 2585.319,
    "text": " for listening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2585.399,
    "end": 2594.384,
    "text": "I don't know if you guys have any final thoughts on any of the content presented here in these two chapters or on the book overall, or, you know, questions that are brewing through your mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2595.324,
    "end": 2595.965,
    "text": "Nothing like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2596.305,
    "end": 2596.925,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2596.965,
    "end": 2608.931,
    "text": "We're quick through the concluding sections and we look forward to having an open discussion with the author in a few weeks, as well as other participants who have been keeping up with the content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2611.853,
    "end": 2612.633,
    "text": "So thanks guys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.817,
    "end": 2614.419,
    "text": " Thank you, Tyler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.459,
    "end": 2615.001,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.129,
    "end": 2617.431,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  }
]