[
  {
    "start": 5.148,
    "end": 8.07,
    "text": " Hello, welcome to Act-Inf Bookstream number 1.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.751,
    "end": 12.914,
    "text": "It's February 15th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.295,
    "end": 16.056,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.597,
    "end": 22.161,
    "text": "We're a participatory online institute that's communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.082,
    "end": 28.886,
    "text": "This is a recorded and archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.867,
    "end": 34.39,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.765,
    "end": 41.709,
    "text": " Check out ActiveInference.org to get involved with live streams and other projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.809,
    "end": 44.23,
    "text": "Blue, to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.632,
    "end": 47.872,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.992,
    "end": 53.196,
    "text": "Well, this is our second discussion of the book, Governing Continuous Transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.796,
    "end": 62.121,
    "text": "We are here with the author, Bijan Kesri, today, and we will be discussing part two of the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.542,
    "end": 66.303,
    "text": " So I think we want to maybe go around and introduce ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.623,
    "end": 73.525,
    "text": "I am Blue Knight and independent research consultant in New Mexico, and I will pass it off to Tyler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.965,
    "end": 75.685,
    "text": "My name is Tyler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.705,
    "end": 78.366,
    "text": "I'm a protocol designer and DAO researcher in California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.066,
    "end": 79.686,
    "text": "Pass it to Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.807,
    "end": 84.948,
    "text": "Daniel, I'm a researcher in California and pass it to Bijan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.06,
    "end": 105.042,
    "text": " okay so um obviously an author uh really coming much more from the practical side of the world having been serving on the boards and eventually taking a strong interest in the theory and being inspired by active inference and in particular the free energy minimization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 106.38,
    "end": 127.169,
    "text": " principle to adopt that and apply it to the world of corporate governments so hence the book i very much appreciate that you invited me today and hopefully being in a having another stimulating discussion i always love to see how um you know there's so much work which goes into writing a book it's a very lonely journey",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 127.789,
    "end": 138.391,
    "text": " And when it's once out and you see actually such a gifted group of people looking at it, reading it, critically reviewing it and engaging in a dialogue, it's a great gift for an author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 138.411,
    "end": 140.651,
    "text": "So I'm very, very happy to be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.991,
    "end": 141.352,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.292,
    "end": 144.592,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.152,
    "end": 147.813,
    "text": "Well, carry it forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.873,
    "end": 153.334,
    "text": "So we are here discussing part two of free energy governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.374,
    "end": 154.934,
    "text": "So over the last four weeks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.489,
    "end": 158.931,
    "text": " we have discussed these last four chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.871,
    "end": 164.314,
    "text": "And so today's discussion is going to just encompass those sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.214,
    "end": 179.942,
    "text": "So a bit of a roadmap, we had some kind of category questions regarding the role of empathy in free energy governance, the role of artificial intelligence in free energy governance, and also on duality management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.194,
    "end": 184.376,
    "text": " So starting off with empathy, we got here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.997,
    "end": 191.84,
    "text": "So I just actually was, I think, looking up a photo for like top down, bottom up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.88,
    "end": 192.841,
    "text": "Like, what does that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.941,
    "end": 196.083,
    "text": "Top down, bottom up organization and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.583,
    "end": 201.269,
    "text": " And so in my photo scrolling, I found this old paper, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.429,
    "end": 202.25,
    "text": "So it's from 2008.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.971,
    "end": 211.02,
    "text": "And it's really about empathy and emotional resonance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.98,
    "end": 220.163,
    "text": " So this picture I thought was a great picture and it had perception action coupling and shared representation and kind of like the self and other distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.323,
    "end": 227.806,
    "text": "And I don't know, Bijan, if you've read this paper, but for me, like it was a figure that kind of encompassed all these things that we've been talking about in the book all along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.506,
    "end": 252.628,
    "text": " And so to quote Bijan's book, he says, cognition in the form of world enactment is the purpose-directed, action-centric, and social construction of shared meaning and shared expectations, anchored in the understanding that a firm's environment is a matter of environmental engagement in the form of interaction revealing significance and assigning probabilities to a bounded set",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.248,
    "end": 255.29,
    "text": " of external unknown states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.451,
    "end": 265.14,
    "text": "And I just was wondering like about maybe the role of empathy in like gaining a shared representation or a shared understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.665,
    "end": 269.566,
    "text": " So I don't know if you want to flip to the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.747,
    "end": 270.867,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.268,
    "end": 277.813,
    "text": "And so here is empathy required for this shared meaning and shared expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.913,
    "end": 290.802,
    "text": "And I'm curious to know, Bijan, what your thoughts are maybe on either this or maybe I know we hear also a lot about the role of emotional intelligence in business success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.739,
    "end": 297.023,
    "text": " Where does maybe emotional intelligence come in to free energy governance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.383,
    "end": 301.307,
    "text": "Is that also essential or what are your thoughts here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.236,
    "end": 303.557,
    "text": " Okay, no, I think it's a very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 303.577,
    "end": 305.218,
    "text": "First of all, I did not come across the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.618,
    "end": 308.419,
    "text": "I think it is a brilliant illustration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.999,
    "end": 312.581,
    "text": "Having said so, it's interesting to see it puts perception and then action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.741,
    "end": 314.002,
    "text": "I put it the other way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.502,
    "end": 318.404,
    "text": "I see the action is really determining our perceptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.484,
    "end": 329.53,
    "text": "But I think it's a very, very good question because what you're doing is you're opening something which I think, as part of my work, I consider the black box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.13,
    "end": 331.251,
    "text": "Because when you look at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 332.887,
    "end": 356.021,
    "text": " know i don't like really bottom i think i said this in one of our previous discussions i prefer frontline workers i mean people are really in the front line having said this the the top down bottom up dynamic you have at every hierarchical level and effectively sometimes it's a question of how you naturally work together so then you open up the black box of teamwork",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.741,
    "end": 382.091,
    "text": " of um how do you how do you engage actually which is how do you understand each other and i think that's where empathy plays a very important role i think that's where um in emotional intelligence starts playing a very important role what i have done for the purposes of the book for the purposes of the free energy governance concept i really focused on i think communication",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 383.052,
    "end": 391.974,
    "text": " But there is a lot in communication, which is also empathy related, you could argue, to make sure that actually people hear what you're saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.994,
    "end": 396.395,
    "text": "And obviously, sometimes there needs to be an empathetic dimension in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.136,
    "end": 406.118,
    "text": "But what I think the waterfall here is you start really with a purpose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.966,
    "end": 435.232,
    "text": " when you don't have a purpose then it becomes a little bit fuzzy but if the purpose is very clear that we want to go to rome then there's many ways that are leading to rome but as you're going on this journey and keeping actually the team together keeping the team energized motivated of going through a lot of hazards maybe crossing the alps from from europe to you to on the way to rome",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 436.672,
    "end": 438.473,
    "text": " communication becomes very essential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.533,
    "end": 455.84,
    "text": "And when you look at the practical side of the work, even when you take a publication like Harvard Business Review, which in my view is one really of the leading business publications, which addresses really current issues managers, company leaders, but including frontline workers are focusing on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 456.54,
    "end": 479.417,
    "text": " and you see that empathy emotional intelligence and communication are really critical things in making the most complex strategies work because there is no point of being very smart about analyzing where the world is going if you're not able to align and motivate all the resources all the dots of intelligence in the firm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 480.202,
    "end": 509.209,
    "text": " to join this so i stayed away as part of the work of looking now into the microcosm of communication of what's happening between you know let's say a leader and a frontline worker how much empathy you show in certain situations to ensure that actually the whole flow is going to work so i think to answer to summarize the answer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.174,
    "end": 535.961,
    "text": " When you look at emotional intelligence, when you look at empathy, there are dimensions, you would consider more on a micro level in the way things are being translated, which I stayed away from, and really considered it as a black box of how the how probably the communication is best done in very specific circumstances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.2,
    "end": 554.784,
    "text": " That's clear because it's a very unusual, I think it's a very good question because it's a question which really strikes the heart of management and has become obviously in recent years a very popular theme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 555.564,
    "end": 561.666,
    "text": "And nobody has ever asked me that question in this context, so I really appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 564.521,
    "end": 569.683,
    "text": " And I do remember, I mean, I'm not sure if you've read Human Communication as Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.703,
    "end": 575.044,
    "text": "That was like one of the very first papers that we did at the Institute in our live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.144,
    "end": 584.847,
    "text": "But, you know, it still is communication as like a necessary tool and how communication is used to kind of establish that shared meaning and shared expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.987,
    "end": 592.249,
    "text": "But as for like the nuts and bolts of it, it's still... Oh, and then we did another recent...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.209,
    "end": 618.15,
    "text": " um paper dealing with communication as active inference kind of like the follow-up but by a different author like the counterpoint to that paper i can't remember the name of it um that was interesting too i would really appreciate if you could send me the links to those papers sure sure um daniel i'm sure remembers and i can go back through the live streams if i don't remember um i appreciate it thank you um and so just do you think that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.272,
    "end": 623.976,
    "text": " in human cognition, we have, we have empathy in, in human cognition and it plays a role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.076,
    "end": 629.1,
    "text": "Do you think that there's an analog in organizational cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.24,
    "end": 641.47,
    "text": "Like, do you think when a firm has cognition that there's what, what would be, what would take like the equivalent role of empathy in a firm, if anything, or, or maybe that's kind of esoteric or, or what, what are your thoughts there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.152,
    "end": 644.493,
    "text": "No, I do think, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.485,
    "end": 648.487,
    "text": " You know, I mean, what is a firm?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.067,
    "end": 650.508,
    "text": "A firm is a legal fiction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.329,
    "end": 654.992,
    "text": "And it's really a bunch of people and a bunch of assets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.953,
    "end": 658.695,
    "text": "And sometimes actually the only asset could be the people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 659.075,
    "end": 662.298,
    "text": "Let's say in a services business where there's no machinery or anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 663.179,
    "end": 666.702,
    "text": "So I think it really comes down to people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.002,
    "end": 668.543,
    "text": "I think it comes down to leadership.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 669.344,
    "end": 671.586,
    "text": "It comes down to the identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.626,
    "end": 672.947,
    "text": "It comes down to the culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 673.607,
    "end": 673.727,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 674.708,
    "end": 696.688,
    "text": " in recent years you've seen that many many companies rip i mean through their leaders have paid a lot of lip service to being an empathetic organization having understanding for the needs of the workers of the frontliners of the asset really of the company so i do think that today",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 699.068,
    "end": 707.527,
    "text": " I cannot imagine that a firm which is not empathetic and or integrates empathy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.256,
    "end": 718.824,
    "text": " as an important pillar of the values and the culture, it lives, it doesn't have a great chance to survive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 719.364,
    "end": 733.856,
    "text": "And when you look at culture, what is culture in a corporate, in an organizational setting, it's really behavioral benchmarks which determine really what we would expect of people in this particular setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 735.357,
    "end": 742.621,
    "text": " And I think this empathy today is incredibly important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 742.641,
    "end": 751.226,
    "text": "And by the way, I do think that the concept of empathy has gained an entirely new dimension following the pandemic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 752.066,
    "end": 777.348,
    "text": " know when you start seeing um people being locked up having to when you have two working parents kids sitting at home all of a sudden there's so many things to juggle where a company an employer needs to show empathy and understanding for the very particular challenges people face and if you don't um you you will eventually lose",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 779.958,
    "end": 800.911,
    "text": " sometimes even the best of your people so the other follow-up question on that and maybe just to pose the question in a slightly different way so a lot so far we've been talking about empathy in terms of like an individual human cognition right and like hey that should be an important part of your culture because it allows communication to flow within and without the form the firm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.832,
    "end": 805.815,
    "text": " But I'm curious if this is an analog on the firm organizational level scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.195,
    "end": 827.87,
    "text": "So in the same way that on an individual scale, you're mirroring the motions of another person, of an external individual, is there a way in which the organization as its own entity mirrors the outside world and mirrors kind of its own perception of the environment and what you could call the emotions of other firms or other processes happening in this external environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.41,
    "end": 841.413,
    "text": " It's a very maybe strange question, but I'm kind of curious, in what way do you think that the firm under free energy governance is receptive and can integrate information in its external environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.074,
    "end": 847.235,
    "text": "And is that different in a way to how people traditionally think of gathering data about the environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.355,
    "end": 855.357,
    "text": "Well, when you look at actually, if you were to dissect empathy and what is it really, I think there's two aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.667,
    "end": 859.749,
    "text": " there's two, three dimensions I could instantly think of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.429,
    "end": 867.653,
    "text": "You say a person matters, so somebody matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 868.533,
    "end": 871.094,
    "text": "Secondly, you respect that person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.995,
    "end": 876.217,
    "text": "And thirdly, you listen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.617,
    "end": 879.218,
    "text": "I think the listening part is an incredibly important part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 879.238,
    "end": 882.64,
    "text": "How can you be empathetic if you haven't listened in the first place?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.12,
    "end": 886.222,
    "text": "So when you look at all these three dimensions, respect,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 888.064,
    "end": 915.215,
    "text": " listening um the idea that some some somebody and what somebody has to say matters is an essential foundation of free energy governance because free energy governance effectively says even the weak signals bear the transformative potential we need to listen to so first of all you need to open all your senses in free energy governance",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 917.489,
    "end": 920.857,
    "text": " to listen to what actually frontliners have to say and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 924.105,
    "end": 949.241,
    "text": " start with the working assumption that what they have to say matters doesn't matter what in in what area they address it um to be able to read in between the lines so that's the only way i could stretch the the concept the dimension of empathy and really link it into um into free energy governance by dissecting it into let's say these three dimensions what empathy stands for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 950.001,
    "end": 976.406,
    "text": " and then pull it back into the free energy governance framework which effectively says the strategy fundamentally is a generative process of prediction error minimization and so you may articulate predictions at the top but they are only as good as you can challenge them with bottom-up data and the bottom-up data to access it to make it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 977.58,
    "end": 998.042,
    "text": " low from the bottom to the top probably requires an element of empathy because my personal experience is the more you go the closer you go to the front lines in an organization the stronger is actually the resistance to sharing valuable information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 998.843,
    "end": 1002.404,
    "text": " And the reason is not that people don't want to share.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1003.224,
    "end": 1006.964,
    "text": "The reason is that people prefer not to stick out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1007.985,
    "end": 1020.507,
    "text": "People prefer not necessarily to assume responsibility now for something they say, or even if it becomes a project in its own right that they may have to execute it, but they wouldn't want to execute it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.867,
    "end": 1027.488,
    "text": "So what you find is unlocking the valuable intelligence, which is at the front lines of an organization,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1028.468,
    "end": 1054.545,
    "text": " is a management challenge in its own right and i think it requires very strong communication and it certainly requires empathy and the empathy and maybe now i can i can close the circle here to your question tyler and what blue was referring to before maybe it has to be more than just an empathetic leader maybe it has to be trust",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1055.345,
    "end": 1064.83,
    "text": " in processes, in an entire culture that I feel comfortable about for this to work on a continuous and sustainable basis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1065.27,
    "end": 1069.872,
    "text": "Because when we look at free energy governance, this is not like a one-off project.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1070.352,
    "end": 1077.616,
    "text": "This is ingrained into the DNA of the firm, of saying the future of the firm is best ascertained",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.516,
    "end": 1082.479,
    "text": " if we continuously generatively minimizing prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1082.679,
    "end": 1086.281,
    "text": "So predictions at the top, but possibly sometimes at the bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.821,
    "end": 1090.384,
    "text": "And we want to challenge those predictions with frontline intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1096.728,
    "end": 1099.43,
    "text": "So just a quick follow up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.53,
    "end": 1105.734,
    "text": "As you were talking, Bijan, especially about the pandemic, and I was there thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.693,
    "end": 1116.659,
    "text": " empathy and leadership, you know, I was just directed back to the task positive network versus the direct default mode network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.52,
    "end": 1128.267,
    "text": "And so I think maybe like empathy is the central component in the default mode network, like empathy, like the default mode network is like the people centered part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.77,
    "end": 1130.17,
    "text": " of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.691,
    "end": 1144.519,
    "text": "Um, and, and I was, I think like now with the pandemic, like it just like jarred me into like, we're now, so I feel like we're so off task, like, like, I mean, maybe not in every organization, but I think as a society, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.359,
    "end": 1162.432,
    "text": " we're so much more centered, we're flipped into heavy on the DMN as opposed to the TPN, just culturally because of the greater amount of empathy that everyone was just required to drum up for people and their circumstances, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.112,
    "end": 1164.494,
    "text": " Absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1164.975,
    "end": 1175.589,
    "text": "And I do think what has reinforced, it's a very good way of looking actually at the task-specific network and the default mode network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1175.969,
    "end": 1176.891,
    "text": "You're absolutely right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1177.391,
    "end": 1179.194,
    "text": "The empathy is part of the default mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1179.254,
    "end": 1180.716,
    "text": "When you look now at the pandemic,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1182.068,
    "end": 1183.869,
    "text": " it was all about the default mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.029,
    "end": 1198.26,
    "text": "I mean, because there was so much misery, so much tragedy, certainly in the first waves, and uncertainty, unpredictability, and our models were overwhelmed because our world models were not prepared to deal with this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1198.36,
    "end": 1207.807,
    "text": "It took a year, a year and a half, and we integrated the pandemic perfectly well into an adjusted, a further evolved model, and we developed new strategies of how to deal with this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.887,
    "end": 1210.449,
    "text": "But one element is, for example, home office.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.249,
    "end": 1221.179,
    "text": " And when you think about how hard it has become for many firms to bring people back to the office, and you could almost say the office is maybe",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1223.444,
    "end": 1227.99,
    "text": " the physical representation of the task specific network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.03,
    "end": 1235.62,
    "text": "You go because you're really executing a specific task in a building and then you leave it and then you're out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.98,
    "end": 1241.327,
    "text": "So almost there was a certain link in the brain between office",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1242.308,
    "end": 1270.665,
    "text": " and task specificity um i do recall another example which is kind of interesting in that context but i don't want to drift up too far but i do recall that banks introduced um you know it was kind of only in the 90s i think that they introduced that you can have a casual friday so normally it was really just you wear a suit and then you come on fridays you can wear casual smart",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.604,
    "end": 1285.474,
    "text": " And I remember somebody was telling me, actually, when you go on the Goldman Sachs trading floor, the person who has a hole in the sweater and all of this on a Friday, that's probably the guy who makes most of the money because he shows, like, I don't even have to wear a smart cap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.975,
    "end": 1288.977,
    "text": "But a lot of people said when the financial crisis hit in 2008,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1290.74,
    "end": 1308.288,
    "text": " and which was really exuberance of all that cheap money putting a lot of people into misery with debts and mortgages, that this was partly related to the fact that the casual Friday became almost a casual whole week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.008,
    "end": 1310.209,
    "text": "And it had an impact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.016,
    "end": 1317.361,
    "text": " on how people were performing actually their tasks and their attitude towards risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1317.742,
    "end": 1327.51,
    "text": "So I do think that form and informality are very, very critical aspects of how an organization works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.91,
    "end": 1333.455,
    "text": "And sometimes the informal organization, which is obviously a function of the formal one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.909,
    "end": 1336.21,
    "text": " can be much more important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.67,
    "end": 1340.612,
    "text": "And sometimes it can be much more important how information is flowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.132,
    "end": 1345.334,
    "text": "Most of the time in organizations, coming back to the free energy governance framework,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.343,
    "end": 1351.544,
    "text": " The most valuable information does not come through the formal channels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.104,
    "end": 1353.865,
    "text": "It comes through informal channels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.325,
    "end": 1357.465,
    "text": "It may come through a conversation at the water cooler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1359.286,
    "end": 1365.287,
    "text": "All these things which are not necessarily documented in the traditional forms of corporate communication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1365.887,
    "end": 1370.088,
    "text": "So I think these are probably also the channels",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.078,
    "end": 1374.02,
    "text": " where empathy can be best communicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.04,
    "end": 1386.129,
    "text": "And I think the big loss during the pandemic was that while the office work and the office space was maybe very formal and very...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1388.09,
    "end": 1409.588,
    "text": " task specific I think it was at the same time underestimated how important it is to provide to frontliners to even to leaders a source of empathy in exchange because I think most people were confronted with a terrible loneliness and so we shouldn't underestimate and we shouldn't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.791,
    "end": 1435.322,
    "text": " bash too much the physical office space is a very important place not only where um where you perform your task but could be also a source of of being energized and receiving understanding for issues which have nothing to do with your job and more importantly it's really the the side of learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1436.322,
    "end": 1441.425,
    "text": " I do recall when Morgan Stanley, CEO, insisted that people are coming back to the office.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.965,
    "end": 1452.391,
    "text": "It was really by saying our future as a company is dependent on continuing training people and bringing in young talent who have to learn on the job.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1452.751,
    "end": 1455.473,
    "text": "How can they learn on the job when the office is empty?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1455.853,
    "end": 1456.794,
    "text": "So there is a duty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.774,
    "end": 1479.03,
    "text": " in the name of firm survival to keep the firm as a learning side and that means bringing in the side so that's a long talk um obviously the the concept of empathy in the context of free energy governance is not an obvious one but i think this is an interesting very interesting conversation and i do think that we um we need to dissect",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1480.611,
    "end": 1482.233,
    "text": " what really empathy means for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1482.733,
    "end": 1489.939,
    "text": "And then we need to look at what is a firm, a firm consisting of people, of assets, but also of the physical space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1490.479,
    "end": 1496.604,
    "text": "And I think the space is a very important dimension to consider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1496.624,
    "end": 1509.214,
    "text": "And that's where the pandemic is an interesting example of how it can be a source of whatever positive we associate with empathy to provide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1512.222,
    "end": 1512.542,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.163,
    "end": 1518.785,
    "text": "So we'll move now into talking a little bit more about artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.586,
    "end": 1529.371,
    "text": "And you say in the book, you say, in fact, we are challenged not to allow for the human brain's computational limits to solely determine perception and sense making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.811,
    "end": 1539.256,
    "text": "Instead, outsourcing some of the heavy information lifting to the environment in the form of extended cognition is the essence of optimizing prediction error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.896,
    "end": 1554.884,
    "text": " The more exponential and hence discontinuous a market environment, the more we need self-organizing mechanisms that leverage the world as a supervisory signal challenging in circular causality the very perceptual content of our predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.564,
    "end": 1566.53,
    "text": "And in reading this, I have been having lots of fun working with GPT-CHAT, as I'm sure you have and many others have been, and really as just kind of a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.17,
    "end": 1589.839,
    "text": " like a platform or a standing like a springboard for like where we what we already know like it's a very big cognitive synthesis of like you know the whole internet circa 2021 or or something like that and so like this is really a cognitive extension like our smartphone and many other things um and so i just was wondering what role",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.459,
    "end": 1616.498,
    "text": " you might see for chat gpt or other automated artificial intelligence i mean like the you know there's no limit to um assist us with free energy governance because i really see like an assisting with the synthesis and integration of information like at a very large scale even just now compared to a year ago so do you see a role um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.162,
    "end": 1624.126,
    "text": " for AI in free energy governance or helping us to kind of springboard our leadership platforms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.846,
    "end": 1626.707,
    "text": "Yeah, very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1626.747,
    "end": 1631.15,
    "text": "So let me, there's many dimensions to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.63,
    "end": 1643.617,
    "text": "Number one, free energy governance, strictly speaking, does not consider making use of AI at the board level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1644.744,
    "end": 1651.305,
    "text": " Now, when you look, and let's briefly talk about an organization and applications of AI, you have today",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.588,
    "end": 1663.857,
    "text": " I mean, so many examples from credit cards where you have AI, I mean, which used to be, which has been now automated in a massive way of how credit checks are happening on the spot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.278,
    "end": 1672.284,
    "text": "It's no longer left to the retailer, but there's a central system which can authorize the credit card transaction instantly or refuse it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1672.865,
    "end": 1680.391,
    "text": "So there has been predictive algorithms being centralized and changing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.059,
    "end": 1684.462,
    "text": " the way certain tasks have been done in an organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1684.522,
    "end": 1692.633,
    "text": "So I would say the application of AI today is very much at the front lines, whereas it's probably",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1694.113,
    "end": 1697.456,
    "text": " A little bit further up the chain also is if you look at healthcare.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1697.976,
    "end": 1721.616,
    "text": "So a radiologist is possibly redundant today, but if you make the radiologist redundant because a machine can maybe possibly read the images much better, it may have repercussions of how you're going to start organizing the whole hospital because who's assuming now what role and maybe the role of the nurse is going to be upskilled because on the basis of the machine output,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1722.396,
    "end": 1750.133,
    "text": " uh there will be direction to the right doctor to to look really for treatment whatever is the reading from um from the images so i think we need to um see now that ai starts first of all in a very task specific way but moves up and all of a sudden has very systemic changes applying ai at the board level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1753.021,
    "end": 1753.724,
    "text": " I don't see this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1754.952,
    "end": 1755.612,
    "text": " at this moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.953,
    "end": 1763.117,
    "text": "You know, information processing will not be done at the board level with AI tools.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.758,
    "end": 1765.579,
    "text": "I doubt this at this point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1766.159,
    "end": 1774.905,
    "text": "When I look now specifically at free energy governance, well, free energy governance, if you look at free energy principle, for me, that is an artificial active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.605,
    "end": 1782.009,
    "text": "And the way Carl Fristen has been even applying it to neuroimaging is a machine learning algorithm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1782.089,
    "end": 1783.911,
    "text": "So for me, free energy governance",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1784.815,
    "end": 1788.538,
    "text": " is really a machine learning logic in its entirety.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1789.239,
    "end": 1798.467,
    "text": "Now, when you look at what is happening, chat GPT is not as smart as a lot of people think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.528,
    "end": 1801.25,
    "text": "At the end, it's just a language model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.851,
    "end": 1805.954,
    "text": "And it makes statistically very plausible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.983,
    "end": 1817.036,
    "text": " language it produces which it doesn't understand itself so it poses obviously great challenges so i think that has been a little bit misleading having said this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1818.109,
    "end": 1828.173,
    "text": " I think it's not misleading to the extent that chat GPT is an indication that generative intelligence, automated, augmented, is the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1828.793,
    "end": 1842.419,
    "text": "And this is going to come, and I think we will have a hard time as humans to catch up how fast it can evolve and the things it's doing because it's getting better every day because it's training on the back of massive training knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1842.499,
    "end": 1845.64,
    "text": "Now, what is happening...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1846.61,
    "end": 1849.192,
    "text": " And that is definitely a challenge for the board.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1849.832,
    "end": 1863.982,
    "text": "You could ask, how can the board continue fulfilling its most basic fiduciary duty of monitoring company and management if itself, the board, has no means of understanding what the algorithms do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.363,
    "end": 1866.944,
    "text": "Because algorithms can be potentially very damaging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.425,
    "end": 1875.631,
    "text": "So I do see that there will be a safety and ethical, a regulatory dimension, which will probably need to be addressed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1876.451,
    "end": 1890.952,
    "text": " at the board level when you look at it from an ai point of view now so that's a little bit to the question of artificial intelligence and free energy governance i specifically specifically have not considered any tools at the board level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1891.733,
    "end": 1919.973,
    "text": " now when you look at what is artificial intelligence really about it allows you to separate two components which make up a decision it's a predictive component and it's a judgment component i think the predictive component can be more and more done the prediction element by machines on the back of data but i do think that it revalues the judgment component of the human",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1920.982,
    "end": 1933.156,
    "text": " now it could be that it's no longer really the top let's say leaders which are best positioned to make the judgment component maybe people on the front lines",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1934.125,
    "end": 1960.415,
    "text": " now being empowered by artificially intelligence fueled prediction models and prediction tools can place a much better position to make the right judgment call so i think the impact of artificial intelligence on the company will be more distributed decision making to be really more in real time now coming back to the quote you originally were reading out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1961.516,
    "end": 1976.543,
    "text": " The most important element of that quote is what you see today is that most people in leadership positions will tell you the world has become uncertain and it's unpredictable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1977.364,
    "end": 1985.048,
    "text": "And my answer to this is always, first of all, uncertainty and unpredictability is a very subjective concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.628,
    "end": 1987.329,
    "text": "It's not an objective reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.469,
    "end": 1988.589,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1990.11,
    "end": 2000.672,
    "text": " Your perception of uncertainty or unpredictability is really a function of how good is your world model, how good is your prediction model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.972,
    "end": 2018.236,
    "text": "So if you're telling me the world is uncertain, you're effectively telling me your model is not good enough of modeling it and in a generative, actively, inferential way, going step by step forward to improve it and make the world less uncertain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2019.705,
    "end": 2042.233,
    "text": " the way i do believe also for the pandemic was a brilliant example if you if you had a world model which maybe bill gates said that pandemics are going to come they're going to be massive and they're going to be global there's no way you're going to contain in today's world something which started in china it's going to stay in wuhan but it's going to be global but if you think about it it started off",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2042.933,
    "end": 2053.362,
    "text": " in 2019, November, December, and people until January, February in the Western Hemisphere still thought this was a Chinese problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.438,
    "end": 2078.771,
    "text": " they weren't prepared at all now think about it some people were smart enough and they exploited the business opportunity by going up front into producing a massive amount of face masks so when all of a sudden the pandemic hit in march april they were the ones making fortunes because governments didn't have the right prediction model and they didn't have enough masks i know actually the guys",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.471,
    "end": 2088.46,
    "text": " who did take advantage of this in Switzerland, and I think they made $250 million or something like this, because they caught really the government naked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2088.52,
    "end": 2097.049,
    "text": "So you see the discrepancy, even governments where you suppose with all the resources they have at hand, all the information they have, they have bad prediction models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2097.63,
    "end": 2101.333,
    "text": "So your prediction model determines",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.665,
    "end": 2106.066,
    "text": " how uncertain and how unpredictable the world is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.167,
    "end": 2116.15,
    "text": "And a big problem you have today in companies is that companies do not embrace uncertainty, but they bury uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2116.17,
    "end": 2123.033,
    "text": "A book which puts this brilliantly into perspective is from Agarwal and Avi Faab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.913,
    "end": 2125.373,
    "text": "It's called Power and Prediction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.094,
    "end": 2129.135,
    "text": "And it shows very clearly how companies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.932,
    "end": 2142.923,
    "text": " have developed, as Aguirre said back in the 60s, it's skilled incompetence, where you act in a way which is really contrary to your intentions or what you really want to achieve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2143.503,
    "end": 2149.569,
    "text": "And what has happened is that companies have created rules, best practices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.25,
    "end": 2158.296,
    "text": "You could even argue that putting the CEO in a super dominant position, controlling everything,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.52,
    "end": 2180.905,
    "text": " is a form of bearing uncertainty because you look now to one person and you say that person is going to give me all the answers of the world instead what we need to do is we need to make our models available to testing in the marketplace in a generative inferential way by acting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2181.673,
    "end": 2188.077,
    "text": " and generating new data points that make our model in a generative fashion better and better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.397,
    "end": 2196.902,
    "text": "And as a result of it, our predictions models get better, the predictions they produce get better, and the world will be perceived as less uncertain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.462,
    "end": 2201.625,
    "text": "And that's really the essence of the quote you started off with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2202.717,
    "end": 2226.665,
    "text": " we have two elements here one is really the the uncertainty um element i i think we need to really highlight is a subjective concept and it's a question of world modeling of prediction modeling and prediction testing the second dimension you addressed is the one of artificial intelligence i do think artificial intelligence or augmented intelligence you could argue is it really that artificial",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2227.345,
    "end": 2254.988,
    "text": " um is is is just at the very beginning it's going to be exponential it's going to be faster evolving and spreading than anybody can expect and i do believe that in around within 10 years 70 to 80 percent of knowledge workers will disappear and only those people will survive working in any organization that can understand manage and complement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.959,
    "end": 2257.14,
    "text": " artificial intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2262.342,
    "end": 2276.288,
    "text": "And by the way, there's so many examples, you can see how artificial intelligence allowed in an incredible way to get rid of, I mean, millions of jobs, you know, already.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2277.901,
    "end": 2286.166,
    "text": " And even if you think about a radiologist has a very intense training in medical education.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.987,
    "end": 2290.389,
    "text": "And in the book, Power Prediction is a really good example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.409,
    "end": 2291.97,
    "text": "I think it is in that book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2292.01,
    "end": 2295.052,
    "text": "There is another great book I recommend on the topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2295.132,
    "end": 2296.172,
    "text": "It's all in on AI.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2297.233,
    "end": 2319.41,
    "text": " by devonport and metal which gives you a really good overview good structure a few good case studies and you can see that the the the the job of a radiologist can be divided into i think roughly 35 or 38 tasks and when you look at each of the tasks a machine can do this today so that job is gone",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.943,
    "end": 2327.545,
    "text": " Yeah, it's interesting, the level of synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.145,
    "end": 2338.232,
    "text": "So for me, the essence of that quote was cognitive offloading into systems that can synthesize and integrate information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.583,
    "end": 2344.405,
    "text": " How much of that task is what is done by AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.545,
    "end": 2359.955,
    "text": "And I do agree with you that we will need to be able to work with the AI, like to understand that synthesis and integration of information that's provided by augmented intelligence systems in order to be functional in the workplace going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.975,
    "end": 2361.416,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.616,
    "end": 2364.858,
    "text": "Well, you see the big weaknesses where people don't understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.878,
    "end": 2368.42,
    "text": "By the way, that quote, when I recall, it's...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.051,
    "end": 2370.751,
    "text": " It's Howie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.791,
    "end": 2371.791,
    "text": "You guys know Howie?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2372.251,
    "end": 2374.072,
    "text": "He wrote a brilliant book, The Predictive Brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2374.712,
    "end": 2378.173,
    "text": "And Howie is probably more a structural Bayesian guy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.773,
    "end": 2393.876,
    "text": "But he's really brilliant in the way he shows that actually what the Bayesian brain is about is really you...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.454,
    "end": 2399.737,
    "text": " You use the world as a feedback loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.758,
    "end": 2403.841,
    "text": "So you can come up with any predictions you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.082,
    "end": 2407.745,
    "text": "Let the world, you know, give you all the feedback you need.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2407.865,
    "end": 2416.754,
    "text": "And that's a very powerful way of how you start in a generative way reducing uncertainties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.499,
    "end": 2421.959,
    "text": " Definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.979,
    "end": 2427.883,
    "text": "So I don't know, I guess we should maybe go on to our last set of questions on duality management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.484,
    "end": 2435.287,
    "text": "So here, Bijan, is it only critical for the board to understand duality management?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.507,
    "end": 2446.334,
    "text": "Or do you think at every level of the hierarchy from the frontline workers up to top tier management and the board, does everyone need to understand duality management and practice this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.654,
    "end": 2448.515,
    "text": "Or is it only necessarily at the top?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.475,
    "end": 2456.977,
    "text": " Well, I don't think you would explain to anyone in the front line that you have to engage in duality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2457.597,
    "end": 2463.359,
    "text": "But because to a certain degree, it's an abstract concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.439,
    "end": 2478.304,
    "text": "And I developed duality management really at the very, very top level, almost dynamic capabilities, the concept of dynamic capabilities in strategy management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2479.935,
    "end": 2485.318,
    "text": " is defined a dynamic capability as a non-operational capability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.959,
    "end": 2490.862,
    "text": "So you say it's a, some call it also a meta capability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.922,
    "end": 2494.864,
    "text": "So it's not a task specific capability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2495.345,
    "end": 2501.749,
    "text": "So you would almost say when we talk about duality management, you move very quickly into the default mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2502.489,
    "end": 2516.537,
    "text": " side of the brain and what it really is about i i used it in the context and i think i i said it in our last discussion you can really reduce",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2517.791,
    "end": 2534.887,
    "text": " everything about a company about two dimensions one is exploiting today's cash flow and making the money that's really the business you have and developing the future cash flow stream which is the exploration so you have exploitation exploration and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2536.451,
    "end": 2556.33,
    "text": " have been so many theories about and case studies about can you do both at the same time how does it work and sometimes people said oh you do exploitation here but you create a whole different new thing over there and you don't mix them and sometimes they don't mix that easily i don't think companies have that luxury any longer and i think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.131,
    "end": 2576.018,
    "text": " exploitation focusing on today's cash flow and doing something new is it really that radical is it more incremental is happening kind of in real time but it requires very strong leadership because when you think about exploiting today's cash flow is a very hardcore operational",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.818,
    "end": 2577.318,
    "text": " activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.858,
    "end": 2583.82,
    "text": "So CEOs usually immerse very, very strongly in the exploitative activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2584.4,
    "end": 2605.326,
    "text": "When they're really good, they can also do exploration and they need to make sure how they switch between the default mode, which is probably more for exploration, thinking creatively about innovation projects, and at the same time managing and optimizing an existing cash generating business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.641,
    "end": 2619.806,
    "text": " My idea was behind duality management to say the board is actually uniquely positioned because it's not involved in any operational activities really of the company.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2620.167,
    "end": 2622.708,
    "text": "The board is not involved in running today's business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2623.528,
    "end": 2625.509,
    "text": "It can have a great super view",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.562,
    "end": 2642.456,
    "text": " of saying where should actually maybe the CEO be guided towards of maybe emphasizing right now more exploitation or exploration where people see as a board when they analyze the business they can see the problems that concerns one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2643.337,
    "end": 2672.657,
    "text": " complex second complex i have is financial and strategic control and they really stand for in-house innovation and innovation you buy through by buying other companies or certain things and i the view of the free or the way free energy governance um and this is how the whole section two is structured you have the structural component which is really how you connect the top of the button",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2673.397,
    "end": 2691.362,
    "text": " the cognition component is really related to how you have a an ability to enact your world create a model and i always like the googles the facebooks all these companies have created massive businesses but they really created this um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2692.182,
    "end": 2718.627,
    "text": " in a in a in an active way they did not copy someone they did not do a market research or that but they had a vision of their own which i think is essential and the third dimension are the capabilities and the capabilities i developed this duality management as a dynamic capability and dynamic capability is really a specific meta capability in strategy management",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2719.227,
    "end": 2724.254,
    "text": " So I think when you look at these two complexes, how much do I focus on the business I have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.714,
    "end": 2727.498,
    "text": "How much do I focus on the business I would like to have tomorrow?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.179,
    "end": 2730.041,
    "text": "And how much of it is done in-house?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2730.101,
    "end": 2732.564,
    "text": "And how much of this is done possibly by buying it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.655,
    "end": 2757.134,
    "text": " are forces which sometimes are going against or going in line and i think the board in its meta position supervisory position being above the executive leadership as a unique position to practice this so that indirectly answers your question i think duality management",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.674,
    "end": 2767.909,
    "text": " the more you go down in the hierarchy of a business, which means the closer you go to the front lines where hard tasks are being performed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2768.737,
    "end": 2770.498,
    "text": " the less you have a duality management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.518,
    "end": 2776.803,
    "text": "You shouldn't have a duality management at all because people are really focused on very specific tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.403,
    "end": 2787.95,
    "text": "And the further you move up and the more you have to decide, are you going to do one of this or more of this, you may find the duality management challenge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.43,
    "end": 2797.417,
    "text": "So it may not be just on the board, but it's certainly on the board when it comes to exploitation, exploration, and financial and strategic control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.197,
    "end": 2799.537,
    "text": " Now, that's a long answer I gave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2799.637,
    "end": 2800.578,
    "text": "I hope you could follow me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.058,
    "end": 2803.478,
    "text": "That's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.579,
    "end": 2804.299,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2804.739,
    "end": 2814.922,
    "text": "I try to make it simple because obviously when you look at the very origins of this book, it was originally a dissertation which started off really in strategy management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2816.342,
    "end": 2822.444,
    "text": "And I'm so happy that I found it all the way to the more neuroscientific dimension.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2822.484,
    "end": 2826.765,
    "text": "And we're talking in the context of the Active Inference Institute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2828.126,
    "end": 2835.392,
    "text": " But obviously, when you talk specifically about the duality management side, we are really pretty much in business school.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.795,
    "end": 2849.383,
    "text": "So going from maybe a more thoughtful to the more practical, can you give an example of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.206,
    "end": 2856.808,
    "text": " how you can reduce organizational friction through this top-down bottom-up hierarchical coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.108,
    "end": 2880.197,
    "text": "Like it gets very fuzzy for me as, I mean, even as we're talking about like what levels need to understand duality management, like the, I mean, I get that the communication between the levels is key to like organizational maintenance or like the persistence of a firm, but like translating that into some kind of practical terms that I can apply at my firm,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.717,
    "end": 2883.218,
    "text": " for instance, is maybe a little bit more difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.258,
    "end": 2889.761,
    "text": "So do you have any advice for us that are down here in the nitty gritty of it all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.162,
    "end": 2904.567,
    "text": "So I do think what tools you apply that are practically of relevance is maybe a function also of the size of the organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2905.547,
    "end": 2908.508,
    "text": "So let's start with a really big organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2908.568,
    "end": 2910.029,
    "text": "Take a big insurance company.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2910.985,
    "end": 2935.678,
    "text": " and you have the board of an insurance company which will be very respectable people who have probably jobs as ceos on many different other companies they come together four or five times a year they take major decisions um how can such a board better understand independently of ceo framing as a filter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.69,
    "end": 2937.991,
    "text": " what overall is going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.111,
    "end": 2951.765,
    "text": "How can the board make the CEO stronger to ensure that the CEO actually is properly connected with what's really going on in the front lines?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2952.526,
    "end": 2959.753,
    "text": "And one concept I like a lot, I think I've talked about it before, but I think the concept",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.854,
    "end": 2976.988,
    "text": " is a good concept to bring as an example again because it highlights and then you can think creatively of what other things you can think of but they are shadow boards so having a group of young high potential people who are quite far removed from the very top",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2977.762,
    "end": 2989.188,
    "text": " that they form a board themselves and have board meetings with very similar agenda items and can discuss what should be maybe the future agenda items.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.869,
    "end": 2996.513,
    "text": "And that can serve as a tremendous source of inspiration from the front lines to the main board, which is sitting on the very top,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2997.513,
    "end": 3006.038,
    "text": " And that is a wonderful way I see as connecting the top and the bottom and leading the information flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.398,
    "end": 3015.823,
    "text": "Companies which have done this is like Total Energy, one of the biggest energy companies in the fashion business, Prada, Gucci.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3017.104,
    "end": 3023.168,
    "text": "And when you think about it, Prada and Gucci are obviously companies which are living off young talent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3023.948,
    "end": 3045.421,
    "text": " people young designers something edgy something new because think about it in fashion you've got to come up every season with something which is setting a trend so you're really dependent on being connected to the front line and from creative people picking up what is the next so i like the fashion houses",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.061,
    "end": 3051.084,
    "text": " because they show how important it is to be connected to the very front lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.664,
    "end": 3066.993,
    "text": "A big insurance company may not see it, but a big insurance company may be missing what could be the next big thing maybe young people will be asking for as a business model for as an interesting insurance market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.674,
    "end": 3071.276,
    "text": "And so I think that is a really good",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3072.793,
    "end": 3093.299,
    "text": " tool now let's go into small organizations let's take the active inference institute as an example and you're saying look we have this wonderful scientific advisory board you have a wonderful board who is advising you uh and and and and and guiding you um how to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.199,
    "end": 3111.598,
    "text": " make how to increase I mean you have I think you have one purpose to increase the impact of the active inference Institute in the marketplace and you're looking at various tools you're looking at very various engagement platforms our dialogue is one of them you're reaching out through channels",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.239,
    "end": 3141.207,
    "text": " to at every juncture optimize that and i'm trying to support this as well because i really truly believe in in the mission of the active inference institute and i do believe that it is the very beginning of a great movement because i see that as the future i'm absolutely convinced of that so in that regard you're definitely pioneers our community is still very small now here's the question of how you connect the top",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.233,
    "end": 3145.654,
    "text": " which is you guys now, was the front line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.814,
    "end": 3156.156,
    "text": "And the front line may have really interesting weak signals which could give you some really inspirational input where you say we should take it on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.276,
    "end": 3157.337,
    "text": "And I think you're doing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.777,
    "end": 3159.237,
    "text": "You're doing it with a newsletter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3159.637,
    "end": 3160.537,
    "text": "You're reaching out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3161.098,
    "end": 3163.718,
    "text": "You obviously want to make sure people read it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3163.938,
    "end": 3164.938,
    "text": "They engage with this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.599,
    "end": 3167.819,
    "text": "And you have internship programs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.879,
    "end": 3170.66,
    "text": "You have a number of ways of how to bring in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.316,
    "end": 3180.786,
    "text": " really the marketplace to challenge you, to improve you, was one and only one mission and purpose in mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3181.386,
    "end": 3187.794,
    "text": "To make sure that the products, the output from the Active Inference Institute has impact",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3188.692,
    "end": 3197.94,
    "text": " represents the aspirations you have for high quality intelligence that more and more people should connect to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.58,
    "end": 3207.508,
    "text": "And I think you're doing quite a great job with the limited resources you have by doing all these tools, creating these dialogues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3208.028,
    "end": 3215.775,
    "text": "You are acting actually to generate great data points, including our conversations,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3217.182,
    "end": 3238.618,
    "text": " the way you then package the output to reach out and collect input from people we may not know at this point who may connect to the content and i think this is a form of structure in a very distributed environment when you look at how the active interference institute is working of connecting actually the top which is you guys",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.79,
    "end": 3244.272,
    "text": " the frontlines are possibly people like myself giving feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3244.992,
    "end": 3251.655,
    "text": "So frontline is not always, you know, it doesn't imply is somebody, that's why I don't like the word bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.135,
    "end": 3261.039,
    "text": "Sometimes your most intelligent people in the network may be your frontliners giving you the right feedbacks and data points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.359,
    "end": 3267.141,
    "text": "I hope that answers the question and puts it a little bit more tangibly into your perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3269.944,
    "end": 3286.586,
    "text": " most definitely and i think uh thank you for all the nice things you have to say about the active inference institute that's always a it's always nice to get a compliment um and i think that um that's it for today unless there's any more like burning thoughts or questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.558,
    "end": 3290.958,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.998,
    "end": 3291.479,
    "text": "Well, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.199,
    "end": 3294.301,
    "text": "I always enjoy these conversations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3294.901,
    "end": 3295.301,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.362,
    "end": 3298.124,
    "text": "And hopefully we can have you back as we wrap up the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.144,
    "end": 3304.528,
    "text": "We're going to come around the bend and maybe we'll see you back in a few weeks if you have time to come discuss the end of the book with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.588,
    "end": 3305.089,
    "text": "That'd be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.209,
    "end": 3306.79,
    "text": "I will always be happy for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.89,
    "end": 3311.073,
    "text": "It becomes a little bit more, I think towards the end, it becomes a little bit more philosophical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3311.453,
    "end": 3313.915,
    "text": "So this was a hard part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.935,
    "end": 3317.198,
    "text": "I think the next chapter goes a little bit more into the corporate governance side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.223,
    "end": 3321.707,
    "text": " I think we've covered quite a bit of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.767,
    "end": 3325.151,
    "text": "So when you I think the next one is three conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3326.974,
    "end": 3327.154,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3331.471,
    "end": 3344.337,
    "text": " I think chapter 13, which is Outperformance and Survival as a Matter of Self-Organization, is quite philosophical, I think, as a topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3345.217,
    "end": 3348.539,
    "text": "And I look forward to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3349.939,
    "end": 3353.441,
    "text": "And thank you so much for also taking interest in my work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3353.941,
    "end": 3355.562,
    "text": "It means a lot to an author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3358.223,
    "end": 3358.623,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.023,
    "end": 3359.964,
    "text": "We will see you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.744,
    "end": 3361.892,
    "text": " Okay, all the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.758,
    "end": 3363.02,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  }
]