[
  {
    "start": 4.104,
    "end": 4.724,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.445,
    "end": 7.566,
    "text": "Welcome to the Active Inference live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.866,
    "end": 12.269,
    "text": "It is Active Inference live stream 11.2 on December 29th, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.369,
    "end": 16.532,
    "text": "This is our last group Active Inference live stream of the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.012,
    "end": 22.996,
    "text": "So thanks so much everyone who is out here today and also watching live for those who are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.696,
    "end": 25.437,
    "text": "And I will share my screen for the participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.938,
    "end": 26.418,
    "text": "And here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.431,
    "end": 50.573,
    "text": " welcome to the active inference lab everyone we are an experiment in online team communication learning and practice related to active inference you can find us at our website on twitter email youtube or our public keybase team and username this is a recorded and an archived live stream so please provide us with feedback so that we can improve on our work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.539,
    "end": 53.761,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.581,
    "end": 64.208,
    "text": "And as far as video etiquette for live streams, mute if there's noise in your background, raise your hands so that we can hear from everybody on the queue, and we'll use respectful speech behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.231,
    "end": 72.78,
    "text": " As I stated, this is the last Active Inference live stream for 2020, but in 2021, it's already shaping up to be a great year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.26,
    "end": 75.703,
    "text": "We're going to be meeting Tuesdays from 7 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.003,
    "end": 79.647,
    "text": "Pacific time, PST, or Pacific time when the time changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.008,
    "end": 81.409,
    "text": "And you can go to this link to learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.63,
    "end": 84.213,
    "text": "When you go to that link, you'll see this spreadsheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.713,
    "end": 89.84,
    "text": " and it has instructions on how you can participate, as well as which papers we'll be reading in which weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.361,
    "end": 97.371,
    "text": "So you can see that many authors will be joining us, and hopefully everybody will have the time to read and digest these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.056,
    "end": 107.482,
    "text": " Today in Active Inference Stream 11.2, we are going to have introductions and warmups, and then we'll go into the 11.2 itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.902,
    "end": 113.626,
    "text": "We're gonna be continuing the discussion of Sophisticated Affective Inference, the paper of HESP et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.286,
    "end": 113.626,
    "text": "2020."
  },
  {
    "start": 114.567,
    "end": 115.167,
    "text": "Welcome, Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.867,
    "end": 119.81,
    "text": "We'll run through, again, the aims, claims, abstract, and roadmap, and the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.631,
    "end": 121.952,
    "text": "And happy New Year's, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.212,
    "end": 122.952,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.413,
    "end": 125.754,
    "text": "We'll do new stuff in 2021, and so stick along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.416,
    "end": 130.159,
    "text": " Let's get to the intros and warm-ups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.339,
    "end": 137.068,
    "text": "We will introduce ourself just by giving a short introduction or check-in and then passing to somebody who hasn't spoken yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.509,
    "end": 138.27,
    "text": "So I'll start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.75,
    "end": 144.078,
    "text": "I'm Daniel and I will pass it first to a first-time visitor, Scott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.694,
    "end": 148.835,
    "text": " Hi, I'm Scott David.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 149.016,
    "end": 153.902,
    "text": "I'm at the University of Washington Applied Physics Lab and I've been a lawyer for 27 years.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 154.122,
    "end": 161.051,
    "text": "I'm trying to use physics principles to help structure social relationships and I will pass it to Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 164.226,
    "end": 166.707,
    "text": " Hello, I'm Stephen, I'm based in Toronto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.487,
    "end": 183.653,
    "text": "I'm currently doing a practice-based PhD with Canterbury Christ Church University and I'm looking at applying the dynamic processes of active inference into my work with participatory theatre and community development and helping to understand the dynamics of all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.674,
    "end": 186.274,
    "text": "And I will pass it to Ivan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.807,
    "end": 191.388,
    "text": " Hello, my name is Ivan.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 191.608,
    "end": 195.832,
    "text": "I am in Moscow, and I am a researcher in a system management school.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 197.253,
    "end": 199.135,
    "text": "I'll pass it to Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 201.937,
    "end": 203.398,
    "text": "Hello, I'm Blue Knight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 203.778,
    "end": 210.884,
    "text": "I am an independent research consultant based out of New Mexico, and I will pass it to Sasha.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.697,
    "end": 215.298,
    "text": " Hi, I'm Sasha.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.398,
    "end": 221.062,
    "text": "I'm based out of Davis, California, and I study developmental neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.883,
    "end": 224.965,
    "text": "And I will pass it to Alex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.607,
    "end": 229.688,
    "text": "Hello, my name is Alex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 230.048,
    "end": 231.429,
    "text": "I'm in Moscow, Russia.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 231.829,
    "end": 240.575,
    "text": "I'm also a researcher in systems management school, and I'm trying to find the ways to connect active inference and systems engineering framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 241.236,
    "end": 241.376,
    "text": "Thanks."
  },
  {
    "start": 243.032,
    "end": 243.312,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.993,
    "end": 253.58,
    "text": "And Ryan, it seems like has the same situation as last week, but definitely for 2021, we'll figure it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.5,
    "end": 256.422,
    "text": "I'll just tell them it still does not work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.862,
    "end": 259.163,
    "text": "All right, let's go to the warmup questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.244,
    "end": 261.245,
    "text": "And again, if anyone else joins, we'll just roll with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.765,
    "end": 263.286,
    "text": "So for these warmup questions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.301,
    "end": 266.584,
    "text": " Raise your hand, it'd be great to hear from everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.744,
    "end": 273.451,
    "text": "Let's just start off with what are some kinds of agents that we might want to model in active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.952,
    "end": 284.604,
    "text": "So just even before reading this paper or after reading the paper, what was the kind of system or type of agent that we might want to frame in this way of thinking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.731,
    "end": 291.414,
    "text": " So emotions makes us think about individual people, but there's other kinds of systems we might want to model as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.334,
    "end": 297.276,
    "text": "Actually, Scott, you were mentioning some interesting types of agents we might be considering right before we started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.316,
    "end": 298.677,
    "text": "So maybe could you pick up there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.177,
    "end": 300.398,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.478,
    "end": 312.403,
    "text": "I was mentioning in law, it feels like one of the things, one of the strategies is to introduce a provisional agent, a nominal party,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 313.368,
    "end": 336.024,
    "text": " into an interaction so if you have two people interacting you can introduce a third by introducing the third it changes the system because now a three-party system with three-party concerns and that system then will have a different markov blanket as i am beginning to understand it and so in that context you may be able to do things you can't do in the other through the other markov blanket",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 336.772,
    "end": 346.359,
    "text": " because it may be able to, an example is in tax, there's a thing called the like kind exchange where I can exchange commercial property for another commercial property tax free.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 346.979,
    "end": 350.622,
    "text": "Well, very often you can't find someone with exactly the property you're looking for.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 350.682,
    "end": 353.143,
    "text": "Let's say you have a 20 acre farm, you want a 30 acre farm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 353.403,
    "end": 354.945,
    "text": "There's nobody around with a 30 acre farm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 355.445,
    "end": 359.007,
    "text": "You use an exchange facilitator and that means there's a third party in there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 359.047,
    "end": 362.109,
    "text": "They take possession of both properties and act like a mixing bowl.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 363.07,
    "end": 367.073,
    "text": " And so putting the details of that aside, it essentially changes that system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 367.113,
    "end": 368.514,
    "text": "So it changes your Markov blankets.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 368.855,
    "end": 374.339,
    "text": "And so one of the things I'm wondering about is the intentional shifting of the Markov blankets to increase solution space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 376.377,
    "end": 376.677,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.017,
    "end": 393.063,
    "text": "So we have all kinds of agents who are going to be interacting and potentially by shifting the boundaries, the interfaces between agents and wrapping them or sub partitioning them, it's possible to make new kinds of swaps within existing infrastructures or new ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.663,
    "end": 395.204,
    "text": "So anyone can just raise their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.224,
    "end": 404.568,
    "text": "I'll just put up the second question, which is another general one, which is how can we learn and communicate the technical aspects of active inference in an accessible fashion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.888,
    "end": 405.568,
    "text": "Stephen, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.193,
    "end": 427.506,
    "text": " I don't know if I'm gonna explain how to do this, but I'll explain the challenge which I think is important to overcome it because it's so valuable is I was just in a conversation and trying to talk about systems and how we think about systems when we engage in communities and thinking about how we understand the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.526,
    "end": 434.251,
    "text": "And there's a lot of stuff in the world of kind of the social arts and participatory theater where it's like, we need to do something with the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.711,
    "end": 438.055,
    "text": " And then it flips to we're all a living system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.135,
    "end": 441.638,
    "text": "It's the body knows and we just know how it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.658,
    "end": 443.86,
    "text": "We just need to listen to the body and it will know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.661,
    "end": 447.284,
    "text": "And it's both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.444,
    "end": 451.328,
    "text": "You know, we're in this dynamic niche of which there's an awful lot of stuff we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.269,
    "end": 453.931,
    "text": "Yet we can tap into our experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.592,
    "end": 460.655,
    "text": " and the way that our body works, and there's a way that we construct meaning in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.075,
    "end": 471.361,
    "text": "So I suppose trying to find a way to take case studies and show how it can help will be really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.942,
    "end": 474.263,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.283,
    "end": 474.563,
    "text": "Sasha?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.614,
    "end": 479.497,
    "text": " Yeah, thanks, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.517,
    "end": 482.662,
    "text": "I really agree with what you said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.682,
    "end": 492.738,
    "text": "And ironically, or I guess in a very meta way, active inference is the answer to that question, because through closing the loop,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.371,
    "end": 499.733,
    "text": " and introducing action into the system, we can better understand thinking about the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 500.113,
    "end": 513.197,
    "text": "And so I think that's a really great point that case studies and really specific applications of active inference are going to be the best way to teach and learn about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 513.217,
    "end": 515.878,
    "text": "So yeah, I think that's a great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.059,
    "end": 517.339,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.059,
    "end": 518.219,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.952,
    "end": 540.554,
    "text": " So just to kind of piggyback on that, I think, and maybe tie in some of what Scott was saying earlier, when we think about modeling in active inference, it's interesting to think about scaling this, not in the way that we talked about when we were talking about scaling active inference, but in the way that like we have several different systems, even just existing within the body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.215,
    "end": 550.348,
    "text": " like the input and output of the stomach and the spleen and the liver and also like the brain and the somatic awareness, to speak to kind of what Steven was saying earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 550.448,
    "end": 556.597,
    "text": "So it's interesting to try to think about modeling systems within systems in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 558.154,
    "end": 558.314,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.794,
    "end": 567.681,
    "text": "And actually this brain and body dialogue and the multi-systems approach in the way that it doesn't say, well, everyone told you the brain was important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.801,
    "end": 568.541,
    "text": "Actually, it's the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.822,
    "end": 570.363,
    "text": "No, it's actually, it's both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.843,
    "end": 573.685,
    "text": "And similarly, it's like quantitative and qualitative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.166,
    "end": 581.631,
    "text": "And so it's not just that we're going to throw out one for the other, but we want to think across that division and integrate them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.671,
    "end": 584.053,
    "text": "That's the beyond internalism and externalism and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.753,
    "end": 611.073,
    "text": " integrating the sciences with the humanities and other things that we're kind of talking about scott i just put in the chat there was an article that came out december 4th in science magazine called the exploitative segregation of plant roots and so this is helps with that second question uh learn communicating it what it was talking about is the way that plant roots grow specifically you have two trees next to each other each is a system each has a markov blanket",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 611.633,
    "end": 619.983,
    "text": " They're growing next to each other and they differentiate their plant growth roots to optimize statistically their nutrient uptake.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 620.563,
    "end": 630.494,
    "text": "And so they don't go and intrude on other plants roots space because that would not be optimized for them because they'd be putting more resources into growing further roots.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 631.635,
    "end": 634.997,
    "text": " And but getting fewer nutrients because they'd be nearer the other plant.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 635.478,
    "end": 645.244,
    "text": "And so to me, I looked at that and I went, wow, that's a real nice way to understand the dynamics of two different organisms interacting with statistical gradients there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 645.284,
    "end": 654.67,
    "text": "It's a nutritional gradient specifically that felt to me like it was a nice way to kind of introduce that idea of the of the contact between the two different systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 655.612,
    "end": 684.355,
    "text": " Cool, so what I'm gonna take from this second question and all the answers to it is that through examples that are accessible and at hand, we can all start to learn more about the relational side of active inference and also the statistical and the quantitative because both those sides are gonna be learning journeys for everybody because no one's gonna know all the statistics, no one's gonna know all the deep relational pieces that are so familiar to performance artists and other areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.387,
    "end": 691.662,
    "text": " The last question on the warmup is, what is something that you are wondering about or would like to have resolved by today's discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.018,
    "end": 703.523,
    "text": " So one thing I'm wondering about is, was raised right before we started as well is like, how do we think about emotion or this parameter in systems that aren't us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.324,
    "end": 720.091,
    "text": "And I'm also even wondering whether the emotions we experience are these parameters and how do we name parameters or talk about parameters of mathematical models in a way such that they're recognizable and capture meaning, but also don't constrain or sort of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.812,
    "end": 724.554,
    "text": " falsely limit what it means to be that term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.934,
    "end": 731.84,
    "text": "So we can get into a map territory issue when we're talking about computational models of emotion just like we could with consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.08,
    "end": 732.24,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.129,
    "end": 747.277,
    "text": " So just to kind of piggyback on what you were saying about emotions, like, I don't know, as I'm starting to study more about emotion, like I'm a logic and science kind of researcher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 747.457,
    "end": 753.262,
    "text": "And so, but learning about emotion, just reading personally, a lot of it seems to be like nonverbal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 753.982,
    "end": 754.162,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 754.202,
    "end": 769.896,
    "text": "And so how do you like quantify or even measure emotion on a scale when it's really like, you know, you're feeling some primitive thing from, you know, when you were left in your crib as a child that you have no words for because you didn't have words for it at that time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 770.237,
    "end": 777.984,
    "text": "And so how do you kind of like like impart some kind of meaning or quantitative scale on something that maybe there's not even language for?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 778.792,
    "end": 784.778,
    "text": " Yes, it's almost like the discredited but guiding three-part brain model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.318,
    "end": 789.242,
    "text": "So it's like the most prefrontal is the numbers and that level of formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.462,
    "end": 791.184,
    "text": "And then a little bit lower, we have language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.224,
    "end": 793.886,
    "text": "But then below that, the substrate is actually experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.026,
    "end": 798.371,
    "text": "And that's the embodied experience that may or may not even have words to express it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.911,
    "end": 801.632,
    "text": " And then we can look at expressions like poetry or speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.332,
    "end": 808.414,
    "text": "And is there a way to get more precise or is it merely an expression that's arising from an emotional state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.714,
    "end": 810.095,
    "text": "But the emotional state isn't a number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.195,
    "end": 811.055,
    "text": "It's not a words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.175,
    "end": 812.976,
    "text": "It's actually something that's more deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.356,
    "end": 813.636,
    "text": "Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.357,
    "end": 819.078,
    "text": "I was wondering if with regard to dance and performance,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 819.707,
    "end": 824.671,
    "text": " whether there are ways of communicating, because we talk about embodied, I wonder about encoding.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 825.392,
    "end": 842.827,
    "text": "So can emotions be encoded in dance in a way that they can't be encoded in speech or other movement so that it becomes a surrogate or kind of that mirror neuron idea that you're projecting out an emotion by the projection of your body position, the morphology being the encoding of the emotion.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 843.988,
    "end": 844.548,
    "text": "Cool question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.608,
    "end": 845.449,
    "text": "Yeah, Steven, definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.526,
    "end": 853.713,
    "text": " Yeah, I think this also relates to this question of affect and dimensionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.093,
    "end": 866.667,
    "text": "So maybe there's a way that when we take a perspective on things, we kind of look at a dimensional approach, but it can be encoded in some sort of spatial...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.068,
    "end": 897.168,
    "text": " um affective way and maybe those dimensions aren't they they become like dimensions but the encoding is is not as linear as that a bit like color space when we see colors the the space of colors you can encode it in sort of in in lightness and two different types of color dimensions but the way that it's encoded is it when people look at perception it's not it's not linear in that space so maybe there's like an affect space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.968,
    "end": 903.511,
    "text": " which somehow encodes in a way which is non-dimensional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.692,
    "end": 917.778,
    "text": "So might aesthetics be provisional efforts at encoding?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 919.577,
    "end": 925.625,
    "text": " Very nice to bring in the aesthetics and the intuition because intuition is that which can't be expressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.685,
    "end": 927.507,
    "text": "It's sort of like the dark matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.607,
    "end": 937.039,
    "text": "It's the submerged part of the iceberg, but those reflect the deepest priors potentially that help us search through the state space that as we've been exploring,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.519,
    "end": 938.219,
    "text": " is vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.559,
    "end": 942.521,
    "text": "To do the exponential rollout of a chess game is going to be hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.021,
    "end": 947.242,
    "text": "It's going to be more basically states than you can keep track of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.682,
    "end": 957.345,
    "text": "However, if you think, I feel good about this arrangement of the pieces, then with just a simple affect and a limited rollout, you may be able to do very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.746,
    "end": 961.527,
    "text": "So again, Ryan, we're not sure, but we'll figure this one out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.347,
    "end": 977.491,
    "text": " okay uh let's is that just one other thing is that like the holographic principle potentially that on a system the information about the system is displayed on its surface is a markov blanket potentially that surface that you've observed to understand the system inside",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 979.162,
    "end": 980.162,
    "text": " I believe so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.703,
    "end": 988.165,
    "text": "And Chris Fields, who will be coming onto the stream, will be talking about a paper that's going to be in early March.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.966,
    "end": 993.587,
    "text": "Chris has done a lot of holographic Markov blanket research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.747,
    "end": 997.348,
    "text": "So let's keep on thinking about that because that's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.929,
    "end": 1001.97,
    "text": "I'm not exactly sure, but yeah, hopefully we'll figure that one out within a few months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.71,
    "end": 1006.412,
    "text": "So the paper itself, and then again, we'll have enough time just to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.412,
    "end": 1029.82,
    "text": " hear whatever people are thinking, but sophisticated affective inference, we talked about it in 11.0 and 11.1, and the paper is about combining these two previous threads of research, which were sophisticated active inference, which is sophisticated meaning deep through time, with affective inference or active inference where there's an emotional state component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.135,
    "end": 1036.879,
    "text": " The abstract, they state that, and the roadmap of this relatively short paper is pretty short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.82,
    "end": 1053.171,
    "text": "So today, let's think about how these two threads, which are distinct threads, that's why they each were their own paper, can be combined into something that is in front of us today, which is this paper that is literally summating these two threads of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.751,
    "end": 1059.796,
    "text": "And then we can think about a few directions that this research makes us think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.316,
    "end": 1079.904,
    "text": " whether developing more advanced simulations, so just asking which parameters of the simulation could be improved or how could this be expanded or generalized, but also on the more functional side, we can look to computational psychiatry, because we're talking about emotions, if we are, and also even non-human agents like robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.184,
    "end": 1084.726,
    "text": "So a few different directions we can go, and to structure that discussion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.263,
    "end": 1095.714,
    "text": " it could be useful for us to have a few examples like two or three or four of sophisticated affective inference agents, conventional or unconventional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.015,
    "end": 1100.3,
    "text": "So certainly one of them could be a person, but we'll think of that person being in a certain context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.841,
    "end": 1103.904,
    "text": "And then we'll return to these examples that we come up with right now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.685,
    "end": 1114.431,
    "text": " As we go through the slides ahead, we'll just return it to example A, B, C. And then when we're talking about parameters, we'll be able to say, OK, so in the example A, this matrix would represent this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.692,
    "end": 1116.393,
    "text": "In the example B, it would represent that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.893,
    "end": 1123.978,
    "text": "So who has a thought or a suggestion on what would be a cool system to bring into this mixture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.538,
    "end": 1126.439,
    "text": "So again, one of the examples will be a person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.12,
    "end": 1132.904,
    "text": "And people can suggest what they think that person's story or situation should be, kind of like an improv scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.624,
    "end": 1140.207,
    "text": " And then also if people want to provide an unconventional system, that'd be good too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.128,
    "end": 1145.13,
    "text": "So any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.991,
    "end": 1148.251,
    "text": "Alex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.393,
    "end": 1160.517,
    "text": "I think maybe we can consider the next system scale and see on team behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1160.878,
    "end": 1161.098,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1162.873,
    "end": 1176.932,
    "text": " So they try to define these concepts in the meaning of team communication inside and outside communication with different subsystem of organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1178.134,
    "end": 1179.254,
    "text": " Thanks for suggesting that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.394,
    "end": 1183.435,
    "text": "So let's do example A is going to be an individual human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.795,
    "end": 1191.917,
    "text": "So that will be hopefully grounding us to our lived experience and to realistic situations that people and comic book characters find themselves in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.558,
    "end": 1196.179,
    "text": "The second example B is going to be team communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.559,
    "end": 1198.439,
    "text": "So we'll kind of develop the story, but we'll see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.479,
    "end": 1205.361,
    "text": "Maybe the team is a startup team, or maybe they're a research team, or maybe it's just an affinity group about some other topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.061,
    "end": 1210.924,
    "text": " And then the third example, let's think about something more organizational and institutional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.445,
    "end": 1219.671,
    "text": "So let's think about that third example being potentially like a large company, large enough to have a legal department and an HR department, let's just say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.531,
    "end": 1227.676,
    "text": "So we have three examples, which is going to be the person, the team, and the institution slash organization, three levels of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.237,
    "end": 1235.122,
    "text": "And then as we walk through these formalisms, let's see where it might be like strengths, weaknesses, limitations, insights, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.302,
    "end": 1235.522,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.179,
    "end": 1238.921,
    "text": " And I suppose you could apply it to all of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.961,
    "end": 1241.204,
    "text": "This idea, you know, we have this vision and mission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.224,
    "end": 1243.146,
    "text": "I mean, that's more for an organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.206,
    "end": 1248.573,
    "text": "The mission and the vision transfers down to a team, which might be the purpose and the roles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.193,
    "end": 1252.497,
    "text": "And then you've got the kind of the character and the kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.022,
    "end": 1256.504,
    "text": " you know, meaningfulness for the individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.604,
    "end": 1263.029,
    "text": "So you've got this temporal depth being sort of expressed across all of those levels of scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.67,
    "end": 1264.491,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.551,
    "end": 1268.174,
    "text": "Like the examples in this case, they're not three disjoint examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.294,
    "end": 1272.117,
    "text": "In fact, the individual could be on a team in an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.477,
    "end": 1277.962,
    "text": "So all three of these examples that we're going to be talking about could be nested within each other, or they could be disjoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.602,
    "end": 1300.481,
    "text": " so that really highlights why it's so important to have a multi-scale perspective because even when we're talking about the individual we're going to be thinking about the individual it's the system of interest it's what we're talking about it's the interface we're talking about the markov blanket that we're talking about but it's inherently embedded within a larger system so we're not going to forget the company when we're talking about the individual and vice versa",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.061,
    "end": 1316.892,
    "text": " So it's always all the scales happening at once, but then depending on the system of interest or the Markov blanket or the level of coarse graining that is being performed in that specific analysis, it will dive into the details as they present themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.052,
    "end": 1318.253,
    "text": "But that will be kind of fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.073,
    "end": 1332.797,
    "text": " So here's figure one in the paper, and we went a little bit in the previous videos into some of these subcomponents because this is like M4, and there's M123 as well that lead up to M4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.337,
    "end": 1337.799,
    "text": "But just to recap what each of these pieces are, O at the bottom is observation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.519,
    "end": 1342.081,
    "text": " and S is the state that inference is being done upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.601,
    "end": 1344.582,
    "text": "So this is where those examples come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.122,
    "end": 1354.406,
    "text": "So in the individual case, the state that something might be having, that an individual might be performing inference on, it could be, is it sunny or cloudy outside?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.086,
    "end": 1362.089,
    "text": "And maybe that changes how you feel, or it could be a hidden state like, is this person happy with me or sad with me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.109,
    "end": 1367.011,
    "text": "A is the mapping of how those hidden states relate to the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.671,
    "end": 1374.083,
    "text": " So whether at the individual level it's sunny outside and then the observations are perceived with certain probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.46,
    "end": 1384.088,
    "text": " And then, yeah, people just raise their hand if they want to jump onto another example or ask a question about how some of these variables might interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.168,
    "end": 1387.532,
    "text": "I'll just walk through them with no example, and then we'll go to the example pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.132,
    "end": 1392.056,
    "text": "B is how the states are inferred to change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.636,
    "end": 1400.403,
    "text": "So the B is like the probability that given that at state one, it was in such and such a state that at the next time point, it would be at a different state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.224,
    "end": 1406.668,
    "text": " Now, U is a piece that connects to B, and this is the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.129,
    "end": 1412.453,
    "text": "And so the policy is something that influences how states are likely to transform into each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.254,
    "end": 1420.019,
    "text": "The policy itself is downstream of the agent's decisions about which actions to engage in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.619,
    "end": 1426.844,
    "text": "It turns out that the way that the action selection is chosen at the level of analysis, whichever blanket that we're talking about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.802,
    "end": 1439.941,
    "text": " that is uh action selection guided by this set of parameters the g is that expected free energy that's being minimized and that also covers up the c matrix which is like the preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.075,
    "end": 1446.46,
    "text": " The gamma is the precision or the uncertainty, whether it's like one over or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.141,
    "end": 1458.051,
    "text": "And basically this relates to how precise the agent believes they are in their estimate of which policies to be pursuing given this chain of things happening down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.452,
    "end": 1464.877,
    "text": "A is the, is the, okay, sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.013,
    "end": 1471.335,
    "text": " at each time point in this model, because I want to be general, but I want to be specific about what this model actually did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.815,
    "end": 1476.978,
    "text": "At each time point in this model, that's being captured by this top sort of pinkish area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.318,
    "end": 1489.243,
    "text": "This is the affective inference question, where the affect of the agent is relating into how it simulates rolling out in this whole internal gray zone, all these future time points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.143,
    "end": 1495.649,
    "text": " And then each model tick is going to be moving from the left to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.39,
    "end": 1503.358,
    "text": "And at each time point in this model, the agent is going to be running out some possibilities for what could happen in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.658,
    "end": 1505.5,
    "text": "So Steven, and then we'll think about the examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.582,
    "end": 1507.843,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1509.767,
    "end": 1511.828,
    "text": " So I was going to sort of bring an example there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.848,
    "end": 1512.548,
    "text": "So maybe go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.389,
    "end": 1514.029,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.71,
    "end": 1535.3,
    "text": "Well, one thing that's come up and I've been doing some work with this metaphors of movement and Andrew Austin, who does that work, he talks a lot about how anxiety, he finds anxiety is often related to people having, trying to have elevated status, like they're trying to have an elevated status and it's, and it makes a lot of sense for this because it could also be like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.922,
    "end": 1547.994,
    "text": " you feel like you put yourself in an elevated status and you're always going to be slightly uncertain, unless maybe you're a king or someone, about that status being maintained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.354,
    "end": 1556.822,
    "text": "So being put on a pedestal can be, so there could be something about Western society and status, which is partly why we have this overarching anxiety",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.751,
    "end": 1576.293,
    "text": " because um and it would make sense in a way because there's always a sense of never being completely clear about whether your status is going to be maintained so i thought that's kind of interesting um and this would sort of tie would support that kind of observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.085,
    "end": 1577.265,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.605,
    "end": 1587.448,
    "text": "So status or various other sort of social approval metrics we can think of, it's like the water we swim in as social organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.828,
    "end": 1597.491,
    "text": "So just like a company might be wanting to stay above water financially, at least that department, a person has to be staying above water reputationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.911,
    "end": 1599.552,
    "text": "We can think of it in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.972,
    "end": 1605.594,
    "text": "And so again, let's go to the examples and think about these different systems and what they might be performing inference on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.774,
    "end": 1606.014,
    "text": "Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.123,
    "end": 1612.727,
    "text": " Just going to comment on the status issue that it feels like.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1613.427,
    "end": 1614.968,
    "text": "Then you can adjust.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1614.988,
    "end": 1616.65,
    "text": "So you're making serial adjustments, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1616.67,
    "end": 1622.855,
    "text": "You're trying to minimize the free energy, minimize the difference between your expectation and the reality you're experiencing, as I understand it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1623.495,
    "end": 1630.801,
    "text": "So with that overall effective status, you can do what feels like compensating controls, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1631.383,
    "end": 1638.301,
    "text": " So if you feel like you're at risk vis-a-vis the one presentation you're making of self,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1639.076,
    "end": 1653.629,
    "text": " you can rake in other presentations of self to compliment or supplement or mitigate the impression of one of them because you have myriad affective projections that you're making simultaneously.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1654.289,
    "end": 1665.419,
    "text": "So it feels like if you have an awareness of this, it can help you with that presentation of self question by understanding that you, okay, this affective status that I'm presenting,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1666.776,
    "end": 1670.238,
    "text": " is not getting me where I want to be inside.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1670.679,
    "end": 1675.602,
    "text": "So let me leverage another one, which is contiguous or a neighboring affectation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1675.702,
    "end": 1680.946,
    "text": "I'll call it an affectation here, but I mean in a presentation of a Markov binding site.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1682.907,
    "end": 1690.492,
    "text": "So it feels like it gives a strategy for hybridizing and synthesizing your presentation of your Markov blankets.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1691.01,
    "end": 1691.591,
    "text": " Anyway, keep going.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1691.611,
    "end": 1692.532,
    "text": "I'm just, it's impressionable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.552,
    "end": 1692.753,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.013,
    "end": 1693.273,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.374,
    "end": 1699.282,
    "text": "So let's go to the examples and think about how these three potentially even overlapping systems are going to be carrying this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.143,
    "end": 1705.431,
    "text": "And an individual at each time point, maybe let's just say this is every second or each minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.492,
    "end": 1716.316,
    "text": " a team might be interested in organizing on the multi-day and the organization is going to be more explicitly thinking, okay, quarter to quarter, that's going to be our next time that we're going to do all this simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.896,
    "end": 1720.337,
    "text": "So it's not surprising that as things get bigger, they also get slower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.597,
    "end": 1722.358,
    "text": "So that's a common theme we're going to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.018,
    "end": 1728.102,
    "text": " So the individual's affect is really where this emotional inspiration comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.483,
    "end": 1731.505,
    "text": "So there, there's the closest mapping between affect and emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.845,
    "end": 1734.908,
    "text": "But let's think about that team and the large company example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.308,
    "end": 1740.653,
    "text": "Well, affect again, and valence specifically, is like that plus to minus axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.173,
    "end": 1742.615,
    "text": "So is this team going well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.115,
    "end": 1744.316,
    "text": "Is this company going well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.997,
    "end": 1750.221,
    "text": "And if someone says, yeah, we're burning money at an incredible rate, it's unsustainable, but it's going well because I have a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.724,
    "end": 1762.389,
    "text": " believed trajectory that we're going to go on where we actually pull out of the nosedive and do X, Y, Z. So they can still think it's going perfectly well, even if the instantaneous rate of loss is high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.929,
    "end": 1769.252,
    "text": "And then on the flip side, you can imagine a team or a large company where instantaneously their state looks like it's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.352,
    "end": 1772.454,
    "text": "It looks like they have a lot of cash, or it looks like they have a lot of people involved in the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.914,
    "end": 1774.814,
    "text": " but they still feel negative about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.275,
    "end": 1781.716,
    "text": "So that disjoint between the affect about a situation and the state of the situation is one thing to take into account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.276,
    "end": 1787.257,
    "text": "Now let's connect the affect at all these levels to precision estimates at different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.457,
    "end": 1794.599,
    "text": "Especially in the active inference framework, which frames what organisms or any system is doing as precision seeking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.459,
    "end": 1799.743,
    "text": " high anxiety is going to be coming from having low precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.143,
    "end": 1803.467,
    "text": "Now, it's not that we want zero uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.527,
    "end": 1819.221,
    "text": "We want to have this controlled novelty sort of U curve, but it can be clearly situations where your precision is too low and then you're surprised by what is being admitted to you in the niche, whether it's your team operating environment or the company's operating environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.922,
    "end": 1821.003,
    "text": "And then if your precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.423,
    "end": 1828.326,
    "text": " It can't get too high because if you're overly precise and you're incorrect, then you're going to die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.707,
    "end": 1834.37,
    "text": "Like if you have a super, super accurate understanding, but you're just delusional, then you're going to fall off the cliff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.99,
    "end": 1844.495,
    "text": "So in a way, what shapes this precision is actually the real world, which prunes beliefs that are not functionally associated with success in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.655,
    "end": 1845.716,
    "text": "Steven, and then we'll come back to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.602,
    "end": 1855.55,
    "text": " Yeah, I really like this idea of thinking about how we understand ourselves within all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.81,
    "end": 1863.457,
    "text": "So for instance, yeah, if you could move between a different regime of attention or sense of self, which could be like what happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.358,
    "end": 1891.117,
    "text": " do sense making maybe even change the operating metaphors of the person you know who am i at the moment you know what's the context what's my um situational um attunement what's my team's purpose what's what's the operating metaphor for this team are we like all driving together in a car or we are we building ourselves a fortress you know and that would that almost could give a way to jump in and out of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.017,
    "end": 1895.939,
    "text": " these kind of affective engines, if that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.959,
    "end": 1897.74,
    "text": "So as you're seeing over time, how's it going?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.78,
    "end": 1905.224,
    "text": "What's the policy and what's the affective states that are sort of thought about in a certain future?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.264,
    "end": 1912.568,
    "text": "And they could almost then say, okay, what if I shifted, maybe that's where you'd need the body, like the metaphor I'm working with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.868,
    "end": 1913.849,
    "text": "And then what does that do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.736,
    "end": 1924.699,
    "text": " And, um, and maybe at times that's when you need to work with a group to be able to do that because maybe an individual can't just keep flipping backwards and forwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.719,
    "end": 1929.941,
    "text": "You need to work as a group to do that kind of sense making across different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.422,
    "end": 1931.742,
    "text": "Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1931.902,
    "end": 1932.242,
    "text": "Scott.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1933.943,
    "end": 1935.343,
    "text": "I had a question for Sasha.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1935.403,
    "end": 1941.025,
    "text": "You were mentioning pruning, but you weren't talking about dendritic pruning, but I wonder if dendritic pruning is",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1941.775,
    "end": 1971.314,
    "text": " describable by what the type of pruning you were just talking about because my understanding of dendritic pruning very minimal is that you know during the day you have the growth of dendrites and then this prune back selectively and that that is influenced by your externality each day the growth is influenced by your externality and then there's this pruning process that feels like it's iterating itself at that at that level is that describable by this here is that another scale or is it something else that's going on there",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1974.345,
    "end": 1977.167,
    "text": " Yeah, I think that's a really interesting analogy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1977.407,
    "end": 1981.13,
    "text": "That's kind of what's happening there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.77,
    "end": 2000.264,
    "text": "I don't know if I would kind of draw all the same parallels just from a mechanistic standpoint, but it's true that kind of in the generalities that as connections are formed during the day, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2002.882,
    "end": 2006.484,
    "text": " They're pruned or lost as they're not used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.124,
    "end": 2009.705,
    "text": "And yet we think that happens at night.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.385,
    "end": 2025.331,
    "text": "But yet I think that's an interesting analogy to draw that it's beliefs about the world that aren't, I don't know, useful or supported are the ones that then get pruned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.522,
    "end": 2026.822,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2027.944,
    "end": 2045.045,
    "text": "Oh, I was also going to say the other aspect is I think we know from our lived experience is that it's really interesting when people can be holding certain beliefs and not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.747,
    "end": 2047.408,
    "text": " not know that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.788,
    "end": 2055.878,
    "text": "And then when they finally kind of confront the belief, there's a bit of a breakdown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2055.898,
    "end": 2066.652,
    "text": "And to me, that moment is very interesting when people have to confront certain beliefs that maybe they didn't even recognize that they held.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.038,
    "end": 2077.425,
    "text": " So there's a phase change and a recontextualization piece in the last part you said, Sasha, and the pruning is using a network analogy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.785,
    "end": 2081.748,
    "text": "So it's like pruning connections between different aspects of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.268,
    "end": 2087.031,
    "text": "And so let's think about the individual in the office having a conversation with somebody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.532,
    "end": 2090.434,
    "text": "The query, the prompt to them, let's just say is, how are you feeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.834,
    "end": 2094.337,
    "text": "And that is a query that's presented to the interface, which is their ears.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.077,
    "end": 2101.843,
    "text": " and also their vision and other aspects, the query is presented to the interface about what's inside of the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.384,
    "end": 2107.729,
    "text": "And now what's happening inside of the interface is a generative model of that query presenting system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.169,
    "end": 2113.755,
    "text": "So inside of the person, there's a generative model of, for example, the person who's talking to them asking that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.135,
    "end": 2120.181,
    "text": "And we know it's a generative model because if they covered up their eyes or if they only heard part of it, they might be able to still",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.581,
    "end": 2149.59,
    "text": " recover what was being asked but in either case there's a generative model inside of the interface and a prompt is being presented as an observation stimuli to the interface that's querying how the system will respond so speech is action and that's not even a legal claim it's that it's a motor claim speech is generated by a motor behavior it's not your hand but it is a motor behavior and for some people it is with their hand so various body parts can be used to communicate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.475,
    "end": 2154.337,
    "text": " Let's think about that interface in the process of the team and the company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.878,
    "end": 2169.106,
    "text": "So potentially for these organizational entities, the interface could be like a consultant who interfaces with specific questions, but instead of a counselor who asks, how are you feeling to an individual, there might be questions that could be asked to the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.146,
    "end": 2190.192,
    "text": " and there can be questions that could be asked such that only the team could respond and someone might say well how could you ask a question that only a team could respond to aren't teams composed of people there's two things i'd say there the first is that that's the reductionist argument the reductionist slide is like what do you mean get a response from a person aren't you just going to get a response from skin cells and neurons it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.612,
    "end": 2216.495,
    "text": " right that's what i'm trying to get that response so even if the response can be reductionistically understood as being composed of smaller pieces that's not a surprise that should be taken for default so questions can be asked to teams that of course humans are going to be responding uh to as well but also we can think about kind of like colony phenotypes we can think about team phenotypes so for example let's just say i ask a question to a team",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.276,
    "end": 2240.196,
    "text": " like uh what did you have for lunch or what do you think the most exciting project is for next year and then i looked at the distribution of how long it took people to respond to that message that's like a colony level trait it's a collective trait that distribution is composed of people acting but no individual can dictate what that distributional parameter is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.836,
    "end": 2244.279,
    "text": " So it's like a measurement of, let's just say, some blood cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.54,
    "end": 2249.304,
    "text": "You flow a million blood cells through, and then you can get a distribution across all of those blood cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.344,
    "end": 2258.233,
    "text": "So it's like you're querying in the aggregate, even though each individual sub piece could have been following that distribution or somewhat of an outlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.673,
    "end": 2260.975,
    "text": "So those are the kinds of things that you could ask",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.676,
    "end": 2264.076,
    "text": " presenting to a team or an organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.837,
    "end": 2267.977,
    "text": "And the team or the organization is gonna have a generative model of its niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.517,
    "end": 2280.739,
    "text": "So if it's involved in a certain type of consultancy where it paid a lot of money and it really respects what the person is gonna be doing, then maybe when you ask them the question, what's the most exciting project and why, they give one response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.259,
    "end": 2285.26,
    "text": "Or what's the most challenging project of this year and why was it challenging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.72,
    "end": 2290.281,
    "text": "Whereas if you were in a different context, you'd give a different response because the generative model of the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.101,
    "end": 2311.946,
    "text": " across that interface is very different so the response that it gives will be different and it's going to be querying different things and externalizing different aspects of itself could be accurate could be inaccurate scott so one of the things that raises is i've been in some of the work that i've done in cyber security i've been parsing principles versus ethics versus norms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.325,
    "end": 2317.349,
    "text": " And so it's kind of interesting in querying a group, they're going to get an average, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2317.369,
    "end": 2322.074,
    "text": "You'll get a Gaussian distribution or whatever of opinion and then it'll be informative.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2322.955,
    "end": 2334.487,
    "text": "And so norms, I assert for these purposes that their behaviors, behavioral expectations that are set through the past, what was normal.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2335.962,
    "end": 2338.023,
    "text": " And one of the assertions I make is principles.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2338.243,
    "end": 2339.163,
    "text": "And again, they're assertions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2339.203,
    "end": 2340.203,
    "text": "There's different overlap here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2340.723,
    "end": 2344.945,
    "text": "The principles are institutional assertions of aspiration.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2346.625,
    "end": 2351.627,
    "text": "And ethics also are aspirational, but they're human assertions about human behaviors.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2352.067,
    "end": 2355.088,
    "text": "That's the distinction I make, whatever words you want to use.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2355.628,
    "end": 2358.649,
    "text": "And so it's interesting in the context of what you're talking about, about querying a group.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2359.454,
    "end": 2365.539,
    "text": " Because there's different evidentiary chunks that you'll look at, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2365.619,
    "end": 2370.103,
    "text": "Normative, you'll be looking, according to those definitions, on, hey, what did we do before?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2370.884,
    "end": 2373.146,
    "text": "And what did we do against the set of standards that's set?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2373.806,
    "end": 2379.311,
    "text": "The principles may be more aspirational, and it may be, you know, how are we doing towards that thing?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2379.451,
    "end": 2382.894,
    "text": "But it's not necessarily based on what was done before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2382.934,
    "end": 2386.898,
    "text": "You can say our principles are more aspirational than what we did before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2387.538,
    "end": 2400.944,
    "text": " So it's interesting just that interface of what's used in the discussion of the group dynamics and how that relates to what you were just describing, which is the querying of the group and individuals.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2401.344,
    "end": 2407.627,
    "text": "The framing of the nature of that output you're getting from the group is kind of interesting based on that question asked.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2408.007,
    "end": 2410.028,
    "text": " What do you do before is one question.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2410.348,
    "end": 2412.409,
    "text": "What do you wish to do in the future is a different question.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2412.829,
    "end": 2413.069,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.429,
    "end": 2416.63,
    "text": "So that query could be, what do you regularly do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.931,
    "end": 2420.812,
    "text": "So again, it could be the person in the office and someone says, what is your morning routine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.932,
    "end": 2422.833,
    "text": "That's something we talked about in a previous week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.493,
    "end": 2425.294,
    "text": " Or it could be a query to a team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.414,
    "end": 2427.194,
    "text": "What is your onboarding routine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.454,
    "end": 2429.215,
    "text": "Or how do you welcome new members?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.696,
    "end": 2433.417,
    "text": "And then this question of the aspirational and the norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.497,
    "end": 2437.058,
    "text": "So it's funny because norms can mean what's normal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.378,
    "end": 2438.538,
    "text": "It means what's expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.638,
    "end": 2445.201,
    "text": "That's what has happened in the past because what's not normal, if not the past, what's normal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.061,
    "end": 2448.182,
    "text": "But at the same time, normative means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.562,
    "end": 2450.384,
    "text": " means what should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.964,
    "end": 2454.447,
    "text": "So a normative claim should be like, I think people should be treated this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.988,
    "end": 2458.371,
    "text": "And that may or may not reflect what has been the norm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.952,
    "end": 2465.337,
    "text": "So people, all of belief systems make normative claims that sometimes are consistent with norms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.098,
    "end": 2469.859,
    "text": " and sometimes are almost radically divergent from norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.24,
    "end": 2477.082,
    "text": "Someone says, the norm is A, but I think the norm should be B. So I'm making a normative claim about the norms, and it should be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.742,
    "end": 2479.963,
    "text": "And so these are all interesting things to, yeah, Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.983,
    "end": 2489.747,
    "text": "SCOTT J. So one big gap that's out there in the world right now is the gap between law and the interactions that technology allows.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2489.927,
    "end": 2492.388,
    "text": "And I'm talking about practically up and down the chain.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2493.311,
    "end": 2501.838,
    "text": " reproductive interactions, biomedical, population-wide, all these different things, the law is really lagging, okay?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2502.278,
    "end": 2513.207,
    "text": "So one of the things that's interesting about this is there a possibility that this kind of analysis can help us to discover norms that would guide",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2515.402,
    "end": 2521.989,
    "text": " groups and those norms, if they're sufficiently interesting to the groups, can be made enforceable into laws.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2522.289,
    "end": 2535.303,
    "text": "And so that to me, this is a very interesting way of possibility of discovery of new laws and self-constraints that groups can put on themselves in order to function as larger systems in the globe kind of context.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2535.703,
    "end": 2536.884,
    "text": " But I'll put that aside for now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2536.984,
    "end": 2537.925,
    "text": "But I just wanted to raise that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2538.446,
    "end": 2539.667,
    "text": "Is this a discovery?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2539.747,
    "end": 2546.093,
    "text": "Is this a mechanism for discovery of new working models of larger scale norms?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2547.494,
    "end": 2547.754,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.154,
    "end": 2548.415,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.435,
    "end": 2552.859,
    "text": "Yeah, I think that this is a good point because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.276,
    "end": 2577.384,
    "text": " And discovering that with this model here where you've got this task specific and then you've got this effective, actually as a larger sort of scale, time scale sort of checking, I think it's also relevant in terms of how we can get mechanized in our, like if we just keep doing the same task and we get the reward in the queue and it starts to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.524,
    "end": 2606.445,
    "text": " create a high sense of this false sense of certainty in our world which is so much about just constructing more of our social niche and and alienating or externalizing the environmental so we we can start to get caught up in this kind of task specific ways of working and silos and so that maybe there's this this could speak to why we need to do some sort of sense breaking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.285,
    "end": 2634.98,
    "text": " to sort of take us out of some of these mechanizations and look at a longer time scale and use affect to do that integration and not just rely on metrics cool let's let's take scott's point about this being not just an enforcement understanding but a discovery process and connect that to some topics we've been considering like bottom up versus top down function of systems so the bottom up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.68,
    "end": 2660.487,
    "text": " is learning that's where the little ants are going out and they're finding different things or each of the cells in the retina is receiving a different photon or each person is receiving a different news feed and then as it goes quote up or in the system it's being aggregated and that is updating progressively more and more summary like variables like of teams or of organizations and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.681,
    "end": 2672.613,
    "text": " Norms can feed back down to lower levels of the system, whether in the brain, like the Bayesian brain or the predictive processing hypothesis, or whether it's team communication norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.694,
    "end": 2675.216,
    "text": "And those can be informal or formal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.796,
    "end": 2682.263,
    "text": "When we are talking about human organizations, we gain this level of syntactic framing of top-down priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.904,
    "end": 2690.508,
    "text": " So instead of just saying, this is how things are, like the red blood cells are flowing at this speed, so that's the speed they're flowing at, we're gonna say there's a speed limit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.948,
    "end": 2694.85,
    "text": "And if you don't follow the speed limit, then we're gonna have this type of enforcement mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.57,
    "end": 2699.352,
    "text": "And so it could be the case that in the legal context,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.932,
    "end": 2706.377,
    "text": " that if you just apply a law, a top-down law, it's kind of like trying to teach someone a motor pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.257,
    "end": 2710.56,
    "text": "Let's just say a speech law of some type of controlling speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.1,
    "end": 2715.143,
    "text": "It's like controlling someone's motor behavior, again, because it is a motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.664,
    "end": 2716.424,
    "text": "And so what would you do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.484,
    "end": 2720.607,
    "text": "Would you put them in the exoskeleton and say, okay, here's a perfect golf swing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.987,
    "end": 2722.108,
    "text": "Now you're a golfer, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.569,
    "end": 2726.732,
    "text": "Well, no, you actually need to practice and you need to have feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.412,
    "end": 2740.995,
    "text": " And so if the law is overly punitive and it says, oh, that one time that you got put in the exoskeleton, you didn't understand how to golf and other sports that golfers know, how could you not have made the connection there from that one time that I punished you for messing up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.815,
    "end": 2745.375,
    "text": "That is not an extremely helpful framework for certain issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.135,
    "end": 2753.617,
    "text": "So how could we have this bi-directional conversation where there's experimentation and implementation at the edges",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.591,
    "end": 2758.396,
    "text": " And then people's experience percolates upwards in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.077,
    "end": 2767.988,
    "text": "And then the system informally, but eventually formally ends up entrenching healthy or productive or agreed upon patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.979,
    "end": 2775.781,
    "text": " So it's an interesting thought about how these type of systems are not just about learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.962,
    "end": 2777.782,
    "text": "They're not just about exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.262,
    "end": 2782.944,
    "text": "As we've been thinking about, they're sort of in both domains and they can trade off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.444,
    "end": 2790.267,
    "text": "And when they need to exploit, they can dip into exploitative type behavior, but also they can be in an exploratory mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.527,
    "end": 2790.727,
    "text": "Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.125,
    "end": 2814.544,
    "text": " and it's also so much wrapped up in identity it's amazing how this is a new platform for identity because every thing has a markov blanket and it has attributes and external attributes that are presented and so the discovery when you have things like trade associations markets communities of interest where things",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2815.504,
    "end": 2839.655,
    "text": " entities with similar um i guess markov blankets and attributes can cluster together forming those systems which have larger scale which enable de-risking and leverage for the organism or organization at larger levels so the discovery process of bringing these markets are where markov blankets are um made similar",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2841.531,
    "end": 2844.974,
    "text": " Because you go in and there's a law that says if you go in, it's a flea market.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2845.375,
    "end": 2847.256,
    "text": "Your table can only be five by five.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2847.697,
    "end": 2850.84,
    "text": "So if you go in with a seven by five table, you can't go to that flea market.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2851.02,
    "end": 2853.262,
    "text": "You have to follow the rules to be part of the club.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2853.282,
    "end": 2858.887,
    "text": "But if you're in the club, you get the power of having more people walking past your table to sell stuff.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2859.235,
    "end": 2863.697,
    "text": " So there's the interface, the law for the vendor to the flea market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.157,
    "end": 2872.039,
    "text": "And then within that transaction, there's a sub transaction, which is if you want this little pocket knife, you're going to give me $3 and then I'll give you the pocket knife.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.199,
    "end": 2878.061,
    "text": "So these are the nesting of agreements in the context of identity and enforced and unenforced norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.522,
    "end": 2879.402,
    "text": "Blue and then Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.355,
    "end": 2885.618,
    "text": " So just to kind of tie into what both you and Scott were saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2885.698,
    "end": 2893.225,
    "text": "So like, you know, if we're ants and we're going through the world, like building this generative model, like as we discover, as we're learning, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.265,
    "end": 2895.967,
    "text": "Like, so as we learn, we build the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.007,
    "end": 2900.651,
    "text": "Like to what extent is our generative model tied into our identity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2901.312,
    "end": 2902.433,
    "text": "Like that's interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.853,
    "end": 2903.833,
    "text": " it's curious to think about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2903.953,
    "end": 2910.235,
    "text": "And, and I mean, I know that like there's a policy update and perhaps the policy is more based on identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2910.415,
    "end": 2915.417,
    "text": "Like we talked about earlier, like the running every day, uh, maybe it's, it's a policy thing that's identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2915.457,
    "end": 2920.499,
    "text": "And so the, the, we pick the, the policy that, that then minimizes the free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.539,
    "end": 2929.161,
    "text": "But, but I just wonder like, you know, the, the generative model, how frequently that, that builds upon the identity, like what the relationship is between those two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2930.262,
    "end": 2930.542,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.782,
    "end": 2931.342,
    "text": "And then Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.956,
    "end": 2934.296,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.517,
    "end": 2946.203,
    "text": "Well, one thing that sort of ties into that question of identity and this type of model is, and the Markov blanket, I suppose, is how much changes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.179,
    "end": 2958.943,
    "text": " based on the processing, which could be like this in the brain, could be sort of structured through the way the brain is structured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.963,
    "end": 2964.585,
    "text": "So there could be an additional type of structuring going on in which all of this is able to work together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.285,
    "end": 2979.365,
    "text": " and then so how much is is this kind of um the observations and the states in the sort of brain computating in relation and with the body and how much is it just literally the way the mark of blanket itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.285,
    "end": 3008.729,
    "text": " is changed you know so and i think that's maybe an open question at the moment because there's the the question i don't think as much is that the idea of regimes of attention has been talked about but literally how would that change your computation by bringing in different parts of the body and the relation to the environment as the sort of mark of blanket to integrate information coming in and how much is through computation and i sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.333,
    "end": 3024.364,
    "text": " that at certain times, maybe when you're learning something for the first time, it's very computationally heavy, but then as you draw things down and it becomes kind of tacit knowledge, we might become subconsciously able to flow and shift",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.953,
    "end": 3030.474,
    "text": " Yes, formal systems can become integrated through muscle memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.814,
    "end": 3036.236,
    "text": "So somebody who's learning how to play violin, they don't need to know the math of the frequency overlap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.376,
    "end": 3043.017,
    "text": "They might learn that in their journey, but also it becomes incorporated through culturally acquired practices and muscle memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.277,
    "end": 3045.338,
    "text": "And that can be carried out into other areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.618,
    "end": 3045.798,
    "text": "Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.435,
    "end": 3053.979,
    "text": " There was an article just read recently in Nature or Science, which relates to Stephen's last point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3054.459,
    "end": 3060.542,
    "text": "And it was about how in cultures where there were deaf cultures, so there are isolated populations.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3060.602,
    "end": 3062.063,
    "text": "I think there was one in Central America.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3062.103,
    "end": 3066.006,
    "text": "There was one in the Middle East of deaf people because there was some kind of genetic thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3066.046,
    "end": 3069.187,
    "text": "And so large populations of isolated people who were deaf.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3070.148,
    "end": 3075.111,
    "text": "And what they found is when they came up with their independent sign languages, they were all independently generated.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3075.919,
    "end": 3083.043,
    "text": " What they found in this research is they used the body in each of the isolated populations.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3083.303,
    "end": 3086.725,
    "text": "The body was used in the same way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3086.745,
    "end": 3099.852,
    "text": "I'm going to make up the parts because I can't remember them, but they would first use the face parts, then they would use the left arm, then they would use the right arm, then they would use the core of the body, the morphology of speech through sign language.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3100.572,
    "end": 3106.898,
    "text": " was identical across the human populations, even though they were isolated from each other in terms of what they added on.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3106.938,
    "end": 3110.862,
    "text": "I forget what it was with the bigger concepts or the things that were emotional.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3110.882,
    "end": 3115.786,
    "text": "There were different morphologies of that situating their expression.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3116.824,
    "end": 3120.208,
    "text": " in their morphology, in other parts of their morphology.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3120.268,
    "end": 3121.89,
    "text": "So I thought it would relate to that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3121.93,
    "end": 3128.376,
    "text": "I'm not sure how, but it feels like that form of expression being uniform across humans.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3128.456,
    "end": 3132.521,
    "text": "It's like the theories of humans having a language capacity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3132.601,
    "end": 3136.004,
    "text": "I forget who that is, maybe McLuhan or somebody.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3136.345,
    "end": 3139.208,
    "text": "Anyway, but it's interesting that the morphology of the body",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3141.1,
    "end": 3148.547,
    "text": " It sounds like there's some intrinsic tiering of what expression comes through what parts of the body.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3150.469,
    "end": 3151.53,
    "text": "I'll try to find the article.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3151.81,
    "end": 3165.483,
    "text": "Very interesting, and that actually reminds me of William Blake's poetry and the fourfold Albion, which is a metaphor for cosmic persona, as well as all of England, as well as the individual body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.903,
    "end": 3192.145,
    "text": " and so it's a metaphor that he returns to many times in an allegorical context and it's so evocative because it speaks to a multi-scale system and it is of course applying to multi multi-scale systems steven yeah thanks for that uh scott because i think that's i mean that could actually also you know we there's all this thing about this innate language capacity which has now been kind of discounted but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.972,
    "end": 3209.384,
    "text": " I mean, if actions first and then morphology is maybe more related, certainly within certain environmental niches that people have grown up in, that would maybe explain why there was that confusion in the language world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.179,
    "end": 3212.121,
    "text": " because people sort of saw language as universal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.141,
    "end": 3225.896,
    "text": "Well, actually, if the morphology is where it's at, and language is just another type of morphology that's kind of building on the core morphology of the body, that's where that patterning was coming from, not the language itself or the language in process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.597,
    "end": 3232.343,
    "text": "Look, I was just going to say, extending that out further, one of the assertions that I've started to",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3233.228,
    "end": 3237.449,
    "text": " make and believe is that the mind doesn't reside in the brain at all.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3237.509,
    "end": 3245.832,
    "text": "The mind resides in language and in material culture, and the brain is an antenna that we tune into the local mind wherever we're exposed to.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3246.192,
    "end": 3251.394,
    "text": "That's why colonialists put indigenous populations' children in their schools, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3251.414,
    "end": 3259.157,
    "text": "They want to tune their mind into a colonialist culture early, because then it renders the externality innocuous for their colonialism.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3259.724,
    "end": 3259.984,
    "text": " Anyway.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3260.344,
    "end": 3266.767,
    "text": "Yes, that's true of all children's education, including contemporary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.568,
    "end": 3277.152,
    "text": "And to bring in this key point of precision, again, active inference is not about systems finding the most rewarding state and then sticking with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.653,
    "end": 3278.573,
    "text": "It's about precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.673,
    "end": 3280.114,
    "text": "So to connect that to identity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.214,
    "end": 3289.617,
    "text": " The child's education is basically being given symbols that will help it navigate the regularities in its niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.077,
    "end": 3298.7,
    "text": "And again, there can be dysfunctional education that leads to children that are incapable of taking advantage or of working with the regularities in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.56,
    "end": 3311.272,
    "text": " but this is where the policy selection piece comes into play to kind of return it to the figure because that's like important to return to what the paper said is the policy selection piece is so tied up with identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.852,
    "end": 3316.557,
    "text": "It's not that there's an identity like who we are and then there's this totally separate question of what we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.158,
    "end": 3320.761,
    "text": "It actually is we are how we act",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.542,
    "end": 3335.247,
    "text": " And to even take it to another level, the understanding of how the world changes, S, the states that are external that we care about, the understanding of how those states change is related to the policy actions that the system takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.294,
    "end": 3340.457,
    "text": " And so that even brings this relational mode another level deeper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.878,
    "end": 3342.479,
    "text": "It's not just like Sapir-Whorf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.879,
    "end": 3346.102,
    "text": "Oh, well, the words that you use change how you think or they influence how you think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.363,
    "end": 3353.327,
    "text": "Everything is influential on how we think because how we think is like this emergent outcome from all those factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.828,
    "end": 3361.474,
    "text": "So it's a starting point to say that the words that we have or the affordances or the sensory capacities that we have shape our understanding of the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.554,
    "end": 3362.334,
    "text": "That's the starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.615,
    "end": 3362.815,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.767,
    "end": 3374.034,
    "text": " So just to piggyback on the idea of a team and identity, like how, and also where the mind is, like where is the mind of a team, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.054,
    "end": 3376.576,
    "text": "Like when you're thinking about this in terms of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3377.017,
    "end": 3384.362,
    "text": "And so the individual team members, I mean, we've all worked on teams before at various points and it's amazing how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.103,
    "end": 3390.087,
    "text": " the team changes based on the function of its individual components, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.127,
    "end": 3393.069,
    "text": "So there are different people that bring different dynamics to a team.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.41,
    "end": 3399.975,
    "text": "Some people may be louder, stronger, or less influential, or everyone has their different kind of role in a team.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.715,
    "end": 3406.34,
    "text": "And these all really bring changes to the overall structure and the way that the team will react, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.36,
    "end": 3410.583,
    "text": "Like based on a query, like when you query a team, what is the best project of the year?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3410.703,
    "end": 3414.026,
    "text": "That'll change based on the individual components of that team.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.205,
    "end": 3415.405,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.645,
    "end": 3424.674,
    "text": "And the team organism mapping, let's think about team onboarding and the way that the interface of the organism is like an interface of a team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.054,
    "end": 3432.721,
    "text": "So the immune system of a person, there's times where something is onboarded, but in a very controlled way, and it does not trigger the immune system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.121,
    "end": 3449.213,
    "text": " So, for example, if you eat something in the stomach, which is a specialized chamber that digests food, it is then absorbed through the interface of the gut in a controllable way, in a way where only the safe pieces, like you know that the sugars are coming in and the amino acids are coming in, lipids are coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.793,
    "end": 3455.962,
    "text": " So through that controlled and evolutionarily selected upon interface, there is an onboarding process that's healthy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.342,
    "end": 3462.792,
    "text": "But if there's a onboarding event on your body, like a cut in your skin, it's going to trigger the immune system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.212,
    "end": 3465.375,
    "text": "So that's more like a security breach for a team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.936,
    "end": 3470.558,
    "text": " Whereas eating for a team might be like, hey, we're gonna get this ingest of new data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.719,
    "end": 3472.62,
    "text": "Our colleague is gonna send us a dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.96,
    "end": 3475.561,
    "text": "It's gonna come from this email address and it's this type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.081,
    "end": 3478.042,
    "text": "If it's from a different email address, I'm not gonna see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.082,
    "end": 3480.844,
    "text": "Or if it's of a different type, we're gonna need to change our pipeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.244,
    "end": 3485.767,
    "text": "But if it's this type of food coming at this interface and it's this structure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.647,
    "end": 3502.285,
    "text": " We're going to be able to digest that and then use the information latent in that input to help our team become more structured or to expand, just like an organism would break down a food and use it to grow itself or to operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.645,
    "end": 3502.886,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.268,
    "end": 3507.03,
    "text": "And also with teams, you've got the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.955,
    "end": 3524.802,
    "text": " the teleology of the team like the purpose the goals and i think that that i mean this figure sort of speaking a lot to task based you know ways of of things being evaluated with rewards and the way that we structure our teams often with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.612,
    "end": 3549.61,
    "text": " the way that we then construct the environment to sort of lead us towards those rewards in a way and i'm really interested i've been looking at this thing called infusion space that i've been working on is when we are in a kind of an organized space with a teleology and a direction like a team and organization and then when we're in a sort of community uh space where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.39,
    "end": 3579.81,
    "text": " which maybe this isn't you know i think is another process of affect where we're sort of attuning to um that kind of intersubjective dynamic between us and you know there's there's one's more efficient the team's more efficient if your goal is the right goal the danger is that you could be they talk about now with the modern world is we're getting very good at doing the wrong things so it can be the trap you fall into so climate change being a classic case we're very good doing things we shouldn't be doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3580.57,
    "end": 3604.726,
    "text": " um so i think there's an interesting question there about a teleological dynamic aligned to goals and rewards which everything's then and it could actually remove the knowing of your affect and you can just ignore it because you're getting other kicks and when the deeper knowing is like you know it's not really going to be good when you talk about really long time scales",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.181,
    "end": 3607.902,
    "text": " Okay, let's expand on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.002,
    "end": 3611.704,
    "text": "So teleology is coming from the word teleos, which is the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.024,
    "end": 3617.786,
    "text": "So teleology is the study in philosophy of what systems are as defined by their ends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.946,
    "end": 3623.029,
    "text": "So the purpose of something, like houses are to keep people warm and what are people for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.649,
    "end": 3628.492,
    "text": " But instead of engaging in the philosophy of teleology, like what is it mean to be a human?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.532,
    "end": 3629.313,
    "text": "What are we here for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.793,
    "end": 3636.137,
    "text": "We can think about it from a cybernetics perspective, which is also equivalent to like an intentional stance in philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.618,
    "end": 3643.943,
    "text": "And that's kind of like saying like, okay, look, whether or not we're ever gonna figure out the ultimate teleos of a human or the ultimate teleos of our team,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.643,
    "end": 3657.022,
    "text": " At the very least, as a goal-seeking system that has to operate amidst uncertainty and communicate through limited and noisy channels, we need to have clarity on our mission, our local teleos,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.402,
    "end": 3659.863,
    "text": " so that we can have clarity on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.444,
    "end": 3668.85,
    "text": "And again, if your local mission is something that is a pursuable, then it's a second layer, whether it's quote good or bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.55,
    "end": 3675.635,
    "text": "And that's the whole question about what Scott raised with the Markov blankets of legal entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.815,
    "end": 3680.458,
    "text": "And there it's kind of easy to see some of the analogies between let's say a society and a person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.899,
    "end": 3686.443,
    "text": "If each cell were to fight for its Markov blanket, then things could get hairy pretty fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.943,
    "end": 3699.812,
    "text": " Whereas over evolutionary time, the interfaces between cells of the organism have evolved through so many different proteins and so many different mechanisms to work well together, to be compatible within the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.292,
    "end": 3706.956,
    "text": "And similarly, within a healthy operating system for legal entities, you could imagine there would be healthy interfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.317,
    "end": 3716.863,
    "text": "But in the absence of a healthy interface, then even entities whose interests are completely aligned might end up in extremely adversarial contexts together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.203,
    "end": 3717.503,
    "text": " Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.024,
    "end": 3725.328,
    "text": "And I think that might be the problem with Kant's, Immanuel Kant's, what is it called?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3725.348,
    "end": 3726.369,
    "text": "The something imperative?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3727.169,
    "end": 3728.11,
    "text": "Categorical imperative.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3728.47,
    "end": 3728.67,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3729.05,
    "end": 3734.554,
    "text": "And is that the notion that if a human acts, a good human acts in a good way, it'll be good for society?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3735.969,
    "end": 3747.655,
    "text": " So the Kantian imperative, as it's called, a categorical imperative sometimes, I just wanted to look up an exact word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.095,
    "end": 3756.559,
    "text": "It is quoted as a rule of conduct that is unconditional or absolute for all agents, the validity of claim of which does not depend on any desire or end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.68,
    "end": 3763.302,
    "text": "That reads heavily as that classic era of abstraction in philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.322,
    "end": 3763.822,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.028,
    "end": 3770.274,
    "text": " And that's one of the problems in European law right now and an identity law like GDPR and those kind of things in the real world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3770.914,
    "end": 3775.759,
    "text": "Their idea of entities and of identity is based on Hegel and Kant.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3776.559,
    "end": 3777.62,
    "text": "And those are there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3777.72,
    "end": 3784.627,
    "text": "There is a real focus on that individual being good and that being enough to have the entire society work well.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3785.467,
    "end": 3788.23,
    "text": "And I think that's part of the challenges over there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3789.095,
    "end": 3794.617,
    "text": " In continental law, you make the law and you refer back to the statute all the time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3795.177,
    "end": 3804.92,
    "text": "In common law, which is any place that was part of the British Empire, what you do is you come up with a half-assed version of the law and then you allow common law to fix it up.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3805.821,
    "end": 3809.702,
    "text": "So the common law acts as a continually dynamic revisiting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3811.152,
    "end": 3812.954,
    "text": " because the courts then make the law.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3813.034,
    "end": 3819.438,
    "text": "And then when you have a later case, you don't just look at the original statute, you look at the cases as well, the other court cases.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3820.039,
    "end": 3821.54,
    "text": "And so it's been modified by that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3821.6,
    "end": 3825.103,
    "text": "So one of the things that this gets tangled up in is philosophically,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3826.095,
    "end": 3827.976,
    "text": " a question of how much of a teleology you have.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3828.436,
    "end": 3835.68,
    "text": "I believe, my personal belief is that because they had royalty, a tradition of royalty on the European continent, that they're more amenable to a single voice.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3836.481,
    "end": 3844.065,
    "text": "And so that single voice can act in a misdirected way for a longer period of time because it projects onto a paradigm, onto the population.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3844.525,
    "end": 3852.85,
    "text": "But it's just something that, it gets softer at that level perhaps because we don't know the data and the metrics, but it feels like those same kind of",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3853.71,
    "end": 3856.171,
    "text": " Things are iterating from a system perspective.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3856.491,
    "end": 3860.333,
    "text": "If you have something that's too stuck in the mud, it's not going to change as fast.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3860.673,
    "end": 3866.436,
    "text": "And now that's happening everywhere since technology, Moore's law increases interactions exponentially.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3867.076,
    "end": 3874.8,
    "text": "All of our institutions, all of them were intended to de-risk and leverage much more leisurely institutional contexts.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3875.2,
    "end": 3878.702,
    "text": "So they're no longer fit for function in the interaction landscapes we have.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3879.898,
    "end": 3901.859,
    "text": " And so one of the questions is, in what way might this analysis help us to not just improve old institutions, that might not be possible, but construct institutions that can better be dynamic with the increased frequency and volume of interactions we have, which is perceived by any one institution as an increase in density.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3902.219,
    "end": 3914.28,
    "text": " interaction density that's why your calendar is all jammed up because we're still using calendars the way we used to use them which is linear progression of things you have to do things like that so anyway sorry about the question there yeah interesting steven",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3915.882,
    "end": 3929.399,
    "text": " Well, that also might tie into this idea of when we have systems in our niche that we've created, when do we need them to be more tunable to our own active inference types of dynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.479,
    "end": 3933.704,
    "text": "Like if this is the type of way that we can, what would help us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.665,
    "end": 3954.33,
    "text": " be better at attuning and what types of attention at what types of scale would we want this kind of dynamical process and when does it want to be fixed and it kind of speaks another problem in the development world was the rights-based approach to development so someone somewhere defines what people's rights are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.83,
    "end": 3980.419,
    "text": " and then it gets dictated down but that causes a lot of problems when you roll out into cultures which value things slightly different to those that decided what's right and it's also what's right for someone in a poor context or a poverty context might not be quite as it is with someone in a developed wealthy context so the same you know maybe this is a question that needs to be asked is when do we need to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.283,
    "end": 3996.358,
    "text": " this kind of active inference ergodic help you know thought about create and when do we say look this isn't being done that way we're just going to bolt it down and use a non-ergodic kind of structured state of the sort of laws",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.293,
    "end": 3998.674,
    "text": " Okay, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.055,
    "end": 4004.6,
    "text": "So let's try to connect that to Kant and then back to action, because that's the key piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4004.76,
    "end": 4019.973,
    "text": "And that's what we really want to emphasize with the active inference approach is that although we generalize, we're generalizing to reduce our uncertainty about observations, which could be letters or sounds that we're hearing, we're reducing our uncertainty about these stimuli that we're as people receiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.834,
    "end": 4022.976,
    "text": " by generalizing so that we can guide action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.396,
    "end": 4035.306,
    "text": "And so the categorical imperative on Wikipedia, it says it's best known from its first formulation, act only according to that maxim whereby you can at the same time will that it should become a universal law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.687,
    "end": 4041.492,
    "text": "So that's actually also related in a sense like a symmetry relationship with the Rawlsian theories of justice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.992,
    "end": 4048.537,
    "text": "Like what would be fair would be if you were to be a random draw, you'd want to be in that society versus another society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4049.178,
    "end": 4053.2,
    "text": " But here's where active inference and action and the reality of the finite world come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.74,
    "end": 4056.341,
    "text": "Different people have different risk preference trade-offs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.741,
    "end": 4060.603,
    "text": "So maybe somebody says, yeah, I'll take a one in a million chance of being the dictator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.863,
    "end": 4068.066,
    "text": "And somebody else says, no, I'd rather have an 100% chance of being in this other world where everyone has the exact same amount of official power, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.124,
    "end": 4081.549,
    "text": " But even at a deeper level, that's a thought discussion and it's becoming increasingly lifted from action and from policy selections that we as the agents perceiving that question are being faced with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.189,
    "end": 4089.052,
    "text": "And so when people bring in the things like it should become a universal law, that's a normative claim about a universalism about a law",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.452,
    "end": 4091.093,
    "text": " and who's the judge, jury, executioner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.513,
    "end": 4106.622,
    "text": "So although the sentence, the imperative started with act according to dot, dot, dot, dot, it ended up in the clouds with some speculation about what could or would or should become universal and ostensibly enforced by other people with weapons, but not yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.302,
    "end": 4109.704,
    "text": "So how do we tie it back to the real system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.584,
    "end": 4134.414,
    "text": " and confront ourselves with what we actually are being faced with from an affordance and from a challenges perspective and then ask what policies will help guide the whole system towards states that we want to see but at first we can just acquire precision about who are we what are our relationships what are our interfaces how can we think in a more rigorous multi-scale way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.194,
    "end": 4138.256,
    "text": " about how we are composed of our relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.716,
    "end": 4145.419,
    "text": "So not that I'm some Adam and I'm being influenced by my relationships, but it's multi-scale relationships all the way up and down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.079,
    "end": 4147.74,
    "text": "So what is really happening here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.501,
    "end": 4150.862,
    "text": "These are some interesting ways that sidestep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.522,
    "end": 4170.676,
    "text": " morality when working together but they sidestep the ways that morality has been framed in terms of well i think it should become a universal law that i should get all the money and then it's easy for me to act within the categorical imperative under that understanding and someone says well no that's not the real understanding and then you're right back to square zero so how are we going to use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4171.537,
    "end": 4198.558,
    "text": " systems thinking but also include aspects of intercultural communication and understanding that people are going to be having different experiences of the same deal the same interface different people are going to have different experiences of it and then work within that environment so that's kind of you know some big areas that hopefully we'll be thinking about in the coming years because they're uh serious questions about how to interface formal systems with people scott",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.767,
    "end": 4204.65,
    "text": " One of the things that's interesting right now in law is that, you know, it's really showing wear and tear.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4205.25,
    "end": 4209.572,
    "text": "And people are really focusing on liability and rights and things like that, which is terrific.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4210.072,
    "end": 4212.994,
    "text": "But one of the things, the right is an expectation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4214.275,
    "end": 4220.318,
    "text": "And what the law does is it constructs a bunch of duties around that right that give life to the right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4221.198,
    "end": 4226.441,
    "text": "So if I say I have a right to free speech and nobody has a duty to respect it, then I don't have anything except words on paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4227.99,
    "end": 4251.848,
    "text": " so the duties the construction of duties what that does is it's constraint on other uh expression other markov blankets right you're limiting and constraining the environment of other individuals you'll meet because they have a duty to do x the duty to there's a judge who said years ago in the united states you're right to swing your head arm in public ends where my nose begins",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4254.136,
    "end": 4257.78,
    "text": " So you can keep doing this until my nose is next to where you're swinging your arm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4258.461,
    "end": 4261.024,
    "text": "So it's interesting, isn't it, that you have this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4261.424,
    "end": 4263.166,
    "text": "That is really that dynamic element.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4263.286,
    "end": 4267.651,
    "text": "If a nose is introduced into that system, you've got to stop swinging your arm.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4268.151,
    "end": 4273.177,
    "text": "And so the anticipation of situations where you shouldn't swing your arm, don't swing your arm in an elevator.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4274.087,
    "end": 4274.827,
    "text": " You know, that kind of thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4274.867,
    "end": 4275.027,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4275.067,
    "end": 4276.368,
    "text": "Don't don't spit on the subway.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4276.968,
    "end": 4282.351,
    "text": "But you start to have these rules which are like, hey, we can generalize that duty to a population.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4282.811,
    "end": 4286.632,
    "text": "And if it's relatively innocuous, like red means stop.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4288.153,
    "end": 4289.194,
    "text": "Purple could mean stop.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4290.074,
    "end": 4291.695,
    "text": "It's not the light that stops the car.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4291.735,
    "end": 4294.156,
    "text": "It's the behavior elicited by the signal.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4295.239,
    "end": 4306.962,
    "text": " So there are a lot of innocuous things we can avoid avoidable harms by agreeing on innocuous signaling for certain duties and behaviors that would render those rights to be realized and to be living.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4308.325,
    "end": 4332.663,
    "text": " yep so with this kind of eating team metaphor ingestion of stimuli or a food at the organism level and that's being processed either chemically with food or informationally with the stimuli in order to guide action so we can think about these teams and organizations as getting inputs and then engaging in action in their niche and the goal of the inputs and selection is going to shape this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.303,
    "end": 4338.265,
    "text": " is so that the inputs can be processed in a way that leads to outputs that are effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.965,
    "end": 4342.787,
    "text": "And so again, another mapping would be to a heat system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.287,
    "end": 4351.91,
    "text": "So like an engine, if you can convert 100% of the potential energy into work, it's a very efficient system and it doesn't lose a lot to heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.411,
    "end": 4360.534,
    "text": "Whereas if you have a system that's broken or has inefficiencies in it, it will perform very little work in its task specific role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.394,
    "end": 4364.136,
    "text": " and it will release a lot as heat, which is like wasted energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4364.256,
    "end": 4365.637,
    "text": "That's like data exhaust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.697,
    "end": 4366.658,
    "text": "There's wasted data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.038,
    "end": 4368.44,
    "text": "There's so many mappings here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.94,
    "end": 4373.183,
    "text": "Actually, in the last couple of minutes, let's just run through the slides, see if anything comes to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.263,
    "end": 4376.766,
    "text": "But other than that, I'm sure we could keep on thinking about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.507,
    "end": 4378.667,
    "text": "Figure two of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.568,
    "end": 4388.933,
    "text": " the authors showed this rollout game and the agent at each time point is imagining what could happen on future timelines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.453,
    "end": 4392.855,
    "text": "And so here's a timeline where I stay in this neutral state on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4392.895,
    "end": 4395.957,
    "text": "Here's a timeline where I get to state three and that's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.977,
    "end": 4397.437,
    "text": "And then I go to state four and it's bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.078,
    "end": 4405.722,
    "text": "And so as you simulate and you roll out more and more and more deeply, that's the sophisticated or the deep component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.542,
    "end": 4407.403,
    "text": "As you roll that out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.323,
    "end": 4412.124,
    "text": " in order to track what kind of a world you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.284,
    "end": 4416.366,
    "text": "Are you in a world where all the routes are bad or all of them are good or some are good and some are bad?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.886,
    "end": 4418.986,
    "text": "The agent is tracking a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.366,
    "end": 4426.249,
    "text": "It's tracking the state estimates, like the expected value of different policy choices, but also the variance or the uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.789,
    "end": 4437.152,
    "text": "And what we saw in this paper was that as the agent starts initially thinking and simulating deeply, it starts to be perceiving itself in states that are rewarding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.592,
    "end": 4441.775,
    "text": " and it has relatively high precision about being able to maintain itself in those states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.355,
    "end": 4447.418,
    "text": "But as it continues to simulate deeper and deeper, the precision of its model drops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.878,
    "end": 4452.281,
    "text": "This is associated with anxiety from the computational psychiatry perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.221,
    "end": 4480.652,
    "text": " and uh it's also associated with the increased percentage of the events being negative but not a 10x increase in the events being negative and as we pointed out last time it's actually when the threat perception is at a medium level when the anxiety skyrockets and again this specific trace is just related to the parameters of this model so it's not meant to be a general claim about anxiety or something like that it is for future work to really map this onto real world systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.872,
    "end": 4484.673,
    "text": " We had the formalisms, which people can pause and look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.914,
    "end": 4497.337,
    "text": "The formalisms of sophisticated inference and the real natural language translations of some of these variables that are interacting in these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.162,
    "end": 4519.101,
    "text": " talked about the generalized free energy and about how that formalism has a few different parts one of those parts is conditioned on policies and it talks about the relational mapping between observations and states and then the other function here is conditioned on policy and it's uh yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.868,
    "end": 4522.089,
    "text": " Sorry, let me just rephrase that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.649,
    "end": 4525.931,
    "text": "One of these sides is conditioned on policy and relates to states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.411,
    "end": 4530.174,
    "text": "The other side is conditioned on observations and states, and it relates to policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.695,
    "end": 4546.283,
    "text": "We talked about a few other topics, intrinsic and external value, general and special cases, and how when you are moving through a prediction in this branching way, there's an exponentially increasing number of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4546.824,
    "end": 4548.265,
    "text": "And so in order to deal with that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.165,
    "end": 4565.662,
    "text": " organisms or systems have to engage in a little bit more of a guided kind of search and that brings us to this slide which is what i kind of wanted to pause on because i think blue this is what made you say we have to invite scott so what was interesting to you here what made you think of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.159,
    "end": 4572.262,
    "text": " Just Scott and how Scott's always presenting on risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4572.542,
    "end": 4576.083,
    "text": "And this just was like, well, I think that Scott really needs to be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4576.203,
    "end": 4583.427,
    "text": "And based on also the fact that Scott said he'd been studying active inference since the October complexity weekend.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4583.527,
    "end": 4585.008,
    "text": "So those two things kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4586.028,
    "end": 4600.91,
    "text": " nailed it for me it's i feel like it's a it's it's this giant thing smorgasbord that's in the next room that i haven't yet entered into that's it's it's so delightful i'm so thrilled by my ignorance in this this is the best",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4601.986,
    "end": 4620.009,
    "text": " gift i could ever get so thank you all you know it's like a room to room party you just go room to room and it's always a new setting but we're bringing the party along because it's enacted it's not that there's a room of researchers or a community that's waiting for us to be onboarded onto we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.03,
    "end": 4625.536,
    "text": " co-domesticating each other and creating the community that we want to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.796,
    "end": 4629.321,
    "text": "So that's self-organization and multi-scale organization in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.861,
    "end": 4633.125,
    "text": "And we can think about that actually tying it back to this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.746,
    "end": 4639.814,
    "text": "So the active inference framework under special cases, which were described in this slide,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.96,
    "end": 4656.937,
    "text": " can think about a few different cases where certain things are driven to zero so when there's no uncertainty about states in other words states of the world can be perfectly known then risk sensitive policies can be enacted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.092,
    "end": 4663.236,
    "text": " So when there's no ambiguity about states, you can talk about risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.696,
    "end": 4664.697,
    "text": "That's this part right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.258,
    "end": 4670.582,
    "text": "However, when there is ambiguity about states, you have to reduce that uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4671.082,
    "end": 4676.667,
    "text": "And that's sort of like, if you don't know what the states of the system are, you can't operate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4677.287,
    "end": 4685.834,
    "text": " But to the extent you have reduced ambiguity about the observations in the States, you're able to increasingly plan risk sensitive policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.274,
    "end": 4699.806,
    "text": "So Scott, that makes me think about in a world of digital transactions where we can have reduced uncertainty about certain types of events happening, could we then move some of that energy and focus to risk aware policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4700.246,
    "end": 4701.347,
    "text": "So that's one piece here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.007,
    "end": 4705.07,
    "text": "That's why I call what we have right now a self-boiling ocean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.423,
    "end": 4706.683,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.243,
    "end": 4709.865,
    "text": "So that's the saddle meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.125,
    "end": 4715.367,
    "text": "This is still within the context of how most people think about ambiguity and uncertainty, VUCA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.568,
    "end": 4719.629,
    "text": "That's in the terms of minimization of two different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.869,
    "end": 4721.69,
    "text": "Minimize uncertainty, minimize risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.09,
    "end": 4725.312,
    "text": "First, go ahead and reduce your uncertainty about the states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.672,
    "end": 4730.294,
    "text": "And then to whatever extent you can do that, reduce our uncertainty about the future vis-a-vis reducing risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.714,
    "end": 4731.915,
    "text": "That's the normal framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.001,
    "end": 4735.542,
    "text": " for most people, or at least it's one way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.102,
    "end": 4753.991,
    "text": "But now let's think about it, active inference, not just in a risk control way, but in this Bayesian statistical framework, a variational framework where we're actually doing not just a double minimization, but we're doing like a push pull with minimization and an exploration simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.511,
    "end": 4757.955,
    "text": " So we're gonna be able to dynamically adjust explore, exploit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.015,
    "end": 4766.484,
    "text": "It's not exactly explore, exploit as we talked about, but it's like explore, exploit because we can dynamically adjust the relative pressure or weighting of the in and the out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.945,
    "end": 4770.989,
    "text": "So we're always exploring and we're also always reducing our uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.133,
    "end": 4772.693,
    "text": " about the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.274,
    "end": 4781.199,
    "text": "And so that's why the two arrows are moved into an overlapping area, just graphically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.479,
    "end": 4791.725,
    "text": "This is just a loose graphical model here because it's not a disjoint two-step process, ambiguity about states, and then ambiguity about risk if we have certainty about states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.305,
    "end": 4795.728,
    "text": "This is the co-joint estimation of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.548,
    "end": 4798.73,
    "text": " all these pieces together in a way that's a push-pull.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.09,
    "end": 4804.854,
    "text": "So there's a couple paradigm-changing ways of framing risk and operating in this mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.694,
    "end": 4812.699,
    "text": "And that will, it'll lead to different types of institutional structures that'll be distributed, which will resemble neighborhood watch.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4812.979,
    "end": 4815.901,
    "text": "But it won't just be neighborhood watch, it'll be neighborhood creation as well.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4816.806,
    "end": 4817.947,
    "text": " That's a fundamental change.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4818.347,
    "end": 4818.787,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.867,
    "end": 4828.691,
    "text": "Instead of just putting up the law and like a trip wire and then triggering it, you could say, how do we just have people who are going on a neighborhood walk, just people walking the neighborhood?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.731,
    "end": 4832.293,
    "text": "It's like, you know, like they could just having fun and being social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.433,
    "end": 4834.294,
    "text": "Could that be the actual thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.114,
    "end": 4839.237,
    "text": " And so it fuses several of the previous ways of thinking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.517,
    "end": 4842.139,
    "text": "Well, we're going to reduce our uncertainty about what's happening in the neighborhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.519,
    "end": 4844.821,
    "text": "And then we're going to do a risk minimization policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.201,
    "end": 4847.602,
    "text": "Well, this makes you think about installing surveillance cameras.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.043,
    "end": 4857.889,
    "text": "But what if you said we're going to jointly be discovering what community norms we have and what we want to be aspirationally as a neighborhood around safety or around communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.53,
    "end": 4864.814,
    "text": "And maybe there's a way where we can just go on walks in the afternoon and all of a sudden people are connecting and it's a safer world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.674,
    "end": 4875.899,
    "text": " And the other just one other thing I once read an article about the world champion fly tie tire and he tied flies and they were the most successful flies for catching fish.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4876.639,
    "end": 4881.341,
    "text": "But all the people complain that his flies didn't look like actual insects.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4881.421,
    "end": 4882.382,
    "text": "They didn't fool humans.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4882.422,
    "end": 4883.762,
    "text": "And he said, I don't have to fool the humans.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4883.802,
    "end": 4884.763,
    "text": "I just have to fool the fish.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4886.164,
    "end": 4890.666,
    "text": " And so the reason I say that here is the way we're going to do this is we're going to use the left side.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4890.706,
    "end": 4893.027,
    "text": "We're going to get people in by saying, hey, you got risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4893.248,
    "end": 4894.568,
    "text": "What have you been doing about the risk?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4894.608,
    "end": 4895.589,
    "text": "Let's talk about the risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4895.649,
    "end": 4896.489,
    "text": "OK, that's fine.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4896.849,
    "end": 4901.952,
    "text": "We're going to get other people in the room who are going to be talking about the same risk, but people never met each other before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4902.532,
    "end": 4905.614,
    "text": " And then by the time they leave the room, they're going to be in the right-hand side of the design.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4905.854,
    "end": 4907.355,
    "text": "That's how the governance is going to shift.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4907.375,
    "end": 4911.738,
    "text": "We're going to hook them with something they recognize, like the fish guy.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4911.758,
    "end": 4914.7,
    "text": "We're going to hook them with the thing on the left, which is, hey, risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4914.72,
    "end": 4915.42,
    "text": "We're going to talk about risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4915.44,
    "end": 4919.023,
    "text": "That's what the Atlas of Risk – I'll send it around to the other folks, but some of you have it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4919.543,
    "end": 4923.546,
    "text": "It's 870 different information risks that are shared by people now because –",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4924.326,
    "end": 4926.688,
    "text": " Digital stuff has made everybody have trouble.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4927.168,
    "end": 4936.255,
    "text": "So they come for the risks they know, but by the time they leave, they're going to be organized into different groups that aren't going to be dealing with the risks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4936.435,
    "end": 4940.198,
    "text": "The existing risk description was just a way to get them in the room.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4941.468,
    "end": 4941.748,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.448,
    "end": 4942.708,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4943.088,
    "end": 4950.451,
    "text": "So one metaphor before, Stephen, instead of let's measure your blood, measure your blood, measure your blood so that we can measure your risk of the disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.891,
    "end": 4959.053,
    "text": "This is like, how could we be doing active inference on health and working towards health in a way that, yeah, maybe we'll do a measurement here or there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4959.573,
    "end": 4962.134,
    "text": "And we do want to reduce risk and we will reduce risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.694,
    "end": 4973.577,
    "text": " but we're actually framing it in a way that's like a journey related to health in mind, rather than ambiguity, risk, disease, negative, negative, negative, uncertainty, anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.978,
    "end": 4980.34,
    "text": "How about yin and yang with a little bit of a more balanced understanding about how we can function and enact policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.56,
    "end": 4980.84,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.44,
    "end": 4984.321,
    "text": "This is a very important diagram, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4985.555,
    "end": 5013.85,
    "text": " like you're saying this this takes us away from just trying to reduce uncertainty about the external stimuli and the kind of locked in risk aversion and you're actually working more with that time dependent or time series um approach that active influence gives of like well how are things changing and how just like that fish looking at the at the fly how does that um embodied agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.31,
    "end": 5020.292,
    "text": " And the wisdom and recognizing that there's a wisdom about how to be in the world and how to be with your niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.652,
    "end": 5029.876,
    "text": "How is that actually being used to inform how we make things happen and not just this more mechanical approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.36,
    "end": 5051.153,
    "text": " yes and good points there um in active inference stream 19 yonder in mid april uh we're gonna have deeply felt affect which is one of the papers that was cited in this paper but we're gonna go into it in more detail we'll talk about perception about anticipation action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.533,
    "end": 5055.735,
    "text": " Metacognition, implicit metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.576,
    "end": 5060.279,
    "text": "And just to close out, I listed a few questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.4,
    "end": 5065.764,
    "text": "Do people want to hang out for a few more minutes and talk for a little bit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5065.844,
    "end": 5069.587,
    "text": "Yeah, it sounds good, but I'll just give the closing slide and then we'll return to the question slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.047,
    "end": 5071.949,
    "text": "Thanks everyone for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.209,
    "end": 5077.434,
    "text": "The live viewers have a link to a feedback form in the event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.954,
    "end": 5079.976,
    "text": "Everyone else really thanks so much for 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5081.517,
    "end": 5107.024,
    "text": " super special and unique experience for all of us so really deeply appreciated for those watching live or in replay or whenever wherever it was great times so thanks a lot and we're just getting started so for a little bit longer whoever wants to stay and if you want to leave just just no worries just drop off but um what's something that somebody wants to go into here or what's something that still people want to bring up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.748,
    "end": 5143.812,
    "text": " One of the things I'm wondering about is just the, we've been taking this from a single individual perspective to some extent, and in those group perspectives, it's interesting that the simultaneity of all of it, that you simultaneously have an individual, how do we get a handle, how do we help people get a handle on the many levels that operate simultaneously, and then",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5145.7,
    "end": 5174.045,
    "text": " one of the then then how do we bring that to the current time the now where everyone is acting in this moment you know reading another paper now in fractal time and they said hey the past and the future don't exist if they do where are they show me right so the idea is now is all that exists so we have these priors which were that and we have these future projections which are that but we have the now and we all act in the now and all these myriad",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5175.202,
    "end": 5177.663,
    "text": " dynamics feed into the now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5179.153,
    "end": 5185.877,
    "text": " And so it's such an interesting notion to me of how to trim tab systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5185.957,
    "end": 5188.379,
    "text": "As a lawyer, we don't just observe.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5188.399,
    "end": 5191.281,
    "text": "We're always trying to push things in one direction or another for clients, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5191.941,
    "end": 5192.922,
    "text": "Or for whatever.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5193.482,
    "end": 5197.545,
    "text": "And so it feels like it's such an interesting thing that we have.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5197.685,
    "end": 5198.745,
    "text": "It's not just a now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5198.805,
    "end": 5201.467,
    "text": "We have a series of nows available to us, I guess.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5201.687,
    "end": 5204.289,
    "text": "Because in the diagram, you see a series of nows, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5204.569,
    "end": 5205.79,
    "text": "In the steps.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5206.87,
    "end": 5207.011,
    "text": "So...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5208.533,
    "end": 5215.856,
    "text": " It's interesting to that temporal aspect is something that's just not brought into so many systems, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5215.876,
    "end": 5217.537,
    "text": "They're so static in so many ways.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5217.877,
    "end": 5225.62,
    "text": "And so in a sense, like when you work with standards people, they'll say, oh, it has to be robust so that we can plan based on it, but it also has to be flexible.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5226.42,
    "end": 5233.763,
    "text": "And it feels like this naturally, this analysis naturally lends itself once it becomes an institutionalized thing, because our institutions now are not",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5234.423,
    "end": 5263.753,
    "text": " built on these analyses but once they're built on the dynamics when they're built on i'll use the word uncertainty but it's really embracing uncertainty or as i said in 2014 i called it entropy engines we were actually mining disorder in order to create order so anyway just a couple of things that thoughts that came to mind it feels like that time issue is relevant to our understanding how we can mine disorder cool stephen",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5266.755,
    "end": 5269.401,
    "text": " Yeah, the time issue is definitely a big part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5269.521,
    "end": 5271.085,
    "text": "And we see that with these papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.125,
    "end": 5272.688,
    "text": "We've seen that there's the narrative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.75,
    "end": 5297.342,
    "text": " there's the reflective and now they're trying to get into the pre reflective more and traditionally that's been you know meditation but what is the way that we understand these different timescales and I what I'd be interested in is is how does this link in with affordances I think there's something really interesting about that niche and the affordances in a niche because it gives away",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5298.402,
    "end": 5300.684,
    "text": " Because it's sort of permanent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5300.824,
    "end": 5307.108,
    "text": "The path could still be there, the cups can still be there, yet my interaction with it can vary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.388,
    "end": 5316.014,
    "text": "So I think that that's a really interesting way that experiments can tie a lot of this information or knowledge together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5317.071,
    "end": 5317.271,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.712,
    "end": 5323.676,
    "text": "So one idea we've talked a lot about is the idea of attracting sets or attracting states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.257,
    "end": 5330.402,
    "text": "So for the perspective of your body with regards to temperature, you want to be attracting back to core body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.902,
    "end": 5334.625,
    "text": "Excursions outside of that range are not just bad, they're lethal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.065,
    "end": 5336.887,
    "text": "So attracting states are really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.367,
    "end": 5342.911,
    "text": "And just like you can have attracting sets of states on a single number line, like temperature, you can have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.712,
    "end": 5370.438,
    "text": " in the wandering itinerant dynamics of thought you can have attracting thoughts and you can ruminate and you get too attracted or it can be too precise but it's an idea that people could be familiar with or not that attracting states can be thoughts so let's think about active inference the framework as an attracting state as something where we can in a room bring up these ideas and refocus the discussion or potentially expand or zoom in so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.218,
    "end": 5374.701,
    "text": " we've brought up this multi-scale and the deep past and the deep future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.721,
    "end": 5379.064,
    "text": "So it's multi-scale through space, like the nested systems, and then there's multi-scale through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.364,
    "end": 5382.186,
    "text": "There's molecules vibrating and then there's longer term things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.827,
    "end": 5387.29,
    "text": "So let's start with the multi-scale space and time just being our starting position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.751,
    "end": 5389.292,
    "text": "And then Active Inference goes further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.452,
    "end": 5393.355,
    "text": "It says, not just is it going to start being multi-scale in space and time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.795,
    "end": 5397.899,
    "text": " But there's going to be non-linearity and uncertainty because there are causes in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.28,
    "end": 5403.125,
    "text": "So RJ and his alarm clock and his dog and something that you wouldn't expect changed in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.265,
    "end": 5407.39,
    "text": "And that changed another part of the world that you basically wouldn't have expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.691,
    "end": 5413.316,
    "text": "And also our action is always going to be constrained by our situational affordances in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.636,
    "end": 5423.865,
    "text": " So to Steven's point there, which is like, it's all good to think about objectively what's happening, but constrained by affordances in the niche that we're actually in is the operating conditions we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5424.306,
    "end": 5427.368,
    "text": "So it makes sense to at least ground the discussion in the affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.069,
    "end": 5437.638,
    "text": "And then we're presented with attracting set of questions like, how will we work together to be agents in a system of the type we would like to see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5438.991,
    "end": 5447.615,
    "text": " That's a question that in various settings, people could say, oh, well, we don't have clarity on what kind of system we want to be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.975,
    "end": 5451.496,
    "text": "We need to reduce our uncertainty about what kind of system we're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.996,
    "end": 5455.398,
    "text": "That's visioning and clarifying mission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.058,
    "end": 5461.201,
    "text": " But then there's other times where people say, yeah, how do we be the agents of this kind of a system that we want to be in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.541,
    "end": 5465.823,
    "text": "So we're not uncertain about the mission, about the end cybernetically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.283,
    "end": 5475.949,
    "text": "But I'm just like honestly confused about what next role I should take in this system to make this happen according to this mission that we've laid out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.469,
    "end": 5479.47,
    "text": "And if my actions are consistent with the mission as we've laid it out, then they're good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.911,
    "end": 5481.732,
    "text": "But if they're not, then they're just not helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.62,
    "end": 5505.911,
    "text": " So we can start to combine a lot of these ideas and realize hopefully that whether we go deep into the physics side or into another aspect of active inference, we'll use it as an attracting set and as this range in phase space where we can bring the discussion and help ground it in the multi-scale insights in the non-linearity of the world and a few other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.612,
    "end": 5510.073,
    "text": "But I think it's really, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.793,
    "end": 5511.734,
    "text": "And they really are.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5512.478,
    "end": 5521.602,
    "text": " They really are that, like, we start our diagram with entities that have priors, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5521.642,
    "end": 5528.245,
    "text": "We're not starting, I mean, you could start with no priors, and you're just wandering around in the dark in the woods.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5529.286,
    "end": 5535.509,
    "text": "But we're starting with a system that has something that we comparing the reality to, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5535.569,
    "end": 5538.63,
    "text": "So they're trying to minimize the difference between their expectation and reality.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5538.69,
    "end": 5539.751,
    "text": "Is that the free energy notion?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5540.987,
    "end": 5541.167,
    "text": " Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5541.267,
    "end": 5547.753,
    "text": "So so sculpting expectations at the front end is what education is an experience.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5548.113,
    "end": 5548.333,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5549.174,
    "end": 5555.579,
    "text": "And so, you know, and when we can, you know, our system is our educational system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5555.599,
    "end": 5558.802,
    "text": "The United States is set up for after the based on the Prussian revolution.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5559.395,
    "end": 5584.622,
    "text": " school system right that's the um these the de-schooling society book by um illich um so where our expectation is industrial workers well now we don't have industrial workers only we have service workers and so our educational system is not serving our folks for instance right so we have these um the those influences it's the the i guess the the thing that's",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5585.763,
    "end": 5592.948,
    "text": " the thing I keep coming back to, it's like a situated cognition that we situate our cognition and externalities.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5593.048,
    "end": 5597.051,
    "text": "Well, those externalities also have our entities that have Markov blankets.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5597.111,
    "end": 5600.233,
    "text": "You know, right now we're thinking together, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5600.253,
    "end": 5601.174,
    "text": "This is like Plato.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5601.274,
    "end": 5603.696,
    "text": "You said, you know, dialogue lets us query consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5603.716,
    "end": 5604.396,
    "text": "So we're doing that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5606.938,
    "end": 5611.581,
    "text": "And each of us has our own view on, on the direction of this thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5611.801,
    "end": 5612.002,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5612.122,
    "end": 5612.542,
    "text": "But they're,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5612.952,
    "end": 5614.974,
    "text": " So we're not interacting with static things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5615.174,
    "end": 5617.696,
    "text": "We're interacting with dynamic things that have their own dynamics.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5617.816,
    "end": 5627.664,
    "text": "And the recruitment of those populations is, I think, a lot of what happens in legal concepts.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5627.804,
    "end": 5634.529,
    "text": "It's what right now, I think the things we're doing right now could make a big impact on ethics discussions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5635.91,
    "end": 5642.115,
    "text": "Because ethics, anything that's not written down in law but is bad is now called an ethical problem.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5643.001,
    "end": 5643.201,
    "text": " Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5643.381,
    "end": 5651.565,
    "text": "It's just ethics is carrying a lot of water right now for anxieties of people generally with the technologies and exponential increase in everything.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5651.985,
    "end": 5663.029,
    "text": "So it feels like we have an opportunity for intervention because there is a vacuum of meaning in the current institutions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5663.209,
    "end": 5666.651,
    "text": "And it feels like this kind of explanation might be a nice way to get a toehold there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5667.403,
    "end": 5668.864,
    "text": " Let me build on that, Scott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5668.904,
    "end": 5677.79,
    "text": "So there was a book I read called Legal Systems Very Different From Our Own by a fellow with the last name of Friedman, but it is not myself or a relative directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.411,
    "end": 5692.841,
    "text": "And it really does a great job of capturing how different legal systems from informal like criminal or prison legal systems, justice systems, using the term quite broadly to different world traditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.701,
    "end": 5698.005,
    "text": " very, very different processes that they followed, but also they had different ends in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5698.565,
    "end": 5708.273,
    "text": "Now, the current operating environments, not just are we being confronted with different interfaces mixing that hadn't combined before, but also there's new challenges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5708.854,
    "end": 5717.201,
    "text": "And so that's sort of like there was a two-stroke engine and a two-stroke engine and a two-stroke engine, and they all were kind of coupled in a way where they all were working internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.801,
    "end": 5720.463,
    "text": "And now they're being cobbled together and there's a lot of heat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5721.204,
    "end": 5722.665,
    "text": " informationally, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5723.046,
    "end": 5728.951,
    "text": "There's a lot of parts that can burn because there's so much heat being wasted with the interfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.532,
    "end": 5735.217,
    "text": "And so can three two stroke engines be simply rewired into a six stroke engine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.297,
    "end": 5736.938,
    "text": "Well, no, it doesn't really work that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.599,
    "end": 5741.342,
    "text": "How can you link those engines together into a system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.023,
    "end": 5750.788,
    "text": " And that's really the question we're addressing here is narratively, linguistically, memetically, but just formally as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5751.349,
    "end": 5766.818,
    "text": "How will these different systems get cobbled together so that we're actually connecting the gasoline to the car moving in forward one direction and in one piece, not taking gasoline and making something that's just combustible, but only hurting people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.839,
    "end": 5768.679,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5768.919,
    "end": 5771.521,
    "text": "This is where I suggested people read Flatland.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5773.089,
    "end": 5775.231,
    "text": " because it's the adding of dimensions, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5775.251,
    "end": 5786.398,
    "text": "You add, Mr. Sphere comes in and lifts Mr. Square up and he can see through, you can untie a knot in the upper dimension without crossing the knot, the rope, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5786.959,
    "end": 5790.321,
    "text": "So in law, what we do is you create a new dimension.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5790.501,
    "end": 5797.926,
    "text": "So there was a time when we didn't have credit cards and people used to run IOUs at the bar and things like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5798.647,
    "end": 5799.468,
    "text": "It just didn't exist.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5800.433,
    "end": 5804.415,
    "text": " And so credit cards now serve this huge function.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5804.976,
    "end": 5808.177,
    "text": "They de-risk huge swaths of interactions, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5808.377,
    "end": 5809.978,
    "text": "But at one point, they just didn't exist.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5810.459,
    "end": 5814.561,
    "text": "And this guy, Dee Hock, wrote a book called The Birth of the Chaotic Age.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5814.941,
    "end": 5817.382,
    "text": "And it's kind of a crappy book, but it's kind of an interesting notion.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5817.743,
    "end": 5819.343,
    "text": "The banks were like, no, no, no, no, no.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5819.364,
    "end": 5820.364,
    "text": "We don't want your credit cards.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5820.404,
    "end": 5820.964,
    "text": "Go away.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5821.044,
    "end": 5821.485,
    "text": "Get out of here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5821.505,
    "end": 5822.345,
    "text": "It was a paradigm shift.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5823.026,
    "end": 5829.149,
    "text": "And then eventually they got the credit cards, got in, and now try taking the credit card fees away from the banks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5829.867,
    "end": 5831.907,
    "text": " So what was impossible becomes inevitable.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5832.708,
    "end": 5847.031,
    "text": "And it feels like because things are so stuck, this kind of approach that we're talking about when taken in markets and institutions is going to that extra dimension of credit cards or swaps freeze up.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5847.191,
    "end": 5858.033,
    "text": "It allows for these interactions to take place, just like the extra dimension in Flatland allowed for Mr. Square to get new perspectives on his life and his existence.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5859.062,
    "end": 5866.43,
    "text": " So it's a really, it's a fundamentally different, and that's why it's so interesting, the Markov blanket nesting,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5867.819,
    "end": 5868.74,
    "text": " gets really interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5868.8,
    "end": 5871.862,
    "text": "Which Markov blanket can nest within another one?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5872.563,
    "end": 5885.012,
    "text": "And when you have communities of interest, one of the things I always remind people of in New York, for instance, you have Little Italy, you have Chinatown, you have different areas where people go together because their Markov blankets, their language is easier.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5885.032,
    "end": 5887.654,
    "text": "It's easier to communicate, lowers the cost of communication, lowers the risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5888.115,
    "end": 5892.898,
    "text": "You also have the jewelry district, the flower district, and the cookware district.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5893.459,
    "end": 5895.12,
    "text": "Economically, people cluster together.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5895.14,
    "end": 5897.342,
    "text": "So communities of interest, they're co-locating.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5897.822,
    "end": 5911.065,
    "text": " Well, here, if we look at your diagram with the four states, you know, the two states on left, two states on right, everyone is now going to communities of interest based on the dynamics or rigidity of that left-hand two states.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5911.625,
    "end": 5912.966,
    "text": "You know, oh, do you share a risk?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5913.066,
    "end": 5914.506,
    "text": "Do you share a solution?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5915.466,
    "end": 5922.028,
    "text": "But what if we could have communities of interest accumulated based on their capacity for change instead or something like that?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5923.231,
    "end": 5935.939,
    "text": " Just to raise one really important piece then, Stephen, is when people align around on the left side of that figure, reducing risk or shared policy or shared culture, it's often a similarity clustering, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5936.36,
    "end": 5940.763,
    "text": "So people often cluster based upon similar needs, similar understanding of the world, similar affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.363,
    "end": 5950.126,
    "text": " But let's imagine the reality of the organism, which is that actually it's a clustering on the opposite in some senses of disjoint abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5950.726,
    "end": 5955.147,
    "text": "So in this context of the body, if you said, well, there's one kind of cell, it can't move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.567,
    "end": 5959.949,
    "text": "It just holds a bunch of fat and it literally just does hormone and fat processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5960.549,
    "end": 5966.011,
    "text": " And there's another kind of cell that will just dry out in a second in the sun, but it can contract once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5966.031,
    "end": 5970.874,
    "text": "And there's this other kind of and it's like you'd say they're not going to live in the same neighborhood together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5970.894,
    "end": 5971.914,
    "text": "It's like, oh, wait, no, they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.134,
    "end": 5972.815,
    "text": "That's the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5973.635,
    "end": 5976.516,
    "text": "And so how are we going to interpret this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.036,
    "end": 5982.039,
    "text": "All the levels of what it means to be a person economically and culturally and psychologically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5982.899,
    "end": 6006.158,
    "text": " and understand that it's neither simple affinity nor simple disaffinity on any scale that will lead to function because function and the islands of function are rare in the almost unimaginably large state space of possible legal codexes or possible programmings that could be done or possible personalities it's like there's more ways to fail for far from equilibrium systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.858,
    "end": 6010.259,
    "text": " And selection is the hand that just keeps on sweeping the ones that aren't working off the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.739,
    "end": 6014.34,
    "text": "So if we don't want to get swept off the table, we're going to be working together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.72,
    "end": 6021.622,
    "text": "That means coming together across our differences so that we can have these non-linear successes as larger systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6022.262,
    "end": 6023.762,
    "text": "Not the largest system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6023.842,
    "end": 6027.543,
    "text": "It's not a simple imperative, but at the largest level that accomplishes our mission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6027.903,
    "end": 6029.784,
    "text": "So just such interesting topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.044,
    "end": 6030.264,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6033.294,
    "end": 6052.001,
    "text": " yeah and this well just like you were just saying there about these different cultures and the niche construction i think this can help there's a lot of problems in terms of discourse around this not more broadly in the world and i've like when we talk about systems out there in like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6053.124,
    "end": 6080.136,
    "text": " cities but then well how much is a system how much has been an evolving niche construction some of which is constructed in this kind of linear you know this kind of teleological strategic way from above and and geographical way but and um but also some of it's just because that's the way it's evolved over time with some of this like we say these dynamics which i think haven't really been brought in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.076,
    "end": 6096.117,
    "text": " or if they are brought in they kind of ends up in the arts and it it all gets framed in whichever metaphor a particular sort of school is applying and that you can get trapped by that and i think this this actually came up for me today so just like you're talking about the indigenous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6098.006,
    "end": 6111.862,
    "text": " ways you could have a governance or other ways is I think that we have this idea of systems and these different systems and how do we integrate them and is this assumption that they we need to be integrating them but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6113.01,
    "end": 6134.395,
    "text": " like these indigenous systems you know it flips from one to the other so for instance we have our western system which seems to be like and we need to attack our system is quite a sort of a progressive leftist approach or we need to all revert to some sort of native indigenous system and they had it right and the body knows everything and if we just listen to our body and there's this kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6135.967,
    "end": 6142.769,
    "text": " gap whereby how do you find a way which is kind of maybe configuring different approaches?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6142.809,
    "end": 6159.914,
    "text": "So it's like, okay, well, where can we configure the other ways of knowing, the other ways of governing, other ways of, and it's not just a case of like mash them together because they may just have a completely different dynamical process and then they don't integrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6160.174,
    "end": 6164.495,
    "text": "They just do different things at different times like cells do in the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6166.115,
    "end": 6169.279,
    "text": " Of course, it's all going to come down to the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6169.399,
    "end": 6177.427,
    "text": "So, you know, none of these metaphors or, you know, questions are even the beginnings of the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6177.808,
    "end": 6184.195,
    "text": "But yes, that's definitely where we want to be understanding at that level of societies is understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6185.174,
    "end": 6186.894,
    "text": " how much formal integration will there be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6187.374,
    "end": 6193.536,
    "text": "Now, if somebody says, I designed the interface for different operations, that is still coming from a cultural context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.056,
    "end": 6208.399,
    "text": "So the challenge and part of the quest will be to frame that interface in a way that doesn't pretend that it has the neutral arbiter ability, because that's actually one of those universalist fallacies that were fallen into by abstractionists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.426,
    "end": 6213.471,
    "text": " Now we want to be grounded in action and still talk about an interface for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.051,
    "end": 6219.117,
    "text": "And so I think actually that's why the task may be easier than the thought",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.006,
    "end": 6223.028,
    "text": " bringing together could be the action bringing together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.048,
    "end": 6232.314,
    "text": "I'm always reminded of Scott's example that he told me a long time ago with two lumber yards that are competing in the market for selling lumber, but then they have the same insurance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6232.755,
    "end": 6240.62,
    "text": "And then I was like, wait, they also could have the same internet provider and they could pay taxes to the same local government and they could have the same lunch service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6240.76,
    "end": 6243.081,
    "text": "It's like everything except for lumber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6243.542,
    "end": 6245.243,
    "text": "So it's like, how many fronts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6245.803,
    "end": 6247.344,
    "text": "They might even share a fence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6248.405,
    "end": 6249.346,
    "text": "So many areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6250.086,
    "end": 6273.755,
    "text": " so they're almost collaborative on more fronts than not and so how do we take this understanding that on overwhelming number of our edges and even for each edge on most of the domains there's just massive areas where we're in alignment and then risk can be catastrophic so it's like if we just reduce the amount of cascading failures in the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6275.086,
    "end": 6282.148,
    "text": " by playing to our strengths in the areas where we are aligned, maybe all of a sudden now the lumberyard people, it's like, oh, you like this kind of wood?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.208,
    "end": 6282.928,
    "text": "I like this kind of wood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.968,
    "end": 6287.989,
    "text": "We should just niche partition, but we're not gonna go niche partition and fork and never talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.509,
    "end": 6294.05,
    "text": "If you're gonna be selling the luxury and I'm gonna be selling the consumer wood, we need to have a better communication interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6294.251,
    "end": 6297.751,
    "text": "Oh, you have employees who speak this language and I have employees who speak this language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6297.791,
    "end": 6304.253,
    "text": "Well, let's make an agreement that we're gonna send numbers back and forth in this file type on these dates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6304.753,
    "end": 6306.534,
    "text": " and here's who we're gonna go to if that doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.954,
    "end": 6312.698,
    "text": "It's like, wow, these two companies were fighting on the market in a previous or a different paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6312.758,
    "end": 6320.863,
    "text": "They might've been wasting money on advertising or committing different sort of gray zone interferences with each other's operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6321.323,
    "end": 6324.625,
    "text": "But just by reframing it in this multi-scale system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6325.706,
    "end": 6340.277,
    "text": " Even if you're not doing a government change, whatever government system there is, those two lumber yards now have a new way of talking to each other, to their employees, with their lawyers, whatever, potentially in a way that could lead towards them working together better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6340.937,
    "end": 6342.418,
    "text": "So that's just very powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6342.438,
    "end": 6344.92,
    "text": "I think that's what will be cool to continue returning to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6346.101,
    "end": 6351.245,
    "text": "And we're moving there really from a zero-sum game to a non-zero-sum game.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6352.919,
    "end": 6354.08,
    "text": " There's a winner and loser.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6354.36,
    "end": 6356.622,
    "text": "And what you do, that's why I always think of that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6356.662,
    "end": 6362.246,
    "text": "You add the dimensionality and it recasts the game as not a winning and losing game.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6362.966,
    "end": 6364.568,
    "text": "And that's what we have to do in Gaia theory.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6365.208,
    "end": 6372.013,
    "text": "If you want to save the world from us, we have to recast the game as the entire game.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6373.28,
    "end": 6376.203,
    "text": " The Sustainable Development Goals, even the UN has them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6376.604,
    "end": 6378.586,
    "text": "They're even tripping over them because they have some.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6378.966,
    "end": 6388.696,
    "text": "They had one power plant they developed, the Gujarat Power Plant in Bangladesh, and they scored big score on energy SDG and on development SDG.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6389.056,
    "end": 6394.362,
    "text": "And then they got sued by the local fishermen and the local population for pollution, which screwed them on the other SDG.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6394.402,
    "end": 6396.123,
    "text": "They didn't even talk among the SDGs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6397.083,
    "end": 6419.159,
    "text": " the un now that's not surprising if you know the un and the institution but it shows you that it's even it's hard to integrate even when you have the the same source of the norms or the or the aspirations they just go for it on one of them and they don't they're not talking to each other right and here's why preventing failure is so critical um which body is healthier",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6420.12,
    "end": 6426.424,
    "text": " each organ system at 90% function or most of them at 99 and one is at zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6426.724,
    "end": 6428.205,
    "text": "Well, that body is dead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6428.765,
    "end": 6432.687,
    "text": "So all of the functions need to be adequate or better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.267,
    "end": 6437.049,
    "text": "And we need to improve adequate, improve resiliency, improve accessibility, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.41,
    "end": 6444.694,
    "text": "But preventing failure cannot be just part of the discussion on reducing risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6445.274,
    "end": 6448.276,
    "text": "Reducing cascading failure has to be an imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6449.056,
    "end": 6456.56,
    "text": " And so in that framework where we want multiple components to be functioning, it just reframes the, oh, should the government be interfering here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6456.58,
    "end": 6458.441,
    "text": "Or should this person be undertaking this policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6458.842,
    "end": 6462.884,
    "text": "And again, like I said, like the task to synchronize on action might be easier than thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.404,
    "end": 6471.969,
    "text": "So those two lumber yards, getting them to go to the same religious institution or send their children the same education or listen to the same YouTube channels, why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6472.55,
    "end": 6477.853,
    "text": "Why even go down that road in the metaphor when you could just offer them a service",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.533,
    "end": 6481.074,
    "text": " where they're de-risking their lumber business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6481.614,
    "end": 6487.017,
    "text": "So instead of saying, we'll synchronize these lumber yard people on this, and then they'll just act nicely together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6487.297,
    "end": 6498.761,
    "text": "It's like, yeah, or you could just provide the interface so that whoever they are, however things change, they'll be able to play nicely together instead of just saying, well, if we synchronize them in this way, then they'll know what to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6498.902,
    "end": 6500.282,
    "text": "They won't because people don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6500.782,
    "end": 6507.045,
    "text": "Well, and that's why one of the things that I talk to people about is I say our recruitment that I'm doing in the program at the lab,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6507.717,
    "end": 6509.938,
    "text": " is not based on selflessness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6510.158,
    "end": 6511.318,
    "text": "It's based on self-interest.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6512.339,
    "end": 6516.961,
    "text": "And the assertion is that they can de-risk in ways they cannot do unilaterally, period.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6518.081,
    "end": 6518.862,
    "text": "That's what I tell people.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6518.902,
    "end": 6519.782,
    "text": "And so you get together.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6519.842,
    "end": 6521.283,
    "text": "So it's a commitment.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6521.343,
    "end": 6525.184,
    "text": "If they want to de-risk in these new ways, they can't do it by themselves, just like a stoplight.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6525.904,
    "end": 6528.786,
    "text": "I didn't send out around a memo saying, let's all stop at the red light.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6528.806,
    "end": 6529.306,
    "text": "That was done.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6530.103,
    "end": 6530.223,
    "text": " Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6530.263,
    "end": 6532.885,
    "text": "These are these are scales that we can't do unilaterally.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6533.525,
    "end": 6546.074,
    "text": "And so that tempting that bait of saying you can go over there and with swaps, Australia swaps were outlawed when they first came out and the banks in Australia were getting killed because they couldn't swap out their interest rate risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6546.674,
    "end": 6550.197,
    "text": "So they lobbied the Australian government to allow for swaps.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6550.297,
    "end": 6554.4,
    "text": "And then they did allow for swaps and they were able to swap out their interest rate risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6555.24,
    "end": 6561.624,
    "text": " Like other banks, the downside is they all then got hurt in 2008 when the swaps were used for speculative purposes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6561.664,
    "end": 6562.644,
    "text": "That's a different problem.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6563.265,
    "end": 6571.99,
    "text": "But that invitation to de-risk in ways you can't do alone, it's a crass way of getting people in the space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6572.31,
    "end": 6576.513,
    "text": "But to me, it's the hook that joins that left-hand side and the right-hand side with those four spheres.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6577.333,
    "end": 6581.215,
    "text": "Because on the left-hand side, you have this characterization of risk as a zero-sum game.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6582.256,
    "end": 6583.197,
    "text": "On the right-hand side...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6584.229,
    "end": 6592.017,
    "text": " Well, maybe it's not a zero-sum, non-zero-sum in that context, but it allows for a bigger dimensionality of de-risking increases when you increase the system size.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6592.717,
    "end": 6596.521,
    "text": "And so if you get those people who are similarly situated together, it's new markets.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6596.561,
    "end": 6598.503,
    "text": "That's what trade associations are.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6599.509,
    "end": 6603.571,
    "text": " Trade associations, people are competing all the potato chips, lumber, it doesn't matter.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6603.971,
    "end": 6607.013,
    "text": "Trade association competitors get together and what do they do?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6607.073,
    "end": 6608.654,
    "text": "Share information and insurance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6608.694,
    "end": 6610.034,
    "text": "Those are the two big things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6610.434,
    "end": 6616.017,
    "text": "They co-insure for whatever risks they share and they can buy insurance cheaper of whatever kind.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6617.018,
    "end": 6621.66,
    "text": "They also share information so they can understand situational awareness better.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6623.2,
    "end": 6625.141,
    "text": "I put up the slide here again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6627.358,
    "end": 6648.297,
    "text": " yeah yvonne so do you have anything you want to add or remark on no just chilling yeah okay continue scott wait weirdly i think we just lost scott's audio in between oh no okay okay okay sorry continue uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6649.005,
    "end": 6652.787,
    "text": " But I was thinking there was some other thing I was going to say, but I can't remember now about that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6653.007,
    "end": 6653.647,
    "text": "Oh, yes, yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6653.667,
    "end": 6655.408,
    "text": "This is an example from the fisheries industry.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6655.948,
    "end": 6659.95,
    "text": "So this Eleanor Ostrom worked very closely with people in the fisheries.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6659.97,
    "end": 6666.273,
    "text": "So a lot of fisheries are designed with Ostrom notions of the commons.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6666.853,
    "end": 6671.776,
    "text": "And one of the things that a friend of mine who works in the – hold on a second –",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6675.942,
    "end": 6679.967,
    "text": " Okay, Stephen, any... Okay, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6680.347,
    "end": 6684.712,
    "text": "One of the guys who works in the fishing industry said they had a problem.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6684.732,
    "end": 6687.876,
    "text": "They have this thing called bycatch, and it's the fish you're not supposed to catch.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6688.116,
    "end": 6692.642,
    "text": "So let's say, I'm going to make up these numbers and the species, but let's say you're allowed to catch 200,000 pounds of flounder",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6694.366,
    "end": 6697.148,
    "text": " but they would orange rockfish or yellow rockfish.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6697.268,
    "end": 6700.229,
    "text": "And if you catch four pounds of that, you have to stop fishing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6700.309,
    "end": 6701.69,
    "text": "It's a protected species.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6702.25,
    "end": 6704.051,
    "text": "You can't fish anymore.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6704.112,
    "end": 6705.192,
    "text": "You can't pay your bills.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6705.232,
    "end": 6706.353,
    "text": "You can't buy the oil.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6706.393,
    "end": 6707.613,
    "text": "You can't send your kids to school.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6708.374,
    "end": 6709.114,
    "text": "You don't, you don't have money.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6709.655,
    "end": 6715.738,
    "text": "So what they did, they were trying to figure out how are we going to protect this orange rockfish or yellow rockfish?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6715.758,
    "end": 6719.94,
    "text": "So what they did is they said, okay, let's pool the allocations of different fisheries.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6720.06,
    "end": 6720.181,
    "text": "So",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6721.121,
    "end": 6726.943,
    "text": " If they had three guys, each had a four-pound allocation, so they can pool it and make a 12-pound allocation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6727.784,
    "end": 6740.708,
    "text": "Then what happens is if one of the people goes out and fishes and catches five pounds of yellow rockfish, he can still fish, whereas he might in the past have had to stop, so he spread the risk out.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6740.748,
    "end": 6745.01,
    "text": "But then what happens is the other fishermen start to be policemen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6745.759,
    "end": 6747.28,
    "text": " because they're cutting into their allocation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6747.7,
    "end": 6752.524,
    "text": "So they go over and they say, hey, hey, hey, use a different size net or don't fish in that area, whatever.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6752.544,
    "end": 6755.466,
    "text": "They share information because he's cutting in.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6755.546,
    "end": 6758.668,
    "text": "It's an economic loss for all of them because they pulled their allocation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6759.448,
    "end": 6763.231,
    "text": "So to me, that's a big deal, that idea.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6763.891,
    "end": 6765.853,
    "text": "Because what they're doing is they're spreading risk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6766.393,
    "end": 6768.234,
    "text": "And when you spread risk, it's like insurance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6768.755,
    "end": 6772.958,
    "text": "If more people have claims out there and my premiums go up,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6773.84,
    "end": 6774.08,
    "text": " Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6774.16,
    "end": 6777.441,
    "text": "So I'm going to encourage things that make things safer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6779.282,
    "end": 6779.622,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6779.662,
    "end": 6781.423,
    "text": "As a stakeholder in that system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6781.923,
    "end": 6797.308,
    "text": "And so similarly here, it feels like when you move to that right side diagram, we're going to have more avenues with which to create information flows among the parties that will actually de-risk better than the left side and make it cheaper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6798.248,
    "end": 6799.729,
    "text": "Stephen, and then I'll have a point on that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6801.889,
    "end": 6820.555,
    "text": " Yeah, I think this use of this diagram could be important because, yeah, in a way, I suppose this diagram on the left, it's like you either just put in laws or to mitigate those risks and challenges or the transdisciplinary tool that we have at our disposal is money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6820.815,
    "end": 6828.377,
    "text": "Money is the thing that everyone uses basically as the transdisciplinary allocation of what to do on projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6828.497,
    "end": 6831.098,
    "text": "And it doesn't, it's probably,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6831.218,
    "end": 6836.881,
    "text": " highly problematic, and there's not really a lot of other things apart from what budget gets allocated that allows that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6836.982,
    "end": 6852.751,
    "text": "So is there a way that this can provide us, and at different scales, because sometimes, yes, it's fairly clean at kind of a national level or, you know, you have your rulers level and the individual, but most stuff's happening in between as we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6853.392,
    "end": 6859.915,
    "text": "How can we somehow get a handle which is not too culturally...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6861.316,
    "end": 6868.299,
    "text": " or metaphorically constructed, but is maybe relatively universal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6868.399,
    "end": 6875.402,
    "text": "I know it's bad to use that term, but I think there's something in that, in being able to say, okay, this is how this information gain is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6875.823,
    "end": 6885.587,
    "text": "This is how this, you know, and now you're starting to have a way to talk about dynamics in ways which aren't normally possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6886.451,
    "end": 6905.036,
    "text": " yeah one thought on that and again to this point about you want to design the Nexus the interface in a way that is inclusive and accessible but respects that not just do people disagree but they have actually different visions and understandings about this whole system that we're in and so here's and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6905.856,
    "end": 6910.777,
    "text": " where we can tie it to this figure and how it could be used to communicate and maybe even organize around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6911.318,
    "end": 6919.42,
    "text": "So on the left side, it leads towards abstraction because it's like, well, let's wait until we're less ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6920.06,
    "end": 6923.921,
    "text": "And then once you have no ambiguity, it's like, well, let's figure out what the least risky policy is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6924.361,
    "end": 6924.861,
    "text": "But guess what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6925.362,
    "end": 6926.522,
    "text": "All the policies have risks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6927.082,
    "end": 6939.11,
    "text": " And even if there was one that somehow had less risk than strictly all the others, there's still black swan events and there's still people with different preferences for a given pipeline for oil or for a given fishing agreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6939.49,
    "end": 6949.437,
    "text": "So the idea that you're going to minimize risk for all parties in a way that they're satisfied with is going to be this quest that you're going to be at the drawing board quite probably forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6950.157,
    "end": 6951.857,
    "text": " Let's contrast that with the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6952.278,
    "end": 6961.12,
    "text": "And, you know, the authors, I hope, will be okay with us taking wide latitude because, you know, we're taking this figure beyond what it's framed, but that's what's fun, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6961.8,
    "end": 6969.662,
    "text": "Now, let's go to that drawing board with the power plant and the fissures and the ostrum and everything like that instead of just getting frozen on the drawing board on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6970.082,
    "end": 6973.082,
    "text": "So now I'm on the right side, and we're saying, look, we are at the drawing board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6973.563,
    "end": 6979.144,
    "text": "So whether we're speaking through a translator or you believe that we have different interests, we're here at the nexus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6979.804,
    "end": 6983.725,
    "text": " So universal aside, what's locally going to be working for our system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6984.166,
    "end": 6985.766,
    "text": "Well, we have two imperatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6986.226,
    "end": 6997.391,
    "text": "We want to make maximum information gain, but we want to maximize, if you look at that ISO given P, it's not information gain on the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6997.871,
    "end": 6999.091,
    "text": "That's this part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6999.391,
    "end": 7000.712,
    "text": "See how it's strictly in the O?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7001.192,
    "end": 7003.433,
    "text": "Here's ambiguity about state observations, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7004.696,
    "end": 7011.297,
    "text": " This is maximizing information gain on states and observations given policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7011.958,
    "end": 7018.979,
    "text": "In other words, we're not just reducing our ambiguity about states of the world, like give me a more accurate stock ticker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7019.599,
    "end": 7026.721,
    "text": "This is like, hey, what's the most informative policy that we can enact to learn about the states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.341,
    "end": 7031.262,
    "text": "So we wanna query the markets in a way that isn't just getting increased precision on viewing them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7032.122,
    "end": 7034.084,
    "text": " And so now we're all at the table together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7034.184,
    "end": 7053.159,
    "text": "So whether we believe ourselves to have or actually have adversarial interest in one dimension of 300 or all the dimensions or whatever, we have an expansive maximization growth oriented goal together, which is implementing policy that helps us understand our system and the mapping between the hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7053.639,
    "end": 7076.01,
    "text": " the observations better together now by doing that we're also engaging in joint action which will prepare us for larger and better action and what are we doing joint action to do well part of it is to be consistent with the kind of system who we believe ourselves to be but the other part the minimization what we're running away from the stick is disorder with respect to the observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7076.73,
    "end": 7086.717,
    "text": " So not with respect to us getting paralyzed about which policy, but we wanna reduce our surprise about our observations in the context of optimal policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7087.017,
    "end": 7089.779,
    "text": "Okay, so here, how much CO2 is there really in the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7089.84,
    "end": 7090.98,
    "text": "And how much do we really make?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7091.04,
    "end": 7092.842,
    "text": "And what would be the riskiest policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7092.922,
    "end": 7094.483,
    "text": "And should we just remove gas cars?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7094.523,
    "end": 7096.584,
    "text": "And I mean, you could go down this rabbit hole forever, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7097.145,
    "end": 7100.327,
    "text": "Here is, here's a predicted trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7100.667,
    "end": 7105.07,
    "text": "Here's different types of models and what they predict about the trajectory of CO2 levels through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7106.051,
    "end": 7109.455,
    "text": " And we want to reduce our uncertainty about that model together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7109.835,
    "end": 7111.356,
    "text": "All kinds of people who believe different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7111.376,
    "end": 7120.645,
    "text": "We're going to reduce our uncertainty purely about observations as we jointly use policy together to learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7121.795,
    "end": 7123.996,
    "text": " It's just such a positive way of framing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7124.796,
    "end": 7128.978,
    "text": "And again, people are still going to disagree, but we're coming to the table together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7129.078,
    "end": 7133.379,
    "text": "So as long as we're not at arms and we're coming to the table together, we don't need to go universal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7133.439,
    "end": 7134.6,
    "text": "We don't need to go culture free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7135.18,
    "end": 7136.62,
    "text": "We just say we're here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7136.8,
    "end": 7140.082,
    "text": "We're figuring this out today for ourselves now and for other people later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7141.442,
    "end": 7142.783,
    "text": "And when you, that's beautiful.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7142.903,
    "end": 7149.445,
    "text": "I mean, I, I can't wait till I have more facility with the concepts because I, what you're describing",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7150.083,
    "end": 7153.484,
    "text": " the processes you're describing are going to become governance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7153.845,
    "end": 7156.306,
    "text": "It's not like we're going to find governance of the processes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7156.906,
    "end": 7158.527,
    "text": "Those processes will be governance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7158.587,
    "end": 7160.287,
    "text": "That's how it's going to happen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7160.768,
    "end": 7164.269,
    "text": "And so the question is, we're on the left side.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7164.309,
    "end": 7165.31,
    "text": "How do we get to the right side?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7165.35,
    "end": 7169.251,
    "text": "What are the stages that we can do to move us over there?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7169.311,
    "end": 7177.915,
    "text": "How do we prepare ourselves as groups to be able to function on the right side in a natural, organic kind of way?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7179.016,
    "end": 7183.278,
    "text": " One of the things that I've been advocating for is collecting practices from the left side.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7184.226,
    "end": 7192.409,
    "text": " but then having groups stare at the practices so you can say, okay, let's, it's basically making different, changing the assembly, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7192.429,
    "end": 7200.852,
    "text": "The disintermediation of the left side has been done by the internet, it's done by COVID, it's done by the big challenges to those systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7200.952,
    "end": 7203.213,
    "text": "They reveal the limitations of those systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7203.913,
    "end": 7205.594,
    "text": "And so the disintermediation is done.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7205.934,
    "end": 7212.937,
    "text": "On the right side, we're going to reintermediate because there is still mediation of the individual components in the system, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7212.977,
    "end": 7213.657,
    "text": "They're brought together.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7214.261,
    "end": 7220.043,
    "text": " but we're re-intermediating with a fundamentally, it's fundamentally different in some ways and in some ways it's quite similar.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7220.663,
    "end": 7231.966,
    "text": "And so one of the things that I'm interested in is trying to find ways to make it so similar that people don't even realize, you know, or they're comfortable with the move to this new framing of analysis.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7232.727,
    "end": 7233.307,
    "text": "Very cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7233.467,
    "end": 7233.867,
    "text": "Yeah, Steven.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7235.287,
    "end": 7236.649,
    "text": " And this ties in as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7236.669,
    "end": 7238.832,
    "text": "Actually, this is so good that you've gone through this diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7238.852,
    "end": 7241.275,
    "text": "So it makes it very much jump out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7241.315,
    "end": 7252.049,
    "text": "But this is like the safe to fail approach of trying to... So if you imagine that policy wheel, the red wheel on the right-hand side, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7252.99,
    "end": 7269.315,
    "text": " active influence knows that that's really our choices that are what we do with our policy we we a lot of what's out there in the world the hidden states you know we only have so much control over so if we're able to almost shift the policies in there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7270.561,
    "end": 7289.594,
    "text": " and knowing that they're safe to shift, so these safe to fail experiments, which is what they talk about with, so if you do safe to fail policies, which means that you can then observe the states, observe what observations, observe the overlaps, observe the dynamics over time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7290.896,
    "end": 7295.798,
    "text": " then you've got an awful lot of new information that you can use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7296.199,
    "end": 7304.202,
    "text": "And obviously the key is not to have something in there which will be, there's this anti-fragile comes into that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7304.723,
    "end": 7306.123,
    "text": "So you can learn as you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7306.143,
    "end": 7311.086,
    "text": "And obviously knowing that there will be certain times when you've got to pull away",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7312.186,
    "end": 7322.329,
    "text": " stick to a risk minimization focus, but it gives a way to talk about that, probably to people from very different views of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7322.749,
    "end": 7322.929,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7322.949,
    "end": 7329.712,
    "text": "So another metaphor there with performance would be like a martial art and the safe to fail and the sparring and the play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7330.032,
    "end": 7336.814,
    "text": "So there's times to play for children and there's times to be serious, but no matter what you're doing, it's always serious because people can fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7337.094,
    "end": 7338.194,
    "text": "If you're walking, you can fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7338.214,
    "end": 7339.915,
    "text": "If you're talking, you can say something mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7340.555,
    "end": 7343.296,
    "text": " If you're holding data, you can lose the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7343.356,
    "end": 7344.877,
    "text": "So everything is very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7345.417,
    "end": 7348.318,
    "text": "And so we need to have that resilience in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7348.858,
    "end": 7359.563,
    "text": "One other way in which this can be used, so this is putting a little bit beside this purely somebody at the table who doesn't want to communicate with us scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7359.603,
    "end": 7362.144,
    "text": "So now we're in a situation where people want to work together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7362.384,
    "end": 7363.964,
    "text": "At least they've bought on to that level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7365.748,
    "end": 7369.45,
    "text": " We're talking about the system and someone just has this figure up, you know, just as they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7370.19,
    "end": 7373.031,
    "text": "And Steven, you said it, like what we control is policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7373.151,
    "end": 7374.612,
    "text": "We control climate policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7374.792,
    "end": 7375.712,
    "text": "You know what we don't control?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7375.992,
    "end": 7376.472,
    "text": "The climate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7376.772,
    "end": 7377.593,
    "text": "But what do we control?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7377.873,
    "end": 7378.873,
    "text": "Our climate policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7378.933,
    "end": 7380.754,
    "text": "We don't control biogeochemical cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7380.934,
    "end": 7383.735,
    "text": "We influence them, but we don't control the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7384.175,
    "end": 7386.817,
    "text": "And so people could be talking and someone's like, well, I want to see this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7386.917,
    "end": 7389.918,
    "text": "Okay, you're talking about C. You're talking about your preference vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7390.598,
    "end": 7393.162,
    "text": " And someone said, or are we talking about the state of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7393.302,
    "end": 7395.064,
    "text": "Are you actually saying that this is how people feel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7395.164,
    "end": 7397.027,
    "text": "Or are you just stating your preferences about the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7397.047,
    "end": 7400.011,
    "text": "Because it's fine if you want to, you know, I want to learn about your preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7400.832,
    "end": 7405.659,
    "text": "And remember, your preferences are the key factor that really go into our policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7406.46,
    "end": 7409.763,
    "text": " but our policy is not the same thing as the states about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7410.264,
    "end": 7412.326,
    "text": "So it's like, okay, now what are the observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7412.346,
    "end": 7414.768,
    "text": "Someone says, no, no, no, actually it's 80%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7415.188,
    "end": 7417.531,
    "text": "So, okay, your inference is that this is 80%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7417.611,
    "end": 7418.912,
    "text": "Is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7418.972,
    "end": 7420.213,
    "text": "Well, here's this observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7420.233,
    "end": 7421.795,
    "text": "Oh, well, this study is biased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7421.895,
    "end": 7422.675,
    "text": "Okay, well, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7422.695,
    "end": 7424.097,
    "text": "Let's, you know, what if it was a factor of two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7424.117,
    "end": 7430.283,
    "text": "So there's so many ways just to have this figure up and someone says, are you sure about that policy selection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7430.703,
    "end": 7432.225,
    "text": " Say, okay, well, it sounds like we're up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7432.245,
    "end": 7435.248,
    "text": "It sounds like we're in the metacognitive world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7435.669,
    "end": 7441.195,
    "text": "We're thinking implicitly about our own group's generative model of this policy decision making process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7442.076,
    "end": 7444.558,
    "text": "And it seems like you're uncertain about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7445.811,
    "end": 7446.912,
    "text": " And what are you uncertain about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7446.952,
    "end": 7448.873,
    "text": "Okay, what could we reduce our uncertainty about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7449.274,
    "end": 7449.994,
    "text": "Is it your preferences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7450.615,
    "end": 7457.4,
    "text": "Is it the way that your preferences and our uncertainty are being combined with the affordances and the niche into policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7457.56,
    "end": 7459.941,
    "text": "That, of course, is the hardest knot to untie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7459.961,
    "end": 7461.102,
    "text": "That's control theory and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7461.563,
    "end": 7463.604,
    "text": "But you can at least say, hey, is it your uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7464.064,
    "end": 7464.865,
    "text": "Is it your preferences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7465.526,
    "end": 7468.047,
    "text": "Is it the niche perception affordances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7469.048,
    "end": 7489.28,
    "text": " not just the preferences but the niche itself e the prior and is that being combined in a way that makes sense to generate policy because if you if you disagree with the policy which part of these was it because that's all that went into it so don't just say you disagree with the policy tell me do you want something to be do you value something that wasn't valued by this policy okay now that we're talking about a given policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7490.18,
    "end": 7493.222,
    "text": " Do we have synchronization, at least coarsely, on the starting state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7493.882,
    "end": 7497.024,
    "text": "Not on all the details, but at least the starting state for our scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7497.624,
    "end": 7499.445,
    "text": "And are we talking about states of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7499.885,
    "end": 7503.187,
    "text": "Do you believe that our policy is going to influence the beat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7503.247,
    "end": 7509.471,
    "text": "You think that cutting the miles per gallon to 20 is going to change the way that the hidden state, CO2 in the world, changes through time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7510.131,
    "end": 7511.152,
    "text": " You think it's going to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7511.412,
    "end": 7513.294,
    "text": "Well, I don't think it's going to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7513.434,
    "end": 7515.435,
    "text": "Or I think it's going to do this instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7516.036,
    "end": 7517.497,
    "text": "And so now we have an interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7517.617,
    "end": 7526.725,
    "text": "OK, policy is how states of the world are changing, not just as a function of models of prediction, but as a function of our interference in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7527.345,
    "end": 7549.235,
    "text": " and it's going to be manifested in observables not just we believe that 80 of this will be happening by this future time but rather as a function of policy we're going to see these observables and if we're surprised by the observables we see along the way we're going to be course correcting and we're going to be at the same table again so there's so many actual structural ways to talk about this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7550.458,
    "end": 7567.243,
    "text": " I think, as well as narratively, that people could, even having this up, maybe it could be simpler than this one, maybe it could have a few more pieces, but just separating out where people disagree, it's like, yeah, in a legal, I don't know, yeah, in a legal system, I can imagine this being useful too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7568.023,
    "end": 7576.305,
    "text": "Oh, it would have to be recast as something that people wouldn't, you know, fall out of their chair because legal people don't like to see squiggly Latin and Greek symbols.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7576.965,
    "end": 7577.646,
    "text": "But the...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7579.654,
    "end": 7584.358,
    "text": " But the absolutely, no question, the way you described it, what you're doing is you're really mapping.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7584.378,
    "end": 7593.465,
    "text": "I mean, it's teaching and showing people, you know, whenever you have a map that says you are here, you know, when you're lost in the zoo or something like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7594.206,
    "end": 7596.287,
    "text": "And really it's a you are here map, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7596.307,
    "end": 7602.372,
    "text": "It's a CGE, you know, it's allowing more granularity and it's offering more dimensionality for solutions, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7602.392,
    "end": 7606.756,
    "text": "Because if people are just talking about policy, there'll be ambiguity if they're not talking about C, G or E.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7607.901,
    "end": 7608.201,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7608.622,
    "end": 7608.802,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7609.042,
    "end": 7609.922,
    "text": "What are your preferences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7610.523,
    "end": 7613.785,
    "text": "C, what are the field of affordances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7614.185,
    "end": 7618.168,
    "text": "E, and the prior over those, like the quote nuclear option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7618.368,
    "end": 7621.55,
    "text": "It's an affordance and it's the last resort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7622.03,
    "end": 7625.012,
    "text": "So tied up in the affordance is how likely it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7625.113,
    "end": 7627.014,
    "text": "That's your prior over policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7627.634,
    "end": 7630.436,
    "text": "So you have the field of affordances and the prior about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7630.996,
    "end": 7632.137,
    "text": "And then you have your preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7632.437,
    "end": 7635.519,
    "text": "C, I want to see a world where there isn't radioactive fallout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7636.04,
    "end": 7637.381,
    "text": "And then you have your uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7638.341,
    "end": 7653.474,
    "text": " And then those get combined in a way that is formalized with G. And that relates to pi, policy selection, being the outcome of the free energy being minimized, which is, again, what's the most likely policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7653.994,
    "end": 7655.355,
    "text": "And someone's like, wait, most likely?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7655.395,
    "end": 7665.663,
    "text": "It's like, right, but most likely under the model of the world that you believe will happen, not just the one that you think is like the run of the mill, because quote, the run of the mill is not run of the mill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7666.224,
    "end": 7666.344,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7667.887,
    "end": 7677.271,
    "text": " It's really interesting because, I mean, you're integrating subjectivity into an analysis of the reality in a formal way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7679.252,
    "end": 7680.352,
    "text": "It has that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7680.852,
    "end": 7686.574,
    "text": "I believe that this is where the dual instrumentalism is the most powerful thing in the FEP zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7687.075,
    "end": 7690.936,
    "text": "So the dual instrumentalism, again, it's also kind of like a Bailey and Mott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7691.276,
    "end": 7694.798,
    "text": "I don't know if that's being mispronounced, but where there's a strong and a weak form of an argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7695.538,
    "end": 7701.141,
    "text": " So again, the strong claim would be this is what systems are and this is how they're operating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7701.181,
    "end": 7702.601,
    "text": "That is what a bacteria is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7702.661,
    "end": 7704.022,
    "text": "That is what the Markov blanket is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7704.482,
    "end": 7708.044,
    "text": "But the actual weaker claim is just we're going to use it as an instrument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7708.064,
    "end": 7717.328,
    "text": "It's like we use linear regressions and time series modeling to model GDP through time or regression of, you know, height versus risk for some disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7717.648,
    "end": 7720.93,
    "text": "It's like it didn't say people are linear regressions by doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7721.65,
    "end": 7737.143,
    "text": " it did lead to a world in which certain types of conclusions were reached but it wasn't that people were linear models it was actually consequences so this is just a different statistical model and as we're exploring today and we'll continue to explore even qualitatively it helps structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7738.126,
    "end": 7741.91,
    "text": " messy discussions about adversarial relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7742.731,
    "end": 7755.043,
    "text": "And in that way, which we're only barely scratching the surface of, like, you know, really formalizing the Markov blankets around companies and things like that, having this type of a structuring and being able to be disambiguous, but it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7756.144,
    "end": 7779.714,
    "text": " so much more it could be translated between languages it could be versions it could have impartial um you know trust providing uh groups there's so much that could be done there and it's funny because so one of the books i have on the shelf here is by hanneman it's called doing money and it's about how money is a universal risk consolidator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7781.058,
    "end": 7784.08,
    "text": " So, you know, you get money and you can take care of your other risks, basically.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7784.721,
    "end": 7790.145,
    "text": "So one of the things I've been wondering about is, well, money's kind of turned into data because you don't really spend cash anymore.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7791.166,
    "end": 7799.692,
    "text": "So why can't data itself, without being monetized, be a universal risk mitigator?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7801.155,
    "end": 7803.896,
    "text": " Stephen, you cracked me up when you said that money was transdisciplinary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7804.176,
    "end": 7807.958,
    "text": "I've never heard, you know, people say that transdisciplinary research, but I've never, it's so true though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7808.118,
    "end": 7809.659,
    "text": "The departments will pay each other in money.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7810.199,
    "end": 7812.0,
    "text": "They won't cite each other, but they'll pay each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7812.06,
    "end": 7812.8,
    "text": "So it's so true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7813.761,
    "end": 7818.263,
    "text": "And so, and so that, but data can data now be, and can this system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7820.111,
    "end": 7845.736,
    "text": " because money we we you go to an airport you got to convert one system into another so there's different encoding of the bills themselves right okay so that's but but ultimately i was so people if i walk out of if i'm outside a courthouse and someone says i just got a ten thousand dollar judgment i don't know if it's for a divorce case a slip and fall i mean it's money it's ten thousand dollars is identical can buy the same amount of groceries but it could be for various different things that you were you were compensated right",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7847.412,
    "end": 7856.198,
    "text": " In data, it feels like this model might allow us to have data be a medium of exchange and maybe storage.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7856.218,
    "end": 7856.598,
    "text": "I don't know.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7856.618,
    "end": 7857.579,
    "text": "I won't go into that right now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7857.919,
    "end": 7861.762,
    "text": "But a medium of exchange of risk without having to go through the monetary loop.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7864.183,
    "end": 7866.305,
    "text": "Very, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7867.265,
    "end": 7867.525,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7868.346,
    "end": 7871.088,
    "text": "I can kind of imagine some areas, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7872.554,
    "end": 7888.579,
    "text": " And this might be where bringing the body back in can help too, as we, you know, you talk about like, there's money in my hand, there's money that we talk about when you get it or something, and then there's capital, which is almost like an augmented,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7889.728,
    "end": 7904.385,
    "text": " um cognition process which is up there in the markets you know that we've offloaded onto and is very hard to embody what's going on up there it's it's like it goes off it does its calculation it comes back",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7906.067,
    "end": 7911.79,
    "text": " Half the people doing it are doing it on screens who themselves are being proxies for other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7912.671,
    "end": 7922.437,
    "text": "So there's a question about where this comes back into ultimate sense-making at different timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7925.001,
    "end": 7926.262,
    "text": " Ivan was smiling before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7926.282,
    "end": 7928.703,
    "text": "Were you smiling at the money thing, Ivan?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 7928.863,
    "end": 7933.024,
    "text": "Let's maybe have, yeah, let's have anything you want to go there, Ivan, if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7933.164,
    "end": 7934.925,
    "text": "Otherwise, let's have a little closing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7934.965,
    "end": 7941.047,
    "text": "I just imagined in you and your money and your money of new people.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 7942.868,
    "end": 7943.048,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7944.733,
    "end": 7964.425,
    "text": " so maybe we'll have a final set of thoughts so prepare that but the other side um scott of the the money uh trading in the airport is that uh in a healthy system every sale is bi-directionally consensual every agreement is not feeling forced it's like so somebody wanted your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7966.001,
    "end": 7967.861,
    "text": " Peso, the other person wanted the yen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7968.382,
    "end": 7969.362,
    "text": "So they made a deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7969.382,
    "end": 7970.662,
    "text": "They met in a marketplace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7971.082,
    "end": 7972.402,
    "text": "They wouldn't have found it on Craigslist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7972.883,
    "end": 7975.903,
    "text": "The operating costs would have been too high, but somebody wanted it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7976.243,
    "end": 7977.964,
    "text": "Now, when does it become deranged?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7978.344,
    "end": 7986.966,
    "text": "Well, when there's extra market forces that force people to do things, or when there's devaluation and market manipulation, et cetera, et cetera,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7987.486,
    "end": 7991.309,
    "text": " But again, it's not like there's a pure untrammeled market out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7991.769,
    "end": 7993.771,
    "text": "And then it's like, oh, regulation, how dare they?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7994.231,
    "end": 7996.293,
    "text": "It's actually we construct the market.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7996.553,
    "end": 7997.994,
    "text": "It's like we're building the bowl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7998.515,
    "end": 8002.538,
    "text": "So it's not just like there's a pure bowl and then you've defiled it by putting clay on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8002.678,
    "end": 8007.322,
    "text": "It's like, no, what is the structure that you're going to be interfacing in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8007.682,
    "end": 8011.946,
    "text": "And can that not just be imbued with our values, which...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8012.606,
    "end": 8036.634,
    "text": " aren't going to always have justification they're often axiomatic but can it actually allow diverse agents to act according to their deeply held axioms so that there is ability of people who have different faith in different things yeah and it's been a joke for so long oh you don't need to believe in the legitimacy of the government to use the currency of a fiat and now we're just seeing it in a new light",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8037.971,
    "end": 8039.412,
    "text": " It's really interesting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8039.433,
    "end": 8044.997,
    "text": "The market may be just an emergence from the fact of information seeking in trades.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8045.798,
    "end": 8045.998,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8046.118,
    "end": 8048.28,
    "text": "And also leveraging and how that's trust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8048.34,
    "end": 8050.161,
    "text": "Like there's Bitcoin on the blockchain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8050.561,
    "end": 8051.742,
    "text": "These are the examples I think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8051.762,
    "end": 8052.563,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8053.224,
    "end": 8055.465,
    "text": "But then there's the 10x leveraged Bitcoin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8055.866,
    "end": 8065.734,
    "text": "Who legitimized that exchange or that person to offer a 10x leverage or some other type of asset based upon leveraged on Bitcoin?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8065.974,
    "end": 8066.875,
    "text": "Nobody gave that permission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8066.895,
    "end": 8066.995,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8067.595,
    "end": 8082.696,
    "text": " if that person or that operation is reputable um and to whatever extent it is it will succeed or hopefully and again anything other than that is dysfunction so there's a way to talk about that in a way that is pretty different from the reward optimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8083.477,
    "end": 8084.918,
    "text": " of different competing agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8085.498,
    "end": 8088.68,
    "text": "That's previous paradigm, reward optimization, competitive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8089.22,
    "end": 8091.802,
    "text": "And we're not just moving from competitive to cooperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8092.422,
    "end": 8093.823,
    "text": "It's actually not that simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8093.943,
    "end": 8102.768,
    "text": "It's actually more about from the reward to the precision guiding mindset and that everything else falls in line after that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8103.308,
    "end": 8107.871,
    "text": "And the action and the precision are the key pieces, some of the key pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8108.671,
    "end": 8111.633,
    "text": "And so that's the coherence lending factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8112.648,
    "end": 8114.969,
    "text": " Yes, we want to be precise about process together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8115.77,
    "end": 8123.854,
    "text": "That's the minimal meme, not we're going to have abundance in the future, but today we're going to have precision here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8125.375,
    "end": 8125.555,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8126.275,
    "end": 8137.341,
    "text": "So it's really, yeah, it's a different, it's really fascinating the way it's going to iterate itself into, it's more scalable, but it's not yet scaled.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8139.224,
    "end": 8139.424,
    "text": " Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8139.645,
    "end": 8142.388,
    "text": "You know, I think it makes me think of adaptation studies.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8142.488,
    "end": 8155.241,
    "text": "I have a book on Cambridge, a book on adaptation studies in theater, where if you take Romeo and Juliet and you translate it into another language, you got a lot of work to do because there's a lot of phrasing and there's a lot of behavior, a lot of things for adaptation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8155.842,
    "end": 8160.967,
    "text": "What we're doing here is it's just like a giant simultaneous adaptation vehicle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8162.898,
    "end": 8171.962,
    "text": " Right, because everyone's coming in with priors and this system allows people to discover things that they have in common.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8173.003,
    "end": 8174.764,
    "text": "It allows them to act in common.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8176.044,
    "end": 8178.386,
    "text": "And that's going to have such huge power.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8179.946,
    "end": 8182.908,
    "text": "It won't and it won't be something that will create spaces for it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8183.068,
    "end": 8184.188,
    "text": "It will create the space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8184.529,
    "end": 8188.571,
    "text": "The interaction space will evolve and then be.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8189.935,
    "end": 8193.418,
    "text": " And then it'll be parameterized in metrics and you'll know if you're in it or not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8193.438,
    "end": 8195.84,
    "text": "There'll be certain behaviors that indicate you're in it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8197.001,
    "end": 8197.201,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8197.421,
    "end": 8200.744,
    "text": "But it's that's why I say the process becomes the governance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8200.984,
    "end": 8202.805,
    "text": "It's not you don't that's a lot of people.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8202.945,
    "end": 8208.15,
    "text": "There's the AI problem right now, not our AI, but the artificial intelligence that everyone is trying to create.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8208.35,
    "end": 8214.795,
    "text": "Everyone that I can find is trying to create systems to govern the people creating the AI, but not the AI system itself.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8216.502,
    "end": 8220.989,
    "text": " And I'm thinking more along the lines of Asimov, which is you need the rules for the robots themselves.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8221.991,
    "end": 8231.486,
    "text": "Similarly here, each one of these systems is a robot, not programmed by us per se, but it's caused by us and it has",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8232.68,
    "end": 8254.858,
    "text": " uh features that are the result of our desires and needs so it's programmed in that way corporations are robots i think they're programmed part of our constructed niche is how we would consider it it you're never going to break away it's intertwined with us it's in our niche yeah right right and so the so it's interesting because i think a lot of folks look at authority",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8256.353,
    "end": 8259.216,
    "text": " The fiat money is, I think the U.S.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8259.417,
    "end": 8263.241,
    "text": "is a fiat not just because of rule of law, but because of a monopoly of violence.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8263.841,
    "end": 8266.264,
    "text": "We have the most guns and bombs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8268.266,
    "end": 8274.212,
    "text": "And so it's violence and imperialism and all that stuff that's wrapped up in fiat money.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8275.253,
    "end": 8275.433,
    "text": " Right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8275.453,
    "end": 8276.273,
    "text": "There's a power there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8276.313,
    "end": 8280.695,
    "text": "And I think the power is shifting from physical violence to other forms of information.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8280.715,
    "end": 8283.476,
    "text": "I won't use the word violence here, but information authority.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8284.056,
    "end": 8291.539,
    "text": "And it feels like the ability of this system to declare that it can get you closer to reality continuously.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8291.559,
    "end": 8294.08,
    "text": "It's dynamically, it's like the scientific method.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8294.1,
    "end": 8296.501,
    "text": "It's dynamically rejiggering itself.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8296.581,
    "end": 8297.781,
    "text": "I wouldn't say closer to truth.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8298.141,
    "end": 8300.622,
    "text": "I would say towards a better process together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8300.862,
    "end": 8301.123,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8301.203,
    "end": 8301.763,
    "text": "Dynamically.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8301.803,
    "end": 8301.943,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8302.583,
    "end": 8303.704,
    "text": " Yep, that's right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8303.764,
    "end": 8305.325,
    "text": "There is no end state of truth, yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8305.866,
    "end": 8311.51,
    "text": "But that value proposition is not characteristic of the current systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8312.772,
    "end": 8322.96,
    "text": "And so it has a unique feature of it de-risks in a way that's much more effective than the current systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8323.58,
    "end": 8330.927,
    "text": "It requires people to do the cooperative thing, which is, like I said, with credit cards or ATMs or swaps or...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8331.886,
    "end": 8333.567,
    "text": " Anything with mitochondria.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8335.049,
    "end": 8335.249,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8335.829,
    "end": 8339.352,
    "text": "You know, your free existing things have to come together because it's a better deal to be had.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8339.432,
    "end": 8339.632,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8340.953,
    "end": 8345.657,
    "text": "So that's and so that so the convey are conveying why there's a better deal to be had.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8346.337,
    "end": 8348.679,
    "text": "We can use the existing problems in the world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8348.719,
    "end": 8350.841,
    "text": "Climate change, war.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8351.741,
    "end": 8353.002,
    "text": "It's not even a better deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8353.463,
    "end": 8355.024,
    "text": "It's a better negotiating table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8355.819,
    "end": 8355.999,
    "text": " Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8356.24,
    "end": 8357.08,
    "text": "And that's that's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8357.1,
    "end": 8359.683,
    "text": "That's always the reframe is always from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8359.783,
    "end": 8364.548,
    "text": "Yes, there will be better states to we're going to seek precision today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8364.608,
    "end": 8364.929,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8365.489,
    "end": 8366.791,
    "text": "Beautiful, beautiful.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8366.971,
    "end": 8371.676,
    "text": "And that gets back to that now versus past and future thing that I was struggling with before.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8372.296,
    "end": 8372.497,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8372.877,
    "end": 8374.659,
    "text": "We're not going to we're not saying it's better.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8374.819,
    "end": 8376.16,
    "text": "It's a better way to be.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8378.689,
    "end": 8383.271,
    "text": " And we don't know where being takes us because we have models of it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8383.411,
    "end": 8383.951,
    "text": "You have a model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8384.011,
    "end": 8384.492,
    "text": "I have a model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8384.512,
    "end": 8384.892,
    "text": "We have a model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8384.912,
    "end": 8387.953,
    "text": "Let's get together, figure out where we want to be.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8388.073,
    "end": 8395.616,
    "text": "The reality is the synthesis of those desires, I guess, as evolving through time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8395.976,
    "end": 8401.999,
    "text": "Closing statement from first Stephen, then Yvonne, if he wants, then back to Scott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8403.3,
    "end": 8405.581,
    "text": "Well, yeah, I suppose the takeaway",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8407.52,
    "end": 8410.568,
    "text": " And you had the E, the G, what was the third letter again?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8411.351,
    "end": 8412.474,
    "text": "C is the preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8413.248,
    "end": 8439.48,
    "text": " okay see i think that's really useful i think that's like a nice meeting point there between and i keep coming back to this but the ergodicity and non-ergodicity in the sense that you know as you get down to the smaller scale the body and i think even when you get into this outside of cognition everything's got to follow that growth kind of ergodic kind of churn and then you start to have this ability to bring in these non-ergodics as we get to larger time scales and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8440.22,
    "end": 8458.735,
    "text": " you know we even see as we get now to the state and how you can borrow money in ways which an individual can't we've seen this with the eu because they're not constrained by lifespan in the way that mortgage mortgages are so you've got this weird ability to bring in preferences in that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8459.512,
    "end": 8485.391,
    "text": " um about of non-ergotic sort of ways of just making a choice and creating deliberately steady state like a fiat currency the whole point is it's steady and non-ergotic but we actually and this is where i think a lot of the work with the indigenous cultures is they are they could say they're trapped in the old cyclical way of understanding the world but actually that gives you a way to tune into your deeper existential way of knowing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8486.031,
    "end": 8502.423,
    "text": " about the long-term future because that is where your phenotype knowledge comes from not um you know the okay we have these structures that give us this ability to also do deep temporal depth but we do lose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8503.339,
    "end": 8506.96,
    "text": " the ability to integrate free energy in such a new way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8507.26,
    "end": 8511.561,
    "text": "The dimensions come down and down and down and down to these kind of artifacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8511.961,
    "end": 8514.821,
    "text": "So yeah, this is, anyway, this is what is coming up for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8514.861,
    "end": 8515.181,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8515.942,
    "end": 8527.684,
    "text": "Well, I hope, Stephen, that you and others can, in the future, you know, listen back to what you've laid out and hopefully see it in a broader perspective, what you were hinting at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8528.144,
    "end": 8529.704,
    "text": "Yvonne, any closing thoughts for 2020, indeed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8532.785,
    "end": 8533.385,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8533.445,
    "end": 8543.989,
    "text": "I just want to thank you all for a brilliant discussion and it's a great discussion for the end of this strange year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8545.61,
    "end": 8550.931,
    "text": "I hope to see you all next, from the beginning, from January.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8552.432,
    "end": 8555.173,
    "text": "And thanks for your help in the project from the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8556.073,
    "end": 8556.794,
    "text": "Really critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8556.814,
    "end": 8557.214,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8557.534,
    "end": 8558.774,
    "text": "Yeah, so very chill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8558.954,
    "end": 8560.335,
    "text": "Scott, closing thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8562.596,
    "end": 8563.397,
    "text": " This is beautiful.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8563.477,
    "end": 8564.598,
    "text": "You guys are beautiful.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8564.838,
    "end": 8565.739,
    "text": "This is awesome.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8567.04,
    "end": 8569.743,
    "text": "I feel like a metamorphosis.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8570.063,
    "end": 8577.97,
    "text": "I'm going to pupate a little bit, and then I'm going to come out after the New Year's and be ready to fly with you guys.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8578.231,
    "end": 8582.775,
    "text": "This is really delightful and fascinating, and I think it's going to be",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8583.519,
    "end": 8607.129,
    "text": " really um very helpful to a lot of problems that are out there in the world it feels like there's a lot of um uh solution space that gets opened up with this and in in introducing it in in digestible chunks so i always talk to my clients about where are you now where do you want to be that's a tough one and now i see why it's a tough one because it's in a way the wrong question",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8608.659,
    "end": 8611.442,
    "text": " Where do we want to be individually?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8611.462,
    "end": 8612.542,
    "text": "And then how do we synthesize?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8612.983,
    "end": 8614.384,
    "text": "And then what are the ways to get there?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8614.884,
    "end": 8615.965,
    "text": "And then you triage them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8616.386,
    "end": 8618.167,
    "text": "So that's a standard thing I used to use.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8618.227,
    "end": 8628.736,
    "text": "Now that's changing because it's a... The exploration of where we want to be is the answer to that really hard second question, which is people have difficulty answering.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8628.776,
    "end": 8631.338,
    "text": "So thank you for inviting me on the journey.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8631.458,
    "end": 8632.259,
    "text": "This is great stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8632.759,
    "end": 8637.063,
    "text": "So to close on that, Scott, you just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8638.393,
    "end": 8642.236,
    "text": " you laid out a helpful way of thinking about it with just where do you want to go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8642.416,
    "end": 8643.597,
    "text": "This is common goal setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8643.737,
    "end": 8644.217,
    "text": "Who are we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8644.357,
    "end": 8645.038,
    "text": "Where do we want to go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8645.478,
    "end": 8646.218,
    "text": "How are we going to get there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8646.939,
    "end": 8649.08,
    "text": "But you brought in two pieces, which is the values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8649.881,
    "end": 8655.024,
    "text": "The values are what is not explicitly described, but they're part of the preference and the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8655.485,
    "end": 8663.03,
    "text": "And so combining all of these disparate threads together and not having one heat engine for the refrigerator and one power plant for the other one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8663.57,
    "end": 8678.257,
    "text": " but combining all of these threads together so we can have a discussion from multi-perspective, so that's the intercultural component, multi-perspective, but also bringing together these co-extant values that we have for system function, exploration,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8679.904,
    "end": 8692.913,
    "text": " so many other features, but really my closing thought is for this live stream that tomorrow probably I'm gonna record a video called 12.0 that is gonna be the clock striking midnight on 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8693.934,
    "end": 8699.058,
    "text": "And then we will indeed head into a very exciting 2021 and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8699.738,
    "end": 8706.023,
    "text": "So both of you, well, actually all of you, I guess are RSVP'd for the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8706.863,
    "end": 8708.244,
    "text": "So I'm just really looking forward to those,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8709.09,
    "end": 8712.552,
    "text": " three projects, and just like you said, Scott, with the digestible bits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8713.713,
    "end": 8716.955,
    "text": "Livestream has been our learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8717.035,
    "end": 8719.156,
    "text": "We've all learned so much along this journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8719.816,
    "end": 8725.319,
    "text": "But now we also want to be thinking about could make shorter content, ones that have interactive parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8725.88,
    "end": 8726.32,
    "text": "Who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8726.58,
    "end": 8729.822,
    "text": "But there's going to be, yeah, great things happening ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8729.922,
    "end": 8733.824,
    "text": "So thanks, everyone who's listening live or in replay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8734.405,
    "end": 8736.526,
    "text": "Thanks, guys, for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8736.546,
    "end": 8738.287,
    "text": "Fantastic.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 8738.949,
    "end": 8742.213,
    "text": " And happy new year to everybody.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8742.233,
    "end": 8742.874,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 8744.736,
    "end": 8744.977,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8745.457,
    "end": 8746.258,
    "text": "What a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8746.739,
    "end": 8748.061,
    "text": "What a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8748.741,
    "end": 8749.022,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8749.162,
    "end": 8751.304,
    "text": "Well, I'm going to terminate the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8751.845,
    "end": 8752.786,
    "text": "So thanks everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8753.127,
    "end": 8754.889,
    "text": "And I will talk to you later.",
    "speaker": "SPEAKER_00"
  }
]