[
  {
    "start": 2.933,
    "end": 3.254,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3.334,
    "end": 10.065,
    "text": "Welcome, everyone, to cohort 4 of the textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 10.085,
    "end": 20.723,
    "text": "It's June 6, 2,023, so appreciate hearing everyone's introductions in that first section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 20.703,
    "end": 42.846,
    "text": " I'm going to share the screen and we'll look at the coda which is our shared workspace and has all the information and it's also a work in progress and one that you can edit or comment so please feel free to raise your hand whenever you have a thought or a question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 43.687,
    "end": 47.653,
    "text": " and also you can write into the chat in Zoom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.854,
    "end": 64.076,
    "text": "And in this first meeting, we're gonna like go over a lot of the sections of the CODA and also just like take questions and have discussions on how the textbook group will proceed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 65.858,
    "end": 70.825,
    "text": "So the top page on the CODA is on the top left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 71.75,
    "end": 75.455,
    "text": " just to give a little bit of some overview of Coda overall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 76.116,
    "end": 79.18,
    "text": "You can hide the sidebar if you want to focus on a page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.941,
    "end": 82.905,
    "text": "You can also collapse the nesting of pages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.527,
    "end": 100.609,
    "text": "When you're within a page, some pages are not editable, like just because they're kind of static content, but you'll find that editing on editable pages is roughly like any other kind of online text editor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.517,
    "end": 107.586,
    "text": " And we're going to go through the sections and see more about what they all do and how they come into play and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 108.146,
    "end": 116.799,
    "text": "So the top page gives some information on the Active Inference Institute and on the textbook group overall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.059,
    "end": 122.547,
    "text": "And then also there's the textbook itself, which can be just right clicked and downloaded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.527,
    "end": 126.152,
    "text": " So it's an open source textbook, which is really awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 126.172,
    "end": 128.975,
    "text": "It came out about one year ago in 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.357,
    "end": 136.344,
    "text": "So it's early days for this first version of the first textbook of Active Inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.486,
    "end": 145.836,
    "text": "And we also can have a lot to do to fill in the dots and add questions and context, extra resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.098,
    "end": 152.044,
    "text": "It's quite a work to have made a pocket-sized book",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.463,
    "end": 164.908,
    "text": " that covers active inference, but you'll also find that in these discussions, especially as people look towards the applications and philosophy and so on, that we bring in a lot of other resources and questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.529,
    "end": 171.18,
    "text": "So it's not like strictly just the textbook, but that's our attractor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 173.168,
    "end": 183.081,
    "text": " Directory gives, and also in Coda, you may want to switch between light and dark on the top right, if you want it to look different on your computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 184.703,
    "end": 190.21,
    "text": "Directory provides just a few sections of this Coda and what they're for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 192.453,
    "end": 201.505,
    "text": "Live meetings, here in cohort four, probably be most interested in cohort four itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.603,
    "end": 222.058,
    "text": " so just as a kind of like who we are or where we're at I yesterday brought in a few different visualizations um just anecdotally we heard in the introductions people's backgrounds different like um uh educational larval stages but this graphic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 222.427,
    "end": 251.944,
    "text": " is just a snapshot of the forms when people have registered so this is across cohorts just to get a better sampling um the x-axis is self-assessed familiarity with active inference not familiar zero highly familiar 100 and then computer science biology and maths familiarity in green blue and red and uh it's awesome to see that there's basically uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 251.924,
    "end": 253.586,
    "text": " Justin Delacruz, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 253.566,
    "end": 254.347,
    "text": ": painting of the canvas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.048,
    "end": 256.471,
    "text": "So that's the fun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 257.011,
    "end": 270.391,
    "text": "We have people with a lot of different backgrounds, and as we leave this interdisciplinary conversation where there's going to be math and analytical equations coming into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 270.431,
    "end": 277.02,
    "text": "There's going to be computer science and pseudocode and computational architectures coming into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.0,
    "end": 298.958,
    "text": " there's going to be biology and mammalian neurophysiology coming into play and also all these other domains that people mentioned like clinical setting logistics and supply chain music perception Etc like those even more you know there could be more colors um but this is also to say like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 298.938,
    "end": 328.337,
    "text": " everyone's journeys and backgrounds are really welcome it's not that everyone is highly familiar with any of these topics we're all learning these topics and even those who have more familiarity hopefully slash actually want to teach and and share it so we want to just highlight the accessibility and also the rigor and the applicability of all of this coming together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 328.823,
    "end": 339.199,
    "text": " And then also self-described people's synchronous and asynchronous time commitment on a relative spectrum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.239,
    "end": 348.553,
    "text": "So it's not even with time units, but synchronous contributions, as we'll look more at in a few minutes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.719,
    "end": 377.713,
    "text": " are like coming to this weekly synchronous discussion so those are always great to join and asynchronously we'll look more at the practices later but that includes your own reading and annotating and working with the textbook and also there's a lot of ways to do asynchronous contributions in this coda that leverage so that other people can also benefit from your works",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.87,
    "end": 385.117,
    "text": " in terms of the cohort for live meetings themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 386.779,
    "end": 391.846,
    "text": "Also control and plus or minus or control and scroll, you can change the size on Coda.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.629,
    "end": 397.194,
    "text": "Top link is a calendar link for all of the textbook group meetings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.875,
    "end": 399.617,
    "text": "So get into your own time zone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 400.407,
    "end": 407.813,
    "text": " This playlist is going to have, there's no videos in it yet, but it's gonna have all of the videos for cohort four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.913,
    "end": 411.987,
    "text": "So for comparison, like here's the playlist of cohort three,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.468,
    "end": 419.254,
    "text": " So the welcome meeting going on through, that was the first half that they completed in cohort three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 419.814,
    "end": 422.056,
    "text": "So that will also be there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.618,
    "end": 425.42,
    "text": "Questions we'll talk about soon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.26,
    "end": 429.263,
    "text": "And then the playlist with background and context video for each chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.303,
    "end": 439.273,
    "text": "Ali and I did this live stream about two weeks ago and we clipped it into the constituent parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.473,
    "end": 445.07,
    "text": " And this is something that we have introduced for this cohort, and it wasn't there in previous cohorts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.772,
    "end": 448.42,
    "text": "They are about 20 minute videos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 448.619,
    "end": 472.163,
    "text": " that just kind of scroll through the chapter and just talk about the structure of the chapter and just broadly what's in it and the idea is these videos are there for you before we have the discussion on that chapter so it can just be a useful supplement to your learning or preparation um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 473.206,
    "end": 496.159,
    "text": " our meetings are weekly and they alternate between 13 and 22 UTC so some people may be able to join both of these times or just one or neither um the video recording is going to be in this link column to the right just a few hours following each meeting so you can always review um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 497.422,
    "end": 501.449,
    "text": " We're in the onboarding and overview, and next week will be pretty similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 501.49,
    "end": 506.679,
    "text": "Also, we'll have unrecorded introductions for a different set of people who will be there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 506.739,
    "end": 509.765,
    "text": "And then we'll go over the code again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.945,
    "end": 513.752,
    "text": "So that video in some ways will be slightly overlapping with this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.654,
    "end": 519.463,
    "text": "And then going forward, we do two weeks per chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 519.443,
    "end": 541.722,
    "text": " so between now and the end of august we're going to cover the first five chapters of the book which is like part one the kind of epistemic section of the book and during that two week period it flies by there's a lot to learn a lot of areas to go into so we're gonna basically",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.972,
    "end": 568.722,
    "text": " welcome you to join every uh cohort four live meeting or the same time slot if you want to join cohort threes uh discussions which are like on chapter six through ten at alternating times but there's there's no reason not to join it's all part of the same book and you may just also see other things by looking later into the book too um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.275,
    "end": 571.078,
    "text": " Okay, continuing on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.138,
    "end": 581.833,
    "text": "And again, just write any question in the chat or raise your hand if you would like to get a little bit more details or ask anyone who's previously participated in the groups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.896,
    "end": 588.463,
    "text": "So onboarding just gives a few other pieces of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.683,
    "end": 593.41,
    "text": "Of course, it's all welcome to do it how you want to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.132,
    "end": 615.516,
    "text": " There's some rules and guidelines about this open science space in terms of what and how we share being under Creative Commons and just being pro-social learners in this textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 618.196,
    "end": 631.296,
    "text": " For student practices, also total work in progress, what do we really do when we're learning active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.316,
    "end": 641.672,
    "text": "Here are some of them, some practices, and also what that practice looks like and what work products it results in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.753,
    "end": 659.395,
    "text": " And these include everything from short little notes that you write to yourself or updates in your own personal knowledge system to writing blog posts or adding contributions directly to this coda, which then can be leveraged because everyone's working in this same space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 660.437,
    "end": 671.17,
    "text": "Also just organizing your information environment, taking a break, teaching others, building physical models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.302,
    "end": 697.258,
    "text": " working on projects like there's many ways that we can engage in in these um materials and then there's also just some other pages and templates that you might find useful you can also make your own code a document if you want to play around with some of these templates um so that's kind of the the overview on the textbook group we're going to be working two weeks per chapter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 699.263,
    "end": 728.224,
    "text": " hanging out connecting asking a lot of questions and now let's go into a lot of these sections that have a lot more content um so again you can download the PDF of the textbook itself however increasingly we have a lot of the materials of the textbook in the coda so that they can be really easily referenced and we'll see what that looks like so um just going through um equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.031,
    "end": 741.083,
    "text": " most of the chapters have equations and it's an ongoing project to connect the equations for example equation 2.6 on expected free energy it's like we're going to get there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 742.025,
    "end": 748.098,
    "text": " But even with a lot of familiarity in math, one might not know exactly how each variable is being used here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.138,
    "end": 752.868,
    "text": "And so it ends up being a friction for learning and application.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 753.83,
    "end": 760.725,
    "text": "And so what we can do is we can develop natural language representations of these equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.397,
    "end": 781.735,
    "text": " 2.5 is completed um that use the active inference ontology so everywhere you see like an at and a blue is uh calling a row in coda and so for example at surprisal and so then by mousing over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 782.795,
    "end": 787.281,
    "text": " you can see where it exists, what kinds of definitions are there for that term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.922,
    "end": 790.706,
    "text": "So observation, here's a proposed definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.367,
    "end": 797.737,
    "text": "And this is developed as part of the Active Inference Ontology, which is another project at the Institute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.458,
    "end": 806.429,
    "text": "And more generally, having this equation in a table allows us to connect it with the LaTeX code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.469,
    "end": 812.498,
    "text": "It allows us to also call this row in the coda, like figure two, four, mouse over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.17,
    "end": 814.813,
    "text": " Oh, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 814.833,
    "end": 815.474,
    "text": "Figure two, four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 816.235,
    "end": 823.888,
    "text": "So it helps be really clear with where we're referencing a certain like figure or equation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 825.892,
    "end": 829.999,
    "text": "Figures also, there's the figure in each of these rows of this table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.64,
    "end": 837.692,
    "text": "And so that allows us to call different figures and to have discussion around the figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.432,
    "end": 840.174,
    "text": " So here's just like, oh, figure 1.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.755,
    "end": 843.638,
    "text": "Like this is going to be also a kind of core figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.139,
    "end": 849.465,
    "text": "This is the low road and the high road to active inference, which is going to be chapter two and chapter three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.525,
    "end": 854.33,
    "text": "And then there's discussions that we can have about those topics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 854.37,
    "end": 863.781,
    "text": "So kind of in general, adding anything somewhere is going to be better than adding nothing, nowhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 863.879,
    "end": 869.01,
    "text": " So just at first, and we can always reorganize later if needed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.07,
    "end": 876.285,
    "text": "In general, though, adding directly to wherever there's already notes and discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.755,
    "end": 896.316,
    "text": " or um just however you see fit it's it's great to increment that way um continue on with these kind of like uh equations and figures before we get to the the textbook chapters itself we have the uh boxes in the table so box 2.1",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.752,
    "end": 918.422,
    "text": " so just screenshots of all the boxes and then um code we have a code repo um Ali and and others I hope that we can share more about other uh ongoing resources and then also for people who are interested to the the code implementations here are um many dozens in different languages",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 920.039,
    "end": 945.49,
    "text": " of different packages and implementations of active inference models so we can return to these later okay so on to the um chapters themselves um here are the 10 chapters and the three appendices of the book and also a detailed table of contents",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.938,
    "end": 949.502,
    "text": " Here's what happens in each of the chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.522,
    "end": 956.672,
    "text": "So for example, in two weeks from now, when we get into chapter one, what is that going to be like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 956.692,
    "end": 968.85,
    "text": "So in chapter one, one other useful tip in Coda is you can always click on somebody's little token on the top of the document and go to where they are in the document.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 969.551,
    "end": 975.78,
    "text": "So if you just click on the pie, you'll be able to like follow where this user is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 976.975,
    "end": 986.766,
    "text": " So the top of the chapter one page first is just an embed of the YouTube video with Ali and I giving the 20 minute overview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 987.767,
    "end": 993.213,
    "text": "Then there are the chapter one questions, which we'll come back to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.914,
    "end": 994.695,
    "text": "There's 33 questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 996.057,
    "end": 1001.763,
    "text": "And then there's just sort of broader discussion on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1001.783,
    "end": 1003.405,
    "text": "So the question is kind of like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1004.735,
    "end": 1019.2,
    "text": " a minimal epistemic action and so whether it's a beginner and it's like every question is either going to be new to you at the very least",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1019.382,
    "end": 1023.729,
    "text": " it may have been something that's already addressed or addressable, which is totally perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.749,
    "end": 1025.912,
    "text": "That's why we want to connect you with that information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.932,
    "end": 1038.212,
    "text": "It could also be a new question that might support other learners, maybe coming from a similar vector as you, to be accelerating their academic learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.773,
    "end": 1043.28,
    "text": "It might even be a novel question, period, and a research avenue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.429,
    "end": 1066.551,
    "text": " adding questions is just like always the right thing to do um to add questions you can just go to the bottom of the table and just add rows with enter and then just type your question um so uh and you can also upvote questions with the interesting so for example um organisms minimizing surprise introduced on page six",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.442,
    "end": 1072.191,
    "text": " How are prior assumptions established when the organism's new or novel environments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1072.872,
    "end": 1076.76,
    "text": "And then this textbook reference, okay, chapter one, page six, or here, figure 1.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1076.78,
    "end": 1079.124,
    "text": "You can mouse over again, see what it was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.186,
    "end": 1083.933,
    "text": "And then in the answers and discourse, it's a canvas that pops up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1084.254,
    "end": 1087.56,
    "text": "And so here we've explored this a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1087.54,
    "end": 1117.378,
    "text": " we've also talked about like if if we get a minimum number of upvotes like if we get like you know 15 upvotes or something maybe we could um curate the answers into a short video so now we have a three minute video on like addressing this and have another like link here just things that we can implement as we continue the cohorts um but in the answers and discourses this is like a huge opportunity for um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.696,
    "end": 1126.345,
    "text": " adding resources, adding other associations that you have, adding applications, or why would this matter in a domain?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.746,
    "end": 1144.243,
    "text": "So again, always cool to add to these pages or to restructure it however you see fit and just improve this because we revisit these cohort after cohort and people on their own time are looking through these questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1145.067,
    "end": 1173.792,
    "text": " time after time so if you think that there's an improvement that you can make to like this question and the discourse that's like a huge contribution um when we meet for a given chapter um we will we we of course uh don't assume like total understanding whatever that would mean but in general we're going to um come to the questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1174.177,
    "end": 1198.952,
    "text": " and in the beginning of like a chapter one discussion like in in two weeks from today first just anyone can give their overall reflections or comments or thoughts on the chapter their experience reading it or what stuck with them then we'll move to the questions and we'll look to um the questions that were highly uh upvoted already",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1199.827,
    "end": 1209.081,
    "text": " or questions that are kind of pressing in the moment, and then look to improve our feeling on those questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1210.864,
    "end": 1216.553,
    "text": "So hopefully that makes sense and people can, and then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.765,
    "end": 1222.256,
    "text": " we'll see another kind of lens on the questions coming up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.897,
    "end": 1225.764,
    "text": "One important piece here is the textbook doesn't have questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.804,
    "end": 1232.28,
    "text": "It doesn't have self-assessments or anything like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1232.8,
    "end": 1259.449,
    "text": " so over the years we will see if this can actually be something vital in enabling the textbook to be part of like an educational ecosystem to enable it to actually be used in courses and so on by creating these um by sourcing and curating these questions so a question could be anything from just like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.188,
    "end": 1263.272,
    "text": " In figure X, what are the three kinds of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1264.393,
    "end": 1266.515,
    "text": "Doesn't need to be like a super hot take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.535,
    "end": 1272.963,
    "text": "It can just be a very straightforward question, or it can be like, what might this mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.983,
    "end": 1278.149,
    "text": "I mean, what's the distinction between mind and brain in the context of free energy principle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1278.71,
    "end": 1281.513,
    "text": "It's not gonna be a one sentence answer necessarily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1281.533,
    "end": 1284.076,
    "text": "There's always like more to add, more to associate there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.159,
    "end": 1289.082,
    "text": "But in general, when we come to discuss a chapter,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.247,
    "end": 1300.223,
    "text": " we're going to like just have any general comments and thoughts on it, and then look to the questions and just have it like conversationally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1300.483,
    "end": 1303.207,
    "text": "So that's gonna be the case for each chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1304.169,
    "end": 1311.379,
    "text": "Like here there's already 45 questions from previous cohorts on chapter two, you know, low road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.459,
    "end": 1316.807,
    "text": "So chapters one through five, that's the section that we're in in this interval.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1317.715,
    "end": 1323.087,
    "text": " Then chapter six through 10, chapter six is where you get to like the recipe for active inference modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.33,
    "end": 1329.962,
    "text": "And so that is where you start building a generative model and working through that process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1330.022,
    "end": 1332.568,
    "text": "But chapter one through five have a lot of background information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.084,
    "end": 1337.609,
    "text": " So those are the textbook sections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.61,
    "end": 1341.033,
    "text": "Then we have a kind of further discourse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.274,
    "end": 1345.399,
    "text": "So here's the questions themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1345.84,
    "end": 1347.803,
    "text": "So you can always go to cohort four questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1348.624,
    "end": 1349.445,
    "text": "That's our cohort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.505,
    "end": 1354.692,
    "text": "And if you just want to add like to a chapter two, or I'll just add one that's chapter one here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1357.557,
    "end": 1385.877,
    "text": " this will help us see like which questions specifically came up in uh chapter or in uh in cohort four so it'll just um automatically be tagged with cohort four it doesn't it's not really important like who initiates the question per se because we're always going to be modifying it and so on but if you just want to have a place to see just the cohort four questions you can add to this table and they're all views of the same",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.11,
    "end": 1393.221,
    "text": " David Wiltshire- table so it's all if it's in Chapter one here it's it's going to show up on the Chapter one view when we get to that chapter as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.763,
    "end": 1403.376,
    "text": "David Wiltshire- So questions again are a huge way to contribute, whether just by seeding a question or by addressing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1403.693,
    "end": 1407.584,
    "text": " And that's just because this is how we reduce our uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1408.166,
    "end": 1415.025,
    "text": "The imperative in active inference is uncertainty reduction slash bounding, not simply reward maximization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1415.105,
    "end": 1419.036,
    "text": "So it's a massive way to contribute to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.235,
    "end": 1419.515,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.716,
    "end": 1420.817,
    "text": "The uncertainties you're having.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1421.358,
    "end": 1430.231,
    "text": "So seeing those uncertainties as like calls to action instead of reasons to like disconnect from learning or to not contribute to this shared niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1432.575,
    "end": 1438.864,
    "text": "Over the seasons, we've had a fun math learning group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1439.266,
    "end": 1464.328,
    "text": " different cohorts have done this very differently sometimes it's been like uh in the discord just kind of like a different like an office hours and the math learning group which i i hope multiple um people will re-engage with however um has explored various topics related to on one hand the accessibility and onboarding to the math",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1464.511,
    "end": 1468.197,
    "text": " And on the other hand, to a lot of the rigor and derivations of the math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.898,
    "end": 1486.144,
    "text": "So it's done everything from kind of looking for just like a math-based overviews, curating resources on some of the background mathematics, like matrix algebra or stochastic calculus, different backgrounds in math learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.647,
    "end": 1489.729,
    "text": "We can explore notation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1490.67,
    "end": 1493.134,
    "text": "We have a lot of questions about math learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.076,
    "end": 1508.237,
    "text": " um like general questions about math and about how what we see in the analytical equations are related to these broader um philosophical questions or the domain specific questions that we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1508.909,
    "end": 1512.993,
    "text": " So, and then also there's ideas and insights.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1513.033,
    "end": 1523.183,
    "text": "And so here, just if people want to, like, it's not necessarily a question, but they just want to be like, oh, this is just like, this is an insight I had from like, then they can add it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.605,
    "end": 1527.067,
    "text": "There are resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.128,
    "end": 1537.617,
    "text": "So here, Ali's provided a nice list of extra resources with a rough ranking by technical level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1537.833,
    "end": 1546.955,
    "text": " So for people who want to to see other technical or non-technical resources on other videos and books.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1547.636,
    "end": 1553.53,
    "text": "But a lot of the resources are also just shared in the question where they're asked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1553.51,
    "end": 1577.948,
    "text": " um let's see future textbook groups so here's feedback forms um we'll update this so it has cohort four but you can just always leave feedback um you can share also just plain text notes with like these are things people have brought up previously about future textbook groups these are quite extensive um notes um errata there's a few typos in the book",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.991,
    "end": 1583.936,
    "text": " And so just small little comments or just other thoughts people have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.157,
    "end": 1601.114,
    "text": "Projects are a table here where people can write what their idea is for applying active inference and connect with other people who might be interested in something similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1602.034,
    "end": 1608.441,
    "text": "So these range from contributions that improve the textbook groups themselves",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1608.556,
    "end": 1629.04,
    "text": " like doing math derivations, recording the textbook as an audiobook, doing other kinds of enrichments and background materials on the textbook to just people who have different cognitive functions or systems of interest that they want to be applying active inference towards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1629.681,
    "end": 1637.871,
    "text": "But you can put little stub ideas and we can just revisit it periodically and especially towards the end of the textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.851,
    "end": 1656.383,
    "text": " um facilitate people working on these projects but like you're in the right place to literally learn the background information to facilitate these kinds of collaborations um last section is active inference tables",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.515,
    "end": 1681.307,
    "text": " so the active inference ontology you can go to this website this is essentially the language that we speak in active inference to understand the core ontology terms and there aren't an open-ended number of them I mean in principle there are but in in um the present moment there's only about 64. to understand these core terms and their relationships",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1681.81,
    "end": 1687.195,
    "text": " And their rationale is to be fluent in active inference as a language slash skill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.996,
    "end": 1691.779,
    "text": "So many of these terms are everyday terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1692.239,
    "end": 1697.464,
    "text": "Accuracy, action, attention, agency, agent, ambiguity, behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1697.504,
    "end": 1702.268,
    "text": "There are a few terms that aren't everyday terms like expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.009,
    "end": 1711.817,
    "text": "But regardless of your level of math familiarity with that equation in the specific, you'll be able to kind of see where it fits in to the ontology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1711.797,
    "end": 1716.261,
    "text": " And also translations are available for many languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1717.402,
    "end": 1728.352,
    "text": "If anyone has any other languages that they'd like to add or they see corrections, that's useful because of course the ontology is not English based in principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1729.032,
    "end": 1739.982,
    "text": "But we bring the ontology in as a table and that allows us to connect the questions that we have or the descriptions of equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1740.4,
    "end": 1761.042,
    "text": " with the terms and the formal knowledge structure so again like looking at equation 2.5 this equation for variational free energy can be looked at as an equation or we might want to hear it for an audiobook or just for our own understanding about the notation to see it written out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1761.173,
    "end": 1767.286,
    "text": " And then even further, there's like notes and discourse that people can have and derivations that can be provided.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1767.907,
    "end": 1780.212,
    "text": "So that's like how many ways that we can go from just this figure or this equation to integrating it more with what it means to learn and use active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.727,
    "end": 1798.15,
    "text": " Matt Bolian- Active inference research here's just some of our preliminary knowledge management type work based upon a project with RJ and blue where we use the ontology to then analyze the literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1799.075,
    "end": 1806.707,
    "text": " and assess, like, for example, the change in different term frequency through time in the open source active inference literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.727,
    "end": 1818.265,
    "text": "So these are the kinds of projects we have at the Institute, but can help provide surveying or analysis or awareness on the literature in a more structured way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.291,
    "end": 1835.292,
    "text": " um and live streams so like uh from this website you'll be able to see our several hundred live streams but we commonly reference these as the papers that are discussed and the guests who join are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1836.352,
    "end": 1838.134,
    "text": " we believe some of the most relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.976,
    "end": 1843.542,
    "text": "But if you are looking for other materials, this is like a good place to look.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.562,
    "end": 1847.908,
    "text": "So that is the overview of the textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.769,
    "end": 1853.054,
    "text": "Again, there are synchronous and asynchronous ways you can participate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.115,
    "end": 1854.116,
    "text": "It's all up to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1854.957,
    "end": 1862.427,
    "text": "Synchronously, the times are listed in the cohort four live meetings table, or you can join at the same time weekly if you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.773,
    "end": 1865.154,
    "text": " You can rewatch the videos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1866.215,
    "end": 1869.078,
    "text": "You can do your own work and your own practices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.279,
    "end": 1877.126,
    "text": "People are also encouraged to write questions to seed the discussions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1878.187,
    "end": 1889.578,
    "text": "And then when we come to chapter one discussion in two weeks, we're going to look at the cohort four questions that have been submitted and start with those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.453,
    "end": 1911.313,
    "text": " um and then look if um those are gone through to the other questions that have been submitted so we just take a active question-based approach during these discussions outside of this introductory um session they're broadly going to be like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1912.222,
    "end": 1924.921,
    "text": " hearing people's thoughts and reflections and questions arising and just looking to capture those questions and develop them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1924.941,
    "end": 1929.387,
    "text": "So does anyone have any thoughts or questions on this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1931.37,
    "end": 1932.051,
    "text": "Yes, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.872,
    "end": 1933.974,
    "text": "Daniel, I have a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.857,
    "end": 1936.418,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.798,
    "end": 1936.958,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.379,
    "end": 1937.519,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.74,
    "end": 1941.385,
    "text": "I was trying to get into this CODA website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.82,
    "end": 1943.101,
    "text": " that you just showed us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.544,
    "end": 1954.634,
    "text": "Somehow I couldn't get into it because it seems that Cohort 4 website is not up running.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.134,
    "end": 1956.015,
    "text": "Is that the reason?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.259,
    "end": 1962.042,
    "text": "I'm going to put the link again into the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1963.363,
    "end": 1964.825,
    "text": "What happens when you go to that link?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.786,
    "end": 1967.187,
    "text": "All right, let me try.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.917,
    "end": 1976.62,
    "text": " Yeah, it is working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.721,
    "end": 1979.062,
    "text": "Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.162,
    "end": 1979.522,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.623,
    "end": 1980.043,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.644,
    "end": 1981.024,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.768,
    "end": 1987.77,
    "text": "So I should bookmark this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.79,
    "end": 1989.232,
    "text": "This is a good link to bookmark.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1993.816,
    "end": 1997.78,
    "text": "So here's like from part one of cohort three, here's the video recordings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1998.621,
    "end": 2000.683,
    "text": "So it'll look just like that as we go through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2003.144,
    "end": 2006.068,
    "text": " Any other just thoughts or questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.982,
    "end": 2019.387,
    "text": "So yeah me again just one more question so in terms of learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.749,
    "end": 2026.958,
    "text": "style so we're going to read the question first read the chapters first right before the meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.36,
    "end": 2036.087,
    "text": " During the meeting it was all about discussion and answering and asking questions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.107,
    "end": 2039.698,
    "text": "Yes, broadly, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2040.269,
    "end": 2045.053,
    "text": " one does not have to read the chapter or anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.914,
    "end": 2049.037,
    "text": "If they don't have any time, of course they do not have to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2049.657,
    "end": 2053.641,
    "text": "That being said, we're going to discuss chapter one on this day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.401,
    "end": 2060.186,
    "text": "So the way to prepare for that discussion would be ideally to have read the chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2060.226,
    "end": 2066.292,
    "text": "Again, there's no complete understanding, but just like understand what is in the chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2066.332,
    "end": 2069.955,
    "text": "Maybe look at what the sections are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.644,
    "end": 2077.517,
    "text": " then if there is more time, then you can engage in more practices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2078.499,
    "end": 2084.991,
    "text": "So whatever practices around chapter one are aligned and relevant for you,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2085.578,
    "end": 2087.462,
    "text": " You could plan about learning chapter one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.662,
    "end": 2101.972,
    "text": "You could set aside the time to learn for chapter one, read chapter one, write short notes or a blog on chapter one, talk with a friend, connect with somebody in the textbook group, or just like with your colleagues or your friends.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.114,
    "end": 2106.962,
    "text": "Chapter one doesn't have equations, but a lot of the future ones will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.596,
    "end": 2120.515,
    "text": " you could look to the chapter one discourse in the CODA and review that discourse and see what other people have asked and then where you see relevant, add more resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2120.595,
    "end": 2128.167,
    "text": "If somebody put, you know, if there was two resources with examples and you know there's a third one, just add that example and that's huge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.387,
    "end": 2132.293,
    "text": "You can organize information so that it becomes more accessible for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.333,
    "end": 2135.278,
    "text": "So there's like less of an activation energy barrier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2135.63,
    "end": 2138.633,
    "text": " to learning or to contributing, however you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.634,
    "end": 2145.5,
    "text": "You can go on a walk or lift or something, meditate and think about chapter one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.783,
    "end": 2155.11,
    "text": "You can start to work with the computational implementations, the open source ones that are all listed here or however you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2155.13,
    "end": 2159.815,
    "text": "So each of these practices or more that people can suggest,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.925,
    "end": 2166.734,
    "text": " we kind of turn our attention to this chapter for that interval.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2167.916,
    "end": 2172.584,
    "text": "And we'll say, oh, and it's going to come up in chapter four, but here's how it's coming up in chapter one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2172.624,
    "end": 2184.503,
    "text": "So it's not like we're only in that one range of pages, but we try to keep that as our center of attention as we move through it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2185.394,
    "end": 2196.413,
    "text": " And then the best way that that could happen would be if the people who show up have done whatever preparation is relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.045,
    "end": 2204.466,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.913,
    "end": 2217.768,
    "text": " Maybe Ali or anyone else if there's a thought or question or what's um what's another something that would have been helpful to have known.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.828,
    "end": 2221.475,
    "text": "Earlier in the textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.162,
    "end": 2227.146,
    "text": "yeah just I wanted to mention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.868,
    "end": 2245.405,
    "text": " We're developing some supplementary materials, which I believe will hopefully prove helpful while studying chapters, especially the early chapters, and particularly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.773,
    "end": 2260.574,
    "text": " the most math-heavy chapter, namely the chapter four, because some of the mathematical details about the derivations of the equations are kind of glossed over in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.095,
    "end": 2266.262,
    "text": "So we hope that those supplementary materials will help to fill the gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.085,
    "end": 2275.155,
    "text": "Otherwise, I believe these discussions and the live sessions can be really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.574,
    "end": 2302.219,
    "text": " uh, helpful and illuminating, uh, and, uh, obviously, uh, one of the main objectives of these discussions is to clarify any, uh, misunderstanding or even, uh, deepen our, uh, insight, uh, into the matters of, uh, the contents of the book, even beyond, uh, the specific contents of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.239,
    "end": 2304.501,
    "text": "So, um, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2311.366,
    "end": 2337.863,
    "text": " yeah i mean it's the fourth cohort so we've done things some certain ways which you can see in the previous recordings also though it can always evolve so if you see um you want to try a different language office hour or you want to have a special session for just like math learning group focusing on the fundamentals",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2338.265,
    "end": 2360.172,
    "text": " Bayesian equation, matrix algebra, if you want to work with Ali and Jonathan on some of the derivation work, if you want to start to sketch out cases in a given domain, like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.383,
    "end": 2369.856,
    "text": " We just want to hold those up as practices as affordances opportunities for action for you in this group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2372.82,
    "end": 2378.088,
    "text": "communicate to others that those are possible ways to learn and apply active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2388.284,
    "end": 2389.045,
    "text": "Any other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.83,
    "end": 2392.112,
    "text": " Thoughts or questions on this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.003,
    "end": 2418.593,
    "text": "Well, if you want to join next week at the later time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2419.805,
    "end": 2423.511,
    "text": " You're welcome to, it'll be fairly similar to today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.571,
    "end": 2433.365,
    "text": "You can also join at the same time weekly where we'll be in cohort three, working through chapter six or 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2435.429,
    "end": 2443.521,
    "text": "Hopefully in two weeks from right now, we'll come back to chapter one and there'll be a bunch of new questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2446.065,
    "end": 2449.069,
    "text": "And then we're gonna look to cohort four questions first",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.332,
    "end": 2459.929,
    "text": " And and upload each other's questions again highly up voted questions we're going to make short videos for and if somebody like wants to do that kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2461.512,
    "end": 2471.85,
    "text": "project or or process, we can we can participate on that as well, but yeah we're just going to like look to see what questions people have raised in cohort for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2472.607,
    "end": 2474.148,
    "text": " whether they can make it to the meeting or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2474.168,
    "end": 2477.671,
    "text": "And if someone raises something new in the meeting, then we'll just add it as a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2478.732,
    "end": 2485.719,
    "text": "It'll all funnel into the chapter one questions so we can continue to improve the discourse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.779,
    "end": 2493.425,
    "text": "And again, so that we all have uncertainties when we're learning active inference or any topic that is the fundamental.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2493.465,
    "end": 2502.073,
    "text": "And so when those questions arise, we can either point towards where they've been addressed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2503.049,
    "end": 2506.633,
    "text": " or their new questions, which are special in their own way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2507.895,
    "end": 2509.516,
    "text": "So, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.638,
    "end": 2514.422,
    "text": "If anyone has any other comments in the last minute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.915,
    "end": 2526.176,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.0,
    "end": 2530.2,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.921,
    "end": 2531.622,
    "text": "In that case,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.833,
    "end": 2533.896,
    "text": " Yes, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2534.799,
    "end": 2539.713,
    "text": "And see you in one or two or whenever weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.922,
    "end": 2543.604,
    "text": "Farewell, everybody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2544.005,
    "end": 2544.326,
    "text": "Goodbye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.67,
    "end": 2546.332,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.433,
    "end": 2547.636,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_01"
  }
]