[
  {
    "start": 0.048,
    "end": 22.225,
    "text": " hello welcome everyone it is september 17th 2025 we are in active inference guest stream 120.1 with emmanuel adieffa olasupo who will be presenting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.407,
    "end": 27.613,
    "text": " Modeling Thought in Time, A Physics of Temporal Intelligence as the Next Frontier of AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.633,
    "end": 30.417,
    "text": "There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.557,
    "end": 35.002,
    "text": "So if you're watching live, please write any ideas or questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.703,
    "end": 38.426,
    "text": "And thank you for joining, Emmanuel, to you for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.429,
    "end": 41.05,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.07,
    "end": 43.793,
    "text": "I appreciate the invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.093,
    "end": 51.182,
    "text": "I'm incredibly humbled by the opportunity to give this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.533,
    "end": 72.091,
    "text": " The title actually is not Marlene's time, but this is the paper that I think connected you and I. And so I just wanted to start the presentation by sort of clarifying or motivating the talk based upon this paper, this preprint that I had published.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.772,
    "end": 80.899,
    "text": "And just to give a short summary of what the paper is about, you know, the argument is that the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 81.2,
    "end": 92.087,
    "text": " current LLMs that are being used right now, both in the industry and in academia, they have what we call a temporal blindness problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 92.455,
    "end": 99.249,
    "text": " which means that they do not represent time in the lived sense as humans do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.329,
    "end": 113.198,
    "text": "And so if the goal is to achieve conscious AI or AI that mimics human cognition and human's ability to manipulate thoughts and emotions, then this paper argues that time is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.566,
    "end": 123.52,
    "text": " a foundational feature that needs to be represented akin to how humans experience time in the sense of thinking in time and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.54,
    "end": 133.795,
    "text": "I'll get back to this towards the latter part of the presentation, but I just wanted to motivate the lecture based upon this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.897,
    "end": 140.846,
    "text": "The actual title of the talk is Temporal Intelligence and the Emergent Properties of Consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.847,
    "end": 143.269,
    "text": "Indeed,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.57,
    "end": 147.375,
    "text": " you know, I'm going to sort of break this talk into three components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.996,
    "end": 153.964,
    "text": "The first is I'm going to idea of course defined processes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.324,
    "end": 170.185,
    "text": "And so this is the type of process in that one would argue supports temporal cognition by structuring how information is organized over time and enabling the system to become more predictive and generative and generate expectations about the temporal sequence of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.519,
    "end": 171.58,
    "text": " Impendent inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.141,
    "end": 172.582,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.602,
    "end": 174.304,
    "text": "And so that course defined process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.364,
    "end": 177.048,
    "text": "And that's the first part that I'll talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.068,
    "end": 185.439,
    "text": "And I'll talk about the mathematics that perhaps governs that process, both within biological systems, but also artificial systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.002,
    "end": 193.29,
    "text": "The second part of this of this talk is going to be on this idea of predictive remapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.852,
    "end": 199.058,
    "text": "And this is an example of what I would think of as temporal cognition and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.628,
    "end": 226.362,
    "text": " right um um this is informed by um this idea of active sensing right uh this idea that uh cognitive systems must move in order to compute information in the world right and so i will also speak a little bit about this um and then the third part is the more um um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.282,
    "end": 236.942,
    "text": " speculative or perhaps more, it has the potential to be more paradigm shifting if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.682,
    "end": 245.01,
    "text": " one or myself or groups or others, anyone can achieve this idea of the emergence of thought, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.03,
    "end": 247.192,
    "text": "So how does your thought emerge?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.252,
    "end": 249.474,
    "text": "How do they flow and synchronize with other people's thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.975,
    "end": 253.038,
    "text": "And can we achieve a mechanistic view of consciousness, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.098,
    "end": 256.722,
    "text": "Because that I think is key into achieving AGI, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.782,
    "end": 258.124,
    "text": "Artificial General Intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.664,
    "end": 267.013,
    "text": "And so those three will be the, so this type-part type structure would be kind of how I go about giving this talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.478,
    "end": 275.587,
    "text": " And so I normally approach questions with physics and mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 275.867,
    "end": 277.249,
    "text": "So I'm a theoretical physicist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.269,
    "end": 278.971,
    "text": "My PhD is in theoretical physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.011,
    "end": 284.959,
    "text": "But I normally use the two to try to understand the phenomenons that I study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.979,
    "end": 289.064,
    "text": "And I particularly look at complex systems, particularly biological systems, to explore that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.085,
    "end": 292.208,
    "text": "And so that is important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 292.795,
    "end": 294.837,
    "text": " to sort of highlight my biases, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.857,
    "end": 299.602,
    "text": "We all have biases in which we use to sort of inform how we think about the world, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.866,
    "end": 308.211,
    "text": "So this idea of course defined, I'm illustrated here in this figure, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.792,
    "end": 319.123,
    "text": "So what you see here is, at least what you can appreciate here is that as you move towards the right, the scene gets more fine, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.677,
    "end": 323.563,
    "text": " And this is the general principle of course-defined processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.705,
    "end": 337.444,
    "text": "And so what I'm showing here is a cartoon of neurons in the brain that turns out they compute each part of this processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.464,
    "end": 342.912,
    "text": "And so you have these early cells, where I represented here, late cell, biphasic, and late.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.573,
    "end": 347.018,
    "text": "And so it turns out that in the mice brain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.656,
    "end": 354.923,
    "text": " They are neurons that compute each part of this kind of stage in course defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.943,
    "end": 369.758,
    "text": "And, you know, you can sort of see in this cartoon here, or in this experiment with Parker et al, where you have the mouse moving along this virtual world, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.699,
    "end": 374.423,
    "text": "And its neural activity is being recorded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.825,
    "end": 379.69,
    "text": " During that sort of toss that it has been asked to perform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.71,
    "end": 386.777,
    "text": "And you know the work this work here that I'm presented is done with Christopher Neil at the University of Oregon and he basically pioneered the field of Activision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.637,
    "end": 398.047,
    "text": "And what's very profound about this is that this is such a break from how biologists and neuroscientists do experiments because now these animals aren't head fixed, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.067,
    "end": 403.853,
    "text": "But they're actually moving the world akin to how we as organisms move into the world and collect information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.508,
    "end": 412.056,
    "text": " And so in this paper, they found this course to find process and phenomenon, which I've illustrated again here in cartoon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.677,
    "end": 412.917,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.878,
    "end": 419.704,
    "text": "But I want to emphasize that course to find process and is quite ubiquitous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.465,
    "end": 432.338,
    "text": "And what that actually means is that you can actually, you know, there are papers that have published course to find process and in other sensory modalities, hearing, smell, taste, touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.077,
    "end": 435.56,
    "text": " And so allow me to give you a simple example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.58,
    "end": 443.771,
    "text": "You can imagine you are in a group of crowd and you meet your partner, for example, and you spot her at a distant location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 444.452,
    "end": 450.38,
    "text": "What you might first do is sort of hear this sort of global and coarser voice of everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.94,
    "end": 456.688,
    "text": "And then as she approaches you closer, you kind of fine tune",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.09,
    "end": 463.197,
    "text": " your auditory system, in a sense, your brain will do that, and then you start to focus on a singular voice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.838,
    "end": 470.366,
    "text": "And so that's an example of this course-defined process and operating in the auditory system, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 470.426,
    "end": 480.798,
    "text": "And so you can find this process across sensory modalities, and it's not just across biological systems, but it's also artificial systems, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.838,
    "end": 484.262,
    "text": "And so the last paper that I cited here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.238,
    "end": 492.229,
    "text": " you know, they use course-defined processing to sort of optimize the grip of robots.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.57,
    "end": 495.494,
    "text": "So you can imagine a robot extends its arm, tries to reach for something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 496.035,
    "end": 507.073,
    "text": "It first needs to kind of get an understanding of the general area of the scene, and then over time will understand, oh, this is a cup, so I have to hold it in a particular way in order to maintain the grip, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 507.093,
    "end": 509.136,
    "text": "And so course-defined, excuse me,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.993,
    "end": 517.96,
    "text": " The point that I want to make here is that it's a ubiquitous way by which biological systems and artificial systems process information, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 519.742,
    "end": 534.855,
    "text": "And so what I am interested in understanding is what are the mathematics, what are the computations that these systems are performing in order to achieve the output that I've shown in this sort of nice illustration, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 535.356,
    "end": 538.819,
    "text": "And so the first thing, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.103,
    "end": 541.225,
    "text": " And so let me dive into that a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.266,
    "end": 552.257,
    "text": "And again, I am aware that perhaps people that are watching come from different fields.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.297,
    "end": 560.186,
    "text": "So I do apologize if it's a little bit too complicated or I haven't explained it as well as I would have liked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 560.506,
    "end": 561.888,
    "text": "But let me take a stab at this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.269,
    "end": 566.713,
    "text": "So what you see here is we're going to try to understand this phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.959,
    "end": 592.498,
    "text": " using what we call a recurrent artificial recurrent neural network right and so the hallmark of these networks is one they are connected right to each other so let's just say for example you see e and i there's a line that connects e and to i and i to e they also have self connections right so you see that e is connected to itself i is connected to itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 593.204,
    "end": 599.591,
    "text": " And they also have the ability to get input, external input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.611,
    "end": 604.978,
    "text": "And so these features or these components make up our current neural network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 606.179,
    "end": 609.723,
    "text": "And they also go in multiple directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.943,
    "end": 617.372,
    "text": "So it's not one way, like a feed forward direction, but also feedback and so on and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.871,
    "end": 625.22,
    "text": " People in the past have used these networks to try to understand phenomenons in the brain, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.681,
    "end": 632.811,
    "text": "And one of those is Murphy and Murphy Miller, 2009, where they published this paper called balance amplification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.373,
    "end": 637.377,
    "text": "And so allow me to try to explain a little bit of what this means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.437,
    "end": 638.378,
    "text": "What does it actually say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.139,
    "end": 639.36,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.041,
    "end": 644.147,
    "text": "So here is so we're going to be working with E&I networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.247,
    "end": 644.407,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.427,
    "end": 648.793,
    "text": "And these are excitatory and inhibitory networks in the brain, in the biological system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 649.55,
    "end": 661.042,
    "text": " And so here shows the equation, we call this a rate model equation, first differential equations, where you have E here, which represents the excitatory parts of that network, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.683,
    "end": 663.605,
    "text": "And then you have the inhibitory parts of that network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 663.625,
    "end": 667.369,
    "text": "So we have R, which represents the rate, right, of the network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.409,
    "end": 669.311,
    "text": "We have W, which represents the weight matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.112,
    "end": 675.938,
    "text": "And then you have I, which represents the internal or external input that the system will get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.359,
    "end": 678.561,
    "text": "And so you have this first order differential equation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 678.828,
    "end": 683.194,
    "text": " that basically will tell us, we think of this as the governing equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.234,
    "end": 687.48,
    "text": "It will tell us how the network behaves over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.5,
    "end": 696.873,
    "text": "And so this is the tradition that I was working from when I wanted to understand the mathematics governing a course to find.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.895,
    "end": 703.282,
    "text": "And so what I have done is basically I took the same governing equations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 703.302,
    "end": 705.465,
    "text": "So E here just represents I the same way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.485,
    "end": 707.468,
    "text": "So this represents the external input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.393,
    "end": 711.617,
    "text": " And I have solved this equation in a fundamentally different way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.518,
    "end": 719.067,
    "text": "And so that equation and the solution for that equation is what we call, what we think of as the course-defined solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.908,
    "end": 737.59,
    "text": "And so this solution here, what is unique about it is that instead of each unit in the network having a single time by which it's perturbed or responsive, it actually has a heterogeneous, it has the ability to have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.143,
    "end": 741.688,
    "text": " Each neuron has the ability to have its own temporal dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.17,
    "end": 755.468,
    "text": "And you can imagine if you want to understand something like course defined, you need a temporal handle in order to kind of play with and parametrize in order to try to simulate whether or not the model can achieve the particular output.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.47,
    "end": 764.341,
    "text": "And so that is the novelty of solving this particular equation in the way that I've solved it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 764.782,
    "end": 766.885,
    "text": "And this is kind of like the first type of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.337,
    "end": 771.142,
    "text": " This is the first time that such an equation has been solved in this manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 772.044,
    "end": 779.735,
    "text": "And I think of this as a general form of this solution because it can be generalized to a lot of other things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.755,
    "end": 791.792,
    "text": "So you can imagine it can be generalized to, you know, not just vision, but, you know, different sensory organisms, sorry, different sensory modalities like audition and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.447,
    "end": 803.32,
    "text": " as so long as it has this handle of time and something that is trying to, a preferential object, in this case, let's say vision, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.762,
    "end": 819.079,
    "text": "And so this cartoon, if you may, right, this is the case when if you were to draw a diagram of the neuron, two neurons, for example, right, so E and I,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.802,
    "end": 826.034,
    "text": " But this diagram is basically showing more of a population representation of the network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.876,
    "end": 831.545,
    "text": "And we're going to think of the network as not just E and I, but we're going to think of them as having two different modes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.126,
    "end": 838.338,
    "text": "So you can imagine the network interacts with each other, and you have what we call the difference mode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.358,
    "end": 842.586,
    "text": "So you have E and I, whereby they're kind of competing with each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.022,
    "end": 870.683,
    "text": " right and you have another mode where you have e plus i and the sum and they're summoned together in a sense right to produce some type of effect i know that's the mouthful that's a little bit hard to process right but i just what i want you to take away from it is that when we look at these networks we're going to look at the modes by which these networks operate within so we have the sum mode and we have the difference mode and it turns out that the difference mode right is what actually creates the initial amplification in the system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.372,
    "end": 876.538,
    "text": " So let's say, for example, when E and I are imbalanced, you have this initial amplification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.319,
    "end": 881.924,
    "text": "That's how you can maybe understand the initial parts of this time series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 881.944,
    "end": 884.487,
    "text": "So in this case here, E and I, they're imbalanced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.507,
    "end": 899.944,
    "text": "The network amplifies, right, based upon its feedforward connection to E plus I. And then as this minus W plus gets stronger, you get an inhibition, and then the network goes down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.477,
    "end": 906.187,
    "text": " And so this is the type of network that and so this is the type of behavior that we would expect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.73,
    "end": 913.022,
    "text": "And so remember, the goal here is to simulate course defined processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.082,
    "end": 913.242,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.262,
    "end": 916.389,
    "text": "And so on the B here is the experimental results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.612,
    "end": 917.872,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.993,
    "end": 921.099,
    "text": "That I've shown earlier in the cartoon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.119,
    "end": 921.46,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.794,
    "end": 932.729,
    "text": " And then here is the response of the network that I just showed you when we don't solve the equation the way that we the way that I've solved it with the course defined solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 933.651,
    "end": 939.118,
    "text": "And, you know, you don't have to be genius to realize and see that these two are not the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.138,
    "end": 947.43,
    "text": "And so what this is saying is that the way that the way by which these government Murphy Miller saw this equation cannot produce course defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.363,
    "end": 955.689,
    "text": " But what if we used the course-defined solution, the one that I noted earlier?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.709,
    "end": 961.395,
    "text": "What you start to see is something a little bit, it starts to resemble B, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 962.617,
    "end": 966.621,
    "text": "But here's the catch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.822,
    "end": 973.108,
    "text": "This simulation here is the case where there is no input into the network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 973.128,
    "end": 977.213,
    "text": "So this is actually, imagine you have a network or you have a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.233,
    "end": 979.375,
    "text": "Imagine I took a ball and I put it on top of a hill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.013,
    "end": 980.313,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.135,
    "end": 990.367,
    "text": "Because of the and I didn't touch the ball at all because of the the structure or the architecture of the hill, the ball will just roll down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.228,
    "end": 991.389,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.429,
    "end": 996.456,
    "text": "So you can think of that as the internal dynamics of the system where there is no no one pushed the ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.756,
    "end": 1000.942,
    "text": "There is just basically the system that you're trying to understand and how it behaves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.983,
    "end": 1009.834,
    "text": "And so but at the same time, you see that it doesn't quite mimic B. Now, if I.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.59,
    "end": 1017.599,
    "text": " create an input into E and I, you can see that D and B looks very similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1018.32,
    "end": 1019.542,
    "text": "So what does this actually mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1020.082,
    "end": 1021.844,
    "text": "What does this actually mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.865,
    "end": 1040.108,
    "text": "What this means is that when you think about course defined, when you think about systems in general, it seems that systems have this internal structure that is almost tuned or prepared to behave or be amplified in a way that represents the way in which the inputs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.898,
    "end": 1042.18,
    "text": " kind of favor, if you may.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.781,
    "end": 1042.961,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1043.361,
    "end": 1046.726,
    "text": "And so basically what this is saying is that, you know, in short.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.789,
    "end": 1056.5,
    "text": "You can understand course to find using these government, this solution that I have that I have sort of put forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.182,
    "end": 1061.607,
    "text": "He just to not complicate things any further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.708,
    "end": 1093.332,
    "text": " this or this is my screen i can't get feedback from anyone but danny can you see my screen can you see my mouth perfect so here you see that e so so so on the y-axis here is the kind of distribution of how i set the time constants of each neuron because if you remember in in my governing equation each neuron can have a different time constant right and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.51,
    "end": 1117.243,
    "text": " this here shows that for this kind of like let's take an example this trace here that represents a certain class of neurons the early neurons i set the excitatory neurons to be slower than inhibitory neurons right because you know the higher the value the slower the lower the value the foster right and then you can see that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.966,
    "end": 1121.691,
    "text": " For this set of neurons, I set it to be the same thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.751,
    "end": 1124.775,
    "text": "Excitatory neurons are faster than the inhibitory neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.195,
    "end": 1127.939,
    "text": "But you can see that the net average of it is slower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.959,
    "end": 1130.342,
    "text": "So you see this difference between excitatory and inhibitory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.362,
    "end": 1132.525,
    "text": "You see the peaks different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1132.545,
    "end": 1140.435,
    "text": "But you can see, for example, the biphasic, it's almost a flip where the excitatory neurons are slower or faster than the inhibitory neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.296,
    "end": 1142.758,
    "text": "And so this is something that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.346,
    "end": 1153.482,
    "text": " Now the experimentalists can go and say, OK, let's measure specifically the inhibitory neurons and see whether or not they actually represent or recapitulate the model's predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.502,
    "end": 1153.702,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1154.323,
    "end": 1160.292,
    "text": "And this is kind of the point of like why, you know, you know, for those that are not necessarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.609,
    "end": 1165.877,
    "text": " interested in modeling and mathematics, you might wonder, like, why model these things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.418,
    "end": 1178.837,
    "text": "It's because these models will generate hypotheses and intuitions that experimentalists can now go and test and say, okay, you know, maybe in the biphasic neurons, right, in the biphasic group, the one that looks like an S,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.07,
    "end": 1179.45,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.971,
    "end": 1190.242,
    "text": "Based upon Emanuel's predictions, we expect the when we measure the time of the inhibitory neurons, we expect them to be slower than the excitatory neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.262,
    "end": 1190.442,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.982,
    "end": 1203.255,
    "text": "And so this is kind of, you know, what we did when we tried to understand whether or not these equations actually recapitulate the biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1204.94,
    "end": 1208.124,
    "text": " So, you know, so that's the first part of what I'm going to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1208.144,
    "end": 1225.887,
    "text": "This idea of course defined and how it kind of, it kind of gives you a hint as to how the systems kind of are, how the functional architecture or the structure, the internal dynamics of the system is almost prepared to process information in a way that makes sense, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.907,
    "end": 1231.434,
    "text": "In a way by which is economically efficient or energetically efficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1231.454,
    "end": 1231.774,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1232.345,
    "end": 1237.672,
    "text": " And so the second part, I'm going to talk about this idea of what I call retinotopic mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1239.054,
    "end": 1250.509,
    "text": "This is a little bit more of the physics side of me informing some of these questions that people have been trying to solve for many years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.71,
    "end": 1257.338,
    "text": "So should I wait for questions or should I continue to go, Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.358,
    "end": 1260.802,
    "text": "Because it's a bit of a mouthful, the first part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.822,
    "end": 1261.423,
    "text": "Let's continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.483,
    "end": 1292.187,
    "text": " excellent okay so the the second part here i'm going to talk about this idea of predictive remapping and so retinal topics is remap is basic retinal topic mechanics is basically a field that i have put forth right a hybrid of physics and neuroscience and you know the the the the the framework came about based upon this notion of or this idea of um uh um um um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.723,
    "end": 1295.386,
    "text": " a motion blur that happens when you make eye movements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.307,
    "end": 1298.269,
    "text": "So here I'm showing a human eye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.01,
    "end": 1303.415,
    "text": "Here I'm showing the mouse, the eye of a rodent making eye movements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.816,
    "end": 1311.104,
    "text": "And then here I'm showing the eye of a mouse, sorry, a Drosophila, which is like a fly in a sense, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.605,
    "end": 1315.329,
    "text": "And you can see that all of these systems across scale, they make eye movements, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1315.389,
    "end": 1319.794,
    "text": "They actively make eye movements around the world to try to collect information, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1321.158,
    "end": 1344.718,
    "text": " and one of the things that that happens is that whenever you make an eye movement you experience this kind of motion blur right like but sorry you don't experience it but that's actually what happens and so your brain needs to find a way to kind of eliminate and cancel this motion blur so you can see and experience the world in a very continuous and fluid manner",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.66,
    "end": 1352.152,
    "text": " And so one of the questions in neuroscience and physicists and mathematicians have been trying to answer for many years is how does this happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.916,
    "end": 1353.78,
    "text": "Why is it that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.402,
    "end": 1358.987,
    "text": " You know, you don't experience what you would experience if you were like taking a picture with a camera, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.347,
    "end": 1367.596,
    "text": "Imagine if the train passed you and you try to take the picture, right, of this fast train with the camera, you would experience the blurriness of that train.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.097,
    "end": 1373.823,
    "text": "But you and I make these eye movements all the time if you think of the eye as a camera, but we don't experience this motion blur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1374.103,
    "end": 1376.025,
    "text": "How does the brain achieve that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.085,
    "end": 1381.651,
    "text": "That's really the question that informed this computational framework that I introduced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.233,
    "end": 1384.054,
    "text": "And so,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.709,
    "end": 1387.753,
    "text": " Many people think of neurons as perceptrons, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.953,
    "end": 1390.036,
    "text": "Or like a thermometer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.056,
    "end": 1392.799,
    "text": "Where, you know, imagine you had a thermometer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.819,
    "end": 1395.163,
    "text": "It would give you the measurement and it would go back down, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.443,
    "end": 1399.208,
    "text": "Or perceptron, where it's a linear weighted sum of the inputs that you put into the network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.568,
    "end": 1402.492,
    "text": "And that's basically the foundation of, you know, AGIs, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.532,
    "end": 1405.896,
    "text": "Where you have these perceptrons and they're performing these operations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1407.398,
    "end": 1410.362,
    "text": "And so with this, you know, I radically turn things on its head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.382,
    "end": 1413.366,
    "text": "And I think of these, I think of neurons as spring-loaded sensors, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.903,
    "end": 1443.42,
    "text": " especially because i'm interested in this idea of movement and active sensing so it's not that the neurons themselves are moving but they're they're they're getting information from different parts of the brain that is almost um tethered to where in space they need to acquire information right so you can imagine if i wanted to look here right because i have these two monitors so it looks like i'm looking away but imagine if i if i wanted to look here right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.025,
    "end": 1466.202,
    "text": " right i would have to sort of allocate some resource towards this part of the visual scene right in order to achieve some level of uh perception right or some desirable outcome and so what you see here is not the neurons themselves moving but how the brain or how these neurons are operating like springs in order to allocate different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.435,
    "end": 1470.461,
    "text": " neural resources in different parts of space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.802,
    "end": 1473.005,
    "text": "In this case, visual space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.025,
    "end": 1480.857,
    "text": "So A here is sort of, you know, this spring sort of being attracted to this moss, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.54,
    "end": 1484.022,
    "text": "B here is a case where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.761,
    "end": 1485.802,
    "text": " It's unresponsive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.102,
    "end": 1492.788,
    "text": "So you can imagine a maladaptive case where, you know, you don't want to pay attention to something and so you self-inhibit, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1492.908,
    "end": 1497.192,
    "text": "Or maybe a disease model where you can't pay attention, ADHD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1497.513,
    "end": 1501.496,
    "text": "You can imagine here C being a case where you hallucinate, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1501.516,
    "end": 1506.121,
    "text": "So instead of you responding to N, you start responding to something else, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.721,
    "end": 1513.047,
    "text": "And this larger field that you see is what I refer to as elastic fields.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.972,
    "end": 1523.685,
    "text": " These things have no empirical support yet, but this is something that I think is foundational in understanding active sense and active vision, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.188,
    "end": 1529.313,
    "text": "And so I'm not going to go too much into details of this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.674,
    "end": 1538.566,
    "text": "There's a paper that you can read where I published in Physics Review where I outlined comprehensively these equations and how the prediction goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.267,
    "end": 1543.573,
    "text": "But in short, I bring together a range of papers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.093,
    "end": 1552.225,
    "text": " that show that, hey, maybe what the brain is doing, it's undergoing these predictive shifts prior to an eye movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.906,
    "end": 1559.956,
    "text": "And these predictive shifts are what kind of blunts this motion blur that would normally occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.338,
    "end": 1571.333,
    "text": "But what I found in this paper, just to conclude, is that these processes, these predictive processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1571.583,
    "end": 1594.418,
    "text": " they're all happening but they're happening at distinct windows in time so for example you can imagine if i wanted to look at an object that is here the peripheral moss would be the thing that is actually pulling the system prior to me making the eye movement and so that predictive remapping of the neurons right of the springs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.938,
    "end": 1599.989,
    "text": " That would go prior to me making an eye movement such that I wouldn't actually see the intermediate parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.35,
    "end": 1614.381,
    "text": "So it's almost like the resources that I have here would kind of predictably go here so that when I make the eye movement, there is no resource that is actually computed in the intermediary parts for me to actually experience the motion blur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.85,
    "end": 1618.275,
    "text": " And so that's the general gist of this kind of idea of predictive remapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.715,
    "end": 1628.989,
    "text": "And my contribution is that I think that the computations and the way to think about this is in the terms of forces, is in the terms of Newtonian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.91,
    "end": 1637.28,
    "text": "And like I said, you can look at the paper if you want to know more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.32,
    "end": 1639.643,
    "text": "Ask me questions after this talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.551,
    "end": 1648.102,
    "text": " Now, let's get to the more fun part of this talk rather than the more, I guess, technically intense part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1648.903,
    "end": 1660.381,
    "text": "So ultimately, right, like, you know, the connection is to understand these temporal dynamics in the brain in order to be able to understand consciousness and eventually apply it to artificial intelligence systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.342,
    "end": 1667.832,
    "text": "And so the first part of this is to understand consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1668.453,
    "end": 1668.673,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.234,
    "end": 1670.035,
    "text": "And, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.875,
    "end": 1684.355,
    "text": " I think that, you know, I normally use this example as a metaphor to understand conscious behavior or collective intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.617,
    "end": 1689.243,
    "text": "So what you see is that, you know, this process is called murmuration, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.924,
    "end": 1698.537,
    "text": "And so what you see is that each of these birds, right, they are on one level individuals, but on another level,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.04,
    "end": 1699.901,
    "text": " They're a collective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.921,
    "end": 1700.902,
    "text": "They're part of a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.922,
    "end": 1702.464,
    "text": "They're part of a larger network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.367,
    "end": 1712.056,
    "text": "And what you see is that, you know, at some level of description, you know, you see it looks like a chaotic system, very random, very stochastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.617,
    "end": 1720.106,
    "text": "But then at another level, you start to see this kind of collective behavior, this emergent property where they're kind of moving in a very structured manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.168,
    "end": 1724.452,
    "text": "And so I normally think about humans in this sense, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.492,
    "end": 1727.055,
    "text": "I normally think of thought in this sense, or even neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.491,
    "end": 1729.554,
    "text": " And I'm not the first to think about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.594,
    "end": 1738.927,
    "text": "Giorgio Parisi, who won the Nobel Prize, a physicist, kind of used the bird flocking as one of the systems that he studied to understand complex systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1740.309,
    "end": 1749.362,
    "text": "And so one of the things that I'm doing right now is to understand these systems in terms of dynamical system, in terms of tractors specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1750.303,
    "end": 1752.807,
    "text": "And, you know, many people have done this before, but not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.052,
    "end": 1783.114,
    "text": " applying it to the question or to the phenomena that i will be applying to which i'll talk about in the next slides and so we have these things called attractors in physics and you know here i'm showing you a strange attractor a tourist attractor a cycle attractive and then here's the point attractive so just to give some intuition right you can think about a pendulum if i had a pendulum for example and i move that pendulum and i let it go right that pendulum at some point",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.09,
    "end": 1804.95,
    "text": " will stop right at the center so there's a particular point that's attracting that pendulum right and that's an intuition that can give you about what a point attractor is right a simple pendulum right the the dynamics of that of that of that system reflects a point attractor and so is there a tractor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1805.386,
    "end": 1808.229,
    "text": " Is there an attractor that can help us understand consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1808.249,
    "end": 1812.354,
    "text": "And specifically what I mean in this term by consciousness is just mental thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.854,
    "end": 1822.585,
    "text": "I think of mental thought or mental content as kind of something you need to understand in order to understand consciousness or put forth a theory of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1824.908,
    "end": 1827.951,
    "text": "And so one question that I think needs to be asked is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1828.37,
    "end": 1838.985,
    "text": " or something that I believe is that to understand consciousness and leverage the insights to build conscious AI, we need a database to use to study and ultimately uncover the fundamental laws governing consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.247,
    "end": 1847.758,
    "text": "And so I would argue specifically in the scientific domain and the academic domain, there is no such database, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1847.979,
    "end": 1857.853,
    "text": "At the very most, you have consciousness researchers looking at maybe 50 subjects or two people in the lab and an fMRI study and, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.188,
    "end": 1865.162,
    "text": " I don't think that data is sufficient in order to understand something as dramatic, if you may, as consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.545,
    "end": 1867.427,
    "text": "And here's an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.068,
    "end": 1876.565,
    "text": "I want you to ask yourself, is there someone in the world right now having the same exact thought as you at this very moment in time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.805,
    "end": 1879.15,
    "text": "And if there was, how would you even measure this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1879.67,
    "end": 1879.971,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.412,
    "end": 1885.043,
    "text": "There is I mean, I'm sure Google has this data, but they're not interested in actually studying consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.063,
    "end": 1887.128,
    "text": "They're interested in selling you shit that you don't want to buy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.569,
    "end": 1887.769,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.27,
    "end": 1891.678,
    "text": "But in short, right, like from, you know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1892.881,
    "end": 1895.788,
    "text": "When you think about the study of consciousness and the history of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.106,
    "end": 1924.29,
    "text": " there's not a lot of there isn't any data set that you can actually mine or study to explore to actually give you intuitions about what possibly could be consciousness or collective intelligence and how you can even apply that to an a conscious ai right if if such was even possible and so that is what led to the this you know the the introduction of conversation net and so conversation that is a repository that um has",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.743,
    "end": 1948.827,
    "text": " spontaneous human conversations in real time that you can actually use as a way to measure whether or not uh for example is there someone saying the same exact issue in this exact time right you can start to understand these types of questions or at least study these types of questions and so we just released uh the third uh database for conversation that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.684,
    "end": 1965.043,
    "text": " And just to give you an example of that, you can sort of go on the ConversationNet website and you can just download this data for free and sort of try to understand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1965.344,
    "end": 1969.31,
    "text": " or try to sort of mine this data, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.61,
    "end": 1983.871,
    "text": "And a lot of this data are anonymized, consent of people, and they're coming from my other company, Figbox, that one of the core attributes is connecting people through 20-minute conversations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.292,
    "end": 1993.005,
    "text": "And so I just found that as a useful way to sort of support scientific research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.492,
    "end": 2006.796,
    "text": " There are some people in the audience that may be aware of ImageNet, which is a database that basically was foundational to introducing data into machine learning systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2006.916,
    "end": 2011.264,
    "text": "And as a result, ImageNet was used to build AlexNet,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.497,
    "end": 2017.743,
    "text": " And, you know, here is Professor Hilton, who recently won the Nobel Prize last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.883,
    "end": 2021.086,
    "text": "And this is his student, Alex, who built AlexNet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.387,
    "end": 2035.24,
    "text": "And so a lot of this, we think that, you know, conversation that is really important into not just studying consciousness and complexity, but also can help in building conscious AI, more human-like AI, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.28,
    "end": 2038.483,
    "text": "Studying human conversations, spontaneous conversations, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.003,
    "end": 2066.395,
    "text": " and and you know alex net led to let's say for example some of the software is used for facial recognition self-driving cars and so forth and so what are some of the things that we want to use on conversation that as far as like to study uh uh um these types of uh uh properties right one of the things we you know some of the things can be this idea of self-recurrence inter-agent synchronicity you know phase relationship invariance and then uh propagation and variance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.83,
    "end": 2091.707,
    "text": " and so let me just give you a simple example of that so here's a case of of someone's conversation right this individual was having a conversation right and what we did is we measured i'm sorry i'm showing an instance where the person is saying the same exact phrase at different points in time and what you can see is you can see kind of this structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.227,
    "end": 2104.505,
    "text": " in this what we call motor cognitive maps, where you kind of see the same structure emerge when a person is seeing the same thing at different points in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2104.885,
    "end": 2117.344,
    "text": "And so this is some of the ways in which you can start to measure and visualize these sort of things that I've, these sort of, these sort of phenomenons that we're interested in exploring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2117.684,
    "end": 2120.428,
    "text": "And we think of these phenomenons as temporal invariance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.712,
    "end": 2121.092,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.553,
    "end": 2138.814,
    "text": "Things are things that kind of have this predictive pattern that you can kind of tease out from this dataset in order to understand the idea of whether or not, you know, there is some emergent property happening as people are having different thoughts and different speeches and different parts in space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2140.236,
    "end": 2145.522,
    "text": "And so here is just a simple example of how you would think about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.025,
    "end": 2147.387,
    "text": " attractors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.108,
    "end": 2152.876,
    "text": "So what you can see is that there are four attractors in this kind of fictitious simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.677,
    "end": 2159.166,
    "text": "And each individual, you can think of that as every individual having some thought in some time window.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2159.707,
    "end": 2165.516,
    "text": "And so each individual in some ways are being attracted to a particular type of thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.536,
    "end": 2168.561,
    "text": "And so let's say, for example, some famous person just died.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.704,
    "end": 2172.066,
    "text": "You can imagine that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.333,
    "end": 2194.999,
    "text": " that you know a lot of people are talking about those things and so they're attracted to that thought right within some window in time right and so this is kind of again this is fictitious right this is not actual data but this just gives you an idea of how you can um how i'm thinking about using a track just to understand and and uh uh this idea of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.182,
    "end": 2224.142,
    "text": " thoughts or consciousness and again how you can start to mind this type of data to ask these very kind of sci-fi questions that you know prior to conversation that you really can't answer these questions because there's no data to answer now you know ultimately right you know a lot of what I just talked about is very new and you know very orthogonal and very different from the way people think about these things and I understand that um and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2224.696,
    "end": 2247.514,
    "text": " we can just do is you know is there a way for us to learn something about the data that we're on where we're measuring and just add some sort of temporal invariance layer to these networks that you know open ai and anthropic and gemini right these llms right these uh these uh transformers right and you know i'm not particularly um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.355,
    "end": 2269.553,
    "text": " uh uh optimistic about that part i think to get agi we need to fundamentally build new systems that are radically different right but one of the things that we've done um is build digital twins right and so this is just a this is and this was done actually a lot i i've included these individuals that you see at the bottom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2269.82,
    "end": 2276.367,
    "text": " Because they kind of inform the way that I think about, they kind of teach me, to be honest, the way that I think about artificial networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.387,
    "end": 2280.651,
    "text": "So this is someone like, there's a brother to me, Kikurimusa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.612,
    "end": 2284.976,
    "text": "You know, he's a machine learning expert in London.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.356,
    "end": 2287.078,
    "text": "And then this is Daniel Olds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2287.098,
    "end": 2293.785,
    "text": "Him and I work with the conversation at a database and we try to understand systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.508,
    "end": 2308.362,
    "text": " And I should mention that this right here is actually, for the most part, built and trained by Timothy, who is another young, brilliant individual that works with us on ConversationNet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.683,
    "end": 2316.811,
    "text": "And so basically what we did is we took these LLMs and we trained them on ConversationNet data to see whether or not they improved performance or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.432,
    "end": 2323.738,
    "text": "And so in short, there are ways in which we can use the LLMs now to try to understand whether or not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.326,
    "end": 2328.851,
    "text": " They will sort of create more human-like responses and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.412,
    "end": 2331.514,
    "text": "But like I said, I'm not particularly convinced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2332.435,
    "end": 2341.666,
    "text": "And I think the endeavor of maybe building new types of systems could potentially be fruitful and groundbreaking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.587,
    "end": 2349.675,
    "text": "And so I go back to this paper that I initially brought up at the start of my talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2350.145,
    "end": 2377.468,
    "text": " um where it's like how do we build systems that think in time how do we build agi that think in time are predictive that can maybe create causal causal temporal inferences and things like that so i've been sort of talking to a very uh you know off you know he he's pretty out there this this guy and and i love him for that and him and i talk a lot about systems and um how to think about systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.938,
    "end": 2384.987,
    "text": " And, you know, Rob, you know, we've been thinking about and sort of playing around with this idea of polychronous systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.748,
    "end": 2386.99,
    "text": "So let me explain that a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2388.331,
    "end": 2407.776,
    "text": "What I'm showing you here is a network that has two layers, layers I and layer J. PI, P2 and P3, they represent, let's say, C, A and T. What defines a polychronous group is the temporal pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.414,
    "end": 2437.729,
    "text": " that um that leads it to let's say for example the second wave so in this case here pi is connected to cat with the latency of one p2 is connected to cat with the latency of five p3 is connected to capital latency of nine right for this word cat to be encoded there needs to be an activation key and a delayed key so in a sense the activation key needs to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2438.57,
    "end": 2468.003,
    "text": " uh configured in a way by which they all activate this node at the same exact time and so you need an activation key that is almost an offset to the delay key and so if you were to add this together like that same example we add eight to um eight to nine eight to one sorry you would get nine zero to nine you would get nine four to five you get nine and so in a sense",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.299,
    "end": 2486.113,
    "text": " If you just took this very simple example as the initial measure or the initial way by which the network is computed or encoded words, you can kind of instantly see that it has to do some temporal computation for it to encode a word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.275,
    "end": 2491.003,
    "text": "This is radically different from, let's say, the way LLMs are now where you have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.557,
    "end": 2495.102,
    "text": " Let's say C as a vector that has a series of numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.603,
    "end": 2498.026,
    "text": "You have A as a vector with a series of numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.467,
    "end": 2500.871,
    "text": "You have T as a vector with a series of numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.171,
    "end": 2505.858,
    "text": "And they're just basically doing these statistical correlations with these tokens, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.118,
    "end": 2516.914,
    "text": "But what's happening here with these polyclinic systems is that the system is actually having to think about the temporal order and the temporal differences in order to encode time, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.575,
    "end": 2519.758,
    "text": "And so, sorry, in order to encode words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.076,
    "end": 2524.423,
    "text": " And so what you can get is an increase in representational capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.064,
    "end": 2525.284,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.504,
    "end": 2528.849,
    "text": "You can also get emergent behaviors like self-organizing behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2529.731,
    "end": 2535.399,
    "text": "I don't want to go too much into that, but I'm more than happy to explain what that is in the in the question section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.18,
    "end": 2543.772,
    "text": "But in short, like this is kind of the work that I've been doing from a both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.14,
    "end": 2548.586,
    "text": " from the biological side and the stuff that I've been doing from an artificial side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.027,
    "end": 2566.83,
    "text": "Again, I understand that this may not be what you guys are used to hearing when it comes to active inference, but hopefully some of the ways that I'm thinking about things, at least one or two of the things that I've talked about, kind of informs or helps think differently about some of the questions that you all may be engaged in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2567.451,
    "end": 2571.717,
    "text": "And yeah, I appreciate, again, the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.507,
    "end": 2575.851,
    "text": " the opportunity to talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.151,
    "end": 2593.992,
    "text": "And again, a lot of the pictures that you've seen through the course of this talk is just the people that are critical to either get in the data, analyze the data, the conversations that I've had with the data, or just some of my work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.393,
    "end": 2598.638,
    "text": " Um, yeah, I, I would entertain any, uh, questions or comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.698,
    "end": 2599.258,
    "text": "Thank you again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.458,
    "end": 2606.346,
    "text": "And, um, it's glad to, um, share some of these ideas, some of these crazy, some, some a little crazy, but it was good to share them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.888,
    "end": 2609.229,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.77,
    "end": 2611.191,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.894,
    "end": 2614.234,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.995,
    "end": 2615.315,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.737,
    "end": 2620.601,
    "text": "So for people watching live, they can write a question in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.761,
    "end": 2621.582,
    "text": "I'll read one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.068,
    "end": 2623.67,
    "text": " And we'll just go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.69,
    "end": 2625.171,
    "text": "I wrote down a few things as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.312,
    "end": 2637.005,
    "text": "So Hongzhu wrote, how many inevitable overlappings could there be between complexity versus consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.805,
    "end": 2644.633,
    "text": "Is it safe enough for us to assume analyzing complexity is inevitably connected to explanation of consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.149,
    "end": 2674.587,
    "text": " let me just reread it how many inevitable overlapping could there be between complexity versus subjective and phenomenal consciousness so maybe just yeah how do we think about that overlap that's a good question i mean i'm just going to leave this uh this uh image because it's so beautiful and so if no one likes my arms at least they have something good look good to look at so basically right like when i think about i think that's an excellent question because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.107,
    "end": 2678.513,
    "text": " Ultimately, complexity is connected to consciousness, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2678.973,
    "end": 2682.98,
    "text": "Understanding the different scales of things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.521,
    "end": 2691.133,
    "text": "And then eventually understanding how that can inform the question of subjective experience and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.035,
    "end": 2694.278,
    "text": "Let me be a little bit more precise with my answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.742,
    "end": 2698.465,
    "text": "You know, I actually just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.9,
    "end": 2705.589,
    "text": " connected with the Santa Fe Institute in New Mexico, which they sort of pioneered complexity science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.691,
    "end": 2720.25,
    "text": "And, you know, one of the things that I proposed is understanding, using the brain, for example, to understand certain laws and then seeing whether or not they scale across different phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.31,
    "end": 2722.613,
    "text": "Let's say, for example, societal groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2722.863,
    "end": 2729.093,
    "text": " or cells or humans or other organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.473,
    "end": 2734.581,
    "text": "And so I think ultimately complexity and studying it is important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.162,
    "end": 2743.515,
    "text": "The only thing about that is that there have been previous work that have shown that under complexity, stability breaks down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2744.657,
    "end": 2751.267,
    "text": "So the more complex you study something, apparently, the more unstable the system becomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.668,
    "end": 2757.199,
    "text": " And so I think the challenge there, or I think the opportunity is how do we study complexity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.081,
    "end": 2772.85,
    "text": "And, you know, the question of can complexity bring forth some stable phenomenon or some stable predictions that mimics kind of, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.403,
    "end": 2799.816,
    "text": " biological systems for example and the idea of thought and conversations or you know um systems that are adaptive and optimal and so on so i think yes in short complexity is is is is is one of the frontiers and understanding um consciousness and even bringing us to a better understanding of uh how to build conscious ais awesome all right next question is from bert he wrote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2800.302,
    "end": 2802.264,
    "text": " There's two questions, so we'll just do one at a time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.284,
    "end": 2802.825,
    "text": "First question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.586,
    "end": 2807.69,
    "text": "Could you explain the mechanics implied in the spring visualization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.815,
    "end": 2819.483,
    "text": "Yeah, that's a... Again, whoever asked that question, I will encourage them to read the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2820.484,
    "end": 2828.773,
    "text": "But by mechanics, I assume that the person means the sets of equations or the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.682,
    "end": 2859.638,
    "text": " the uh the rules that that shift these springs in a particular way so each of these so so you what i have done is that i have i i i i think about neural fields as force fields so you can imagine that there is a particular force or sorry there's a moss in the in the field that is kind of perturbing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2860.09,
    "end": 2889.439,
    "text": " these springs in specific directions and the motivation for these masses are very uh biological right so you can imagine i see a very colorful object in my in my visual scene right that colorful object you can think of as a moss by which the springs will kind of move towards especially if i want to look at that object and so the kinematics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2890.465,
    "end": 2900.86,
    "text": " just thinking about neurons as particles under Newtonian mechanics, you'll see that they undergo this F equals ma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.561,
    "end": 2909.172,
    "text": "These kind of ideas where the mass and the acceleration, they will determine the force by which that particular thing experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.772,
    "end": 2918.024,
    "text": "And so that's why these springs, that's why I think of them as the Newtonian law of remapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.345,
    "end": 2920.067,
    "text": "They undergo these forces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.435,
    "end": 2936.195,
    "text": " And these forces are just effectively ways by which these neurons are allocated their attention dynamically in space and time in order to kind of provide sensitivity to particular things that you want to attend to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.675,
    "end": 2945.446,
    "text": "And so the kinematics is basically, you know, Newtonian force equations and, you know, putting that under more biological constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2945.466,
    "end": 2945.686,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2945.927,
    "end": 2948.189,
    "text": "Like I'll give another very simple example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.209,
    "end": 2949.531,
    "text": "You can imagine, for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.253,
    "end": 2958.345,
    "text": " You normally hear when people are in very high-stakes situations, they'll say, I couldn't see anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2958.586,
    "end": 2964.434,
    "text": "It felt like I was undergoing tunnel vision, in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.277,
    "end": 2976.092,
    "text": "In that sense, I would argue that the force that was being exerted in that person's visual system was so strong",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.882,
    "end": 3005.556,
    "text": " that it pulled them outside of their elastos kind of like this larger thing right so if i wanted to look at something right now my neurons need to kind of still it needs to attend to that area but it kind of needs to leave a little bit of resources in my periphery so that i can actually see what's in my in the corner of my eye and so that's what these elastic fields are for they kind of control for the system from over committing right and so it's kind of these biological constraints",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3006.025,
    "end": 3014.877,
    "text": " along with these kind of Newtonian kinematics that I've combined to create this kind of novel computational field of research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.578,
    "end": 3023.888,
    "text": "And so, you know, maybe I wasn't, you know, again, whoever that person is, they can read the paper or connect with me on Figbox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3023.908,
    "end": 3027.593,
    "text": "I'll love to work out the equations with them if they like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.114,
    "end": 3029.496,
    "text": "But that's kind of the idea here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3030.137,
    "end": 3033.501,
    "text": "And these types of things you can imagine are useful for like computer vision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.869,
    "end": 3037.714,
    "text": " If you want to, like, build a robotic eye, for example, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.095,
    "end": 3040.878,
    "text": "Does it undergo retinotopic mechanics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.978,
    "end": 3049.149,
    "text": "How do you create constraints where the robot doesn't completely converge on a single point but has some kind of processing in the periphery?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.57,
    "end": 3053.555,
    "text": "And again, these elastic fields, there is no biological evidence for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.615,
    "end": 3055.518,
    "text": "It's something that I have kind of predicted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.918,
    "end": 3059.623,
    "text": "And there are particular, I'm hoping, experimentalists at some point",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.857,
    "end": 3081.139,
    "text": " uh will kind of uh give this idea some um um some uh some tension and and explore because i think they are uh key into understanding um active sensing and active vision specifically cool yeah just a few comments on that and then i'll ask bert's second question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.233,
    "end": 3100.782,
    "text": " the idea of spring loaded systems either coupled oscillators or springs like pullback attractors for joints it's often used in active inference like in the 2022 textbook chapter 8 has examples of spring joints",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.762,
    "end": 3110.83,
    "text": " And then we can generalize that a little bit more to energy based models where there's a potential function like a pullback or a gravity function as you move away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.991,
    "end": 3116.715,
    "text": "So like this flat circle with a spring pulling laterally, you could think about the Z axis there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.496,
    "end": 3118.157,
    "text": "It's like a bowl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.197,
    "end": 3121.86,
    "text": "And then there's like more pullback as you go up the edges of the bowl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.4,
    "end": 3130.667,
    "text": "And it is the generalization of Newtonian mechanics to have the Bayesian mechanics, which allows for different energy functions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.647,
    "end": 3134.011,
    "text": " to exist for a given state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.412,
    "end": 3138.878,
    "text": "So I think it's totally on the right track, and I'm sure you'll find many connections as you learn about these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.48,
    "end": 3140.761,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.781,
    "end": 3142.022,
    "text": "That's an excellent point, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.062,
    "end": 3147.109,
    "text": "And I actually want to say one last thing about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.129,
    "end": 3152.376,
    "text": "I actually use the equilibrium term, this FE, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.436,
    "end": 3156.241,
    "text": "This equilibrium force is actually the force that relaxes the spring back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.301,
    "end": 3159.085,
    "text": "So I use Hook, and that is motivated by Hook's Law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3159.942,
    "end": 3166.049,
    "text": " So as the system gets to, you can imagine if I pull a spring really hard, it could break, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.789,
    "end": 3174.037,
    "text": "So as the system kind of gets to what I call the elastic limit, the spring will then pull it back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3174.218,
    "end": 3178.262,
    "text": "And then that's really basically what resets it back to its equilibrium state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3178.843,
    "end": 3179.844,
    "text": "So you're exactly right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.904,
    "end": 3184.128,
    "text": "That pullback system is also in my model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.749,
    "end": 3189.274,
    "text": "And, you know, I found that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.693,
    "end": 3214.047,
    "text": " know the law that actually governs this uh remapping obeys newtonian almost it's akin to newtonian's uh uh a law of gravitation right and uh you know um um it's not exactly uh newtonian's law of gravitation but it's very similar the exponent in this case is 1.6 so yeah excellent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.937,
    "end": 3236.396,
    "text": " That also reminds me of Lachlan Kent's work on mental gravity, where he explores both the qualitative metaphors and that sort of quantitative gravitational and the different exponents associated with pullback outside of the energy minima.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.898,
    "end": 3242.123,
    "text": "The second question of Bert was... I think there's a third question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.143,
    "end": 3242.423,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.723,
    "end": 3243.745,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.765,
    "end": 3244.185,
    "text": "Bert wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.587,
    "end": 3250.656,
    "text": " Are LLM conversations with ChatGPT a huge conversation net like source?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.676,
    "end": 3253.56,
    "text": "What would be possible with such large data sets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.522,
    "end": 3257.725,
    "text": "Sorry, I didn't understand that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.745,
    "end": 3266.658,
    "text": "Are LLM conversations, so like human talking to a language model or just to LLMs, a huge conversation net like source?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.818,
    "end": 3268.961,
    "text": "What would be possible with such large data sets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.144,
    "end": 3271.725,
    "text": "Yeah, I mean,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3272.448,
    "end": 3275.973,
    "text": " Just to clarify, conversation that is human to human conversations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.015,
    "end": 3280.32,
    "text": "If I understood the question correctly, Daniel, and maybe you can help me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.186,
    "end": 3289.734,
    "text": "So the person that asked the question has proposed two scenarios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.815,
    "end": 3293.841,
    "text": "The first is an LLM and a human having a conversation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3293.861,
    "end": 3295.443,
    "text": "Like you do with ChagiBT and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.004,
    "end": 3297.607,
    "text": "And then a human having a conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3297.627,
    "end": 3299.89,
    "text": "And how would such data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3300.292,
    "end": 3329.708,
    "text": " um i guess um help or um enhance uh or affect that interaction in in those two cases yeah basically as the overall availability of conversation data all the all the combinations human human agent agent etc as we as the amount becomes so vast what kinds of of analyses or what kinds of models become more possible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.924,
    "end": 3332.427,
    "text": " other than just better recapitulation of chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.609,
    "end": 3333.749,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.049,
    "end": 3347.186,
    "text": "Well, I will ask the person to put the onus on the person that asked the question because, you know, that's kind of what I wanted to inspire for us to sort of answer that question together, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.206,
    "end": 3349.248,
    "text": "And that's why the data is open source, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3350.009,
    "end": 3356.117,
    "text": "But a low hanging fruit answer would be you would just use that data to fine tune these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.924,
    "end": 3382.78,
    "text": " right and see whether or not you get different results right um as far as the human to human interact i'm very excited about that because you know one of the reasons why i sort of thought about this this this stuff was what if who you married in the future was someone that you constantly had the same thought at the same exact time what is that's the way that you found your partner",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.148,
    "end": 3406.253,
    "text": " that every time you had a conversation that person was being synchronized in some part of the world i find that deeply profound that like perhaps this entanglement akin to like how particles are entangled could be a way to match people right to find like okay is my person right the person that i'm constantly thinking about and we already see this actually right in the way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.756,
    "end": 3436.24,
    "text": " when you really really are close with someone you kind of finish their sentences or sometimes they're like oh i was just thinking about you so i have this strong intuition that these things already exist we just don't have a way to measure that and so conversation that is my vision of one day being able to study these spooky actions at a distance as einstein would say right and um you know there's actually a data set right now on conversation net where we have two groups having a conversation at the same exact time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.54,
    "end": 3442.869,
    "text": " And so people right now can just mine that data and explore that and see whether or not you kind of pick up on these residents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.889,
    "end": 3443.089,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.65,
    "end": 3453.042,
    "text": "And so, you know, that is kind of the two ways that I would say you can sort of use that data and deploy them in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3453.103,
    "end": 3453.303,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3454.645,
    "end": 3464.138,
    "text": "And, you know, like I said, as we continue to build conversation that, you know, this amount of data that we're trying to collect is going to be unprecedented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3464.879,
    "end": 3465.94,
    "text": "And I'll say one last thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3467.81,
    "end": 3485.731,
    "text": " Normally, when we think about systems, we think that when they have this sort of, when their internal, like you can imagine that you have this spontaneous conversation that human beings are having, that in those conversations, they're not like forced, they're not scripted, they're not pretended in a sense, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3487.213,
    "end": 3494.762,
    "text": "And in that sense, if you were to use that type of data, you're able to pick up the more natural properties",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3495.164,
    "end": 3518.91,
    "text": " of what it means to be a human being right you're able to pick up the more spontaneous parts of cognition because the data set right is very spontaneous and is inscripted so maybe a lot of the conversations that have been trained on on the llms are conversations that are scripted and so they don't capture real human dynamics right the subtleties the noise the the the stochasticity and so again",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3519.245,
    "end": 3526.236,
    "text": " it offers another avenue into building new types of systems, ones that are more creative, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3526.296,
    "end": 3528.279,
    "text": "Rather than probabilistic, for example, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.88,
    "end": 3535.01,
    "text": "One that invent context rather than find them, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3536.071,
    "end": 3538.976,
    "text": "That's how I would think about it in this very moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.018,
    "end": 3540.378,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.639,
    "end": 3541.82,
    "text": "I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.941,
    "end": 3542.822,
    "text": "I think it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.815,
    "end": 3567.358,
    "text": " prepares the stage for systems that are part of societies of cognitive agents rather than just like an extended monologue or a book that's univocal is going to be continuing on a thematic thread which is good for a coherence but it still is is very single player um okay last question um well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.587,
    "end": 3592.485,
    "text": " address this and then also feel free just to close with like where where are you going from here um what happens next but here's the last question are there more questions or that's the actually the last question um the the this is the penultimate question yeah i don't know what that means but i i'll take your word for it yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.668,
    "end": 3600.158,
    "text": " Simona wrote, what metric would you say we would end up using to detect or measure if an AI does become conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.558,
    "end": 3602.34,
    "text": "Turing tests have become outdated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.701,
    "end": 3604.703,
    "text": "Where do you see being the next measuring bar?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.486,
    "end": 3608.488,
    "text": "What's the name of the person that asked the question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3608.929,
    "end": 3609.429,
    "text": "Simona.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.591,
    "end": 3610.891,
    "text": "Simona.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.011,
    "end": 3611.492,
    "text": "Oh, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3612.133,
    "end": 3612.493,
    "text": "Of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3612.694,
    "end": 3616.218,
    "text": "Yeah, she would ask that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.779,
    "end": 3617.74,
    "text": "I know Simona, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.12,
    "end": 3622.506,
    "text": "Anyways, this is actually a question that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.161,
    "end": 3628.89,
    "text": " I was asked by one of the leading pioneers in AI right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.93,
    "end": 3629.31,
    "text": "I forgot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.531,
    "end": 3631.694,
    "text": "Oh, Josh Bach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.355,
    "end": 3635.52,
    "text": "He asked me that same question, or at least their group asked me that same question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3638.945,
    "end": 3647.077,
    "text": "I am of the opinion that to build conscious AI, first of all, I don't think that any human being can build a conscious AI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.0,
    "end": 3652.105,
    "text": "Paradoxically, what I think must happen for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3652.726,
    "end": 3680.961,
    "text": " uh conscious ai to occur it is you build kind of the po the the the uh the um the foundational pieces like the clay by which that ai system can become conscious on its own independent of the architecture of the system so let's say for example shimona and i wanted to build a conscious ai what we would do is we would kind of have ideas of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3681.312,
    "end": 3706.273,
    "text": " the building blocks of consciousness and then we would use that to build the system in the architecture and then we would leave the system to its own and then come back maybe later and say hey you know are you conscious or do you start to behave very much like let's say for example we use the human right as a measurement right as a human being so in a sense that's a it's a paradoxical answer right in the sense that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3706.996,
    "end": 3712.322,
    "text": " We can't build a conscious AI because consciousness, I don't think it's something you can directly built.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3712.863,
    "end": 3715.025,
    "text": "It's something that emerges from a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.646,
    "end": 3720.411,
    "text": "And so we would have to create or understand the properties of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.451,
    "end": 3720.632,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.712,
    "end": 3733.206,
    "text": "As I'm trying to do with conversation that or not just me, but hopefully everyone in the audience in the community and, you know, build these substrates that that that eventually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3733.574,
    "end": 3760.543,
    "text": " uh can um lead to ais that become begin to have this kind of self-organization self-emergence right they begin to have an intention right um and so i think i think i think that's very important and if i were to go on a limb and say what is the exact property that is needed or like two things is a self-awareness of course but some concept of death",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3761.89,
    "end": 3789.13,
    "text": " i think that the ai must invent some concept of death which obviously is going to be based upon like compute right right like the ai must be aware that if i don't power myself in some sense i will stop functioning and i think a concept of death is foundational to an ai becoming conscious um because i think that a lot of the things that we humans do some parts right is driven by our sense of finality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3789.667,
    "end": 3791.429,
    "text": " especially in the Western context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3791.449,
    "end": 3796.576,
    "text": "I would say from a more African metaphysics, death is probably not as high in cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3796.636,
    "end": 3801.002,
    "text": "It's more about community and village and spirituality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3801.542,
    "end": 3811.455,
    "text": "But I think from a Western metaphysics point of view, death is a key driving force in cognition and the ways by which cognitions kind of preserve themselves in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3813.477,
    "end": 3814.298,
    "text": " Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.699,
    "end": 3818.644,
    "text": "So sort of in closing, what are your next moves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.525,
    "end": 3824.212,
    "text": "What are you looking for and how can people learn more and collaborate and everything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.414,
    "end": 3825.514,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3825.534,
    "end": 3831.662,
    "text": "Well, my, my, my ultimate move is to become top 15 on a particular list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3832.724,
    "end": 3842.117,
    "text": "Um, someone, you know, but, but I would say, no, that was just a joke, but I would say this, that my next move is, you know, continue to work with Christopher O'Neill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3843.346,
    "end": 3869.944,
    "text": " um you know exploring options uh as far as uh you know what i want to do next as far as science um i also have a company uh called figbox right which i mentioned briefly where i'm building that and trying to uh become the trojan horse of social media uh uh in a sense of trying to facilitate and connect people through human conversations and and and uh you know that's something that that i'm working on heavily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3870.515,
    "end": 3898.227,
    "text": " um i'm also uh open to collaborators right like um and uh you know i'm you know i have several grants for example one of them at the santa fe institute uh right now um so you know uh for conversation that to scale we definitely need uh people to fund the service and things like that um i also do other things in africa where i support like african thinkers and entrepreneurs i'm very passionate about that i think that uh science needs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.207,
    "end": 3911.902,
    "text": " to be more interdisciplinary in order to tap into the knowledge and the abilities of people across different spectrums, as well as gender as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.922,
    "end": 3923.294,
    "text": "So I'm very passionate about the inclusivity of science, making sure women are able to contribute, making sure that people of different cultures and races are able to contribute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.755,
    "end": 3925.817,
    "text": "I think that in order to solve",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.797,
    "end": 3927.258,
    "text": " complex problems, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.338,
    "end": 3929.34,
    "text": "An interdisciplinary approach is foundational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3929.76,
    "end": 3932.283,
    "text": "And I don't think that science is doing a very good job at that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3932.343,
    "end": 3934.204,
    "text": "So that's another thing that I work on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.905,
    "end": 3939.809,
    "text": "And so, yeah, that's kind of like, you know, kind of my future plans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3939.909,
    "end": 3946.455,
    "text": "And, you know, I really am very humbled that you've entertained to have me speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.695,
    "end": 3949.678,
    "text": "And of course, I'd love to build a relationship with you at some point as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3949.698,
    "end": 3950.579,
    "text": "And so thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.18,
    "end": 3952.641,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.661,
    "end": 3954.302,
    "text": "A lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.772,
    "end": 3958.036,
    "text": " Food for thought, a lot of material to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.116,
    "end": 3961.12,
    "text": "So please be in touch and till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.26,
    "end": 3961.68,
    "text": "Thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.982,
    "end": 3963.122,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.142,
    "end": 3963.342,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.054,
    "end": 3976.699,
    "text": "I hope that wasn't too mathematically dense, you know, because it could be intense a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3983.147,
    "end": 3983.848,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.868,
    "end": 3984.188,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.825,
    "end": 3989.353,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  }
]