[
  {
    "start": 2.444,
    "end": 4.126,
    "text": " All right, it's February 5th, 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.266,
    "end": 9.734,
    "text": "We're in the 1st discussion on chapter 6 for cohort 5. so, Andrew, thank you for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.355,
    "end": 15.302,
    "text": "Facilitating everyone feel free to raise your hand and everything and Andrew go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.646,
    "end": 20.749,
    "text": "Sure, so chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 20.769,
    "end": 26.697,
    "text": "6, we're beginning part 2 of the textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.233,
    "end": 41.496,
    "text": " Mike Wilberg , The Capacity Collective, This is basically yeah it's describing a recipe for designing active inference models we get, as we know from part one specifically Chapter four especially we're already been introduced to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 42.353,
    "end": 63.92,
    "text": " partially observable Markov decision-making processes as a discrete time version of kind of one of the sort of exemplar active inference models that's used in a variety of behavioral experiments, as well as the continuous models in continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 63.96,
    "end": 70.808,
    "text": "And so this is kind of just getting into more of like, how do we actually begin",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 71.277,
    "end": 77.65,
    "text": " like given in part one, we've been introduced to a lot of the main principles and kind of the framework of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 77.71,
    "end": 83.261,
    "text": "Now we're being introduced to how to actually construct the models ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 85.626,
    "end": 89.494,
    "text": "So let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.914,
    "end": 92.239,
    "text": "So yeah, the first part we have,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 93.367,
    "end": 99.759,
    "text": " the introduction crucial to find when designing an active inference model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 99.779,
    "end": 101.963,
    "text": "You want to specify your system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.866,
    "end": 110.498,
    "text": "For me personally, it was easy coming into active inference to have big ideas of what to apply active inference to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 110.478,
    "end": 116.509,
    "text": " because, of course, it can be applied to a variety of living organisms or other systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.649,
    "end": 123.882,
    "text": "But really, whenever you want to design your own project, you do need to specify a system of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.902,
    "end": 124.964,
    "text": "What is the problem?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.024,
    "end": 133.279,
    "text": "Some other thoughts are like, what are the expectations you have of what kind of behavioral",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.58,
    "end": 139.867,
    "text": " like emergent behaviors you might see or expect to see versus what ends up happening whenever you put your model together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 139.887,
    "end": 146.595,
    "text": "So really, one take on it is to really just start from basic principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 146.655,
    "end": 148.097,
    "text": "Like we have part one of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 148.197,
    "end": 151.942,
    "text": "We know much more about something like how active inference works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.402,
    "end": 162.574,
    "text": "Now start to use that as a tool for, yeah, kind of shaping your project or your experiment you want to put together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.735,
    "end": 166.879,
    "text": " So you kind of simplify and grow outwards from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.764,
    "end": 178.995,
    "text": "Section 6.2, there's a very nice brief like designing an active inference model in four steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.636,
    "end": 189.709,
    "text": "Again, number one immediately, it's which system are we modeling in the context of like statistical Markov blankets, like how do we define",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.229,
    "end": 193.894,
    "text": " the generative model versus the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 194.995,
    "end": 206.61,
    "text": "What is the agent you're trying to model and what defines it and how do you distinguish it from the environment or the process that's occurring around it in which it is operating?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 209.313,
    "end": 211.456,
    "text": "What is the most appropriate form of the model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.157,
    "end": 218.785,
    "text": "Are you looking at, for example, some experiment that involves eye saccades?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 219.17,
    "end": 240.3,
    "text": " um like continuous movements arc reflexes those kinds of things in which case you might be um going for more of a continuous time model or are you looking at like are you attempting to model uh an animal or a human uh operating in its environment in which case it might be um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.28,
    "end": 249.876,
    "text": " It might be making discrete choices, in which case you're looking at more of a discrete time model or more than likely a POMDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 251.118,
    "end": 264.921,
    "text": "If the agent's going to be choosing its actions and has a time horizon and you're including things like expected free energy, not just variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.643,
    "end": 285.188,
    "text": " step three, how to set up the generative model, choosing what are the appropriate variables, what are the priors, it's where you kind of get into the, you know, the meat of the modeling process, like what are all the specifications here we need to make in order to simulate your experiment that you're going for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.079,
    "end": 302.886,
    "text": " Michael Prast- And number four again the same thing, but now, how do we set up the generative process because, in the same way that you have to set up the model, you also have to set up the process in which it's it's operating kind of interacting with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 302.906,
    "end": 303.868,
    "text": "Michael Prast- So 6.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.127,
    "end": 310.132,
    "text": " deeper discussion, what defines a model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 310.612,
    "end": 311.994,
    "text": "What defines the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.054,
    "end": 313.195,
    "text": "Where do we draw the line?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 313.235,
    "end": 318.161,
    "text": "What are the internal states, the model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 319.563,
    "end": 323.267,
    "text": "What is it inferring about the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.327,
    "end": 327.031,
    "text": "What are the hidden states it's attempting to infer from the environment around it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.892,
    "end": 330.295,
    "text": "Because as we know, it has no direct",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 331.0,
    "end": 335.787,
    "text": " It has no direct access right to the environment around it, it can only infer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.252,
    "end": 346.762,
    "text": "get some nice further discussion in that section thing other things to consider nested blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 347.984,
    "end": 353.211,
    "text": "How the organism might use or your agent might use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.478,
    "end": 363.391,
    "text": " if you're modeling an agent in an environment in which it's moving around or acting like what kinds of objects are in the environment that it might use as potential affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.376,
    "end": 372.944,
    "text": "Moving on to section 6.4, what is the most appropriate form?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 373.024,
    "end": 381.595,
    "text": "We get a little bit more discussion of things like time scales throughout 6.4, that's a bit more of a lengthy section with subsections in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.047,
    "end": 386.216,
    "text": " You'll want to consider things like temporal depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.561,
    "end": 394.032,
    "text": "They go into more detail in 6.4.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.838,
    "end": 408.55,
    "text": " in which case, yeah, so for temporal depth, it's like, for example, you might have a POMDP where at the lowest level, you'll have, for example, say you have an agent in its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.971,
    "end": 412.78,
    "text": "At the lowest level, it's taking in sensory observations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 412.76,
    "end": 416.828,
    "text": " very quick, the quickest pace, the quickest time scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 417.389,
    "end": 429.03,
    "text": "And as it's doing that, those sensory observations, of course, are generating prediction errors as it interacts with the upper layers that might be happening at a slower time scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.01,
    "end": 437.321,
    "text": " You could have nested levels, in which case, maybe at a higher level, the agent has various parameters that are being tuned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 437.942,
    "end": 439.924,
    "text": "They're then descending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.964,
    "end": 447.274,
    "text": "Those predictions are interacting with the ascending signals based on the incoming sensory observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 447.875,
    "end": 449.136,
    "text": "Those are all things to consider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 449.176,
    "end": 455.845,
    "text": "Remembering from Chapter 5, you can have multiple timescales operating the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 456.247,
    "end": 460.451,
    "text": " model, some things happen very quick, some things happen much slower.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 461.392,
    "end": 464.395,
    "text": "And they kind of sink over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 467.938,
    "end": 481.832,
    "text": "It's a lot of the remaining sections generally get into much of what I've already discussed here, we start getting into the difference between inference and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 482.335,
    "end": 486.801,
    "text": " Learning tends to happen at slower time scales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.703,
    "end": 493.97,
    "text": "Those would be beliefs about parameters as opposed to hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.411,
    "end": 501.1,
    "text": "So what do you believe the predictability of a state is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 501.22,
    "end": 506.487,
    "text": "For example, it gets into things like precision modulation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 508.255,
    "end": 508.516,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.477,
    "end": 513.886,
    "text": "Wraps up with talking about more detail on defining the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 515.349,
    "end": 526.551,
    "text": "And then final section on just a very brief mention of how later in the textbook it will get into model-based data analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 527.611,
    "end": 533.781,
    "text": " they save going into too much detail about, okay, now you've set up the simulation per chapter six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 534.402,
    "end": 539.13,
    "text": "Maybe you've got some more additional details on how to do that in chapter seven or eight, depending on your use case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 539.41,
    "end": 549.366,
    "text": "And finally, chapter nine, data analysis, where you actually, how do we interpret these results if you're using MATLAB and SPM?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 549.346,
    "end": 561.541,
    "text": " what do the, and you use a standard routine, which is freely available from the software package that Kristen at all released, like, what do these graphs mean that we're seeing once we run the simulation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.222,
    "end": 565.066,
    "text": "How do we do individual versus group level analysis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 566.648,
    "end": 567.989,
    "text": "So, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.391,
    "end": 578.863,
    "text": "I feel like that was hopefully a holistic enough starting point for the discussion here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 580.025,
    "end": 582.268,
    "text": " Oh, thank you, Susan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.309,
    "end": 585.331,
    "text": "Yeah, first, first time doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.351,
    "end": 586.272,
    "text": "So happy to be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.155,
    "end": 588.375,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.475,
    "end": 595.023,
    "text": "Does anyone have any questions that they're thinking about anything that's maybe come up?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.826,
    "end": 603.433,
    "text": "Like, or any particular topics or something they wanted to point to in the textbook, a certain page?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 607.632,
    "end": 610.095,
    "text": " I have a question, can you hear me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 611.117,
    "end": 612.719,
    "text": "Yes, okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 613.52,
    "end": 621.231,
    "text": "I wonder if you could talk a little bit about in the process of selecting a model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 621.291,
    "end": 629.001,
    "text": "How do you go about deciding what your markup blanket is going to be so.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 629.041,
    "end": 636.812,
    "text": "From the modeling perspective, and you just elaborate on the markup blanket choice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 639.998,
    "end": 643.843,
    "text": " I'm very curious about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 643.863,
    "end": 644.844,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.647,
    "end": 649.61,
    "text": "So maybe a good quick question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 651.012,
    "end": 666.012,
    "text": "Like, do you have an example of maybe, like, just anything you'd like to look at a particular phenomena or something that you want to understand better that you might try and make an experiment to try and study?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 666.032,
    "end": 669.516,
    "text": "Anything we could start from there, maybe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 672.517,
    "end": 680.725,
    "text": " Um, I guess I'm, I'm too stuck in a conceptual space right now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 680.745,
    "end": 682.226,
    "text": "And I can't really do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 683.387,
    "end": 692.035,
    "text": "But um, yeah, no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.055,
    "end": 701.224,
    "text": "Let me just say that from a very abstract perspective, from my question is, what is a node?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 702.014,
    "end": 730.519,
    "text": " what is an edge in your in the models and where does a mark of blanket come in into the picture and how do you decide on the states that uh on the states that you choose if i understand this correctly about marco blankets that define the mark of blanket",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 731.562,
    "end": 738.41,
    "text": " And if I'm incorrect in my language, the way I'm describing these things, just let me know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 740.933,
    "end": 741.213,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.253,
    "end": 745.078,
    "text": "I think all those terms are very relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 745.759,
    "end": 746.98,
    "text": "Edges, nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 747.681,
    "end": 751.005,
    "text": "We're kind of getting into the language of graphical models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 752.727,
    "end": 760.236,
    "text": "That's many of the models that this textbook gets into, especially in all these nice",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 760.84,
    "end": 786.139,
    "text": " um the figures of the pomdp for example those are all you know technically graphical models um so nodes you know i don't know if um i don't know if daniel would be possible maybe to pull up one of the figures in the in the textbook yeah just mention it and go for it and then maybe yeah which one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.608,
    "end": 803.301,
    "text": " yeah um they don't have any in this chapter but i know that in the next chapter it gets into pomdps so there might be just uh find it and then put in the chat and then ali go for a first pass to magdalena's question yeah go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.47,
    "end": 817.213,
    "text": " Yes, so thanks for asking the question because I remember asking the exact same question from Maxwell Hempstead about two years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.253,
    "end": 823.787,
    "text": "How can we identify markup blankets in modeling processes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.767,
    "end": 853.065,
    "text": " And I remember his answer was something to the effect that it's a very non-trivial process, and it depends very much on the situation of interest and on the specificity of the kind of modeling or the kind of questions you try to answer in each modeling scenario.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.568,
    "end": 872.033,
    "text": " There was this paper by Ryan Smith Smith at all, I think it was from 2023 or 22 I guess towards the end of 2022 in which they used a very creative approach to constructing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.418,
    "end": 889.323,
    "text": " a kind of markup blanket in order to investigate the basically to model the function of the heart based on active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.285,
    "end": 896.434,
    "text": "Let me pull up the exact title of the paper, but I think it's a very instructive example",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.414,
    "end": 918.27,
    "text": " as to about how can we identify uh markup blankets even creatively in every modeling scenario because i think it's nothing algorithmic or formulaic about it it requires a bit of out of box out of the box thinking and creativity in order to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.212,
    "end": 928.886,
    "text": " To identify suitable boundaries in the in the state space of the market blanket you're trying to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.509,
    "end": 937.499,
    "text": "you're trying to construct for each modeling scenario so i'll put the link in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.162,
    "end": 940.123,
    "text": "Great Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 940.694,
    "end": 941.495,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.816,
    "end": 945.101,
    "text": "I'll try to give another way in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.281,
    "end": 954.477,
    "text": "So figure 4.2 shows some motifs in this Bayesian graph representational format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.278,
    "end": 957.842,
    "text": "So to your question about the nodes and the edges,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.822,
    "end": 983.121,
    "text": " the nodes like the circles those are variables they could be fixed or they could be variable and and dynamic or not and they could be different types could be an integer it could be float and so on this is just very schematic and the arrows are like causal relationships that are here directed so then this kind of maps to x like hidden temperature in the room observable on the thermometer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.303,
    "end": 987.311,
    "text": " Here, it's like there's two factors that influence the thermometer readings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.992,
    "end": 991.038,
    "text": "Here, one latent cause and two observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.779,
    "end": 995.326,
    "text": "And here's like something that influences something that influences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.967,
    "end": 1002.46,
    "text": "And so to select, to generate structural hypotheses and to select,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.44,
    "end": 1027.182,
    "text": " the different models and evaluate their differences like which ones are just like explaining the most variants but adding more variables always explains more variants so then there's these other constraints that are applied to the model like you want to explain the most variants parsimoniously like bayesian information criterion or you might have a fixed number of variables to work with there are all these other situational constraints",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.162,
    "end": 1043.644,
    "text": " But because this is a mapping exercise and Markov blankets are just a feature of the map, like X being a blanketing state between B and Y, not carrying any philosophical implication beyond just its insulating role on the graph, which is the map, not the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.626,
    "end": 1053.017,
    "text": "So there's a lot of techniques to identify, and it was very wise of Andrew to start with kind of starting with a specific system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.065,
    "end": 1061.318,
    "text": " um also the general inquiry is really interesting, but in practice, starting with the specific phenomena or system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.16,
    "end": 1065.565,
    "text": "is like the starting point on iterating on something more specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.226,
    "end": 1075.461,
    "text": "which helps bring it a little bit more into the practical like which variables you're realistically going to take into account and which ones are like beyond the current scope of that modeling approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.714,
    "end": 1084.416,
    "text": " Thank you so much.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1084.717,
    "end": 1103.242,
    "text": "And if you could elaborate on what you just said about the, the, in that, on that figure that you were just showing is, I don't know if you can, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1103.262,
    "end": 1103.362,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1103.382,
    "end": 1111.033,
    "text": "So V and Y you said are blanketing X.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1111.891,
    "end": 1136.312,
    "text": " can you give me an example from models that you've worked on or other people where you know tell me what their x look like and what the v how the b and the y blanketed that x i'll give one short answer then andrew will look forward to your response so this motif",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1136.647,
    "end": 1140.784,
    "text": " is very commonly used to constrain the structure of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.844,
    "end": 1144.378,
    "text": "So this is if X is the present moment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.713,
    "end": 1150.22,
    "text": " This is like saying the past only influences the future through the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.24,
    "end": 1153.204,
    "text": "This is like the Markovian property for time series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.865,
    "end": 1165.48,
    "text": "Because in principle, if you had 100 time steps in a model, you could have time step 11 influence time step 21 and try to learn a statistical parameter there, but then you'd end up with so many parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.02,
    "end": 1168.864,
    "text": "So instead, under the Markovian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.844,
    "end": 1189.266,
    "text": " simplifying assumption that basically the present kind of like filters through like a bottleneck information bottleneck that simplifies it to only having to learn one parameter which is like the b matrix thank you thanks for that it helps a lot yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.258,
    "end": 1208.875,
    "text": " And actually, Daniel, I think this figure 4.2 is maybe even a better start versus what I recommended, just because in addition to trying to describe the specificities related to markup blankets, maybe just giving",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1209.277,
    "end": 1225.075,
    "text": " um kind of an ex like a concrete example of the the graph in the upper left corner which the the textbook describes there um it's so we have right so we have um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.747,
    "end": 1244.987,
    "text": " the one impacting with a with an edge pointing towards the node that is the x and then uh the two is like so basically you can see that there's like a causal relationship here going down like one impacts x impacts two impacts y in in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1245.777,
    "end": 1247.119,
    "text": " very simplistic terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1248.621,
    "end": 1267.725,
    "text": "So we already know from earlier in the textbook, like a core part of a generative model is to have priors, which is the one, it's our P of X distribution over hidden states, your beliefs about X. Then one impacts what kind of, what do you think is going on right now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1268.126,
    "end": 1269.528,
    "text": "What is the hidden state right now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1269.708,
    "end": 1275.295,
    "text": "That's the X that you're inferring or your agent is inferring or your model is inferring.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1275.275,
    "end": 1280.529,
    "text": " And then that has a relationship with two, which is your likelihood matrix, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1280.549,
    "end": 1288.71,
    "text": "It's the probability of the incoming sensory observations conditioned upon or given the hidden state that you're inferring.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.365,
    "end": 1303.017,
    "text": " So basically with nodes and edges, as Daniel heavily covered, it's really just trying to figure out like, okay, what would be the causal relationships between the different things going on in your experiment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.779,
    "end": 1306.345,
    "text": "And what are those things in the first place?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.325,
    "end": 1308.547,
    "text": " what are the particular hidden states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.788,
    "end": 1314.513,
    "text": "Perhaps you have an example of a mouse navigating a maze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1315.915,
    "end": 1324.403,
    "text": "The mouse might be taking in new sensory observations from multiple modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.483,
    "end": 1327.066,
    "text": "It might be it can see where it's navigating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.246,
    "end": 1329.088,
    "text": "It might feel certain things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1329.168,
    "end": 1331.53,
    "text": "It might smell certain things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1331.931,
    "end": 1335.454,
    "text": "But those are all things that you'd want to consider when constructing a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.434,
    "end": 1344.596,
    "text": " So those are all different variables that end up being their own nodes and what you end up building out into what could become a rather complex graphical model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.099,
    "end": 1347.423,
    "text": "Similarly, what are the states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.743,
    "end": 1350.169,
    "text": "Like maybe the mouse is trying to figure out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.352,
    "end": 1365.964,
    "text": " where it is maybe it's trying to figure out oh what is the source of that smell is it a reward is it well i'm pointing towards this example in particular because we'll see it in chapter seven i believe and also just to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1365.944,
    "end": 1375.038,
    "text": " Just I hope you can worry less knowing that chapter seven and chapter eight will get into much more concrete examples of different models as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1375.819,
    "end": 1385.414,
    "text": "And it'll maybe become a little bit easier to kind of tie the knot between all of the conceptual considerations and like an actual experiment that you want to set up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.135,
    "end": 1389.741,
    "text": "But that's just trying to give a little bit more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1389.721,
    "end": 1397.432,
    "text": " on maybe how you would construct a model and knowing that we do have to understand graphical models prior to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1398.654,
    "end": 1401.839,
    "text": "It's just a big web of associations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.259,
    "end": 1404.663,
    "text": "And they all lead to a series of computations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.983,
    "end": 1407.086,
    "text": "And again, it's active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.166,
    "end": 1415.779,
    "text": "And so the key part of this entire process being a series of computations in order to minimize free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.421,
    "end": 1420.963,
    "text": " I think that's very helpful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1421.443,
    "end": 1421.964,
    "text": "Appreciate that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1429.413,
    "end": 1432.616,
    "text": "I have a question about the construction of models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1433.878,
    "end": 1448.415,
    "text": "I think my confusion may be that I'm new to this process and it's early on, but this is the chapter that I want to most understand because I came to Active Inference with this desire to create a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1448.817,
    "end": 1454.524,
    "text": " for a long standing social science intervention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1455.645,
    "end": 1465.937,
    "text": "My question is, when I first come to a problem, you don't always know the variables of interest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1466.497,
    "end": 1470.862,
    "text": "And so that's part of why you're doing the experiment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1470.902,
    "end": 1472.584,
    "text": "Is that not true in this case?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.71,
    "end": 1478.571,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1479.243,
    "end": 1496.485,
    "text": " I mean it to actually any anyone I've had a discussion with who's worked on putting together, whether it be active inference models or any other model that might relate to another framework and reinforcement learning or doing other kinds of experiments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1496.526,
    "end": 1499.209,
    "text": "Yeah, it's sometimes it can just be a very",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1499.527,
    "end": 1500.869,
    "text": " Iterative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.771,
    "end": 1506.739,
    "text": "More often than not, most people, yeah, they don't know what all the variables are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.759,
    "end": 1515.493,
    "text": "You might have a strong hunch about what they are, or you can, of course, relate them to like domain knowledge and secondary literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1515.473,
    "end": 1525.074,
    "text": " But more often than not, you may want to construct a model that uses what you know or think is highly likely that this is how this works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.918,
    "end": 1528.401,
    "text": "Have a look at the results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.422,
    "end": 1529.825,
    "text": "Look at what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.085,
    "end": 1535.457,
    "text": "If you're able to run the simulation, see what the output is, see if it makes any kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.437,
    "end": 1550.796,
    "text": " kind of sense um uh i have a social sciences background and so things like causal inference where we're like okay well what are the variables here uh what are the confounding variables here what are we leaving out what are the things that cannot be observed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1550.776,
    "end": 1569.621,
    "text": " If you start seeing what defines an odd observation is very context specific, but if you do start seeing results, it might point to the idea that you might very well be leaving something out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.102,
    "end": 1576.53,
    "text": "Then you may want to also double check the complexity of your model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1576.51,
    "end": 1599.885,
    "text": " say there's something at the lower level that you've defined everything makes sense it's at this time scale etc maybe there's a variable that's left been left out at another level maybe there's something else that's impacting all of this that's been left out that that isn't even occurring at the lower level that we've been focused on it's been at a higher level this whole time um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1601.063,
    "end": 1606.001,
    "text": " A lot of my explanation there might be might be a little vague, but again yeah it's just very context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1607.707,
    "end": 1611.139,
    "text": "context sensitive, I almost want to say so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.083,
    "end": 1613.267,
    "text": "No, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1613.956,
    "end": 1616.66,
    "text": " I'll add a few more notes on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.642,
    "end": 1631.104,
    "text": "So in the symbolic actin space and an institute participant, JF, his Lego robots using a logical program rather than statistical distributions, but the idea is basically the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.165,
    "end": 1635.852,
    "text": "It's like rather than a causal graph, which is like we're talking about the textbook, it's a causal theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.872,
    "end": 1640.52,
    "text": "And here he talks a lot about that incremental proposal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.5,
    "end": 1653.312,
    "text": " so you ask are the actual variables where they hypothesize latent they are actually hypothesized so they're enacted in their hypothesizing which is abductive inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.815,
    "end": 1681.594,
    "text": " which is so generation of hypotheses and then evaluation of hypotheses so that's been analyzed as kind of like itself an active inference process because which hypotheses to propose and then given the hypotheses which actions to take for their to uniquely resolve and learn those are all questions that can be approached in active and then just one last technical note is this relatively recent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.574,
    "end": 1683.397,
    "text": " preprint with Friston et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.239,
    "end": 1687.605,
    "text": "This talks about a statistical problem called structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.366,
    "end": 1694.457,
    "text": "So here it's in the context of the digit MNIST data set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.477,
    "end": 1702.992,
    "text": "This is a very familiar problem and data set to look across different handwriting styles and identify the digits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.972,
    "end": 1716.866,
    "text": " And this work, which we could probably discuss more in a future time, goes into a lot of detail with the structure learning, which is like when you have 11 handwriting styles, should you propose an 11th cluster?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.406,
    "end": 1723.192,
    "text": "And then you evaluate whether the 11 cluster model or the 10 cluster model is better explaining the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.673,
    "end": 1726.636,
    "text": "It's like doing better on that Pareto optimal front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.996,
    "end": 1728.878,
    "text": "And then like 11 is accepted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.858,
    "end": 1739.539,
    "text": " And then like there's a proposal to basically to increase the number or decrease the number of latent factors and then there's a criterion for like accepting or rejecting those kinds of model updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.661,
    "end": 1749.718,
    "text": "And so that's a capacity that's existed for statistical models outside of active to kind of like adaptively dial up or dial down the dimensionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.778,
    "end": 1754.541,
    "text": " But it's not a totally solved problem, and it's not totally implemented in Act-Inf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.042,
    "end": 1766.733,
    "text": "But in principle, a system wouldn't need to know the dimensionality of its environment because it might just have a... And it doesn't ever need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.853,
    "end": 1769.195,
    "text": "It could just be too cold, just right, too warm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.076,
    "end": 1776.542,
    "text": "And then that doesn't mean that it ever needs to learn the richness of the continuous distribution of the temperature in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.543,
    "end": 1777.883,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1778.048,
    "end": 1780.985,
    "text": " that might be good enough for the air conditioner just to have three states or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.71,
    "end": 1784.185,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1784.205,
    "end": 1785.291,
    "text": "Okay, thank you so much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.186,
    "end": 1827.442,
    "text": " I guess I did want to add, there's a nice paper for anyone who's more interested in social science research or something along those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1827.462,
    "end": 1829.689,
    "text": "There's been a very nice",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1831.762,
    "end": 1838.83,
    "text": " series of papers put out by a researcher, Ryan Smith.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.192,
    "end": 1858.393,
    "text": "We have several live streams of him giving a tutorial on active inference with the Institute and specifically how to construct models in MATLAB for anyone who's familiar with that or interested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.373,
    "end": 1864.148,
    "text": " I bring that up because he has this paper on simulating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1865.41,
    "end": 1867.493,
    "text": " what's called exposure therapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.713,
    "end": 1875.584,
    "text": "So this is research that is intended to aid interventions for psychotherapists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.704,
    "end": 1890.745,
    "text": "Like, can we simulate, for example, a client who is suffering from some kind of avoidance or anxious disorder that's stimulated by something?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.785,
    "end": 1893.409,
    "text": "Say they have a very strong phobia of something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.389,
    "end": 1911.533,
    "text": " um computationally it could be anything it could be a spider it could be you know seeing a car accident a variety of things and i so bringing it up like they had to construct a model of like how do you simulate exposure therapy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1911.513,
    "end": 1917.329,
    "text": " So we already know we have a client that we're trying to simulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1917.51,
    "end": 1926.535,
    "text": "We want to simulate them going through exposure therapy, being exposed to the thing that produces the fear and then to see like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1926.515,
    "end": 1943.176,
    "text": " this is a safe environment that we're simulating in order to test things out, as opposed to jumping immediately to empirical research that there are too many ethical considerations to just playing around with showing people things that trigger them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1944.117,
    "end": 1950.305,
    "text": "So when constructing this model, you have to model, here's the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1950.485,
    "end": 1952.488,
    "text": "You have to figure out what defines the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1952.941,
    "end": 1960.2,
    "text": " In their case, the agent experiences affect or something like emotion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1960.332,
    "end": 1964.036,
    "text": " compose that as a distribution, like what are the emotions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1964.136,
    "end": 1965.277,
    "text": "They keep it very simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.477,
    "end": 1969.521,
    "text": "They go with something in psychology referred to as valence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1969.661,
    "end": 1972.224,
    "text": "So you have a nice like positive negative scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1973.925,
    "end": 1982.994,
    "text": "There's been a lot of nice work on emotion in general from an active inference perspective that yeah, valence seems to hold up pretty well in certain contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1983.014,
    "end": 1984.656,
    "text": "So they go with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.936,
    "end": 1988.179,
    "text": "And then you have, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.497,
    "end": 1993.223,
    "text": " How does the agent deem the stimulus that they're being shown?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1993.263,
    "end": 1996.307,
    "text": "In this case, let's say the agent has a fear of the spider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1997.168,
    "end": 2001.433,
    "text": "So they might interpret it as dangerous as opposed to safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.513,
    "end": 2004.697,
    "text": "So now again, we have another kind of sliding scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2005.478,
    "end": 2009.183,
    "text": "These are all what could be viewed as like continuous distributions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2009.383,
    "end": 2013.268,
    "text": "Like they can be viewed as a number that moves into the positive, the negative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2014.229,
    "end": 2017.693,
    "text": "Then you can take those kinds of things, view them as variables",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.18,
    "end": 2020.082,
    "text": " then put them in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.144,
    "end": 2029.193,
    "text": "In this case, we would hope that the agent being exposed to, say, a spider that ultimately is safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.134,
    "end": 2035.641,
    "text": "Again, bear with me that it might come off as a silly example, but say it's a fake spider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.701,
    "end": 2037.203,
    "text": "This is exposure therapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2037.723,
    "end": 2039.165,
    "text": "We're not going to show them around a spider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2040.186,
    "end": 2045.132,
    "text": "But to get the agent to slowly become more comfortable with being around the spider,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.112,
    "end": 2054.052,
    "text": " like we want those parameters, those beliefs about how dangerous the spider is to change over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.072,
    "end": 2062.53,
    "text": "So that also means you have to, we're defining the generative process, the spiders there, it's a safe spider, the agent is interacting with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.51,
    "end": 2087.995,
    "text": " over time as we run more trials we can see how do the agents beliefs begin to change do they change rapidly does the situation become worse are they being exposed to the spider and it's just freaking them out more they've become they're concerned that it's even more dangerous um and I'll quickly realize I haven't shared the link for that paper so I've just shared that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.975,
    "end": 2116.108,
    "text": " um anyway so without going into too much more detail because it takes some time um but you know if this paper interests you go for it um the whole idea here yeah is to to just you know thinking through what what is a variable what is considered as a variable and a lot of it centers around defining your agent defining the environment or process around them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2116.595,
    "end": 2121.144,
    "text": " and then trying to find the linkage between all the conceptual ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2121.625,
    "end": 2127.197,
    "text": "Like I said earlier, affect is that there's plenty of domain knowledge on that in psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.179,
    "end": 2135.734,
    "text": "How do you make a one-to-one ratio between a little node or variable in a graph with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2136.17,
    "end": 2146.795,
    "text": " Matt Kallroos- Research that's been done by your you know the field you're working from or interest in like in psychology, how do we make those connections that we can build out a model from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.12,
    "end": 2149.521,
    "text": "Matt Kallroos- yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.805,
    "end": 2151.547,
    "text": " And so, yeah, Daniel's pulled it up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.867,
    "end": 2156.673,
    "text": "There are different ways that people attempt to show their models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.634,
    "end": 2164.321,
    "text": "This one, the notation is certainly different from the textbook, but I think it's more explanatory, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.341,
    "end": 2171.91,
    "text": "Like we have an agent who's being exposed to a safe stimulus or a dangerous stimulus, like a spider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2172.11,
    "end": 2176.875,
    "text": "We have their beliefs about its safety or how dangerous it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2176.855,
    "end": 2179.16,
    "text": " They also have an arousal level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2179.981,
    "end": 2184.71,
    "text": "You can include things like with psychological research and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2184.751,
    "end": 2187.676,
    "text": "We care a lot about physiological signals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2187.857,
    "end": 2198.678,
    "text": "It's the agents like heart rate increasing, which by the way, you'd want to consider that probably to be a continuous variable because this is happening very quickly over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.658,
    "end": 2204.944,
    "text": " Whereas belief context, safe versus dangerous, that could be viewed as discreet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.104,
    "end": 2207.947,
    "text": "We have two options there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2208.728,
    "end": 2211.35,
    "text": "So those are also big concerns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.37,
    "end": 2213.052,
    "text": "Like you figure out your variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.833,
    "end": 2214.693,
    "text": "Are they discreet?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.354,
    "end": 2216.355,
    "text": "Are they continuous?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.056,
    "end": 2219.798,
    "text": "Do they happen at quick time scales, moment by moment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2220.579,
    "end": 2226.825,
    "text": "Like the agent very quickly is feeling their heart rate change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2227.801,
    "end": 2255.665,
    "text": " And yet over time, as we run more trials with more exposure therapy sessions at a slower time scale, their beliefs start to change to ideally a situation where we can find, maybe use this model to find some insight into how to improve intervention for people suffering from phobias or anxiety that's generated by a particular stimulus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.645,
    "end": 2269.074,
    "text": " So yeah, I hope that that provides some more insight into how to take a lot of this abstract or conceptual material and then relate it more directly to concrete situations and problems of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.535,
    "end": 2270.397,
    "text": "Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.216,
    "end": 2272.517,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.557,
    "end": 2274.039,
    "text": "This is a great paper to show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.079,
    "end": 2281.953,
    "text": "And I think the figure here shows like this is like the semantic level, like not worrying about how big the variable is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.013,
    "end": 2289.045,
    "text": "And so it's kind of like a little template that could be adopted just thinking about this situation of the exposure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.066,
    "end": 2291.189,
    "text": "And then what is the thing that one is modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.209,
    "end": 2294.295,
    "text": "And then what other phenomena do they need to further include?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.335,
    "end": 2296.198,
    "text": "Like planning is not here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.178,
    "end": 2301.145,
    "text": " And then the bottom is actually the shape of the variables themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.885,
    "end": 2312.019,
    "text": "The A, the B, C, and D of this agent, just like the POMDPs in the generative model and described in model stream one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.539,
    "end": 2325.156,
    "text": "And these are the actual shapes of the variables and even their types ranging from this continuous belief to two by twos, affordance matrices,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.136,
    "end": 2331.086,
    "text": " with context preferences, what a flat preference looks like versus a sharp preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.069,
    "end": 2340.141,
    "text": "It's all kind of syntactically displayed in this flat lay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.865,
    "end": 2370.077,
    "text": " Nicholas Matsakis, So anyone else have any other thoughts or things that you know they're kind of pondering right now regarding this chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.799,
    "end": 2415.42,
    "text": " do we have any other questions that have already been maybe asked in the coda",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2427.095,
    "end": 2437.848,
    "text": " What do you think are good small experiments to do between the first and the second discussion on chapter six, given what anyone has experienced or tried?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.911,
    "end": 2455.33,
    "text": "We could also look at a notebook, like look at an executable code right now, like a PMDP example, or we could talk about what, um, else could help supplement chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.262,
    "end": 2465.766,
    "text": " I think let's look at a pyMDP example, if it's okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.532,
    "end": 2470.852,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.173,
    "end": 2473.836,
    "text": "I'll put the link in the chat, but here's pyMDP documentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.198,
    "end": 2481.545,
    "text": "So this is the Python package by Connor Heinz, Alex Shantz, Daphne Namekis, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.448,
    "end": 2491.257,
    "text": "There are several tutorials and demos in this open source package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.802,
    "end": 2505.517,
    "text": " The simpler one, our tutorial one and two, then the team maze is most like the textbook and the epistemic chaining demonstrates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.617,
    "end": 2511.945,
    "text": "It's kind of like a team maze, but with like a little bit more of an epistemic or a slightly different epistemic component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.187,
    "end": 2517.492,
    "text": "And each of these tutorials very nicely provided by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.573,
    "end": 2519.455,
    "text": "There's like a co-lab notebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.19,
    "end": 2550.387,
    "text": " so just going to this and you can you can make a copy right from there um i'll kind of give it back to andrew to continue and then maybe next week we could prepare to execute something just so that we're not like needing to execute on the fly but suffice to say like these notebooks do work and you see a similar specification a b c d",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.755,
    "end": 2554.88,
    "text": " That's what defines the POMDP, those variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.781,
    "end": 2560.507,
    "text": "They're representable in terms of this grayscale heat map visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.348,
    "end": 2564.272,
    "text": "Sometimes black or white is one or zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.432,
    "end": 2568.397,
    "text": "You just have to look at the graphical settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.998,
    "end": 2575.446,
    "text": "But they describe how the variables are shaped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.033,
    "end": 2585.785,
    "text": " And so it can help to just see like okay here's block by block here's all the variables that need to be defined here's what the different slices and the variables are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.825,
    "end": 2597.94,
    "text": "Yes, copy and pasting images or screenshots or code blocks into language models is super helpful as they're very adept at this kind of classical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.22,
    "end": 2601.504,
    "text": " basic code explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.606,
    "end": 2609.657,
    "text": "And these notebooks just go through, define A, B, C. Let's see if we can collapse it and just look at the sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.499,
    "end": 2614.906,
    "text": "D, so A, mapping between hidden states and observations, ambiguity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.106,
    "end": 2618.492,
    "text": "B, transition matrix for the hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.692,
    "end": 2623.54,
    "text": "That's how the hidden states are inferred to change through time in this action-dependent way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.52,
    "end": 2629.608,
    "text": " And then policy selections like selecting which slice from B is going to be used in the time evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.629,
    "end": 2632.892,
    "text": "C, preference over observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.733,
    "end": 2637.478,
    "text": "D, the prior on the hidden state, which kind of kicks off the chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.139,
    "end": 2643.386,
    "text": "But after D is used once, then it's just B and the hidden state S unfolding through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.608,
    "end": 2651.637,
    "text": "So then to specify the agent, it's just taking in these exact four variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.781,
    "end": 2668.527,
    "text": " So adapting active inference in the PMDP setting to whatever it is that you're trying to model, it does come down to making the right shape A, B, C, and D. It's specified like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.587,
    "end": 2674.958,
    "text": "Here is a class object for the game itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.123,
    "end": 2685.939,
    "text": " So here's like where the rules of the game, like the slot machine or whatever, it turns out those at like, or if it's prisoner's dilemma, those are parameterized in something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.019,
    "end": 2694.111,
    "text": "So it's like we defined the whole agent, general model, then the context, the environment that it kind of plays in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.091,
    "end": 2695.914,
    "text": " And then here's the active inference loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.095,
    "end": 2704.806,
    "text": "And here's the pseudocode basically for that OODA loop, like observe, orient, decide, act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.507,
    "end": 2714.54,
    "text": "It's basically like that kind of pseudocode invoking the specific game and the agent and the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.643,
    "end": 2723.052,
    "text": "So this is not like what high throughput production active generative models look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.572,
    "end": 2735.264,
    "text": " But each of these tutorials are super informative because they do work and they are forkable and they do like capture all that's needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.464,
    "end": 2737.526,
    "text": "And so that can help demystify it a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.287,
    "end": 2742.751,
    "text": "It's not like an infinite parameter fishing investigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.312,
    "end": 2751.52,
    "text": "It's like build ABCD underscore one and then try underscore two like a variant and just try recombining them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.888,
    "end": 2761.857,
    "text": " And it's about building like a portfolio of different a B's and C's and D's and agents and visualizations and diagnostics and summary statistics for the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.917,
    "end": 2766.581,
    "text": "And these notebooks go a long, long way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.601,
    "end": 2775.549,
    "text": "And until you're using like large data sets or anything like that, PO lab will have enough computational resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.533,
    "end": 2779.853,
    "text": "Susan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.756,
    "end": 2786.938,
    "text": " Thank you, wonderful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2788.941,
    "end": 2809.269,
    "text": "So, yes, this, you know, in terms of defining an agent, and this kind of is somewhat inspired by Cheryl's question in terms of goals, roles, and context.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2809.289,
    "end": 2815.358,
    "text": "And, you know, what I find rather elusive and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2815.76,
    "end": 2837.529,
    "text": " intriguing is the overall objective of whether that be generative modeling or the generative process is are we seeking certainty or are we seeking insights?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2838.811,
    "end": 2842.476,
    "text": "And so in terms of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2843.063,
    "end": 2850.892,
    "text": " how I perceive, and quite frankly, I'm going to do a plug for my Thursday at 11 a.m.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2853.074,
    "end": 2870.353,
    "text": "foraging insight, because what I'm trying to do is really focus on how people self-model versus how we're trying to predict how people are going to react, which is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2870.654,
    "end": 2873.897,
    "text": " different than trying to program something.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2874.518,
    "end": 2892.196,
    "text": "So although definitely we want to be able to use technology to augment agency, this comes down to how do we help people discover their own agency and affordances within certain parameters?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2893.798,
    "end": 2900.425,
    "text": "How do we translate that into understanding the textbook?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2902.48,
    "end": 2907.989,
    "text": " Does that make sense to anyone?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2908.01,
    "end": 2912.597,
    "text": "I really like that distinction, insight versus certainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2912.637,
    "end": 2917.386,
    "text": "I've never heard that made that way before, but that's so clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2917.446,
    "end": 2919.289,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2920.491,
    "end": 2925.72,
    "text": "So I can see a real problem when you enter",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2925.953,
    "end": 2933.708,
    "text": " you know, an experiment, thinking that you're looking for certainty and you're actually looking for insight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2933.728,
    "end": 2938.718,
    "text": "I mean, I can see how one could confuse those things when they're not distinct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2940.522,
    "end": 2943.287,
    "text": "Yeah, like the whole risk management industry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2948.802,
    "end": 2976.21,
    "text": " But to kind of go to equation 2.6 and then Prakash, this really does map to when we're selecting which experiment to design policy to undertake, the certainty is finding observations that align with our expectations slash preferences, sampling the homeostatic body temperature, like pursuing certainty about our homeostasis for temperature, and then literally the insight or information gain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.19,
    "end": 2997.203,
    "text": " and so and then this ties on this is a big topic so we won't go into it right now but different um scientific epistemologies like does science prove does it disprove oh well they confirmed this in an experiment so they found what they were looking for or they were shocked by this so then what did they expect and then our experiments for falsifying or confirming or neither",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.372,
    "end": 3003.498,
    "text": " Barbara Kirby- And how we hold on to beliefs that may not be.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3005.401,
    "end": 3006.182,
    "text": "Barbara Kirby- prudent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3007.144,
    "end": 3012.233,
    "text": "Barbara Kirby- But you know why we know why that's a surprise versus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3012.273,
    "end": 3024.996,
    "text": "Barbara Kirby- You know, being able to belief update, so you know this really calls into question, you know what is learning, I mean that might be good good start is is what is learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3026.107,
    "end": 3033.235,
    "text": " because is learning consuming information or is it digesting it and taking action on it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3038.781,
    "end": 3040.583,
    "text": "And learning from the action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3040.603,
    "end": 3055.219,
    "text": "I mean, I'll borrow from something Daniel said earlier as is, and you might have to reiterate it Daniel, but yeah, moving the pebbles, moving the pebbles, that's what matters.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3057.157,
    "end": 3064.288,
    "text": " And until we actually act on the world, we're not moving the pedals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3064.649,
    "end": 3075.747,
    "text": "We're just regurgitating and fall into rumination.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3082.557,
    "end": 3082.978,
    "text": "Wow.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3087.16,
    "end": 3109.658,
    "text": " I actually just shared I personally coming from like a computational psychiatry sort of background slash that's my current field of interest and I just shared this actually since you mentioned the word rumination and there's another paper elsewhere on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.773,
    "end": 3117.288,
    "text": " attempting to simulate rumination as a kind of cognitive process that can arise based on certain circumstances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3117.689,
    "end": 3126.246,
    "text": "I shared this one in particular because it's one of the papers that I've seen so far that best tries to describe",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.563,
    "end": 3141.636,
    "text": " um in a more kind of human relatable view um like what it is to self-model in one's environment because as we know like one of the bases of active inference is free energy principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3141.616,
    "end": 3150.81,
    "text": " an agent needs to have an understanding of what separates itself from its environment in order to maintain itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3150.91,
    "end": 3158.362,
    "text": "Otherwise, however we want to phrase it from a physics point of view, the environment is entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3159.363,
    "end": 3164.331,
    "text": "You dissipate if you just give in to everything that's around you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3164.351,
    "end": 3170.34,
    "text": "You have to breathe in oxygen, you have to do a variety of things that maintain what is you versus what is outside of you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.32,
    "end": 3173.603,
    "text": " It's really crucial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3174.184,
    "end": 3197.408,
    "text": "I like this paper because it describes a little bit more in-depth for a human being what might be required or involved in self-modeling, how important it is to have a model of oneself, the role of things like sensory attenuation, which is another big aspect of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3197.388,
    "end": 3225.893,
    "text": " in order to move your arm you need to like be able to briefly put simply you need to forget that your arm is in one spot you need to believe that you can move it to the place you want to move it to so what you're doing is you're attenuating or kind of ignoring where it is right now you're in motion you're trying to be in motion right so if you overly believe like you keep that that belief fixed that your arm is in one spot it's going to stay there you have to move it um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3226.261,
    "end": 3231.708,
    "text": " That becomes really important when self modeling too, in order to operate in the bigger world around you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3233.01,
    "end": 3237.536,
    "text": "So, so just all these finer details and aspects of self modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.556,
    "end": 3239.979,
    "text": "I think it's a fascinating topic though, for sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.999,
    "end": 3245.246,
    "text": "So is, is that the paper that Andrew shared?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3245.907,
    "end": 3248.37,
    "text": "Is that the overthinking?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3250.673,
    "end": 3251.714,
    "text": "Is it covered in that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3251.734,
    "end": 3252.615,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3252.635,
    "end": 3252.816,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.056,
    "end": 3253.276,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.296,
    "end": 3254.498,
    "text": "That's sharing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3254.518,
    "end": 3254.698,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3255.168,
    "end": 3271.904,
    "text": " Andrew Tucci, Norcal PTACC, he doesn't get into the its specific topic of interest is depersonalization disorder, but I think the first half of it is really broad and I just you know I think it's a nice introduction to just thinking about self modeling in general, regardless if you're interested in psychiatry or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3272.485,
    "end": 3273.806,
    "text": "cool yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3273.826,
    "end": 3274.046,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3274.066,
    "end": 3277.95,
    "text": "Paul Haney, For kosh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.591,
    "end": 3280.973,
    "text": "Paul Haney, Andrew you can kind of end it, however, you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.999,
    "end": 3284.543,
    "text": " Yeah, Daniel, I have a basic question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.563,
    "end": 3290.352,
    "text": "I was wondering the PyMDP which you showed, can it also handle hierarchical models?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.075,
    "end": 3293.397,
    "text": "Yeah, it can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.679,
    "end": 3294.96,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.34,
    "end": 3301.23,
    "text": "I don't know if there's a tutorial on it, but we can ask the authors, but we can look through the literature and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.25,
    "end": 3302.632,
    "text": "But yes, it can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.215,
    "end": 3306.238,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.539,
    "end": 3306.859,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.877,
    "end": 3314.384,
    "text": " I also mentioned that Daniel just put in the coda there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3314.424,
    "end": 3316.968,
    "text": "I shared the Ryan Smith tutorials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3317.449,
    "end": 3327.465,
    "text": "And while those use MATLAB, a lot of the PyMDP stuff, the coding, it's based upon a lot of what goes on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.126,
    "end": 3335.057,
    "text": "Basically, active inference modeling generally started with MATLAB and SPM, which is what Ryan Smith",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.037,
    "end": 3336.119,
    "text": " and everyone else covers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3336.66,
    "end": 3344.314,
    "text": "And then Connor Hines and a variety of other researchers put together PyMDP, much of it being based on the prior work in MATLAB.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3344.755,
    "end": 3355.534,
    "text": "And so at least for a verbal explanation of hierarchical modeling, I believe it's either the second or the third video of the series with Ryan Smith.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3356.315,
    "end": 3357.197,
    "text": "If you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.177,
    "end": 3364.807,
    "text": " So I guess that would be like model stream 001.3 versus the one that's on the code of 001.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3365.828,
    "end": 3373.839,
    "text": "Just if you want like a more verbal explanation of kind of how that can work in a more direct coding setting as a programmer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3376.062,
    "end": 3377.384,
    "text": "Yeah, just wanted to mention that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3378.205,
    "end": 3380.788,
    "text": "And yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.359,
    "end": 3381.74,
    "text": " I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.84,
    "end": 3389.293,
    "text": "I think we're just about out of time here, but just a brief recap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3389.413,
    "end": 3394.082,
    "text": "This was chapter six, our recipe for putting together models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3395.063,
    "end": 3399.992,
    "text": "Potentially it provokes more questions than it answers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3399.972,
    "end": 3408.432,
    "text": " But I think it basically brings up all the questions that you need to be concerned with whenever you're putting together a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.492,
    "end": 3409.354,
    "text": "What is the agent?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3409.815,
    "end": 3411.118,
    "text": "What defines the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.519,
    "end": 3412.501,
    "text": "What are the variables?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3412.762,
    "end": 3413.463,
    "text": "Are they discrete?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.544,
    "end": 3414.606,
    "text": "Are they continuous?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.025,
    "end": 3433.928,
    "text": " do they work together how do we relate them to domain knowledge um and and actually translate between you know the the language of bayesian statistics and mechanics with uh if you're a social scientist or or um an engineer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3434.448,
    "end": 3439.515,
    "text": " And so, yeah, kicks off part two of the book overall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.575,
    "end": 3444.562,
    "text": "The next chapter will get into continuous models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3444.662,
    "end": 3453.334,
    "text": "And I think that's, it might be the case that for a good deal of people here who are interested in modeling, it might be the case that you'll be looking at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3453.533,
    "end": 3454.675,
    "text": " Jake Hamilton, A P m dp.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.196,
    "end": 3461.928,
    "text": "Jake Hamilton, Like that's what's used most frequently with trying to model like human beings in their environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3462.489,
    "end": 3469.922,
    "text": "Jake Hamilton, Animals as well, but they're used they they involve including things like planning a time horizon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3470.392,
    "end": 3473.375,
    "text": " They don't have to, but they can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3473.775,
    "end": 3485.827,
    "text": "And yeah, hopefully it'll give you much more concrete examples of thinking through like how do we translate between a model and what we're actually trying to do here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3486.428,
    "end": 3491.693,
    "text": "Hopefully chapter seven basically will clear up some questions you might've had from chapter six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3494.556,
    "end": 3494.937,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.977,
    "end": 3496.238,
    "text": "Awesome work, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.458,
    "end": 3497.139,
    "text": "Thank you, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.199,
    "end": 3498.34,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.691,
    "end": 3499.427,
    "text": " Thanks, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.471,
    "end": 3501.411,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]