[
  {
    "start": 7.179,
    "end": 14.488,
    "text": " hello everyone it is august 3rd 2022 and it's act inf guest stream number 25.1",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.633,
    "end": 27.396,
    "text": " We're here with Brett Anderson and we'll be hearing about autistic-like traits and positive schizotypy as diametric specializations of the predictive mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.036,
    "end": 33.137,
    "text": "There will be first a presentation followed by a discussion segment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.237,
    "end": 37.379,
    "text": "So if you're watching live, feel free to add any comments or questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.199,
    "end": 42.36,
    "text": "And Brett, thank you again for joining and on with the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.408,
    "end": 43.688,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.728,
    "end": 45.35,
    "text": "Thank you, Daniel, for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.01,
    "end": 50.074,
    "text": "So, yeah, this is a paper that was published this earlier this month.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.915,
    "end": 55.299,
    "text": "And so before I get into the paper, I should probably introduce myself just a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.519,
    "end": 60.023,
    "text": "So I am an evolutionary psychology student at the University of New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.944,
    "end": 67.47,
    "text": "My research mainly has to do with something called the diametric model of autism and psychosis, which I'll talk more about that here in just a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.25,
    "end": 71.952,
    "text": " So I am not trained in active inference or predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.412,
    "end": 82.676,
    "text": "I came to this because I was looking for a theory that could explain variation along this autism-schizotype continuum, and I'll say what that is here in just a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.636,
    "end": 92.822,
    "text": " And I came across Sanders, Vandekrois, and colleagues 2014, their paper about autism published in Psychological Review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.623,
    "end": 104.71,
    "text": "And it was through that paper that I sort of came to write this paper because I realized at some point that that was the theory I was looking for and that the opposite configuration of what they put forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.73,
    "end": 109.614,
    "text": "So they said that autism results from giving an inflexibly high weight to sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.654,
    "end": 113.136,
    "text": "And what I realized through reading that paper and reading some other stuff around the topic,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.016,
    "end": 119.759,
    "text": " was that giving an inflexibly low weight to sensory input does a really good job of explaining the other side of that continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.12,
    "end": 121.701,
    "text": "And so that's what this paper is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.381,
    "end": 124.242,
    "text": "So I'm putting forward",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.587,
    "end": 129.871,
    "text": " an explanation for a continuum of individual differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.792,
    "end": 133.014,
    "text": "So just an idea of what I'm going to talk about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.054,
    "end": 142.985,
    "text": "So I'm going to talk about the diametric model of autism and psychosis, what it is, what some of the evidence for it is, how it manifests in non-clinical populations, which is what my research mainly focuses on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.385,
    "end": 146.148,
    "text": "And we refer to that as the autism schizotypy continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.365,
    "end": 156.311,
    "text": " And then the hypothesis that I put forward in this paper, which has to do with explaining variation along this continuum due to trade-offs in precision weighting, due to precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.091,
    "end": 161.414,
    "text": "And then I'll talk about some implications for predictive processing and active reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.274,
    "end": 171.96,
    "text": "So the diametric model of autism and psychosis was first put forward by Crespi and Badcock, Bernie Crespi and Christopher Badcock in a 2008 BBS paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.02,
    "end": 172.08,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.839,
    "end": 185.164,
    "text": " It is very simply put, just the idea that autism spectrum conditions and psychosis spectrum conditions are cognitive and genetic opposites.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.425,
    "end": 191.568,
    "text": "Before I get into some of the evidence for it, I want to at least address what I think is the most common objection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.708,
    "end": 193.849,
    "text": "I hear it all the time, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.629,
    "end": 203.496,
    "text": " How can the diametric model be true, given that some people who are diagnosed with an autism spectrum condition experience psychosis and vice versa, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.516,
    "end": 206.539,
    "text": "So there's comorbidity between these disorders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.879,
    "end": 209.902,
    "text": "How can this diametric model be the case, be true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.363,
    "end": 238.083,
    "text": " i have a whole video about that on my youtube channel i might put the link in the comments to this to this youtube video but basically the response to this objection is just to point out that dsm categories are extremely heterogeneous so within each dsm category you're going to find multiple etiologies but that may be totally unrelated to each other in some cases so for example you could have somebody diagnosed with an autism spectrum condition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.238,
    "end": 262.21,
    "text": " that uh is is diagnosed with that mainly because for example they have like a language condition they have maybe a language delay and that causes a communicative a communication problem and then they get the autism diagnosis and it's not supposed to happen that way but it definitely does happen that way and so that would be different from somebody who has a more classical presentation with restricted and repetitive behaviors and so on and so that person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.3,
    "end": 266.662,
    "text": " their etiology may have nothing whatsoever to do with the diametric model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.102,
    "end": 277.627,
    "text": "So basically, given the heterogeneity of these conditions, we don't expect to have any precise theory that's going to explain every case of the condition, and that includes the diametric model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.428,
    "end": 280.409,
    "text": "So what is some of the evidence for the diametric model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.429,
    "end": 290.054,
    "text": "I think the best evidence for it is just to point out all of the diametrically related characteristics on either side of this, what's meant to be a continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.252,
    "end": 293.66,
    "text": " So with autism spectrum conditions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.724,
    "end": 298.086,
    "text": " There's evidence that paternally expressed genes promote autism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.126,
    "end": 300.367,
    "text": "So we get two copies of every gene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.387,
    "end": 302.027,
    "text": "We get one from our mom and one from our dad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.588,
    "end": 305.669,
    "text": "There are a subset of genes that are called imprinted genes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.229,
    "end": 308.771,
    "text": "And with those genes, you only express one of those copies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.811,
    "end": 311.152,
    "text": "So you might express the copy only from your dad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.292,
    "end": 313.673,
    "text": "That's a paternally expressed gene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.053,
    "end": 319.776,
    "text": "Paternally expressed genes, when they're hyperexpressed, tend to promote autism spectrum conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.736,
    "end": 323.278,
    "text": "We see overgrowth in autism, especially in infancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.298,
    "end": 342.777,
    "text": " hypermentalizing which is reduced attribution of mental states to other people reduced imagination hyper systemizing relative right hemisphere dysfunction increased cancer rates which is related to the genomic imprinting issue and we also see a sex difference where men tend to be higher in autistic-like traits and they tend to be diagnosed with autism more often",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.217,
    "end": 346.48,
    "text": " And on the psychosis side of things, we see a lot of opposite characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.52,
    "end": 350.923,
    "text": "So we see evidence that maternally expressed genes promote psychosis spectrum conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.284,
    "end": 366.856,
    "text": "We see undergrowth, especially in infancy, hypermentalizing, which is increased attribution of mental states to other people, often that manifests as paranoia, increased imagination, apophenia, which is predisposition to false positives, relative left hemisphere dysfunction,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.967,
    "end": 370.048,
    "text": " reduced cancer rates, at least with schizophrenia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.768,
    "end": 373.309,
    "text": "And we also see a sex difference with positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.349,
    "end": 375.729,
    "text": "So women tend to be higher in positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.39,
    "end": 392.515,
    "text": "If we're talking about psychosis, so men tend to be, so the type of psychosis that men tend to present with tends to be more often degenerative schizophrenia, whereas women tend to present more with acute psychosis, which seems to have more of a relation to the diametric model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.031,
    "end": 400.073,
    "text": " Now what this paper is focused on is how the diametric model manifests in non-clinical populations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.113,
    "end": 405.416,
    "text": "So we talk about autistic-like traits on one end of this continuum and positive schizotypy on the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.956,
    "end": 411.178,
    "text": "And so the hypothesis put forward in this paper is not primarily about dysfunction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.318,
    "end": 415.54,
    "text": "It's not primarily about explaining mental disorders or mental conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.0,
    "end": 420.962,
    "text": "It's about explaining a continuum of individual differences that we all fall somewhere along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.022,
    "end": 424.164,
    "text": "And so this is referred to as the autism schizotypy continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.044,
    "end": 433.927,
    "text": " On the autistic side, on the side associated with autistic-like traits, we see hypomentalizing, reduced imagination, increased systemizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.067,
    "end": 439.769,
    "text": "They tend to be relatively poor at noisy pattern detection, although they're very good at pattern detection when there's not a lot of noise in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.529,
    "end": 442.57,
    "text": "We see this narrow focused attention style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.49,
    "end": 448.892,
    "text": "And people high in autistic-like traits are overrepresented among engineers and other technical professions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.034,
    "end": 463.722,
    "text": " On the positive schizotypy side, we see hypermentalizing, increased imagination, reduced systemizing, apophenia, and this more broad, distractible attention style, and they tend to be overrepresented among artists and other creative professions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.131,
    "end": 473.579,
    "text": " And so the hypothesis that I put forward to try to explain variation along this continuum, I refer to it as the precision weighting of sensory input hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.62,
    "end": 479.485,
    "text": "As I'm sure everybody listening to this knows, precision weighting underlies the allocation of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.166,
    "end": 487.252,
    "text": "So you can adjust the precision that you're giving to sensory input in order to account for noise in the input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.468,
    "end": 494.791,
    "text": " And Van de Kroys and colleagues in their 2014 paper published in Psychological Review, this was not the only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.831,
    "end": 498.593,
    "text": "So there was a few papers published around this time that were sort of talking about this idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.653,
    "end": 501.894,
    "text": "Theirs was the first to really put it forward in full detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.835,
    "end": 509.298,
    "text": "So they argued that autism spectrum disorders are caused by giving an inflexibly high weight to sensory prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.465,
    "end": 512.687,
    "text": " And my paper simply extends this hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.007,
    "end": 528.917,
    "text": "I'm arguing that there is a continuum of individual differences characterized by people who give a relatively high weight to sensory input on one side that's associated with autism and autistic-like traits, and people who give a relatively low weight to sensory input on the other side, which is associated with positive schizotyping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.847,
    "end": 541.061,
    "text": " And these differences are going to be associated with leaning towards overfitting sensory input, which is what happens in autism, and leaning towards underfitting sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.241,
    "end": 544.625,
    "text": "And that underfitting can explain some of the features of positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.266,
    "end": 547.809,
    "text": "And so just to give a visual demonstration of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.63,
    "end": 553.692,
    "text": " This is a very simplified visual demonstration, but the dots here are sensory input, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.772,
    "end": 554.812,
    "text": "And the line is the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.353,
    "end": 563.676,
    "text": "So if you're overfitting, if you're leaning towards giving a high weight to sensory input, you're going to end up fitting your model too precisely to the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.216,
    "end": 566.437,
    "text": "And that means that you're going to incorporate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.597,
    "end": 568.838,
    "text": "So a lot of that variation in the model is noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.298,
    "end": 571.919,
    "text": "You're going to end up incorporating noise into your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.079,
    "end": 575.12,
    "text": "The opposite problem that you can have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.54,
    "end": 582.246,
    "text": " is instead of giving too much weight to the sensory input, you're giving too much weight to your hypothesis about the input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.806,
    "end": 585.869,
    "text": "So you're kind of imposing your hypothesis onto the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.909,
    "end": 588.392,
    "text": "You're imposing your prediction onto the input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.412,
    "end": 594.177,
    "text": "So in this example, on the right hand side of the screen, the top down prediction is that the data is linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.938,
    "end": 599.462,
    "text": "And if you give too much weight to that prediction, you can end up imposing a linear model onto the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.342,
    "end": 604.865,
    "text": " And something like this, I will argue, is going on in positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.425,
    "end": 611.468,
    "text": "And then there is some optimal balance that you're going to find that is going to give you the best chance of finding the pattern underlying the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.868,
    "end": 616.991,
    "text": "Importantly, that balance is never the same or it's not stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.051,
    "end": 622.594,
    "text": "So it depends on how much noise is in the data, depends on how much you want to generalize from the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.075,
    "end": 625.516,
    "text": "And so there is no single optimal solution, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.536,
    "end": 627.357,
    "text": "There are always trade-offs associated with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.116,
    "end": 636.602,
    "text": " And so these are the differences that I am going to argue that I can explain with this hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.283,
    "end": 647.992,
    "text": "So differences along the autism-schizotypy continuum, these include bottom up versus top down influences on perception and cognition, hypomentalizing versus hypermentalizing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.712,
    "end": 651.374,
    "text": " Reduced imagination versus increased imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.074,
    "end": 655.336,
    "text": "And everything on the left here is associated with the autistic-like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.897,
    "end": 659.559,
    "text": "And then narrow, detailed attention versus broad, distractible attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.279,
    "end": 663.101,
    "text": "Apophenia, which is associated with positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.281,
    "end": 666.283,
    "text": "Systemizing, which is associated with autism and autistic-like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.743,
    "end": 669.745,
    "text": "And then differences in the propensity for exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.106,
    "end": 676.89,
    "text": "So we're going to go through all of these and show how this hypothesis may be able to account for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.038,
    "end": 690.722,
    "text": " So with bottom up versus top down influences on perception, Crespi and Dinsdale in a 2019 paper reviewed evidence for diametric susceptibility to the rubber hand illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.242,
    "end": 693.723,
    "text": "So most people probably know what the rubber hand illusion is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.083,
    "end": 697.184,
    "text": "Got a little visual thing on the right hand side that shows what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.244,
    "end": 702.625,
    "text": "So with the rubber hand illusion, you have your real hand hidden by some screen or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.226,
    "end": 706.587,
    "text": "And a rubber hand is placed in front of you where you think the real hand is going to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.127,
    "end": 730.339,
    "text": " the experimenter will take a feather or something and they will stroke your real hand at the same time as they stroke the rubber hand and that will produce the illusion that the rubber hand belongs to you and oftentimes at the end of the experiment they'll take a hammer and slam it down on the rubber hand and you'll jump and all that so you really you really do sort of think that the hand is yours uh what Crespi and Dinsdale reviewed evidence for is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.431,
    "end": 750.041,
    "text": " Oh, before I get to that, so Jakob Howey, I think that's how you say that, say his name, Jakob Howey in his book suggested that the illusion works because of the top-down prior belief that systematically related properties, in this case seeing a hand being stroked and feeling your own hand being stroked at the same time, are very likely to be causally related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.501,
    "end": 751.602,
    "text": "And so what that means...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.904,
    "end": 759.71,
    "text": " is that susceptibility to the illusion should be facilitated by giving more weight to your top-down priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.75,
    "end": 769.059,
    "text": "So a relative overweighting of top-down priors should facilitate susceptibility to the illusion, and decreased susceptibility should be facilitated by giving more weight to bottom-up sensor input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.039,
    "end": 782.688,
    "text": " In that case, we would expect for autism and autistic-like traits to be associated with reduced susceptibility and positive schizotypy and psychosis to be associated with more susceptibility, and that is what Crespi and Dinsdale find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.968,
    "end": 791.795,
    "text": "They find that autism is associated with reduced susceptibility and vice versa for positive schizotypy and predisposition to psychosis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.167,
    "end": 795.648,
    "text": " Moving on to mentalizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.529,
    "end": 808.636,
    "text": "So within the predictive processing framework, mentalizing or theory of mind is thought to result from the use of relatively abstract or high-level predictions, priors to predict other people's behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.756,
    "end": 822.185,
    "text": "And so again, sort of the same principle as the last time, if that's the case, we would expect an overweighting of bottom-up input relative to priors should result in hypomentalizing or reduced attribution of mental states to other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.865,
    "end": 830.067,
    "text": " And an overweighting of priors should result in the opposite of hypermentalizing or giving an increased attribution of mental states to other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.447,
    "end": 833.768,
    "text": "And of course, that is what we find associated with the autism schizotypy continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.468,
    "end": 843.171,
    "text": "This was one of the things that van der Kroys and colleagues talked about in their 2014 paper, but the opposite positive schizotypy does result in the opposite finding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.692,
    "end": 849.333,
    "text": "So next up is imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.664,
    "end": 868.549,
    "text": " uh andy clark in a 2013 paper he argued that we we go into our imagination when we should when we sufficiently turn down the weight that we're giving to proprioceptive sensory input and so when we do that we are now dealing with our top-down predictions sort of offline right unmoored from the sensory input",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.688,
    "end": 878.875,
    "text": " So what this should mean is that if you're giving an inflexibly high weight to sensory input, that should make it more difficult to turn down that weight enough to go into your imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.916,
    "end": 885.721,
    "text": "If you're giving an inflexibly low weight to sensory input, this should mean that you will find it easier to go into your imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.361,
    "end": 890.064,
    "text": "And that is we do find this difference along the autism schizotype continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.084,
    "end": 891.786,
    "text": "So people high in autistic like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.335,
    "end": 897.637,
    "text": " They have imaginative deficits often and people high in positive schizotype.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.398,
    "end": 902.9,
    "text": "They do better on tasks that at least purportedly measure imagination, like divergent thinking tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.54,
    "end": 906.541,
    "text": "There's evidence that they spend more time daydreaming and mind wandering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.681,
    "end": 910.883,
    "text": "And of course, they're also overrepresented among artists and creative professions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.205,
    "end": 913.445,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.706,
    "end": 916.926,
    "text": "Moving on to attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.946,
    "end": 916.986,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.56,
    "end": 930.644,
    "text": " Abu Akle and colleagues in a couple papers in 2017 and 2018 demonstrated diametric attention styles for people high in positive schizotypy and people high in autistic-like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.325,
    "end": 931.985,
    "text": "What they showed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.12,
    "end": 941.607,
    "text": " especially in the 2018 paper, people high in autistic-like traits do better on a task where they had to ignore salient distractors, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.627,
    "end": 951.435,
    "text": "So the task was essentially they had to focus on something on the screen and they had to ignore salient distractors that would pop up in the periphery and that facilitated them doing better on the task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.196,
    "end": 954.177,
    "text": "On the other hand, people high in positive schizotypy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.205,
    "end": 960.289,
    "text": " did better on a task that was facilitated by the opposite, by being distracted by the things in that periphery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.189,
    "end": 968.335,
    "text": "So we see this sort of focused attention style with autism, and we see this more diffuse, distractible attention style with positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.135,
    "end": 972.458,
    "text": "There is other evidence for this, and I reviewed that in the paper if you want to look at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.211,
    "end": 977.133,
    "text": " So the question is, how can the PSI hypothesis account for this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.433,
    "end": 984.115,
    "text": "I think this one, even though it should, you might think it's the most straightforward one because precision weighting is about attention and this is attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.976,
    "end": 987.317,
    "text": "It's actually, I think, the least straightforward one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.017,
    "end": 989.858,
    "text": "And the reason why is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.147,
    "end": 1011.113,
    "text": " It does seem somewhat intuitive that if you're being bombarded sort of by highly precise sensory prediction errors, which is what we argue happens in autism, you might think that would make you more distractible and vice versa for positive schizotypy, since they're only paying attention to relatively large prediction errors that might make them less distractible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.953,
    "end": 1013.134,
    "text": "That isn't the case, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.535,
    "end": 1018.517,
    "text": " It'll take a little bit of unpacking to explain why, and I'm going to use an analogy here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.557,
    "end": 1021.518,
    "text": "We're going to use what I'm calling the fire department analogy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.559,
    "end": 1025.24,
    "text": "So you can imagine that you have two fire departments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.28,
    "end": 1031.363,
    "text": "We'll just call them fire department A and fire department B. And there are three kinds of fires that you could have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.403,
    "end": 1034.104,
    "text": "So you could have small fires, medium fires, and large fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.944,
    "end": 1035.925,
    "text": "And these departments...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.142,
    "end": 1048.723,
    "text": " receive calls about the fires but they are not told how big the fires are right so they're they get a call they're told that there's a fire at this location but they're not told whether it's a small medium or large fire they're just told that there's a fire",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.943,
    "end": 1054.805,
    "text": " Department A has a policy where they receive calls about all kinds of fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.845,
    "end": 1057.866,
    "text": "So they receive calls about small, medium, and large fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.386,
    "end": 1062.728,
    "text": "And Department B has a policy where they only receive calls about large fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.768,
    "end": 1064.988,
    "text": "So they don't take calls about small and medium fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.309,
    "end": 1073.952,
    "text": "I'm arguing that this is basically equivalent, within this analogy, to giving a high weight to sensory input for Department A, which they take calls about all fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.452,
    "end": 1076.773,
    "text": "And as Van de Kruys and colleagues pointed out in their 2014 paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.953,
    "end": 1083.678,
    "text": " When you're giving a high weight to sensory input, you're treating all of these sensory prediction errors as if they're all important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.559,
    "end": 1088.122,
    "text": "The problem with that, of course, is that not all sensory prediction errors are actually important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.284,
    "end": 1095.249,
    "text": "Department B, who only receives calls about large fires, this is equivalent to giving a low weight to sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.465,
    "end": 1098.205,
    "text": " So which strategy works better?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.786,
    "end": 1100.146,
    "text": "That depends on the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.386,
    "end": 1106.748,
    "text": "So if there are more fires than you can put out at a given time, if the whole city catches fire at once, Department B works better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.908,
    "end": 1109.949,
    "text": "Because in that case, you actually don't want to pay attention to the small fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.109,
    "end": 1111.909,
    "text": "You only want to pay attention to the large fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.929,
    "end": 1113.169,
    "text": "You want to ignore the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.27,
    "end": 1117.791,
    "text": "If there's not that many fires at a time, you don't want to ignore small fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.951,
    "end": 1119.271,
    "text": "You want to pay attention to the small fires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.311,
    "end": 1121.111,
    "text": "So Department A works better in that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.726,
    "end": 1129.651,
    "text": " Now imagine that these two departments are in the midst of putting out a particularly large and important fire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.092,
    "end": 1135.776,
    "text": "They receive a call about a new fire, and the question here is what should they do in relation to this call?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.457,
    "end": 1140.14,
    "text": "Department A should maintain focus on the current fire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.2,
    "end": 1146.185,
    "text": "That's because when they receive a call, they don't know whether it's small, medium, or large, and it's more likely to be small or medium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.006,
    "end": 1150.829,
    "text": "So they should ignore the call, maintain focus on their current task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.217,
    "end": 1155.578,
    "text": " Department B should be more willing to allocate resources to the new fire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.618,
    "end": 1162.321,
    "text": "They know that it's a large fire because they only receive calls about large fires, so they should be more willing to redirect their attentional resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.961,
    "end": 1168.183,
    "text": "This is my argument for why we see this attentional difference along the autism-schizotypic continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.983,
    "end": 1178.405,
    "text": " People high in autistic-like traits have learned that the peripheral prediction errors are very likely to be unimportant and that they should focus in on the task at hand, that learning probably happens unconsciously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.326,
    "end": 1182.826,
    "text": "People high in positive schizotypy have learned the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.306,
    "end": 1193.209,
    "text": "If they receive a prediction error on the periphery, they've learned to assume that it's important because they only pay attention to important prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.269,
    "end": 1197.97,
    "text": "This analogy is what I'm using to explain this attentional difference along the autism schizotypy continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.433,
    "end": 1201.315,
    "text": " So moving on to systemizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.456,
    "end": 1211.445,
    "text": "So people high in autistic-like traits and people with an autism spectrum condition are often very skilled at learning about rules-based systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.565,
    "end": 1213.867,
    "text": "So this would be something like a computer programming language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.208,
    "end": 1216.37,
    "text": "Most of mathematics falls under this category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.07,
    "end": 1218.272,
    "text": "They tend to be very good at these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.963,
    "end": 1226.825,
    "text": " If you remember, you know, overfitting results from incorporating noise into your predictive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.545,
    "end": 1231.787,
    "text": "The thing about a rules-based system is that there is no noise in that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.267,
    "end": 1236.828,
    "text": "If it's truly rules-based, then when you put in a certain input, you get the same output every time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.108,
    "end": 1244.231,
    "text": "It can be an extremely complex, these can be extremely complex rules, like there are with computer programming languages, but they're extremely precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.246,
    "end": 1256.653,
    "text": " And so that highly precise cognitive perceptual style that comes with giving a high weight to sensory input is going to facilitate the systemizing ability with autism and autistic-like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.453,
    "end": 1264.238,
    "text": "So for a visual demonstration of this, you can have this complex pattern and there's no noise in the pattern, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.258,
    "end": 1265.899,
    "text": "It might be highly complex, but there's no noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.84,
    "end": 1271.543,
    "text": "If you're giving a high weight to sensory input, you can fit your model as precisely as you want to this pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.083,
    "end": 1276.304,
    "text": " And you're not going to run into the problem of overfitting because there is no noise to be incorporated in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.064,
    "end": 1284.105,
    "text": "People high in positive schizotypy, on the other hand, may attempt to impose a simplifying assumption onto the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.125,
    "end": 1290.587,
    "text": "They may attempt to impose simplifying assumptions onto this complex but non-noisy input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.627,
    "end": 1294.347,
    "text": "And that will lead them to not be as good at systemizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.367,
    "end": 1296.428,
    "text": "And that is what we find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.279,
    "end": 1300.76,
    "text": " looking at noisy patterns now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.34,
    "end": 1306.464,
    "text": "So people with autism spectrum conditions are relatively poor at picking up on noisy patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.304,
    "end": 1312.568,
    "text": "I was not able to get to this in the paper because I didn't have room, but it is something that I would have included if I had room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.508,
    "end": 1318.591,
    "text": "We review the evidence for this in an upcoming paper with myself, John Vervaeke, and Mark Miller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.512,
    "end": 1327.077,
    "text": "So if you're giving a high weight to sensory input, it's going to make it more difficult to pick up on patterns that are embedded in noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.092,
    "end": 1332.174,
    "text": " And there is no evidence that people high in positive schizotypy have issues with noisy patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.214,
    "end": 1333.615,
    "text": "So apophinia is a different thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.635,
    "end": 1334.435,
    "text": "We'll talk about that next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.096,
    "end": 1338.357,
    "text": "But there is evidence for this with autistic-like traits and ASD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.377,
    "end": 1342.039,
    "text": "And we can understand why that's the case for the same reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.38,
    "end": 1368.954,
    "text": " if you have this noisy data and you're trying to fit your model very precisely to that noisy data you are not going to pick up on the underlying pattern right you're going to miss out on it on the underlying pattern you're going to uh overfit your model to this data uh so people high in positive schizotype really ought to be better at picking up on these kinds of noisy patterns because they're not going to they're not going to miss out on the big picture by paying too much attention attention to the details is essentially what would happen there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.105,
    "end": 1374.366,
    "text": " So apophenia is the next one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.386,
    "end": 1378.428,
    "text": "So apophenia is when you perceive patterns in pure noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.528,
    "end": 1381.23,
    "text": "And this is thought to be a core feature of positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.01,
    "end": 1386.852,
    "text": "So, for example, people high in positive schizotypy are more likely to hear messages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.072,
    "end": 1392.175,
    "text": "If you listen to audio that's pure noise, they're more likely to say that they heard a voice in the noise or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.462,
    "end": 1400.212,
    "text": " And giving a low weight to sensory input means that they will often impose their top-down assumptions onto pure noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.953,
    "end": 1404.438,
    "text": "There's no evidence that people high in autistic-like traits have issues with apophenia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.299,
    "end": 1407.923,
    "text": "And so, again, this is just a visual demonstration of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.244,
    "end": 1414.927,
    "text": " with autistic-like traits when they're presented with pure noise, again, they're not going to see any pattern in that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.947,
    "end": 1416.368,
    "text": "They're just going to see randomness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.048,
    "end": 1428.196,
    "text": "People high in positive schizotypy may, again, they may attempt to impose a pattern onto this data because they're giving more weight to the top-down assumption and less weight to the bottom-up input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.619,
    "end": 1433.22,
    "text": "So I think this is the last one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.26,
    "end": 1434.361,
    "text": "I might finish a little early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.141,
    "end": 1437.023,
    "text": "Exploitation, exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.083,
    "end": 1438.704,
    "text": "So we do see evidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.12,
    "end": 1447.869,
    "text": " OK, so yeah, so deciding whether to exploit current opportunities or search for new ones through exploration is a fundamental trade off that faces all organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.65,
    "end": 1454.737,
    "text": "And there is evidence that people high in positive schizotypy are more exploratory than people high in autistic like traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.097,
    "end": 1460.483,
    "text": "So, for example, they are higher in the personality traits of openness and extroversion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.384,
    "end": 1468.366,
    "text": " Colin DeYoung and some of his colleagues have argued that those two traits form a higher order trait called plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.826,
    "end": 1474.068,
    "text": "And DeYoung has argued that plasticity represents the general tendency towards exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.088,
    "end": 1477.789,
    "text": "So that's some evidence for differences in exploratory tendency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.209,
    "end": 1482.051,
    "text": "We also see differences in sensation seeking associated with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.271,
    "end": 1486.532,
    "text": "So sensation seeking has also been argued to be an indicator of exploratory tendency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.055,
    "end": 1492.177,
    "text": " So Kibberstein and colleagues in a 2019 paper said this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.397,
    "end": 1502.161,
    "text": "They said that a large but resolvable error signal informs the agent that the environment offers the opportunity to resolve uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.941,
    "end": 1507.583,
    "text": "That opportunity to resolve uncertainty makes exploration an attractive option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.544,
    "end": 1509.124,
    "text": "The issue is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.63,
    "end": 1520.555,
    "text": " So if you're giving an inflexibly high weight to sensory input, what that means is that you're not seeing large differences between the prediction errors that you're receiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.915,
    "end": 1525.177,
    "text": "Giving a low weight to sensory input means that people high in positive schizotypy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.837,
    "end": 1528.378,
    "text": " only tend to pay attention to large prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.818,
    "end": 1532.54,
    "text": "And these large prediction errors are more likely to incentivize exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.58,
    "end": 1536.142,
    "text": "They represent a greater potential information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.302,
    "end": 1547.507,
    "text": "And so people high in autistic-like traits, we see that autism is associated with restricted and repetitive behaviors and relatively narrow interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.608,
    "end": 1551.749,
    "text": "And that's a reflection of this reduced exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.339,
    "end": 1562.462,
    "text": " Yeah, so like I said before, giving a high weight to sensory input means that most prediction errors are going to be treated as relatively equal and in importance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.862,
    "end": 1573.186,
    "text": "And as Van de Kroys and colleagues pointed out in the 2014 paper, if each prediction error is as important as the next, it is more difficult to estimate where predictive process can be made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.527,
    "end": 1576.348,
    "text": "And therefore, exploration is not as enticing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.208,
    "end": 1578.689,
    "text": "This comes with a benefit, however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.693,
    "end": 1587.202,
    "text": " because the decreased exploration that's associated with autistic-like traits is also why they tend to be more competent specialists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.242,
    "end": 1594.431,
    "text": "They tend to specialize on one highly particular domain and sort of drill deep into one thing instead of spreading out their options over many things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.192,
    "end": 1598.556,
    "text": "They are less likely to be distracted by emergent opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.168,
    "end": 1606.071,
    "text": " So what are some of the implications of this hypothesis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.312,
    "end": 1618.88,
    "text": "So like I said, van der Kroijs and colleagues, their 2014 theory about autism should not be seen as being just a theory about autism, but rather as a basis for a theory about individual differences in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.363,
    "end": 1631.789,
    "text": " Because in addition to people who give an inflexibly high weight to sensory input, I've argued here that there are people who also give an inflexibly low weight to sensory prediction errors, and those are people high in positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.91,
    "end": 1637.152,
    "text": "And this, just as a reminder, this should not be thought of in terms of dysfunction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.132,
    "end": 1642.134,
    "text": "It is a continuum of individual differences that we all fall somewhere along, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.154,
    "end": 1647.137,
    "text": "So this is just a continuum that will occur in non-clinical populations as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.243,
    "end": 1652.906,
    "text": " And this paper was an initial attempt to sketch the evidence and implications of this idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.766,
    "end": 1663.632,
    "text": "There is still room for an empirical research program to test and extend this idea, and that's what I'm going to do with the rest of my PhD, most likely, and theoretical work on its implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.013,
    "end": 1670.036,
    "text": "So I am an evolutionary psychologist, so I should talk a little bit about some evolutionary implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.188,
    "end": 1676.531,
    "text": " The autism-schizotypy continuum is a highly heritable source of individual differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.131,
    "end": 1683.736,
    "text": "We know that autism and schizophrenia, for example, have a heritability of about 0.8, so they're very heritable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.017,
    "end": 1687.999,
    "text": "This means that they're going to be highly responsive to selection pressures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.779,
    "end": 1700.507,
    "text": "And if this hypothesis that I put forward here is correct, my contention is that this continuum is very likely equivalent, or at least analogous, to specialist generalist continuums elsewhere in biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.668,
    "end": 1709.77,
    "text": " That is because the precise perceptual style in autism is going to facilitate specializing for highly particular domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.451,
    "end": 1712.251,
    "text": "We do see this with autism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.291,
    "end": 1719.053,
    "text": "They tend to have relatively narrow interests, but that allows them to become very specialized in some particular domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.133,
    "end": 1728.916,
    "text": "The imprecise perceptual style with positive schizotypy is going to facilitate picking up on these more noisy patterns, and noisy patterns tend to be more generalizable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.956,
    "end": 1731.497,
    "text": "They tend to generalize across context a little bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.441,
    "end": 1740.223,
    "text": " So there are models from theoretical biology that have been used to understand how specialist generalist continuums like this can evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.124,
    "end": 1761.769,
    "text": "And basically, if I was going to extract a general principle from these models, what they tend to argue is that if you have periods of relative stability punctuated occasionally by periods of upheaval, so if you have fluctuating selection pressures, this can maintain a heritable continuum of individual differences like this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.589,
    "end": 1791.486,
    "text": " and there is evidence that this was the environment that characterized human beings before the advent of agriculture so before the advent of agriculture there was a lot more fluctuations in the climate things were changing a lot more often so we could see the evolution of a continuum of individual differences or at least the maintenance of a continuum like this one so that is the end and thank you to daniel thank you to the active inference institute for letting me share my work and that is it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.043,
    "end": 1795.503,
    "text": " Thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.603,
    "end": 1799.944,
    "text": "You can unshare and we'll talk a little bit more about this interesting work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.625,
    "end": 1803.965,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.746,
    "end": 1810.707,
    "text": "Well, to those who are watching along live, please feel free to add any questions in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.567,
    "end": 1813.788,
    "text": "And if they're relevant, we'll go with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.848,
    "end": 1816.469,
    "text": "Well, a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.209,
    "end": 1820.13,
    "text": "And I wrote down a bunch of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1823.249,
    "end": 1852.444,
    "text": " enter the maze at just one point here we have two axes about the extent of the two traits that you're focusing on and the diametric model in my understanding summarizes a manifold and says that there's correlation across these two trait dimensions so i wondered what is that state space are these like the big two or what exactly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.207,
    "end": 1876.732,
    "text": " else might be in this broader space of traits yeah it's a it's a really good question and the thing is you know if we're looking at something like the big five right so this is how we normally think about individual differences we think about them in terms of the big five as psychologists the thing about the big five is that it my argument would be that it doesn't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.168,
    "end": 1878.669,
    "text": " carve nature at its joints, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.689,
    "end": 1881.451,
    "text": "It's this very top-down way of understanding individual differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.232,
    "end": 1885.495,
    "text": "And it doesn't, it's completely neutral about mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.335,
    "end": 1891.92,
    "text": "With this, with the autism-schizotypy continuum, we're coming at things from the opposite direction, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.94,
    "end": 1895.182,
    "text": "So it's a bottom-up way of thinking about individual differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.843,
    "end": 1900.447,
    "text": "And at least if this hypothesis is correct, we have a mechanism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.547,
    "end": 1904.45,
    "text": "If this does explain the things I think it explains in it, we have a mechanism to explain it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.87,
    "end": 1905.671,
    "text": "Now, clearly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.884,
    "end": 1918.833,
    "text": " And if it is just precision weighting, given the importance of precision weighting within the predictive processing framework, we would expect this to be a pretty important source of individual differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.314,
    "end": 1926.519,
    "text": "However, there are clearly many other sources of individual differences that are going to interact with this in unpredictable ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.12,
    "end": 1929.361,
    "text": "So for example, you're going to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.922,
    "end": 1946.062,
    "text": " things that are that are mediated for example by blood testosterone levels right there are clearly individual differences uh mediated by testosterone levels i don't think this has much to do with that so how does that interact with this how do you think you know um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.448,
    "end": 1951.172,
    "text": " differences in something like agreeableness, which I don't think has much to do with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.712,
    "end": 1952.773,
    "text": "How do these things interact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.394,
    "end": 1954.535,
    "text": "It's a big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.396,
    "end": 1962.423,
    "text": "My advisor and I are working on a scale to measure this stuff so that we can start unpacking some of those interactions and trying to figure some of that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.843,
    "end": 1966.226,
    "text": "But I would say that we're just at the very beginning of that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.727,
    "end": 1969.489,
    "text": "So to conclude on your question,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.099,
    "end": 1972.88,
    "text": " We don't really know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.34,
    "end": 1986.33,
    "text": "I think that this is a large source of individual differences, but in terms of how much of the variation and something like the big five trait of openness, for example, clearly this has something to do with variation and openness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.73,
    "end": 1987.951,
    "text": "How much does it account for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.971,
    "end": 1991.694,
    "text": "We also know that intelligence accounts for some of that variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.075,
    "end": 1994.176,
    "text": "How much does intelligence account for compared to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.517,
    "end": 1998.28,
    "text": "These are all open questions that we still haven't answered yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.181,
    "end": 2000.441,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.521,
    "end": 2000.842,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.932,
    "end": 2009.777,
    "text": " When I was seeing the side-by-side traits, I was really struck by the mention of cancer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.557,
    "end": 2013.259,
    "text": "And I am not an expert.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2013.78,
    "end": 2026.549,
    "text": "However, these conditions in their clinical forms and potentially in their subclinical variances are associated with other organ systems like digestive system and skin and immunity and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.289,
    "end": 2030.372,
    "text": "So I was just curious about what was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.542,
    "end": 2040.767,
    "text": " the cancer empirical finding and how did this relate to multi-tissue multi-system effects and maybe even embodied cognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.136,
    "end": 2042.656,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.696,
    "end": 2047.999,
    "text": "So it is the case that autism conditions are associated with an increased cancer rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.759,
    "end": 2051.06,
    "text": "With psychosis, the evidence is a little bit more mixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.56,
    "end": 2060.205,
    "text": "So it is, at least at the time that Crespi and Badcock wrote their paper, there was good evidence that schizophrenia is associated with reduced cancer rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.605,
    "end": 2062.266,
    "text": "I've looked at some of the evidence more recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.926,
    "end": 2065.947,
    "text": "With schizophrenia, I think that finding is still solid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.187,
    "end": 2071.19,
    "text": "With bipolar disorder, which is another psychosis spectrum condition, the findings are definitely more mixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.75,
    "end": 2098.113,
    "text": " either way the the fact that schizophrenia is associated with reduced cancer is a very strange finding uh and the reason you know main reason why is just because schizophrenia is pretty much associated with everything negative you can think of i mean the fact that it's it's associated with reduced cancer rates uh is strange just in light of that fact um athena actipus wrote a book about cancer in 2018 i wish i could remember the name of that book but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.275,
    "end": 2116.756,
    "text": " in that book she talked about so she didn't talk about it in terms of autism and psychosis but she talked about it in terms of imprinted genes so i i said that autism is associated with paternally expressed genes and psychosis is associated with maternally expressed genes um so with imprinted genes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.932,
    "end": 2124.336,
    "text": " What happens is that the genes that are that come from your dad, they promote your dad's genetic interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.997,
    "end": 2134.102,
    "text": "Now, the thing about human beings is that we do not have complete paternity certainty, meaning that it's not always you don't always know if you're a man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.162,
    "end": 2136.344,
    "text": "You don't always know that the kids are yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.624,
    "end": 2137.765,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.905,
    "end": 2139.566,
    "text": "As a mother, you know that all the kids are yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.086,
    "end": 2143.267,
    "text": " And you don't always know as a man that you're going to have kids with the same woman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.688,
    "end": 2148.389,
    "text": "So the paternally expressed genes have an interest in promoting growth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.95,
    "end": 2152.231,
    "text": "They have an interest in taking as much of the mother's resources as they can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.752,
    "end": 2154.572,
    "text": "And that is what they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.132,
    "end": 2167.857,
    "text": "And because they promote growth, if they're hyper expressed, they will also end up promoting cancer because cancer is something that results from too much of the hormones that promote growth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.497,
    "end": 2169.358,
    "text": "It can result from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.958,
    "end": 2174.539,
    "text": " On the other side with psychosis, because it's associated with maternally expressed genes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.54,
    "end": 2177.82,
    "text": "So as I said, it's associated with undergrowth in infancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.14,
    "end": 2180.241,
    "text": "It's also associated with reduced suckling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.641,
    "end": 2184.462,
    "text": "So kids who grow up to have schizophrenia, they don't suckle as much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.642,
    "end": 2187.643,
    "text": "They don't take as much of their mother's milk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.223,
    "end": 2191.084,
    "text": "There's evidence that they also just tend to be more calm as children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.404,
    "end": 2195.345,
    "text": "And this is the idea, the theory here is that this is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.934,
    "end": 2219.623,
    "text": " they are promoting their mother's interests right they have more they're expressing their mother's genes more and that promotes their the things that are interest that are in the interest of the mother's genetic interests so that would be reduced growth reduced suckling being an easier baby they take care of and so on uh so that's the that's the the most um i think that's the most prominent explanation for why we see this cancer difference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.272,
    "end": 2222.512,
    "text": " That answers the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.093,
    "end": 2224.253,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.573,
    "end": 2243.019,
    "text": "And staying with that topic of intergenerational imprinting, that part was interesting to me as an insect biologist because parental imprinting is often used to be exploring differences in phenotype across nest mates within a colony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.039,
    "end": 2244.779,
    "text": "So is this a key point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.999,
    "end": 2276.051,
    "text": " domain of imprinting are imprinting effects widespread outside of this uh diametric model and what does this imprinting mechanism tell us about intergenerational epigenetic effects more broadly yeah so in terms of the effect of imprinting so i think that there i i'm confident that imprinting plays a role",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.128,
    "end": 2306.268,
    "text": " in variation in this continuum but how much of a role i think is very much up in the air i don't think that we have a good idea of how many genes are actually imprinted uh the the number of genes that are said to be imprinted is about 200 uh both my advisor and i have expressed our doubts about this we think that it's probably more widespread than that and there are difficulties in picking up on something so you could have partial imprinting for example uh that it would be more difficult to pick up on uh but yeah so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.388,
    "end": 2311.631,
    "text": " In terms of how this... I think it's pretty important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.412,
    "end": 2317.796,
    "text": "Christopher Badcock, who was one of the authors on the first paper, he's written a couple of books about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.096,
    "end": 2319.657,
    "text": "He's made the case that it's very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.798,
    "end": 2321.659,
    "text": "I published a paper...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.509,
    "end": 2342.448,
    "text": " couple years ago showing that people high in positive schizotypy they tend to uh migrate more often or you know what i what we actually showed is that they have more intentions to migrate we've argued that that would lead to more migration but they at least say that they they are more likely to or they they want to move to other locations more now what you see in the animal literature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.607,
    "end": 2349.893,
    "text": " is that dispersal is often a mechanism to reduce competition among family members, essentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.633,
    "end": 2353.035,
    "text": "You don't want to be competing with all of your siblings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.096,
    "end": 2355.698,
    "text": "Maybe that has something to do with it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.938,
    "end": 2358.1,
    "text": "It's a little different with humans because we're so cooperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.72,
    "end": 2363.505,
    "text": "But if we were being consistent with the animal literature, that would be consistent with the animal literature on that kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.515,
    "end": 2371.997,
    "text": " Yeah, there's some very strange findings associated with this, too, I feel like are very controversial, but I'll mention them anyways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.678,
    "end": 2374.998,
    "text": "So there was a book written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.018,
    "end": 2379.92,
    "text": "So there was a paper and I'm putting forward this stuff as very speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.04,
    "end": 2381.781,
    "text": "So I want to be clear about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.781,
    "end": 2385.162,
    "text": "These are speculative things, but there was a paper published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.002,
    "end": 2398.05,
    "text": " written a couple years ago about imprinting, making the case that paternally expressed genes in humans will be associated with more warlike behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.21,
    "end": 2404.774,
    "text": "And this is because humans are thought to, what's the word, be more patrilocal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.315,
    "end": 2413.46,
    "text": "So it is the women who tend to disperse more often, which means that the people who are in your group are more likely to be your male relatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.281,
    "end": 2414.421,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.826,
    "end": 2421.473,
    "text": " make an argument that that will lead to an increased uh group-like behavior in all this now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.836,
    "end": 2428.358,
    "text": " A couple of findings that are associated with that, which are strange at least, and that they might be associated with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.718,
    "end": 2432.519,
    "text": "There was a book published a couple of years ago called The Engineers of Jihad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.159,
    "end": 2450.545,
    "text": "And what they pointed out in that book is that people in engineering and technical professions are massively overrepresented among radical Islamists, and they're massively overrepresented among radical right-wingers, which is a little surprising to me, but the data is very clear on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.434,
    "end": 2465.093,
    "text": " and i can't think of more war-like ideologies than those two you know uh if we're gonna be consistent with that with that theory now again i regard that as speculative but it's it's an interesting finding nonetheless we also see that people in the humanities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.139,
    "end": 2492.855,
    "text": " uh who tend to be higher in positive schizotypy so they are the sort of artsy types they tend to be so people in the humanities are definitely more left-wing than other people and that's associated with ideologies that are sort of against war more often uh so so it's kind of an interesting finding um i would like to explore it more but i i don't know i would say it's definitely speculative but anyways there's a lot of interesting implications of this that again have yet to be explored",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.259,
    "end": 2500.843,
    "text": " One of those experiments where you want a small sample size, pretty rare for biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.863,
    "end": 2506.748,
    "text": "A few more areas I think that would be awesome to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.669,
    "end": 2521.48,
    "text": "So mixing it up a little bit, how does what you're sharing and learning help us think about how to be respectful in our facilitation and communication in neurodiverse settings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.294,
    "end": 2531.798,
    "text": " Yeah, so I think it's important to recognize that there are strengths and weaknesses associated with these sides of the continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.838,
    "end": 2535.12,
    "text": "So I think that we often",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.222,
    "end": 2546.07,
    "text": " We often tend to think that the people who think very differently than us and it's easy to kind of, you know, it's easy to sort of tell if somebody has a very different thinking style than you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.09,
    "end": 2554.036,
    "text": "I think that it's very easy to sort of think that that other thinking style is is less useful in whatever way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.056,
    "end": 2556.799,
    "text": "I think it's important to understand that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.845,
    "end": 2583.608,
    "text": " know really the implication of this is that we're we're all good um and of course there you know there's an iq thing as well that plays into this but we're all we're all going to be relatively better or worse at picking up on different kinds of patterns uh so people on that autistic side they're very good at picking up on these precise patterns right uh that are you know it's associated with engineering computer programming physics and mathematics and the more noisy patterns and the more um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.87,
    "end": 2587.971,
    "text": " not only noisy patterns, but what's the word?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.812,
    "end": 2592.432,
    "text": "Unstructured problems, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.452,
    "end": 2602.655,
    "text": "So unstructured problems that require these sort of, so there is evidence that people high in positive schizotypy are better at solving insight problems, for example, like the nine dot problem, if anybody's familiar with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.136,
    "end": 2605.756,
    "text": "And so that's an important difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.916,
    "end": 2614.399,
    "text": "And yeah, I mean, we're, you know, I think that understanding this can help people to be a little more empathetic towards people who think differently than them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.659,
    "end": 2614.779,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.756,
    "end": 2625.625,
    "text": " And also seeing cognitive diversity amongst the nestmates in the context of the decision that the colony has to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.455,
    "end": 2630.156,
    "text": " can be harnessed, and so that's very useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.196,
    "end": 2645.079,
    "text": "And definitely there's a long supply chain and last mile to respecting people in different specific contexts, but definitely this helps link up a lot of the general themes, like you mentioned, explore, exploit, generalist, specialist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.599,
    "end": 2654.781,
    "text": "These are broader trends in biology and in statistics and machine learning, and then the dance and the art and the science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.441,
    "end": 2678.159,
    "text": " potentially is about bringing to bear these empirically informed and analytically derived in some situations frameworks, and then meeting with the situatedness of someone in their own N equals one trajectory to really like make it work in that one situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.34,
    "end": 2681.441,
    "text": "Yeah, it makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.719,
    "end": 2703.251,
    "text": " okay um there's a a sequence of questions i have on attention but first in the very beginning you mentioned um finding active inference and predictive processing framework and kind of latching onto that and using that to continue building your research direction so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.62,
    "end": 2716.53,
    "text": " What was it from a framework feature perspective that you felt was going to be providing a better explanation or prediction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.051,
    "end": 2732.083,
    "text": "Just how do you sense make amidst all of these decades and decades of Bayesian brain, predictive processing and coding, active inference, all these different threads in cognitive sciences and neuroscience, what makes you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.084,
    "end": 2751.017,
    "text": " go the way that you're going with your phd yeah i mean well you know i think i've read almost every theory of autism that there is you know like in terms of cognitive theories i mean obscure dissertations and all this stuff um the reason i i came to this predictive processing understanding is just because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.353,
    "end": 2759.235,
    "text": " It's the one that explains, so of course I was coming at this from the perspective of the diametric model, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.435,
    "end": 2765.718,
    "text": "And this is the only thing that I found that, that adequately to my mind explains both sides of this continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.618,
    "end": 2774.181,
    "text": "Uh, other theories of autism, you know, maybe they, maybe they work for explaining some features of autism, but I needed something that worked for both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.361,
    "end": 2774.561,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.061,
    "end": 2776.902,
    "text": "And this w this was what worked for both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.962,
    "end": 2778.102,
    "text": "And so when I.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.575,
    "end": 2786.261,
    "text": " When I realized that, and I actually, I sort of had that revelation while I was reading Andy Clark's book, really, Surfing Uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.442,
    "end": 2793.068,
    "text": "When I realized that, I realized that I should learn more about this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.108,
    "end": 2798.353,
    "text": "And so I sort of started consuming literature on predictive processing very obsessively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.373,
    "end": 2798.433,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.529,
    "end": 2809.971,
    "text": " At this point, I think it's, uh, so another project I have, you know, I would like to work on is integrating some of the insights from evolutionary psychology with, with predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.011,
    "end": 2812.012,
    "text": "I think that's an integration that could be really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.752,
    "end": 2815.273,
    "text": "Um, but yeah, that was basically it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.333,
    "end": 2826.215,
    "text": "It's just that this, uh, that explanation, the van decoys and colleagues in their 2014 paper, you know, the explanation they put forward for autism, not only explained autism, but the opposite explained the other side for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.235,
    "end": 2829.436,
    "text": "And so that's kind of why I sort of latched onto this, this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.683,
    "end": 2842.845,
    "text": " And do you think following in that, that there are unique explanations or unique experimental designs that would help us reduce our uncertainty about some of these contending theories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.126,
    "end": 2870.181,
    "text": " yeah yeah i mean for the predictive processing uh theory you know we need more experiments on attention right because this is the most i think this is sort of the most straight well you know straightforward but it's it's the most obvious implication right these are really differences in precision weighting we should be able to precisely uh look at differences in attention along this continuum and it's not always clear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.918,
    "end": 2875.723,
    "text": " I've read quite a bit of the experimental work on autism in relation to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.743,
    "end": 2876.264,
    "text": "There's been a lot of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.765,
    "end": 2880.39,
    "text": "It's not always clear what the predictions actually are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.191,
    "end": 2884.156,
    "text": "Sometimes the predictions are not straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.944,
    "end": 2892.127,
    "text": " This certainly, from a retroactive perspective, I think it explains all of this stuff really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.927,
    "end": 2896.208,
    "text": "In terms of predicting new stuff, it gets more complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.248,
    "end": 2896.709,
    "text": "It just does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.889,
    "end": 2905.033,
    "text": "One of the things that we're going to do for my PhD is we're definitely going to look at the scope of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.914,
    "end": 2913.356,
    "text": " It is the case that people high in the trait of openness to experience, they have a wider scope of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.156,
    "end": 2917.237,
    "text": "And we think this should be associated with positive schizotypy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.757,
    "end": 2921.718,
    "text": "And there's good evidence that people with autism have a narrower scope of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.798,
    "end": 2922.919,
    "text": "It's been called tunnel vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.939,
    "end": 2923.859,
    "text": "They've called it tunnel vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.479,
    "end": 2927.18,
    "text": "We want to demonstrate this in non-clinical populations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.26,
    "end": 2930.381,
    "text": "And using the scale that we're making, we want to demonstrate this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.421,
    "end": 2932.822,
    "text": "And so that's one direction that we're going with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.014,
    "end": 2935.794,
    "text": " Yeah, I'll stop there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.834,
    "end": 2937.135,
    "text": "I think that's all I have to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.075,
    "end": 2938.595,
    "text": "Well, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.615,
    "end": 2942.697,
    "text": "It leads to a few attention-related questions that'll be great to dive into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.777,
    "end": 2953.06,
    "text": "But one reflection there is you described it as being able to retro-addictively connect a lot of dots through the usage of predictive frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.021,
    "end": 2954.401,
    "text": "However...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.646,
    "end": 2967.638,
    "text": " that is like one of those sides in the discussion today, are we looking to, or which side are we looking to err on in that regression example that was provided?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.078,
    "end": 2976.587,
    "text": "Do we want the wavy line where the next batch of 10 points, the wavy line is probably gonna be totally off base because the initial wavy line was overfit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.848,
    "end": 2998.167,
    "text": " or would we be okay with getting directional correctness but very little explanatory power like a high residual per point and the the optimum that science has this distributed system would be kind of navigating and weaving around that path of least action in that space would be the base optimal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.988,
    "end": 3022.179,
    "text": " regression model which is actually what is described by the bayesian information criterion or the aic it's relative and those are statistical criteria that balance exactly that trade-off between a highly parameterized model that explains all the variants and then an under parameterized model too few parameters that explains maybe even a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.879,
    "end": 3030.945,
    "text": " a good chunk of the variation, but then ultimately leaves a lot on the table when there's still like a lot of value to be gained by adding some more parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.005,
    "end": 3034.968,
    "text": "So I was just seeing like that kind of Bayesian information approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.508,
    "end": 3045.895,
    "text": "And then that's like the sweet spot, but everybody moment to moment and year to year and life to life, it's like a swarm weaving in that Valley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.736,
    "end": 3046.936,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.076,
    "end": 3051.759,
    "text": "And that is what constitutes part of our species level neurodiversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.779,
    "end": 3052.42,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.059,
    "end": 3058.0,
    "text": " Well, I mean, it's a good thing we have a lot of scientists working on this problem, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.04,
    "end": 3063.802,
    "text": "So we can, especially with autism, you know, so we can kind of go separate ways and meet in the middle a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.822,
    "end": 3066.263,
    "text": "You know, we can kind of explore different paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.584,
    "end": 3068.204,
    "text": "Yeah, yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.567,
    "end": 3073.628,
    "text": " Let's talk a little bit about attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.549,
    "end": 3081.553,
    "text": "It's definitely a core term in active inference, and it's really one of the tenets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.173,
    "end": 3090.318,
    "text": "Even though in reward-centric paradigms, attention has been used, like in neural networks that have attention,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.838,
    "end": 3105.162,
    "text": " And so it's interesting to see how even in a reward first paradigm, still attentional features are brought in, whereas active inference and predictive processing have a principled and analytically derived approach to attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.362,
    "end": 3114.424,
    "text": "So what is attention and what are the, in a William James fashion, what are the varieties of the attention experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.792,
    "end": 3118.013,
    "text": " Yeah, that's a tough question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.613,
    "end": 3129.019,
    "text": "I mean, I've seen arguments, you know, within, I think, first in first in wrote a paper a couple of years back arguing that there are these two different kinds of attention within within this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.059,
    "end": 3129.159,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.179,
    "end": 3130.239,
    "text": "So there's like salience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.86,
    "end": 3133.641,
    "text": "And then there is I forget what he called the other one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.002,
    "end": 3139.425,
    "text": "But I'm not so sure that these are not really the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.184,
    "end": 3146.462,
    "text": " know what what it is to to pay attention to something my understanding within this framework is to treat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.335,
    "end": 3149.316,
    "text": " you treat the input as if it's highly precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.496,
    "end": 3150.897,
    "text": "You're treating it as if it's highly precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.237,
    "end": 3153.959,
    "text": "In a Bayesian sense, that means that you're treating it as if it's important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.659,
    "end": 3157.001,
    "text": "It means it's having a large effect on updating your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.861,
    "end": 3164.806,
    "text": "And that includes, because this is a hierarchical thing, that also includes stuff that's generated by the internal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.066,
    "end": 3170.249,
    "text": "So you can give a high weight to a prediction that's generated from your internal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.269,
    "end": 3174.732,
    "text": "So you're paying attention to what's going on inside of your own internal model as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.832,
    "end": 3198.806,
    "text": " uh as far as the varieties of attention yeah i mean i i don't think i have a good answer to that uh i don't i don't know probably uh but that's what that's how i would define attention anyways uh with this within this model well it seems like a really interesting direction to see what kind of formalisms and models could underlie those um very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.58,
    "end": 3212.095,
    "text": " Gestalt capturing senses of attention like diffuse and laser and narrow, but those are like spotlight metaphors, but then where's the spotlight in the prediction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.135,
    "end": 3214.558,
    "text": "And so it kind of crosses domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.618,
    "end": 3216.64,
    "text": "And so there's a lot of interesting metaphors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.301,
    "end": 3217.802,
    "text": " things there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.182,
    "end": 3225.953,
    "text": "And yes, what you said about attention being paid or salience in a Bayesian statistical framework is exactly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.133,
    "end": 3233.563,
    "text": "Like if there was a prior about the temperature and no attention was being paid to incoming thermometer readings,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.983,
    "end": 3256.91,
    "text": " then that prior would just play out whether it was a flat or whether it was expected to change from a top-down hierarchical model whereas if a lot of attention were being paid to the thermometer readings in the extreme you would just flip your best prediction to whatever the thermometer said less last and so then thinking back to those regressions that you showed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.387,
    "end": 3268.115,
    "text": " they could be understood in a static sense as being like, what is the relationship between the person's height and how friendly they are to me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.076,
    "end": 3276.337,
    "text": " And then that could be like sort of an all at once static regression about features of the world or like when it's raining, what is the temperature like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.457,
    "end": 3285.059,
    "text": "So just sort of across different instances, regression that helps capture the direction and magnitude and reliability of some causal outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.659,
    "end": 3293.96,
    "text": "But it's also interesting to think about that X axis as time and the Y axis is tracking again, like temperature or some other thing in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.72,
    "end": 3297.201,
    "text": "And there's like the high attention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.121,
    "end": 3303.294,
    "text": " whiplash with the noisy measurements and it's like things are very volatile",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.029,
    "end": 3310.634,
    "text": " but they're being fit well, but it's just feels like things are volatile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.074,
    "end": 3318.5,
    "text": "And then the other extreme would be just that straight regression line where things are simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.361,
    "end": 3320.922,
    "text": "However, there's a lot of variability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.402,
    "end": 3332.971,
    "text": "And that actually also plays into certain Bayesian work on, for example, like narrative and what is called conspiracy theory thinking, simple explanations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.033,
    "end": 3358.372,
    "text": " that's the simple regression line that's narrative and then it's like well then why is it why is this why are these five examples in front of us not the case if that's totally the way things are in the world that a is associated with b but here's five a and it's not associated with b it's like right well there's error to explain there's residual but that doesn't dissuade me from believing that there is this relationship in the world it's true",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.847,
    "end": 3366.854,
    "text": " Yeah, it's interesting, you know, like the conspiratorial thinking is associated with positive schizotyping empirically, which is what you would expect, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.874,
    "end": 3368.436,
    "text": "You know, it's a very simple explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.516,
    "end": 3374.882,
    "text": "It explains a lot, but it's, you know, it's a little bit unmoored from the actual data, something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.341,
    "end": 3389.651,
    "text": " It can tolerate high variance between the prediction and the observation, and that can be accommodated in a framework where more attention is being paid to the narrative prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.131,
    "end": 3393.053,
    "text": "So the posterior is not updating that much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.494,
    "end": 3401.58,
    "text": "Seeing 100 examples of something happening doesn't really update my likelihood on what I think is going to happen next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.402,
    "end": 3404.983,
    "text": "Yeah, with these...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.814,
    "end": 3419.806,
    "text": " It's often the case that with conspiratorial thinking, evidence against the conspiracy is taken as evidence for the conspiracy because it's just evidence that they're really, really good at hiding it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.426,
    "end": 3425.01,
    "text": "No evidence that this is going on is actually evidence of just how good they are at hiding it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.25,
    "end": 3428.994,
    "text": "So you can incorporate almost any data into those kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.114,
    "end": 3430.035,
    "text": "It's an extremely...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.735,
    "end": 3458.914,
    "text": " uh yeah it's an extremely top-down biased way of thinking about the world and i think that's why it's associated with positive schizotypy and it leads to one attention related question which is how do we train our attention or how do we shape our attention to be who we want to be well i i think i have two answers to that question uh the first one is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.139,
    "end": 3463.704,
    "text": " meditation, I think can help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.884,
    "end": 3466.412,
    "text": "But also, you know, I've had",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.277,
    "end": 3470.138,
    "text": " uh, issues with, with my own attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.438,
    "end": 3479.862,
    "text": "And one of the things that made me better at paying attention to things that I may not have wanted to pay attention to, but that I really, but that I really need to is just having clear goals, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.942,
    "end": 3486.945,
    "text": "It like gets your, like, if you have clear written goals, it gets your dopaminergic system on, on your side, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.965,
    "end": 3494.688,
    "text": "So instead of, uh, you know, so you get that little, that little reward every time you do your physics homework or whatever, which you may not want to pay attention to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.708,
    "end": 3497.269,
    "text": "Uh, but if you're getting rewarded for it, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.861,
    "end": 3501.464,
    "text": " you know, you have a clear goal that you're moving towards, it makes it easier to pay attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.445,
    "end": 3512.153,
    "text": "Another thing I would say, so, and I think that's really, it's underappreciated how much our attention is related to our values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.554,
    "end": 3520.901,
    "text": "You know, when we value something, it directs our attention towards relevant, towards things that are relevant to the goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.921,
    "end": 3522.722,
    "text": "And so having clear goals is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.223,
    "end": 3524.244,
    "text": "The other thing I would say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.425,
    "end": 3536.668,
    "text": " is instead of talking about changing or improving our attention is to put yourself into situations that are good for your kind of attention style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.708,
    "end": 3541.89,
    "text": "So I'm somebody who is not on the autistic side of that continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.49,
    "end": 3562.998,
    "text": " uh i would never have been an engineer okay or a physicist or anything like that you know it's not my thing um i had to put myself in a situation where i could use my intellectual ability the intellectual abilities that i have i love these big picture things i love seeing all the dots between all these disparate things you know that's what i that's what i do i had to find a way to put myself in a position where i could use that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.319,
    "end": 3571.944,
    "text": " So some of it is finding a way to get yourself in the right context that allows you to use your own attention style in the right way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.024,
    "end": 3580.291,
    "text": "So it's not all about, you know, partly it's changing yourself, but also partly it's changing the environment that you're in so that you can be who you are to some degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.93,
    "end": 3598.228,
    "text": " And that's definitely echoed in the ways that an active inference entity can reduce its variational or expected free energy, which is it can update its generative model, it can change its mind, or it can engage in action, it can change the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.928,
    "end": 3601.711,
    "text": "And I feel like that dialectic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.532,
    "end": 3622.586,
    "text": " you know yesterday i tried to change the world today i tried to change myself and the way that we wouldn't want our actions to be malappropriated in the world or to be believing something falsely like that there isn't influence of our actions in the world but also it can be extreme and unhelpful when people have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.766,
    "end": 3627.591,
    "text": " far ranging beliefs about their own role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.152,
    "end": 3642.329,
    "text": "And so like social cognition and how that gets mediated with attention and shared attention, thinking through other minds and joint attention, general synchrony, a lot of these active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.624,
    "end": 3658.49,
    "text": " ideas are really in a stage where some of the continents in the map have been laid out and there's a lot of exploration to go, fractal exploration to go, to move from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.967,
    "end": 3680.004,
    "text": " framing different things as like a deficit of reward to a perturbation of precision, which also navigates the balance with pathology, because we can say that Bayes optimal cognition is occurring given the priors and the attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.292,
    "end": 3705.639,
    "text": " if this is the prior and here's how much or this type of attention that's being paid that's not a irrational or an even necessarily an incorrect it might be an outcome that isn't valued highly under some social criterion or another but then again that's that imperative to ask like what could be different in the person's developmental trajectory and their niche which includes their social niece so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.659,
    "end": 3729.222,
    "text": " it is just opening up the discussion around these topics so it's a good time to be starting your PhD in it yeah yeah definitely yeah with the with the psychopathology I mean I really love this you know the the uh this framework for thinking about psychopathology because there is that right like a lot of times what we label as psychopathology is actually you're you're working just the way you're supposed to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.297,
    "end": 3736.023,
    "text": " But I do think that there are times where we get caught in these feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.823,
    "end": 3740.987,
    "text": "Mark Miller has some good papers about this in relation to addiction and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.207,
    "end": 3744.33,
    "text": "We get caught in this, what they refer to as reciprocal narrowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.35,
    "end": 3744.41,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.488,
    "end": 3754.814,
    "text": " It's like we're reducing prediction error in a local aspect, but we're ignoring all of the other areas in which we could be reducing prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.834,
    "end": 3762.819,
    "text": "So if you're addicted to a drug of some kind, if it's a dopaminergic substance, it's going to tell you that you're doing great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.079,
    "end": 3770.564,
    "text": "You're reducing prediction error in an awesome way, but everywhere around you, it's just chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.345,
    "end": 3775.888,
    "text": "So yeah, I think this is a really cool framework for thinking about psychopathology in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.703,
    "end": 3782.186,
    "text": " and bring it into that extended context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.067,
    "end": 3790.472,
    "text": "If one cell were growing at the expense of others, if it were having high fitness, that's the kind of evolutionary lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.313,
    "end": 3806.464,
    "text": "If it were doing, if it were modifying the signaling environment, so it was getting exactly the hormone levels it expected, even if those were potentially within a healthy range, that might have deleterious consequences at the group level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.203,
    "end": 3810.706,
    "text": " fitness or free energy minimization or reward perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.746,
    "end": 3821.635,
    "text": "And so we see kind of this braiding when things are working, then they can be analyzed with fitness, reward, precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.136,
    "end": 3828.221,
    "text": "And when things fail, additionally, we kind of see all of those different framings coalesce again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3828.241,
    "end": 3833.725,
    "text": "And I think the interesting and informative space will be to understand the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.446,
    "end": 3853.137,
    "text": " where those frameworks differ, not just to justify or explore scientific hypotheses, but truly to be in that gray zone and in that situation where it does matter how we act and whether we're justifying our actions with this or that flavor of evolution or reward or precision type thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.898,
    "end": 3854.058,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3855.222,
    "end": 3859.668,
    "text": " Yeah, it's exciting to sort of be at the beginning of this kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.749,
    "end": 3868.801,
    "text": "I mean, I think we're really just getting started in terms of understanding individual differences from a predictive processing perspective and psychopathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.762,
    "end": 3873.544,
    "text": " you know, like we're, we're working on some stuff about psychosis too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.004,
    "end": 3885.832,
    "text": "Um, and you know, how positive schizotypy, uh, sort of the, the sort of next step in this, in this, at least in the theoretical part of this, one of the implications of the hypothesis I talked about in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.398,
    "end": 3896.871,
    "text": " So with autism, and VandeCroix and colleagues talked about this in their 2014 paper, prediction matching should take place at relatively low levels of the processing hierarchy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.891,
    "end": 3901.377,
    "text": "So like the more concrete levels of the processing hierarchy for people with autism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.717,
    "end": 3902.758,
    "text": "And that is sort of what we find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.819,
    "end": 3904.441,
    "text": "It's that very detail-oriented style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.141,
    "end": 3910.787,
    "text": " But with positive schizotype, you should see the opposite of prediction errors traveling farther up the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.428,
    "end": 3919.096,
    "text": "And what we think is happening in psychosis is basically like those prediction errors travel up to those at higher levels of the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.136,
    "end": 3920.798,
    "text": "Like those are the those are the priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.528,
    "end": 3923.55,
    "text": " upon which many other priors depend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.911,
    "end": 3929.856,
    "text": "And so if you disrupt those priors, you lose precision not only on those, but on everything that they're dependent on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.317,
    "end": 3937.704,
    "text": "And if that happens very suddenly, you can get a massive increase in entropy, a massive increase in behavioral and psychological entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.185,
    "end": 3940.107,
    "text": "And you kind of think that's what psychosis is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.789,
    "end": 3946.372,
    "text": " It's not entirely original to that idea, but it just sort of talks about how it develops, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.412,
    "end": 3953.777,
    "text": "Because if we know that people who give a low weight to sensory input are susceptible to it, that tells us why they're susceptible, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.817,
    "end": 3958.319,
    "text": "Because those prediction errors are going to go up to those more high-level priors, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.062,
    "end": 3965.564,
    "text": "Is there anything else you want to add, talk about, ask?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.588,
    "end": 3970.449,
    "text": " I think I'm good, man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.709,
    "end": 3974.851,
    "text": "I really appreciate the opportunity to share my work and have this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.871,
    "end": 3976.552,
    "text": "Really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.613,
    "end": 3977.973,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.394,
    "end": 3981.596,
    "text": "Best of luck with your continued research and education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.616,
    "end": 3982.936,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.976,
    "end": 3983.537,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.117,
    "end": 3984.477,
    "text": "See you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.497,
    "end": 3985.298,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]