[
  {
    "start": 10.797,
    "end": 36.248,
    "text": " all right hello it is april 22nd 2024 we're in active inference guest stream 80.1 with laura desiree de paulo talking about active inference goes to school the importance of active learning in the age of loms we'll have a presentation then some discussion so thank you laura for joining looking forward to this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.46,
    "end": 39.283,
    "text": " Thank you very much for having invited me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 41.306,
    "end": 49.237,
    "text": "OK, so I'm going to present practically one of our latest publications, which is, in fact, the TV in France goes to school.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.84,
    "end": 53.343,
    "text": "Oh, wait, I have to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 53.363,
    "end": 54.625,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.668,
    "end": 84.257,
    "text": " this is an overview of the talk more or less i'll try to go as fast as i can for the first part because i'd like to spend a little bit more time on the later slides and i'm sorry for some misspelling or mistakes that you will find here and there in the in the images because i had the long fights with judge pt for trying to uh um generate images that would regulate better my",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.237,
    "end": 96.819,
    "text": " my talk and at some point after 50 or 60 attempts, I simply gave up and they choose just the best one that I could achieve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.801,
    "end": 101.908,
    "text": "Okay, so I still have to use my mouse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.766,
    "end": 105.729,
    "text": " Just a few things about myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.829,
    "end": 118.92,
    "text": "I've been interested in learning since I started university, maybe because I was considered a slow learner in high school, definitely not a high achiever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.98,
    "end": 131.811,
    "text": "And therefore, when I started to study at university, I started to study learning, different kind of learning, different learning across species and the evolution of learning and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.55,
    "end": 159.688,
    "text": " uh till the point in which i started to be interested in learning in educational settings thinking okay this is the perfect recipe for success because you have all the ingredients that you might have you have super curious beings for whosoever had to deal with children before they go to school knows that they have this insane curiosity and they ask wise about everything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.668,
    "end": 170.843,
    "text": " Theoretically in school you should have tons of learning opportunities and you finally have people that are trained to give the answers that the children seek to have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.612,
    "end": 178.48,
    "text": " Unfortunately, the situation in school is not always so nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.5,
    "end": 191.818,
    "text": "For quoting the principal, a British principal, during an interview, who said, it's incredible that children prefer to be home sick than going to school, the place in which they can learn stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 192.237,
    "end": 193.659,
    "text": " consider the learning is fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.719,
    "end": 196.865,
    "text": "And for what concerns me, I am a researcher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.005,
    "end": 200.531,
    "text": "And as I assume most of us, I love learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.591,
    "end": 202.153,
    "text": "I think learning very, very fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.213,
    "end": 214.313,
    "text": "So I feel part of my job or my duty to bring back the fun into learning, particularly in formal educational settings or in compulsory education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.491,
    "end": 222.24,
    "text": " This is just a slide with some basic literature about active inference and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.26,
    "end": 225.665,
    "text": "I won't be too specific about the inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.705,
    "end": 236.279,
    "text": "There is here a well that eventually could could follow up for some questions more specific about the active inference because it's way more prepared than I am.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.38,
    "end": 243.008,
    "text": "But anyway, this is like I don't know if you have I have to move this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.068,
    "end": 244.89,
    "text": "OK, perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.495,
    "end": 261.377,
    "text": " This is a basic model of active inference, the idea of cognition in active inference for which the agent and the cognitive system of the agent is not waiting for the information to arrive, to fill in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.712,
    "end": 291.229,
    "text": " but instead act proactively, so make predictions about the state of the world in which we expect to live, the information that we expect to perceive into the world, and then every time compare the predictions that are made with the effective information, the effective situation of the world in that particular moment, and when there is a discrepancy, discrepancy in terms of both surprise or events that are unexpected or errors,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.209,
    "end": 301.158,
    "text": " either update the model for making better predictions or change the words and so act onto the word for fitting the original predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.419,
    "end": 317.813,
    "text": "In this model of cognition, learning is a sort of imperative because every time that there is a discrepancy between the prediction and the state of the word is like a red flag that says, okay, here there is something that can be learned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 317.833,
    "end": 321.216,
    "text": "There is something new that can be acquired.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.158,
    "end": 326.633,
    "text": " for making my future prediction, my future error minimization better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.406,
    "end": 340.448,
    "text": " Another interesting aspect of the active inference is that predictions are not just in terms of thoughts, beliefs or knowledge, for instance, but also in terms of sense of motor activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 340.628,
    "end": 353.43,
    "text": "So everything that we perceive, feel, see is considered a prediction about the world and it's considered in itself cognitive, a way to understand the world that surrounds us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.081,
    "end": 371.875,
    "text": " the model of active inference of learning and cognition together is very efficient and is very powerful for explaining for instance different kinds of learning or learning mechanism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 371.855,
    "end": 377.764,
    "text": " using the same very simple, so to say, mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.045,
    "end": 398.436,
    "text": "You can explain, for instance, individual trial and error and the imitation as every time the generative model that optimizes on the environment and on the situation of the environment for acquiring the right information or for making the best predictions possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.888,
    "end": 419.867,
    "text": " um you can also explain our expertise in terms of refined knowledge what is called know what or in terms of skills can very easily come from explorative policies and for curious behavior into the world um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.505,
    "end": 440.843,
    "text": " also importantly focuses on the role of attention that if you think in terms of educational settings educational environment is of course very important again in terms of prediction error dynamics and surprise for the acquisition of competencies and skills",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.443,
    "end": 467.117,
    "text": " And most importantly, at least for me, using the active inference to process that very often are considered complementary but separated, which are development and learning, they can be recombined together because making predictions, particularly in terms of sense of motor activity and sense of motor interaction with the world, means also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.097,
    "end": 474.196,
    "text": " acting on our biology and neurobiological structure for being sure that these predictions are as accurate as they can be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.282,
    "end": 482.659,
    "text": "Okay, when we wrote the paper, we had three main problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.095,
    "end": 500.58,
    "text": " The first problem was how do we apply a theory of cognition such as the active inference in real educational practices and conversely, how these educational practices should look like for fitting our theory of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 500.999,
    "end": 518.569,
    "text": " On these two problems adds up a third problem, which is the use and the spread of artificial intelligences, particularly large language models in education as well as in other fields, and how these might change the rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 519.393,
    "end": 539.41,
    "text": " the problem of application of large language models particularly artificial intelligence or even other form of technologies within educational settings but particularly large language models is given mainly by the fact that they are disembodied",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.795,
    "end": 562.765,
    "text": " when a user has to deal with larger language models, in reality deals with some artefacts, the computer, the screen, the keyboard and so on, that can touch, see and perceive, but at the end of the day deals only with the input-output series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.302,
    "end": 587.368,
    "text": " and the whole process all the other artifacts that are imprinted that are inside the the model itself are completely invisible which makes a problem because normally we are used for instance we can't make behavior reading or understanding intentionality behind the answers of uh of chagipiti",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.462,
    "end": 592.447,
    "text": " Now, I added yesterday morning this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.467,
    "end": 601.64,
    "text": "This is a beautiful paper that came out, I think, two or three days ago about the perception of children about information on Google.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.34,
    "end": 613.255,
    "text": "And it's very interesting because somehow it has the same problem that LLMs have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 613.235,
    "end": 627.49,
    "text": " Children, even very young children, trust the information that Google gives, but they don't have any possibility to understand where this trust comes from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.57,
    "end": 640.744,
    "text": "In the moment in which they have to deal with something like child GPT, in which the answer is given in a sort of natural language, of course, the problem is even deeper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.007,
    "end": 652.361,
    "text": " Therefore, how do we nurture the human generative model in the age of the artificial intelligences?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.903,
    "end": 666.681,
    "text": "These pictures that I have here on my slide, I was looking around for different representations of how integrate artificial intelligences within educational settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.775,
    "end": 694.795,
    "text": " uh and they all are accumulate um they have one thing in common which is they tend to treat the artificial intelligence in in a sort of human way because this is if the artificial intelligences are disembodied and it stays that we are embodied embedded extended and enacted agents so we are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.775,
    "end": 717.12,
    "text": " um active inference agents so our generative model for understanding for dealing with disembodied entity entities as somehow to um to put them in a way that we can understand so our problem would be how do we build an educational environment in which our generative models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 717.522,
    "end": 727.472,
    "text": " can effectively and efficaciously deal with the powerfulness of these new technologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.914,
    "end": 732.857,
    "text": "One way is what I call here the traditional way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.917,
    "end": 739.483,
    "text": "This is the only image that I got from Judge EPT that was perfect at the first attempt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.503,
    "end": 746.77,
    "text": "I asked Judge EPT to give me the image of a classroom with pupils between 8 and 10 years of age.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.256,
    "end": 761.893,
    "text": " The fact that Judge EPT gave me directly this image tells me a lot because Judge EPT is trained on our human knowledge and this is very likely the image that we all have when we think about classroom, about education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.534,
    "end": 774.748,
    "text": "This that I called here traditional educational setting in reality has a specific name which is the teacher-centered approach which I have somehow schematized here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.965,
    "end": 799.774,
    "text": " um and more or less works this way you have all the human knowledge that is far back in the background of the educational setting itself this extensive human knowledge is personalized and organized in curricula that then affect the the child on the other hand you have a teacher that also affects the child",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.754,
    "end": 810.492,
    "text": " and you have this child that somehow acquires this information and grows up having been filled by the information that is provided with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.937,
    "end": 824.715,
    "text": "Somehow, scaringly, this kind of structure is very similar to the kind of training that we do for disembodied entities such as LLMs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.893,
    "end": 837.249,
    "text": " with the additional problem that the fine-tuning in educational settings, in these kind of structures, happens at different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.59,
    "end": 842.096,
    "text": "Not only the child is fine-tuned by the teacher and by the curricula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.017,
    "end": 854.854,
    "text": "Having somehow knowledge that exists, other knowledge outside of the classroom, outside the knowledge that is provided within the educational settings,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.188,
    "end": 865.443,
    "text": " But the fine-tuning works on the teachers themselves, and the teachers themselves, they don't fine-tune every single child, but they usually fine-tune a whole classroom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.844,
    "end": 877.882,
    "text": "Now, for whosoever knows how the fine-tuning, for instance, in LMS works, knows that the more you fine-tune a model, the less creative the model is going to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.325,
    "end": 882.208,
    "text": "Now,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.741,
    "end": 907.048,
    "text": " When we think about this kind of traditional settings and we think that the active inference is the best model of cognition that we currently have, we can't avoid to recognize that it works also in these settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.889,
    "end": 936.833,
    "text": " problem is yes it works but is not really on point in the sense that for instance the very often in this kind of settings we pretend that the attention of the pupils goes specifically to certain uh certain uh featured environment the the the lessons that are provided by the teachers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.813,
    "end": 956.155,
    "text": " While, in fact, we know also that children, particularly in early age, so till around about 12, they tend to pay attention way more and to learn a lot from irrelevant contextual information, which in active inference terms makes a lot of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 956.135,
    "end": 971.697,
    "text": " because it's a generative model that has, till that point in time, very few experiences, so it's gathering information in the environment for making a better prediction on the long term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 973.043,
    "end": 985.844,
    "text": " Another problem with this model, and this is the only concept that is not in the paper that I have added in the slide, is what I called here error learning dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.605,
    "end": 994.258,
    "text": "Another problem with this kind of setting is what we consider the error signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.728,
    "end": 1011.96,
    "text": " We have said before, in the moment in which there is a discrepancy between the prediction that the cognitive system has made and the actual environmental situation, there is an error signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.037,
    "end": 1041.88,
    "text": " if the error signal doesn't come exactly from the mistake but comes for instance from the feedback that might arrive in terms of notes or from being scolded at home because you get a bad grade or you got a note in school then of course the change of the state the change of the situation the acting onto the word and the update",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.147,
    "end": 1053.962,
    "text": " of the generative model and of the prediction doesn't fit with what we want the children to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.651,
    "end": 1062.462,
    "text": " These studies that I have here quoted, some of them are really beautiful studies of Solange Dernevaux.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.203,
    "end": 1073.537,
    "text": "She has observed children in different educational settings and also children and adults, how they react to mistakes and how they",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.517,
    "end": 1093.956,
    "text": " monitor mistakes and discovered that children educated in this kind of traditional or teacher-centered approach educational settings develop more than the ability to learn from mistakes, develop what is called error avoidance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.527,
    "end": 1118.458,
    "text": " which again makes sense it's not that the the the active inference model doesn't work in this way it's only that the error signal doesn't come from the mistakes for instance in the task on the exercise that the child has made but comes from another aspects of their world okay therefore how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.962,
    "end": 1132.549,
    "text": " should the classrooms in which we want effectively to foster an idea of an active inference agent and to nurture an active inference agent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.592,
    "end": 1156.95,
    "text": " um it has to be an educational setting it has to be a classroom that offer um explorative opportunities and offer the time for precision waiting uh what i mean with that it has to be a educational environment in which the um there is the possibility to learn from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.93,
    "end": 1160.315,
    "text": " various aspects of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.355,
    "end": 1180.305,
    "text": "And there has to be the possibility for the child, for the pupil to fine-tune its generative model multiple times on the same task in a way that can really, really, really understand at best how to perform it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.551,
    "end": 1193.626,
    "text": " It has to be an environment in which it is fostered also a multimodal and multisensory way of approaching learning and knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1194.067,
    "end": 1205.922,
    "text": "Because as we said, the predictions are not just in terms of know-what, the information that is provided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.902,
    "end": 1211.29,
    "text": " to the child, but also all the irrelevant stimuli that are around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.43,
    "end": 1215.676,
    "text": "So irrelevant, so they shouldn't be irrelevant, should be instead relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.717,
    "end": 1225.15,
    "text": "And as to foster also individual interests and attention modalities, because at the end of the day, the generative model is always individual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.17,
    "end": 1233.141,
    "text": "It's always the individual that updates its own generative model in its own specific environmental settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.121,
    "end": 1247.923,
    "text": " albeit there are of course some coach forces as Abel would call them, that makes us being able to act and to think in terms of our community, of our culture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.237,
    "end": 1258.536,
    "text": " It has to be an educational environment in which development and learning are considered together and not separated in these traditional educational settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1258.596,
    "end": 1267.313,
    "text": "For instance, we have all the classrooms that very often are divided by age, not about the skills or stage of development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.204,
    "end": 1288.44,
    "text": " It has to be an environment in which the construction of abstraction and categorization has to come through environmental experiences, which again in active inference terms makes a lot of sense, constructing abstract knowledge, constructing abstract categories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.42,
    "end": 1298.218,
    "text": " allows the system to be somehow prepared to how to deal with certain subjects or with certain objects or with certain circumstances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1298.278,
    "end": 1307.796,
    "text": "And then requiring just the fine-tuning of the generative model on the specificity of a particular circumstance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.143,
    "end": 1327.995,
    "text": " And it has to be an environment in which the error learning dynamics are considered in a way that the error signal comes directly from the error and not from other contextual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.456,
    "end": 1354.607,
    "text": " Instead of thinking to invent from the top of our mind a new educational approach, we looked around to search for which educational approach that's already out there that offered the most opportunity to fit with our idea of educational settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.587,
    "end": 1364.363,
    "text": " Amongst various, the Montessori method is the one that, if doesn't fit all the boxes, definitely fits most of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.746,
    "end": 1375.682,
    "text": "For describing a little in the Montessori method, you will always find sort of open spaces and multi-age environment of learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.723,
    "end": 1380.19,
    "text": "Curricula are always found on three to six years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.17,
    "end": 1385.615,
    "text": " and not on just one year as in traditional schools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.197,
    "end": 1393.423,
    "text": "Children are always free to choose what to study for how long with whom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.024,
    "end": 1409.518,
    "text": "It is already implemented within the pedagogy and within the theory also of Maria Montessori, the idea that learning and development are just one process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.038,
    "end": 1415.926,
    "text": " It works through what is called an indirect form of teaching and through the prepared environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1415.966,
    "end": 1435.033,
    "text": "Prepared environment is the classroom, as is called in the Montessori method, which is already organized in a way that can foster some kind of, not only of skills, but also of construction of specific knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.705,
    "end": 1464.48,
    "text": " and pays a lot of attention to the error dynamics through the design of the classroom itself but also for the design of the specific learning material i have some examples in a couple of slides the materials in a way that the material is designed so the material is designed in a way that are popular particularly in the lower",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.068,
    "end": 1482.621,
    "text": " uh stages so in the first grades can immediately perceive when they have made a mistake and can immediately correct them so the error signals arrives directly it doesn't there is no delay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.158,
    "end": 1507.225,
    "text": " And the whole classroom is organized in a way that the uncertainty, so the prediction or minimization is somehow manageable and still organized in progressive difficulties, but every time adding up just one extra variable, one extra element of uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.15,
    "end": 1527.812,
    "text": " Now, it's well known, if anyone wants to know more about the history of Maria Montessori, I can talk about it later, but it's well known that the method was invented by Maria Montessori, an Italian physician, at the beginning of the last century.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.332,
    "end": 1552.585,
    "text": " i have been lately dealing with the most applied of her work particularly in mathematics in geometry and in grammar and i have to admit that she was frankly genial the the the design of her material is is astonishing still today um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.594,
    "end": 1558.38,
    "text": " The Montessori Method is incredibly famous and incredibly well known.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.44,
    "end": 1565.267,
    "text": "There are more than 15,000 Montessori schools in the world, in more than 140 countries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.329,
    "end": 1580.445,
    "text": "In 2011 came out a paper in business psychology, I think it was called the Montessori Mafia, because some of the richest and most well-known entrepreneurs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.425,
    "end": 1586.79,
    "text": " in the world are or were Montessori pupils.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.243,
    "end": 1598.918,
    "text": " But still, it's not so much well known, the theories of development and learning of the Montessori method are not so well known, for instance, in cognitive sciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1599.018,
    "end": 1613.757,
    "text": "So they are very much, I was very surprised the other day looking at how many results one can have putting Montessori and entrepreneur on Google scholars, and not so much in cognitive sciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.137,
    "end": 1630.354,
    "text": " This is not really related to the topic, but is also a good aspect of the Montessori method, which is given the particular attention that gives to the ecological context for learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1630.394,
    "end": 1640.065,
    "text": "It has also a leading position in terms of ecological sustainability within the educational setting and within the curricula.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.045,
    "end": 1651.202,
    "text": " And this is, of course, a topic of major interest that should, in my opinion at least, be part of whatever curricula in whatever school independently of anything else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.744,
    "end": 1658.833,
    "text": "Okay, these are some examples of Montessori schools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1658.993,
    "end": 1664.702,
    "text": "The Montessori schools are more or less all structured in similar ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1668.395,
    "end": 1670.161,
    "text": " Sorry, in similar ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.232,
    "end": 1679.012,
    "text": "First and foremost, there is no distinction between inside and outside the classroom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1679.515,
    "end": 1704.257,
    "text": " uh every space given the physical constraints of the buildings might be corridors might be small or big rooms the doors are always open the children and the pupils are always free to move around there has to be always a free a big free space available for children that prefer to work on the floor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.237,
    "end": 1731.443,
    "text": " and also because some of the materials requires lots of space there is the material for history the history band that's up to five meters long and is designed exactly for the children to understand to have a perceptual understanding of the different um positioning on the on in time of the different characters or events that they are working on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.587,
    "end": 1748.065,
    "text": " The inside and outside, as I said, they are both educational in two sense, not only because there are lots of activities like the observation of nature and part of the curriculum of botanics, biology,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.045,
    "end": 1770.103,
    "text": " and so on that are literally run outside but because the old furnitures and the all everyday items are easily portable outside and very often you might find class the classrooms or the normal daily work happening in in the outside space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1770.083,
    "end": 1784.734,
    "text": " There is one of the image that I have here in black and white, taken from the book of Schneider and Mueller, refers to a Montessori school in Germany in the 30s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.961,
    "end": 1790.927,
    "text": "So it's historically designed in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1791.295,
    "end": 1817.05,
    "text": " Within the Montessori classroom also the construction of abstract categories and of categories in general is supplied by the environment itself through the positioning of the objects, of the materials, the books that refer to specific disciplines of specific subjects that are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.03,
    "end": 1837.519,
    "text": " position it in a way to construct more and more abstract categories for instance you might find one might find the materials for botany and the materials for chemistry and the materials for physics all under the label science",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.005,
    "end": 1861.279,
    "text": " and each one of them will be labelled as well, in a way that children simply interacting with the space, interacting with the material, and simply with the simple activity of taking the material out from the shelf and putting it back, understand more or less how the different subjects are related to one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.259,
    "end": 1885.258,
    "text": " Plus, for instance, through the presence of kitchens that are used for making food, are used for experiments in chemistry, are used for taking care of plants and are used for washing the brushes, allows kids to make connections across different disciplines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.487,
    "end": 1912.275,
    "text": " When I talked before about error learning dynamics and how the error signal should immediately get back to the system for having an effective update of the model or modification of the word in terms of effective learning,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.255,
    "end": 1914.399,
    "text": " This is one example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.419,
    "end": 1926.602,
    "text": "This is actually the first material for mathematics that is in the Montessori method that's usually presented to children between the age of three or four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.92,
    "end": 1944.422,
    "text": " uh in italian they are called the numerical roads in english they are called the red and blue roads and are these long pieces of of wood divided in a section that represent units",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.043,
    "end": 1959.492,
    "text": " divided in different colors, so in alternative colors, blue and red, and they are from 1 to 10, with the 10 that's 1 meter long and the one that's 10 centimeters long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.096,
    "end": 1989.917,
    "text": " um these roads um have the aim to um help the the children to learn the basics of addition addictions and subtractions making perceptual evidence evident how the different quantities are related to one another most importantly they don't have the aim to teach",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1990.623,
    "end": 2015.601,
    "text": " the quantities because children of three or four age they already ask for three bonbons instead of two so they already have an idea of quantities this kind of material is designed exactly for making clear how quantities are related to symbols and how quantities are related to one another",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.661,
    "end": 2032.677,
    "text": " This is the first of a set of three materials for the beginning of the curriculum of mathematics, which, as a matter of fact, has this representational aim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.498,
    "end": 2035.142,
    "text": "The other two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.477,
    "end": 2063.256,
    "text": " instead that are the spindle box and the numerical coin the spindle box has instead like sort of the opposite aim in this case the child has in front of them a box with already some the series of number numbers impressed on the box and with 45 spindles all identical 45 9 plus 8 plus 7 etc",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.236,
    "end": 2087.269,
    "text": " And the work consists in taking the spindles out from the box and putting them back in a way that the number of spindles in each compartment has to be the same that is represented by the symbol itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2088.464,
    "end": 2094.475,
    "text": " As we see here, the series of numbers goes from 0 till 9.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.147,
    "end": 2109.081,
    "text": " In this particular exercise, compared to the other one, we will have just one extra element, which is the child has to understand that in a series of numbers, zero represents no quantities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.642,
    "end": 2124.377,
    "text": "So it somehow reinforces the knowledge that was previously acquired with the other exercises and now adds up with another element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.357,
    "end": 2129.764,
    "text": " The third exercise in mathematics is the numerical coin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.944,
    "end": 2145.623,
    "text": "In this case it works as a sort of test for children of 3-4 years of age in which the children have not only to combine the symbols with the quantities but also to put the symbols in the right order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.885,
    "end": 2152.874,
    "text": " Of course, there is no shame in going back and in doing the different exercise at different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.954,
    "end": 2155.337,
    "text": "And this is this is very important because.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2155.397,
    "end": 2172.201,
    "text": "As we see here, these I'm sorry that I use the Italian, but after having had the very bad experiences with the English translations, I now I tend to use directly the Italian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.181,
    "end": 2186.49,
    "text": " this page refers actually to the different calculations that can be done using this kind of material at different stage of development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.53,
    "end": 2189.616,
    "text": "If a child of three or four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.596,
    "end": 2210.946,
    "text": " might do the basic arithmetics of nine plus one, eight plus two, et cetera, noticing how nine plus one, so combining the road of nine plus the road of one, you have the same measure, the same dimension that the road of 10, so it's equal 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.803,
    "end": 2235.769,
    "text": " a child a little bit older that had already some experience with other forms of calculation for instance multiplications might notice that combining the the roads you might have five roads all with the same the same length the length of the ten roads and you will have left",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2236.222,
    "end": 2262.297,
    "text": " the five roads in this way making a different calculation so calculating the total number the total quantity total number of units in this series which is 10 multiplied 5 plus 5 which at the end gives the possibility",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.58,
    "end": 2281.551,
    "text": " at again a different stage to calculate so gives the basics for calculating the um complete sum the complete quantity of the complete quantity within a series of given numbers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2284.028,
    "end": 2305.193,
    "text": " okay and i swear i am about to finish these are three of the three other elements of the extensive curriculum in mathematics and science it's not the case that the montessori method seems to have the best result in mathematics and science because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.763,
    "end": 2314.255,
    "text": " the curriculum, the materials for mathematics and science, particularly for the first grades, is the most extensive one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.842,
    "end": 2340.175,
    "text": " Now, I'm not describing in detail all this material, just the pearls that are the ones on the left of the screen are used for making a little bit more complex calculations and also for visually teaching the pupils how to calculate cubes and volumes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.42,
    "end": 2366.719,
    "text": " but some times ago i attended to this beautiful talk of anthony trory that is also an implementation in school for the study of computer sciences in in primary education um through a concept that is called the concreteness fading so these are implementation for understanding how to uh help",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2366.699,
    "end": 2380.894,
    "text": " pupils, particularly young children, to construct abstract knowledge, particularly for very abstract competencies such as computer science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.431,
    "end": 2392.671,
    "text": " The concreteness fading approach practically consists always in three moments for which we start from a concrete element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.752,
    "end": 2395.356,
    "text": "In this case, it's the Dead Man's Island.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.496,
    "end": 2398.562,
    "text": "It's a sort of game that the kids have to perform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.015,
    "end": 2414.116,
    "text": " An intermediate phase in which you add to some elements of the concrete phase some elements that will be in the more abstract phase for then finally end up with the abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.919,
    "end": 2421.867,
    "text": "This kind of concreteness fading approach is everywhere in a Montessori classroom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2423.298,
    "end": 2431.547,
    "text": " And it has the advantage that it's not just an implementation, because the implementations are useful and beautiful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.247,
    "end": 2438.674,
    "text": "The problem is that once the implementation is brought away, we have the classroom as it was before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2439.335,
    "end": 2448.765,
    "text": "Instead, in this case, these elements are present in the classroom at all times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.302,
    "end": 2465.168,
    "text": " and this also helps for um somehow solving some problems with this approach to uh for helping children in constructing abstract knowledge which is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.148,
    "end": 2477.223,
    "text": " as always in science, particularly in Literature Education, some people think that the best way to help kids in constructing abstract knowledge is going from concrete to abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2477.564,
    "end": 2494.125,
    "text": "Some people think exactly the opposite, to present first the abstract knowledge and then to allow the kids to make connection between this abstract knowledge to the concrete elements in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.105,
    "end": 2495.527,
    "text": " in everyday world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.73,
    "end": 2509.162,
    "text": "We can assume very easily using again an active inference point of view that both approaches might be right, very much depends on the kids.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.903,
    "end": 2521.176,
    "text": "Having these physical elements all the time into the environment allow different kids with different generative models to construct their own",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.46,
    "end": 2545.24,
    "text": " um their own knowledge in their own way some kids might find easy to go from concrete to abstract some kids might find easy to go from abstract to concrete some kids might find easy to go from intermediate to absolutely concrete but anyway they will always be surrounded by the same objects for extensive periods of time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.013,
    "end": 2560.883,
    "text": " and this allows also to refine and to maybe going from one to the other approach at different stages of development um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.622,
    "end": 2568.252,
    "text": " Now, the Montessori method, of course, is not the only valuable method of education that exists in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.292,
    "end": 2572.379,
    "text": "This is one of the ones that I like the most.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.399,
    "end": 2574.221,
    "text": "It's called the learning by design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.542,
    "end": 2581.032,
    "text": "It has different voices in educational literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2581.012,
    "end": 2594.412,
    "text": " This is just one of them and I particularly like because things to change or to improve educational settings not from the head but from the feet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.432,
    "end": 2608.993,
    "text": "So not through educational pedagogies but really and physically rebuilding the environments in which the children or the pupils learn every day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.463,
    "end": 2621.329,
    "text": " The problem with this and other approaches of this kind is that they are not particularly precise, in my opinion, in looking at the error learning dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.349,
    "end": 2629.446,
    "text": "And if we don't pay attention to what a pupil perceives as an error,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2629.426,
    "end": 2639.782,
    "text": " what gives the error signal to the generative models, of course, the learning is way more difficult and is way more complicated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.102,
    "end": 2654.404,
    "text": "And at the end of the day, when we want to design educational environment, we want anyway to transmit certain kind of cultural competencies and cultural knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2656.73,
    "end": 2665.922,
    "text": " Finally, we also haven't dedicated much at the end, much thought about LLMs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.023,
    "end": 2678.558,
    "text": "The point with LLMs is that it's clear that they are here to stay and is somehow recognised that they will have a huge impact on education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.019,
    "end": 2682.383,
    "text": "The problem is how do we implement them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.363,
    "end": 2696.164,
    "text": " If we implement them in a sort of traditional educational settings, they will do for the pupils what teachers do, which means they will provide knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.464,
    "end": 2708.522,
    "text": "But we know that the knowledge that is provided by LLM is not always accurate, is sometimes messed up, sometimes is mixed up, sometimes is clearly invented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2709.38,
    "end": 2726.765,
    "text": " Therefore, if we want to really use them within educational settings, and we should because they are powerful entities, we should do that with what Casaneci et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2726.825,
    "end": 2738.442,
    "text": "defined a clear educational approach, pedagogical approach, with a strong focus of critical thinking and strategies, something as the Montessori needed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.531,
    "end": 2763.771,
    "text": " Finally, the idea that we have is more or less to combine some elements that are taken from the Montessori method, particularly for what concerns the application in educational settings, because this method already has in focus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.751,
    "end": 2780.899,
    "text": " not only the child but also the teacher and also the curricula which is always somehow regenerated by the interaction between the child and the teacher is a thing maybe I should have mentioned earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.879,
    "end": 2795.557,
    "text": " In the Montessori method, the interaction between teacher and pupils is seen as a form of collaboration, not as a form of giving some kind of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2797.359,
    "end": 2808.473,
    "text": "And also that as in the focus, in the center of the focus, at least a part of the extensive human knowledge that we have created in millennia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.79,
    "end": 2827.238,
    "text": " combined with an approach of learning to learning and to cognition, which is given by the active inference, which is a predictive approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2827.218,
    "end": 2851.808,
    "text": " to the relationship between a cognitive system and its environment which in my opinion at least might be really the game changer in education when we will stop to think about school as a place in which the children are and the pupils are filled up with information but a place in which they will",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.788,
    "end": 2867.167,
    "text": " they will try out what they already know and they will refine their knowledge, this will be really, I think, a game-changer in educational settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.187,
    "end": 2867.888,
    "text": "And that's all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2868.269,
    "end": 2880.664,
    "text": "Let me just thank Avel, Vergenin, Carlut, Ben White, Axel Constant, Andy Clark, of course, that are part of my team at the University of Sussex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.644,
    "end": 2908.625,
    "text": " the CHAT Lab, the Children and Technology Lab at the University of Sussex with the wonderful Nicola Yule and the Xscape Material Minds ERC grant that pays my salary and allows me to work on different aspects of materiality for which I can work from educational aesthetics to making activities in early Homo and this is really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.487,
    "end": 2910.448,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.377,
    "end": 2915.098,
    "text": " Thank you, Laura.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.679,
    "end": 2916.34,
    "text": "Awesome talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.964,
    "end": 2919.345,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.166,
    "end": 2920.527,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.869,
    "end": 2924.714,
    "text": "I can stop sharing the screen here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.395,
    "end": 2925.796,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.019,
    "end": 2928.38,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.982,
    "end": 2940.84,
    "text": "To kick things off, Avel, if you want to give any first reflections and questions, and then meanwhile, if people have any questions in live chat, I'll look for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.423,
    "end": 2943.585,
    "text": " Yes, thank you, Danielle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.925,
    "end": 2945.888,
    "text": "So, thank you, Laura, for your talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.509,
    "end": 2949.133,
    "text": "It's clear, it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.153,
    "end": 2952.138,
    "text": "Good thing for having a talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.238,
    "end": 2960.01,
    "text": "Something I wanted to say in addition, in resonance with what you said, is that you were, in my opinion, very correct to point out that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.935,
    "end": 2967.584,
    "text": " An easy way to do things would be to say that active inference tells us that we need to learn in a certain active way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.105,
    "end": 2969.947,
    "text": "That is not what is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.967,
    "end": 2972.631,
    "text": "Active inference is a model of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.771,
    "end": 2975.435,
    "text": "If it's true, cognition is predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.616,
    "end": 2979.4,
    "text": "And whatever we can do will not change that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.021,
    "end": 3006.99,
    "text": " um so acting first does not tell you that montessori is better or that the system is unnatural that is not something that happens but um what you did and what i'd like to dig uh well in the general same intuition but in a different form work way of thinking is that while it does not tell you that one way to learn is better it does tell you that while learning is contextual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.342,
    "end": 3030.143,
    "text": " if you learn to predict things you learn to predict specific things from specific stimuli so the way that you will learn things will educate what type of stimuli you give attention to and what type of meaning uh you give to and uh the like the last",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.747,
    "end": 3058.003,
    "text": " 20-40 hundred years they were characterized by a very very strong cultural selection pressure for institutions that could control people doing things at a very large scale so mostly nation states mostly with war and so they'd have a very strong interest to for people to understand things through the basically what the higher up thinks of it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.27,
    "end": 3067.616,
    "text": " And it happens that the application system trains you to worry not about what it is that you're doing, but what the higher-up thinks you should think about what's doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.04,
    "end": 3071.166,
    "text": "And if we are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.395,
    "end": 3096.9,
    "text": " we are lucky uh possibly we may uh have what's already occurring i guess um well that is more and more centered around uh like problem solving we we we are a city we need to do something with your what should we do and this is an open question and your higher up is not like uh simultaneously a sociologist uh waste treatment manager physicist etc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.336,
    "end": 3102.785,
    "text": " So you'd have to have some kind of active demarche of trying to find out what it is that we should do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.386,
    "end": 3104.929,
    "text": "And the Montessori does that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.009,
    "end": 3109.156,
    "text": "It does teach people to, like, okay, you have a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.957,
    "end": 3112.962,
    "text": "Here is the environment in which the problem is set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.982,
    "end": 3113.383,
    "text": "Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.024,
    "end": 3114.505,
    "text": "Do what you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.186,
    "end": 3121.757,
    "text": "And this trains people that are, I guess, I hope, more efficient in problem solving than people who are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.957,
    "end": 3147.002,
    "text": " basically trying to learn the formula and repeat it and then perform as a repeating formula so i think there is a pretty deep thing to be that and i think you've identified it and i think that there is like it's interesting to think of it in terms of actual inference and there is more way to go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.421,
    "end": 3170.323,
    "text": " uh in understanding what precisely in terms of active inference um sorry in by uh there is more work to do in understanding in terms of inference how precisely montessori or classical school system shapes uh the way that people think and organize can i can i answer yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.54,
    "end": 3195.4,
    "text": " uh i completely agree with you obviously but um and maybe i wasn't precise enough so the point is that as you said if this is the way in which if this is the way in which our cognitive system works it will work in the montessori method in the waldorf schule in in whatever system it will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.573,
    "end": 3221.438,
    "text": " the problem is how much in the moment in which our intent is educative how much we are precise in thinking the environment and the precise context of learning for being sure that the pupils will acquire the specific information that we want them to acquire",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.025,
    "end": 3236.326,
    "text": " which doesn't mean that we want all the kids to think the same, but we want, for instance, to transmit a certain level of basic competencies, basic mathematics, basic literacy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.907,
    "end": 3240.052,
    "text": "From which then they can build up by themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.674,
    "end": 3248.404,
    "text": "For doing that, I called them here because I didn't have a better term, error learning dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.671,
    "end": 3268.3,
    "text": " Because the point is, as I said, when a child goes to a traditional school or whatever, I am personally against grades and notes and all this kind of stuff because there is a bunch of literature that say how bad they are for motivation of the kids.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.701,
    "end": 3273.348,
    "text": "But for me, they have also another side effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3273.368,
    "end": 3276.012,
    "text": "First, they are delayed in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.65,
    "end": 3303.619,
    "text": " which means if we think in a in real active inference there are posteriors that never refer to what they should refer to if i have a bad grade of a test that for a test that they've done last week okay i've received my error signal doesn't come from the test doesn't come from the mistakes that i've made in the test",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.953,
    "end": 3329.961,
    "text": " it comes from the red notes that i received from the teacher what i will try to fix in my environment and how i will try to update my generative model is gonna be oh i want to avoid that this is my prediction error my my attempt on the long run to solve uncertainty right but this doesn't fit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3330.262,
    "end": 3350.987,
    "text": " with the idea that we want the child or the pupils or whatever or even the young adults to learn the content that was in the text in the first place this is the the this is the in my opinion the main big problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3351.524,
    "end": 3373.887,
    "text": " the second problem which somehow the montessori solved but the active inference is better is how we think how we have to design learning because if you think learning as something that is that fills in the brain of the child",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.356,
    "end": 3385.411,
    "text": " Thinking in active inference terms is, in my opinion, even more precise than thinking in terms of construction of knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.512,
    "end": 3389.957,
    "text": "Because the knowledge is already somehow constructed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.017,
    "end": 3393.141,
    "text": "You arrive and you try out the knowledge that you have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.948,
    "end": 3396.854,
    "text": " And then you refine and refine and refine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.295,
    "end": 3413.509,
    "text": "Is this approach that would, I think, could help in design learning environments, learning materials, how we design the books, how we design the interface, how we design the team group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3414.113,
    "end": 3429.962,
    "text": " they have to be designed in this way a child that arrives think about the the base i i try to think in very very practical terms a child that arrives to school is six and that's to learn to read and write and the first thing this is uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.448,
    "end": 3455.848,
    "text": " montessori on this it's like it's it's it's okay because theoretically you teach literacy at very early age so you make the children play around with letters at the age of three or four they literally play around with big letters but theoretically when you go to school and you want to teach children to read and write what do you do the children arrive the first day in class and they start with the a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3457.212,
    "end": 3479.541,
    "text": " tell me how can a cognitive system predict something as such when a child of six knows how many words are connected by the the thing that you want to learn think about how this is complete nonsense in my opinion it's complete nonsense instead if you think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3480.23,
    "end": 3508.448,
    "text": " the other way around what does the child know already the child knows stories the child know characters the child knows structures the child knows context and you think to use these as form of predictions that the child will make and every time you add one single element of uncertainty manageable uncertainty then it's going to be way more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.812,
    "end": 3510.793,
    "text": " way more natural.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3512.336,
    "end": 3518.945,
    "text": "I'm sorry to say, but that is how it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.965,
    "end": 3519.266,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.446,
    "end": 3522.53,
    "text": "I'll read a question next from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.55,
    "end": 3530.722,
    "text": "Glea Maximalist wrote, What is the Montessori perspective on peer learning and social clicks in the classroom?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.243,
    "end": 3534.187,
    "text": "How does this relate to active inference modeling of learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.051,
    "end": 3538.333,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.237,
    "end": 3568.827,
    "text": " um the montessori approach to learning is it's it's a little bit uh complex so um in the montessori approach learning and development they go together and you have the phases of development which in my opinion fits way better with the with the active inference that the the the tier development of piaget or bigoski",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.19,
    "end": 3577.778,
    "text": " They are kind of rough periods of development in which you construct abstract competencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3579.961,
    "end": 3594.477,
    "text": "But if you think in specific terms Montessori think that the first competence that the cognitive system construct is the capacity of absorbing from the word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.385,
    "end": 3598.809,
    "text": " This is the first thing that a child does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.41,
    "end": 3610.743,
    "text": "Montessori describes the newborn as searching into the environment the information that he can get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.685,
    "end": 3618.793,
    "text": "It has very much to do with our approach in active inference terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.178,
    "end": 3633.458,
    "text": " uh of uh of the model of learning um albeit of course is not so precise first for uh um historical reasons",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.315,
    "end": 3636.259,
    "text": " She didn't have the right terminology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.539,
    "end": 3638.463,
    "text": "She didn't have the right knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3639.105,
    "end": 3643.413,
    "text": "She didn't have the right neuroscientific knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.395,
    "end": 3655.598,
    "text": "Many of the things that Montessori said or claimed, they have been proved only in the past 50 years or so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3655.882,
    "end": 3677.822,
    "text": " There is a beautiful book on Montessori neuroscience written by Leonardo Fogassi, one of the guys of the mirror neurons, and for instance about the role of the hand in cognition and imitation, the role of the activities, the role of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.802,
    "end": 3707.235,
    "text": " they are already all of them inside the montessori method and they very much are in line with our approach our active inference approach to learning and cognition um i'd say that they are compatible okay that would be that i should have started with that they are compatible okay um i hope that answers if it doesn't",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3708.008,
    "end": 3729.375,
    "text": " keep going cool yeah well you made a very provocative comparison with how the llms are trained with a corpus and a little bit of fine tuning and then basically the content delivery instructionalist approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.355,
    "end": 3750.992,
    "text": " where there's a corpus there's the textbooks and the material and then with some fine tuning we get to what a corpus regurgitating machine and along with that there's also these kind of implicit cultural learnings not just related to the embodiment and the layout in the classroom but things like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.31,
    "end": 3768.88,
    "text": " I should be predicting what everyone else predicts or the next piece of information on my foraging journey will be provided to me or there is an expertise hierarchy that's inviolable and all these different kinds of higher order",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3768.86,
    "end": 3795.255,
    "text": " properties that that become learnt through the education system and i think avil made a great point which is that active inference is more of the tool that helps us analyze these different cognitive settings and then talk about how they align or not or or how they fulfill our preferences or not um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.235,
    "end": 3815.472,
    "text": " it's just uh it's very interesting to use this new lens to bring together many of the critiques that people have raised about education and I guess how do we move from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.173,
    "end": 3833.038,
    "text": " taking the lens and applying it in a critical fashion to proactively designing new curricula and new experiences for for younger and for older individuals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.812,
    "end": 3845.502,
    "text": " I remember at some point, I don't remember whom, but it was a critic of education, who said there is just one way to reform education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3845.723,
    "end": 3849.065,
    "text": "We have just to cancel schools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3849.606,
    "end": 3851.708,
    "text": "That is the best case scenario.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3851.728,
    "end": 3863.278,
    "text": "I'm not so extreme, but the idea to change, the idea to bring something like the difference within educational settings means",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.512,
    "end": 3891.358,
    "text": " first and foremost not thinking about education in terms of curricula not thinking about education in terms of what a student should know at the end of the year or what teachers should teach in one year but is is thinking about a environment in which you foster options",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3892.486,
    "end": 3922.071,
    "text": " Thinking about in active inference terms means in active inference, a cognitive system does, particularly a newbie cognitive agent, looks around, simply looks around for gathering information because they might be useful for making accurate prediction errors in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.182,
    "end": 3948.733,
    "text": " which how do you translate this into education means offering opportunities means offering as much as it possible for making better prediction errors right means shifting completely the mindset from what a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3949.186,
    "end": 3970.401,
    "text": " person a child a pupil should know to what we can offer what they can know it's clear that is for me it's the mindset that i'd like to shift",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.203,
    "end": 3998.059,
    "text": " yeah that's very important like thinking about the adjacent possible and the perception and the affordances of each individual and that's also how education and accessibility can come together rather than trying to take like a top-down organizational approach or still again a content delivery approach just slower or diluted rather than actually like welcoming people's differences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.225,
    "end": 4025.262,
    "text": " um okay glia maximalist writes what about the social structure of the classroom first question and then okay go for that and then I'll ask the second question no no okay social structure and and do you think that grades are beneficial for older children it reinforces that letter grades are the delayed readout of performance like many aspects of adult life",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.794,
    "end": 4051.958,
    "text": " maybe we should take off the grades also from an adult's life that would be make way easier social structure in in the class in the montessori class and the social structure are very much again natural so you have the kids that forms groups they can always work with whosoever they want so they form sort of natural",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4052.427,
    "end": 4059.174,
    "text": " friendships, so you work more with the people with whom you work better, so to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.195,
    "end": 4078.232,
    "text": "And the social structure, of course, I couldn't go too much into detail about different social learning, but if you think how the information is provided in a Montessori classroom,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4078.668,
    "end": 4106.076,
    "text": " the teacher never teaches so you will never find a teacher that tells you some stuff and you have to repeat this stuff most of the time particularly for basic competencies the teacher shows how to use certain materials or helps you in finding information online things as such",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4106.798,
    "end": 4131.777,
    "text": " this kind of approaches and montessori was incredibly precise and really sometimes when i read her i'm really like i'm astonished it was incredibly precise saying how the teacher should talk with with young children using gestures using certain chest gestures in a way that they could better regulate the the message if i think in terms of social learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4132.364,
    "end": 4160.143,
    "text": " and i think about uh five four years old a six years old and a teacher which is a adult competent individual and i think in terms of social learning what does it do stimulates over imitation which is what is considered the typical the most common of our way to acquire information socially which is also in traditional",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.782,
    "end": 4188.156,
    "text": " schooling setting the one that we never use have you ever tried to copy during a test it's the first the first thing that you're supposed not to do but it's the most natural way in which we transmit cultural information uh for saying about the social structure this kind of different mechanisms that again according to the active inference i see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4188.71,
    "end": 4212.287,
    "text": " I see lots of advantages to use active inferences for learning because it allows to think the different kind of modalities in which we learn, we transmit and we learn information, cultural information among each other as a society, not as separated in essence, but more like a sort of spectrum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.841,
    "end": 4214.242,
    "text": " Okay, I try alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4214.643,
    "end": 4223.051,
    "text": "If I don't succeed, then I will look, I will shift my attention to something else and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.071,
    "end": 4225.513,
    "text": "In a Montessori classroom, this is allowed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4226.254,
    "end": 4228.716,
    "text": "Children then can try out by themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4228.736,
    "end": 4231.558,
    "text": "If it doesn't work, they can work collaboratively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.579,
    "end": 4233.4,
    "text": "Collaboration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.62,
    "end": 4241.768,
    "text": "If I want to talk about not only social structure, but also the social learning mechanisms that are involved, they work collaboratively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4242.102,
    "end": 4271.94,
    "text": " they imitate each other all the time the imitation is not simply um used like in in a traditional high school you imitate the cool kid in the corridor for how he's dressed up you do the same in a montessori classroom just you can work with them and usually is not the child that is dressed the better but the child with whom you work better that is your cool child in a classroom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4272.224,
    "end": 4278.333,
    "text": " This changes a lot the dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4278.553,
    "end": 4280.776,
    "text": "Grades, grades, grades, grades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4281.858,
    "end": 4287.045,
    "text": "There is, right now, there is a big movement against grades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.085,
    "end": 4298.822,
    "text": "I think they've been published at least four books in the past five, six years against grades, the use of grades in education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4301.873,
    "end": 4316.391,
    "text": " But for older kids, the problem with grades is that there is a gap between whatever system we have for children in compulsory school and when we go to university.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4317.332,
    "end": 4319.555,
    "text": "That is the main gap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.575,
    "end": 4328.286,
    "text": "Till the university works with exam and grades and so on and so forth, we will have to keep the grades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.772,
    "end": 4357.108,
    "text": " into the high schools because university allows the access based on some numbers that are given to you the later we put the grades the better and the reason is very simple very young children they don't um they haven't yet developed the ability to understand to make a difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.645,
    "end": 4367.588,
    "text": " what they do and who they are i have a bad note i am a bad person okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4368.614,
    "end": 4373.499,
    "text": " It's very hard for them to make all these levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.559,
    "end": 4391.077,
    "text": "These are all kind of refinement of the generative model that comes when you have multiple experiences for which when you are 17, 18, 19, you start to discover that you might be very bad at doing something, but you might be very good at doing something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.499,
    "end": 4397.524,
    "text": "For younger kids, grades means a sort of identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4398.702,
    "end": 4404.734,
    "text": " That is the reason why I would push them as back as possible, honestly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4405.055,
    "end": 4418.021,
    "text": "And there is also an extensive literature in education looking at how teachers should give grades because they are really, really, really bad for motivations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.602,
    "end": 4419.664,
    "text": "Really, really bad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4419.644,
    "end": 4421.727,
    "text": " I can give you a personal experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.927,
    "end": 4436.224,
    "text": "I was very good in chemistry till at some point I got a bad grade because my teacher discovered that I wasn't doing just my test, but I was doing also the test for two of my classmates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.265,
    "end": 4447.778,
    "text": "Instead of saying, okay, you are very good, you have been so good and so fast that you could finish your own test and making the test for other two classmates,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4448.433,
    "end": 4464.923,
    "text": " she gave me a bad grade and never been in the class of of chemistry ever again uh and i think as me since i'm not special as me many other kids many other students would feel exactly the same",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.805,
    "end": 4473.855,
    "text": " Yeah, another kind of piece with the language models and the synthetic intelligence in the classroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4474.436,
    "end": 4477.701,
    "text": "Yes, they're disembodied and there is that angle that we explored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.362,
    "end": 4483.17,
    "text": "Also, though, it's kind of like there's a new smart kid on the block.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.19,
    "end": 4487.557,
    "text": "There's a new affordance, which is like, what year did this happen in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.597,
    "end": 4492.986,
    "text": "And that went from being something maybe that could be found in a book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.911,
    "end": 4509.087,
    "text": " more actions that have to be taken to walk to the library, open the book, et cetera, to maybe now search for it online, to maybe now it's just gonna be like, clap your hands and say it again, or maybe it's listening the whole time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.127,
    "end": 4510.671,
    "text": "And so,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.887,
    "end": 4533.165,
    "text": " how will the meta on developing personal agency and a feeling of being in the driver's seat in the education be cultivated so people feel like they have tools to access and they have affordances at their disposal rather than feeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.297,
    "end": 4547.492,
    "text": " I don't know how it could or would feel but to be under the burden of much more knowledgeable, much faster agents that are directing the students",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.282,
    "end": 4577.428,
    "text": " teachers i think might also throw up their hands because they're not necessarily going to have recourse for technical questions either and there will be this affordance at hand that will just bring out an essay or increasingly the audio and the visual so how do we have a kind of fusion environment or different zones that help us wisely use that technology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.332,
    "end": 4588.744,
    "text": " I am a sci-fi fan, so I am not scared about anything of this guy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4589.005,
    "end": 4589.565,
    "text": "Bring in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4590.446,
    "end": 4592.189,
    "text": "I can deal with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4592.709,
    "end": 4599.298,
    "text": "Honestly, after having been using for this point one year consistently,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.717,
    "end": 4627.058,
    "text": " large language models while the at the beginning i thought okay this is really a game changer right now i think not so much at the end um the point is our approach the point is how we teach people how to use them and as for every other piece of technology we all will use a different in different way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4627.46,
    "end": 4650.936,
    "text": " in different circumstances if i have to uh to translate i live in germany if i have to translate a piece that i'm writing for sending to i don't know an email to the mother of my daughter of my daughter's friend i can use gpt and i will send the translation as it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4650.916,
    "end": 4654.721,
    "text": " I won't pay too much attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4654.741,
    "end": 4675.891,
    "text": "When I use GHPT for working instead, not only I check thousands of times the information that I have received, because despite it might have faster access to the knowledge, but doesn't have the right knowledge somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4676.552,
    "end": 4679.556,
    "text": "And this is something that you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4680.532,
    "end": 4700.869,
    "text": " feel when it's right and when it's not when you write a piece and you make chochipiti i make chochipiti checking my grammar and my mistakes because i'm not mother tongue when gives me back i always pay attention to put just no more than 10 lines",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.372,
    "end": 4711.808,
    "text": " because otherwise it restructures my sentence, and usually what comes out is nonsense, is changes completely in the meaning, and stuff as such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4712.73,
    "end": 4726.03,
    "text": "So, yes, they are useful, we have to learn how to use them, as we have learned to use... I remember in 2011, yes, it was 2011, came out a paper, I think it's called The Google Effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4726.702,
    "end": 4743.666,
    "text": " And they looked at how much we have, in the opinion of the researchers, we have been losing memory because we started to use Google all the time instead of memorizing things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.706,
    "end": 4747.031,
    "text": "I see things in a different way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4747.091,
    "end": 4749.114,
    "text": "We haven't lost memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4749.154,
    "end": 4755.763,
    "text": "We have learned how to categorize things that we want to remember in a different way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4756.115,
    "end": 4760.387,
    "text": " I don't have to store the information itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.427,
    "end": 4766.323,
    "text": "I have to remember how to retrieve that information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.744,
    "end": 4771.457,
    "text": "And the same will be for GeoGPT and for the large language models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.197,
    "end": 4788.957,
    "text": " Also, some time ago I was using GHGPT and at some point, and this is the moment in which it was clear to me, I asked for some references about some toolmaking stuff for early Homo,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4789.358,
    "end": 4809.139,
    "text": " and it provided me with a book of uh kim's journey of a book of kim's journey and beyond i know kim perfectly i know his work very very very nicely and i looked at this one i said this book doesn't exist",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4809.372,
    "end": 4820.223,
    "text": " I'm 100% sure that this book, I think I looked at the title, I think this is the book that he should write, but this book doesn't exist because at the end of the day, I know better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4822.105,
    "end": 4822.426,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.446,
    "end": 4822.726,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.066,
    "end": 4824.288,
    "text": "Many funny things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.428,
    "end": 4834.258,
    "text": "And knowing where to find the information, whether the internal foraging or external niche modification, it's kind of always been the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.278,
    "end": 4836.18,
    "text": "It's just a little bit modified now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.221,
    "end": 4837.962,
    "text": "Now I'm...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.942,
    "end": 4839.384,
    "text": " Sorry to interrupt you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.444,
    "end": 4845.872,
    "text": "I'm now working on TXM on extended mind and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4846.473,
    "end": 4858.208,
    "text": "And the active inference here has a very nice way to change the game of extra storage of information and so on, which is very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.709,
    "end": 4858.969,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.55,
    "end": 4863.996,
    "text": "I have a friend who says he has the largest collection of seashells in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.457,
    "end": 4866.379,
    "text": "He leaves them on all the beaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.992,
    "end": 4895.016,
    "text": " um well where do you go from here or what would you like to see happen or what would you suggest to people who are excited about pursuing education and active inference uh i don't know because i did i as i said i i tried to to to create with gpt uh i would i would show it to you all the attempt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.384,
    "end": 4919.586,
    "text": " uh to create a image of a classroom in which was applied the theory of cognition of active infants with the montessori method and i had lots of weird results because it's something that apparently nobody has tried yet",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4920.933,
    "end": 4940.876,
    "text": " But what I would suggest is trying to make practical, to think in terms of design, to think in terms of affordances, to think in terms of everyday interactions, to think in terms of buildings, to think in terms of artefacts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4941.476,
    "end": 4944.78,
    "text": "This, I think, is going to be the next step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4946.043,
    "end": 4946.464,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4946.484,
    "end": 4948.107,
    "text": "Yeah, just to read a few comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.168,
    "end": 4950.853,
    "text": "Joanne wrote, it brings the environment into the picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.054,
    "end": 4952.938,
    "text": "We need to examine that more closely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.479,
    "end": 4955.383,
    "text": "Collaboration, not competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.145,
    "end": 4965.705,
    "text": "And then JR wrote, it's like lifting memory from remembering the object to remembering the process in a more complex context as the world evolves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4966.394,
    "end": 4987.542,
    "text": " yes yes the the good aspect i think that the point of putting together something like the montessori method and the active inference is understanding that learning is not about acquiring information but about understanding the information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4987.876,
    "end": 5012.55,
    "text": " how to use the information that is the the game changer or as my daughter says all the time mama today i reinvented mathematics amazing well laura thank you very much for the work it was definitely a topic that people i feel like wanted and want and need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.003,
    "end": 5040.445,
    "text": " to explore how to be active in education and not get swamped in the tools and in all of these efforts and to kind of keep the hope alive for what education can be yes yes if we should put a little bit more uh ecology and sustainability inside then we have the complete picture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.302,
    "end": 5041.785,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.926,
    "end": 5043.415,
    "text": "Well, till next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.797,
    "end": 5044.441,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5045.206,
    "end": 5045.93,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.615,
    "end": 5046.735,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.977,
    "end": 5047.178,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]