[
  {
    "start": 8.677,
    "end": 11.518,
    "text": " Hello and welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.099,
    "end": 18.002,
    "text": "This is Active Inference live stream number 20.0 on April 15th, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.822,
    "end": 21.804,
    "text": "I'm Daniel and I am here with Blue who will say hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.824,
    "end": 23.905,
    "text": "Hi, I'm Blue Knight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 23.985,
    "end": 27.127,
    "text": "I'm an independent research consultant out of New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 28.007,
    "end": 31.449,
    "text": "Thanks for being on Blue and looking forward to this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.639,
    "end": 34.66,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.4,
    "end": 41.463,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.783,
    "end": 44.165,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.865,
    "end": 50.267,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.288,
    "end": 57.151,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.365,
    "end": 70.417,
    "text": " 20.0 is a contextualizing stream for the upcoming discussions that we'll have on April 20th and 27th about this paper, The Emperor's New Markov Blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.858,
    "end": 73.481,
    "text": "And we'll have some of the authors join us as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.541,
    "end": 75.343,
    "text": "So this will be an awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.076,
    "end": 87.607,
    "text": " Here we are in number 20.0 and the goal of this discussion as stated is to set the context for the upcoming discussions that we'll have on number 20 and number 20.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.68,
    "end": 95.424,
    "text": " And that is about the paper, The Emperor's New Markov Blanket by Jelle Brunberg et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.924,
    "end": 96.985,
    "text": "And the link is provided here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.385,
    "end": 106.011,
    "text": "The video is just an introduction and us kind of working through the paper so that we're ready to interact with the authors and really grasp what they're discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.691,
    "end": 109.233,
    "text": "And we'll be going through the usual sections of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.815,
    "end": 115.537,
    "text": "Any just overall thoughts before we sort of lead into it, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.577,
    "end": 118.139,
    "text": "Just what did you like about it or what drew you to the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.577,
    "end": 120.438,
    "text": " I liked this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.518,
    "end": 132.285,
    "text": "I thought it really provided an overarching view of the Markov blanket and its use throughout, like, historical use and also throughout the Fristian context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.866,
    "end": 137.109,
    "text": "So I thought it was really thorough and gave a good treatment to all of those topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.729,
    "end": 138.43,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.45,
    "end": 138.73,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.051,
    "end": 144.293,
    "text": "So the paper is Emperor's New Markov Blankets, and the link's provided here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.253,
    "end": 167.366,
    "text": " the aims of the claims of the paper that's where we're going to start with the aims and the abstract and the roadmap to just see how the authors laid out what they're going to be trying to do so we're going to evaluate their aims and then see whether the claims they make are valid and whether they support their aims that they laid out and they write all be the first one blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.342,
    "end": 169.563,
    "text": " The aim of the paper is twofold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.943,
    "end": 183.549,
    "text": "First, we want to explain how it has been possible for such an innocuous technical concept as a Markov blanket to come to be used in order to settle central debates in the philosophy of biology and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.229,
    "end": 188.153,
    "text": " So that's the main key aim here is how did we get here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.613,
    "end": 199.123,
    "text": "How did we get to debating a statistical technical concept like the Markov blanket and having people talk about consciousness and emotion and multi-scale systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.163,
    "end": 201.426,
    "text": "So how did we get here with the Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.086,
    "end": 204.649,
    "text": "And then Blue, you can go for the second aim and what you thought it meant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.856,
    "end": 220.263,
    "text": " They say, we will trace the development of Markov blankets starting from their standard application in Bayesian networks through the role that they play in variational inference to their use in the literature on active inference, which is what I had said about the paper that I liked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.707,
    "end": 234.933,
    "text": " They say, we will argue that in the course of this transition, a new and largely independent theoretical construct has emerged, one that is more closely aligned with the notions of sensory motor loops and agent environment boundaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.153,
    "end": 236.494,
    "text": "Do you have any thoughts on that, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.834,
    "end": 245.478,
    "text": "It's going to be the core distinction that we're going to hit probably 50 times is that there's two ways to talk about boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.673,
    "end": 249.234,
    "text": " maybe the ones that really are there, and then the ones that we infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.914,
    "end": 251.635,
    "text": "And that's what this paper is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.256,
    "end": 255.156,
    "text": "So here we go to the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.597,
    "end": 261.819,
    "text": "Markov blankets have been used to settle disputes central to philosophy of mind and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.559,
    "end": 269.081,
    "text": "Their development from a technical concept in Bayesian inference to a central concept within the free energy principle is analyzed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.642,
    "end": 272.263,
    "text": "So that's the historical component of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.223,
    "end": 276.746,
    "text": " Then there's the sort of distinguishing part of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.407,
    "end": 282.491,
    "text": "We propose to distinguish between instrumental pearl blankets and realist Friston blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.231,
    "end": 288.175,
    "text": "Pearl blankets are substantiated by the empirical literature, but can do limited philosophical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.876,
    "end": 292.939,
    "text": "Friston blankets can do philosophical work, but require strong theoretical assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.76,
    "end": 296.943,
    "text": " Both are conflated in the current literature on the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.623,
    "end": 305.97,
    "text": "And then their conclusion is, consequently, we propose that distinguishing between an instrumental and a realist research program will help clarify the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.652,
    "end": 308.812,
    "text": "Good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.593,
    "end": 309.753,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.773,
    "end": 318.64,
    "text": "On to the roadmap, which now has a 55 miles per hour speedway on the left side for the rapid run through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.66,
    "end": 319.5,
    "text": "They...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.962,
    "end": 342.258,
    "text": " start with introducing Bayesian inference and really walk through it in a nice way that we're going to walk through as well and go from kind of the simplest form of Bayesian inference to surprisingly nuanced forms that introduce networks like Bayesian networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.638,
    "end": 345.481,
    "text": "And that's where we get to this concept of a pearl blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.602,
    "end": 354.877,
    "text": " And then it's by tracing the history and the citations and the formalisms around the Pearl blanket and the Markov blanket that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.939,
    "end": 380.057,
    "text": " we find out where it intersects with active inference, which is where the authors propose that this Friston blanket concept sort of surreptitiously or without being noticed starts getting deployed in a way that's sort of sometimes one way, sometimes the other way, but it's actually the looseness around the definition that in their opinion gives rise to uncertainty, which is not what we're about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.638,
    "end": 382.519,
    "text": "And, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.726,
    "end": 411.347,
    "text": " in section five they really just provide more examples with walkthroughs and graphs and figures that we're going to walk through today with how is the pearl blanket different than the first and blanket sense of the Markov blanket and then how does that relate to this key distinction at the end between inference with a model versus inference within a model so kind of like generative models versus generative processes that's going to come back and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.95,
    "end": 418.012,
    "text": " It's a great paper, so we hope that you listen to these discussions and also read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.872,
    "end": 419.773,
    "text": "Any thoughts on the roadmap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.053,
    "end": 423.494,
    "text": "Nope, it's going to go fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.914,
    "end": 424.194,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.814,
    "end": 426.095,
    "text": "It's a long paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.115,
    "end": 426.395,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.935,
    "end": 433.538,
    "text": "So the title of the paper is an allusion to the story called The Emperor's New Clothes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.478,
    "end": 438.539,
    "text": "So people can read through the way that it's written here, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.285,
    "end": 443.066,
    "text": " The Emperor's New Clothes is an interesting story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.446,
    "end": 444.746,
    "text": "It's a polysemous story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.786,
    "end": 446.207,
    "text": "There are many meanings of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.767,
    "end": 452.509,
    "text": "So what is The Emperor's New Clothes about blue in general?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.669,
    "end": 454.489,
    "text": "Or what is it doing here in the title?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.529,
    "end": 456.93,
    "text": "And we can definitely ask the authors, but what do you think it's doing here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.947,
    "end": 470.456,
    "text": " So in my understanding of the emperor's new clothes, it's definitely like, without reading the screen, it's a story about an emperor who wants, who goes to like the best, you know, clothes maker in town, pays them all kinds of money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.817,
    "end": 474.259,
    "text": "And the clothes maker proceeds to make them clothes that are invisible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.339,
    "end": 484.527,
    "text": "And then when the emperor, he sees essentially maybe what he wants to see in the clothes, like sees this, you know, and dresses himself in them and then goes parading throughout the town naked because the clothes are invisible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.448,
    "end": 489.75,
    "text": " And then the child says, hey, that guy's naked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.451,
    "end": 490.651,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.151,
    "end": 497.676,
    "text": "And then here's what part I had forgotten was, although startled, the emperor continues the procession walking more proudly than ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.696,
    "end": 503.741,
    "text": "So it's like, it's not like, oh, then he was so embarrassed that he stopped doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.261,
    "end": 510.866,
    "text": "So maybe it's a story we'll keep in mind and we'll ask who are these characters or what did the authors mean by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.159,
    "end": 515.081,
    "text": " but also at this sort of general level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.261,
    "end": 517.162,
    "text": "Why does this paper matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.362,
    "end": 521.465,
    "text": "Why are we talking about it and studying it and discussing the implications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.085,
    "end": 528.269,
    "text": "Because it's good to be clear when we're talking about science or philosophy and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.33,
    "end": 558.069,
    "text": " uh an unfortunate reality of science is that it's easy to slip in metaphysical claims into uh so-called facts of the world or even just measurements of the world and it's not good to slip in ungrounded metaphysical claims and then also this realism instrumentalism distinction is something that has been dealt with basically in every field oh is it the model of language you're talking about or are you really talking about language or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.29,
    "end": 566.252,
    "text": " Those kinds of differences between systems as they are and systems as we model them is something that is a nomadic concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.652,
    "end": 584.117,
    "text": "So to see it appear in active inference is cool, but also it's exciting to be involved with the authors and see how the scientists and the philosophers are actually dealing with this question in a new way at a new time scale because of maybe the way that they're communicating with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.731,
    "end": 593.858,
    "text": " The big questions in the paper, like sort of beyond just what they set out to address would be like, how is physics related to metaphysics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.338,
    "end": 605.087,
    "text": "What can we study about electrons and temperature and mass that would tell us anything about whether a spirit exists or what's really out there beyond Plato's cave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.728,
    "end": 607.969,
    "text": "How is scientific modeling related to reality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.65,
    "end": 611.192,
    "text": "And then a big question for a lot of us,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.353,
    "end": 639.976,
    "text": " and a lot of people outside of our active inference community is like what does the free energy principle and active inference really say about pragmatic concerns and then totally independently what do they say about philosophical concerns and it'd be awesome if they were 10 out of 10 on both but what is the actual reality of what these frameworks tell us about pragmatic concerns and philosophical questions what big questions resonated with you blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.479,
    "end": 649.885,
    "text": " The biggest question really that resonated with me, I think, is are we, you know, using the right tools to study the right things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.346,
    "end": 660.554,
    "text": "So I think that, you know, when we think about active inference and cognition and statistics, like are these all, you know, should these all be represented by a Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.594,
    "end": 663.436,
    "text": "Like is this the right thing to study this with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.556,
    "end": 663.897,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.758,
    "end": 668.941,
    "text": "How unified do we want models and systems to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.286,
    "end": 679.169,
    "text": " On that, this is sort of the last little general signpost before we plunge into the free energy principle and active inference and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.889,
    "end": 692.773,
    "text": "It's just a little distinction on maps and territories because realism and instrumentalism, it sounds really philosophical and there's isms and it sounds like a belief system, but it really boils down to this map territory distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.353,
    "end": 694.434,
    "text": "And so the authors wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.214,
    "end": 708.737,
    "text": " In our view, the free energy principle literature, so whatever it is, even if you've never heard of this idea, it consistently fails to distinguish between the map, a representation of reality, and the territory, reality itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.437,
    "end": 713.357,
    "text": "This slippage becomes most apparent in their treatment of the concept of a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.898,
    "end": 720.779,
    "text": "So if we're ever getting lost in the weeds with Friston and Pearl and instrumentalism and realism, we think like map and territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.559,
    "end": 738.779,
    "text": " And then what's really cool about this topic, especially in the active inference setting, is that two of the papers that are cited in this paper as relevant prior work are Mel Andrews's paper and also Thomas Van Es and Ines Hipolito's paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.46,
    "end": 742.541,
    "text": " And these were on Active Inference 14 and 15.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.901,
    "end": 744.942,
    "text": "And now we're here in number 20.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.463,
    "end": 749.664,
    "text": "So it's kind of like we're going quickly and we're speaking with a lot of the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.285,
    "end": 756.587,
    "text": "And then also on the left is a paper that I co-authored with RJ and another colleague, Mikel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.328,
    "end": 764.871,
    "text": "And we kind of stepped back even further than Active Inference and just asked, what does it mean to map across systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.991,
    "end": 777.815,
    "text": " And we highlighted that sometimes when mapping across systems and using the complexity science approach, people use Bayesian statistics, networks and predictive and counterfactual approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.376,
    "end": 784.518,
    "text": "Those are kind of like three key ideas in making some systems similar to each other or comparing different systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.158,
    "end": 798.916,
    "text": " And those are citations to the active inference literature, because active inference is drawing together a lot of these different domains that might be seen as different, like Bayesian statistics, network science, cybernetics, ecological psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.036,
    "end": 801.038,
    "text": "I mean, there's different words because they're different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.599,
    "end": 803.54,
    "text": " but we're actually coming at it in a new way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.98,
    "end": 813.005,
    "text": "And that is why we're thinking about maps and territories in a new way, because it's not just like cognitive maps, yes or no, or maps in the city, yes or no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.485,
    "end": 816.766,
    "text": "It's a lot of new things coming together, which is why it's good to clarify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.427,
    "end": 827.351,
    "text": "Adding on to that is the Fields and Glaze book paper that we did that mapped the two spaces, right, from one to the other, like the category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 829.215,
    "end": 830.416,
    "text": " Yes, nice, the mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.796,
    "end": 834.24,
    "text": "And then what if the map is the territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.52,
    "end": 836.381,
    "text": "So let's get to FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.223,
    "end": 856.194,
    "text": " So for this breakdown, every time in reading a paper, we get to reintroduce the free energy principle because it's always good to start with sort of a first pass on what it is because this video might be someone's first time hearing about free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.654,
    "end": 860.757,
    "text": "And also it's a good opportunity to see how the authors frame free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.477,
    "end": 865.938,
    "text": " and then use that as a scaffolding for our understanding and our curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.358,
    "end": 877.662,
    "text": "Instead of us trying to get to the best explanation week after week after week, we can develop our understanding week by week but then always be inspired by the way that authors have phrased it in their writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.542,
    "end": 889.029,
    "text": " So on the right side with the colors, I kind of broke down into like almost haiku or just short sentence, a little bit what they were saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.61,
    "end": 894.573,
    "text": "And what it comes down to is that the FEP is a normative mathematical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.613,
    "end": 902.578,
    "text": "So normative, like it says what should happen, like evolution by fitness maximization says that it should be maximizing its fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.039,
    "end": 903.779,
    "text": "That's kind of similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.2,
    "end": 906.961,
    "text": "It's not saying what you should do, but it's saying how systems should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.842,
    "end": 912.429,
    "text": " And it's about systems that are self-organizing and how they fit into their niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.471,
    "end": 918.677,
    "text": "FEP is drawing on physics inspired machine learning approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.878,
    "end": 942.001,
    "text": " and so part of the appeal and the excitement of the free energy principle is that it brings together machine learning and physics and math with also potentially some qualitative dimensions but even without dipping into the qualitative or the aesthetic or the embodied or the inactive at the very least from a control theoretic perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.682,
    "end": 952.13,
    "text": " the free energy principle adds in a lot of features that are absent from other frameworks like network theory alone, Bayesian alone, or predictive systems alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.271,
    "end": 963.339,
    "text": "Combining those types of approaches in a really interchangeable way with system properties like learning, attention, and action planning is very powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.54,
    "end": 972.106,
    "text": "Active inference is a theory that is a corollary to, or it's a compatible implementation of systems that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.373,
    "end": 976.135,
    "text": " broadly construed under the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.896,
    "end": 991.989,
    "text": "And then they kind of close, the authors do, with the recognition of a claim that you'll see in a lot of places that if we could have a theory of everything or a multi-scale system, then it would be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.429,
    "end": 998.014,
    "text": "So that's what motivates people to work on the FEP and why a lot of people are excited about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.916,
    "end": 1001.717,
    "text": "Anything to add on that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.612,
    "end": 1003.812,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.312,
    "end": 1004.852,
    "text": "It would be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.893,
    "end": 1005.673,
    "text": "I'm excited about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.693,
    "end": 1006.993,
    "text": "A unifying theory of everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.033,
    "end": 1007.594,
    "text": "Let's get to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.114,
    "end": 1008.714,
    "text": "Let's get to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.194,
    "end": 1013.016,
    "text": "Now we want to, just like you said with, are we studying the right systems with the right tools?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.396,
    "end": 1014.936,
    "text": "So this is what the FEP is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.096,
    "end": 1021.439,
    "text": "And very intentionally, it appeals to things like control theory and measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.799,
    "end": 1024.48,
    "text": "Let's take it into the deep end with metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.421,
    "end": 1026.241,
    "text": "So the author's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.5,
    "end": 1030.601,
    "text": " The FEP has been applied to metaphysical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.161,
    "end": 1034.522,
    "text": "So these are very different than action planning, learning, attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.822,
    "end": 1039.764,
    "text": "These are gonna be related to questions that are metaphysical, like what are the boundaries of the mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.984,
    "end": 1041.264,
    "text": "And the citations are in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.025,
    "end": 1043.605,
    "text": "What are the boundaries of living systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.765,
    "end": 1046.106,
    "text": "So what's really there ontologically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.866,
    "end": 1049.007,
    "text": " What's the relationship between mind and matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.087,
    "end": 1050.308,
    "text": "Like what is experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.388,
    "end": 1065.534,
    "text": "All these kinds of philosophical questions about qualia and even things like is Gaia real or is there a scientific basis for talking about Gaia or sort of earth level awareness or at what level could awareness exist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.354,
    "end": 1067.155,
    "text": "And more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.975,
    "end": 1081.965,
    "text": " We're probably all curious about a lot of questions, and it's not like we need to a priori classify them into physics or metaphysics, but that shouldn't make us think there's no distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.165,
    "end": 1084.787,
    "text": "The questions that come to our mind, we're curious probably about a lot of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.348,
    "end": 1096.576,
    "text": "So we want to be open to questions as they come in, especially ones that are framed in new ways, and then also be trying to approach them rigorously because as they raise here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.757,
    "end": 1100.437,
    "text": " it's a web of formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.418,
    "end": 1108.381,
    "text": "It's true that it is a web because we're going to walk through it in the order that the authors laid it out, but it is a web of concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.342,
    "end": 1120.588,
    "text": "And so even for those who are experienced in the field, but especially those who are new to the area, or as they call it, a lay person, not only are there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.829,
    "end": 1135.45,
    "text": " distinctions that are unconventional, but their implications are not always obvious, like assumptions or axioms or relationships that have maybe very non-obvious conclusions or implications, especially when combined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.652,
    "end": 1136.893,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.447,
    "end": 1146.83,
    "text": " The two risks here are it might appear to be and actually mathematically unjustified, but at the very least appear to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.51,
    "end": 1152.832,
    "text": "And that might warrant the unintended smuggling in of metaphysical assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.112,
    "end": 1158.074,
    "text": "Like I have information theory, I can calculate it, and here's who's conscious and who's not conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.294,
    "end": 1159.675,
    "text": "I would say that's completely unwarranted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.397,
    "end": 1163.918,
    "text": " Good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.398,
    "end": 1167.581,
    "text": "I mean, that's like the main critique, right, of IIT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.682,
    "end": 1169.003,
    "text": "So I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.203,
    "end": 1170.584,
    "text": "I think that it's a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.745,
    "end": 1175.429,
    "text": "And how can you say who's conscious and who's not when you can't even give consciousness an adequate definition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.509,
    "end": 1176.37,
    "text": "I think, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.831,
    "end": 1179.954,
    "text": "But we're solving unanswerable questions, but that's the joy of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.288,
    "end": 1181.548,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.968,
    "end": 1204.317,
    "text": "Yep, we talked about the consciousness side in some of our other discussions, but suffice to say that there's kind of a distinction between the questions on this slide, which are related to stochastic systems and action in the niche, and then the metaphysics, which are things that you can imagine even robots would debate over, like who is really a robot like us or whatever they ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.358,
    "end": 1208.499,
    "text": "So how does the FEP relate to active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.824,
    "end": 1218.386,
    "text": " They write, active inference is a process theory derived from the application of variational inference to the study of biological and cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.186,
    "end": 1224.607,
    "text": "And we're not gonna read this whole piece, but active inference is a process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.667,
    "end": 1228.908,
    "text": "So it specifies how processes play out, which we're gonna go into a lot of detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.428,
    "end": 1232.329,
    "text": "And it sort of takes something that's initially static",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.189,
    "end": 1243.411,
    "text": " and it figures out how to take a bunch of equations just there on the page and actually link them in a way where it helps us think about how systems work in their flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.971,
    "end": 1256.614,
    "text": "So we take a bunch of equations that relate variables like estimates and action states and sensory states that are all happening at once as analytical equations in the FVP and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.834,
    "end": 1269.166,
    "text": " Active Inference is a compatible architecture like a skeleton or a style of model that implements processes compatible with FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.608,
    "end": 1271.589,
    "text": "What would you say about that, Liv?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.991,
    "end": 1275.732,
    "text": " I think that you summed it up well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.752,
    "end": 1278.755,
    "text": "I mean, the authors, you have a couple of points here that are highlighted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.875,
    "end": 1283.118,
    "text": "So the fundamental imperative of active inference is to minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.538,
    "end": 1285.82,
    "text": "So this is the FEP, the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.84,
    "end": 1292.064,
    "text": "And then the other point is that, you know, this is also the question that I had at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.144,
    "end": 1296.067,
    "text": "Are we using the right tools to study these phenomena, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.187,
    "end": 1301.431,
    "text": "More specifically, we can ask what role the pearl blankets might play in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.885,
    "end": 1318.295,
    "text": " Yep, we're going to be seeing how this technical concept entered the discussion of metaphysical questions and it's almost like active inference as applied to biological creatures is where we see a lot of it coming into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.614,
    "end": 1323.558,
    "text": " And yep, we talk about active inference throughout, so we'll kind of return to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.218,
    "end": 1327.321,
    "text": "So now let's, that's like the modern stuff, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.561,
    "end": 1329.062,
    "text": "FEP and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.623,
    "end": 1338.65,
    "text": "Let's pull back to Bayes and to Bayesian statistics and build up in a new way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.531,
    "end": 1344.116,
    "text": " how we're going to go from simple bays to modern bays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.496,
    "end": 1347.899,
    "text": "So Blue, how would you start us off?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.919,
    "end": 1352.544,
    "text": "Or what do we need to know as we go on this little bays, several slide journey?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.559,
    "end": 1362.342,
    "text": " So like the one sentence or maybe like the short summary that I give about Bayes, like Bayesian statistics versus frequentist statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.722,
    "end": 1371.065,
    "text": "And frequentist statistics, which is like what most people are taught in school, like when you flip a coin, the probability of it coming up heads is half, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.085,
    "end": 1372.065,
    "text": "50% of the time it comes up half.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.945,
    "end": 1377.227,
    "text": "Bayesian statistics accounts for the fact that like the previous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.207,
    "end": 1381.07,
    "text": " 12 flips have all been heads, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.751,
    "end": 1390.359,
    "text": "So what would you, if you have flipped a coin and you know it's a fair coin, if it's come up heads 12 times in a row, the next time you flip it, don't you think it's more likely to come up tails?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.1,
    "end": 1398.588,
    "text": "So the Bayesian accounts for what has happened in the past when it's not accounted for in frequency statistics at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.847,
    "end": 1400.107,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.847,
    "end": 1412.073,
    "text": "And just to go through the notation, because we are going to be kind of going through the notation, as they write, it's a recipe for calculating the posterior probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.473,
    "end": 1418.816,
    "text": "So that's the probability of X given Y. And X is the hidden state of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.696,
    "end": 1422.477,
    "text": "Like, let's just say that the hidden state of the world is the true temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.665,
    "end": 1453.867,
    "text": " it uh it's actually a hypothesis about the world that's why base in bayesian statistics it's like a hypothesis that you're testing and uh the observational data the measurement is y and this is uh posterior to data so like prior and posterior are referring to when new information comes in prior to the new data coming in and then it's updated and then you have a posterior which has been updated by the new data and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.128,
    "end": 1465.708,
    "text": " And very rapid here in this paragraph, they make the move from doing inference, Bayesian inference on a hidden variable, like the temperature of the world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.173,
    "end": 1473.234,
    "text": " into this idea of the model evidence with a normalization that keeps things adding up to one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.654,
    "end": 1485.057,
    "text": "So instead of having like an uncertainty distribution of how the temperature might be in the world, and then taking in new data and updating that, another way might be, I have two hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.217,
    "end": 1488.178,
    "text": "It's colder than 20 or it's warmer than 20.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.218,
    "end": 1494.383,
    "text": " And then I can always be judging relatively which one of those is more accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.883,
    "end": 1503.671,
    "text": "So even if the temperature distribution is like very gnarly, it's possible sometimes to have a simpler thing that you're trying to hypothesize about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.751,
    "end": 1507.835,
    "text": "Like, is it over or under a certain number that helps you guide action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.296,
    "end": 1514.782,
    "text": "And then also when you do this model comparison, you can keep the relative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.076,
    "end": 1524.061,
    "text": " Basically, you can keep models being compared relative to one another, and that can sum to one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.501,
    "end": 1533.648,
    "text": "So you can do probability type estimates on different model classes, even without knowing whether any specific model is likely or unlikely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.137,
    "end": 1552.162,
    "text": " So like in phylogenetics, which is an area that Blue and I have both worked, you could use Bayesian statistics to relatively evaluate what the most likely tree is for species, but that tree's likelihood might be like super low, but that's not what matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.622,
    "end": 1556.124,
    "text": "It's whether it's more likely than other hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.304,
    "end": 1562.525,
    "text": "So that's kind of what they write a little bit about here is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.761,
    "end": 1571.146,
    "text": " when you have types of models that are computationally or analytically intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.847,
    "end": 1574.248,
    "text": "So there's no closed form solution for the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.829,
    "end": 1582.215,
    "text": "Like there's no clean way how you're gonna update your model of the phylogenetic tree given the next new genome that's added in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.635,
    "end": 1585.897,
    "text": "It's just not something smooth like signal processing might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.698,
    "end": 1588.18,
    "text": " So how are you going to deal with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.76,
    "end": 1590.202,
    "text": "And that's the big challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.763,
    "end": 1596.77,
    "text": "So it's kind of this rapid Bayesian acceleration from like you're trying to estimate something about the world that's unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.79,
    "end": 1599.333,
    "text": "OK, well, what's unknown is which model is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.353,
    "end": 1605.94,
    "text": "And then the challenge is we want to update our ongoing estimate of what the best model of the world is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.801,
    "end": 1627.308,
    "text": " but there aren't really update rules for how new data coming in should help us update which model it is like night and day it's clear more light it's likely to be daytime but again think about the phylogenetics or something where as new data comes in it's really hard to know how exactly to update your models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.775,
    "end": 1651.125,
    "text": " So in that, the phylogenetic analysis, if you have new data coming in, literally like you wanna add a new branch to your phylogenetic tree, the computational way that that's calculated is by switching in and out, in and out, in and out each branch to see the likelihood of the least likely or the best evidence for that tree that's existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.145,
    "end": 1653.906,
    "text": "But it literally makes every single tree and then calculates that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.306,
    "end": 1659.249,
    "text": " which is computationally a really intense and time-consuming effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.669,
    "end": 1665.813,
    "text": "So that's why variational Bayes is so neat and swift in comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.373,
    "end": 1667.214,
    "text": "Yep, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.314,
    "end": 1668.734,
    "text": "It's these red and blue on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.235,
    "end": 1670.876,
    "text": "It's like a continuum of approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.656,
    "end": 1695.479,
    "text": " uh before enter variational the continuum being we have some simple cases where we have a closed form solution for exactly how to update the model's evidence as new data comes in and then there's sort of this wild west where you need to use customized schemes and sometimes you have to resort to just extremely costly like almost brute force like swapping or doing the markov chain monte carlo however",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.69,
    "end": 1701.626,
    "text": " maybe there's another way, which is what brings us to variational base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.896,
    "end": 1723.781,
    "text": " And variational Bayes, as the authors write on the bottom, the trick of variational Bayes, and we're going to come back to the KL divergence, but here's the trick upfront, is consists in letting go of trying to minimize the KL divergence in equation three directly, shifting the objective to optimizing a different functional, which bounds the model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.701,
    "end": 1727.362,
    "text": "So what would you say the variational trick is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.423,
    "end": 1730.304,
    "text": " I mean, that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.404,
    "end": 1744.501,
    "text": "So if you bound the model evidence, so you know that the answer can't be outside of these parameters, that's like bounding the model evidence, then you're not calculating or trying to calculate things that are outside of those parameters, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.546,
    "end": 1756.503,
    "text": " Yep, and maybe there's another way to read this equation on three, but the underlined red part D sub KL is the KL divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.823,
    "end": 1759.908,
    "text": "So it's about the divergence between two different distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.729,
    "end": 1764.112,
    "text": " And the double line is like what the two distributions are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.613,
    "end": 1768.396,
    "text": "So that P X given Y, we saw that back here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.836,
    "end": 1770.418,
    "text": "That's what we want to calculate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.778,
    "end": 1777.444,
    "text": "So even though we're kind of accelerated on Bayes, we're still back on equation one doing inference on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.664,
    "end": 1778.204,
    "text": "But it's going to look...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.985,
    "end": 1779.765,
    "text": " more complex now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.486,
    "end": 1790.849,
    "text": "So we're looking for the difference between that thing that we really want to find out, P X given Y, and then the magical Q distribution that we're in control of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.99,
    "end": 1796.771,
    "text": "And then we want the divergence between those two distributions to be zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.551,
    "end": 1799.772,
    "text": "And distance is always positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.212,
    "end": 1801.653,
    "text": "There's no negative distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.353,
    "end": 1806.995,
    "text": "And so we just have to minimize this divergence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.055,
    "end": 1827.323,
    "text": " so that we can get at what we really want and again one part we don't know and it's hard and the other part we're totally in control of so the whole question and trick is going to be can we design a q so that by reducing the kl divergence on q versus p we're getting at what we truly want",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.368,
    "end": 1842.158,
    "text": " So that is kind of what threads the needle between these two approaches, the red being like the elegant and simple and effective, and then the blue being like the extremely messy and simulation-based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.859,
    "end": 1851.365,
    "text": "Variational Bayes is elegant, and also it helps us potentially deal with complex underlying distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.687,
    "end": 1853.907,
    "text": "Cool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.128,
    "end": 1855.328,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1855.849,
    "end": 1856.069,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.56,
    "end": 1869.889,
    "text": " Now, here we return in 5, there's d sub kl between q of what we want to know and p of x given y. So it's the same as it was on the previous equation 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.03,
    "end": 1875.893,
    "text": "And that is going to be given another equivalency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.234,
    "end": 1884.98,
    "text": "And it's restated as the natural log of p of y minus big L of x. So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.283,
    "end": 1890.184,
    "text": " What do you think about L of X blue, or what did you see here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.204,
    "end": 1896.106,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.246,
    "end": 1896.506,
    "text": "No worries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.546,
    "end": 1896.646,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.666,
    "end": 1896.947,
    "text": "Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.507,
    "end": 1898.227,
    "text": "I'm lost in the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.247,
    "end": 1898.507,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.417,
    "end": 1906.919,
    "text": " I was just, like, thinking, oh, you know, there's two lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.959,
    "end": 1907.76,
    "text": "That's an equal sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.8,
    "end": 1910.021,
    "text": "Here's one line as a minus, and here's three lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.762,
    "end": 1912.523,
    "text": "Yeah, I was lost at the three lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.563,
    "end": 1914.884,
    "text": "Like, why is that an equal sign?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.925,
    "end": 1918.387,
    "text": "Like, yeah, I'm confused at that three triple line thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.207,
    "end": 1922.709,
    "text": "I think three lines can mean that it is defined as...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.57,
    "end": 1925.772,
    "text": " like it's strictly defined as, but let's find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.792,
    "end": 1927.753,
    "text": "I don't want to say anything that's incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.194,
    "end": 1929.635,
    "text": "That's what I was thinking of though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.875,
    "end": 1931.577,
    "text": "I'm like, no, no, I'm opting out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.657,
    "end": 1931.957,
    "text": "I pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.357,
    "end": 1944.947,
    "text": "Yeah, but the restatement here is this value that we want to go low, low, low with the divergence between what we can control and what we can't control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.816,
    "end": 1951.42,
    "text": " We're going to restate it in terms of two different pieces, a sort of log.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.681,
    "end": 1954.923,
    "text": "This is just the likelihood model of the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.823,
    "end": 1965.07,
    "text": "So this is just Y. Here PX given Y was like the true X given the Y observation, like the true temperature given a thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.09,
    "end": 1969.373,
    "text": "And here we're just going to have the likelihood of the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.342,
    "end": 1990.893,
    "text": " measurements so this is a lot easier to calculate than x given y because it's not a conditional and then we're going to penalize that by big l of x which is an expectation of q what q thinks is going to be a likely value for x",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.455,
    "end": 1998.319,
    "text": " plus a joint distribution of X and Y of P, not the conditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.18,
    "end": 2007.125,
    "text": "So it's a little past me why reframing it in each of these nuanced ways helps you do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.485,
    "end": 2009.847,
    "text": "But I just think of it like mathematical pinball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.327,
    "end": 2016.171,
    "text": "Like you gotta like bring some wall down so that you can go up another ramp and do something different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.452,
    "end": 2018.073,
    "text": "But let's definitely ask the authors about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.573,
    "end": 2020.914,
    "text": " And the negative is like baffling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.934,
    "end": 2028.535,
    "text": "Like, I think like the point of when you are getting into the logarithm, the logarithmic scale, like, and so that you like eliminate any possibility of a negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.555,
    "end": 2030.216,
    "text": "And then like, they put the negative on the front of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.256,
    "end": 2032.436,
    "text": "I'm like, Hmm, that's a little strange to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.716,
    "end": 2032.896,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.916,
    "end": 2037.497,
    "text": "And then also it's like the, it's like the negative variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.318,
    "end": 2041.999,
    "text": "And so we push on though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.399,
    "end": 2047.9,
    "text": "Um, they are able to, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.184,
    "end": 2071.454,
    "text": " say that basically free energy this is by analogy to the variational free energy they're going to bring this that's where they bring in the f they say basically free energy that you might want to minimize we'll get there in a few equations but the free energy function of x that hidden state of the world like which model is best or what's the real temperature it is the negative of this l",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.708,
    "end": 2082.63,
    "text": " because here, L was defined this way, and it's almost like we don't, we can separate out L from P at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.23,
    "end": 2095.753,
    "text": "So here we had like sort of a hybrid with Qs and Ps, and here there's like a P here, but now when we get L all alone, now we've kind of encapsulated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.616,
    "end": 2100.557,
    "text": " P in a way where it's like all Q-centric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.158,
    "end": 2104.779,
    "text": "I'm not even sure if that's true, so I don't want to go too down the rabbit hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.099,
    "end": 2121.825,
    "text": "But now it's framed in a way where we can do our work on Q, but get to where we want to get on P. And I think that is the rub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.365,
    "end": 2122.585,
    "text": "That's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.573,
    "end": 2140.524,
    "text": " what the question is about is okay it's a approach and i would love to ask somebody with more variational inference especially actually on this uh i think these are the ones where we were like blue and i were just like okay these are we're gonna raise more questions than we uh answer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.479,
    "end": 2160.238,
    "text": " but what does it look like to make the variational version of a model and what do you sit down and do so that you can calculate this or is it all carried out beneath the hood so uh minimizing free energy as defined in this way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.545,
    "end": 2171.45,
    "text": " on the Q, which is the function that we control, the goal is that that will also get us to the right value on P, the function we don't control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.891,
    "end": 2181.496,
    "text": "So I have my internal model of temperature and I wanna be doing inference on that, finding what's the most likely, the most free energy minimized internal model of temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.996,
    "end": 2186.899,
    "text": "And then if that is attuned properly, that should be accurate in terms of the external as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.855,
    "end": 2201.383,
    "text": " So in my limited understanding of making a variational model, I think that these models, instead of using values, they use distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2202.304,
    "end": 2216.993,
    "text": "So that's the key difference, I think, between the variational model construction versus the non-variational variety of Bayesian model, in my limited understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.375,
    "end": 2224.197,
    "text": " Nice point that previously we were like looking at passing like a number through a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.457,
    "end": 2229.418,
    "text": "And then when we're going variational, we're talking about like passing functions through each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.158,
    "end": 2237.4,
    "text": "This one, we're not gonna go into the technical details, but it's about mean field approximations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.553,
    "end": 2255.009,
    "text": " And this is a super interesting topic because a lot of statistical models will assume that there's like a homogenous field or that a gas is well mixed or that all types of a certain interaction are equally likely to happen amongst all gases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.706,
    "end": 2269.76,
    "text": " molecules bouncing around, but because we're interested in applying free energy principle, not just to the burning candle or to a chemical reaction, but to active inference agents, to cybernetic and goal oriented agents,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.951,
    "end": 2273.392,
    "text": " how does the mean field approximation work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.593,
    "end": 2278.495,
    "text": "Like if we want to explain culture, is there a mean field approximation for culture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.515,
    "end": 2286.4,
    "text": "Or how are we going to apply this to the systems where we know we're kind of extending into analogy land?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.827,
    "end": 2311.41,
    "text": " but at the same time maybe reality is really multi-scale so it's not just uh an analogy to say like when Chris field talked about Quantum and communication at our scale not just as bubbling up from electrons and not just as a metaphor but actually as like a third way that it really was based upon those principles at our scale that's what this makes me think about like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.588,
    "end": 2316.592,
    "text": " do we need or will there be mean field approximations at a lower level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.193,
    "end": 2322.218,
    "text": "And then we're just experiencing a sort of non-mean field at our level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.006,
    "end": 2331.528,
    "text": "And, okay, 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.629,
    "end": 2333.81,
    "text": "Anything else to say there, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.35,
    "end": 2350.036,
    "text": " So I think that the mean field approximation, I think it's like, I don't know, it limits the interactions between different variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.296,
    "end": 2355.699,
    "text": "So you're interacting with the density instead of each individual variable interacting with each variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.739,
    "end": 2363.322,
    "text": "So it's like a course graining, like having this mean field approximation, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.72,
    "end": 2371.405,
    "text": " Yep, and we'll return to it when we look at the figures related to Fristen's paper, but yes, it's related to partitioning variables and yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.045,
    "end": 2377.768,
    "text": "Now this part I thought was really interesting and kind of like basic statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.788,
    "end": 2383.632,
    "text": "So maybe it will be familiar to some, but they're seeing it in a new way that the difference between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.884,
    "end": 2386.865,
    "text": " the different relationships that variables can have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.425,
    "end": 2392.447,
    "text": "And we're seeing it here written out with math, but we're actually gonna come back to it with figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.267,
    "end": 2399.29,
    "text": "And so it will potentially be a little bit clearer, but there's a few different situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.11,
    "end": 2406.253,
    "text": "The nicest situation for a statistical inference is when you can cleanly separate inference on the two variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.873,
    "end": 2410.894,
    "text": "So here it's like PX1 and X2, the joint distribution of X1 and X2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.575,
    "end": 2416.66,
    "text": " it could be separated very cleanly because they're independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.961,
    "end": 2419.684,
    "text": "So it's like you flip a coin and you roll a die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.305,
    "end": 2428.015,
    "text": "The way that you get the probability of a head and a four is basically you just multiply that probability of head times probability of getting a four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.19,
    "end": 2430.931,
    "text": " And so that's the clean case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.572,
    "end": 2435.895,
    "text": "And sort of almost by analogy, that's how I understand variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.956,
    "end": 2445.423,
    "text": "The variables cleanly separate so that you can do restricted optimization on subsets of variables in a little bit more principled way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.803,
    "end": 2455.711,
    "text": "But back to the stats, there's often a time where the joint distribution that you care about is conditionally dependent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.411,
    "end": 2460.994,
    "text": " So conditional dependence, conditional independence, two sides of the same coin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.634,
    "end": 2466.176,
    "text": "It's conditionally dependent on a third variable x3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.077,
    "end": 2471.659,
    "text": "And so here we're going to separate x1 and x2 just like we did above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.1,
    "end": 2477.082,
    "text": "But now we have like x1 conditioned on 3 and x2 conditioned on 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.083,
    "end": 2484.407,
    "text": "And there's actually all kinds of situations where we're really interested in these interactor variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.387,
    "end": 2508.969,
    "text": " and so there's there's one reason it might be latent cause estimation like i want to know why is it that some people take this drug and have this side effect and other people don't sometimes you want to know all three factors like how three different nodes of a computer network or a genetic network are related so you actually might be interested in how all three of these nodes are linked",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.031,
    "end": 2517.482,
    "text": " And then other times the mediator might be useful for like a statistical analysis or like an interaction effect in an ANOVA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.903,
    "end": 2523.791,
    "text": "Like, okay, there's an effect of age and there's an effect of height, but is there a height by age interaction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.983,
    "end": 2530.826,
    "text": " So those kinds of questions, they're not, that ANOVA question's not in the Bayesian framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.926,
    "end": 2537.089,
    "text": "That's from the frequentist framework, but it's an example of when you wanna know about interactor variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.13,
    "end": 2550.356,
    "text": "But it turns out that this is gonna facilitate the variational inference because you can like use this hidden variable three to shield or separate X1 from X2 and X2 from X1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.12,
    "end": 2555.021,
    "text": " So that's the move of Pearl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.061,
    "end": 2560.542,
    "text": "And then that's what we're gonna dive into from then on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.582,
    "end": 2567.304,
    "text": "So we went from basically Bayes on states, Bayes on models to variational Bayes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.144,
    "end": 2574.566,
    "text": "Variational Bayes gives us this free energy minimizing way to work the variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.089,
    "end": 2581.111,
    "text": " contingent on a few assumptions that we would love clarification and education on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.052,
    "end": 2590.195,
    "text": "And that's going to help us separate out in a way that's tractable different parts of the world model that we care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.232,
    "end": 2606.662,
    "text": " So an easy way to think about this conditional dependence is if you're like thinking about the probability of Mary and Mo both eating at the Frontier Restaurant in Albuquerque, it's independent of one another, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.702,
    "end": 2609.284,
    "text": "Like Mary and Mo, they eat periodically at the Frontier Restaurant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2609.304,
    "end": 2611.626,
    "text": "This is like an independent probability that they go there, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.222,
    "end": 2614.404,
    "text": " And then they have another friend that they go with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.584,
    "end": 2616.385,
    "text": "So Mary and Mo go with Sally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.405,
    "end": 2628.114,
    "text": "If Sally eats at the Frontier restaurant, then the probability that Mary and Mo will be there together, because they'll all go together, is they'll all be there at the same time if Sally's there, because then they'll all go eat together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.154,
    "end": 2629.695,
    "text": "But they're not independently friends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.735,
    "end": 2630.496,
    "text": "They're only friends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.836,
    "end": 2633.038,
    "text": "They only go as a trio when Sally's involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.898,
    "end": 2634.198,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.519,
    "end": 2637.421,
    "text": "Our variables just hanging out with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.269,
    "end": 2643.787,
    "text": " Let's take it from doing inference on like one variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.904,
    "end": 2670.046,
    "text": " states and the variational and everything to two variables that's with this joint inference and then here we brought in the third variable let's generalize that beyond three because we're not just interested in x1 and x2 in their relationship or how three influences it we want to be actually open to all graphical relationships and that just means everything you can draw as a network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.243,
    "end": 2674.845,
    "text": " with nodes and edges is graphical, or that's a network analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.625,
    "end": 2691.174,
    "text": "So they bring in now the notion of a Bayesian network beta, and it is defined as containing G and P. So G is subdefined with vertices and edges, V and D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.034,
    "end": 2694.376,
    "text": " So G is really like edges and nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.616,
    "end": 2701.84,
    "text": "So G is the network itself, and that's kind of the matrix form, the choose space form that we're familiar with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.461,
    "end": 2711.547,
    "text": "And then P is, as they write, a collection of tables containing dependencies between the variables as a set of matrices with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.367,
    "end": 2724.374,
    "text": " structure but it's kind of like g is the social network like who are the people and what are the edges and then p is describing their relationship in a way and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.007,
    "end": 2732.312,
    "text": " They also, then they write the tables P, the graph G is often represented by an adjacency matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.893,
    "end": 2737.536,
    "text": "So that's a, you know, nodes by nodes, and then the cells are whether they're connected or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.937,
    "end": 2740.739,
    "text": "And that's exactly what we were getting at with the two spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.779,
    "end": 2742.06,
    "text": "So yeah, it is pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.6,
    "end": 2753.969,
    "text": "And then the tables P contain the factorization for the joint probability distribution over the variables characterized for the directed acyclic graph, the DAG.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.79,
    "end": 2772.337,
    "text": " And so there's an equation that we're gonna use to jointly consider like the network nodes and edges G and all the dependencies on the network P. And so you could imagine if there was like, if you had a matrix of a hundred people and these 50 all knew each other, like they had dependencies between each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.897,
    "end": 2774.597,
    "text": "And then these 50 people all knew each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.817,
    "end": 2776.298,
    "text": "They had dependencies between each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.938,
    "end": 2781.0,
    "text": "We would want a method that could decompose that matrix",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.96,
    "end": 2786.934,
    "text": " into a more factorizable, potentially nicer to deal with form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.262,
    "end": 2790.443,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.355,
    "end": 2793.775,
    "text": " So here we visually see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.015,
    "end": 2802.337,
    "text": "And I think that the circles are all meant to be complete, but they look like I was wondering if it was a dashed line or something, but I think it's all, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.577,
    "end": 2820.12,
    "text": "So here we have a bunch of variables, T, W, Y, X, U, and Z. And then the authors very helpfully go through a few of the kinds of relationships that can link motifs of three variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.448,
    "end": 2838.3,
    "text": " And so here's W and Y. And so it's like, notice how W and Y are unconnected, but they both have a dependency towards X. So it's like W and Y are marginally independent, but only conditionally dependent if X is observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.041,
    "end": 2842.924,
    "text": "So if you didn't see X, you wouldn't know that W and Y had a dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.504,
    "end": 2848.528,
    "text": "But then when you do observe X, you can see that, oh, X is actually being influenced by both of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.946,
    "end": 2852.247,
    "text": " That's called the head-to-head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.187,
    "end": 2865.192,
    "text": "W and Z, marginally dependent because you could tell that potentially through a latent interactor variable X, if you had W and Z measured, you could tell that there was an influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.093,
    "end": 2878.838,
    "text": "But you wouldn't know as much about the influence of W on Z unless you knew about X. And then there's X and U, which is kind of like the backwards example of W and Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.912,
    "end": 2883.033,
    "text": " because X and U would be correlated in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.353,
    "end": 2886.915,
    "text": "Like you'd be pulling out Xs and pulling out Us and they'd be correlated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.595,
    "end": 2889.016,
    "text": "So they're marginally dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.736,
    "end": 2906.023,
    "text": "But then if you measured Y, if you observed Y, you would make them conditionally independent because you'd be able to correct for Y. And then as you pulled out corrected Xs and Us, they would be conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.723,
    "end": 2908.464,
    "text": "So the Bayesian graphical form",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.404,
    "end": 2935.541,
    "text": " allows us to go from that p of t w etc etc so think about that there's six variables that could be six times six variables to consider like 36 connections but we can factor it into like the function of z given x because that's the only thing that z is conditioned on x is conditioned on w and y",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.041,
    "end": 2941.09,
    "text": " u is conditioned on y, and then t is a lone variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.43,
    "end": 2945.179,
    "text": "So we've gotten all six variables into a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.621,
    "end": 2969.901,
    "text": " way that is like a lot sparser it only specifies the parts that we actually need to care about in terms of the dependencies that actually exist so that's kind of the base network it's just using network thinking to talk about the really nuanced relationships between sets of variables so this could be like six demographic factors of a person and z could be the health outcome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.885,
    "end": 2977.544,
    "text": " And so then we can use this analysis to do statistical inference, just like we would with any other technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.005,
    "end": 2979.088,
    "text": "Anything to add on it, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.148,
    "end": 2989.157,
    "text": " Just the final formula down at the bottom really specifies, like, it separates out, like, z, z given x, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.337,
    "end": 2995.844,
    "text": "And so, and t is independent of everything, so you can really see, like, the conditional dependencies down here in this final equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.304,
    "end": 3000.088,
    "text": "x given w and y, and then u given y, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.607,
    "end": 3026.343,
    "text": " yeah it's almost like there's the graph representation then there's the adjacency matrix representation and then here's an equation representation so it's like a rosetta stone if you could have a technique that works on matrices and then you wanted to apply it to a network well then you need to connect networks and matrices but then you could definitely apply it there what about the pearl blanket with this cute picture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.08,
    "end": 3028.701,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.721,
    "end": 3037.969,
    "text": "So the Perl blanket is really traditionally is described by the set of nodes that shields a variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.029,
    "end": 3042.592,
    "text": "So in this case, variable A that's in the middle from the other nodes in the network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.652,
    "end": 3050.699,
    "text": "So A can't interact with these nodes that are outside of the Perl blanket, which is the represented by this circular blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.119,
    "end": 3056.043,
    "text": "So A can't interact with these other nodes without going through the nodes that are contained in the circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.352,
    "end": 3065.079,
    "text": " Yep, and if you notice it has like the ones that are to the sides of A, it's because all these kinds of relationships are relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.14,
    "end": 3071.804,
    "text": "So even the one that A, it does not directly connected to A, but it still is included within the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.864,
    "end": 3073.066,
    "text": "That's kind of important to note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.226,
    "end": 3094.735,
    "text": " All right, so now we're gonna get to this figure, and it's kind of clever how I think the authors did it, because they introduced this in figure two, uncolored, and then we're gonna talk through some Fristen simulations, and then active inference in figure six, and then we're gonna return to this in figure seven with a new color scheme that will help really make their point clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.395,
    "end": 3099.917,
    "text": "So here they're taking this simple example, and they're just giving another example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.945,
    "end": 3104.828,
    "text": " And here is their legend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.449,
    "end": 3106.91,
    "text": "The grays are the observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.291,
    "end": 3108.772,
    "text": "So Y is observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.012,
    "end": 3109.633,
    "text": "Y1, Y2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.713,
    "end": 3112.855,
    "text": "We're observing two things about the world, measuring two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.496,
    "end": 3115.197,
    "text": "All the Xs are hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.558,
    "end": 3121.343,
    "text": "The arrows are that Bayes net directed acyclic graph representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.691,
    "end": 3126.135,
    "text": " The dash node is this special node A10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.215,
    "end": 3127.637,
    "text": "That's like our focal node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.618,
    "end": 3133.965,
    "text": "And then the thick nodes are the blankets around X10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.425,
    "end": 3138.57,
    "text": "So here, just like you had A and it was like its neighborhood was the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.171,
    "end": 3141.654,
    "text": "Here, we're gonna have the pearl blanket",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.395,
    "end": 3148.52,
    "text": " as they write, thick lines are used for nodes constituting the pearl blanket for a selected node X10 depicted here with a dash border.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.92,
    "end": 3151.022,
    "text": "So it's kind of like a legal argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.542,
    "end": 3152.503,
    "text": "They're like saying, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.031,
    "end": 3157.272,
    "text": " Would you agree that this is the appropriate use of the pearl blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.792,
    "end": 3166.656,
    "text": "Because if you do think that this is a pearl blanket, you might find yourself in a trap in figure seven when they show you what this actually represents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.136,
    "end": 3168.836,
    "text": "So it's like, okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.017,
    "end": 3170.417,
    "text": "This is what a pearl blanket is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.477,
    "end": 3172.498,
    "text": "There's no real dissension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.518,
    "end": 3175.399,
    "text": "This is where we're at with pearl blanket thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.999,
    "end": 3180.881,
    "text": "And we've just specified some arbitrary network, you know, nothing in mind, just specified it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.506,
    "end": 3191.793,
    "text": " And then they also define in 4.1 a little bit about how Perl blankets play a role in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.914,
    "end": 3198.658,
    "text": "And it's a super fascinating topic that is something we want to return to with the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.379,
    "end": 3201.721,
    "text": "But if you notice that this queue distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.881,
    "end": 3204.923,
    "text": " that was the one that we were in control of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.724,
    "end": 3214.173,
    "text": "And then that minimization, previously we were looking like at f of x. It was free energy minimization on states, hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.674,
    "end": 3220.18,
    "text": "But here we're also including policies, pi, sequences of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.081,
    "end": 3223.323,
    "text": "So now we're doing free energy minimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.575,
    "end": 3242.087,
    "text": " on policy and so that's what allows us to include the action in the loop with active inference so active inference isn't like just a two-stroke engine where we're going to do inference on states and then action selection in a second step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.078,
    "end": 3251.041,
    "text": " It's actually a loop that integrates action and inference into functions in a co-equal way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.861,
    "end": 3254.622,
    "text": "And that's what one of the special pieces of active inference is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.323,
    "end": 3264.746,
    "text": "As they write, something that classical formulations of variational inference in statistics and machine learning do not consider, instead assuming fixed observations or data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.146,
    "end": 3269.568,
    "text": "So you read in the big data set, you do the free energy minimization, and there's your answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.168,
    "end": 3272.809,
    "text": " And then if you get new data, what do these companies do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.229,
    "end": 3276.23,
    "text": "They rerun the optimization with the new data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.891,
    "end": 3281.052,
    "text": "But this is actually like real time in the loop and it's also taking action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.472,
    "end": 3281.653,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.194,
    "end": 3287.875,
    "text": "Any thoughts before on figure three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.895,
    "end": 3290.096,
    "text": "Do you want to intro it or what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.862,
    "end": 3301.147,
    "text": " Yeah, so this figure, I think the papers on the next slide, actually, the figure that came out of the, it came out of this Friston 2013 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.248,
    "end": 3305.39,
    "text": "And there's like a set of figures in this paper that were accepted from that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.09,
    "end": 3316.334,
    "text": " And so this is the it's a primordial soup simulation that was done in the article by Friston and the larger cyan dots represent the location of each particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.774,
    "end": 3324.698,
    "text": "And then there are three smaller blue dots associated with each particle representing the electrochemical state of the particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.498,
    "end": 3329.866,
    "text": " So this is like on on how life came to came to kind of be right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.426,
    "end": 3332.911,
    "text": "So that's the what's going to happen in the simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.991,
    "end": 3333.932,
    "text": "So this is just the first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.493,
    "end": 3338.32,
    "text": "And then we go on into the into the next figures from the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.801,
    "end": 3338.961,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.054,
    "end": 3341.414,
    "text": " So take this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.434,
    "end": 3341.594,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.755,
    "end": 3341.895,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.175,
    "end": 3342.335,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.455,
    "end": 3344.575,
    "text": "So the simulation is just like the cyan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.675,
    "end": 3346.316,
    "text": "It's kind of like the nucleus of an atom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.876,
    "end": 3350.477,
    "text": "And then the blue dots, the little ones are like electrons floating around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.677,
    "end": 3350.917,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.117,
    "end": 3355.259,
    "text": "So just, it's, it's not trying to be a physics simulation, but that's kind of what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.479,
    "end": 3362.501,
    "text": "Figure four here is, and they're electrically charged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.881,
    "end": 3364.501,
    "text": "That's the electrochemical part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.822,
    "end": 3366.462,
    "text": "Here's what they write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.963,
    "end": 3374.069,
    "text": " So let's just say each of these cyan dots had a number, number 1 through 100, like an agent-based model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.809,
    "end": 3377.752,
    "text": "Now we're going to element 1 through 120, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.532,
    "end": 3386.879,
    "text": "You can plot the adjacency matrix A based upon the coupling, that is dependencies, between the different particles at the final simulation T.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.22,
    "end": 3391.121,
    "text": " So you're gonna start this simulation, let it run out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.662,
    "end": 3394.943,
    "text": "And then, okay, this one is very closely coupled to that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.043,
    "end": 3396.644,
    "text": "And this one is closely coupled to that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.704,
    "end": 3400.186,
    "text": "So number one is talking to four and number four is talking to 22.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.946,
    "end": 3407.549,
    "text": "And then you can take that matrix and you can just put a dot where you saw a dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.15,
    "end": 3416.894,
    "text": "So if you saw some sort of behavioral dependency between the two, like an adjacency, you're gonna add a dot and then you're gonna rearrange the rows and the columns",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.052,
    "end": 3426.601,
    "text": " by swapping, which preserves the information, rearrange them so that there's sort of falling out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.801,
    "end": 3430.004,
    "text": "There's actually several, there's a pattern that falls out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.825,
    "end": 3433.848,
    "text": "We see that there's a broad region of interactions over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.549,
    "end": 3435.59,
    "text": "And then in the bottom right,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.522,
    "end": 3439.144,
    "text": " there's like another kind of sub area of interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.664,
    "end": 3445.988,
    "text": "And then on the very bottom right is like a very tight area of interaction where you see a bunch of dots over the 120.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.288,
    "end": 3461.537,
    "text": "So as they write, the adjacency matrix is a representation of the electrochemical interactions between particles because it's drawn because the adjacency is on the simulation, but can be interpreted as an abstract depiction of a Bayesian network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.915,
    "end": 3467.358,
    "text": " And so we're taking the dependencies between these particles as they jostle around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.898,
    "end": 3469.059,
    "text": "And this is what we're trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.179,
    "end": 3475.643,
    "text": "We're trying to almost like factorize it, separate nature at the joints, you know, map in the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.803,
    "end": 3479.626,
    "text": "Okay, there's a border on the map, but is there a border on the territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.007,
    "end": 3483.268,
    "text": "And then plot it as a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.289,
    "end": 3490.773,
    "text": "And then there's some shading that's going to be suggestive of what role those elements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.091,
    "end": 3521.261,
    "text": " nodes are hypothesized to be playing so here's what they did just in a little more formal on slide 30 they used spectral well this is i think what frist in 2013 did yes uh spectral graph theory was used to identify the eight most densely coupled nodes which are defined as the internal states so y8 y dense cup okay right that's the question that's what we're discussing and those are going to be defined as internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.95,
    "end": 3526.254,
    "text": " just to skip to the slide, those are those blue ones right in the middle here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.694,
    "end": 3528.917,
    "text": "So those are those core states back here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.958,
    "end": 3538.447,
    "text": "Given those internal states, the Markov blanket is then found through tracing the parents, children, and co-parents of children in the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.468,
    "end": 3541.09,
    "text": "Sounds like a preschool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.554,
    "end": 3549.398,
    "text": " As an extra interpretive step, and that's part of what this discussion is about, how interpretive is this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.458,
    "end": 3553.281,
    "text": "Like interpretive dance interpretive or like interpreter at the UN?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.822,
    "end": 3559.765,
    "text": "The nodes in this Markov blanket can be further separated into sensory and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.035,
    "end": 3564.118,
    "text": " The sensory states correspond to the parents of the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.698,
    "end": 3573.325,
    "text": "So that's incoming info, not that they birthed the internal states, but the sense states are the ones that have an upstream dependency on the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.226,
    "end": 3578.269,
    "text": "And the active states correspond to the children of the internal states and their co-parents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.709,
    "end": 3586.395,
    "text": "So again, not that the active states are simply birthed by internal states, but that they have downward flowing statistical dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.546,
    "end": 3591.608,
    "text": " States that are not internal states or part of the Markov blanket are then called external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.288,
    "end": 3603.272,
    "text": "So we're using this partitioning where first you identified dense couplings, then traced out parents and co-parents and children, and then everything that's left is external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.612,
    "end": 3606.013,
    "text": "And so you recolor that simulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.633,
    "end": 3608.494,
    "text": " from figure three, here it is uncolored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.095,
    "end": 3622.723,
    "text": "And now we're gonna recolor it with this new color code where we've identified the blue densely coupled nodes, and then the active states, and then the sensory states, which are sort of on a frontier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.883,
    "end": 3642.673,
    "text": " with the uh teal states the cyan the external so it's almost like you have the internal you know let's just imagine it's like the nervous system and then it's swaddled in the active states and then on the outside of the sense of the active states or the sensory states and those interface directly with the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.598,
    "end": 3654.647,
    "text": " So that's kind of the tantalizing nature of this model would be like, wow, if it really just fell out of a simulation that you can get self-organization like that, wouldn't that be cool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.987,
    "end": 3656.388,
    "text": "But what is the issue here, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.49,
    "end": 3660.632,
    "text": "Well, I mean, it's kind of arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.652,
    "end": 3670.32,
    "text": "So they said a third of the electrochemical states from the very beginning of the simulation did not interact, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.36,
    "end": 3672.681,
    "text": "So that establishes this non-equilibrium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.522,
    "end": 3692.722,
    "text": " system, and I think that, you know, the issue then comes from assigning these interactions to internal, external, active, and sensory states that may or may not have some kind of dependence on one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.742,
    "end": 3692.803,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.023,
    "end": 3715.788,
    "text": " As they write here, the simulation assumes that by viewing the system through the formalism of the Markov blanket, plus some additional assumptions about the separation of states, the ones that we kind of walked through just a second ago, you can uncover hidden properties of the target system, which is then said to quote, instantiate or possess a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.448,
    "end": 3717.948,
    "text": "And then this is the map territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.809,
    "end": 3723.27,
    "text": "The procedure of attributing to the territory, which is the actual dynamical system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.27,
    "end": 3735.778,
    "text": " what is a property of the map, which is the scientist doing inference on the dependencies and then cutting it at eight nodes and then using this other approach to make the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.946,
    "end": 3745.749,
    "text": " It's a property of the map and it's a clear example of the reification fallacy, treating something abstract as something concrete without further justification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.949,
    "end": 3749.611,
    "text": "That's not the only way reification works, but it's one key piece of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.431,
    "end": 3755.133,
    "text": "And so in other words, it's like you go in with a Markov blanket hammer and your secondary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.993,
    "end": 3766.911,
    "text": " pipeline for identifying parents and children and then you find it because it's defined for any system you're going to be able to get a markup blanket using that protocol and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.191,
    "end": 3768.651,
    "text": " Look at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.731,
    "end": 3779.998,
    "text": "Have you really discovered something about this dynamical system by separating it into this partition when actually all of the particles are doing the same jostling motion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.679,
    "end": 3783.921,
    "text": "So it's not like we have the influencer nodes here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.621,
    "end": 3786.102,
    "text": "These are just densely coupled ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.182,
    "end": 3791.926,
    "text": "And so they propose in this same paragraph,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.015,
    "end": 3805.458,
    "text": " proposed to distinguish between pearl blankets to refer to this standard epistemic or like statistical use of the Markov blankets and Fristian blankets to refer to this new metaphysical construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.218,
    "end": 3810.279,
    "text": "And they also give a shout out to Martin Beale in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.439,
    "end": 3815.0,
    "text": "And so we're kind of coming back to this map territory distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.82,
    "end": 3821.061,
    "text": "On the map side, we have epistemic, pearl blankets, Bayesian statistics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.005,
    "end": 3823.626,
    "text": " but no philosophical power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.427,
    "end": 3830.733,
    "text": "And then what they're attributing to the territory would be metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.133,
    "end": 3834.977,
    "text": "And it would be the kinds of things that the Frist and Blanket is making claims about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.198,
    "end": 3843.565,
    "text": "And I think my question was, can we do that action in the loop without metaphysics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.909,
    "end": 3854.753,
    "text": " Because it seems like there's two innovations in or differences between the Pearl Blanket in its sort of normal statistical use and the way Fristian's using it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.173,
    "end": 3860.595,
    "text": "First, he separates sense and action, but also he's making metaphysical or ontological claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.255,
    "end": 3870.258,
    "text": "So I'm just wondering, like, are the ontological claims separable from taking a control theory perspective on Bayesian statistics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.619,
    "end": 3874.12,
    "text": "That's what we would like to find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.819,
    "end": 3878.882,
    "text": " So then Blue, you copied this image over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.022,
    "end": 3881.124,
    "text": "What do you like about it or what did you see in it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.864,
    "end": 3896.336,
    "text": "So I just thought it was like a nice pictorial representation as opposed to this primordial soup that gets a little bit hairball of what we have as internal states, which were back in the Friston picture, the central states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.017,
    "end": 3905.799,
    "text": " dark blue, most highly connected nodes, through the internal states and then the external states, which are separated from these blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.299,
    "end": 3911.2,
    "text": "And so that's where this pink dashed line is, surrounded, that's labeled with these beads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.22,
    "end": 3919.141,
    "text": "So this is like the frist and blanket contains the active states and the sensory states that may be interacting with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.161,
    "end": 3926.283,
    "text": "And then this frist and blanket is what separates the internal states from the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.183,
    "end": 3935.068,
    "text": " And they take it in quite a literal sense, like the boundary of a cell and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.228,
    "end": 3938.871,
    "text": "So separating the internal from the external is the Frist and Blinkit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.815,
    "end": 3946.441,
    "text": " Nice, and let's connect this to figure four and then the kinds of things that we wanted to discover there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.041,
    "end": 3954.528,
    "text": "Looking at this as a graph of Bayesian variables, it's like active states, they influence external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.028,
    "end": 3956.109,
    "text": "So this is that coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.97,
    "end": 3960.613,
    "text": "So it's almost like external states, they don't connect to internal states at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.354,
    "end": 3964.256,
    "text": "That's kind of like missing a corner on the graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.185,
    "end": 3973.865,
    "text": " So we have nodes everywhere, you know, there's cells in your hand and there's cells across the wall, but how can we separate nature at the joints",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.887,
    "end": 3991.773,
    "text": " Maybe we could make measurements, find the statistical dependencies and then carve those dependencies into densely connected internal states and then incoming states that are upstream and outgoing states that are downstream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.353,
    "end": 4001.197,
    "text": "And then we might have a new way to do Bayesian modeling on systems that are on a continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.185,
    "end": 4005.767,
    "text": " or as part of a really complex process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.309,
    "end": 4010.39,
    "text": "And figure five, yep, we already had that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.41,
    "end": 4012.391,
    "text": "I guess we put it twice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.333,
    "end": 4016.053,
    "text": "And yes, 4.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.055,
    "end": 4023.838,
    "text": "This is sort of the man's search for meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.738,
    "end": 4029.321,
    "text": "Why and how have Markov blankets been reified to act as parts of the target system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.25,
    "end": 4031.391,
    "text": " How did we get here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.511,
    "end": 4037.113,
    "text": "And where this technical idea became reified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.133,
    "end": 4041.576,
    "text": "So people thinking that there's support in the literature saying, oh yeah, Markov blankets, it's in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.636,
    "end": 4043.897,
    "text": "There's real measurement support for Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.877,
    "end": 4045.738,
    "text": "That's reification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.586,
    "end": 4055.19,
    "text": " of delineating spatial temporal boundaries rather than formal tools intended for scientific representation and statistical analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.95,
    "end": 4058.331,
    "text": "When did the map become conflated with the territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.072,
    "end": 4067.956,
    "text": "Because like everyone's familiar how we use linear regression on healthcare data, but then no one goes back and says, well, then you're a linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.976,
    "end": 4075.579,
    "text": "So it's a little bit like if somebody were using Markov blankets on health data and then said, now you're a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.731,
    "end": 4078.111,
    "text": " Or is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.131,
    "end": 4084.295,
    "text": "I'm not saying it's exactly the same, but that's the rhetoric of what is being put out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.516,
    "end": 4089.758,
    "text": "It would be like the line delineating the healthy from the sick is Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.058,
    "end": 4090.699,
    "text": "It's a line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.959,
    "end": 4093.2,
    "text": "There's actually a line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.421,
    "end": 4096.622,
    "text": "And then they, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.483,
    "end": 4099.464,
    "text": "So again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.001,
    "end": 4102.322,
    "text": " people should read these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.362,
    "end": 4103.763,
    "text": "They're fun to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.843,
    "end": 4109.647,
    "text": "And there's a lot more that we're not getting to go into in the .zero, but they write basically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.592,
    "end": 4120.534,
    "text": " Perhaps surprisingly, many authors in the field are seemingly not aware of this process of reification, and this has led to the conflation of several different kinds of boundaries in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.294,
    "end": 4132.117,
    "text": "Markov blankets are characterized alternatively as statistical boundaries, causal boundaries, spatial boundaries, epistemic boundaries, and autopoetic boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.777,
    "end": 4137.058,
    "text": "Each characterization is treated as somehow equivalent to and interchangeable with the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.998,
    "end": 4142.664,
    "text": " Now, it's rare that someone does the Grand Slam where they totally conflates all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.265,
    "end": 4147.55,
    "text": "But then there are papers here and there where, oh, it's causal and it's spatial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.97,
    "end": 4151.455,
    "text": "And then it's spatial and it's epistemic and it's statistical and it's causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.075,
    "end": 4157.442,
    "text": "And through this web of formalisms, we can get in a tangle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.827,
    "end": 4162.228,
    "text": " to kind of, any thoughts about that, Lynn?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.448,
    "end": 4180.414,
    "text": "Yeah, just that the paper itself contains like many quotes from other papers where they use the Markov blanket or the Friston blanket in very much like a statistical and instrumentalist sense and then turn around and use it in a very realist sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.794,
    "end": 4186.196,
    "text": "So there's many like examples of that illustrated through the paper that trace back through the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.228,
    "end": 4212.219,
    "text": " good point and those are the parts that we didn't quote in this dot zero but there's many pages so if someone's reading it and they're like wait they don't do that in the literature read the paper because that's where they mention it and this is from the live stream number 15 where we had uh we were discussing the paper of vaness and hippolyto and we introduced",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.058,
    "end": 4235.651,
    "text": " this discussion around realism and instrumentalism and what those authors had written was basically realism and instrumentalism concern the models and statistical manipulations that make up the fep whether they are thought to be used and manipulated by the systems under scrutiny independent of scientific inquiry realism the tree falls in the forest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.516,
    "end": 4237.756,
    "text": " Does it make a sound?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.417,
    "end": 4240.237,
    "text": "Realism, yes, there's a real tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.397,
    "end": 4241.297,
    "text": "It really did fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4241.457,
    "end": 4242.638,
    "text": "It really did make a sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.378,
    "end": 4251.28,
    "text": "Or conversely, whether they are thought to be scientific tools wrought by humans in specific sociocultural environments to study particular systems, instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.84,
    "end": 4254.061,
    "text": "So that's like, well, no, sound means somebody has to hear it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.601,
    "end": 4257.882,
    "text": "So you don't know if the tree is real or it really didn't make a sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.442,
    "end": 4263.303,
    "text": "And the whole question is, where does free energy principle, is it about what systems are doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.983,
    "end": 4265.224,
    "text": "Realism, when we don't look?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.224,
    "end": 4291.466,
    "text": " or is it about us modeling systems no matter how they look that's instrumentalism and that brings us to figure six where they show a classic sensory motor loop so it looks like it's an active inference loop and that's where they're going with this but their whole point is that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.26,
    "end": 4305.593,
    "text": " Although the figure does not use directed edges to signify causal influence, it is not strictly a Bayesian graph as it depicts cyclic sets of circular dependencies, some between pairs and an overall loop containing all components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.694,
    "end": 4316.862,
    "text": " This was quite interesting because first off, it points out that yeah, active inference didn't invent the internal external or the action sense idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.463,
    "end": 4323.068,
    "text": "We're using different models and we're recombining them, but there is this cycle, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.548,
    "end": 4333.638,
    "text": "There's also in active inference, more of an emphasis on the internal states and the external states as they have their own endogenous dynamics, but that could be part of these models too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.966,
    "end": 4350.392,
    "text": " And then it's true that it's not a directed acyclic graph if there are loops, local or global loops, but what about implementations that have time steps where you can break these loops?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.793,
    "end": 4362.297,
    "text": "Like if you compute it in this order, just a thought, like does it really violate, how badly does it violate some of the assumptions of directed acyclic graphs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.298,
    "end": 4363.818,
    "text": "But I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4366.218,
    "end": 4367.519,
    "text": " Any thoughts are good for seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.979,
    "end": 4368.4,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.701,
    "end": 4370.902,
    "text": "I don't have the answer for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.042,
    "end": 4383.352,
    "text": "If I did, I mean, I don't know that necessarily putting a blanket over the sensation and the action states, the sensory and the active states, like putting that in a box, like does that break the acyclic graph thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.372,
    "end": 4388.796,
    "text": "I mean, I don't know that that necessarily breaks it enough to make it somehow valid either, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.876,
    "end": 4389.416,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.817,
    "end": 4392.058,
    "text": "It is a cycle, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.259,
    "end": 4393.8,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.26,
    "end": 4394.54,
    "text": "So now...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.529,
    "end": 4402.631,
    "text": " We return to the figure that we saw before, and this is where they now strike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.612,
    "end": 4410.134,
    "text": "So figure two, remember, was like, surely you agree this is how a Perl blanket would be deployed on this graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.894,
    "end": 4412.575,
    "text": "Speak now or forever hold your peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.295,
    "end": 4417.896,
    "text": "And then now it's going to come back to bite some people who may have not expected where it was going to come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.797,
    "end": 4421.538,
    "text": "So before, they were highlighting that X10 node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.208,
    "end": 4429.011,
    "text": " And now they're going to color, according to Fristen's scheme, they're going to color the nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.331,
    "end": 4438.435,
    "text": "So it's colored like figure five, but on the figure that they introduced earlier with X10 still as a focal node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.555,
    "end": 4451.401,
    "text": "But then they're going to show that if you have a different focal node, X9, not only are different nodes included, but they're categorized differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.403,
    "end": 4467.048,
    "text": " which isn't a problem for the Perl blanket, because it's like, oh, if you measure variable A and B, then this one is the child or the parent, depending on what you measured in that bigger graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.548,
    "end": 4471.249,
    "text": "But if you're going to have a realist interpretation of what these nodes are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.369,
    "end": 4491.944,
    "text": " out of luck because one is going to be an active state for one and a sensory state for another and then if you are going to say well it doesn't matter if it's an active state or sensory state like they're all doing it for each other it's equivalent to the pearl blanket phrasing so what they write is if you're going to have a sensory motor interpretation which is not the only option",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.362,
    "end": 4503.011,
    "text": " This suggests that the sensory motor blankets are Markov blankets applied under specific set of assumptions, and it can't be traced to standard uses of Markov blankets in variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.492,
    "end": 4508.355,
    "text": "So basically, depending on what your hidden variable of interest is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.144,
    "end": 4512.565,
    "text": " you compute a different blanket around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.305,
    "end": 4529.77,
    "text": "So that is problematic for realist interpretations because depending on what you were doing inference on, you might variously find that the membrane of a cell or a measurement from the membrane of a cell was a sensory state because it was incoming for something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.39,
    "end": 4536.36,
    "text": " but it could also be an action state because it's outgoing of something else, but then it would be internal to another set of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.921,
    "end": 4544.254,
    "text": "And so if we want to make realist claims or interpretations about blanket states and internal external states, that's an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.166,
    "end": 4552.47,
    "text": " So is the issue that we haven't figured out how to nest these models yet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.61,
    "end": 4567.565,
    "text": "I mean, I think that it makes sense that the outgoing is incoming for another agent in the model so that we just haven't figured out the nesting properly yet, appropriately, or that each nest is its own blanket state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.585,
    "end": 4568.526,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.608,
    "end": 4570.968,
    "text": "I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.248,
    "end": 4572.229,
    "text": "I'm an optimist as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.604,
    "end": 4600.206,
    "text": " let's see eight but this is this is where they they really go for it and this one i thought was just very clever and funny so the delayed figure you know with the intermission to convince you lol you now eight so now they're going to go into a graph that oh total coincidence it looks like the left side so here on the right side you know we were talking oh x10 x9 but we never talked about this left one that looks like california",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.943,
    "end": 4602.904,
    "text": " but let's look at it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.705,
    "end": 4605.865,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.866,
    "end": 4607.286,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.527,
    "end": 4616.512,
    "text": "On the left, a Bayesian network where ID and ISUBP denote the motor intentions of a doctor and the patient respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.253,
    "end": 4619.194,
    "text": "So that's this, these ones on the top two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.334,
    "end": 4622.096,
    "text": "H is a medical intervention with a hammer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.314,
    "end": 4627.075,
    "text": " C is a cortical motor column and S are spinal neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.755,
    "end": 4636.698,
    "text": "Movement is M. And then K is a different way that the leg could have been observed to move like somebody could have moved it or gravity could have changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.638,
    "end": 4638.999,
    "text": "So again, M is the movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.219,
    "end": 4640.639,
    "text": "That's the observable movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.639,
    "end": 4650.362,
    "text": "This is the abstract Bayesian net on the left in A. In B is one possible action pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.28,
    "end": 4663.228,
    "text": " which is that the patient goes to the cortical motor command, the IP, and then H is the medical intervention with a hammer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.908,
    "end": 4668.552,
    "text": "And then that results in no motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.652,
    "end": 4675.116,
    "text": "But then here you do have the motor behavior observed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.454,
    "end": 4677.815,
    "text": " but it comes about a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.035,
    "end": 4684.76,
    "text": "Rather than H, the intervention as a co-parent, you have K this other way, like somebody picking up the leg and moving it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.521,
    "end": 4693.806,
    "text": "In the middle and on the right, the same network is partitioned using a naive Friston blanket with different choice of internal states, C and S respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.547,
    "end": 4697.109,
    "text": "So if your internal state is the cortical neurons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.638,
    "end": 4707.145,
    "text": " you're going to think that the basically active states are the spinal neurons, which is how people talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.165,
    "end": 4710.067,
    "text": "So it's not like this is like a, the theory is blown out or anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.167,
    "end": 4715.572,
    "text": "It's like saying the spinal neurons are the active states of the cortical neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.172,
    "end": 4726.02,
    "text": "And then the movement is, if your focal node internal is the spinal neurons, then the active state is what we would call in realism, the real active state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.495,
    "end": 4737.638,
    "text": " So it's kind of like saying, again, depending on what node you're focused on, different nodes are going to be categorized as sense active internal and external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.579,
    "end": 4745.521,
    "text": "I want to say that's how we've been thinking about it, that depending on which side of the line you're on, that's going to be internal external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.261,
    "end": 4753.544,
    "text": "But the point is it provides problems for realist interpretations of any single Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.344,
    "end": 4769.635,
    "text": " because we have to acknowledge that the markov blankets and especially how the states are classified is conditional so it's like is the bicep an active state or is this an active state it's like well if you're doing inference on this yes but if you're doing inference on that no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.434,
    "end": 4785.643,
    "text": " So it's hard to have a realist interpretation, even though there are times where if you define something internally as something that's truly on the inside of something, it might be that the active states truly line up with what's on the outside of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.363,
    "end": 4791.866,
    "text": "But that isn't the full generality of this Bayesian network approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.407,
    "end": 4797.71,
    "text": "And that's like a broken clock is right twice a day, and it doesn't actually get as general as it could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.029,
    "end": 4803.091,
    "text": " This makes me think of like the broken knee, like the phantom limb.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.672,
    "end": 4804.533,
    "text": "It takes me back to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.573,
    "end": 4810.578,
    "text": "Like what if the sensory neurons are activated for the leg to move, but there is no leg to move, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.658,
    "end": 4811.999,
    "text": "Like then what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.26,
    "end": 4813.48,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.221,
    "end": 4817.183,
    "text": "So, okay, next one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.904,
    "end": 4821.386,
    "text": "They give a little bit of recent history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.427,
    "end": 4828.972,
    "text": "So if Twitter's too fast and textbooks are too slow, this is the history speed for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.421,
    "end": 4837.245,
    "text": " Beale, Pollock, and Kanai, 2020, questioned some of the technical assumptions underlying the use of Markov blankets by Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.306,
    "end": 4843.669,
    "text": "And since then, the idea of the Friston blanket being understood as a distinct construct has gained traction in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.29,
    "end": 4849.853,
    "text": "And we're actually looking forward to having Martin discuss that with us in about two weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.894,
    "end": 4853.696,
    "text": "So again, it will be really interesting to hear like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.043,
    "end": 4859.888,
    "text": " How did you come to the position where you were getting at these technicalities and critiquing it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.048,
    "end": 4861.93,
    "text": "And where does action fit in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.071,
    "end": 4863.552,
    "text": "Where does philosophy fit in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.692,
    "end": 4866.916,
    "text": "Where do these other things that Friston is bringing in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.377,
    "end": 4872.262,
    "text": "And anything to say on this part or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.241,
    "end": 4877.722,
    "text": " Only the question that I raised at the beginning, where does language fit in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.762,
    "end": 4884.845,
    "text": "Like to what extent is the problem or the issue that's being raised like a function of the language that we're using?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.005,
    "end": 4886.245,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.025,
    "end": 4894.568,
    "text": "And in this paragraph, they make another subtle point that shows why when the language is uncertain, there can be a lot of drift underlying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.388,
    "end": 4900.67,
    "text": "They say in a recent paper, Friston blankets are formalized in terms of constraints on sparse couplings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.61,
    "end": 4903.371,
    "text": "And then they're identified using",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.778,
    "end": 4916.322,
    "text": " read the technical details, the non-zero components of the Hessians using some other last names, and that is taking the construct, according to the authors, far away from the pearl blanket origins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.442,
    "end": 4928.005,
    "text": "And so they're saying you wouldn't make that kind of swap in the underlying mechanics unless you were working with the physical domain of what's really there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4930.886,
    "end": 4932.166,
    "text": "So that's an interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.567,
    "end": 4933.807,
    "text": "Will be cool to hear from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4936.758,
    "end": 4940.231,
    "text": " Here on the next slide is kind of a closing remark",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.462,
    "end": 4942.522,
    "text": " by the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4943.182,
    "end": 4945.063,
    "text": "And this is kind of a meta point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.003,
    "end": 4957.106,
    "text": "And the meta point is actually the relationship between action and inference, like of an organism, and then scientists modeling their world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.806,
    "end": 4961.267,
    "text": "So it's not the first person who's made that comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.287,
    "end": 4969.809,
    "text": "You got physical foraging, you got information foraging, but they're saying basically there's a lot of similarities between perceptual inference and scientific inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.68,
    "end": 4977.766,
    "text": " both use a previously learned model of the world and set of observations to infer the causal structure of the unobserved outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.547,
    "end": 4984.672,
    "text": "And this was like the triple meta is model-based cognitive neuroscience is in a special place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.372,
    "end": 4988.115,
    "text": "It makes models of how animals model their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.204,
    "end": 4996.311,
    "text": " A cognitive neuroscientist uses both behavioral and neural data to infer the most likely model that the agent's brain implements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.151,
    "end": 5003.297,
    "text": "There's nothing wrong with this doubling up of modeling relations as long as one is conceptually careful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.817,
    "end": 5006.34,
    "text": "One needs to distinguish between the properties of the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.25,
    "end": 5014.372,
    "text": " properties of the agent's model of the environment and properties of a scientist's model of the agent modeling its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.472,
    "end": 5016.072,
    "text": "And that's the third level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.772,
    "end": 5026.855,
    "text": "And that's why it's unsurprising actually, almost in retrospect, that FEP arose from cognitive neuroscience and neuroimaging with EEG and fMRI,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.223,
    "end": 5032.804,
    "text": " because it doesn't come from, we're going to use physics to find the grand unifying theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.824,
    "end": 5041.687,
    "text": "It actually came from a, we're making measurements about how agents reduce their uncertainty about their model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.867,
    "end": 5050.369,
    "text": "And it's that that gives you the triple loop, which I think is like quite interesting about how it's nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.902,
    "end": 5060.955,
    "text": " Well, and here we are adding like another layer to the list, like thinking about how, like trying to, you know, criticizing the model with which the scientists are using to model the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5061.315,
    "end": 5062.277,
    "text": "It's just models all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5063.203,
    "end": 5068.145,
    "text": " Yep, so what are the implications for cognitive science in humans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.985,
    "end": 5082.41,
    "text": "And this part right here, properties of how the scientists model their agent, modeling their environment, you could replace scientist with researcher or data scientist or machine learning algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.81,
    "end": 5091.813,
    "text": "This really matters what people take into account when they design their algorithms and when they make algorithms about other cognitive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5093.379,
    "end": 5100.103,
    "text": " because that constrains in ways that are sometimes obvious and sometimes not obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.663,
    "end": 5108.467,
    "text": "If you only had one variable for a user on your website, how likely they are to buy something, that was your variable, you're gonna set up a different algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.067,
    "end": 5113.47,
    "text": "So it's the properties of how the scientist models the situation that really matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.35,
    "end": 5122.595,
    "text": "And it has implications for cognitive science that when we're studying humans and non-humans and non-animals,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.23,
    "end": 5126.371,
    "text": " And Blue's big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5127.631,
    "end": 5130.313,
    "text": "This is actually the big question that the authors raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.493,
    "end": 5140.317,
    "text": "So they asked in the paper if Bayesian networks and Markov blankets are the right kinds of conceptual tools to delineate the sensory motor boundaries of agents and living organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5140.617,
    "end": 5143.958,
    "text": "So the authors brought this up within the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5144.419,
    "end": 5147.88,
    "text": "I thought it was just important to highlight that because I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.36,
    "end": 5148.82,
    "text": "I think if we're...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.781,
    "end": 5164.71,
    "text": " If you go out to a scale, like if you have an image and you start to coarse-grain that image, building representations of the image, building representations of the representations, of the representations, of the representations, eventually you can't see the picture anymore at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.09,
    "end": 5171.814,
    "text": "And the point is to make it easier to understand, not to make it so blurry that nobody understands it at all, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.694,
    "end": 5172.915,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.035,
    "end": 5178.038,
    "text": "This is what brings them to the distinction of inference with...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.858,
    "end": 5182.879,
    "text": " wait, is that even the right, it's, yeah, oh yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.019,
    "end": 5184.339,
    "text": "Inference with and inference within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.359,
    "end": 5197.603,
    "text": "I was thinking, I was getting really, you know, inference of a model, but inference with a model, the distinction between the two blanket constructs as they're positing them, I'll shrink our little video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.984,
    "end": 5206.986,
    "text": "Can then be easily identified once we look at who appears to be performing the inference and what system that inference is performed on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.226,
    "end": 5210.566,
    "text": " So they go through four kinds of networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.606,
    "end": 5221.928,
    "text": "We're not gonna go through it here, but if people are interested in the technicalities here, it's really worth thinking about what's the difference between the generative model and the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.748,
    "end": 5226.569,
    "text": "So like I can have a generative model of blue in my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.689,
    "end": 5235.131,
    "text": "So when she's speaking, I'm doing generative inference on her syntax, but then that's not the generative process, which is the actual underlying person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.491,
    "end": 5236.891,
    "text": "So this is just a nice,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.691,
    "end": 5245.352,
    "text": " very rigorous way to break down when we're doing inference on a model versus inference on a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.513,
    "end": 5249.053,
    "text": "And okay, 42.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5250.353,
    "end": 5264.516,
    "text": "All of this points towards a fundamental dilemma for anyone wanting to use Markov blankets to make substantial philosophical claims about biological and cognitive systems, which is what we take proponents of free energy principle to be wanting to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.6,
    "end": 5277.758,
    "text": " so agree or disagree you know if you disagree you can write a paper or you can come on active stream but that's the claim of the authors and so that is what we kind of got excited to learn about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.133,
    "end": 5281.756,
    "text": " And they then come back to this with versus within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.776,
    "end": 5288.183,
    "text": "And they say basically in inference with a model, the graphical model is an epistemic tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.904,
    "end": 5291.927,
    "text": "So that's like, I'm going out to the forest with my machete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.227,
    "end": 5295.191,
    "text": "I'm gonna use it as a tool as I go out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.771,
    "end": 5299.575,
    "text": "Versus inference within a model, the scientist disappears from the scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.296,
    "end": 5304.377,
    "text": " becoming a mere spectator of the unraveling inference show before their eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.157,
    "end": 5312.159,
    "text": "The way that's written makes the authors sound a little bit sort of dismissive of that being a likely approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5312.659,
    "end": 5316.74,
    "text": "It's almost like, well, we wouldn't want that to happen or it can't happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.2,
    "end": 5320.941,
    "text": "So scientists can only do inference with models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5321.761,
    "end": 5325.583,
    "text": " Now the scientist as the body is the inference within a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.643,
    "end": 5330.705,
    "text": "Like the inference is happening within the science body or within the scientist's exocortex or within their community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.386,
    "end": 5336.828,
    "text": "But that's very different when you're talking about the real system, the scientist at the desk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.289,
    "end": 5339.229,
    "text": "That's the system that is doing inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.79,
    "end": 5342.911,
    "text": "But inference with a model is the instrumentalist take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.313,
    "end": 5346.513,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5348.616,
    "end": 5355.445,
    "text": " And this is just a final slide that just gives some closing thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5357.408,
    "end": 5363.676,
    "text": "And this was interesting because they mentioned that there are simulations like the Game of Life",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5364.98,
    "end": 5369.646,
    "text": " which have been enormously productive in many domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.808,
    "end": 5379.439,
    "text": "And so basically they say that it might be an interesting way of modeling emergent processes in complex systems, but it won't support any metaphysical claims",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5380.18,
    "end": 5395.875,
    "text": " about frist and blankets and then they say we will not pursue this idea any further here but offer it as a more modest perhaps instrumental interpretation that some proponents of the fep and active inference might be inclined to adopt in order to avoid any stronger commitments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.625,
    "end": 5409.933,
    "text": " So that's in some ways where we feel like we're sitting, which is we're approaching active inference instrumentally, and then we'll see what happens with the other claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.853,
    "end": 5413.435,
    "text": "But it seems like we can pursue it instrumentally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.035,
    "end": 5417.057,
    "text": "And I guess that's a modest proposal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5418.958,
    "end": 5421.079,
    "text": "And then they just summarize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.2,
    "end": 5424.802,
    "text": "So overall, nice paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.129,
    "end": 5434.432,
    "text": " relatively good length, a lot of figures, clear arguments, rigorous philosophy and math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.092,
    "end": 5436.693,
    "text": "So it was good times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5438.193,
    "end": 5446.577,
    "text": "And like a good coverage of the literature and, you know, a trace through the history of the methods underlying the FPP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.597,
    "end": 5447.277,
    "text": "It was good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.297,
    "end": 5450.078,
    "text": "Do you have any other closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.821,
    "end": 5460.813,
    "text": " Only that maybe inference within a model is actually possible if you're using a robot that's programmed to do inference, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5461.353,
    "end": 5469.544,
    "text": "Like the inference, if the action is to do inference, if that's how it works, then that's inference within a model possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5471.681,
    "end": 5471.921,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.342,
    "end": 5479.571,
    "text": "Well, it will definitely be really interesting to hear from the authors, hear from everybody who wants to join on the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.832,
    "end": 5482.435,
    "text": "So Blue, thanks a lot for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.495,
    "end": 5483.757,
    "text": "This was a great discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.217,
    "end": 5487.161,
    "text": "Thanks everyone for watching and we'll see you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.042,
    "end": 5488.283,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.583,
    "end": 5488.743,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.763,
    "end": 5488.984,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]