[
  {
    "start": 9.121,
    "end": 25.72,
    "text": " hello and welcome to actinflab this is the active inference live stream number 20.1 on april 20th 2021 so a lot of repeating digits and i'm looking forward to this conversation with all of you so thanks for joining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.943,
    "end": 56.384,
    "text": " welcome to the active inference lab everyone we're a participatory online lab that is communicating learning and practicing applied active inference you can find us at the links that are on this slide this is a recorded and an archived live stream so please provide us with feedback so that we can improve our work all backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams like muting when we're not talking and raising our hands so we can hear from everyone on the stack",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.732,
    "end": 58.972,
    "text": " Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.573,
    "end": 59.913,
    "text": "Greetings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.673,
    "end": 71.161,
    "text": "Today, in number 20.1, we're in the first of two discussions that we're going to be having as a group regarding this paper, The Emperor's New Markov Blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.741,
    "end": 80.868,
    "text": "And so the goal of these discussions is to learn, discuss, be curious, and find out how we got here and where we're going and why we're doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.052,
    "end": 88.174,
    "text": " And we're just going to be having a nice conversation with the authors, which are just really appreciative that they've joined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.534,
    "end": 96.757,
    "text": "So we're going to just go to the introductions and warm up, and then we will just be able to jump around and see where the conversation takes us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.357,
    "end": 100.238,
    "text": "So I'm Daniel and I'm in California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.798,
    "end": 102.058,
    "text": "I will pass it to Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.3,
    "end": 107.14,
    "text": "Hey, I'm Shannon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.52,
    "end": 110.961,
    "text": "I'm usually in California, but I'm in South Dakota since the pandemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.766,
    "end": 114.647,
    "text": " Are we going straight into warmup questions or just names in around the room?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.687,
    "end": 116.869,
    "text": "You can say hello or give a warmup thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.909,
    "end": 118.149,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.689,
    "end": 120.63,
    "text": "Um, yeah, so I'm excited today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.65,
    "end": 132.496,
    "text": "I'm excited to explore whether or not we can use Markov blankets to describe groups of people and social dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.237,
    "end": 139.24,
    "text": "Um, and I tried to do this in a project before and abandoned it pretty quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.881,
    "end": 147.626,
    "text": " And reading this paper, I think if I had taken the pearl blanket formulation, which I'm sure we'll get into talking about later, it would have been a lot more helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.646,
    "end": 149.447,
    "text": "So I'm excited to discuss that today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.649,
    "end": 152.69,
    "text": "I'll pass that to Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.453,
    "end": 159.254,
    "text": "Hello, Stephen here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 159.454,
    "end": 160.215,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 162.759,
    "end": 168.521,
    "text": " It's nice to be here and thanks a lot for this paper because I think it's gonna be really interesting to have all these bits of the jigsaw put together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.901,
    "end": 184.685,
    "text": "And I'm actually quite interested in the paper because I'm trying to work out when to use the concepts of like the Markov blanket to help describe processes and when just to maybe talk about hidden states and not focus so much on the blanket part.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 184.865,
    "end": 186.426,
    "text": "So that's quite useful for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 187.146,
    "end": 190.047,
    "text": "And I will pass it over to Dave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 193.226,
    "end": 193.787,
    "text": " I'm Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.047,
    "end": 198.972,
    "text": "I'm in Baguio City, 120 miles north of Manila.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.673,
    "end": 201.715,
    "text": "It's the blazing summertime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.735,
    "end": 205.999,
    "text": "We're a mile high city, so it might get as high as 80 degrees Fahrenheit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.18,
    "end": 213.026,
    "text": "I'm retired from information technology and my background is in the cybernetics of learning and teaching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.694,
    "end": 215.954,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.514,
    "end": 218.635,
    "text": "And we have two authors here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.255,
    "end": 226.877,
    "text": "So maybe first we'll go to Chris and then Jelle, and just feel free to introduce yourself, the project, the collaboration, however you'd like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.917,
    "end": 229.318,
    "text": "Thank you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 229.378,
    "end": 230.998,
    "text": "So thanks a lot for inviting us.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 231.218,
    "end": 232.218,
    "text": "I'm Chris Dolega.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 232.358,
    "end": 236.639,
    "text": "I'm currently a postdoc at the Ruhl Universität in Bochum, Germany.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 236.659,
    "end": 238.6,
    "text": "I'm joining from Berlin.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 240.971,
    "end": 250.42,
    "text": " I'm currently working on a research grant on Bayesian cognition and conspiracy theories.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 251.44,
    "end": 260.329,
    "text": "I'm specifically interested in how proponents of conspiracy theories discount new evidence that contradict their beliefs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 262.086,
    "end": 270.793,
    "text": " And this paper, from my perspective, grew out of a really long, I guess, friendship with Jelle, we can say that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 271.814,
    "end": 278.38,
    "text": "We've met a long time ago at a conference in the Netherlands in 2014, I believe, on Bayesian cognition.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 280.402,
    "end": 286.387,
    "text": "And we were both fascinated by this new theory framework of predictive processing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 287.408,
    "end": 298.838,
    "text": " And I remember that already there, there was a seed of some kind of doubt in me or kind of a worry planted because it was a conference on probabilistic approaches to cognition.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 299.279,
    "end": 302.562,
    "text": "Everyone there was supposed to be a Bayesian in one way or another.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 302.582,
    "end": 310.028,
    "text": "And suddenly it turned out that basically no one agrees with each other and everyone uses the terms in a different way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 310.108,
    "end": 312.59,
    "text": "And I feel like this paper is, in a way,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 314.861,
    "end": 317.383,
    "text": " contextualizing that experience for us.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 317.963,
    "end": 320.265,
    "text": "But yeah, sorry, I'll let Jelle speak now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 324.188,
    "end": 324.388,
    "text": "Great.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 324.428,
    "end": 325.849,
    "text": "So I'm Jelle Bruyneberg.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 326.63,
    "end": 332.814,
    "text": "I work at Macquarie University in Sydney, but also due to pandemic reasons located in Amsterdam, the Netherlands.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 335.256,
    "end": 341.26,
    "text": "And so my new research project is on the philosophical foundations of the attention economy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 341.52,
    "end": 343.121,
    "text": "But my PhD was really in",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 345.479,
    "end": 348.14,
    "text": " on the free energy principle and embodied recognition.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 350.281,
    "end": 368.948,
    "text": "And indeed, this paper grew out of a group of people who are colleagues and friends and acquainted with each other's work, all roughly on predictive processing and free energy principle and active inference, but from slightly different directions.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 370.449,
    "end": 373.05,
    "text": "And I think it was sparked by a kind of combination of",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 373.965,
    "end": 398.726,
    "text": " fmsa kind of curiosity and skepticism about some of the developments that were that were that were happening and have been happening already in these since a long time since since i guess 2013 or 14 when some of these papers originally came out and kind of slowly got taken up in more and more heavy philosophical projects and i think the more and more we read those papers the more and more we grew interested in and skeptical at the same time",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 399.72,
    "end": 410.788,
    "text": " and this was really a project to try to finally kind of nail down what was bugging us and perhaps how it might be salvaged or what to do.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 412.489,
    "end": 416.773,
    "text": "So I'm happy this is now pre-printed and I'm very happy we get to discuss this.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 416.933,
    "end": 425.639,
    "text": "I was this morning doing the dishes and on my headphone listening to your exposition of my paper and that was just a very",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 426.578,
    "end": 433.104,
    "text": " great and mind-blowing experience where somebody explicate those ideas and not being one of the authors.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 433.124,
    "end": 437.227,
    "text": "So I think that's on behalf of all of us, that's just fantastic to have happen.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 438.008,
    "end": 441.531,
    "text": "I think actually there is a third author latent there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 442.892,
    "end": 448.137,
    "text": "So I'll try to pass on the baton to Manuel and see if he does anything or responds, otherwise we just continue.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 449.198,
    "end": 450.72,
    "text": " Well, hello, everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 451.08,
    "end": 454.423,
    "text": "I'm just here trying to lurk around for a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 454.644,
    "end": 457.446,
    "text": "It's past 11 p.m.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 457.487,
    "end": 459.248,
    "text": "in Tokyo, where I am right now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 459.849,
    "end": 464.694,
    "text": "So, yeah, I'll try to, you know, stay along for a bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 464.734,
    "end": 472.041,
    "text": "But, yeah, clearly, I'll leave the other two guys, like, who are much fresher than me right now to lead the discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 473.571,
    "end": 480.577,
    "text": " As for me, I have more of a background, I guess, in computer science, some maths here and there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 480.697,
    "end": 489.544,
    "text": "Now I'm doing some work on control theory and estimation theory applied to neuroscience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 490.265,
    "end": 499.353,
    "text": "A lot of methods probably right now, which is the main reason I guess I started working on active inference and related ideas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 499.993,
    "end": 517.711,
    "text": " And yeah, as the other two guys have already said, you know, this paper was kind of born out of, you know, our own curiosity and, you know, questions regarding like what the framework actually does and what it can do and what it cannot do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 518.672,
    "end": 523.477,
    "text": "So, you know, then I'll leave Jelle to, you know, lead the discussion from here on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 525.723,
    "end": 526.023,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.283,
    "end": 527.644,
    "text": "Thanks everyone for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.684,
    "end": 543.732,
    "text": "It's great to have just the authors and kind of read between the citations and then actually enliven between the citations so that we can ask questions that were maybe alluded to and hear your fresh perspectives, what kind of feedback you've gotten on the paper, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.192,
    "end": 546.453,
    "text": "So yeah, Yela, where would you like to start?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.553,
    "end": 548.594,
    "text": "Otherwise, there's just a bunch of places we can jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.926,
    "end": 550.206,
    "text": " Great.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 551.546,
    "end": 555.948,
    "text": "I'll just briefly give some introductory comments.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 556.388,
    "end": 561.649,
    "text": "I'll keep it brief because I think we're all roughly on the same page having read the paper.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 564.23,
    "end": 577.474,
    "text": "So as I was saying, this project got started out from a combination of curiosity and skepticism about some new applications of active inference and the free energy principle.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 578.206,
    "end": 604.275,
    "text": " and so i think as i understood it before it's it was a kind of functional lens to try to understand cognitive systems and in that sense offering a kind of unifying perspective and all sorts of different cognitive constructs in the cognitive sciences and i was already kind of very interested in that and what we've what what we've seen in the in in the last few years i think are one applications uh or at least attempts to apply it to",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 605.135,
    "end": 626.755,
    "text": " uh kind of the harder questions so the hard question of consciousness intentionality etc which is more than this kind of functional lens an application to systems that are not necessarily cognitive so living systems as a whole or even like global global systems or social systems um",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 628.411,
    "end": 653.614,
    "text": " and then as well using this terminology not only to as a functional lens to to understand systems that you already deem cognitive but also to use those tools themselves to do that democratic work so to decide what is a living or another living system what is a cognitive or another cognitive system so to somehow employ those tools of active inference to answer these kind of questions",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 654.512,
    "end": 668.517,
    "text": " And I think we were all interested in the set of questions and seeing how that could work and whether those arguments really hold.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 669.498,
    "end": 683.563,
    "text": "And I think to do that, we needed to have a combination of, one, conceptual arguments, two, formal arguments, and three, philosophical analysis, and kind of combine those in the same paper.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 684.184,
    "end": 691.031,
    "text": " And I think that also made it a very challenging paper to write, to see how all these different parts of the paper fit together.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 691.291,
    "end": 697.216,
    "text": "And perhaps it's also made it a challenging paper to read, but we'll probably get to that in a moment.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 698.998,
    "end": 703.763,
    "text": "And there's something here, I think, that kind of bogs the whole field.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 704.303,
    "end": 709.288,
    "text": "Some of us were just a few hours ago on social media, and there's a new paper",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 710.75,
    "end": 714.993,
    "text": " now among others by Ezequiel Di Paolo and Evan Thompson and Randall Beer.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 715.934,
    "end": 728.745,
    "text": "And I think one of the more meta discussions was like how much mathematics, how much conceptual work do you need to actually contribute to the more conceptual questions you want to ask?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 729.065,
    "end": 735.851,
    "text": "And I think that this is something that's intrinsically in tension here within the literature, that you kind of need to have a very technical understanding",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 737.267,
    "end": 738.969,
    "text": " to head towards this question in the first place.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 739.029,
    "end": 749.721,
    "text": "But then if you do that, perhaps you lose out on the more conceptual issues or you lose out also part of your readership because it's only a few people that understand it.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 749.741,
    "end": 753.586,
    "text": "So that's something exciting there about FEP as a whole.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 754.301,
    "end": 768.711,
    "text": " And I think we tried at least to be as accessible as possible in writing this paper, while at the same time supporting our arguments with the formalisms that we thought were necessary.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 768.771,
    "end": 772.554,
    "text": "And that ultimately brought us to writing this.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 777.938,
    "end": 779.279,
    "text": "And the thing",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 781.073,
    "end": 794.139,
    "text": " I think at the moment we have a lot of pre-prints that came out in the last few months, all kind of trying to target and trying to criticize these developments in your principle.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 794.659,
    "end": 797.58,
    "text": "So I think some of them you've discussed here already.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 797.74,
    "end": 807.084,
    "text": "So Mel Andrews' papers, Thomas van Espen's papers, I think Pieter de Raga has a good paper on this as well, along with the Thompson paper.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 808.954,
    "end": 816.877,
    "text": " So I'm really curious to see how in the next few months, half year, say, this debate will pan out.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 816.937,
    "end": 819.438,
    "text": "I think there's a number of very interesting kind of proposals now.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 819.798,
    "end": 829.061,
    "text": "And yeah, also keep checking this lab to see how you treat those other papers.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 829.101,
    "end": 830.241,
    "text": "And we're really looking forward to that.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 834.514,
    "end": 834.754,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.874,
    "end": 836.455,
    "text": "Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 836.735,
    "end": 840.676,
    "text": "Blue, do you want to just say hi, give any introductory thoughts if you'd like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.037,
    "end": 842.337,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.377,
    "end": 842.837,
    "text": "Good morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.857,
    "end": 843.777,
    "text": "I'm Blue Knight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.797,
    "end": 849.119,
    "text": "I'm an independent research consultant from New Mexico, and I really enjoyed this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.139,
    "end": 853.861,
    "text": "I don't know if you got to see like our contextualization video, but it was really good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.182,
    "end": 880.122,
    "text": " cool so i'll be kind of taking some notes everybody can also jump into the document and that was a big question that you raised there yellow um how much mathematics is required to understand or work with free energy principle and active inference and then which are the sort of skeletal elements and the sinews so to speak of the math and then which parts might be secondary or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.844,
    "end": 912.124,
    "text": " are you back yep for some reason there might be a few seconds of uh of uh just flipping but yes sorry just yeah what um elements of the math are required to understand and work with these topics and then of course the major question of your paper and some of these other recent papers we've discussed is whatever the mathematics are what kinds of philosophical or metaphysical claims can we reach validly or or invalidly um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.064,
    "end": 934.215,
    "text": " yeah any other big questions or thoughts people can just raise their hand with a little bottom left icon so yeah we'll do stephen and then blue yeah just one thing building on the bit what daniel said there is active influence in biological systems could be present as a way for",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 935.663,
    "end": 961.24,
    "text": " life to function and evolve but there's also possibilities that the active influence process could create structures or networks which then form other systems which may not have to be so um based on ergodicity in the same way it might be like you have the skeletal system which gives you locomotion so i suppose in some ways i'd be interested in that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 962.14,
    "end": 984.732,
    "text": " um way that you know we're not tied to everything being active inference in terms of how we can understand its applications even though maybe at the core it has to be there at some level cool thanks anyone can give a thought on that or blue go for it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 987.21,
    "end": 991.133,
    "text": " So just to kind of, yeah, to, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 991.293,
    "end": 995.856,
    "text": "So Steven, what you just said, like active inference is present in biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 995.936,
    "end": 1000.939,
    "text": "I think, you know, we need to be careful before we pick a side over instrumentalism versus realism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1001.039,
    "end": 1003.661,
    "text": "Like is active inference present in the living system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1004.181,
    "end": 1011.506,
    "text": " Maybe not, maybe it's just the way that we use to represent a living system or to model a living system or like our best guess so far, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1011.566,
    "end": 1024.574,
    "text": "I mean, I think that the way that the science evolves, you know, in terms of how we think about biological systems processing information will, you know, I mean, active inference is what we have now, but it probably won't be what we have in a hundred years if we survive a hundred years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.194,
    "end": 1045.428,
    "text": " um but but my question was uh you know in reading the paper i really it was brought to my attention and and steven's question so perfectly illustrates this so so to there's a great degree of semantics that's involved um and our choice of language i think really shapes how we um perceive the intentions of others",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1046.269,
    "end": 1051.474,
    "text": " So is that the caution, or is that the tale, or is that the seedy underbelly of the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.675,
    "end": 1056.079,
    "text": "Or to what role do you really think that language, a lot of these things could be fixed with language?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1058.161,
    "end": 1058.401,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.302,
    "end": 1059.602,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.923,
    "end": 1060.964,
    "text": "Jelle, you want to go for it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.024,
    "end": 1062.205,
    "text": "And then Shannon, I see your hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.867,
    "end": 1064.087,
    "text": "Great.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1064.127,
    "end": 1068.291,
    "text": "So those are two great questions.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1069.966,
    "end": 1081.644,
    "text": " And just to clarify the last one, when you say language, do you mean the kind of concepts that we are using or language as a whole as a system?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1082.233,
    "end": 1087.257,
    "text": " So, I mean, like how Steven just said, you know, systems have active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1087.597,
    "end": 1090.079,
    "text": "Like systems have active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.119,
    "end": 1095.342,
    "text": "Like I have a heart and a kidney and a liver, but I don't know that I necessarily have active inference, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.382,
    "end": 1098.184,
    "text": "So it's just our choice of language in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1098.565,
    "end": 1106.49,
    "text": "So not language as a whole, but language like carefully selected word choice could maybe prevent a lot of the conflict.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.51,
    "end": 1108.492,
    "text": "Yeah.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1110.799,
    "end": 1119.941,
    "text": " I think so, and I guess generally you might think that lots of philosophy is actually a kind of linguistic therapy, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1120.101,
    "end": 1129.443,
    "text": "Just trying to be very concise and using the right kind of terminology so that you don't slip into confusions that then will cloud your thinking also.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1131.203,
    "end": 1136.444,
    "text": "So I think there's definitely some of that on the background in this paper.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1138.21,
    "end": 1141.112,
    "text": " But it's not only language, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1141.172,
    "end": 1147.716,
    "text": "There's also the formal models and how to interpret those formal models.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1151.05,
    "end": 1164.922,
    "text": " there in the translation between the technical use of this terminology and the kind of everyday intuitions it gives us, I think there is indeed room for a lot of mistakes and slippage.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1165.042,
    "end": 1166.783,
    "text": "I mean, the notion of blanket is one, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1166.843,
    "end": 1168.565,
    "text": "I mean, I have a blanket on my bed.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1169.085,
    "end": 1195.231,
    "text": " and that has that has a spatial dimension and so and you can be either on top of it or below it etc and so when you then use the notion of a Markov blanket this is the first intuition that people will have and it turns out that actually no these kind of things don't have such a kind of existence right they don't actually they're not really spatial things in the world they're they are just aspects of mathematical model and so indeed in kind of there the",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1196.94,
    "end": 1202.845,
    "text": " language is one, but also just a particular way in which you understand your concepts, either as everyday things or as technical things.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1202.905,
    "end": 1206.067,
    "text": "I think that there's a lot of those slippages there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1206.247,
    "end": 1210.891,
    "text": "And I guess the whole literature is full with notions of model or inference.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1211.211,
    "end": 1220.918,
    "text": "And then it's very unclear whether something is an inference as a technical notion or inference as a philosophy of mind notion or inference or something else.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1221.819,
    "end": 1223.32,
    "text": "So, yeah, there are a lot of those",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1226.24,
    "end": 1226.92,
    "text": " things on the background.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1227.561,
    "end": 1239.447,
    "text": "And I think that that also points to the question that Steven was asking in terms of like, you can think about structures for locomotion and so like, how does this relate to active inference?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1240.948,
    "end": 1255.255,
    "text": "And so this is, I guess this is, I mean, perhaps this is a topic that's not really there in this paper so much, but there's a huge literature in active inference and how to understand the notion of model and whether agents are models of the environment.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1256.01,
    "end": 1274.779,
    "text": " And one way to see that is thinking like, well, there is an eco-niche around us, and we have, through selection that might not be understood through active inference, have been equipped with a particular kind of neural system, particular kind of body that allows us to engage with that environment.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1274.819,
    "end": 1275.439,
    "text": "And in that sense,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1276.039,
    "end": 1286.768,
    "text": " kind of things like the structures that facilitate locomotion could be just as part, just as well be part of that model, but then model in a very different sense as it's typically used in cooking designs.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1289.47,
    "end": 1301.359,
    "text": "Yeah, so that's also, that's very much how we understand model really shapes how you will answer these kinds of questions about how active inference and locomotion or so relate to each other.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1303.223,
    "end": 1303.904,
    "text": " Thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.304,
    "end": 1311.813,
    "text": "And it's almost like the word semantic, ironically, carries a double meaning because people will dismiss a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.853,
    "end": 1313.374,
    "text": "Well, that's a semantic discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.155,
    "end": 1318.74,
    "text": "On one sense, they mean you're talking about words, words, words, like you're kind of just saying random stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.921,
    "end": 1319.982,
    "text": "We're debating about a word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.002,
    "end": 1320.963,
    "text": "We're talking about the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.023,
    "end": 1321.624,
    "text": "It's semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.704,
    "end": 1322.525,
    "text": "It's only semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.905,
    "end": 1324.066,
    "text": "But semantics are meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.747,
    "end": 1334.751,
    "text": " And so I think I've blipped out or maybe for some people for a second, but it's just so funny how semantic refers to both the big sense of meaning and the small sense of the word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.371,
    "end": 1339.073,
    "text": "And we're all reducing our uncertainty by actually going into the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.433,
    "end": 1343.014,
    "text": "What is the Markov versus the Pearl versus the Friston blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.474,
    "end": 1352.278,
    "text": "And can we just have a common reference point so that when somebody says I'm using Friston blanket in the sense of this paper, then it will preempt some of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.038,
    "end": 1382.644,
    "text": " broader um valid or um sort of spurious questions so cool shannon and then anyone else who raises their hand yeah so i'll try to make this comment without too much rambling um but we've talked with with mel um andrews with ns um hippolyta and thomas venice and we've been discussing like on what level the system implements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.402,
    "end": 1392.706,
    "text": " active inference or has Markov blankets in the system versus when it's useful for us to describe it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.826,
    "end": 1396.047,
    "text": "So that realism versus instrumental debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.948,
    "end": 1409.033,
    "text": "And something that came up in the conversation with Ines, something that's easy for me is to claim that there is no Markov blanket necessarily in a group of people that are interacting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.533,
    "end": 1411.814,
    "text": "If we look at clusters of fans in a stadium,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.341,
    "end": 1418.823,
    "text": " I might as a researcher identify this cluster of fans because they're interacting in a certain way with each other that's different from this other cluster of fans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.223,
    "end": 1423.245,
    "text": "And then some game event happens and that ends up being some sort of coupling parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.725,
    "end": 1431.187,
    "text": "And now we can describe this as one unified system, one unified cluster of fans, of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.488,
    "end": 1441.151,
    "text": "And I am pretty happy with saying that there is not a real boundary in the world between group A, group B, or that emerges over",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.798,
    "end": 1447.06,
    "text": " um, the larger group C. But I really want to say that that happens in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.201,
    "end": 1460.345,
    "text": "Um, and I really want to say that our, like the neurons in our brains are interpreting the world as if there are boundaries and that's forming boundaries on neural processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.206,
    "end": 1471.53,
    "text": "Um, like there's this specific, people are talking about manifolds a lot lately and there's this similar, um, fuzziness and what it means to be a neural manifold, but like there's a certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.557,
    "end": 1476.1,
    "text": " manifold that's associated with observing this feature of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.68,
    "end": 1483.046,
    "text": "And I wonder if you have any intuitions from this distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.426,
    "end": 1492.253,
    "text": "Can we, can we be realists about Markov blankets or the fringe principle or active inference as applied to neural states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.273,
    "end": 1500.5,
    "text": "I mean, that's where these theories started while being anti-realist about applying these to dynamics in the world, like groups of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.387,
    "end": 1504.508,
    "text": " Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.628,
    "end": 1516.774,
    "text": "Also, just a technical note, like, I'm not sure what's happening with the Active Inference YouTube or Jitsi or whatever, but clearly my internet is working because we're having the video call, but the stream glitched, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.018,
    "end": 1538.61,
    "text": " can just continue not on live stream and then i'll just re-upload the full quality and it won't have any glitches so i'll figure it out for next week but it's all good it won't be um fully live but we can just still think of it the same way which is the vast majority of people viewing it anyway so yeah sorry about that i'll figure it out for next time but um thanks shannon for the question about the groups so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.177,
    "end": 1549.347,
    "text": " Anyone want to speak to the group question and about whether groups can be properly said to be having or modeled by these blankets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.407,
    "end": 1549.968,
    "text": "Or where is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.312,
    "end": 1559.434,
    "text": " Sorry, Daniel, you glitched for a second.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1561.135,
    "end": 1565.358,
    "text": "In the meanwhile, Jelle asked if I want to answer the group question and I think I would actually.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1565.378,
    "end": 1566.778,
    "text": "I have some thoughts about this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1567.379,
    "end": 1574.143,
    "text": "I think one important thing about the free energy framework, especially how it's been developed recently,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1575.029,
    "end": 1590.03,
    "text": " is that people often like people in for instance close circle like Ines Hipolito for example has caused the paper recently with him about mark of blankets in which they talk about viewing different systems as agents",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1591.236,
    "end": 1593.618,
    "text": " So they talk about the neuron as an agent.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1593.678,
    "end": 1595.78,
    "text": "They talk about the whole organism as an agent.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1596.341,
    "end": 1604.788,
    "text": "And it kind of scaffolds across multiple time scales and spatial scales.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1605.549,
    "end": 1605.989,
    "text": "And I think",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1607.156,
    "end": 1632.149,
    "text": " our paper leaves it open to some extent, leaves the question open whether there is some kind of scale on which if we fix the parameters of the model, the models can be validated and they can produce new predictions or new empirical findings in such a way where we would be forced to accept that perhaps on that particular scale there really are",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1633.59,
    "end": 1652.139,
    "text": " blankets in the pristine sense or like at least that these models are so good at predicting certain events or findings or phenomena on a given scale that we would be inclined to give them a realist interpretation so i think this is still on the table and it's very much open it's just that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1653.066,
    "end": 1665.429,
    "text": " given the ambitions and the scope of the free energy framework and the fact that they start with this assumption of viewing different systems on different scales as agents.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1666.109,
    "end": 1677.332,
    "text": "Right now, it's just not really clear which level, so to speak, this way of framing phenomena would be validated in a realist context.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1680.046,
    "end": 1680.306,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.607,
    "end": 1687.29,
    "text": "Really, what warrants or what licenses, what evidence will we need for realist interpretations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.59,
    "end": 1691.492,
    "text": "And it's not even just a yes, no, because there's kind of a few kinds of realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.632,
    "end": 1694.694,
    "text": "As you pointed out, there's different notions of boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.274,
    "end": 1700.537,
    "text": "And so a group might be very well said to have an informational boundary, like this jitsi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.697,
    "end": 1704.399,
    "text": "People who are not in the jitsi are not part of this informational boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.88,
    "end": 1706.581,
    "text": "But then in some other sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.625,
    "end": 1713.809,
    "text": " the group may not fall so neatly under the definition of a realist interpretation of a blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.589,
    "end": 1715.43,
    "text": "Manuel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.592,
    "end": 1718.812,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1719.232,
    "end": 1727.677,
    "text": "So I was a bit slow, I guess, after Stephen and Blue actually asked a couple of questions earlier.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1727.717,
    "end": 1734.801,
    "text": "So I'm briefly going to go back to that and then try to reconnect to what Shannon was actually talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1737.683,
    "end": 1759.356,
    "text": " As for, I guess, the loose sense in which we might want to interpret active inference, I think there is, I don't know, relatively low risk in just, I don't know, waving our hands and saying the systems do some sort of active inference, as long as we keep it loose.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1760.817,
    "end": 1779.077,
    "text": " lose in such a way that in my opinion you might just lose entirely like any meaning we're just saying well you know there's some active inference happening there in the same sense that there is some active inference happening in i don't know planets orbiting around stars or galaxies",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1780.258,
    "end": 1782.539,
    "text": " having some particular physical behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1783.459,
    "end": 1786.22,
    "text": "And so we might end up just not having anything to say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1786.72,
    "end": 1791.202,
    "text": "It's safe, but it's also not very useful in a sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1791.662,
    "end": 1802.426,
    "text": "So in that direction, I think that our work is trying to go in the direction where we want to say what active inference is not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1803.317,
    "end": 1821.995,
    "text": " in a way it is important to say well you know this is what it is right now and this is what it cannot be and if you want it to be something else well you you have to tell me exactly what else you need for that thing to even work to begin with and then related to that there's also um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1824.076,
    "end": 1830.18,
    "text": " I think I might have heard this from Alex Shantz before, and I don't know who else before him might have mentioned this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.2,
    "end": 1841.286,
    "text": "The idea of, say, an active inference coming from the highway and an active inference coming from a more normal, if we can call it like that, path.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1842.068,
    "end": 1869.217,
    "text": " The highway is what Friston has been trying to do more recently, you know, starting from first principles, as he claims, like from the physics of, you know, Langevin equations and, you know, stochastic systems, and then trying to, say, derive notions that are already established in non-equilibrium physics, and from there get all the way to, say, a definition of what agents might be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1870.629,
    "end": 1893.042,
    "text": " There is also, say, the normal way, which I think is what Shannon alluded to at some point, because this active inference theory was originally brought out in neuroscience with no ambition to be a first principle theory starting from Langevin equations that might describe any physical system in this universe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1893.522,
    "end": 1899.886,
    "text": "It was just supposed to be some sort of helpful framework that in some way was going to generalize reinforcement learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1900.566,
    "end": 1911.215,
    "text": " which is an absolutely fair, I guess, goal and ambition, but has also nothing to do with all of the physics that is more recently being plugged into active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1911.915,
    "end": 1918.36,
    "text": "And one could safely go, say, the second route and just forget about all the physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1918.641,
    "end": 1929.87,
    "text": "It might leave it, I don't know, to a different, I don't know, to a different status, but it would still be potentially useful and it would still be something that we might look forward to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1931.335,
    "end": 1939.758,
    "text": " And that, I guess, leads me to something that Shannon was mentioning about manifolds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1940.719,
    "end": 1951.923,
    "text": "And in some sense, the question about are Markov blankets real or not is similar to, yes, are manifolds real or not?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1953.984,
    "end": 1955.104,
    "text": "And here, I don't want to say",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1959.142,
    "end": 1961.544,
    "text": " I'm not really sure how to go about this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1962.344,
    "end": 1971.991,
    "text": "In the same way that physicists generally don't think too much about, well, is this energy landscape real or not?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1972.551,
    "end": 1976.574,
    "text": "Is my ball actually trying to fall to the ground?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1976.654,
    "end": 1979.796,
    "text": "Or is it just, well, it is a good metaphor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1980.496,
    "end": 1981.777,
    "text": " It works really well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1981.957,
    "end": 1985.198,
    "text": "We tend to use some adjective language in there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1985.678,
    "end": 1994.182,
    "text": "But I guess that if you hard-press a physicist, you will probably hardly get an answer about, oh, is this energy scape real?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1994.542,
    "end": 2000.325,
    "text": "Is there an energy scape inside the ball that the ball is using to actually roll down the hill?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2001.496,
    "end": 2002.597,
    "text": " Well, probably no.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2004.038,
    "end": 2008.0,
    "text": "It is the kind of question that, you know, well, I will still be using Lagrangian mechanics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2008.08,
    "end": 2016.726,
    "text": "I will still be using Hamiltonian mechanics, but I will not be, you know, opening up a ball looking for the energy landscape there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2017.686,
    "end": 2019.728,
    "text": "In the same way, I will still be using manifolds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2020.268,
    "end": 2022.71,
    "text": "Well, personally, because, you know, population codes are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2023.988,
    "end": 2027.43,
    "text": " revealing to be pretty useful in neuroscience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2028.031,
    "end": 2033.894,
    "text": "But I will not say start looking inside the brain like, well, where's the manifold there, if that makes sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2036.176,
    "end": 2041.039,
    "text": "Yes, totally makes sense and real and useful when they're aligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.472,
    "end": 2043.192,
    "text": " people celebrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.832,
    "end": 2052.234,
    "text": "And when they're not aligned, there's often another story why something is still really useful, even though it's just a useful fiction or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.574,
    "end": 2057.315,
    "text": "And I think that vector alignment is really what we want to nuance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.335,
    "end": 2060.295,
    "text": "We want to have like an hour hand and a second hand and a minute hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.315,
    "end": 2067.576,
    "text": "We want to be clear, where are we just specifying a partially observable Markov decision process and fitting data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.097,
    "end": 2069.997,
    "text": "And then where are we in the interpretive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.797,
    "end": 2075.629,
    "text": " frame and where are we in a metaphysical frame even beyond the interpretive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.271,
    "end": 2078.677,
    "text": "Stephen, and then anyone else raising their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.249,
    "end": 2109.718,
    "text": " i think as well as um where we say if it's real or not there's the sense of at what scales and i like the fact that he talks about scales is what scales um and at those scales how much plausibility is there for certain types of inference processes to be possible i suppose that's where you know if there's no ergodicity present or seems to be very little at certain scales then maybe it's less likely that that mechanism",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2110.718,
    "end": 2135.793,
    "text": " is an active influence mechanism although there may be some elements of it so i think that that also changes the way that the realist aspect could be brought in it's like how much could it be a blanket aspect or maybe like you say that at other scales unlike say a single cell which is diffusing chemicals over a membrane and there'd be some weak mixing process going on there's some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2136.913,
    "end": 2142.982,
    "text": " um yeah there's some ways that variation or expected free energy are not the only mechanisms",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2145.402,
    "end": 2149.085,
    "text": " Even suggesting that it's a mechanism is something that's mechanical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.225,
    "end": 2151.846,
    "text": "These are what we want to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.187,
    "end": 2153.507,
    "text": "And these are the discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.108,
    "end": 2156.369,
    "text": "And then are they equivalent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.409,
    "end": 2158.571,
    "text": "And do mechanisms have to be real things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.131,
    "end": 2161.993,
    "text": "Or can a mechanism be something that doesn't exist in the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.473,
    "end": 2163.794,
    "text": "Or a conceptual mechanism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.914,
    "end": 2170.279,
    "text": "Or could it be just a pattern that doesn't exist in one measurable thing we can put on a scale, like a machine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.279,
    "end": 2172.88,
    "text": "So cool questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.281,
    "end": 2175.142,
    "text": "Dave, and then anyone else raising their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.983,
    "end": 2187.851,
    "text": " Okay, sometimes the math is trusted too far and it's allowed to do a whole lot of work, but sometimes the math gets crippled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.912,
    "end": 2201.541,
    "text": "Now, I'm a student of Gordon Pask and cyclicity and self-stabilizing feedback is really critical to everything he did in learning theory and biology and system science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2202.504,
    "end": 2223.441,
    "text": " and what's the very first thing you do when you mention markov processes you stomp out the cycles you rip out those cycles you're just not allowed to have loops in a markov network well then they come back in because that's what people are looking for they're looking for self-stabilization and using the environment in the environment using you to enrich itself and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.993,
    "end": 2232.458,
    "text": " And then, as you point out at the end of your paper, well, then Dr. Friston finds there's cycles in there, and then he goes and rips them out all over again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2233.719,
    "end": 2247.847,
    "text": "Has anybody ever just left the cycles in, come up with a formalism that's richer than a Markovian tree, and then see if maybe things get easier and simpler?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2250.742,
    "end": 2252.823,
    "text": " Great question, Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.923,
    "end": 2256.804,
    "text": "And I think the big question is, what are the inputs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.884,
    "end": 2259.104,
    "text": "What do we want to get out of this math?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.244,
    "end": 2261.505,
    "text": "Are we looking to make analytical claims?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.285,
    "end": 2270.668,
    "text": "Or are we looking to have very general frameworks for control theory, or for estimation theory, even like Manuel mentioned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.268,
    "end": 2274.549,
    "text": "So anyone can raise their hand, but Chris?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.229,
    "end": 2277.529,
    "text": " Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2277.729,
    "end": 2283.751,
    "text": "So I just wanted to follow up on the last two questions, but I see that there's already a theme emerging in a way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2284.711,
    "end": 2299.194,
    "text": "So one thing is about the maths and, you know, already the question that was posed at the beginning, how much the understanding of maths informs research that people can do into the predictive processing framework.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2300.455,
    "end": 2310.129,
    "text": " And now we return to this question in a way with this question of cycles and the fact that we actually analyze, you know, we leave the cycles out.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2310.69,
    "end": 2316.018,
    "text": "And I think it's in some ways useful to think about our paper in many ways.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2317.038,
    "end": 2326.742,
    "text": " And what's happening with the free energy framework as a kind of a pyramid where, you know, formalisms, mathematical formalisms are stacked one on another.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2326.762,
    "end": 2330.384,
    "text": "And finally, the free energy principle really lies at the top.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2331.204,
    "end": 2341.589,
    "text": "And what we've been trying to do in some ways is to lead our readers, you know, through the steps going up to the free energy principle and like how it's supposed to work.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2342.572,
    "end": 2348.274,
    "text": " But the thing is that, of course, there are many different ways to get there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2348.314,
    "end": 2363.458,
    "text": "You can think about the cycles, like the topological method that we took with directed graphs and the way of thinking about dynamical coupled systems and loops and stuff like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2363.778,
    "end": 2366.719,
    "text": "You can think about this as different slopes of the same pyramid, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2367.299,
    "end": 2371.742,
    "text": " In the end, the point is that you want to get to the free energy principle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2371.842,
    "end": 2372.343,
    "text": "Exactly.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2373.704,
    "end": 2375.665,
    "text": "You want to get to the free energy principle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2376.626,
    "end": 2383.01,
    "text": "And the free energy principle lies on top of a lot of work done in many different formal fields.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2385.652,
    "end": 2392.817,
    "text": "And I think that the last question asked by Dave pointing to the possibility that perhaps",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2393.564,
    "end": 2404.178,
    "text": " If we leave the question of directed acyclical graphs aside and just focus on cyclical systems, perhaps we could arrive at a new formal construct",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2404.844,
    "end": 2414.575,
    "text": " that could later turn out to be somewhat equivalent to Markov blanket, but wouldn't be so easily conflated with Markov blanket.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2414.615,
    "end": 2420.042,
    "text": "I think that's a very interesting possibility that probably should be explored in the literature.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2420.062,
    "end": 2424.327,
    "text": "And the other thing I wanted to address very briefly is the fact that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2425.433,
    "end": 2432.055,
    "text": " The other theme that seems to be emerging here in the discussion is this theme of patterns and what's real and what's not real.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2432.095,
    "end": 2445.878,
    "text": "And I think here it's useful to bring back our kind of point that Dan Dennett has already done some important work in the past on this with his work on real patterns and what does it mean for a pattern to be real?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2446.398,
    "end": 2450.179,
    "text": "And what's the difference between a pattern being real and not being real, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2451.022,
    "end": 2466.218,
    "text": " um one interesting thing if we think about active influence for example is that if we think about the social dynamics uh we can think for example about the dynamics in the army right a platoon clearly has uh an uh some kind of a",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2467.259,
    "end": 2496.72,
    "text": " blanket like the platoon is trying to maintain its homeostasis they they are all trying to stay alive especially in a hostile environment far away from the equilibrium right the interesting thing about the example of a platoon if i and i hope i'm not getting that wrong now but i'm sure manuel would correct me if i do is that we don't actually assume that the that the that the platoon would be statistically ergodic because it definitely shouldn't uh shouldn't visit some of its",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2497.708,
    "end": 2499.289,
    "text": " possible state spaces, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2499.83,
    "end": 2501.611,
    "text": "Portions of the state space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2502.011,
    "end": 2509.677,
    "text": "Like the whole point of putting people into a platoon is so that they won't visit certain regions of the state space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2509.697,
    "end": 2513.66,
    "text": "So those are interesting questions here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2513.941,
    "end": 2516.743,
    "text": "And of course, the question about like, are platoons real?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2517.904,
    "end": 2519.325,
    "text": "You know, are they?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2520.846,
    "end": 2523.807,
    "text": " It's an interesting question to ponder.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2523.827,
    "end": 2526.848,
    "text": "Dan Dennett previously has asked the question about money, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2526.888,
    "end": 2528.468,
    "text": "So is the value of money real?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2528.968,
    "end": 2532.349,
    "text": "Obviously it has direct impact on our lives.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2533.029,
    "end": 2542.451,
    "text": "It has a direct impact on how we behave in virtue of the kind of social construct and the social scaffolding on which it rests.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2543.191,
    "end": 2555.838,
    "text": " But we all kind of agree that the existence of value of money is just some kind of fiction that we all buy into, especially now that the gold parity is no longer a thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2558.68,
    "end": 2558.96,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.98,
    "end": 2561.262,
    "text": "Cool point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.16,
    "end": 2565.722,
    "text": " It's really remarkable how this, what is real?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.902,
    "end": 2567.202,
    "text": "I mean, in some sense, it makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.223,
    "end": 2571.465,
    "text": "It's the classic philosophy question, Plato's cave and what's real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.206,
    "end": 2577.609,
    "text": "And it's hard to differentiate it sometimes because it's used in very many senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.109,
    "end": 2584.133,
    "text": "So sometimes like the pyramid, it's almost like we're surfacing it like an iceberg to mix metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.653,
    "end": 2587.475,
    "text": "And then people can visibly attack a formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.895,
    "end": 2592.218,
    "text": "Well, the directed acyclic graph doesn't represent reality because reality has cyclic elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.058,
    "end": 2620.898,
    "text": " and then we have to sort of change the formalism a little bit like could we run it in a sequential way could a message passing algorithm emulate a cyclic system even though locally computationally it's linearized but you lose some other attribute is that real then would the model be real so fun questions um yellow and then Stephen great um so I think a question kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.77,
    "end": 2644.379,
    "text": " related slash orthogonal to uh to to to the real question is a question about uh what we in the paper call verification right so it's it's a fact that if you make a mathematical formalization of something that mathematical formalization might is quite often idealization of the target phenomenon that you're that you're investigating and then as long as you treat that mathematical structure as an idealization",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2645.699,
    "end": 2653.484,
    "text": " of the target phenomenon and don't automatically transfer the properties of the idealization to the target phenomenon, then that's completely fine.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2654.304,
    "end": 2667.833,
    "text": "And then where it gets upside down is if you suddenly take that mathematical formalization as somehow being at the root of the appearance of the target phenomenon that you're investigating.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2669.505,
    "end": 2679.034,
    "text": " we make this case for the kind of graphical model example, where there is a complicated system, you make a graphical model of it, which is by all means a kind of simplification of that very system.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2679.795,
    "end": 2687.923,
    "text": "And then if you start to say, look, Markov blankets were actually in that system, you're also implying that no, actually that mathematical idealization",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2689.086,
    "end": 2705.235,
    "text": " uh of of of of the system was actually already in the target system that you were that you're investigating and that's that's i think also a move that you make the mathematics itself more real than your than you're supposed to make it um and of course",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2705.996,
    "end": 2709.438,
    "text": " I think we said this towards the end of the paper, you can buy the bullet, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2709.498,
    "end": 2714.981,
    "text": "And say, look, no, reality at its very core is mathematical, so we're fine.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2715.021,
    "end": 2723.686,
    "text": "But that is something that doesn't itself come from the formalism, but requires actually pretty strong metaphysical assumptions.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2724.066,
    "end": 2732.371,
    "text": "And so the question about, in that sense, the question about the reality of a mathematical structure is also intertwined with this question about reification, about",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2733.14,
    "end": 2740.306,
    "text": " How do you see the relationship between the target phenomenon you're investigating and the mathematical formalization of the target phenomenon?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2741.147,
    "end": 2744.67,
    "text": "I think these two questions kind of go hand in hand.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2747.692,
    "end": 2748.033,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.673,
    "end": 2749.914,
    "text": "Stephen, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.397,
    "end": 2759.322,
    "text": "Yeah, I think this mathematical piece is important as well, because I think there's often the assumption",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2760.236,
    "end": 2765.7,
    "text": " that we're always inferring this model of the world and how to adapt and interact with the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2765.78,
    "end": 2774.686,
    "text": "But one of the key things, particularly higher order animals and humans like the platoon, is at times they want to be this ordered or this coherent self.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2774.726,
    "end": 2776.508,
    "text": "But ultimately, when they're in the field,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2777.188,
    "end": 2782.235,
    "text": " Yes, they want to get into the most optimal ways to shoot and do things, but they need to game the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2782.275,
    "end": 2785.259,
    "text": "They need to not do what the other people think they're going to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2785.279,
    "end": 2789.525,
    "text": "And they have to guess what someone else might do, which is non-ergotic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2789.565,
    "end": 2791.748,
    "text": "Something which is, you're basically gaming",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2792.679,
    "end": 2798.64,
    "text": " each other's environment so that you're basically like prey and predator.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2799.1,
    "end": 2802.021,
    "text": "You're also then taking another stance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2802.081,
    "end": 2808.462,
    "text": "So you step outside of what would be that normal dynamical free energy minimization process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2808.502,
    "end": 2811.923,
    "text": "And that is sort of sitting on top of the other process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2811.943,
    "end": 2814.904,
    "text": "So I think that's a kind of an interesting confusion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2816.724,
    "end": 2817.004,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.524,
    "end": 2818.825,
    "text": "Dave, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.605,
    "end": 2820.805,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.268,
    "end": 2828.43,
    "text": " The question of what is or wasn't, what isn't ergodic seems to interact a lot with scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.251,
    "end": 2839.454,
    "text": "And this is something that can be manipulated in an organization, sometimes to what seemed like contradictory or paradoxical effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.834,
    "end": 2847.097,
    "text": "For a long time, the US military officer corps has had an up or out policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.877,
    "end": 2850.878,
    "text": "If you didn't get promoted within a certain amount of time,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.363,
    "end": 2858.824,
    "text": " you were invited to leave the military and go do something else with your life, which sometimes didn't work well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.864,
    "end": 2874.487,
    "text": "You started running into the, oh, you know, the British sociologist from the 50s with the most famous organizational law, such and such as law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.907,
    "end": 2878.808,
    "text": "Yeah, people are, you know, they end up at their level of incompetence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.367,
    "end": 2904.301,
    "text": " Well, much more recently, just over 20 years ago, the US Department of Justice started adopting an up or out policy, which quite likely is a lot more toxic than having that in the military because the military has usually a fairly narrow kind of purpose if it's being used at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2905.082,
    "end": 2907.403,
    "text": "In the Department of Justice, the FBI especially,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.17,
    "end": 2937.886,
    "text": " If you're a local investigator, you're expected over a period of years, not just to know your colleagues and the cops and the prosecutors and the reporters and the informants and the way the underworld works, whether you're stopping them or not, you're expected to develop an enormous amount of highly differentiated knowledge of South Cincinnati or the East Bronx will then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2938.849,
    "end": 2941.891,
    "text": " In the late 90s, somebody decided, oh, no, no, wait a minute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.471,
    "end": 2946.194,
    "text": "This leaves a possibility of local corruption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.254,
    "end": 2950.516,
    "text": "We're allowing nests of incompetence and nests of bribery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.997,
    "end": 2953.718,
    "text": "So we're going to require people to leave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.878,
    "end": 2962.844,
    "text": "No matter how much you love working in the South Bronx, you either get promoted to Washington or you get out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.805,
    "end": 2967.567,
    "text": "So the intention presumably was to keep a nice, smooth,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.318,
    "end": 2993.731,
    "text": " pipeline a clear flowing stream but you end up requiring incompetence instead is there a larger scope at which you become scale independent and that sort of thing and oh yeah it looks muddy at a low level but it's actually ends up being clearer or is it just screwing up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.476,
    "end": 2997.718,
    "text": " Cool question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.738,
    "end": 2998.739,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.959,
    "end": 3005.587,
    "text": "One piece I kind of heard is like there's systems that we can actually control, like a software program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.828,
    "end": 3011.114,
    "text": "We can write a program with a strictly defined topology of variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.815,
    "end": 3021.141,
    "text": " And so it's easier to take a realist interpretation of a program where we can define all the pieces and we can know everything that's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.641,
    "end": 3037.411,
    "text": "But once we're dealing with systems that we didn't directly control, we know that we're dealing with a map territory distinction, which I guess is something I'll flip to because this was just a great and a very accessible point, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.464,
    "end": 3046.309,
    "text": " Wherever we go down the rabbit hole with the math, we have to keep that map territory embodied metaphor in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.029,
    "end": 3057.436,
    "text": "Whether it's a phone you're looking at, and it's deep learning, and it's maps and recommendations, or whether it's a hand-drawn map that your friend made, or whether it's a historical painting, it's a map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.776,
    "end": 3064.76,
    "text": "And we can all see how that differs than the actual, quote, realism of the territory, which isn't even like what we see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.06,
    "end": 3067.042,
    "text": "It's actually something a little bit else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.822,
    "end": 3073.243,
    "text": " So going and holding to this map territory distinction is kind of a useful thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.283,
    "end": 3074.383,
    "text": "And so it's great that you brought it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.483,
    "end": 3083.785,
    "text": "Also on the sort of symbolic and evocative wavelength, what about the title or what inspired the title?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.785,
    "end": 3087.926,
    "text": "How did you see that story or that narrative play out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.006,
    "end": 3089.906,
    "text": "Because you say a lot with a few words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.107,
    "end": 3094.207,
    "text": "Uh...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3095.7,
    "end": 3100.041,
    "text": " I think we stumbled upon the title and just thought it was too good not to use.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3101.101,
    "end": 3104.722,
    "text": "But in terms of the... You have it there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3104.962,
    "end": 3105.543,
    "text": "Oh, goodness.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3110.664,
    "end": 3117.946,
    "text": "I heard you explain the story during the pre-recording, which is very nice.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3119.386,
    "end": 3123.647,
    "text": "But I think there was one element there that you didn't mention.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3124.502,
    "end": 3131.587,
    "text": " And that there are somehow these swindlers in this story fell to the rest of the lackeys and so in the palace.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3131.987,
    "end": 3138.312,
    "text": "These are a set of clothes that you can only see if you're very clever.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3138.632,
    "end": 3141.454,
    "text": "If you're too dumb, you won't be able to see these clothes.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3142.175,
    "end": 3147.398,
    "text": "So there is, and all the lackeys and everybody involved in the story there, there is a kind of doubt.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3147.839,
    "end": 3149.72,
    "text": "Like, is this me?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3149.82,
    "end": 3150.721,
    "text": "Am I too stupid?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3151.724,
    "end": 3165.411,
    "text": " or is something fishy going on here and i think that kind of state of suspense of not really knowing i think that's perhaps the the key to the title uh we don't we we know we don't suggest that there were swindlers in this story or so but that kind of idea like hey am i",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3166.516,
    "end": 3169.177,
    "text": " Am I too stupid to get this, or is something weird going on?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3169.417,
    "end": 3178.021,
    "text": "And I think everybody working on Free Energy Principle has, or at least should have, had that feeling to some extent.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3178.741,
    "end": 3183.503,
    "text": "So I think that's the key to the title, without giving away too much about the rest of the story.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3184.803,
    "end": 3185.684,
    "text": "Yes, Shannon?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3188.745,
    "end": 3191.986,
    "text": "I somehow missed that nuance from the title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.979,
    "end": 3197.1,
    "text": " It seems really prescient for the new paper that just came out too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.46,
    "end": 3214.466,
    "text": "And the Twitter post response on it too is maybe certain technical aspects of the free energy principle weren't described with the specific mathematics and formalism that you need to properly criticize the free energy principle, which maybe you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.526,
    "end": 3217.987,
    "text": "Maybe you need to have that much detail to properly criticize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.127,
    "end": 3222.169,
    "text": "But if it's a principle that we want",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.925,
    "end": 3235.393,
    "text": " to use in our empirical science and our understanding of whatever subject matter we're looking at and also something that we want to use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.933,
    "end": 3247.161,
    "text": "I assume that in science we want to use this to also inform the world about something that we know about the system that we're studying, whether it's something like this is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.095,
    "end": 3277.371,
    "text": " true real fact of the system or this is the most useful way that we can understand the system so that we can apply treatments you know maybe translate to applied clinical practice or something like that then at some point it needs to be possible to abstract away from the formalism without losing the detail or without losing the assumed detail that the formalism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.895,
    "end": 3304.63,
    "text": " brings in and maybe it's just maybe like we have to work through this nitty-gritty stuff and we have to fight over very small mathematical details and people that are better at math than I have to make that fight before like we can bring it in and people in applied practices and maybe even the greater public can start understanding exactly what this means but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.868,
    "end": 3306.489,
    "text": " I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.589,
    "end": 3307.85,
    "text": "When is the point that we can get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.87,
    "end": 3311.053,
    "text": "When is the point that we can say, okay, we're done arguing about the formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.113,
    "end": 3322.163,
    "text": "We know there's subtle differences, but I can still have a conversation with my friend who's just interested in my PhD work, but hasn't done a PhD themselves or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.504,
    "end": 3327.328,
    "text": "I'm going to stop talking as I start trailing off with less points here, but just throwing that out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3327.549,
    "end": 3328.069,
    "text": "Thanks, Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.489,
    "end": 3329.27,
    "text": "Cool points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.611,
    "end": 3329.871,
    "text": "Manuel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.827,
    "end": 3340.974,
    "text": " So I hope this doesn't come along as, say, negative perspective in a way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3341.394,
    "end": 3356.846,
    "text": "But I guess that beyond what Shannon mentioned already as being part of the problems, which are real, which are absolutely real, like when can we stop getting into the nitty gritty stuff so that we can actually do some work?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3357.626,
    "end": 3375.403,
    "text": " On top of that, and here I'm going to break a lance for Friston for once, where I say that part of what makes his job difficult is also the idea of dealing with definitions that use the same words across different fields.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3376.324,
    "end": 3379.788,
    "text": "So we have an example here with ergodicity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3380.504,
    "end": 3398.532,
    "text": " So the ergodicity definition that physicists study is this idea of having a system that visits all of the states in a state space such that you can replace time average with ensemble averages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3399.492,
    "end": 3410.958,
    "text": " If you look at it from the perspective of Markov processes, which I think Dave actually brought out at some point, aperiodicity actually becomes part of the definition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3412.239,
    "end": 3427.087,
    "text": "If you look at it from the perspective of ergodic theory, which is this field born like 70, 80 years ago, and that actually is supposed to just deal with ergodicity, then what Dave actually suggested in their field is weak mixing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3428.027,
    "end": 3434.172,
    "text": " So you can have systems that are not ergodic but not weak mixing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3436.253,
    "end": 3447.161,
    "text": "So all in all, without going too much into details, I'm just trying to suggest that there is also a level of misunderstanding that comes from people having different backgrounds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3448.002,
    "end": 3456.728,
    "text": "So on top of just, say, understanding what is going on, we also need to have, I don't know, a paper or two that just list",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3457.682,
    "end": 3462.765,
    "text": " definitions as, you know, I'm using this definition from this specific field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3463.045,
    "end": 3464.285,
    "text": "You can find it in this book.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3466.267,
    "end": 3476.432,
    "text": "Different people might want to say, well, this is not really how I was taught this specific concept, but at least it is something that now I can engage with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3477.833,
    "end": 3485.323,
    "text": " So a lot of the confusion, especially on ergodicity, actually comes out just of people having different backgrounds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3485.963,
    "end": 3491.49,
    "text": "None of them are wrong, because all of them are just using different definitions, unfortunately.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3492.483,
    "end": 3494.063,
    "text": " Totally agreed with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.423,
    "end": 3496.664,
    "text": "It's almost like a scientific project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.364,
    "end": 3517.609,
    "text": "And what we're seeing is that there's an enormous desire to contribute to a shared scientific project and to make these ideas not just something that rests in the head of an expert, but something in our exocortex, in our informational niche, something where we can all just see the affordances in a bigger project like Wikipedia and improve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.29,
    "end": 3519.71,
    "text": "And then in service of that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.27,
    "end": 3525.253,
    "text": " we need alignment on really the tools and the people and the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.994,
    "end": 3536.901,
    "text": "And the ideas are more on the philosophical side and the tools as we're seeing are more on the technical side and something that's right at the intersection of tools, people and ideas are really the terms and their definitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.002,
    "end": 3547.171,
    "text": " And that pursuit of clarity as well as improved ability to translate and generate introductory material is really key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.411,
    "end": 3563.525,
    "text": "And that active inference ontology type work is one of the things we're working on in ACT-InfLab because we totally agree when there are multiple definitions, then it's either a don't ask, don't tell policy on definitions or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.426,
    "end": 3591.612,
    "text": " people do go into the details and then the paper is criticized for providing a specific detailed take or they make nine out of ten points but then it leaves um a shadow of doubt about the tenth of tenth point because it seems like it's going too technical and when people do a linear regression or a time series model even when lives are on the line no one says wait a minute i need the least squares error to be real but we're seeing criticisms about what's real here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.392,
    "end": 3598.951,
    "text": " And so that's such a fascinating pattern that really will be explored, I think, in the coming months and years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.023,
    "end": 3622.78,
    "text": " this line of research has brought us to some fundamentals and we are bringing up some new questions and connecting ideas and terms in new ways so it's fun to be a part of and um i hope that those who are listening can see that they're a part of this active conversation and it's not like they um the authors release this paper and now the conversation is over this is sort of their",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.701,
    "end": 3649.145,
    "text": " opening call and i hope that we can hear a few more pieces about what does that call entail for those who take it up yellow yeah great um i i just want to briefly follow up on on on shannon's point and uh saying that at least i think our aim is also to to uh um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.748,
    "end": 3661.219,
    "text": " to kind of tease apart a little bit the kind of empirical research program of active inference and DCM.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3662.119,
    "end": 3667.565,
    "text": "And the more kind of what we in the paper in the end called the kind of most ambitious version of blanket-oriented ontology.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3668.516,
    "end": 3681.026,
    "text": " and show that you don't need to buy into that heavy-duty metaphysical framework in order to do interesting empirical work with active inference or with DCM or so.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3681.546,
    "end": 3696.398,
    "text": "So that kind of association back and forth, there might be a good fit, but I think there's very good reasons to just say, well, marker blankets stay in my toolkit as a scientist, and I can use them and employ them every once in a while, but...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3697.979,
    "end": 3703.362,
    "text": " I'm not going to speculate about how my toolkit fits onto reality, et cetera.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3703.502,
    "end": 3704.503,
    "text": "That's a different ballpark.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3704.543,
    "end": 3712.307,
    "text": "But as having it in your toolkit, you can still do basically all the science that's there already.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3712.387,
    "end": 3718.251,
    "text": "So I just want to be clear that at no point do we want to say, oh, people should do empirical work differently or so.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3718.271,
    "end": 3726.816,
    "text": "But it's really like if you want to use this toolkit to dive into a different set of questions rather than the traditional empirical ones, you can ask what the question is about.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3727.574,
    "end": 3744.92,
    "text": " demarcation of agents or so that might look a lot like the empirical ones that actually are not really, then you are confronted with a different set of questions, namely about how does mathematics relate to reality and so, but by no means do we want to kind of block that.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3745.18,
    "end": 3749.141,
    "text": "And I think, I mean, a long time ago, I studied physics, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3749.161,
    "end": 3753.443,
    "text": "And then if you open beers, you get discussions about are atoms real and so, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3753.883,
    "end": 3754.443,
    "text": "And these are kind of,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3755.584,
    "end": 3767.689,
    "text": " These are the kind of questions that are just funny to raise, and some people have more or less patience with them, but by no means do any of those questions block the actual research in physics.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3767.709,
    "end": 3768.93,
    "text": "They're orthogonal to each other.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3768.99,
    "end": 3780.755,
    "text": "I think the same holds for neuroscience, at least to some extent, if you want to interpret data or so and use a mathematical toolbox for that, then that's completely...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3782.512,
    "end": 3784.116,
    "text": " metaphysically innocent in that, so to say.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3784.136,
    "end": 3790.532,
    "text": "It's just this transition that has happened that we have doubts about or take issue with.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3792.312,
    "end": 3795.234,
    "text": " Cool, thanks, and anyone can raise their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.534,
    "end": 3813.584,
    "text": "One thought on that is that the structure of the implementation of active inference models with a partially observable Markov decision processes helps us separate out, for example, our priors about different variables, our generative model, our affordances, and our preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.964,
    "end": 3819.707,
    "text": "So using that model helps us distinguish, for example, our aspirational model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.827,
    "end": 3825.271,
    "text": " beliefs about how the world should be or what we'd prefer from the sort of reality on the ground with what our affordances are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.871,
    "end": 3829.153,
    "text": "And almost at a higher level, this is where this discussion is coming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.754,
    "end": 3835.598,
    "text": "Can we separate out our technological affordances from our preferences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.758,
    "end": 3839.62,
    "text": "For example, that an integrated theory of everything would be preferable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.74,
    "end": 3847.986,
    "text": "That just makes a theory better for it to be more explanatory, more predictive, more universal, more transferable across different systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.586,
    "end": 3849.267,
    "text": "Those are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.867,
    "end": 3853.53,
    "text": " preferences we might have over distributions of scientific theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.231,
    "end": 3857.454,
    "text": "But that's not quite the same thing as what are our affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.554,
    "end": 3859.615,
    "text": "And we don't know all the affordances yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.755,
    "end": 3861.577,
    "text": "There's theories that haven't been invented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.597,
    "end": 3862.818,
    "text": "There's frameworks that don't exist yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.318,
    "end": 3873.827,
    "text": "So how do we make sense at the lower level and then also at sort of a higher meta-scientific level have a discussion across different frameworks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.761,
    "end": 3879.469,
    "text": " without trapezing into essentially unknowable metaphysical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.09,
    "end": 3881.312,
    "text": "Steven, and then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.851,
    "end": 3884.631,
    "text": " Yeah, I'd be interested.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3884.691,
    "end": 3889.474,
    "text": "It sort of relates a bit to what Dave was saying there about feedback loops.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3889.794,
    "end": 3895.958,
    "text": "And in the last session, we had Caspar Hesp talking about some of the modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3896.458,
    "end": 3910.365,
    "text": "And there you have these kind of cyclical, iterative dynamics at different scales of how fast or slow the kind of the churn of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3911.886,
    "end": 3917.549,
    "text": " observations and sensory states and maybe states of belief and such things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3918.109,
    "end": 3923.392,
    "text": "So there's kind of a cyclical pattern sort of in there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3923.772,
    "end": 3938.56,
    "text": "So just be curious how that cyclical pattern relates also to other types of feedback, which is maybe a bit more dynamic or just other types of feedback loops that you might think might need to be thought of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3942.13,
    "end": 3945.132,
    "text": " Yeah, I see Chris and Manuel both with Henry's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.632,
    "end": 3946.953,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3948.073,
    "end": 3948.914,
    "text": "Am I unmuted?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3948.974,
    "end": 3950.555,
    "text": "Go ahead.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3950.835,
    "end": 3956.458,
    "text": "Manuel, if you want to say something directly to the last question, then go ahead.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3958.859,
    "end": 3959.059,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3961.798,
    "end": 3964.199,
    "text": " My bad for actually not covering that before.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3964.259,
    "end": 3977.564,
    "text": "But the idea, I guess, that Dave previously brought out and now Stephen kindly reminded us about, this idea of feedback loops, there is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3979.192,
    "end": 3987.216,
    "text": " So let's say I would say that my background might be more from control theory in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3987.636,
    "end": 3997.041,
    "text": "So I do see the need of considering feedback loops because there's sort of like bread and butter in control theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3997.621,
    "end": 4004.485,
    "text": "There is also a sense, however, in which I guess usually in control theory, we draw diagrams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4005.305,
    "end": 4012.45,
    "text": " But they are kind of representations that will live there, as in, well, this is the type of system I'm dealing with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4012.97,
    "end": 4019.035,
    "text": "It is some sort of picturesque, say, view of what is actually happening out there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4019.115,
    "end": 4026.3,
    "text": "We are not doing maths on, say, the diagram that we are drawing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4028.497,
    "end": 4042.029,
    "text": " I guess what is happening with Bayesian networks and why people are so much, say, inclined to use them is the fact that I guess we can actually use Bayesian network to do calculations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4042.878,
    "end": 4056.47,
    "text": " So the work by Pearl, which we briefly mentioned in our paper, clearly not giving enough justice to the entire framework, is something that can be used on these models themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4057.13,
    "end": 4058.311,
    "text": "So in a way,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4061.169,
    "end": 4077.475,
    "text": " the directionality there the unrolling of time the idea of a narrow of time there makes all of these calculations possible it is by no means a way to say that there will be um um say",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4079.355,
    "end": 4099.58,
    "text": " system that there will be different systems necessarily different systems at different times we may still choose to group certain variables and say well this is just how i don't know the environment is evolving over time or how uh an agent is evolving over time and we might just call that environment we might just call that agent",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4100.831,
    "end": 4101.732,
    "text": " That's fine, I guess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4102.513,
    "end": 4110.822,
    "text": "But when it comes to, say, do calculations with that graph, if we just start drawing loops, then time disappears.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4111.843,
    "end": 4115.348,
    "text": "And time is what makes a lot of these calculations actually work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4117.244,
    "end": 4128.01,
    "text": " at least say what the algorithms that Daniel also mentioned with message passing on Bayesian networks, that is what makes them work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4128.13,
    "end": 4135.614,
    "text": "Clearly there are also algorithms for cyclic networks, but they are more limited.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4135.674,
    "end": 4139.897,
    "text": "They have some stronger assumptions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4140.997,
    "end": 4149.424,
    "text": " So unrolling time, I think, is not an incredibly crazy assumption or an incredibly crazy method to use there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4150.225,
    "end": 4152.246,
    "text": "It is probably something quite reasonable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4153.227,
    "end": 4159.512,
    "text": "We are still saying there's an agent that talks to an environment and an environment that talks to an agent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4159.893,
    "end": 4166.258,
    "text": "We're just trying to make that, say, interaction explicit as a process that happens over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4169.431,
    "end": 4169.811,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.491,
    "end": 4171.672,
    "text": "Stephen, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.273,
    "end": 4176.214,
    "text": "Yeah, thanks for that feedback.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4176.254,
    "end": 4193.821,
    "text": "And I suppose one thing that the question that can come up is, and I'm not sure if the pearl blankets could do this, or something that the Friston blankets gives you the possibility is, if you're dealing with entropic information and noisy kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4195.08,
    "end": 4200.288,
    "text": " data that's coming in and entropy can be like zero dimensional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4200.328,
    "end": 4203.653,
    "text": "It doesn't actually need to have a dimension and you can extract from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4204.274,
    "end": 4205.555,
    "text": "Whereas in other cases,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4207.199,
    "end": 4221.444,
    "text": " you're always working with something which is like a channel coming in, like a dimensional data source, which is somehow like saying something about the thing out there, as opposed to something which can be completely untethered from the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4221.464,
    "end": 4233.989,
    "text": "So I wonder how that idea of being able to extract Shannon entropy information might be a unique property of the Friston blanket, or whether that could be done in other ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4236.833,
    "end": 4247.279,
    "text": " um so uh i guess there are a couple of considerations there like exactly what would be extracting information from what",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4249.143,
    "end": 4271.742,
    "text": " uh because i mean this sounds a lot like the sort of like maxwell's demon type of scenario which um you know it's a well-studied field but it's also say possibly controversial in some sense because well in physics you don't need to ask certain questions you just well there's a demon and i don't and i'm not going to tell you what this demon is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4272.463,
    "end": 4274.744,
    "text": " I'm not going to tell you how he does his thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4275.004,
    "end": 4275.785,
    "text": "He just does it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4276.265,
    "end": 4278.706,
    "text": "And this is how things will happen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4281.227,
    "end": 4293.913,
    "text": "The thing about extracting information in the blanket sense, well, here I want to walk, say, a very fine line by saying that the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4295.458,
    "end": 4324.167,
    "text": " There are possibly issues with this definition of the frisson blanket, and they have been raised before, and I think Martin Beale has pointed them out in a recent paper, and Fernando Rosas has also mentioned them in his work on causal blankets as a way to fix, I would say, frisson blankets, in the sense that the information that can be extracted in those blankets",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4325.487,
    "end": 4348.31,
    "text": " is not past information it's just information at one specific time step because of this unrolling it makes calculations easier but the sort of conditional independence is not only uh in within a time step is also across time steps because of the markovian um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4349.451,
    "end": 4352.473,
    "text": " property of these processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4353.153,
    "end": 4356.055,
    "text": "And I want to make sure this is not something that I first raised.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4356.135,
    "end": 4362.899,
    "text": "This came from people like Martin Beale, Fernando Rosas, and probably in first place, Nathaniel Virgo.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4365.385,
    "end": 4368.469,
    "text": " So, and again, all the credit goes to them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4368.95,
    "end": 4373.857,
    "text": "So this idea of extracting information is really feeble for now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4373.877,
    "end": 4380.807,
    "text": "It is not something that I would actually, you know, bank on in any way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4384.172,
    "end": 4384.452,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.792,
    "end": 4407.598,
    "text": "So it's almost like it's said to be a strength of the Markov blanket or any kind of blanket concept that it's just one time slice at a time, but you don't get to have the blanket and eat it too because you can't have the through time benefits and then say that you're simplifying with something that's only reading one value at a time, though there's also probably a lot of technical details too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.018,
    "end": 4409.999,
    "text": "So Chris, then anyone else raising their hand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.917,
    "end": 4414.197,
    "text": " on you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.122,
    "end": 4418.683,
    "text": "Here we go.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4418.843,
    "end": 4419.183,
    "text": "Sorry.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4420.645,
    "end": 4422.187,
    "text": "So that was a really nice exchange.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4422.808,
    "end": 4430.457,
    "text": "And I think it also ties things back to your point about the map and the territory distinction, because",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4431.805,
    "end": 4445.014,
    "text": " One thing that we had, like, I think one of the intentions we had, at least definitely me and Joe, who unfortunately isn't here, but is very interested in these topics, is the philosophy of science behind the notion of a scientific model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4446.475,
    "end": 4457.963,
    "text": "And one thing that we have to, like, if we frame things in this way, it becomes very interesting how we understand Princeton's formalism, such as Mark of Blankets, for example, because",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4460.423,
    "end": 4467.186,
    "text": " In philosophy, there's often the distinction made between the model, the construal and the target system of the model, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4467.226,
    "end": 4471.228,
    "text": "So the target system of the model is a phenomenon we're trying to investigate in the world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4471.949,
    "end": 4478.392,
    "text": "The model itself is some kind of formal construction, usually described in some formal language.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4479.133,
    "end": 4483.515,
    "text": "And then the construal is kind of the interpretive link",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4484.423,
    "end": 4508.885,
    "text": " that connects the formal structure to the concrete real world phenomenon and one interesting thing about this is that the same formal structure the same model can be applied in different fields by different scientists successfully using different controls right and this also goes back to something that manuel mentioned before about the multiplicity of backgrounds from which people come",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4509.868,
    "end": 4512.35,
    "text": " to the free energy framework, active influence framework.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4513.171,
    "end": 4514.732,
    "text": "And it's not unproductive.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4514.772,
    "end": 4528.504,
    "text": "I mean, we have good examples in the history of science, in the history of computer science specifically, of people porting certain notions from physics specifically into computer science and making breakthroughs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4528.704,
    "end": 4534.95,
    "text": "So one very nice example of this is the so-called icing model of ferromagnetism.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4535.692,
    "end": 4558.929,
    "text": " which has been ported by william little and john hopfield into the neural network domain where they basically used the same formal structure to and gave it a different construal right to model a different a different worldly phenomenon so hopfield networks and later boltzmann networks have been very successful for example in modeling a memory",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4560.19,
    "end": 4561.731,
    "text": " at least back when they were introduced.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4561.771,
    "end": 4564.553,
    "text": "Now we have much more sophisticated models, of course.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4565.113,
    "end": 4577.841,
    "text": "But it's a nice example of this kind of cross-insemination between fields, where people can actually take a formal structure or a notion from one field and successfully make progress in a different domain.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4578.902,
    "end": 4581.123,
    "text": "But one thing that's important to keep in mind is that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4582.367,
    "end": 4592.032,
    "text": " Little or Hopfield never published their neural network model and said, look, it's a thermodynamical model of memory or something like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4592.553,
    "end": 4594.514,
    "text": "Because it's not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4594.794,
    "end": 4606.319,
    "text": "I mean, in a sense, of course it is, because the formal structure that has been mapped onto the target phenomenon is the same as in the icing model or the spin glass model.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4608.787,
    "end": 4611.108,
    "text": " The thing is, though, that the construals are very different.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4611.349,
    "end": 4614.55,
    "text": "And I think it's very useful to keep this in mind.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4614.57,
    "end": 4622.935,
    "text": "So to boil my point down, I guess, to two sentences, it can be productive doing this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4624.556,
    "end": 4635.822,
    "text": "It's just something that we really wanted to bring to the surface, that we have to be aware of the distinction between the thing in the world and the mathematical formula that we're using to describe the thing in the world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4638.775,
    "end": 4639.115,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.636,
    "end": 4641.477,
    "text": "Thanks for this summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.757,
    "end": 4652.865,
    "text": "And as people, I think, learn and read these papers, they'll see that there are these expanding levels of analysis, like the one sentence, don't confuse the map with the territory, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.866,
    "end": 4677.158,
    "text": " what you just said there it can be productive you just have to raise this discussion to the surface and then there's more and more and more to uncover um kind of like chipping away at the base of the pyramid almost and finding out what are our assumptions and okay all these people criticizing elements of free energy principle or active inference what's their preference what do they want to see or are we all on the same aspirational team",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4677.958,
    "end": 4686.724,
    "text": " in that we all want to see a collaborative formal framework that also might help us with real-world questions and also philosophical ones variously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4687.385,
    "end": 4688.926,
    "text": "Stephen, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.869,
    "end": 4695.691,
    "text": "Yeah, I think this is a really good conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4695.731,
    "end": 4705.458,
    "text": "And I think when I've heard other approaches say in the psychology fields, which are kind of looking at how people do sense-making, they often...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4706.764,
    "end": 4713.169,
    "text": " Outside of work with the pre-energy principle, it tends to be energy gradients.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4713.249,
    "end": 4722.776,
    "text": "People, you know, what's the route to least action or where do you notice the energy is lower so then you know how to act on the environment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4723.217,
    "end": 4727.34,
    "text": "And, of course, the ability to also bring in entropic factors",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4728.015,
    "end": 4736.262,
    "text": " kind of noisy statistical regularities, which you wouldn't necessarily know why they're there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4736.282,
    "end": 4739.205,
    "text": "Well, you wouldn't know why they're there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4739.265,
    "end": 4740.226,
    "text": "No one knows they're there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4740.246,
    "end": 4742.608,
    "text": "We can't even understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4742.948,
    "end": 4755.098,
    "text": "There's something quite interesting in that, and that seems to be where, to my understanding, I don't know if there's any other models that are able to integrate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4756.075,
    "end": 4770.98,
    "text": " the energy landscape with this kind of way to infer something plausibly from the entropic dynamics that are played out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4774.341,
    "end": 4774.821,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4775.181,
    "end": 4777.062,
    "text": "Lou, then anyone else with a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4780.796,
    "end": 4792.126,
    "text": " So I just to go back to what Daniel was saying about incorporating the active inference framework, do we want this really to be a framework that is concrete and definite and stable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4792.146,
    "end": 4797.21,
    "text": "Do we want to come to some kind of absolute end point here with active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.37,
    "end": 4798.932,
    "text": "Or is this something that we want to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4799.492,
    "end": 4802.034,
    "text": " constantly evolving, growing, changing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4802.094,
    "end": 4808.92,
    "text": "Do we want to try applying it in several different fields, seeing what works and what doesn't to then move on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.221,
    "end": 4817.508,
    "text": "So we have to think as we ask ourselves and as we discourage and encourage how the active inference framework is used, what do we really want as scientists?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4817.528,
    "end": 4818.889,
    "text": "I think it's important to think about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4821.411,
    "end": 4822.833,
    "text": "Great question, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.913,
    "end": 4824.154,
    "text": "Really something we could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.785,
    "end": 4854.092,
    "text": " all think a little bit about shannon than anyone else sort of um following up but a little bit tangential to what blue just mentioned um and maybe joe can be here next week that would be great um but i'm wondering if we're having sort of an emerging folk active inference um so we have a like folk psychological intuitions about the world about how other people behave science uses slightly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.588,
    "end": 4862.209,
    "text": " different, maybe more complex intuitions to describe how people perceive, interact, to describe the psychology of individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4862.969,
    "end": 4876.172,
    "text": "I'm wondering if this active inference concept is really great, how Daniel talks about how we work in teams and how we're working together to resolve our uncertainty and we're coming together in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4878.572,
    "end": 4883.853,
    "text": "This Markov-blanketed group of us, compared to everyone who will be watching this livestream later,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4884.554,
    "end": 4889.278,
    "text": " And these are fruitful to making good team dynamics and to help learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.478,
    "end": 4895.664,
    "text": "And some of us who aren't here right now are applying this to systems, to business and organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.644,
    "end": 4898.466,
    "text": "And this is super useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4898.906,
    "end": 4910.096,
    "text": "It's not the goal of the scientists perhaps, but maybe we can bring this up again next week and just talk about how that's useful and how that's sort of emerging at the same time as these formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4911.363,
    "end": 4912.463,
    "text": " Thanks, Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.563,
    "end": 4922.807,
    "text": "And I agree that the team and the project and the mission sometimes sidestep or at least ward off the philosophical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.867,
    "end": 4931.41,
    "text": "It's like, well, let's finish this project with this data set we have, get the publication or get this next checkpoint, and then we'll see where we're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.45,
    "end": 4934.991,
    "text": "We'll have a new perspective on these eternal philosophical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.451,
    "end": 4937.512,
    "text": "And so it won't be resolved in 2021, maybe not even in 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.273,
    "end": 4946.816,
    "text": " but we'll be working together and we'll be more productive and we'll have stabilized our informational niche, our financial niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.637,
    "end": 4955.761,
    "text": "Dave, then anyone else on mute?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.781,
    "end": 4966.666,
    "text": "Dave, Dave, he's still muted, but okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.072,
    "end": 4970.473,
    "text": " OK, anyone else want to add something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.755,
    "end": 4995.122,
    "text": "I was just going to say something very briefly concerning what Blue brought out, which I think is a very fair, I guess, view of a very fair perspective of the current status of people that might choose to work on active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4995.862,
    "end": 5011.895,
    "text": " there is a good cluster i guess of people from different backgrounds that have some more or less shared goal that are ready to you know engage with each other and try i guess like to create something good with each other so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5013.985,
    "end": 5040.269,
    "text": " if anything else that that's great i mean what else would you actually need to do science if not just a bunch of you know motivated people that get together and try to to work towards something all together um something that you know might have just um on the other hand pushed people away uh like at different stages in time was you know the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5042.924,
    "end": 5066.467,
    "text": " the idea of promising something that was not really there yet in a way like the nobody would blame i guess anyone for for a project that is just in the workings for something that is evolving for something that is still you know that is still not reached its final form i guess that the idea of reading you know",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5067.492,
    "end": 5082.454,
    "text": " theory a unifying theory of this a unifying theory of that is what might have you know discouraged other people from from actually engaging with it so probably some sort of balance that i think is now in place",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5084.056,
    "end": 5100.729,
    "text": " is conducive to i guess an even better research environment because i think more people can engage more people can see that there are you know constructive criticisms more people can see that you know it's not just uh you know uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5101.909,
    "end": 5127.27,
    "text": " sort of environment completely detached from from reality there is there is a sense in which you know uh improvements happen when people engage and other people listen and you know propose new stuff which you know just a scientific method that's absolutely fine that's great i think we we had some very welcoming you know uh feedback from different people like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5129.787,
    "end": 5134.828,
    "text": " regardless of what we said, which I thought is good for a healthy community.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5137.208,
    "end": 5137.868,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.849,
    "end": 5139.229,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.289,
    "end": 5146.73,
    "text": "Yeah, a mentor in writing told me that the three stages were the madman, the architect, and the interior designer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.29,
    "end": 5153.971,
    "text": "So someone has to envision there could be a skyscraper here, or there could be a stadium here, and then it has to get planned out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.551,
    "end": 5158.752,
    "text": "And interior design has to be kept in mind, but it isn't actually applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.352,
    "end": 5171.681,
    "text": " And so not that those are the stages of a scientific theory, but we're closer to the beginning and you're right that now there actually is enough to kind of take a bite out of and to build within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.701,
    "end": 5184.73,
    "text": "And then for those who think that there's like little grounding or they want to make almost hyperbolic claims about how little is known, my questions would be, first off, relative to which body of literature that's ongoing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.191,
    "end": 5186.372,
    "text": "And the second question would be,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.952,
    "end": 5189.734,
    "text": " have you read the 2007 SPM textbook?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.394,
    "end": 5199.939,
    "text": "Because that was 14 years ago and it demonstrates in a little bit like a textbook form, which is more classical than the pre-print back and forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5200.56,
    "end": 5201.92,
    "text": "That's a lot of the basis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.581,
    "end": 5215.028,
    "text": "And so there isn't any philosophy in that textbook, but you'll find a lot of new approaches for thinking about cause and effect and dynamic systems modeling and what we can do with neuroimaging and behavioral data and heterogeneous data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.871,
    "end": 5217.352,
    "text": " So awesome points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.353,
    "end": 5221.174,
    "text": "Dave, if you want to unmute and try again, and then Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5224.917,
    "end": 5227.398,
    "text": "I'm not sure why you're still muted, Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.058,
    "end": 5228.539,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.659,
    "end": 5229.059,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.16,
    "end": 5230.32,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.0,
    "end": 5231.921,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5232.241,
    "end": 5245.309,
    "text": "One of the really crucial benefits of doing the deconflation that you are correctly insisting on is that the real essence of what's in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5247.125,
    "end": 5258.691,
    "text": " scientific thinking or technical thinking or skill development is the analogies among different realms of thought, realms of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5259.151,
    "end": 5275.079,
    "text": "If you conflate entropy with the universal tendency, you don't see, you can't think about the actual differentiations of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5276.129,
    "end": 5305.201,
    "text": " instruments that that measure entropy um cosmological ideas that discuss and structure are thinking about a different realm of activity and you certainly aren't going to see the analogy between those analogies but once you start pulling stuff apart then you can start doing mapping in detail and find what applications you can relate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5305.774,
    "end": 5331.689,
    "text": " through the instrumental or realistic interpretation of any of these meta concepts you can start listing tables of correspondences you can make uh gedanken experiment and you can make literally lab tests and draw out paradoxes where the prediction from one wing of the metaphor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5332.358,
    "end": 5337.319,
    "text": " looks like it ought to align with the results in another wing and don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5337.719,
    "end": 5341.78,
    "text": "At that point, now you can start thinking about what it is that we don't know yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5342.02,
    "end": 5347.982,
    "text": "So yeah, yeah, keep ripping the stuff apart when it's been conflated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5348.482,
    "end": 5354.183,
    "text": "Phlogiston modeled a lot of real stuff and it was also harmful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5354.743,
    "end": 5357.724,
    "text": "The notion that things fall because they belong down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5358.124,
    "end": 5359.424,
    "text": "That predicted a lot of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5359.504,
    "end": 5361.945,
    "text": "It modeled a lot of stuff and it interfered",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5362.6,
    "end": 5366.183,
    "text": " with work that needed to be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5366.583,
    "end": 5366.903,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.924,
    "end": 5368.504,
    "text": "Thanks, Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.905,
    "end": 5369.465,
    "text": "Nice points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.206,
    "end": 5370.426,
    "text": "Lou?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.207,
    "end": 5378.452,
    "text": "This is great because it just ties in everything that Dave said, but I really wanted to respond to Manuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5379.692,
    "end": 5386.858,
    "text": "I don't necessarily have a perspective on whether we want active inference to be something solid and concrete like a law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5387.558,
    "end": 5389.698,
    "text": " or something that's continually growing and evolving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5389.798,
    "end": 5394.819,
    "text": "And so I just pose it as a question, like where do we really want it to end?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5395.859,
    "end": 5401.0,
    "text": "I think that just like Dave said, there's always like we had the laws of physics, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.04,
    "end": 5406.761,
    "text": "Like Newtonian physics, we had all of these laws, they were in place, they worked for a long time and then quantum, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5406.821,
    "end": 5410.102,
    "text": "So, I mean, we don't know what is gonna be underneath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5410.822,
    "end": 5415.823,
    "text": "When we finally define an absolute, there could be another layer that we just aren't seeing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5416.383,
    "end": 5424.569,
    "text": " So I think that, you know, just like Newtonian physics and quantum physics, we need to look at where the context is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.01,
    "end": 5425.19,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.25,
    "end": 5436.618,
    "text": "And so there might be an active inference, a contextual barrier that we can say, you know, active inference is this version of active inference is applicable in this context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5437.059,
    "end": 5441.162,
    "text": "And there might be some other deeper, different version that applies in other contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5444.977,
    "end": 5445.217,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.818,
    "end": 5453.022,
    "text": "And I think that's partly how the specific projects and deliverables and questions are what ground us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.222,
    "end": 5455.163,
    "text": "Like with Dave's example about entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5455.663,
    "end": 5460.046,
    "text": "Yeah, you can probably abstract entropy and start applying it to different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.086,
    "end": 5463.628,
    "text": "And what would psychological entropy, what would spiritual entropy be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.349,
    "end": 5471.353,
    "text": "Or you might be concerned with the car that you're building and you're like, okay, I have a preference for the more miles per gallon and whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.713,
    "end": 5494.711,
    "text": " less of this other emission and then entropy in an applied context is being pursued instrumentally with literal instruments and scientists are not just all-purpose thinkers when the scientist hat is on we're instrumentalists and actually that makes me curious yellow about one of your other papers the anticipating brain is not a scientist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.572,
    "end": 5522.304,
    "text": " so what was that about because the part in this paper about how the cognitive scientist is in a unique position as the meta modeler reminded me a lot of this line of research so maybe could you summarize that or what was that paper about and how has that been developed in what you're exploring now oh great yep um so yeah i think and i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5523.567,
    "end": 5526.468,
    "text": " Can you hear me?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5528.509,
    "end": 5535.612,
    "text": "I only now realize that they use the scientist metaphor in both this paper and in the old one.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5537.332,
    "end": 5546.476,
    "text": "And I think here it's very clear to distinguish between models and models of models and animals models and scientist models.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5546.536,
    "end": 5548.217,
    "text": "And they have different kind of properties.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5550.484,
    "end": 5574.049,
    "text": " in in in the anticipating brain paper um we make the same uh uh distinction between a scientist model of the environment and an animal's model of the environment and there the distinction is more in terms of what are the the aims so to say of the model and where you might say well in the epistemic practice of science then the aim of the scientist model is to get an as accurate",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5574.969,
    "end": 5602.271,
    "text": " representation or inference or whatever from the outside world as possible so it's kind of a more epistemic process in which the ultimate aim is to to figure out something about the world and now transposing that question to the uh to the animal the problem is a different one it's not like the problem what's out there in the world is secondary to how can i make what's out there in a world compatible with",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5603.032,
    "end": 5606.034,
    "text": " the kind of existence that I am having or am.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5606.874,
    "end": 5612.998,
    "text": "And so there the epistemic story stands in the surface of something like flourishing or staying alive or homeostasis or so.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5613.058,
    "end": 5620.062,
    "text": "And there might be cases where actually, and I think this is also related to the kind of the theory of action that's there, like where",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5621.94,
    "end": 5631.382,
    "text": " inferring what's the exact state of the world is not actually the right thing to do, but changing the world so as to make it conform to your expectations is a better way to do that.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5631.442,
    "end": 5643.124,
    "text": "So the kind of the epistemic aims in both settings, the scientist setting and the animal in his environment setting are, or the scientists in his everyday life setting are slightly different.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5643.204,
    "end": 5646.185,
    "text": "And so that was also to counter the kind of",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5647.159,
    "end": 5660.805,
    "text": " they're very prevalent kind of Helmholtzian models of perception that are there in the free energy literature and the processing literature, where you say like, well, first and foremost, the problem for an agent or any agent is to infer what's out there in the world.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5661.065,
    "end": 5664.147,
    "text": "And I think FEP shows like, no, that's a secondary problem.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5664.207,
    "end": 5666.008,
    "text": "The first problem is staying alive.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5669.898,
    "end": 5670.478,
    "text": " Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.858,
    "end": 5675.8,
    "text": "And that's so funny because what do they say in legacy science, publish or perish?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.601,
    "end": 5680.742,
    "text": "So it's also not thrive and communicate and mentor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5681.123,
    "end": 5684.504,
    "text": "It's actually still phrased in a life or death way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.524,
    "end": 5688.125,
    "text": "It might be a naive way of understanding science in me.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5688.145,
    "end": 5689.086,
    "text": "That might be true.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5690.126,
    "end": 5690.366,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.807,
    "end": 5694.168,
    "text": "Alliteration plus competition, just irresistible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.47,
    "end": 5697.251,
    "text": " Any other thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5697.291,
    "end": 5707.039,
    "text": "Otherwise, there's a couple other points that would be awesome to kind of just in the last 20 minutes open up and then I'll re-upload this full video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.459,
    "end": 5710.522,
    "text": "We can all think about some questions that we're having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5711.262,
    "end": 5721.89,
    "text": "I guess one distinction that is clearly key from where you placed it in the paper and the emphasis and everything is inference with versus inference within a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5722.951,
    "end": 5730.917,
    "text": " And this is going to sound like a subtlety because it's two letters that you're appending to the word, but they're two letters that make a big difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5731.397,
    "end": 5735.14,
    "text": "So what would be sort of the map territory distinction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.92,
    "end": 5738.983,
    "text": "How do we think about inference with and within a model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5739.063,
    "end": 5743.065,
    "text": "How do we speak clearly about different things that are happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5749.23,
    "end": 5750.611,
    "text": "Who's going to take that one?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5753.252,
    "end": 5766.259,
    "text": " I think I insisted on keeping in this distinction throughout all phases of the co-writing process, so I guess I'm responsible for now also explaining it coherently.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5769.121,
    "end": 5774.184,
    "text": "I think the key distinction there is to draw the distinction between a kind of",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5776.064,
    "end": 5786.451,
    "text": " everyday way of understanding modeling of saying, well, a model can be used by something external to the model to model something that's even external to that, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5786.491,
    "end": 5789.553,
    "text": "So I guess perhaps the notion of construal might actually also be something, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5789.594,
    "end": 5803.023,
    "text": "There is a scientist or there is a practice or so that construes and relates a model to some target phenomenon so that you can do a predictive analysis or whatsoever.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5804.057,
    "end": 5827.288,
    "text": " uh and i think that's our everyday way of thinking about scientific inference um and then especially in the in the live as we know it papers of the first in 2013 uh a paper something quite different is is is happening right so so in most of the particular processing literature this distinction is not really made made explicit but in 2013 that analysis is is",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5828.77,
    "end": 5854.854,
    "text": " not making clear how an agent or an animal can use a model to do something but shows makes a model and shows how somehow within that model a demarcation between agent and environment starts to emerge and because of the demarcation an inferential relationship between agent and environment starts to emerge so there's now there's not there's not a user of that model but somehow",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5855.569,
    "end": 5859.951,
    "text": " Within a model, an inferential relationship starts to emerge.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5860.191,
    "end": 5863.392,
    "text": "And so that's why we call it inference within a model.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5863.613,
    "end": 5865.273,
    "text": "The emergence of the inference is within that model.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5865.774,
    "end": 5871.756,
    "text": "And the other one is something outside of the model is using the model to predict something or something.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5871.836,
    "end": 5873.297,
    "text": "That's supposed to be this distinction.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5873.537,
    "end": 5882.241,
    "text": "Maybe we think about a better, a clearer semantic separation between those two concepts that should be a part.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 5884.825,
    "end": 5900.774,
    "text": " in the four different kinds of, I guess, I wanna say processes, but the four different ways in which inference is sometimes deployed to be talking about generative processes and generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.814,
    "end": 5907.198,
    "text": "The generative process is what actually the air moving through the house and the temperature as it's actually changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.698,
    "end": 5910.62,
    "text": "And then the generative model, the predictive thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5911.46,
    "end": 5932.374,
    "text": " And there's other work that I know some of you have done about connecting systems that are probably less than lifelike and realizing that we can frame them in a cybernetic context using these same constructs, which is really an argument by demonstration almost about the philosophical points that you're trying to show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.268,
    "end": 5939.171,
    "text": " It's like if somebody were making big claims about cybernetic systems, and then someone said, oh, but it applies to a thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5939.571,
    "end": 5947.796,
    "text": "So either you need to pull back your claims a little bit, or it's fine if you think thermometers have this attribute, like regret, that you're going to be studying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5948.216,
    "end": 5955.6,
    "text": "But you don't get to say that the thermometer is, of course, insentient, yet it's doing what you say is granting us sentience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5956.465,
    "end": 5962.413,
    "text": " And these kinds of distinctions are not within Active Inference proper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.813,
    "end": 5974.267,
    "text": "It's actually just about clarifying research directions and learning about how we work on these projects that go beyond the understanding of one person, because there are a lot of technical elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.814,
    "end": 5995.687,
    "text": " remind us of that earlier thread, which is how are we all going to be learning about this and working within it and communicating within it when one could go deep into variational inference, but I'm not going to be the one to find that there's some deep quirk or assumption in variational inference that invalidates some other technical piece of the puzzle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5996.447,
    "end": 6003.012,
    "text": "So how do we almost, kind of like the doors in the Titanic, separate different parts of our model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6003.852,
    "end": 6022.678,
    "text": " so that we at least know if one of them is going to be unsupported at this moment or is apt to even fail, that there isn't a cascading failure for our actual direction, but rather there's something that's modular that could be pulled out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.999,
    "end": 6031.481,
    "text": "Yeah, I think there's lots of things about the free energy principle that are actually pretty trivial.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6032.361,
    "end": 6036.923,
    "text": " and lots of things that are actually pretty speculative and high stakes.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6037.764,
    "end": 6057.994,
    "text": "And indeed, having some of the demarcation that we make in our paper, I guess, allows you to separate some empirical methods that are useful and kind of non-controversial and separate it indeed from what we call BOO, the kind of blanket-oriented ontology, which is",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6060.905,
    "end": 6075.693,
    "text": " Big ID, which we are kind of skeptical about, at least I am, I'm not sure I speak for all the co-authors, but at least it has a different epistemic status than the everyday bread and butter active inference that people are using.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6076.173,
    "end": 6077.834,
    "text": "And so separating those out a little bit,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6078.874,
    "end": 6092.499,
    "text": " using the different concepts and different assumptions that are made by each approach probably also gives a better overview of the field and the things you need to buy into and don't necessarily need to buy into if you want to work with it.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6096.501,
    "end": 6096.801,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6097.521,
    "end": 6101.143,
    "text": "Dave, then anyone else raising their hand?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6101.163,
    "end": 6106.685,
    "text": "Yeah, I'm going to ask a question not about status,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6107.426,
    "end": 6120.832,
    "text": " or stature or number of papers, what influence has the personality of Carl Friston had on the development of these fields?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6127.055,
    "end": 6131.617,
    "text": "I want to go and break another lance in his favor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6134.594,
    "end": 6144.657,
    "text": " I haven't worked directly with Carl unless on really small projects, but he's just an extremely nice and kind person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6145.617,
    "end": 6146.998,
    "text": "I think it is as simple as that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6147.218,
    "end": 6151.999,
    "text": "It is really hard not to get along with him on some level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6152.679,
    "end": 6164.063,
    "text": "So, I mean, I want to be positive in a sense to say that it is really hard not to want to work with such a nice person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6166.503,
    "end": 6177.952,
    "text": " If we want to talk about that, trying to stay away from his influence and his status across fields, he's just an incredibly nice person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6178.713,
    "end": 6191.623,
    "text": "And even if sometimes there are some misunderstandings in communications, there is, I don't know, there is a sense in which you feel like you want to work with that person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6194.568,
    "end": 6202.236,
    "text": " I agree, and also beyond niceness, it is reflected through action and mentorship and collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.916,
    "end": 6203.957,
    "text": "But also it's, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6204.218,
    "end": 6205.559,
    "text": "Jelle, and anyone else as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.74,
    "end": 6209.443,
    "text": "Yeah, no, I can only second that.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6209.523,
    "end": 6214.327,
    "text": "I spent some time at UCL in this group.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6217.269,
    "end": 6240.338,
    "text": " uh for for for outsiders and for brandings so you might think sometimes that that carl is able to speak a bit uh too well right so listening to him if you don't really understand what he's saying it sounds it sounds enigmatic it sounds it sounds fascinating and it sounds it is but it also sounds incredibly clever right and so um",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6242.133,
    "end": 6243.714,
    "text": " I guess in terms of branding, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6243.734,
    "end": 6258.803,
    "text": "I mean, what we see a lot now is that there is a kind of circle of people who really understand the stuff that's going on and a group of people who are also put off by it a little bit because it seems so intimidating from the outside.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6259.203,
    "end": 6262.365,
    "text": "And I think that's something that FTP as a whole",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6263.041,
    "end": 6274.048,
    "text": " kind of struggles with a little bit, that it might seem a little bit esoteric if you're not familiar with the key works or haven't worked on that for a while.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6275.229,
    "end": 6281.432,
    "text": "And I think that that's partly sparkled by just these kind of fantastic lectures that Carl is able to give.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6281.633,
    "end": 6282.793,
    "text": "They're all over YouTube.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6283.574,
    "end": 6286.636,
    "text": "And they're hard to get on the first go.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6286.656,
    "end": 6287.116,
    "text": "Yeah.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 6289.582,
    "end": 6304.533,
    "text": " And it's also notable that the 2013 single author paper, Life As We Know It, it serves as a lightning rod for Lotta Critique, as does his 2010 paper, Unified Brain Theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6305.493,
    "end": 6310.957,
    "text": "And they're both, I hesitate to call them old because they're less than, you know, a decade old in some cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6310.997,
    "end": 6315.78,
    "text": "But in terms of our current environment, there's been a lot between then and now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6316.541,
    "end": 6318.002,
    "text": "And also they're single author.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6318.482,
    "end": 6318.903,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6320.552,
    "end": 6341.097,
    "text": " let him speak and represent what he wants to share just like every author and collaboration and then there's a ton of nuance and a lot of development that's happened and i totally also resonate with the um criticism that many raise or at least the point that it is a rapidly developing field so it's like oh active inference can't deal with long time steps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.497,
    "end": 6364.313,
    "text": " aha but then have you thought about sophisticated active inference and so it does become a little bit of this sort of like criticism development criticism development which actually reminds me of daniel dennett's book darwin's dangerous idea and he says evolution by natural selection is the theory that's describing itself because it is improving itself and someone says well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6364.853,
    "end": 6386.546,
    "text": " evolution doesn't include ecology or development or evolution okay well then we make eco evo and then we go from there and so there's sort of um a little bit of a blurriness between who's the detractor and who's actually out in front pulling theory where it needs to be and that's also where cognitive diversity comes into play and just we're all seeing cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6405.899,
    "end": 6407.18,
    "text": " blue, and then anyone else.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6410.461,
    "end": 6420.825,
    "text": "So just to kind of piggyback off of what you said, I always think, you know, especially in our culture, we have like this idea that there's a leader or a creator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6420.845,
    "end": 6423.826,
    "text": "And in this situation, it's Carl Friston, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6423.886,
    "end": 6427.888,
    "text": "So is there a leader or a creator of the field?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6428.048,
    "end": 6430.269,
    "text": "Or has it become it's single handedly?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6448.365,
    "end": 6472.852,
    "text": " invented a light bulb that's not how it happened but but we you know we kind of think this way and we've kind of placed first in in the leadership role here but but really i think that there's a lot going on underneath the curtains or underneath the blankets right i agree and it's it's a meta problem with science communication like the 2018 wired article which the title be a singular person",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6490.381,
    "end": 6492.884,
    "text": " and about something about their endocortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6493.404,
    "end": 6505.9,
    "text": "Not this dedicated researcher has built a network and tools for 30 years that are inspiring the next generation of researchers to make impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6506.923,
    "end": 6509.244,
    "text": " doesn't fit quite as well in the headline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6509.744,
    "end": 6518.429,
    "text": "And so it's like a communication and a meta communication question, communicating about how these fields actually work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6519.149,
    "end": 6523.011,
    "text": "And yeah, there's gonna be a lot of interesting times ahead on those frontiers, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6525.29,
    "end": 6526.851,
    "text": " Any sort of closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6526.911,
    "end": 6538.756,
    "text": "Or maybe we could go around and just give a last little thought or something that we're excited or curious about for next week's discussion when I'll fix it and we'll be able to include participants live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6540.857,
    "end": 6543.218,
    "text": "Also, thanks, Manuel, for staying up late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.238,
    "end": 6550.441,
    "text": "We'll have Martin Beal on April 28th, and that will be at a better time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6550.761,
    "end": 6552.382,
    "text": "I think it's two hours earlier than this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6552.542,
    "end": 6554.683,
    "text": "So, Stephen, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6556.465,
    "end": 6570.516,
    "text": " yeah i'd just like to thank you for a really you know powerful presentation and answering a lot of difficult questions and also i suppose what i'll take away is this question about the blanket orientated ontology i think it's really good to have that",
    "speaker": "SPEAKER_04"
  }
]