[
  {
    "start": 8.749,
    "end": 11.291,
    "text": " Hello and welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.731,
    "end": 21.297,
    "text": "Today it is October 25th, 2021, and we are here in Active Guest Stream number 12.1 with Martin Boots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.778,
    "end": 24.92,
    "text": "So this is going to be an awesome presentation and discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.4,
    "end": 31.244,
    "text": "If you're watching live, please feel free to add any questions into the live chat and we'll be compiling those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.044,
    "end": 36.666,
    "text": " And otherwise, we're just going to have a presentation and then discussion interval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.706,
    "end": 40.707,
    "text": "So Martin, thanks so much for joining our lab to give this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.927,
    "end": 42.767,
    "text": "And we're really looking forward to what you have to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.868,
    "end": 50.71,
    "text": "Yeah, a big pleasure to be here tonight or this morning, I guess, for you guys in California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.827,
    "end": 58.009,
    "text": " So let's see if I get the screen sharing here right again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.069,
    "end": 59.549,
    "text": "We practiced it before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.569,
    "end": 61.79,
    "text": "This should be this one here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.931,
    "end": 63.471,
    "text": "Looks great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.251,
    "end": 68.493,
    "text": "And now I just need to have at least one video on the side here for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.193,
    "end": 77.056,
    "text": "So yeah, big pleasure to present our lab's work on which I call event predictive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.771,
    "end": 86.518,
    "text": " active inference and particularly also modeling the development of conceptual compositional cognition from sensory motor experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.338,
    "end": 96.425,
    "text": "You might have already kind of noticed the picture here, this artistic picture on the top right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.465,
    "end": 103.11,
    "text": "And I think it shows nicely and intuitively how our brain continuously seems to attempt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.033,
    "end": 127.064,
    "text": " to infer the hidden causes behind our sensory perceptions and thus this kind of terrace is kind of bent for us a little bit because the top part of course just can be interpreted in two ways and is obviously not quite rightly positioned or or yeah it cannot be like this in reality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.947,
    "end": 147.752,
    "text": " I give you a couple of other examples what I mean by this active inference, which is known to or explained often by Carl Fristen and others to essentially develop latent hidden states to explain away the sensory perceptions by inferring the hidden causes behind them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.372,
    "end": 153.713,
    "text": "So here you see a color illustration, which is called a color illusion sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.301,
    "end": 156.343,
    "text": " where you probably won't believe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.423,
    "end": 160.526,
    "text": "I have to measure it each time again to make sure that I'm really right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.606,
    "end": 170.593,
    "text": "But essentially, in this yellow-tinted figure, essentially, these blue-colored squares here, they are essentially grayscale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.654,
    "end": 178.119,
    "text": "If you test them in the graphics program, you will see that this is a grayscale position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.139,
    "end": 180.661,
    "text": "So all blue points here are, in fact, grayscale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.781,
    "end": 183.123,
    "text": "And here on this side with the blue-tinted background,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.527,
    "end": 189.268,
    "text": " you essentially have the same situation, but it's the yellow pieces that are actually grayscale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.308,
    "end": 191.309,
    "text": "This is illustrated here on the right a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.989,
    "end": 204.652,
    "text": "And this just shows essentially that our brain is interpreting its sensory perceptions in the light, more analogically fitting here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.059,
    "end": 228.964,
    "text": " of the circumstances yeah and in this case yellow light makes a true blue square appear gray when we look at it so we perceive it gray the sensory stimulation is gray but the true cause behind it must be a blue square so i our brain essentially correctly and actively infers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.585,
    "end": 234.548,
    "text": " that this square is most likely blue because under this yellow light conditions, it appears gray.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.748,
    "end": 235.888,
    "text": "And we're not even aware of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.429,
    "end": 255.318,
    "text": "So this is a lovely example of a very low level inference process in our brain that takes into account the situation and essentially puts the perceptual sensory information in this event, this light event, this lightning condition, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.303,
    "end": 265.687,
    "text": " Another nice example of this is these shadows that I found here online from some artistic exhibition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.187,
    "end": 267.788,
    "text": "And you have here two shadows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.868,
    "end": 275.752,
    "text": "And as long as you look at the shadows and you perceive the shadows, you kind of not only perceive the shadows, but you perceive a person and the illustration of a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.792,
    "end": 283.615,
    "text": "And to a certain extent, you have the feeling that some person must be standing here somewhere such that I will perceive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.346,
    "end": 285.767,
    "text": " these shadows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.867,
    "end": 289.428,
    "text": "But lo and behold, this situation is totally different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.868,
    "end": 295.25,
    "text": "These are actually cool artistic sculptures that produce the shadows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.351,
    "end": 312.577,
    "text": "And again, you see that you have perceived the shadow and interpreted not only the shadow, but created a whole scene, a whole event, like with a light source and the person in the middle, and then the shadow that produces this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.952,
    "end": 315.414,
    "text": " in order to make sense of the shadow itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.674,
    "end": 319.217,
    "text": "So again, you infer the hidden causes behind the shadow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.577,
    "end": 339.231,
    "text": "In this case, not quite correctly, because it's a cool artistic sculpture here that is an installation with a light source perfectly positioned such that the sculpture creates a particular human-like shadow figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.941,
    "end": 364.653,
    "text": " So the first proposition that I take out of this essentially that our brain seems to be this generative predictive model and uses active inference essentially with this generative predictive model, generating or inferring internal activities that is internal active encodings that try to explain away the current sensory perceptions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.063,
    "end": 375.768,
    "text": " and thus make sense of it in the sense that we explain them away by ideally inferring the true hidden causes behind the perceptions that we actually perceive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.048,
    "end": 388.113,
    "text": "This generative predictive model that explains away perceptions, it maintains distributed predictive activities which form this kind of attractors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.775,
    "end": 415.734,
    "text": " which often then are formalized, particularly by Carl Fristen and his followers, so to say, and in various ways, formalizing this and essentially suggesting that the brain develops this local free energy minima, this local attractor-like minima that is the consistent explanation of a particular perception that we currently have under consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.681,
    "end": 419.563,
    "text": " So this would be, for example, in the shadow situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.363,
    "end": 427.008,
    "text": "We perceive the shadow, but we know intuitively that there's a light source and something in between that produces a shadow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.108,
    "end": 434.193,
    "text": "And thus, in the shadow of a person, we essentially immediately have the feeling that some person must be standing there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.253,
    "end": 443.799,
    "text": "The free energy formalism essentially pushes towards the generation of these generative predictive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.372,
    "end": 453.157,
    "text": " and pushes towards the continuous active inference processes that are unfolding within these developing generative predictive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.698,
    "end": 460.041,
    "text": "And one can nicely distinguish three kind of aspects of this general inference process formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.082,
    "end": 464.584,
    "text": "And that is on the one hand side, on the first hand side, knowing what is going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.724,
    "end": 470.608,
    "text": "So that's essentially the fast adaptation of internal model activities towards this local free energy minima.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.286,
    "end": 473.606,
    "text": " to explain to ourselves what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.766,
    "end": 487.189,
    "text": "So if you looked all together at the shadow, and we perceived the shadow, then you perceived not only the shadow, but you had the feeling that you inferred the causes that there is a person in the light source that creates the shadow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.109,
    "end": 491.45,
    "text": "Then the second part is learning more about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.65,
    "end": 493.99,
    "text": "We can revise our generative predictive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.05,
    "end": 497.271,
    "text": "For example, you have now revised your predictive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.859,
    "end": 505.78,
    "text": " learning about that there are some cool people that make sculptures that produce human-like shadows, and there's no human, actually, but just a sculpture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.42,
    "end": 509.181,
    "text": "And so we have learned something new about the world, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.681,
    "end": 519.083,
    "text": "And we do the first two aspects of inference aspects, essentially, of course, only to really survive in our world, to live, to interact with our world in better manners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.643,
    "end": 527.184,
    "text": "So to really pursue our goals and our knowledge-driven behavior, our epistemic behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 528.463,
    "end": 532.386,
    "text": " by the means of these developing generative predictive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.467,
    "end": 535.128,
    "text": "Let me explain it a little bit further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.869,
    "end": 537.81,
    "text": "So it's clear how I mean this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.851,
    "end": 554.103,
    "text": "So essentially also implied by the generative, by the free energy formalism and the active inference formalism, one can say that our brain is continuously on the one hand side in the present for sure, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.203,
    "end": 557.246,
    "text": "I mean, we are ready while we, for example, write a letter here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.779,
    "end": 565.827,
    "text": " We are ready to produce the next word and write it out on paper, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.447,
    "end": 573.894,
    "text": "We consider the recent past while doing this to be really in the present and fully embodied and grounded in the here and now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.7,
    "end": 601.988,
    "text": " is also continuously updated by our sensory feedback while we interact with environments or example we might update our belief how sturdy the pencil is or how hard it is and things like this and we learn about our world while we interact with it such as improving our writing skills and so forth but most importantly we use this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.171,
    "end": 624.334,
    "text": " presentation of the presence and the belief where we are in essentially to predict the future what is going to happen if you like this future considerations and then essentially to pursue particular future desired situations such as finalizing writing this letter writing this word",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.246,
    "end": 633.711,
    "text": " producing a letter for another person and having overall purposes, also other purposes, of course, for the current day and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.771,
    "end": 648.182,
    "text": "And these considerations, depending on our focus and the difference between the desired future considerations and the current expected future considerations, make us improve our behavior and act in a goal-directed manner with the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.46,
    "end": 669.31,
    "text": " One can illustrate this in a different way by essentially saying, well, the active inference framework essentially suggests that we are continuously in a predictive state of mind, ready to process the next sensory information, doing information integration there, producing local posteriors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.909,
    "end": 692.297,
    "text": " integrating this local posteriors this perception with our overall beliefs in our model so perceiving the shadow inferring that there's probably a person in light source that produces a shadow integrating an overall consistent in attempting to create an overall consistent a posteriori predictive state of mind and we use this state of mind essentially to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.769,
    "end": 715.938,
    "text": " roll out future considerations, including habitable behavior with our environment, test if we like this, if we want to go there, or if we want to pursue particularly other states in the future, choose the best one we can do, execute it, and then close the loop by using the reference copy to do the temporal prediction in the here and now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.822,
    "end": 736.61,
    "text": " Epistemic goal-directed behavior can essentially be formalized nicely in this reasonably short equation still to generate goal-directed epistemic behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.05,
    "end": 741.772,
    "text": "This comes from Friston and Pizzullo's and Al's work in 2015, which essentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.041,
    "end": 749.945,
    "text": " I think it's a very nicely formalized intuitive equation here, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.985,
    "end": 761.896,
    "text": "So let's see, we're pursuing the minimization of free energy under a particular policy pi at a certain state t. And pursuing this free energy consists of two components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.056,
    "end": 767.782,
    "text": "The first component is essentially the goal-directed component in this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.842,
    "end": 771.105,
    "text": "It's essentially trying to minimize the difference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.761,
    "end": 785.97,
    "text": " between the observations that I expect to perceive when I pursue a particular policy pi, so a particular behavior pi, and compared to the observations that I would like to perceive under my internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.61,
    "end": 791.653,
    "text": "So this is essentially the expected divergence from desired future states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 792.254,
    "end": 798.938,
    "text": "And I try to then, of course, infer a policy pi, so behavior pi, that minimizes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.414,
    "end": 805.057,
    "text": " the divergence from the expected future states to the desired future states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.997,
    "end": 810.6,
    "text": "And the other component in this equation is the epistemic part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.62,
    "end": 815.882,
    "text": "It's essentially the minimization, the attempt to minimize expected future uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.643,
    "end": 821.065,
    "text": "So it's the expectation of over my future horizon tau.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.505,
    "end": 824.547,
    "text": "That's my timeline into the future, as you see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.745,
    "end": 832.409,
    "text": " And it's essentially the expectation of future uncertainty, which I try to minimize as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.429,
    "end": 839.714,
    "text": "So under my consideration of my policy pi, I expect future internal states m tau.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.134,
    "end": 844.717,
    "text": "And these m taus under the policy lead to the expectation of future observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.797,
    "end": 848.599,
    "text": "And then certainty of these observations or the observation densities, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.38,
    "end": 852.901,
    "text": "So the entropy over that, the more uncertain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.417,
    "end": 861.859,
    "text": " the more diffuse my expectation, the more uncertain my expectation, the less I like these future considerations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.999,
    "end": 871.821,
    "text": "And out of these two components in the equation, one can essentially derive agents that act in goal-directed and epistemic manners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.241,
    "end": 877.522,
    "text": "We have implemented such agents mainly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.956,
    "end": 901.171,
    "text": " partially as rather still rather crude approximations simply with recurrent neural network structures here, for example, this rocket ball agent that was is controlled by a neural network on the fly, essentially by first training the network to learn the sensory motor model of this agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.191,
    "end": 905.374,
    "text": "So this agent undergoes gravity and has inertia in the simulation in 2D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.428,
    "end": 911.754,
    "text": " and has these two thrusts that go diagonally downwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.175,
    "end": 916.64,
    "text": "So it can counteract gravity and steer, as you see, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.221,
    "end": 926.692,
    "text": "And the red line that you see here is essentially the imagination of the neural network where it expects to fly to over the next couple of steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.461,
    "end": 933.326,
    "text": " So essentially the system rolls out, as I illustrated before, essentially into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.426,
    "end": 942.614,
    "text": "It's sensory motor dynamics, expected sensory motor dynamics, under expected motor control commands that it imagines executing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.594,
    "end": 951.581,
    "text": "And it then compares this, the resulting state with the desired state can take the K divergence or simply the Delta if it's deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.908,
    "end": 956.851,
    "text": " and use that data to project it back onto the motor commands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.111,
    "end": 963.715,
    "text": "So that's the system essentially acts in its own best interest to pursue these goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.775,
    "end": 966.757,
    "text": "The goals are given from the outside in this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.177,
    "end": 977.603,
    "text": "So this is still a rather simple system in the sense that it's not probabilistic really, or tries to minimize uncertainty here, but just pursues goal directed behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.024,
    "end": 981.726,
    "text": "We have also done this with various other systems, for example, multi-joint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.601,
    "end": 995.086,
    "text": " Um, um, that, uh, additionally has the constraint to avoid collisions, which are signaled by this hair sensors, as you see here, and you can also get quite some cool behavior, very similar principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.026,
    "end": 1000.628,
    "text": "And so to conclude the first part right now, I hope you have understood the active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.28,
    "end": 1026.575,
    "text": " component and active inference is about essentially also suggesting implicitly that our mind is not only about knowing what is going on it also continuously learns about the world retrospectively so it's partially also in the past in some sense in its activity state and in the future considering um and inferring goal directed epistemic behavior however um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.189,
    "end": 1037.714,
    "text": " This is certainly good and we can generate closed loop control systems in this manner, which are closely related to model predictive control for that matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.735,
    "end": 1053.662,
    "text": "But in order to really become event predictive or more abstract in our scene right now, essentially you have seen a system that only is just writing something or is controlling a flying trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.743,
    "end": 1056.244,
    "text": "It's not really able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.348,
    "end": 1060.812,
    "text": " decide to write a whole letter, right, in the sense, right, abstractly speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.832,
    "end": 1066.197,
    "text": "So it's not able to abstract away from the actual current behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.858,
    "end": 1072.844,
    "text": "So the question is, where do these event predictive structures that I was talking about come in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.285,
    "end": 1075.107,
    "text": "And that leads me to my second proposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.227,
    "end": 1079.011,
    "text": "It's essentially that it appears to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.969,
    "end": 1088.085,
    "text": " that due to evolutionary shaped inductive processing biases, our brain develops event predictive compositional structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.766,
    "end": 1093.288,
    "text": " These structures tend to model the hidden causes behind sensory perceptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.628,
    "end": 1095.109,
    "text": "I've already intuitively seen it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.609,
    "end": 1099.831,
    "text": "I want to illustrate this further with an actual model behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.871,
    "end": 1105.993,
    "text": "But before I do so, let me characterize where this proposition essentially comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.293,
    "end": 1113.276,
    "text": "Where does this belief that event predictive structures are the right way to go, are the right way to abstract forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.886,
    "end": 1118.213,
    "text": " And it comes from the psychological literature, mainly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.433,
    "end": 1127.847,
    "text": "And I start with a quotation here from Jeff Sachs and Barbara Tversky from 2001, which essentially reads, OK, event is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.296,
    "end": 1135.818,
    "text": " events have been characterized as a segment of time at a given location that is conceived by an observer to have a beginning and an end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.678,
    "end": 1151.761,
    "text": "And their behavioral psychological work essentially suggested that when you have people segment movies or other little scenes or cartoons even and things like this, they do this very systematically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.801,
    "end": 1156.083,
    "text": "So they have a really clear perception when an event starts and when it ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.243,
    "end": 1157.383,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.737,
    "end": 1166.504,
    "text": " Out of this, it appears that we process our environment in terms of, we perceive our environment in terms of these events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.944,
    "end": 1172.068,
    "text": "But important is that the event is not really in the environment per se, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.088,
    "end": 1173.049,
    "text": "There's no label.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.069,
    "end": 1176.092,
    "text": "This is an event, but our brain constructs these events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.592,
    "end": 1183.438,
    "text": "And that's what Dara Baldwin lovely put into a recent special issue contribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.478,
    "end": 1186.56,
    "text": "So she says, or Baldwin and Cozy, they say, events...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.605,
    "end": 1192.226,
    "text": " The experiences we think we are having and recall having had, they are constructed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1192.246,
    "end": 1194.086,
    "text": "They are not what actually occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.386,
    "end": 1207.969,
    "text": "Because what occurs in the end is ongoing dynamic multidimensional sensory flow, which is somewhat transformed via psychological processes into structure, describable, memorable units of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.549,
    "end": 1216.871,
    "text": "So essentially, there's no label of events, but our brain creates these abstractions and these compact encodings",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.412,
    "end": 1224.374,
    "text": " of the events that we perceive that exist in our environment, but we construct them essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.414,
    "end": 1227.675,
    "text": "They are not really existing on their own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.996,
    "end": 1236.298,
    "text": "And over the last years, a lot of research has focused on this event predictive cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.338,
    "end": 1244.28,
    "text": "And this research essentially investigates how events and conceptualizations thereof are learned, structured, and processed dynamically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.724,
    "end": 1253.791,
    "text": " And this research line essentially suggests that event predictive encodings and processes optimally mediate between sensory motor processes and language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.991,
    "end": 1255.952,
    "text": "Maybe I should have put inference processes here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.332,
    "end": 1259.215,
    "text": "So this is a quote from our recent special issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.635,
    "end": 1265.039,
    "text": "So in summary, this event predictive cognition essentially comes from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.065,
    "end": 1291.134,
    "text": " um psychological literature um twersky's work with jeff sex and jeff sex continuation until today actually there's much more recent work from him about this it's rooted partially even more deeply in behavioral psychology if you look at the common coding theory of uh wolfgang clint's and ensuite behavior control theory of your achim hoffman and bernard hommel's work on the theory of event coding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.493,
    "end": 1316.856,
    "text": " If you want to learn more about this, allow me to point you to our recent special issue on this topic in the Topics in Cognitive Science journal with quite a variety of contributions spanning developmental, neural, and behavioral psychology, also linguistics contributions, and cognitive modeling, and computational AI contributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.167,
    "end": 1321.548,
    "text": " So what are these event structures now really about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.568,
    "end": 1345.182,
    "text": "It's essentially when we think about particular event predictive structures, one can quickly get to the conclusion that events must be somewhat distributed networks that essentially predict the types of entities that are involved in an event, like a glass and a hand and an agent that reaches for the glass to drink out of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.822,
    "end": 1353.804,
    "text": " The relative spatial relations between the hand and the object, for example, and the interaction dynamics such as the hand really moving to that object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.204,
    "end": 1355.764,
    "text": "These are event structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.484,
    "end": 1360.005,
    "text": "And then we have somehow this feeling of event boundaries and event transitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.065,
    "end": 1365.446,
    "text": "We know when a particular event can commence and when it can end, when it can begin and end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.306,
    "end": 1372.548,
    "text": "And so, for example, when I grasp this cup here, I just can basically grasp it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.588,
    "end": 1374.468,
    "text": "And once I have grasped it, I can transport it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.904,
    "end": 1379.187,
    "text": " And then I can put it back down and I'm free again, so to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.248,
    "end": 1390.515,
    "text": "Combined with events and event boundaries, I can create mentally event schemas, which have previously also called scripts and similar things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.596,
    "end": 1395.939,
    "text": "And I think these scripts develop naturally out of this event predictive coding principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.999,
    "end": 1402.144,
    "text": "And with event predictive coding principle, we essentially have now a much more clear idea, I think, of what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.745,
    "end": 1407.188,
    "text": " These scripts and schemata, as they have often been characterized before, actually are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.648,
    "end": 1413.032,
    "text": "And of course, once we have schemata, we can embed them again in other events, forming hierarchies out of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.732,
    "end": 1428.922,
    "text": "So to get back to this illustration of writing a letter, we can now say essentially, well, our mind is not really in a continuous past consideration, but it considers past events, essentially, or the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.338,
    "end": 1456.518,
    "text": " unfolding of past events and notice that these do not need to be petitioned as crisp as it's illustrated here and we have certainly events unfolding in parallel for example if you think about the letter writing here right you're writing for example the second word here say scholar or so but you also have the full writing this letter event in your head this event of having sit down on the table and being ready to write this letter so there are multiple events",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.142,
    "end": 1462.964,
    "text": " aspects, of course, that consider particular sub-components of the actual true environment out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.984,
    "end": 1466.125,
    "text": "And so, again, we know what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.165,
    "end": 1478.169,
    "text": "We can retrospectively improve our individual writing skills for writing particular words, writing in general, but also our skills of writing a whole letter and improving this, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.73,
    "end": 1485.012,
    "text": "And then we can, again, pursue the events of finalizing this letter, posting it later on, and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.052,
    "end": 1485.512,
    "text": "So we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.249,
    "end": 1512.428,
    "text": " full sequence in mind that actually then includes or concludes the full letter writing episode that is not only doing the letter but also putting a stamp on the envelope putting the letter in the envelope putting it to the post office and so forth so all this is included um for the fun of it i included this lovely video project here um so here we see an event of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.709,
    "end": 1519.672,
    "text": " of a billiard ball, a pool table starting situation and somebody shooting the white ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.513,
    "end": 1524.955,
    "text": "And so we have a nice hit and we look, oh, some balls hit the hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.035,
    "end": 1526.075,
    "text": "No, they don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.175,
    "end": 1527.016,
    "text": "Actually, lo and behold,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.631,
    "end": 1530.513,
    "text": " they come back together to the starting position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.034,
    "end": 1546.165,
    "text": "So I hope the video was a nice illustration of you definitely having expected something totally different, although not something very concrete, but at least the final state of the event that the balls will be distributed around the table in some form or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.565,
    "end": 1551.029,
    "text": "Certainly they will not ever come back to the starting position like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.149,
    "end": 1552.69,
    "text": "And that's why hopefully some of you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.822,
    "end": 1555.584,
    "text": " at least a little smiling to themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.624,
    "end": 1557.826,
    "text": "Yeah, that it's kind of a cool illustration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.846,
    "end": 1564.091,
    "text": "Yeah, that our brain has these events in mind and it essentially steps, jumps ahead, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.211,
    "end": 1580.725,
    "text": "When the starting of an event unfolds, it kind of knows what the final situation is most likely going to be, even if it's not fully concrete, but it still has some in the ball situation, the pool ball situation, distributional sense to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.985,
    "end": 1582.406,
    "text": "So it's also really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.459,
    "end": 1606.304,
    "text": " And we have, lo and behold, actually formalized this event predictive active inference now in an event predictive active inference model where we modeled reaching behavior and visual eye fixation behavior in infants, actually, together with colleagues from Potsdam University from development and psychology side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.904,
    "end": 1609.185,
    "text": "So now we essentially have the same model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.147,
    "end": 1616.571,
    "text": " equation again as before, but it's only conditioned now on events here, as you see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.951,
    "end": 1622.895,
    "text": "So the whole equation is conditioned on in which events we believe to be currently in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.955,
    "end": 1627.979,
    "text": "So the latent hidden state, this model we had before, is now an event model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.66,
    "end": 1633.323,
    "text": "And so we put the M basically as the internal motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.343,
    "end": 1639.387,
    "text": "So the desired observations given motivations are compared with the expected observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.154,
    "end": 1651.643,
    "text": " pursuing a particular policy and under condition that we are in a particular event and a particular event series unfolds while interacting with the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.243,
    "end": 1667.976,
    "text": "To illustrate this further, Chris Gums actually has done this work and also provided this following illustration here when we have now as the behavior policy here, for example, the gaze position of, say, an infant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.996,
    "end": 1679.358,
    "text": " And so we might start to explain this equation a little bit further by the situation that, okay, the infant say he or she really likes teddy bears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.578,
    "end": 1687.579,
    "text": "So basically it's really its internal motivation is to look at teddy bears and it really perceives a lot of pressure out of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.599,
    "end": 1689.72,
    "text": "So it really likes to look at teddy bears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.36,
    "end": 1694.92,
    "text": "And so its observation is the desire to see teddy bear like objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.281,
    "end": 1697.181,
    "text": "And thus,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.482,
    "end": 1704.127,
    "text": " by pursuing a policy that minimizes the divergence from seeing teddy bears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.687,
    "end": 1707.41,
    "text": "So it essentially will fixate teddy bears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.11,
    "end": 1722.963,
    "text": "But now, when we now see that suddenly this ball here is moving, there might be a surprise in the observation because the baby probably has expected that everything else will stay rather stably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.826,
    "end": 1730.011,
    "text": " So what is happening is that there is a large uncertainty what this ball object is suddenly doing and where it's rolling from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.112,
    "end": 1745.605,
    "text": "And this makes the baby, for example, look at the ball now because it wants to know how it rolls and build a good predictive model so it's not surprised of the ball, given it caught its attention in the first place, of course, and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.625,
    "end": 1747.747,
    "text": "And it seems to be somewhat relevant for itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.388,
    "end": 1751.17,
    "text": " And so it actually predicts the next ball locations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.33,
    "end": 1764.979,
    "text": "And it will also continue then to most likely, at least depending on the age, of course, a little later age probably than illustrated in this picture here, predict that this ball will eventually fall to the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.359,
    "end": 1778.088,
    "text": "And thus, it actually will at some point anticipate not only the next ball position, but will look at the critical next ball position, which would be when does this object then suddenly fall to the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.198,
    "end": 1779.358,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.218,
    "end": 1796.226,
    "text": "And so we have kind of a two event prediction, the immediate next situation and the event boundary when the ball switches from rolling into falling and then expecting that it will fall somewhere on the floor and hopefully not on a teddy bear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.546,
    "end": 1800.268,
    "text": "So to get this really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.408,
    "end": 1805.09,
    "text": "And lo and behold, the studies from Adam and Birgit Elsner",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.593,
    "end": 1821.216,
    "text": " is showing that over the first year of our human's life, usually we develop this anticipatory event predictive eye gaze behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.956,
    "end": 1834.439,
    "text": "So what they did is essentially they showed little kids little videos of hands grasping teddy bears or little claw like grippers grasping teddy bears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.527,
    "end": 1837.628,
    "text": " or other simple kind of objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.109,
    "end": 1845.733,
    "text": "And what you can show is that when you track this baby's eyes, at six months of age, they don't show any anticipatory gaze behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.773,
    "end": 1850.876,
    "text": "So they track the object, the hand that moves to the target object at best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.297,
    "end": 1853.058,
    "text": "Usually, they even lag a little bit behind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.458,
    "end": 1863.324,
    "text": "But lo and behold, with seven and a half months of age about, the babies start to anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.834,
    "end": 1874.805,
    "text": " And they do so particularly and only so when there is an effect, when the hand not only reaches for that entity, but then also lifts it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.165,
    "end": 1879.23,
    "text": "So, of course, after 12 trials are done there in this experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.25,
    "end": 1884.596,
    "text": "So usually after the first or second try and the hand really shakes the object a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.932,
    "end": 1887.815,
    "text": " then the babies start to anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.115,
    "end": 1894.24,
    "text": "And they only do so with about 11 months when there's no effect, when the hand just reaches for the object but doesn't do anything with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.72,
    "end": 1900.025,
    "text": "So then they stay on reactive or hand following behavior and only do this later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.754,
    "end": 1904.115,
    "text": " only anticipate in a later age, about 11 months old.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.475,
    "end": 1910.756,
    "text": "And interestingly, with a claw, at seven and a half, they don't anticipate at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.856,
    "end": 1915.977,
    "text": "So they don't see any agentiveness or any anticipation that this claw will do something with the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.657,
    "end": 1927.539,
    "text": "But with 11 months of age, they essentially show the similar behavior than when they watch a hand with seven and a half months, and the hand lifts the object, and the claw lifts the object, then they also start to anticipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.243,
    "end": 1929.004,
    "text": " with 11 months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.364,
    "end": 1936.029,
    "text": "But only with 18 months, they also anticipate when the claw is not lifting the object, but just moving there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.029,
    "end": 1953.161,
    "text": "And lo and behold, we simulated this with our event predictive active inference model, essentially assuming, so to say, simulating that until about six months of age, they just cannot interpret the event of an hand reaching for objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.221,
    "end": 1956.043,
    "text": "And so they just cannot make an event",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.455,
    "end": 1964.503,
    "text": " case out of it and they just process the unexpected information that is the hand starts moving and they track the hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.625,
    "end": 1977.317,
    "text": "With 12 months of age, it's similar still when they see a claw, but with 12 months of age, when they see a hand and an object, they imagine probably this hand wants to reach for the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.737,
    "end": 1979.539,
    "text": "And so once the hand starts moving,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.96,
    "end": 1987.485,
    "text": " they will move their eyes to the object to be ready to process what the hand is going to do with the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.706,
    "end": 2002.376,
    "text": "And in fact, we modeled this now with an event predictive patient modeling approach, essentially, that essentially implements this active inference equation on the event predictive level that I just showed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.437,
    "end": 2009.641,
    "text": "So it's essentially first trained to learn a probabilistic event predictive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.455,
    "end": 2013.437,
    "text": " key matter of the unfolding dynamics, starting and ending conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.078,
    "end": 2021.163,
    "text": "And then it applies active inference of the current best event interpretation first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.404,
    "end": 2023.045,
    "text": "So it first needs to know which event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.285,
    "end": 2028.269,
    "text": "So if it sees the situation, it needs to infer, ah, a reaching event is most likely to unfold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.729,
    "end": 2037.316,
    "text": "And once it's certain that the reaching event unfolds, then it knows, ah, reaching ends with a grasping and doing something with the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.516,
    "end": 2039.698,
    "text": "So I will look there to see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.385,
    "end": 2069.331,
    "text": " minimize my future expected uncertainty minimizing this anticipated uncertainty of what the hand is going to do with the object and maybe you can look at the results in detail in the paper essentially what is happening is that the system learns to during training to infer the correct events and then during testing after sufficient training phases rather quickly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.867,
    "end": 2084.271,
    "text": " it starts to anticipate to when the reach starts here over time, it starts to anticipate and look at the goal object because it has encoded this as a reaching event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.891,
    "end": 2087.092,
    "text": "And I know how the reaching event unfolds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.492,
    "end": 2099.655,
    "text": "And thus, I look at the end of the reaching event because I want to minimize the free energy that I anticipate unfolding in the near future while reaching and grasping",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.051,
    "end": 2102.512,
    "text": " an object because this is a situation that I'm currently in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.013,
    "end": 2106.014,
    "text": "So that's what the system emergently, so to say, does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.034,
    "end": 2113.579,
    "text": "That's why emergent goal inspiratory gaze by this active inference or event predictive active inference formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.02,
    "end": 2122.804,
    "text": "So, okay, we have shown that there are static latent encodings that can nicely",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.465,
    "end": 2147.428,
    "text": " um foster the emergence of this unspiratory behavior but can such or how can such event predictive structures actually learned this is what i want to show you next but you could also have a short break if you like daniel or what you say um maybe ask and just double down on a few of these cool points and ask a few questions and then jump into the second part of the presentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.605,
    "end": 2150.185,
    "text": " Yep, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.846,
    "end": 2155.308,
    "text": "Okay, um, so a few just kind of general questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.668,
    "end": 2158.649,
    "text": "One was, you brought in the neural network angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.109,
    "end": 2170.715,
    "text": "And so it was just a general question, how do the analytical single line equation, formalisms connect to different modern machine learning architectures?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.175,
    "end": 2174.917,
    "text": "And what does that have to do with the scaling or where active inference could be applied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.037,
    "end": 2179.938,
    "text": " I think I'm going to answer this in the second part of my talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.258,
    "end": 2180.598,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.038,
    "end": 2181.578,
    "text": "Okay."
  },
  {
    "start": 2181.899,
    "end": 2185.2,
    "text": "This is going to become much more neural networks just now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.46,
    "end": 2188.681,
    "text": "And I will conclude also with a general statement about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.721,
    "end": 2191.261,
    "text": "So maybe we keep this for later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.422,
    "end": 2194.582,
    "text": "Essentially, I mean, this was an LSTM network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.703,
    "end": 2196.063,
    "text": "LSTM networks are used for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.212,
    "end": 2219.346,
    "text": " state-of-the-art machine learning so it's not like something that is like totally trivial or so great and the event basis is something that I'm sure you'll return to but you mentioned how events have boundaries and schema or schemata and hierarchies and one thought was how are these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.406,
    "end": 2223.428,
    "text": " boundaries, schema, and hierarchies learned in humans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.128,
    "end": 2227.67,
    "text": "And how does that inform our design of cognitive systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.691,
    "end": 2232.633,
    "text": "Yes, also, this is kind of what I continue with essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.214,
    "end": 2235.094,
    "text": "This is the question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.494,
    "end": 2237.796,
    "text": "So how are these event predictive structures learned?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.156,
    "end": 2247.281,
    "text": "Not so much in humans, I will not so much focus on in the talk now, but how can these be learned in artificial systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.725,
    "end": 2249.946,
    "text": " but inspired, of course, by human learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.526,
    "end": 2254.728,
    "text": "Well, I'm maximally uncertain and curious about those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.968,
    "end": 2258.989,
    "text": "I guess implicitly expected and prefer that they be resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.67,
    "end": 2261.23,
    "text": "But I hope so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.25,
    "end": 2263.851,
    "text": "It just reminded me of how they're encultured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.891,
    "end": 2271.494,
    "text": "Like at the end of a movement of a symphony, if you clap, you didn't get it because that's not the encultured moment to clap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.534,
    "end": 2274.535,
    "text": "There's a broader event that actually goes beyond the sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.175,
    "end": 2276.436,
    "text": "And so it just made me think about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.429,
    "end": 2291.023,
    "text": " through learning we reconceptualize what events are and if events truly are one of the uh kind of atomic units of cognition then that's incredibly powerful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.737,
    "end": 2295.117,
    "text": " I would think so, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.317,
    "end": 2296.878,
    "text": "Was this a question or a comment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.198,
    "end": 2307.141,
    "text": "That was just a comment on the importance of having event-based cognitive processes and how it reconsiders our own experience and suggests how to design other architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.181,
    "end": 2310.382,
    "text": "So maybe we can go to the second part of the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.402,
    "end": 2313.783,
    "text": "The fantastic part is really that it goes hand in hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.843,
    "end": 2322.065,
    "text": "While these events develop, we are getting more and more ready to look and explore deeper event structures and more complex structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.004,
    "end": 2323.805,
    "text": " event structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.885,
    "end": 2328.81,
    "text": "And of course, the real mystery is how these event structures are learned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.69,
    "end": 2337.618,
    "text": "And I want to show you a couple of ideas that we are pursuing in our mainly machine learning research part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.678,
    "end": 2345.145,
    "text": "And in the last part of the talk, I will link these event structures also to language structures to a certain extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.583,
    "end": 2360.354,
    "text": " But allow me, in the interest of time, to go a little bit fast over these machine learning components, because to explain the machine learning architectures in all their detail, it would take talks on its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.794,
    "end": 2365.999,
    "text": "But I just want to give you a little bit of an idea where we are in this respect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.299,
    "end": 2373.185,
    "text": "But the main question that was asked, and that's also a really good question, is essentially, what are these...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.549,
    "end": 2378.69,
    "text": " can our brain learn these event structures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.27,
    "end": 2392.395,
    "text": "And there must be, essentially, in machine learning jargon, these inductive learning biases, these inductive tendencies to learn these event predictive structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.055,
    "end": 2403.879,
    "text": "And ideally, to learn them in a very compact, very suitably compressed form to identify the causality that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.949,
    "end": 2428.151,
    "text": " generate the sensory perceptions in the first place and allow them to combine these event structures in a very compositional, very flexible manner such that we get ready to apply our knowledge also in other situations that are related to previous experiences, but of course, always different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.375,
    "end": 2442.483,
    "text": " And I've argued before that essentially there must, on the one hand side, be event-oriented interpretation tendencies in general, as we have already seen in the quote from Deb Baldwin, for example, also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.063,
    "end": 2450.227,
    "text": "So we must essentially foster the development of this event-predictive, stable, and compact latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.447,
    "end": 2453.389,
    "text": "This is what our brain seems to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.922,
    "end": 2464.793,
    "text": " And it seems to develop these event states in terms of attempting to characterize starting conditions, contextual conditions, and ending conditions of events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.153,
    "end": 2471.119,
    "text": "So contextual conditions means like when can an event unfold and what is happening typically, why an event unfolds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.66,
    "end": 2472.761,
    "text": "The starting condition means",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.257,
    "end": 2475.118,
    "text": " when can an event start?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.378,
    "end": 2479.581,
    "text": "So I can reach only for an object when it's in reach, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.381,
    "end": 2483.523,
    "text": "And the ending condition is essentially when an event ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.563,
    "end": 2487.386,
    "text": "So when a reaching event ends is typically when I grasp an object, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.366,
    "end": 2497.752,
    "text": "And it appears that there is event predictive biases, is inductive biases to segment our stream of information into these events",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.223,
    "end": 2511.655,
    "text": " And two very important ones are probably signals of surprise because usually when I don't have a good event or when I don't know exactly how an event unfolds, I get tubular first better to, for example, extend my hands, reach for things and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.675,
    "end": 2516.98,
    "text": "But then when I touch them, I fail to grasp them properly and they fall down and this is surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.0,
    "end": 2524.567,
    "text": "And then I, um, get surprise signals, which over time, um, become non-surprising anymore because I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.031,
    "end": 2533.813,
    "text": " that when I reach for the object, then typically the grasp unfolds and I prepare for the grasp and then I manage the whole sequence without the surprises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.773,
    "end": 2550.056,
    "text": "And the other one is this latent signals of stability because, and this also relates to causality in a sense, because our, I mean, our environment, our world is a three-dimensional space-time continuum essentially, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.055,
    "end": 2559.08,
    "text": " forces or causal interactions can only unfold when two entities can exchange these forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.36,
    "end": 2563.923,
    "text": "And this is typically in the physical world only possible when they come in contact to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.943,
    "end": 2580.054,
    "text": "Now we are in Zoom and we can exchange information over this long range means, but also in the sense we are in contact right now by this tool, by this digital device essentially and the internet",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.489,
    "end": 2585.271,
    "text": " that enables us to now establish virtual rooms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.291,
    "end": 2597.535,
    "text": "That's why a Zoom room, for example, is also called a Zoom room, because it's a virtual room where we are together, not physically, but information-wise, we can exchange information and thoughts and ideas and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.575,
    "end": 2604.477,
    "text": "And that's essentially very similar to being in the real room, where typically similar things are mainly unfolding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.498,
    "end": 2617.129,
    "text": " And so this is the event predictive biases that make us structure our environment and our thoughts and our general predictive models in this event compositional manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.389,
    "end": 2625.597,
    "text": "And the other one is, of course, the importance of curiosity and homeostasis to make sure that we, on the one hand side, essentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.175,
    "end": 2635.338,
    "text": " I mean, our brain does not have the capacity, our brain has some phenomenal capacity for sure, but certainly doesn't have the capacity to learn everything in all its detail about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.358,
    "end": 2637.779,
    "text": "I mean, it's totally impossible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.799,
    "end": 2643.781,
    "text": "I mean, otherwise we would need to learn down to quantum mechanics, how everything unfolds the whole time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.122,
    "end": 2646.742,
    "text": "So this is absolutely impractical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.463,
    "end": 2650.684,
    "text": "So of course we need to develop models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.388,
    "end": 2656.01,
    "text": " that we believe, so to say, are best suited for our needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.471,
    "end": 2672.839,
    "text": "So while we build our models and while we pursue active inference, as you already seen in the active inference equation, there's this important component that essentially tries to minimize the KL divergence between desired perceptions and actual perceptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.139,
    "end": 2675.961,
    "text": "And this is essentially maintaining internal homeostasis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.457,
    "end": 2700.185,
    "text": " friston would argue also that is this perception right that's not it's not necessarily only about the outside environment but it's also the perception of your own body right so if you desperately hungry um or starving or whatever right then of course you do everything to prevent this from happening um hopefully uh yeah it doesn't get to this um and uh and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.532,
    "end": 2728.635,
    "text": " curiosity meanwhile of course drives our curious minds our knowledge gain experience but also this knowledge gain experience is partially embodied so also our sensory system kind of signals to us what is probably interesting for us and it's going hand in hand with the homeostasis component we build models mainly about the stuff that really interests us and that we believe is important to us in our rich cultural social world of course this can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.462,
    "end": 2737.109,
    "text": " very awkward, very cool artistic things and so forth, but nonetheless, it is still in the human realm important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.13,
    "end": 2752.843,
    "text": "But when we try to implement this now in artificial neural network structures, I want to show you a couple of brief glimpses at least at what we have done in my group over the last couple of years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.884,
    "end": 2753.324,
    "text": "The first",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.78,
    "end": 2780.355,
    "text": " that I want to show you is a derivative of this Rocketball system where we now have, again, similar recurrent neural network structure, but we enhance the system now, not only processing sensory and motor information, predicting sensory consequences, as in the Rocketball thing and that multi-joint arm that you saw before, but also we allow it to give a contextual input state, which is essentially like an event state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.407,
    "end": 2790.312,
    "text": " that develops the ability to distinguish between different vehicles that the system is currently controlling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.632,
    "end": 2803.258,
    "text": "Notice or recall that the system as a sensory input gets XY positions of the vehicle and motor commands are these two or four thrust motors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.538,
    "end": 2808.14,
    "text": "So it doesn't see which vehicle it's currently controlling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.2,
    "end": 2809.481,
    "text": "It only sees its position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.798,
    "end": 2827.368,
    "text": " And so in order to distinguish the different vehicles, it either needs to enhance its latent state within the long-short-term memory structure, the current neural network structure, or it needs to contextualize a latent inductive bias, essentially, here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.928,
    "end": 2831.05,
    "text": "And by training this, it, lo and behold, can do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.57,
    "end": 2836.873,
    "text": "Now, this is the trained model, and it has learned to control these three vehicles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.903,
    "end": 2845.51,
    "text": " that have different inertial and gravity properties and also different thrust motors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.19,
    "end": 2854.297,
    "text": "It does this now essentially by, on the one hand side, continuously doing this active inference with a line that you see again, the thought,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2855.37,
    "end": 2875.626,
    "text": " projecting where it will be in the near future, but also it retrospectively continuously adapts its internal event estimate of which vehicle it's currently controlling, or not really of which vehicle it's currently controlling, but rather what's the best contextual state that allows me to predict the current sensing motor dynamics in the best way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.787,
    "end": 2878.208,
    "text": "And it does this rather well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.849,
    "end": 2880.17,
    "text": "Lo and behold, if you plot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.626,
    "end": 2892.94,
    "text": " the internal state, this contextual state that emerges, that's not trained or in a sense, not trained in a supervised way, but it's trained via an active inference process, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.141,
    "end": 2895.383,
    "text": "So it emerges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.871,
    "end": 2920.685,
    "text": " like a distinction between the three different vehicles, by just simply optimizing this forward model of the different dynamics of the three vehicles and having the inductive bias that's important here to succeed, essentially that the vehicles do not switch all the time, but they are stable for a while, like about 50 steps or something, and then they randomly switch at a certain point in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.868,
    "end": 2935.055,
    "text": " And the inductive bias is that this contextual vector that's hidden here, essentially, is a stable vector that only adapts itself much slower than the internal dynamics of the actual recurrent neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.095,
    "end": 2941.879,
    "text": "And then during training, such these structures typically merge, distinguishing the three vehicles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.439,
    "end": 2945.241,
    "text": "You can even train this to transport objects then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.261,
    "end": 2950.684,
    "text": "There's some modularizations are possible, are necessary to do so, but admittedly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.81,
    "end": 2973.839,
    "text": " um these these structures do emerge but not very robustly and the the structure of this latent state is still typically rather fuzzy so over the last two years we essentially have produced a couple of other neural networks that really try to work on this compression and the suitable compression of these latent states further",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.203,
    "end": 2982.386,
    "text": " We have done this with various gating networks originally for still providing surprise signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.406,
    "end": 2988.069,
    "text": "So essentially surprise when a switch occurs and we just give it a switch occurrence signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.369,
    "end": 3000.114,
    "text": "That was last year essentially where we developed nice latent codes for predicting some abstract functions, for example, and distinguishing between them, even seeing some similarities between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.154,
    "end": 3003.415,
    "text": "But then this year,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.588,
    "end": 3008.849,
    "text": " At the CoxEye meeting, we have done this again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.029,
    "end": 3012.45,
    "text": "So we see we have this event anticipation module.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.571,
    "end": 3016.272,
    "text": "This is a still rather simple neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.832,
    "end": 3033.517,
    "text": "Then we have an event switching module that's a gated recurrent unit network here that allows the next anticipation of the next event code or the passing of the next event code into the lower level event processing structure that is actually processing the sensory information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.207,
    "end": 3039.39,
    "text": " only at certain points in time when this event boundary anticipation network actually activates the switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.431,
    "end": 3048.796,
    "text": "And this event boundary anticipation network learns to activate the switch by particular suitably designed inductive learning biases",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.127,
    "end": 3061.212,
    "text": " So the first inductive bias is essentially design of the model that you develop, essentially an event processing module that is contextualized by the belief of what's the current most suitable event code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3061.232,
    "end": 3062.673,
    "text": "So what's the event that's unfolding?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.113,
    "end": 3068.255,
    "text": "And then event boundary anticipation module that essentially switches between events just in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.355,
    "end": 3075.778,
    "text": "And lo and behold, this system actually really does learn to switch when the information is there that it can know when the event switches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.674,
    "end": 3081.715,
    "text": " that it learns an optimal model about the switches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.356,
    "end": 3099.522,
    "text": "And if you have, for example, in this case, we use like one hot encoded symbolic sequences and different sequence processing automata, basically then the system developed distinct event codes for the three types of dynamics, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.582,
    "end": 3102.503,
    "text": "And interestingly, because you see to P1,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.851,
    "end": 3119.983,
    "text": " the event one or program one essentially just switches between A and B, P2 switches between B and C, and the problem three switches between A, B, C, B, A, B, C, B. So it's a kind of a combination of problem one and problem two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.043,
    "end": 3126.948,
    "text": "And so lo and behold, the P3 code essentially is between the P1 code and the P2 code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.412,
    "end": 3132.194,
    "text": " in all the cases, although, of course, the different initializations, there are three different networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.674,
    "end": 3147.399,
    "text": "They, of course, develop different latent codes, but they still kind of imply the underlying structure of the events and the similarity between events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.679,
    "end": 3157.022,
    "text": "But maybe the most advanced network is the one here, again, from Chris Bogum, together joint work with Georg Marcius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.674,
    "end": 3161.797,
    "text": " here this paper now that essentially also has a very similar structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.857,
    "end": 3168.403,
    "text": "You have a hidden latent state as in the previous code that's essentially in this network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.023,
    "end": 3172.767,
    "text": "It's this code that is passed down through here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.787,
    "end": 3181.053,
    "text": "And this hidden latent code is maintained over time and is just controlled or can be adjusted by a gate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.394,
    "end": 3185.577,
    "text": "That's a multiplicative gate that opens only very selectively and this gate is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.438,
    "end": 3193.223,
    "text": " is designed such that there is a loss function that punishes gate openings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.823,
    "end": 3203.951,
    "text": "So the system really doesn't really want to open its gate, but if it's really helpful to lower the prediction error on this side, it does so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.511,
    "end": 3216.18,
    "text": "It starts to open the gate and thus changes context with this recommendation system or this event coding system that has the next event code",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.758,
    "end": 3224.605,
    "text": " ready to switch to it just in time, and then combines this to predict the next consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.965,
    "end": 3228.148,
    "text": "So again, a sensory motor event predictive model, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.969,
    "end": 3234.974,
    "text": "And this system is now quite ready to process state of the art",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.532,
    "end": 3242.714,
    "text": " challenges here, not only toy problems as in the admittedly in the last in the two other systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.734,
    "end": 3261.319,
    "text": "So for example, there's a billiard ball scenario, which is a kind of a benchmark in machine learning community where our system with suitable parameterization decreases the mean squared error much more than standard LSTM or GRU or standard recurrent neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.739,
    "end": 3263.58,
    "text": "And particularly when you have a testing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3264.099,
    "end": 3290.719,
    "text": " scenario that differs a little bit from the training scene and what's even more important maybe or more interesting in this scenario is that matching to this illustration here you see essentially that the latent state of the our system called gate lord essentially you can really see that there is a particular dynamic unfolding",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.527,
    "end": 3294.028,
    "text": " So first of all, it rolls in a certain direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.048,
    "end": 3301.351,
    "text": "After the first interaction with the boundary, the latent state perfectly switches to one stable new state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.871,
    "end": 3304.132,
    "text": "And then you see the second bounce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.252,
    "end": 3306.253,
    "text": "And again, it switches to a new state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.853,
    "end": 3309.134,
    "text": "So that's very powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.154,
    "end": 3315.796,
    "text": "A little bit hand waving due to time cannot explain all of the components here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.172,
    "end": 3319.615,
    "text": " but you see a really nice generalization behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.695,
    "end": 3344.573,
    "text": "For example, when you train only this fetch and pick and place task in situations where the gripper object contact always occurs at time point five, and in generalization, the contact also occurs at other time points, immediately the Alice-Telman GRU networks get much worse in their predictive accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.1,
    "end": 3348.983,
    "text": " And Gatelord still generalizes also to these other scenarios.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.523,
    "end": 3354.826,
    "text": "And there are a couple of other also combinations with reinforcement learning systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.866,
    "end": 3366.114,
    "text": "So actually, Christian took that Gatelord module, essentially, this model learning module, and combined it with state-of-the-art reinforcement learning systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.714,
    "end": 3373.959,
    "text": "And as a result, we could learn faster, be more sample efficient, essentially, and be partially more accurate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.52,
    "end": 3381.226,
    "text": " than the state-of-the-art reinforcement learners in a couple of these mini-grid world tasks, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.166,
    "end": 3387.651,
    "text": "So really important to induce the right inductive learning biases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.191,
    "end": 3402.323,
    "text": "These essentially improve the latent state codes that much more systematically seem to develop really kind of an explaining code, like explaining the causality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.31,
    "end": 3419.717,
    "text": " with a latent code about what's really going on in the environment such as where the sheep for example is or where the goal position will be if the system remembers where the key is on one side and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.757,
    "end": 3431.822,
    "text": "So particularly very suited also for partially observable Markov decision process problems so where you need to maintain longer term memory of particular events that happened in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.386,
    "end": 3433.507,
    "text": " particular environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.829,
    "end": 3440.132,
    "text": "OK, so that's the second part of the neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.814,
    "end": 3460.688,
    "text": "And if you still have a couple of minutes, I try to put you through the last component here that I want to show you that this event predictive structures can be very closely related to language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.3,
    "end": 3484.227,
    "text": " And that I find most exciting because this might in fact really close the language gap and really ground language in our sensory motor experiences by this tendency to develop event predictive structures that are then very easily linked to the language that each of us experiences while we grow up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.647,
    "end": 3489.409,
    "text": "Let me show you what I mean by this event predictive structures in terms of a language domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3489.869,
    "end": 3490.869,
    "text": "Let's take this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.929,
    "end": 3497.992,
    "text": " this example of a ball that rolled down the table because it was crooked, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.872,
    "end": 3501.894,
    "text": "And so if you read the sentence, actually, it was crooked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.274,
    "end": 3503.755,
    "text": "You might think, well, the ball was crooked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.775,
    "end": 3504.475,
    "text": "That's why it rolled down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.495,
    "end": 3507.176,
    "text": "It probably was the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.416,
    "end": 3512.619,
    "text": "So how come we are able to make sense of the sentence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3513.114,
    "end": 3524.881,
    "text": " with it particularly being ambiguous, being referential ambiguity here, being able to be bound to the subject or the object essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.341,
    "end": 3536.327,
    "text": "And so what I mean, what happens when we read such a sentence is essentially that while we process sentence or we read the ball and we create probably a kind of a predictive encoding structure of the ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.527,
    "end": 3541.45,
    "text": "So the ball can roll and bounce and it gets repelled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.005,
    "end": 3553.451,
    "text": " when it hits something and it has some particular size and possibly we also imagine some kind of particular ball with like a soccer ball or something, depending on what I usually not very visual person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.471,
    "end": 3558.173,
    "text": "So I don't usually imagine that an actual ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.233,
    "end": 3560.374,
    "text": "And then I then read rolled down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.434,
    "end": 3564.616,
    "text": "So the rolling is much more active than the falling at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.677,
    "end": 3569.439,
    "text": "And I imagine the ball essentially rolling somewhere somehow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.966,
    "end": 3572.427,
    "text": " And then this somewhere somehow is specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.467,
    "end": 3573.227,
    "text": "That's the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.267,
    "end": 3576.028,
    "text": "So it rolls, uh, um, down the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.068,
    "end": 3579.428,
    "text": "So apparently it's, uh, there's a table and there's a tabletop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.448,
    "end": 3582.969,
    "text": "So it's probably on the surface of the table that the rolling event unfolds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.029,
    "end": 3588.611,
    "text": "And so I put this together and I have this rolling down as we've seen before the baby expecting the rolling and the falling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.991,
    "end": 3590.591,
    "text": "We've now this event structure, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3590.631,
    "end": 3598.233,
    "text": "Of a ball rolling down, meaning like it rolled first on the surface and then it probably dropped down, uh, somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.769,
    "end": 3600.89,
    "text": " thus rolling down the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.771,
    "end": 3616.381,
    "text": "And now we read because it was crooked, essentially, and this essentially implies due to the because situation, right, that essentially was the second part of the sentence was not true, like this is explaining part of the sentence, the because part, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.721,
    "end": 3621.844,
    "text": "So was it not crooked, then the rolling event would not take place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.924,
    "end": 3625.227,
    "text": "And this essentially counterfactual reasoning, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.247,
    "end": 3628.629,
    "text": "So can it be that the ball is crooked and thus,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3629.318,
    "end": 3630.399,
    "text": " It rolled down the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.6,
    "end": 3638.167,
    "text": "And if the ball would have some sort of crooked dent or whatever, it most likely has not rolled down the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.207,
    "end": 3640.789,
    "text": "So that seems to be not so plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.65,
    "end": 3649.157,
    "text": "But a kind of tilted, crooked table seems to be much more plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.257,
    "end": 3651.84,
    "text": "So most likely, it was the table that was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3652.406,
    "end": 3654.047,
    "text": " assigned with a pronoun, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3654.087,
    "end": 3670.479,
    "text": "So we can, we have essentially analyzed the whole event with its causality in it by imagining the words that we read and the sentence structure that we perceive as grammar and generating an imagination of what we perceive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.979,
    "end": 3679.926,
    "text": "And when actually we have this year with together with Christian Stegemann Phillips, we have published a paper or the so-called learner architecture,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3680.404,
    "end": 3685.446,
    "text": " which essentially learns about an environment, an event predictive structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3686.446,
    "end": 3700.851,
    "text": "It is trained or informed how to link the individual event components that it has learned out of observing an environment with a language processing system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.451,
    "end": 3704.672,
    "text": "And then it can, in fact, do just what I have illustrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.732,
    "end": 3709.294,
    "text": "It can disambiguate ambiguous sentences by creating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3710.05,
    "end": 3713.653,
    "text": " concrete imaginations of a described state of affair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.134,
    "end": 3719.458,
    "text": "So for example, we have here this scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.558,
    "end": 3721.92,
    "text": "Unfortunately, it looks like little viruses here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.201,
    "end": 3724.062,
    "text": "This has nothing to do with corona or so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.102,
    "end": 3724.723,
    "text": "Sorry about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.103,
    "end": 3728.506,
    "text": "It was created before the whole damn pandemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.585,
    "end": 3743.173,
    "text": " But nonetheless, what's important is that these creatures here push down stuff from these platforms and our learner system analyzes these things and essentially creates event predictive structures out of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.712,
    "end": 3749.336,
    "text": " And so then after it has learned this, it can essentially generate sentence interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.396,
    "end": 3757.561,
    "text": "So after training, essentially you can create, give it a sentence such as the green virus rests on the platform and it moves to the box after it falls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.982,
    "end": 3759.663,
    "text": "So rather complex sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.183,
    "end": 3769.87,
    "text": "And what the system then is doing, it can create itself out of the entities that are uttered like a green virus, a platform and a box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.795,
    "end": 3792.695,
    "text": " um which has been decided to be green here as well that's randomly chosen then maybe it's not specified it arranges these three objects in such a way such that it it can imagine an event sequence unfolding in this constellation to make the sentence true so you can see this in this video here so essentially the system uh learned to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.476,
    "end": 3822.966,
    "text": " generate this constellation that you see and the virus lo and behold falls on the platform actually and then it rests on the platform for a little while and then it moves to the box after it has fallen on the platform so this is the interpretation of the sentence that the system has created and i think it's a nice illustration hopefully for you also convincing illustration that this event structures or sentences uttering event structures can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.143,
    "end": 3848.222,
    "text": " What we make of it, what meaning making sense of a sentence is essentially something like this is the internal creation of a consistent event or event progression that fits to the described sentence structure, disambiguating, of course, certain temporal and referential and so forth ambiguities that might be inherent in the sentence and grammatical structure that is provided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.383,
    "end": 3852.445,
    "text": "We have also just recently shown that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.007,
    "end": 3881.094,
    "text": " this event predictive inference structure also nicely fits to the rational speech act model actually for that matter and one can nicely model learning about the preferences of others this essentially this example in this study goes with actual behavioral experiments done on mturk here so for example you can imagine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.67,
    "end": 3910.354,
    "text": " when you have a scene like this and this is admittedly very abstract entities here and so for example you have the scenario and maria wants to signal an object to the following scene in the following scene to samantha so maria maria says red please take a red one essentially and samantha chooses the outline object like such as she takes the red cloud here red stripe cloud then you can possibly infer something about samantha's preferences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.908,
    "end": 3915.852,
    "text": " Lo and behold, she might like, for example, clouds more than circles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.073,
    "end": 3921.297,
    "text": "But you don't know anything about squares because there was no option to choose from squares.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.077,
    "end": 3931.265,
    "text": "And you can also, by the active inference formalism within this formalism, actually, you can then also do it the other way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.345,
    "end": 3937.19,
    "text": "And you want to, for example, possibly learn about Elizabeth's preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.23,
    "end": 3939.732,
    "text": "And you have only the scenario can give options to choose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.327,
    "end": 3941.208,
    "text": " amongst objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3941.568,
    "end": 3955.837,
    "text": "So for example, if you want to learn about if the person prefers clouds or circles, you could, for example, pick one of the green ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.417,
    "end": 3960.52,
    "text": "And then you would see if the person takes a cloud or a circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.54,
    "end": 3966.524,
    "text": "And then you have some hint that the person might prefer clouds or circles, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.498,
    "end": 3993.359,
    "text": " And we have modeled this in this recursive inference process, very closely related to the active inference formulas in the USA, typical KL divergence, again, where we essentially compare our prior knowledge of feature preferences over our expected posterior knowledge of feature preferences while pursuing a particular action, a particular utterance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.233,
    "end": 4012.295,
    "text": " And when we compare this to the actual behavior of the human participants, we get really good fits and in fact could show also from an information criterion manner that our cognitive model fits better than other competitive models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.751,
    "end": 4036.413,
    "text": " models and this leads me to the end of my presentation yeah so uh just the language really briefly in the end but i hope you see what i mean by that this event predictive cognition essentially and the active inference processes that unfold which is within this event predictive cognitive systems and our brains for that matter most likely are very compatible to linguistic structures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.532,
    "end": 4054.735,
    "text": " So what I have shown you today, and I hope you could follow me so far and it wasn't too much, that essentially our generative mind may have the self-motivated objective to act highly flexibly and goal-directed and pursue epistemic self-motivated actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4055.115,
    "end": 4066.257,
    "text": "In general, this is quite clear to survive, right, to interact with our complex worlds, to seeing that we have become this crazy human beings with all our social likes and hates and capabilities and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.971,
    "end": 4068.092,
    "text": " intelligence and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.052,
    "end": 4095.388,
    "text": "On this human cognitive level, event predictive conceptualizations seem to be really important to enable us to act in a deeper goal-directed self-motivated manner and to conceptualize our environment as to be able to communicate and interact and cooperate with others and compete also with each other for that matter in a highly more sophisticated manner than any other animals can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.354,
    "end": 4108.34,
    "text": " To learn such conceptualizations, we really need this inductive learning biases, and it's certainly not fully figured out yet how this learning and processing biases are working or functioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.661,
    "end": 4126.049,
    "text": "But we know and can show clearly that these conceptualizations are really good to enable deeper goal-directed, self-motivated planning, reasoning, counterfactual reasoning, filling in gaps, filling in unknowns, disambiguating ambiguous situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.96,
    "end": 4131.661,
    "text": " and pursuing abstract and concrete behaviors on multiple levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.862,
    "end": 4156.268,
    "text": "And last point was that language seemed to be mapped really rather easily on this, which essentially possibly might explain why we as babies naturally learn our mother tongue without overly much effort, and particularly the complexity of the grammar behind it also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.069,
    "end": 4173.525,
    "text": " On the artificial intelligence side, I would like to conclude that the current deep learning systems, mostly because they don't foster this generativity and this conceptualization of structures, they do not really foster event predictive generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.106,
    "end": 4175.287,
    "text": "And as others have said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.714,
    "end": 4189.103,
    "text": " Thus, men may call the more simpler architectures that are nonetheless including systems like transformers and so forth really still rather highly computationally demanding stochastic parrots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.365,
    "end": 4203.313,
    "text": "Arguably, and interesting to discuss this, of course, I believe that if we develop more event predictive generative systems, then we actually foster the development of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.056,
    "end": 4226.273,
    "text": " the learning of generative models that is and ideally causal models of the actual true causality that we encounter via our sensory motor experiences, enabling us to generate much more robust forecasts, possible action recommendations and explanations also why we would recommend particular things or forecast particular things because we essentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.074,
    "end": 4255.07,
    "text": " are designed to learn about the causes that lead us to predict certain things so we can also of course talk about the causes and in my opinion these systems may then indeed yield strong ai or artificial general intelligence where self-motivated learning will be inevitable part of such systems and self-motivated learning and self-motivated behavior also thus will be part of the systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.763,
    "end": 4267.034,
    "text": " And so I think we should be aware that there's no reason, I see no reason, research on human cognition and its functionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.094,
    "end": 4273.4,
    "text": "There's no reason why an artificial system should not reach such intelligence level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.221,
    "end": 4302.648,
    "text": " And so, as others also have pointed out, I want to conclude with a word of caution, essentially, and a word of awareness that if these systems come into being, come into existence, yes, we need to make very much sure that we don't design them just for profit or for some individual personal interest, but we better put good purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.925,
    "end": 4331.822,
    "text": " into these systems and it's a good idea to think about this now also this concludes my talk thank you so much for attention parts of this general motivation background you can find in my book from 2016-17 how the mind comes into being and i acknowledge some funding from humboldt foundation and dfg mainly and thank you for my team actually to produce much of this work i don't have a team slide here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.678,
    "end": 4334.561,
    "text": " But thank you for your attention as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.603,
    "end": 4337.884,
    "text": "Awesome presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.305,
    "end": 4338.966,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.987,
    "end": 4340.427,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.389,
    "end": 4345.734,
    "text": "Maybe you can unshare and we can have a little discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.175,
    "end": 4347.616,
    "text": "Definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.673,
    "end": 4353.115,
    "text": " Well, tons of very interesting ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.696,
    "end": 4358.219,
    "text": "Anyone can write a question in the chat, but let me just start with a introductory question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.839,
    "end": 4362.802,
    "text": "How did you come to be working with active inference models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.342,
    "end": 4365.464,
    "text": "What were you working on before?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.684,
    "end": 4374.43,
    "text": "Was it a system specific or question specific path that led you to integrate these novel components into active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.83,
    "end": 4378.67,
    "text": " Yes, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.69,
    "end": 4381.631,
    "text": "I'm just a little bit confused because it's this camera now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.851,
    "end": 4384.372,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.392,
    "end": 4387.352,
    "text": "Let me actually turn to this screen then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.412,
    "end": 4403.956,
    "text": "Yes, well, I have studied all my research career, essentially started to study anticipatory behavior from the very early on during my diploma, bachelor's degree studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.611,
    "end": 4410.512,
    "text": " essentially coming into contact with a psychologist in Wurzburg, Joachim Hoffmann's group on anticipatory behavior control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.892,
    "end": 4432.556,
    "text": "And I think in his work, he already essentially from the psychological perspective, um, of, uh, formalizes, um, this principle of active inference on a, on a very crude, more in words, um, specified psychological level where, and I started very early then to also realize that, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.905,
    "end": 4438.087,
    "text": " that the devil is in the details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.988,
    "end": 4444.611,
    "text": "And the big question is really, what are representations like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.032,
    "end": 4449.934,
    "text": "What is the representations that these anticipations, that these predictions actually unfold?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.235,
    "end": 4452.636,
    "text": "What's the nature of these representations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.696,
    "end": 4461.001,
    "text": "And even nowadays, we still see lots of machine learning work where representations are given in advance and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.047,
    "end": 4469.289,
    "text": " and, um, or are just totally done by, let's say the Atari, um, games or the successes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.349,
    "end": 4484.033,
    "text": "I mean, there, you just give the plain image and you, you kill the problem with so much data that it's the, um, converges, but the system is not really learning the systematicity, the actual structure of the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.913,
    "end": 4490.895,
    "text": "And, but most recent, um, advances, of course, also from others, for example, the, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.88,
    "end": 4498.244,
    "text": " the dreamer architecture or the planet architecture from, from what's his name?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4498.264,
    "end": 4499.265,
    "text": "Hafner is the last name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.406,
    "end": 4504.328,
    "text": "This goes also very close in this direction, but no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.589,
    "end": 4507.37,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.45,
    "end": 4513.474,
    "text": "They goes in this direction, but they don't really foster event predictive latent codes yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.494,
    "end": 4514.575,
    "text": "And I think they should.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.836,
    "end": 4517.096,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4519.498,
    "end": 4519.718,
    "text": "Are you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.4,
    "end": 4531.066,
    "text": " have some predictions about where you might go, but just to sort of restate it, you said just in your previous answer that it was a crude active inference in words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.947,
    "end": 4537.471,
    "text": "And so I wanted to ask, what is active inference crudely in words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.151,
    "end": 4544.836,
    "text": "And then what key pieces of the formalism today refined those words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.916,
    "end": 4548.378,
    "text": "And then what do you see being incorporated into the formalism going forwards?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.886,
    "end": 4554.908,
    "text": " So what's active inference, crudely speaking, and what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.149,
    "end": 4578.699,
    "text": "Well, active inference essentially formalizes how our minds and how clever learning systems should infer and develop generative models about the world and use these models to pursue self-motivated, goal-directed behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.502,
    "end": 4583.004,
    "text": " That's the general formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.185,
    "end": 4597.535,
    "text": "And my point today was essentially that this formalism is overly general in a sense, because it doesn't specify the nature of the encodings, of the predictive codings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.095,
    "end": 4610.164,
    "text": "And evolution has obviously shaped our minds such that we have particular expectations of the structure that's suitable to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.443,
    "end": 4624.305,
    "text": " model the outside environment and thus interact with this environment in a more flexible adaptive goal-directed socially competent manner and that's where the event predictive stuff falls in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.035,
    "end": 4627.396,
    "text": " Thank you for the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.156,
    "end": 4634.378,
    "text": "Now, a sequence of events might have a narrative, could be said that connects them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.098,
    "end": 4639.14,
    "text": "How does narrative relate to your work here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.26,
    "end": 4650.824,
    "text": "Is that just a bigger nesting event or how do we connect micro scale events, which it's very nice how you, you know, rolling off the table was a clear demonstration of that kind of an event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.084,
    "end": 4653.005,
    "text": "How does that connect to broader narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.373,
    "end": 4657.113,
    "text": " Yeah, very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.133,
    "end": 4658.414,
    "text": "Very good and very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.695,
    "end": 4676.018,
    "text": "I think, as I said, as I tried to imply also that the events exist on multiple levels of granularity and precision and an event can consist of yet sub events essentially, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.038,
    "end": 4683.68,
    "text": "I mean, like the whole episode of writing a letter, for example, consists of writing individual words, sentences, paragraphs,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.204,
    "end": 4689.045,
    "text": " thoughts expressing individual thought components and so forth, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4689.385,
    "end": 4697.787,
    "text": "So an event per se can, I mean, you have the event of your current day, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.847,
    "end": 4700.328,
    "text": "And you compress this as an event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.788,
    "end": 4711.31,
    "text": "So that's the beauty about it, I think, also because an event is not, there's not only one event unfolding in our minds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.917,
    "end": 4714.198,
    "text": " in every here and now situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.038,
    "end": 4721.922,
    "text": "But it's about this different aspects that have beginnings and endings, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.662,
    "end": 4731.866,
    "text": "Like this meeting here, but my answer to your question, my individual sentences, my individual words, my actual utterances that I produce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.326,
    "end": 4735.488,
    "text": "These are all events nested within each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.188,
    "end": 4740.21,
    "text": "And each of these components is characterized by certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4740.669,
    "end": 4759.129,
    "text": " stability situations like the whole while we have this meeting we are in a certain interactive situation and this is more or less stable during the whole meeting I guess I'm the presenter here today and so forth and then we have listeners and you are the mediator so to say right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.488,
    "end": 4760.869,
    "text": " And this is the situation the whole time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.889,
    "end": 4763.931,
    "text": "And this is stable from the beginning of the end, from the whole situation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.991,
    "end": 4768.915,
    "text": "But when you pose me a question, then you focus in on this question answering situation event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.955,
    "end": 4771.757,
    "text": "And that's one particular event within nested within the other event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.337,
    "end": 4777.601,
    "text": "And while I produce my train of thought, there are also the events again unfold, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.841,
    "end": 4778.682,
    "text": "So there's a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.782,
    "end": 4785.887,
    "text": "And each of these events, though, is characterized by certain stabilities that are unfolding in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.297,
    "end": 4793.782,
    "text": " such as the question answer situation where we focus on a particular component of this current talk and the current topic of this meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4796.491,
    "end": 4796.791,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.991,
    "end": 4806.453,
    "text": "What that reminded me of was Kronos and Kairos, two Greek word roots for time and the chronometer, the decimal points of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4806.813,
    "end": 4813.494,
    "text": "And there's nesting of chronology, like the second is within the deca second or the minute, the hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.874,
    "end": 4823.256,
    "text": "But then Kairos, this more semantic or action-oriented kind of timeliness also has nesting and that can be perfectly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.056,
    "end": 4827.387,
    "text": " nesting, like the example of the letter with a sentence, the word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.957,
    "end": 4829.318,
    "text": " et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.378,
    "end": 4830.578,
    "text": "It's funny because it's called a letter, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.618,
    "end": 4832.679,
    "text": "At the bigger and the smaller level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4834.78,
    "end": 4838.322,
    "text": "But then also the boundaries could be subjective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.803,
    "end": 4843.785,
    "text": "So not to say arbitrary, but literally defined by the subject, learnt by the subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.125,
    "end": 4856.492,
    "text": "And so it seems to be no problem to have machine learning systems that can nest Kronos very well, but how do we achieve inadequate nested action-oriented representation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.754,
    "end": 4860.556,
    "text": " Um, any thoughts or I'll ask a question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.096,
    "end": 4866.579,
    "text": "I think, um, we, that's a very important part and that's also the beauty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.619,
    "end": 4868.36,
    "text": "I think about the event structures, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.4,
    "end": 4877.785,
    "text": "That essentially it's not, it's always subjective because it's the stability that each of us perceives that makes an event become an event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4878.805,
    "end": 4881.407,
    "text": "And I mean, because our world for us is all the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.767,
    "end": 4885.349,
    "text": "We are very similar in this event structures, but nonetheless,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.874,
    "end": 4897.457,
    "text": " Of course, the events are very individually unfolding in each of our minds, and they are characterized by these stability and systematicity properties that each event has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4898.138,
    "end": 4904.339,
    "text": "And the nice thing about it as well is that the petitioning and segmentation is extremely flexible, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.399,
    "end": 4906.66,
    "text": "I mean, you can, it doesn't depend",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.481,
    "end": 4907.981,
    "text": " on time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4908.001,
    "end": 4925.715,
    "text": "And in order to implement this in machine learning systems, you need to have a system that can flexibly maintain particular latent states over extended periods of time and systematically change them when the time is ripe, so to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.735,
    "end": 4933.842,
    "text": "And this is what we have done with the gate load system that I have showed there towards the end, which is going to be published in December.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4935.728,
    "end": 4936.329,
    "text": " Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4936.409,
    "end": 4938.371,
    "text": "So I'll ask a question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.911,
    "end": 4948.52,
    "text": "So Dean has asked, entertaining counterfactuals is time distributing and time provides the twist like a Mobius strip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.381,
    "end": 4958.41,
    "text": "So if we include diachronic continuity with events, episodic partitioned, do we break free from training?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.639,
    "end": 4969.965,
    "text": " A classical Dean phrasing, to be sure, which I just read literally rather than choose to interpret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.985,
    "end": 4990.602,
    "text": "Maybe you can help me with the interpretation, but I would say the counterfactual component was the problem that the counterfactual is time demanding or consuming or mentally challenging essentially because time is on the issue and so I need to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.263,
    "end": 4994.264,
    "text": " So I cannot do counterfactual reasonings on the fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4994.364,
    "end": 4996.185,
    "text": "And that's certainly true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.265,
    "end": 5001.487,
    "text": "We fall typically in our best explanation very quickly and habitually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.507,
    "end": 5009.89,
    "text": "And only when we really realize errors, we fall into counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5010.53,
    "end": 5019.514,
    "text": "I usually give the example with a cricket ball, or actually usually I give a simple example, which is non-dynamic, like the ball fits into the suitcase because it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.007,
    "end": 5022.669,
    "text": " large, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5023.29,
    "end": 5027.154,
    "text": "So the ball fits into the suitcase because it is large.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5027.635,
    "end": 5030.318,
    "text": "So it is the suitcase that is large and not the ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.059,
    "end": 5037.827,
    "text": "And that is kind of also a typical garden pass effect in linguistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5038.047,
    "end": 5038.888,
    "text": "You fall into the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.312,
    "end": 5044.475,
    "text": " Best interpretation, the pronoun it usually fits with the subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.976,
    "end": 5056.143,
    "text": "And so your best hypothesis to bind it to the subject and you read on and then you get to the final sentence and then you try to imagine why does the ball fit in the suitcase?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5056.183,
    "end": 5060.506,
    "text": "And then essentially you realize you have to revise your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.546,
    "end": 5069.012,
    "text": "And that's kind of the counterfactual part that only happens, I think, when there is surprise or other reasons to really pursue this additional cognitive effort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5070.734,
    "end": 5071.734,
    "text": " Great answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.834,
    "end": 5077.576,
    "text": "Let me see if there's a link to what Dean suggested and the stochastic parrot notion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.196,
    "end": 5088.579,
    "text": "So if we think about a stochastic seed preferring, seed rewarding parrot, it's like there's some maze and the seed could be on either side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.619,
    "end": 5098.822,
    "text": "And so it's rewarded when it's discovering that, it's strengthening that, and then it switches and then it just stochastically sometimes investigates the other branch and then reinforces that stochastic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.582,
    "end": 5101.383,
    "text": " Now that's all time bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.743,
    "end": 5128.31,
    "text": "If we think about the event as the context, then the counterfactual, the continued possibility of imagining a counterfactual is kind of what allows the rapid moving from the training on the side that it has been on and in one step with one gate opening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.215,
    "end": 5134.139,
    "text": " we can counterfactually enter into a different context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.699,
    "end": 5143.486,
    "text": "And then he adds, it's bi-directional and the not present is that now, let me restart this literally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.707,
    "end": 5149.511,
    "text": "He says, the not present is now plus then and then plus now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.232,
    "end": 5154.495,
    "text": "This is our ability, both episodic and diachronic continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.876,
    "end": 5157.678,
    "text": "That is the what if the mind can work out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.062,
    "end": 5159.262,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5160.503,
    "end": 5162.604,
    "text": "And that's, that's a, that's a beautiful part, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5162.644,
    "end": 5176.711,
    "text": "I mean, our mind can essentially buy this gate openings, create a switch between alternative events or event, sub event components, switched entity property,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5177.761,
    "end": 5206.813,
    "text": " uh switch other aspects of it and and uh and it not needs to do so it's not only doing this by randomly switching these things because it usually switches them very systematically in a meaningful manner that actually the consequence of an event actually changes it well right because you usually do what if questions that actually change the further event progression and you can do this mentally really well and i think the um this essentially uh can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.106,
    "end": 5212.227,
    "text": " could be done and should be further explored with such gating mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.967,
    "end": 5234.032,
    "text": "Really cool component for future research, I think, to really show that such systems not only are able to explain events, but can also really reason in terms of counterfactual manners then by saying, well, if I switch, if this property would have been different, then actually the whole thing would have not happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.412,
    "end": 5236.293,
    "text": "This is actually also really important to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5236.98,
    "end": 5240.223,
    "text": " assign blame, for example, to people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5241.464,
    "end": 5245.167,
    "text": "Would you not have shot the ball or something like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5246.028,
    "end": 5250.652,
    "text": "And so that's also very socially relevant lo and behold there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5251.894,
    "end": 5262.161,
    "text": " as well as designing education and thinking about when are we trying to, when are we fine tuning, but not opening or changing a gate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.842,
    "end": 5276.132,
    "text": "And then it made me think about that, the equation, which you did an awesome job to walk through and show and read it because like sensory motor inputs, the equation is a linear string.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.889,
    "end": 5279.77,
    "text": " But then we can engage in this counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.87,
    "end": 5284.651,
    "text": "Well, what if the inference on observables weren't conditioned on policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.271,
    "end": 5292.553,
    "text": "And it's actually to have competency with those equations is to know a little bit about counterfactuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.693,
    "end": 5296.774,
    "text": "And then on the cutting edge, you're drawing from other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.794,
    "end": 5300.255,
    "text": "And you're asking, looking at Pizzullo and Friston et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.275,
    "end": 5305.856,
    "text": "2015, and then asking, well, what if this formalism included another formula?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.727,
    "end": 5310.73,
    "text": " event-based cognitive framework that was not previously connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.07,
    "end": 5332.405,
    "text": "So it's like the learning trajectory for those of us who are learning the equations includes the counterfactuals and the gate opening and then research is just kind of going one step further and so just made me wonder about how we design education to accommodate this kind of gate opening and counterfactual space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.167,
    "end": 5336.368,
    "text": "How we accommodate it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.852,
    "end": 5363.306,
    "text": " education um like what what for what kind of education you mean yes what which education you're referring to human human education for learning active inference or for learning another area yeah i think that's a good uh an interesting far uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.085,
    "end": 5390.059,
    "text": " thought i would say um it's it's i think it's extremely useful for sure to yeah particularly also to look at equations and and analyze their components and then um progressively also enhance them or selectively compact them take kick away out the one summit or the other and then you see exactly what's happening so i guess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.646,
    "end": 5393.828,
    "text": " Hopefully, this was educational how I presented it, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.329,
    "end": 5401.432,
    "text": "It's a flow of sensory inputs, and then there's some discrete changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5401.452,
    "end": 5409.117,
    "text": "And event structures, if you think about the individual components in the equation as event components, in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.257,
    "end": 5409.397,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5411.701,
    "end": 5413.021,
    "text": " Very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.782,
    "end": 5417.123,
    "text": "I have one more question and then maybe any closing thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.683,
    "end": 5424.985,
    "text": "You mentioned the Zoom room or the Jitsi room, online events, calendar events that we all get invited to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.866,
    "end": 5438.189,
    "text": "That's just very interesting with how we're bringing our evolutionary and our ecological behavioral embodiments into the digital space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.05,
    "end": 5439.35,
    "text": "And so-",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5440.911,
    "end": 5443.633,
    "text": " What does it bode for online events?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.393,
    "end": 5449.236,
    "text": "Thinking beyond just webinars, but like, how do we think about online events?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.296,
    "end": 5457.28,
    "text": "Because in one sense, you're very local to me, you're in my headphones, giving me the sensory flow, but you're on a different continent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.56,
    "end": 5466.845,
    "text": "And so where do you think, or what theoretical questions or applied questions does it raise to think about online events, which are a novel affordance from an evolutionary perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.119,
    "end": 5486.249,
    "text": " I mean, I think for the one good of it, they have shown us that we don't need to fly as much around the globe as we have done before the pandemic, which is probably a really good thing for our planet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5486.329,
    "end": 5489.771,
    "text": "And we should acknowledge this and accept this, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5492.033,
    "end": 5496.636,
    "text": "I have the impression that particularly older colleagues have issues with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.516,
    "end": 5501.339,
    "text": "And I think it's very good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.495,
    "end": 5525.369,
    "text": " important thing that we should be all aware of that and shout it out loud as I do right now that we are in a very severe situation for our world and this pandemic has shown us also and even shows us now how the humans are so easily able to neglect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.618,
    "end": 5534.745,
    "text": " things or deny things that are so obvious that they are occurring, which is very scary and very unfortunate for our own future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.908,
    "end": 5550.059,
    "text": "Meanwhile, saying this, I think it was a great opportunity for all of us to acknowledge that video calls like this work really well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.072,
    "end": 5561.036,
    "text": " And of course, after one and a half years of pandemic, I guess all of you guys also enjoy local meetings again and going out with other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.076,
    "end": 5579.323,
    "text": "So we also see how social we creatures are and what is missing in such video calls, which is, of course, the personal interaction and really the development of getting a feel of how the other person really takes also personally and when you can make a statement about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.855,
    "end": 5581.997,
    "text": " what's actually happening in true life out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5582.557,
    "end": 5584.298,
    "text": "That's, of course, very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5584.358,
    "end": 5587.36,
    "text": "Unfortunately, not possible via Zoom calls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5588.641,
    "end": 5600.71,
    "text": "But so I can only urge everybody that we should be aware that when we fly around the world, we better make it worth the while and don't do this only for a couple of days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5602.731,
    "end": 5605.652,
    "text": " it made me think of a trilemma fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5605.732,
    "end": 5606.973,
    "text": "We could have met in person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5607.133,
    "end": 5609.294,
    "text": "We could have met in Iceland or something, somewhere in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.795,
    "end": 5618.579,
    "text": "There is an impact in the hardware and the bandwidth of a video call, and that impact is very cloaked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.439,
    "end": 5622.06,
    "text": "And then there's also machine learning models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.2,
    "end": 5626.783,
    "text": "And so maybe somehow, I don't know, if X is the impact of a flight,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.853,
    "end": 5646.704,
    "text": " is a video call 0.1 or one thousandth or one millionth of a flight and making some of these impacts that are very real clearer so that we can design events that are policies that align with our preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.659,
    "end": 5659.923,
    "text": " to reduce our uncertainty and to connect socially, but also to pragmatically keep certain ecological parameters within a region that we can thrive in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.803,
    "end": 5662.584,
    "text": "Yes, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5662.624,
    "end": 5663.624,
    "text": "That would be good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.644,
    "end": 5673.067,
    "text": "I mean, a video call is certainly even less than a million, I think, from a flight, although, of course, it is significant, but it's, I mean, incomparably less.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5674.834,
    "end": 5701.231,
    "text": " uh and but nonetheless one has to be of course also be aware that um yeah unfortunately we are in a situation where we really need global efforts so one cannot really point fingers to individual persons because we need global policy changes to save our own world and our future of our children and i have three kids and i'm very concerned",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5703.865,
    "end": 5708.346,
    "text": " Do you have anything that you'd like to just leave us with, or that's a perfect closing note?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5710.386,
    "end": 5712.867,
    "text": "No, I don't want to leave on the downside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5713.247,
    "end": 5718.028,
    "text": "Um, it was a great pleasure to, to do this, uh, with you guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.108,
    "end": 5725.31,
    "text": "And now we drift a little bit to the climate situation and I'm, I'm thankful that we also can talk about this a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.63,
    "end": 5731.851,
    "text": "And, uh, but I hope it's, I mean, it's hopefully also see that it's an amazingly exciting topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5732.82,
    "end": 5758.659,
    "text": " and not only one inside how our human mind works and how we manage to be as intelligent but also as limited as we are in the end and um but meanwhile also i think it has certainly ai is um is amazingly developing over the last couple of years and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.96,
    "end": 5763.242,
    "text": " Yes, and there, I guess, also things go so fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5763.322,
    "end": 5769.184,
    "text": "So it's important that we think about the dangers of AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5769.324,
    "end": 5786.953,
    "text": "And unfortunately, as we have seen with Cambridge Analytica, it's only an example of what is going on right now in terms of AI-driven targeted influence of our own selves and our way we think about stuff and our beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5787.779,
    "end": 5800.342,
    "text": " And hopefully we will manage also to foster this awareness of this and thus be more ready to counteract it and find back to our beautiful human social abilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5801.852,
    "end": 5805.993,
    "text": " Thank you for that excellent and uplifting note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5806.734,
    "end": 5808.394,
    "text": "It was really an honor, Martin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.414,
    "end": 5812.296,
    "text": "So thanks again for the presentation and the chat really appreciated as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.076,
    "end": 5819.278,
    "text": "You and any colleagues are always welcome to come on a live stream or to get involved in the Act Inflab in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.538,
    "end": 5824.2,
    "text": "So this was just a great conversation and it was hopefully very informative for our audience as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.387,
    "end": 5826.428,
    "text": " I hope so too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.569,
    "end": 5829.952,
    "text": "Thanks for inviting me here and thanks for running this lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5830.032,
    "end": 5834.818,
    "text": "It seems to be a really good group and I hope we can stay in contact over the next months and years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.779,
    "end": 5836.119,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5836.2,
    "end": 5836.52,
    "text": "We will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.641,
    "end": 5837.921,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5838.722,
    "end": 5839.143,
    "text": "Take care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.363,
    "end": 5839.643,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.884,
    "end": 5840.064,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5840.945,
    "end": 5841.265,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.345,
    "end": 5841.666,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]