[
  {
    "start": 6.578,
    "end": 35.37,
    "text": " hello and welcome it's december 10th 2024 we're in active inference art stream number 4.1 with corinne kukunin and federico and bruno guests today we'll be discussing literature as uncertainty practice creative encounters with the world there will be a presentation followed by some comments and discussion so thank you all for joining and to you corinne for the presentation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.207,
    "end": 39.95,
    "text": " Thank you, Daniel, for inviting me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 41.291,
    "end": 55.567,
    "text": "I'm speaking here from the Norwegian Institute in Rome, and I'm very much looking forward to the responses from Bruno and Federico, and whatever questions may come up in the chat later on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 57.169,
    "end": 61.874,
    "text": "I'm going to talk about predictive processing in relation to literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 61.914,
    "end": 65.998,
    "text": "From the one side, looking at ways in which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 67.092,
    "end": 88.425,
    "text": " we can use the framework of predictive processing in order to make sense of what literature is and what it does, but also going the other way, thinking about what elements of predictive processing literature might pose a challenge for or provide a very interesting case study to perhaps provoke further discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 90.177,
    "end": 97.785,
    "text": " A lot of what I'm going to say is based on my book Probability Designs, which came out with Oxford University Press in 2020.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 98.706,
    "end": 100.708,
    "text": "I'm going to introduce the concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.209,
    "end": 108.176,
    "text": "I'm going to relate it to the concept of form, which is a concept that is much used in literary studies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 109.097,
    "end": 113.201,
    "text": "I'm going to raise the question of what makes literature different from other art forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 114.082,
    "end": 119.728,
    "text": "And I'm going to link that to a very particular kind of cognitive work that literary form",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.012,
    "end": 124.736,
    "text": " the long-form written of a novel enables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.397,
    "end": 137.808,
    "text": "And then in a final move, I'm going to talk about the ways in which literature works as an uncertainty practice in the world and what this has to do with the general experience of contingency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 139.629,
    "end": 142.972,
    "text": "So let's start with the probability designs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 143.893,
    "end": 147.576,
    "text": "And being a literary scholar, I'll start with the textual example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.616,
    "end": 149.698,
    "text": "This is from Virginia Woolf's novel",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 150.033,
    "end": 164.868,
    "text": " Orlando, which is a novel where the main character starts as a man in the Renaissance, then suddenly turns into a woman in the 18th century and carries on as a woman until about the 20th century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 164.888,
    "end": 168.251,
    "text": "At this point in the book, we're still in the Renaissance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.012,
    "end": 178.622,
    "text": "Young Orlando has decided to become a poet until one day he looks out of the window and sees those blended natural green in the garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.193,
    "end": 184.057,
    "text": " After that, and here I quote Virginia Woolf, of course he could write no more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 184.578,
    "end": 187.441,
    "text": "Green in nature is one thing, green in literature another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.161,
    "end": 190.884,
    "text": "Nature and letters seem to have a mutual antipathy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 191.364,
    "end": 193.866,
    "text": "Bring them together and they tear each other to pieces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 194.547,
    "end": 199.772,
    "text": "The shade of green Orlando now saw spoiled his rhyme and split his meter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.133,
    "end": 205.417,
    "text": "So what we have here on a very basic level is of course a prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 205.757,
    "end": 207.799,
    "text": "He wanted to become a poet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.336,
    "end": 213.342,
    "text": " He looks outside the windows, he sees something surprising and he changes his plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.283,
    "end": 217.888,
    "text": "In terms of a narrative, such prediction errors would be plot events.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 218.128,
    "end": 225.437,
    "text": "Here, something happens that changes fundamentally the trajectory of the further course of the narrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 225.717,
    "end": 232.966,
    "text": "Orlando leaves his desk and his plans of becoming a writer and what is likely to happen next in the novel has just changed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.628,
    "end": 237.111,
    "text": "These prediction errors are, of course,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 237.428,
    "end": 246.42,
    "text": " modulated with precision, with our sense of just how good that information is, just how reliable it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.78,
    "end": 251.266,
    "text": "And in literary texts, that is quite often tied to the character's perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 251.306,
    "end": 256.353,
    "text": "So it's Orlando who sees that green as part of his perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.373,
    "end": 264.904,
    "text": "And it's very often also tied to the embodied experience of the characters and the way in which they're positioned in the fictional world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.61,
    "end": 287.191,
    "text": " In particular, in the long form of the novel, and this has been discussed in literary studies for a very long time, at least since Michael Barthin's idea that the novel is a polyphonous genre, a genre of many voices, you usually have multiple different perspectives on the character level, but also on the level of the narrator who can be more or less reliable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 287.892,
    "end": 294.638,
    "text": "So that's very much part of a standard setup for the novel to have these multiple different",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.938,
    "end": 295.999,
    "text": " perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.281,
    "end": 305.751,
    "text": "But it's not just the spatial positioning that gives precision in a literary text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.991,
    "end": 309.055,
    "text": "It is also on the level of temporality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 309.796,
    "end": 319.728,
    "text": "So if we take the last sentence, it has a particular rhythm that changes midway through the sentence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 320.529,
    "end": 323.713,
    "text": "So the shade of green Orlando is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 324.2,
    "end": 330.628,
    "text": " Then you have the now-saw, where the rhythm sort of changes, and that's of course exactly the moment of the prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 331.469,
    "end": 338.218,
    "text": "Spoils his rhyme and spills his meter, the second half of the sentence moves into a trochaic foot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 338.859,
    "end": 350.173,
    "text": "Woolf, I think, very consciously repaces the sentence in order to make that prediction error not just something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.373,
    "end": 357.064,
    "text": " that we rationalize, but really something that you experience as a reader on a quite embodied level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 357.946,
    "end": 368.483,
    "text": "So also the pacing of the prose, the pacing of the language that we read works as precision and guides readers' attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 370.218,
    "end": 386.026,
    "text": " These features that Woolf chooses to modulate precision here, the different meters of verse, are of course very much tied to the period in which Orlando is at this point in the novel Renaissance poetry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.248,
    "end": 392.597,
    "text": "He's in the Renaissance where poetry is one of the dominant modes of literary expression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 392.898,
    "end": 398.363,
    "text": " And that takes me to the third level of the probability design, the precision expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 398.464,
    "end": 408.954,
    "text": "So expectations about where we're likely to find good precision, the kind of parameters within which we direct our attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 410.476,
    "end": 419.985,
    "text": "So the setting in the Renaissance, the fact that he writes poetry goes together with the choice of the meter here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 420.455,
    "end": 425.081,
    "text": " And Woolf, I think, quite systematically develops that as she moves through the different periods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.301,
    "end": 438.797,
    "text": "So when we're in the Victorian period, we read that sentences swelled, adjectives multiplied, lyrics became epics and lyric trifles that had been sentence, essays a sentence long, were now encyclopedias in 10 or 20 volumes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 440.779,
    "end": 444.544,
    "text": "You don't need to have read Dickens to know that Victorian novels are long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.305,
    "end": 449.55,
    "text": "And Woolf actually here even enacts, he's not just saying that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 449.8,
    "end": 455.127,
    "text": " Crows has a very long-winded format, long-winded syntax in Victorian novels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 455.588,
    "end": 462.917,
    "text": "She actually performs that here as well, again, drawing attention to the framework within which they're moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 463.318,
    "end": 476.095,
    "text": "So in literary texts, quite often, the genre or historically specific modes of writing provide precision expectations for readers and indicate where it is worth paying attention to while reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 478.505,
    "end": 498.567,
    "text": " So the probability design then brings together all three levels, the level of the plot and the prediction errors, the level of perspective and pacing and precision, and the level of different styles of writing, different kinds of intertextual references on the level of precision expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 499.988,
    "end": 504.613,
    "text": "It's an artful configuration of words that provides a design sensory flow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.914,
    "end": 508.538,
    "text": " and reshapes readers' generative models for the duration of reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.318,
    "end": 529.519,
    "text": "And that design sensory flow, I think, sits between the sort of everyday setting, where, of course, we have a sensory flow, but it's not designed, it's not ordered for us, and cases of, for example, dreaming or mind-wandering, where we're moving through the imagination.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.579,
    "end": 534.043,
    "text": "As Andy Clark says in Surfing Uncertainty,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 534.209,
    "end": 543.944,
    "text": " Such systems of dreaming and mind-wandering command a generative model capable of reconstructing the sensory signal using knowledge of interacting forces in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.565,
    "end": 558.286,
    "text": "That process of reconstruction, tuned and deployed in the presence of the sensory signal, paves the way for processes of outright construction, able to perform and develop in the absence of the usual sensory flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 558.867,
    "end": 563.153,
    "text": "So in the case of reading, we have an absence of the usual sensory flow,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 563.825,
    "end": 572.679,
    "text": " But that doesn't have to be reconstructed completely on the basis of what we already have, what we already know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 573.28,
    "end": 584.158,
    "text": "Instead, it is reconstructed on the basis of this design sensory flow of the literary text that provides us with prediction errors in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.238,
    "end": 586.221,
    "text": "But then, as I have shown,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 586.37,
    "end": 595.358,
    "text": " a whole set of different elements that also model how we inference on the level of precision and precision expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 598.501,
    "end": 606.749,
    "text": "What I talk about in terms of probability designs arguably can also be found in other kinds of artworks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 608.791,
    "end": 614.436,
    "text": "For example, in the case of painting, the composition would be a kind of probability design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 615.158,
    "end": 629.179,
    "text": " And for that case, the work of Kreuz and Blankemann is very interesting because they talk about the ways in which the composition of a painting has the capacity to create particular aesthetic emotions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.121,
    "end": 641.959,
    "text": "And that is tied to a faster than predicted rate of prediction error reduction, meaning that you see a painting and you're quite startled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.513,
    "end": 645.357,
    "text": " not easy to make out what it is that you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.758,
    "end": 661.842,
    "text": "But then because it is designed, because the painting has a composition, you can actually make sense of what you're seeing in front of you at a much faster rate than you would predict, at a much faster rate than what you would be able to do in a real world setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.882,
    "end": 670.815,
    "text": "And that creates a positive aesthetic emotion, even if the painting perhaps depicts something that would evoke quite negative emotions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.285,
    "end": 687.223,
    "text": " And I think something like that is certainly also true for literary probability designs, that they have a way of making you navigate that probability design at a faster than predicted rate of prediction error reduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 688.725,
    "end": 697.815,
    "text": "But I would also say that there are quite significant differences between paintings and literary texts just because of the way in which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 698.285,
    "end": 701.308,
    "text": " They're made the way the things of which they consist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 702.029,
    "end": 709.516,
    "text": "In reading literature, you usually have an engagement that extends over much longer periods of time than looking at a painting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.656,
    "end": 716.922,
    "text": "When you read a novel, you spend probably about a week with it, reading a couple of chapters here and a couple of chapters there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.963,
    "end": 724.95,
    "text": "So there is a way in which your everyday life and your reading process are folded into one another as you go through",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 725.318,
    "end": 728.663,
    "text": " reading that long-form fictional text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 731.227,
    "end": 740.2,
    "text": "Reading a novel also asks you to engage with visual stimulus, but that visual stimulus is a lot poorer than what you have in images.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.22,
    "end": 743.284,
    "text": "It's just black letters on a white page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.546,
    "end": 751.596,
    "text": "So there are quite important differences that I think it's important to keep in mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 752.656,
    "end": 777.077,
    "text": " Both literary texts as well as other art forms can create a feeling of presence in readers, and that's based on work that I've done together with Federico and colleagues, looking at presence, flow and narrative absorption, where we distinguish between motor intentions, that would be new handling the book and turning the pages,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 777.749,
    "end": 784.458,
    "text": " Proximal intentions, where you use language to enact or give sense to the actions of a character.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.919,
    "end": 790.887,
    "text": "So you experience embodied resonances around a character's movement, for example, while reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.488,
    "end": 793.971,
    "text": "That generates core presence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 794.832,
    "end": 803.484,
    "text": "And then there are also distal intentions, where you use the probability design to make accurate predictions of what a character will think or feel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 803.904,
    "end": 805.967,
    "text": "So you develop a kind of strategy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.42,
    "end": 812.149,
    "text": " or getting better of predicting what that character will do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.311,
    "end": 816.736,
    "text": "And that creates extended presence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 816.756,
    "end": 823.707,
    "text": "So it has a kind of second track or a meta track to the inferencing process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.028,
    "end": 833.963,
    "text": "And I think for the literary probability design, that level of the extended presence is where most of the really interesting thing happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.12,
    "end": 848.719,
    "text": " And I think that has to do with the way in which literary form or probability design can move beyond mimesis, can move beyond just representing something that is there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.759,
    "end": 855.529,
    "text": "I'll give you an example from a mid-18th century short story called The Nobleman.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.032,
    "end": 861.4,
    "text": " where a young woman is escaping from the chateau of her ancestors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.061,
    "end": 871.095,
    "text": "And she does that by taking the portraits of the ancestors off the wall and using them as plants to run across the mold around the chateau.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.677,
    "end": 876.243,
    "text": "Julie jumps lightly on the face of one of her ancestors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.723,
    "end": 880.109,
    "text": "As she leaves the chateau, she jumps on one of the portraits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 881.411,
    "end": 884.976,
    "text": "That face of her ancestors runs and snaps beneath her feet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.85,
    "end": 891.538,
    "text": " There is, of course, here a highly embodied language that invites embodied resonances in readers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 892.379,
    "end": 899.85,
    "text": "But at the same time, that design sensory flow also goes beyond the remit of real-world sensory motor contingencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 900.691,
    "end": 913.849,
    "text": "I mean, I'm not sure it's possible to actually walk across canvas on water and not sink, or I'm not sure how fast you need to run for that exercise to work out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 914.352,
    "end": 918.817,
    "text": " That, however, is usually not a question that we ask ourselves when we read that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 919.698,
    "end": 927.227,
    "text": "And that is, I think, because on the level of the probability design, all of that hangs together, all of that has its logic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.828,
    "end": 942.705,
    "text": "It is, of course, very funny, very ironic that she uses exactly the elements indicating the authority of her ancestors, the portraits, for her getaway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 942.871,
    "end": 949.918,
    "text": " So on the logic of the probability design, all of that hangs together, all of that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 950.659,
    "end": 966.114,
    "text": "And that enables the literary text, even though it draws very much from embodied resonances, to move away from real world sensory motor contingencies and to reshape the inferences that are available to us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 969.697,
    "end": 970.498,
    "text": "Moreover,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 970.698,
    "end": 980.69,
    "text": " Beyond these non-mimetic moments, literary texts very often invite what Pizzolo and colleagues have called epistemic active inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 981.431,
    "end": 988.46,
    "text": "That is, you want to make a change in the world in order to see what provides better information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.64,
    "end": 992.685,
    "text": "And in the case of epistemic active inferences, you would do that in your head.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 992.706,
    "end": 998.713,
    "text": "You would scope for information by manipulating the environment mentally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.098,
    "end": 1001.181,
    "text": " Readers, I think, constantly do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1001.241,
    "end": 1012.917,
    "text": "You're constantly constructing alternative scenarios along the lines of, oh, if she hadn't done that, or that character really should have come in time, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.099,
    "end": 1016.763,
    "text": "You constantly project alternative outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.083,
    "end": 1019.386,
    "text": "Sometimes texts even give you prompts for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1019.867,
    "end": 1027.738,
    "text": "But these epistemic active inferences that forward-scoping while reading is a fundamental part of the reading process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1028.022,
    "end": 1040.057,
    "text": " And I think it is most prominent or most noticeable when you read a book again that you've read several years ago, because it then quite often turns into a very different experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.077,
    "end": 1046.426,
    "text": "The kind of sense that you make of it, the meaning that it has for you tends to be very different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1046.586,
    "end": 1053.034,
    "text": "Just to give a banal example, reading Anna Karenina before and after a divorce,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1053.301,
    "end": 1059.29,
    "text": " I, in fact, would have a very different kind of experience that goes with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.051,
    "end": 1081.182,
    "text": "And I think that is to do with the fact that, yes, we're reading the same text, yes, the plot events do not change, but the small inferencing processes that we run as readers, these epistemic active inferences, are very much to do with the online present reading process, and they're fundamental to the kind of meaning that we configure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1081.6,
    "end": 1093.534,
    "text": " out of reading a novel and that changes of course between different iterations of reading a text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1093.554,
    "end": 1105.448,
    "text": "A second element that I think is quite specific to a literary probability design is the way in which novels allow you to explore inner states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.221,
    "end": 1114.612,
    "text": " Of course, the novel has traditionally been considered as the cultural technology for the exploration of the United States.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.632,
    "end": 1120.48,
    "text": "And I think there is a predictive processing story to that insight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.461,
    "end": 1130.693,
    "text": "And it is to do with what Andy Clark in his 2013 BBS piece called The Darkroom Problem, where he poses the problem of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1131.044,
    "end": 1139.492,
    "text": " Well, if we want to minimize prediction errors, why do we not just close the door, shut the blinds and turn off the lights?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.533,
    "end": 1154.927,
    "text": "One of the responses or the possible solutions that have been put forward for this darkroom problem by Pizzulo and colleagues is to say, well, actually, there is an interoceptive and an extraoceptive aspect to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1154.987,
    "end": 1159.752,
    "text": "We keep our interoception very stable, so we don't want to have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1160.288,
    "end": 1162.571,
    "text": " a heart that beats very fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.591,
    "end": 1164.012,
    "text": "We don't want to be out of breath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1164.073,
    "end": 1166.455,
    "text": "We don't want our tummies to be upset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.475,
    "end": 1175.506,
    "text": "And if we keep that stable, then we can be very adventurous, exploring, exoception exploring the outside world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.607,
    "end": 1181.293,
    "text": "And I would suggest that in the case of reading, actually the opposite is the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.353,
    "end": 1183.676,
    "text": "We keep exoception very stable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.597,
    "end": 1186.279,
    "text": "We don't want to be distracted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1186.529,
    "end": 1198.862,
    "text": " We focus on this very poor stimulus of just words on the page, keeping whatever attracts our extra reception quite static.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1199.383,
    "end": 1212.196,
    "text": "And that then in turn allows us to be quite adventurous when it comes to exploring our instincts, the ways in which we respond to what we've read, very much emotional responses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.537,
    "end": 1215.76,
    "text": "And in the work of Lisa Feldman Garrett, Interception,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.111,
    "end": 1222.84,
    "text": " has of course been tied within a predictive processing framework to emotional processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1224.121,
    "end": 1237.438,
    "text": "But I think also things like linking that to mind wandering, et cetera, would fall within this exploration of inner states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1238.059,
    "end": 1241.443,
    "text": "So the novel as the cultural technology exactly because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1241.744,
    "end": 1249.793,
    "text": " it is so stable when it comes to the stimulus, allows for an exploration of interception and in these days.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.355,
    "end": 1267.313,
    "text": "There is the second aspect to that, which is perhaps even more speculative, and that is to do with the way in which embodied resonances might be affected by the fact that we're reading that as letters on the page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1268.002,
    "end": 1276.595,
    "text": " So in a study by Schirgel and Ohl, they were interested in the ways in which you can get around sensory attenuation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.655,
    "end": 1286.77,
    "text": "So the ways in which you can lift the attenuation of the sensory feedback that you don't want to have while you're moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.851,
    "end": 1292.278,
    "text": "They used the case of the escalation of force.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.298,
    "end": 1295.983,
    "text": "So if someone pushes at you and you ask to push back,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1296.402,
    "end": 1306.894,
    "text": " to the same degree you will usually push harder than the pushing that comes against you, exactly because you don't have a very good sense of how hard you're actually pushing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1308.816,
    "end": 1320.549,
    "text": "That kind of fourth escalation can be apparently avoided if you use a kind of interface that redirects what it is you're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.33,
    "end": 1325.194,
    "text": "And arguably words on the page are a similar kind of interface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1325.41,
    "end": 1336.742,
    "text": " So using an interface for pushing that redirects movement in this case would limit sensory attenuation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.762,
    "end": 1339.69,
    "text": "You would have a better sense of what you're actually doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.092,
    "end": 1342.234,
    "text": " in an embodied sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1342.935,
    "end": 1347.659,
    "text": "And perhaps also embodied resonances of words of a page might have a similar effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.899,
    "end": 1355.767,
    "text": "Now, like I said, this is quite speculative, but I think it would be interesting to see whether there is some kind of empirical reality to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1357.028,
    "end": 1369.66,
    "text": "And it would go together, I think, with this idea that literary texts as an exploration of inner states allow for a more precise investigation of what's going on within us than",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1370.213,
    "end": 1372.915,
    "text": " basic offline thinking would enable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1376.098,
    "end": 1389.891,
    "text": "The element of reflection can also be tied, I think, very much to the way in which precision is modulated in probability designs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1390.632,
    "end": 1397.318,
    "text": "And here I suggest that literary texts have a way of constantly providing what I call metafictional nudges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1397.703,
    "end": 1403.829,
    "text": " The nudges that provide a better perspective on the kind of immersive experience that you're having.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.19,
    "end": 1422.347,
    "text": "I take the term of the nudge from John Sutton's work on sports performance, where he talks about cricketers who use words for self-cueing so that they can sculpt the ongoing flow of motion by saying things like, battle up or keep the battle on, something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1422.548,
    "end": 1427.052,
    "text": "So you adjust what it is you're doing in the flow of the action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1427.302,
    "end": 1431.627,
    "text": " And I think that's exactly what very often happens in literary texts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1431.747,
    "end": 1438.754,
    "text": "I've given one example here from Francis Buffet's, The Golden Hill, where we're in the middle of a duel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1439.555,
    "end": 1444.42,
    "text": "Septimus disengaged with a wrath of steel and lunged lower in seconde.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1445.061,
    "end": 1448.524,
    "text": "Smith replied in quarte quinte six prime seconde.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.005,
    "end": 1456.633,
    "text": "But this is really useless and no more enables the reader to see the battle than if I shouted numbers at you, which indeed I appear to be doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.305,
    "end": 1481.052,
    "text": " So here you've got exactly that shift from a quite immersive description to these French numerals, which of course indicate fencing positions, first working as quite integrated, quite subtle metafictional nudges, and then being taken up by the narrator to a full blown metafictional, metanarrative reflection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1481.757,
    "end": 1490.266,
    "text": " And that's something that happens quite commonly in literary texts and I think invites readers exactly for that kind of shift of levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1492.488,
    "end": 1503.94,
    "text": "Also, the interconnectivity of texts that I've talked about in terms of that third order level is something that I think allows literary texts to do some quite particular kind of cognitive work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.541,
    "end": 1510.347,
    "text": "And here my example is a novel called La Decomposición by Angareta, where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1510.883,
    "end": 1517.151,
    "text": " The main character is a serial killer who works on the basis of Proust's In Search of Lost Time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1517.171,
    "end": 1530.567,
    "text": "And the rule that he gives himself is that he takes up a volume of Proust, identifies a character, say Madame de Lanoue, counts when she appears in a given part of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.687,
    "end": 1534.792,
    "text": "So she would be character number 37 who appears in that part of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.093,
    "end": 1538.697,
    "text": "Then he goes and sits in a park and counts the passersby.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1539.689,
    "end": 1552.066,
    "text": " Number 37, if it is a woman, he will go after them and kill them and then go home and open an electronic copy of Proust's novel and remove that character from it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.847,
    "end": 1565.325,
    "text": "So here we have a case of a very strong emphasis on that intertextual dimension, that precision expectation dimension, and that is highlighted even on the level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.626,
    "end": 1568.15,
    "text": " of the words that she uses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.19,
    "end": 1588.579,
    "text": "For example, after the description of the kill rule, the narrator says, de bonne heure, vous allez vous coucher, with happiness, joyfully, you're going to bed, which is a riff on the first sentence of Proust's novel, where it's de bonne heure, so early, I used to go to bed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1589.437,
    "end": 1600.851,
    "text": " So Galata quite systematically uses not only the character repertoire of Proust, but also the language to establish that interconnectivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1602.112,
    "end": 1611.043,
    "text": "And I think that allows readers to reflect both on the rules and predictabilities of what's going on in that novel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.224,
    "end": 1617.891,
    "text": "But it also allows them to reflect on where they actually take their expectations from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1618.462,
    "end": 1621.766,
    "text": " I mean, is it the crime novel, the serial killer narrative?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1622.968,
    "end": 1630.378,
    "text": "Is it the crime society, modern novel for which Proust stands?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.038,
    "end": 1647.54,
    "text": "So as we're exploring that mental library, this is something you can do in the literary text exactly because it provides scaffolding for it, because it ties it to different characters, to titles of novels, to ways of writing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1647.993,
    "end": 1649.315,
    "text": " etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1649.355,
    "end": 1676.987,
    "text": "So that exploration of the mental library of different kinds of precision expectations or sets of precision expectations, and that is a term I take from Pierre Barrière, the mental library, is also, I think, something quite particularly suited for literary texts, because it allows a moment of stability and it makes these precision expectations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1677.203,
    "end": 1681.889,
    "text": " perceptible by highlighting them and making them part of the story itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1683.752,
    "end": 1694.746,
    "text": "So to summarize briefly, what I think is quite particular about literary probability designs is the huge space they give to epistemic active inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1695.808,
    "end": 1700.333,
    "text": "It's the enabling of the exploration of inner states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1701.295,
    "end": 1706.822,
    "text": "And I think that's in particular linked to this long form written text where you keep coming back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1707.157,
    "end": 1712.425,
    "text": " to the same fictional world while your everyday life is going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.028,
    "end": 1731.375,
    "text": "And thirdly, that it allows you to attend to precision expectations, this third order level of cognition, which in an everyday setting, in the ongoing flow of action, you cannot really attend to quite as easily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1731.743,
    "end": 1749.74,
    "text": " So the long form written probability design of the novel enables you to do all of that cognitive work to an extent which is hardly imaginable in an everyday context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1750.481,
    "end": 1759.81,
    "text": "I think all of that is tied to form and probability designs very much corresponds to a general notion of form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1760.532,
    "end": 1772.543,
    "text": " And I take my understanding of form from Friedrich Schiller's book on the aesthetic education of mankind, where he sees form as the means to provide freedom for the human mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1772.723,
    "end": 1781.231,
    "text": "And here, of course, the epistemic act of inferences, this roaming of the mind, is one element that's quite important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1782.212,
    "end": 1789.358,
    "text": "But that, I think, is made possible by the scaffolding provided in the literary text exactly through that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1789.726,
    "end": 1795.934,
    "text": " designed sensory flow that keeps these movements discernible and thinkable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.417,
    "end": 1810.833,
    "text": "That understanding of form as a space of freedom, as a space where you can watch yourself think, is quite different from how form is generally understood, certainly in literary studies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1811.655,
    "end": 1813.557,
    "text": "Caroline Levine's recent book,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1813.891,
    "end": 1819.379,
    "text": " forms, which has been very influential in literary studies as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.419,
    "end": 1822.324,
    "text": "There are social forms and there are also aesthetic forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1822.424,
    "end": 1838.008,
    "text": "So social forms, for example, would be the layout of the classroom and the aesthetic form of the novel can pick that up and integrate it, for example, in a novel like Jane Eyre, where we have a classroom setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.102,
    "end": 1845.731,
    "text": " And she makes a very interesting argument, I think, about the commensurability between aesthetic and social forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1845.751,
    "end": 1854.702,
    "text": "But she also insists that forms as designed arrangements are deliberately crafted to impose order, just like art objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1855.684,
    "end": 1859.068,
    "text": "And I think that is perhaps",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1859.774,
    "end": 1871.668,
    "text": " a little further than I'm willing to go, because certainly probability designs provide patterns, they provide scaffoldings for us to give structure to the experience of reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1872.049,
    "end": 1875.713,
    "text": "But I don't think they very strictly speaking impose order.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.733,
    "end": 1888.549,
    "text": "For Levine, the only way in which literary forms can create contingency can create a sense of that things don't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.951,
    "end": 1900.568,
    "text": " necessarily are the way in which they appear to us now, that there is always an alternative, that happens when you have different kinds of form collide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.089,
    "end": 1907.638,
    "text": "But form in and of itself wouldn't give space to that kind of contingency exactly because it imposes order.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1908.94,
    "end": 1918.654,
    "text": "And I think the probability design idea allows you to rethink the role of contingency in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.984,
    "end": 1931.703,
    "text": " literary forms, and I've explored that in particular in my most recent project, where I look at how authors create probability designs, how they write their novels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1932.624,
    "end": 1942.38,
    "text": "And there I suggest that contingency not only plays an enormous role in the creative process itself, but it is actually inbuilt in literary form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1942.85,
    "end": 1954.545,
    "text": " that also deploy form to integrate contingency into their text to always leave space for alternative ways of interpreting things, making that available to readers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1955.406,
    "end": 1959.111,
    "text": "So form, of course, encompasses contingency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1959.131,
    "end": 1961.574,
    "text": "It is a contingency trap, as I suggest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1962.355,
    "end": 1972.468,
    "text": "But it's the kind of trap that you see at the bottom where the mouse will be caught, but it can still run around and it gets stabilized enough for you to observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1972.634,
    "end": 1974.276,
    "text": " the kind of things it's actually doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.598,
    "end": 1981.146,
    "text": "Form is not the kind of contingency trap that you can see at the top that just kills the mouse dead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1981.186,
    "end": 1995.587,
    "text": "To give you an example of what one of these contingency traps looks like, I'll briefly talk about Italo Calvino's Castle of Frost Destinies, where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.787,
    "end": 2010.631,
    "text": " In the very process of narration, you have this very aleatory, chance-based composition process where tarot cards are placed on the table and the narrators develop their narrative from the cards that they draw and place on the table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.132,
    "end": 2014.677,
    "text": "So on the level of narration, we have a representation of contingency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.158,
    "end": 2021.288,
    "text": "But much more interesting, it also thematizes the way in which contingency is inbuilt in the form itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.875,
    "end": 2032.309,
    "text": " Because in the first iteration of that narrative technique, the middle point, the middle spot of the tarot cards remains empty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2033.331,
    "end": 2044.746,
    "text": "And this is work by Natalie Berkman, who suggests that this is a case of the klinamen, the swerve or deviation from the planned protocol.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2046.609,
    "end": 2049.132,
    "text": "The swerve or klinamen,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2049.483,
    "end": 2062.94,
    "text": " in terms of a probability design would be an unspecified element that provokes further inferencing because the middle spot in this terror tapestry is kept empty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2063.0,
    "end": 2066.244,
    "text": "You can always generate new stories out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2066.844,
    "end": 2073.853,
    "text": "And similarly, literary texts always need to have some kind of flaws, something that doesn't add quite up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2074.475,
    "end": 2080.924,
    "text": " in order to provide exactly the space to explore contingency while reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2081.264,
    "end": 2097.486,
    "text": "So I think in the very design of a probability design, there are very often these moments of a break or a flaw that enable these freer formal patterns of inferencing and meaning making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2097.506,
    "end": 2103.874,
    "text": "With that in mind, I want to come to the last part of my talk, where I address the issue of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2104.175,
    "end": 2109.523,
    "text": " how literature works as an uncertainty practice in the real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.725,
    "end": 2129.473,
    "text": "And here I draw on an article that I published last year, where I also draw on the piece by Miller and colleagues, where they talk about the value of uncertainty in the context of algorithms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2130.331,
    "end": 2136.622,
    "text": " and the way in which algorithms make volatile environments more manageable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.785,
    "end": 2152.812,
    "text": "They talk about personalization algorithms, so like when you order a book and you get five recommendations on the basis of what you've ordered before, these kinds of mechanisms that make the world more predictable, more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2152.977,
    "end": 2156.24,
    "text": " according to how you've behaved in the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2156.861,
    "end": 2165.75,
    "text": "But they also have a very interesting example of someone who programs an app on his phone that randomizes his food deliveries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.41,
    "end": 2168.993,
    "text": "So he never knows what he gets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.093,
    "end": 2179.423,
    "text": "So you can use these technologies to go in both directions and make sense of the volatile environments that we live in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2180.247,
    "end": 2206.204,
    "text": " They briefly touch on literature in that article and they say that it's a safe space or a safe kind of environment for exploration, which in a way I think goes together with a lot of things that have been said about literature in a sort of larger context where this is the space where your actions wouldn't have consequences, where the killer from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2206.505,
    "end": 2210.612,
    "text": " Galeta's novel doesn't come out of the novel to get to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.012,
    "end": 2214.558,
    "text": "But of course, you can also not save any of the characters in the novel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.299,
    "end": 2222.732,
    "text": "So it is a space of its own where you don't need to fear consequences of action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.832,
    "end": 2224.955,
    "text": "So in that sense, of course, it is safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.897,
    "end": 2231.466,
    "text": "But I think it is a lot more than just a curated space for thought experiments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.454,
    "end": 2254.078,
    "text": " I think it is a lot more than that, exactly because of the ways in which reading a literary text has a way of tying itself into your everyday experience as you do that over multiple weeks, because of the ways in which it draws attention to your reactions to what you're reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2254.379,
    "end": 2264.015,
    "text": " So, for example, in La Décomposition, Madame de Saint-Loup, or the person identified as Madame de Saint-Loup by the killer, actually gets away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2264.055,
    "end": 2269.664,
    "text": "And that goes very much against what the whole novel was set up to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.546,
    "end": 2278.078,
    "text": "And I think at that point, you would perhaps ask yourself why... Perhaps you share the disappointment of the killer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.198,
    "end": 2280.522,
    "text": "Then you might ask yourself why you do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2281.092,
    "end": 2285.439,
    "text": " Or you don't do that, and then you're wondering where the novel is going to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.842,
    "end": 2300.485,
    "text": "So the way in which the literary text is set up, making things uncertain or contingent, is often also an invitation to reflect on how you react to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.532,
    "end": 2311.109,
    "text": " yourself, both with the exploration of inner states, but also in tandem with the metafictional nudges that I was talking about earlier on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.652,
    "end": 2326.354,
    "text": "And I think that even applies for the question of precision expectations, where the way in which this is set up in Galata, to stay with that example, from the moment that Madame de Saint-Loup gets away,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.621,
    "end": 2331.828,
    "text": " we've got continually new iterations of different character kills in different narrative modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2332.63,
    "end": 2342.163,
    "text": "There even is an evocation of an ego shooter, where the killer basically depopulates the entire world in search of lost time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2343.465,
    "end": 2356.003,
    "text": "And that variation of narrative speed, I think, is a way of drawing attention to the different regimes of attention that we go through",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2356.22,
    "end": 2359.744,
    "text": " in that novel, the ego shooter going very fast, very quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.765,
    "end": 2367.034,
    "text": "And of course, Proust's novel, because of the way in which he writes and how long the thing is, which goes very slowly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2367.134,
    "end": 2378.228,
    "text": "So that would allow, for example, for reflecting on the different kinds of accelerations or attention ratios that we operate in while you're reading that novel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.625,
    "end": 2388.274,
    "text": " The other type of self actually in an interview draws attention to the way in which the experience of reading a book is by no means a safe environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2388.314,
    "end": 2391.157,
    "text": "She says it reorders the circulation of your affects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.877,
    "end": 2396.943,
    "text": "It manipulates your desires, your perceptions, your efforts in ways that are not predictable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2399.285,
    "end": 2405.211,
    "text": "So literature to conclude my presentation and its probability designs are actually quite strange.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.427,
    "end": 2418.981,
    "text": " Think about Julie running across the portraits of her ancestors and not exactly safe because they've constantly forced you to reflect on what's going on, to reflect on how you think about yourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2419.461,
    "end": 2428.05,
    "text": "They have the potential to, at least while the reading process is going on, to reshape the generative model with this design sensory flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.75,
    "end": 2433.375,
    "text": "And they make elements of cognition that are usually invisible available to reflection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2434.064,
    "end": 2439.832,
    "text": " So they enable creative, contingent ways to rethink yourself and the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2440.193,
    "end": 2445.06,
    "text": "And I think that's as much as we can ask of any kind of cultural technology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.42,
    "end": 2445.901,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2454.974,
    "end": 2455.635,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.895,
    "end": 2457.017,
    "text": "Karin was really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.908,
    "end": 2466.078,
    "text": " fascinating account of how literature can be seen through the lens of predictive processing and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.4,
    "end": 2477.894,
    "text": "And I think I would like to, because you dived in really directly into how to do this, how to use this framework to think about literature and how readers engage with the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.075,
    "end": 2482.92,
    "text": "But maybe I have a question that can be interesting for a broader audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.575,
    "end": 2508.639,
    "text": " So what do you think that this perspective is offering that is new or that is more effective in terms of how we can better explain what's going on in literature and when we engage with literature in comparison to existing frameworks or alternative theories that deal with similar aspects of literature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.981,
    "end": 2512.823,
    "text": "That is an enormous question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.423,
    "end": 2529.817,
    "text": " I think one of the reasons why I've decided to spend quite a lot of time with predictive processing to think about literature is that it allows you to look at multiple levels together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.097,
    "end": 2537.944,
    "text": "So it allows you to think about the plot, but also how that's connected to the character and how they move through the fictional world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.505,
    "end": 2542.168,
    "text": "And then you can also make links to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.705,
    "end": 2548.994,
    "text": " very particular kind of genre protocols, for example, or intertextual links.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2550.116,
    "end": 2571.548,
    "text": "So I think because of the way in which it works across different levels and still the flexibility that I see in the model, what I like about it in terms of thinking about literature and why I think it's effective is that it actually allows you to think things together that traditionally in literary studies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2571.865,
    "end": 2573.547,
    "text": " we don't think together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2573.587,
    "end": 2580.154,
    "text": "So character and plot are usually two different strands of things that you're looking at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.318,
    "end": 2584.88,
    "text": "Yeah, well, good answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.54,
    "end": 2601.298,
    "text": "And actually made me think about another maybe issue that it's very often debated or maybe not enough debated sometimes in literary theories and is about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.004,
    "end": 2610.6,
    "text": " the need or the possibility, actually, to have a comprehensive and universal theory of narrative, of fiction, of literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.502,
    "end": 2617.633,
    "text": "And by what you've said, and also this is my impression in other reflections, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.103,
    "end": 2636.966,
    "text": " But it seems like that something like the predictive processing framework and active difference, similar to how they've been proposed in the cognitive sciences, can aim at being this overarching theory for describing and explaining different aspects of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.986,
    "end": 2638.828,
    "text": "And so my question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.399,
    "end": 2641.942,
    "text": " Do you think this is desirable and it's possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.102,
    "end": 2658.763,
    "text": "And how this can go together with the need that has been expressed multiple times in the humanities of having different perspectives and different people with different theories that can actually bring us to a deeper knowledge of a phenomenon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.146,
    "end": 2664.731,
    "text": "Again, a very big question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.574,
    "end": 2668.275,
    "text": "I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.032,
    "end": 2695.14,
    "text": " with predictive processing you can ask very different questions of a text and you're not tied to so if we're thinking about universals that very often comes with a category or a set of categories so i don't know four different character types and then you've got everything in compass",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2696.133,
    "end": 2703.925,
    "text": " So it very often comes with a top-down imposition of boxes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.466,
    "end": 2706.409,
    "text": "So you've got the hero and the helper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.429,
    "end": 2713.82,
    "text": "And just to take a very basic example of Bob's fairytale studies, the structuralist morphology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2715.843,
    "end": 2720.47,
    "text": "What I like about predictive processing is that you can do that bottom up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2721.572,
    "end": 2724.216,
    "text": "You don't have to look for a particular",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.483,
    "end": 2727.067,
    "text": " character category in a text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.328,
    "end": 2743.349,
    "text": "So you can, with that, account for any number of narratives without presupposing hard distinctions between types or structural boundaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2744.13,
    "end": 2752.161,
    "text": "Instead, you can trace how the text or the novel itself establishes those categories or keeps them open.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.327,
    "end": 2762.179,
    "text": " I think that is a lot more common in literary novels that the villain and the hero are not very easily to be distinguished.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.521,
    "end": 2777.878,
    "text": "So I think one of the attractions is this bottom-up element to predictive processing, or that it allows you to do bottom-up analysis that can all be analysed with the same analytical vocabulary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2781.47,
    "end": 2782.351,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.412,
    "end": 2785.234,
    "text": "Yeah, I like the perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.915,
    "end": 2792.101,
    "text": "And I'd like to ask your last question before letting the floor to Bruno.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.842,
    "end": 2799.329,
    "text": "And I know that in your work, it's an example of how you presented this today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.389,
    "end": 2803.213,
    "text": "You look at texts from different epochs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.234,
    "end": 2804.395,
    "text": "Not just contemporary material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.415,
    "end": 2811.122,
    "text": "I'd like to look at how this theory can work with texts from the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.305,
    "end": 2816.691,
    "text": " I've always wondered how this can work well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.038,
    "end": 2828.429,
    "text": " this way of looking at the text and thinking about a probability, so kind of cognitive process that readers are doing or hypothetical readers are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.449,
    "end": 2840.021,
    "text": "And how do you, in your experience, in your analysis of several literary works that you've done, how well do you think this is applicable to text from the past?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.042,
    "end": 2842.383,
    "text": "Or where do you see the limitations are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.707,
    "end": 2846.728,
    "text": "So I think it is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2847.35,
    "end": 2848.772,
    "text": " very well applicable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2849.192,
    "end": 2858.202,
    "text": "In fact, I got into predictive processing because one of the central categories of early modern literary theory is probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2859.403,
    "end": 2876.142,
    "text": "And I was working on 17th, 18th century literature, looking at ways in which how they thought about what was happening when people read, how that corresponds to current strands in cognitive science, our philosophy of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2876.797,
    "end": 2903.008,
    "text": " So for probability, I actually started from the early modern period where it was very important that the text was probable and went from there to see, well, actually predictive processing as a theoretical model works quite well to understand how these probability calculuses actually work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2903.388,
    "end": 2906.652,
    "text": "So interestingly enough, I came the other way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.323,
    "end": 2918.917,
    "text": " And certainly in the early modern period, the way you thought about many literary works, not all of them was, you know, not is it true or is it false, but is it probable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2919.117,
    "end": 2920.519,
    "text": "Is it well enough designed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.739,
    "end": 2926.245,
    "text": "Does it have a good enough plot to hold together so that you believe it, whether it's true or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2928.028,
    "end": 2935.997,
    "text": "So I think predictive processing works very well for, I think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.585,
    "end": 2944.856,
    "text": " I mean, one would have, of course, to put it to the test and one would have to apply it to medieval texts or ancient texts as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.357,
    "end": 2952.086,
    "text": "But certainly for the periods that I know, which is mostly the early modern periods, it works quite well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2953.968,
    "end": 2963.301,
    "text": "It would be interesting to see what would be the sort of limit cases where the idea that you've got an ongoing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.804,
    "end": 2969.661,
    "text": " calculus that the trajectory of the narrative is constantly updated, whether it wouldn't work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2969.681,
    "end": 2973.512,
    "text": "I think that would be very interesting to see what kind of narrative that was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.38,
    "end": 2976.801,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.624,
    "end": 2985.314,
    "text": " Okay, so I guess I'll just move on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.334,
    "end": 2989.265,
    "text": "Thank you for that lovely presentation and for sharing your book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.305,
    "end": 2991.712,
    "text": "It's been quite an interesting read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.033,
    "end": 2997.388,
    "text": "It's really changed a few things, how I think a few things in my field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.368,
    "end": 3024.928,
    "text": " um i just want to say that i come from a very different field um anthropology and archaeology but i think that a lot of what you say actually there's some parallels between the work that we've been doing um just to specify uh that worked mostly with the breakage of form and i'll ask a few questions about this um uh particularly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.583,
    "end": 3028.426,
    "text": " In terms of craft work, a lot of work I do is on craft work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.187,
    "end": 3040.5,
    "text": "And there's an interesting point you raise in the book about, and also in your presentation, about how reading, what makes literature so exceptional, in a sense, what makes it different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.181,
    "end": 3051.994,
    "text": "And I'm wondering if you find any parallels between which of the processes of probability design with craft work, with actual work with materials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.955,
    "end": 3055.017,
    "text": "Yeah, I'll start with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.954,
    "end": 3063.784,
    "text": " So you're thinking of the actual act of making a pot?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.525,
    "end": 3067.228,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.329,
    "end": 3071.775,
    "text": "I think there are similarities, certainly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3072.316,
    "end": 3074.619,
    "text": "I have to admit, I have no idea how you make a pot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.019,
    "end": 3076.802,
    "text": "No worries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.002,
    "end": 3080.627,
    "text": "But I assume it is also a more long-form engagement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.787,
    "end": 3084.092,
    "text": "It's something that unfolds in the flow of time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.882,
    "end": 3096.657,
    "text": " where the material that you're working with gives you different kinds of resistance and you have different strategies of working with it or working around that resistance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.618,
    "end": 3112.577,
    "text": "So I think in that way it's probably similar to the reading process, that it is something that unfolds over time and where you get a sense of what it's likely, you know, going to work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.996,
    "end": 3122.208,
    "text": " what kind of approach is likely going to help you make sense of what it is that you're reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3123.19,
    "end": 3126.995,
    "text": "So I think in that sense, there are a lot of similarities there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3128.356,
    "end": 3142.395,
    "text": "I think one of the differences is, of course, that reading requires you to work with language, whereas the material of the pot is not strictly speaking symbolic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.527,
    "end": 3152.649,
    "text": " I'm very happy to talk about the symbolism of material forms, but it's not first and foremost, first and foremost, it's matter that you shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3154.112,
    "end": 3162.19,
    "text": "So I think there is a difference with how you handle it and manipulate that in your head from what you do as a reader.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3163.958,
    "end": 3175.892,
    "text": " Yeah, I'm glad that you say that, because it's been something that's been debated a lot in our fields, in terms of there's a turnaround, trying to make looking at materials as if you were reading a text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.513,
    "end": 3181.338,
    "text": "And a lot of complication arose, which you just synthesized very well, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.398,
    "end": 3186.024,
    "text": "But I think I'll shift to the next point, really, is in terms of form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.025,
    "end": 3193.813,
    "text": "I'm quite interested in this point, because you seem to suggest that form is something emergent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.793,
    "end": 3198.673,
    "text": " which I think is partly fueled by the active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.29,
    "end": 3225.522,
    "text": " and if i understood correctly would be form would be in this sense um uh the design sensory flow yeah um and this this tendency we have of trying to kind of petrify it maintain it make it durable um and uh but at the same time we're facing challenges right in the text from when so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.502,
    "end": 3252.387,
    "text": " i would be interested in looking at if if there is form in the sense what would be the breakage of the form so what what would be something that challenges the form when when one is reading or in terms of probability design um i think there are multiple ways in which you can do that um but before i start talking about that i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.839,
    "end": 3278.087,
    "text": " I mean, I would be interested in actually hearing your take on that, because it seems to me, again, as someone who's not very well informed when it comes to craft, that if you do have a material object, I mean, you speak about fossilized, and I mean, these are stable configurations that, of course, you can't perceive the whole pot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3278.27,
    "end": 3281.375,
    "text": " at the time, but you can get an outline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.675,
    "end": 3298.559,
    "text": "So if you, or if you look at the painting, you know, you can do a composition sketch that puts together all the dominant lines and the outlines so that you can see where the triangles are or the center of gravity or the vanishing point, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.18,
    "end": 3305.83,
    "text": "So it seems to me that in the case of visual art and also material objects,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.367,
    "end": 3309.59,
    "text": " there is a way in which the form is much more immediately perceptible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.891,
    "end": 3335.732,
    "text": "Whereas in a literary text, and especially in the long form text, like the novel, it's really only something that, yeah, it's somewhere there in the text, but I think as soon as you try to draw a diagram, as soon as you try to do these plot lines or whatever people have attempted,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.982,
    "end": 3337.904,
    "text": " it sort of doesn't quite capture it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3339.606,
    "end": 3344.992,
    "text": "I think you do have an intuitive sense of what kind of shape the whole thing has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3345.092,
    "end": 3352.08,
    "text": "And I think there are various strategies when you start a novel of projecting what kind of ending it's likely going to have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3353.222,
    "end": 3360.41,
    "text": "Evoking genre protocols, for example, establishing a setting that will come up again at the end, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3360.73,
    "end": 3364.234,
    "text": "So there are ways of signalling formal coherence in a text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3364.771,
    "end": 3379.231,
    "text": " But I would be hard pressed to imagine how that would have the same kind of perceptual unity, I think, that looking at a vase, for example, has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3382.275,
    "end": 3389.185,
    "text": "Still, I spoke, of course, about cracks and flaws in the probability design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.267,
    "end": 3392.77,
    "text": "And I think those are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.02,
    "end": 3397.305,
    "text": " exactly these moments that are heavily underdetermined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3398.286,
    "end": 3409.378,
    "text": "That's like the character getting away in the Proust killer novel when everything has been set up to say, well, this is not going to happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3409.398,
    "end": 3411.2,
    "text": "This is completely impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.34,
    "end": 3414.183,
    "text": "And it's also never explained properly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.204,
    "end": 3422.672,
    "text": "One example that immediately I think comes to mind or another example would be sort of what happens between chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3423.057,
    "end": 3433.91,
    "text": " when characters at the end of a chapter close the door, and then a new morning starts in the next chapter, and you sort of know what happened in the night, but it's not made explicit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3434.551,
    "end": 3444.643,
    "text": "So I think there are various points in the narrative or in the novel where you can position those cracks and those flaws.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3445.214,
    "end": 3450.102,
    "text": " And I think some of them are to do with the very material layout, like chapter endings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3450.903,
    "end": 3455.711,
    "text": "But mostly, I think it will be on the level of how the narrative is constructed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.771,
    "end": 3459.357,
    "text": "Does that answer your question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3459.577,
    "end": 3460.879,
    "text": "Yeah, I think it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.959,
    "end": 3466.668,
    "text": "It's much more fluid, this idea of form, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.089,
    "end": 3468.471,
    "text": "So it's hard to disentangle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.83,
    "end": 3482.869,
    "text": " what would be the exact, let's say not the exact opposite, but more or less the case about how form is really dissolved, to phrase it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.53,
    "end": 3497.091,
    "text": "I think there's a point I wanted to ask you about in terms of, because you mentioned like plot events or these things that did not happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.071,
    "end": 3505.343,
    "text": " a lot and maybe I'm referring to exclusively on your book in that case all about this narrated and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.694,
    "end": 3513.967,
    "text": " And I'm wondering, you raised a really interesting quote that, I think I have it written here, I can say directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.108,
    "end": 3524.284,
    "text": "Yeah, the unfulfilled possibilities, or to put it more dramatically, the hypotheses that die with each transformation in a plot event, stay with the probability design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.085,
    "end": 3527.449,
    "text": "And I actually think this is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.239,
    "end": 3548.307,
    "text": " quite a crucial remark in that sense to understand how these let's say interruptions that are flowing through the text actually come to shape the the the this form if as you as you're describing um so my question is are they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.265,
    "end": 3559.738,
    "text": " Would it be, is there a selective process into how some hypotheses might die out while others stay with the, sorry, probably the sign?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.218,
    "end": 3562.921,
    "text": "Is that, maybe it's a bit confusing, the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.824,
    "end": 3566.566,
    "text": "I think I understand it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3569.229,
    "end": 3575.897,
    "text": "So I think that is very much to do with the individual reader and how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3577.936,
    "end": 3580.338,
    "text": " you move through the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3580.358,
    "end": 3592.191,
    "text": "So if you think of a hypothesis that dies, I don't know, that Anna Karenina stays with her husband, you know, which is possible at multiple points in the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3593.312,
    "end": 3596.996,
    "text": "It is a very dead hypothesis though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3597.716,
    "end": 3604.543,
    "text": "But of course you could read the novel and at every point, you know, imagine how, you know, her life could have been different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3604.623,
    "end": 3606.205,
    "text": "It may even have been",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3606.488,
    "end": 3610.613,
    "text": " I think that depends on your take on Gramsci.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3612.495,
    "end": 3620.564,
    "text": "But I think it's very much to do with exactly the kind of epistemic active influences that become dominant across the reading process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3621.184,
    "end": 3636.141,
    "text": "And it's very much to do, I think, also with the kind of emotional investment that you might have as a reader because you feel sympathy with a particular character or because you think, oh, this character is a lot more interesting than I actually thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3636.442,
    "end": 3644.189,
    "text": " Often when you read a novel the second time around and you start noticing the things that you haven't noticed the first time around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3646.871,
    "end": 3652.416,
    "text": "I don't think it's predictable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3652.456,
    "end": 3660.143,
    "text": "I think that is exactly which of these hypotheses that stay with the probability design, even though they don't get realised.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3660.663,
    "end": 3664.947,
    "text": "I think that very much depends on what happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3665.348,
    "end": 3673.924,
    "text": " during the reading process, what or whatever reason is attractive for a reader to carry with him or her through the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3675.187,
    "end": 3698.072,
    "text": " okay i see your point um in terms of this re-reading i think maybe i'm passing too much time so i'll leave this as the last question um in terms of the re-reading uh process um and these ideas that these processes that are adding uncertainty let's say to the to the narrative um so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.617,
    "end": 3705.443,
    "text": " Would that be reconfigured in terms of these hypotheses with the rereading?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.923,
    "end": 3721.422,
    "text": "Are some of these taken or are some of them just left to die eventually because of this constant reevaluation or reiteration of looking through the text for the reader?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.443,
    "end": 3730.033,
    "text": "I think most of the possible alternatives will never cross your mind because there are just too many of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3730.3,
    "end": 3745.995,
    "text": " So I think the one, if you do carry an alternative hypothesis with you, it will be one that for one reason or another, you have an emotional investment in or you find particularly interesting at a given point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3747.697,
    "end": 3756.966,
    "text": "So I think it leaves potentially an infinite range of making epistemic active inferences, but you won't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3757.52,
    "end": 3762.257,
    "text": " have the time or the interest or the energy to make all of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3762.277,
    "end": 3766.652,
    "text": "I think it will be a very few of those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3768.303,
    "end": 3769.384,
    "text": " Okay, see a point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.106,
    "end": 3775.591,
    "text": "Yeah, sorry, I said that was the last one, so I'll keep my promise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.611,
    "end": 3778.033,
    "text": "Yeah, maybe I can add one small thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.053,
    "end": 3785.08,
    "text": "It's a comment on your previous question and to Karin's answer, because we touched upon this in the article me and Karin have written together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.1,
    "end": 3791.887,
    "text": "And then you mentioned today this distinction between core presence and extensive presence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.927,
    "end": 3794.53,
    "text": "So the difference between the proximal intention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.51,
    "end": 3795.731,
    "text": " and the distant intention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.412,
    "end": 3810.625,
    "text": "So you can make predictions and then accept the errors coming out of them, as long as they don't disrupt too much the goal that you have, the distant intention that you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.426,
    "end": 3815.99,
    "text": "And they're driven by situational factors, by genre convention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.611,
    "end": 3818.152,
    "text": "Let's say that you're reading a detective novel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.753,
    "end": 3824.398,
    "text": "If you keep making predictions about who the murderer is, and the murderer gets revealed on page three,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.155,
    "end": 3834.928,
    "text": " that would be an abrupt disruption for you to accept that and wanting to keep engaging with that kind of narrative and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.499,
    "end": 3848.176,
    "text": " You asked if there's a trade-off or some things that are not included in the probability design or get discarded in the writing process because they don't work well in the overall design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.697,
    "end": 3861.574,
    "text": "So maybe this is an example of something that could, in some cases, if you're writing something that is subverting the Jean Convention and not really putting the emphasis on who's the murderer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.554,
    "end": 3864.622,
    "text": " by wanting to play with the genre of the detective story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.144,
    "end": 3866.126,
    "text": "But this could work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.146,
    "end": 3871.26,
    "text": "But in most cases, for most readers that want a detective novel, that wouldn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.472,
    "end": 3894.767,
    "text": " i see um that's it's quite interesting because uh what i see is all these what i find interesting because for us when we're working with craftwork uncertainty seems to be of the external world you know it comes in it everything's messy um the things decay they wither they break down so you need to adjust",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.747,
    "end": 3919.253,
    "text": " whereas here i find it interesting because a lot of this uncertainty comes from the actual design of the of the of the of the text as as it's been described and so in that sense um is there an element to this to this design in the writing that one can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.975,
    "end": 3925.783,
    "text": " one can try to see these, let's say, these hypotheses that were never written.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3926.624,
    "end": 3932.491,
    "text": "Do you find traces of these in the design, for example, when the text is designed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.511,
    "end": 3940.502,
    "text": "Do you find traces of these doubts, let's say, of the writer when they were, do you know what I mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.084,
    "end": 3945.308,
    "text": "Something that might be external to something that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3946.553,
    "end": 3955.285,
    "text": " was intended, but can one highlight these in the text about the moments of doubt the author has when they're writing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3955.446,
    "end": 3965.44,
    "text": "The reason why I'm saying that is, is there uncertainty that is created inadvertently when the text is being written?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.961,
    "end": 3967.583,
    "text": "That's my point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.415,
    "end": 3996.208,
    "text": " Yeah, I think that certainly happens because, I mean, I talked about how reading is a long term process, but of course, writing a novel is an even longer process where if you look into manuscripts, you can see authors changing their minds and that will leave traces as they keep copying and editing what they've written.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3997.109,
    "end": 4000.033,
    "text": "And again, with a text that is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4000.267,
    "end": 4001.909,
    "text": " as large as a novel is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4002.15,
    "end": 4017.553,
    "text": "I mean, all of these are, of course, meticulously edited, but I think there is space for, you know, the mess, as you call it, to come in from the different manuscript stages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.315,
    "end": 4022.841,
    "text": "Sometimes that even continues after publication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4023.362,
    "end": 4027.708,
    "text": "One of the early modern authors I've worked on, Samuel Richardson,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4028.212,
    "end": 4038.904,
    "text": " He wrote a novel called Clarissa, where one of the protagonists is an aristocrat and he thought he had written him in a very unattractive way and nobody would like him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4038.924,
    "end": 4044.43,
    "text": "And of course, all the readers or many readers thought he was the real hero of this piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4045.991,
    "end": 4051.077,
    "text": "So there must have something gotten in there that he didn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.798,
    "end": 4053.139,
    "text": "So it's not a question of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4053.389,
    "end": 4055.732,
    "text": " you have an intention and then you write that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4056.012,
    "end": 4058.656,
    "text": "There's always stuff that gets in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4059.116,
    "end": 4069.449,
    "text": "I don't know, drawing on cultural protocols of rakish aristocrats that have attraction without meaning to do so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4069.93,
    "end": 4079.582,
    "text": "And then of course, Richardson then spends various editions trying to edit out those elements that he didn't want in there in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4079.842,
    "end": 4081.084,
    "text": "So I think that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4082.228,
    "end": 4092.526,
    "text": " That is a very common phenomenon, actually, that we've got a lot of mess, even in a very well-designed probability design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4093.468,
    "end": 4094.71,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.73,
    "end": 4095.832,
    "text": "See, I can relate to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.735,
    "end": 4102.283,
    "text": "It's a very interesting question, if I have time to also add a small thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.484,
    "end": 4103.866,
    "text": "Daniel, is it fine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.447,
    "end": 4104.928,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.111,
    "end": 4120.538,
    "text": " Some may even argue that the uncertainty, but not in the sense of the mass, but in the sense of how uncertainty is defined by predictive processing, might be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.155,
    "end": 4150.677,
    "text": " the core uh quality of uh of literature that lasts long and actually so karen presented the work by uh itaro calvino and he has written an essay and um i think the name was is what is a classic and and his definition of what is a classic is precisely these texts that have something which is left open so a level of uncertainty and it can pertain to many of the different aspects that karen touched upon there is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.876,
    "end": 4155.402,
    "text": " is uncertain because of the overall design of the text and how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.364,
    "end": 4158.126,
    "text": "And it's open also for future generations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.607,
    "end": 4160.169,
    "text": "And that's why it becomes a classic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.189,
    "end": 4175.871,
    "text": "Because this uncertainty gets transmitted and the text gets transmitted because of this living uncertainty that appeals to readers also of the future that Calvino couldn't think of or any author of classics couldn't think of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.011,
    "end": 4200.289,
    "text": " That's quite fascinating because something that stems to mind is how would these different scenarios of uncertainty... I mentioned something that Karin used as an example in her book about these things that do not happen, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.45,
    "end": 4204.174,
    "text": " How would those be scaffolded in the text?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.635,
    "end": 4211.626,
    "text": "Is that for the reader to be able to follow through on these details?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.289,
    "end": 4214.531,
    "text": "Does it make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.599,
    "end": 4221.662,
    "text": "Are you saying it should be there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4221.943,
    "end": 4224.707,
    "text": "There should be textual signals that you can point to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4225.261,
    "end": 4244.012,
    "text": " yeah so how would it be okay i'll give you an example maybe i'm thinking too much about craft so what we see normally is that when when we set out to learn about let's say you mentioned pottery so i'll throw in pottery um set out to make a pot and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.903,
    "end": 4247.927,
    "text": " The last thing in your mind, you know that you encounter problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.728,
    "end": 4252.832,
    "text": "Most of the things you want to learn about is the techniques to make the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.734,
    "end": 4265.247,
    "text": "But the last thing in your mind is what you will effectively learn eventually, or actually all the faults that will come out throughout the whole process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.248,
    "end": 4271.755,
    "text": "But you don't intend on learning this, and it's not explicitly taught in many of the cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.735,
    "end": 4295.076,
    "text": " so a lot of this uncertainty comes from the exposure to these contingent situations um and the problem here is because it's not explicitly taught there are ways in which regardless if it's not explicitly taught what i mean is there are ways in which somehow it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4296.355,
    "end": 4301.821,
    "text": " there's a sort of scaffolded learning in the process of something that's not explicitly stated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.482,
    "end": 4311.352,
    "text": "And I'm wondering, so for example, you would say the first thing you learn where the fault appears is effectively what is the fault?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.973,
    "end": 4314.756,
    "text": "What consequences would this have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.776,
    "end": 4321.304,
    "text": "And in the next stage, you learn, okay, what do you do in this situation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4321.344,
    "end": 4325.248,
    "text": "And then at the last stage, you would say you learn to anticipate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.92,
    "end": 4328.724,
    "text": " So you learn to anticipate this uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.525,
    "end": 4349.971,
    "text": "And so I'm wondering if it's a similar, maybe I'm thinking too much about craft, but I'm wondering if it's a similar process with learning all these, let's say, situations where uncertainty is being fed into the narrative to us to get the reader engaged, let's say, with the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.572,
    "end": 4353.936,
    "text": "So does that make sense a little bit better, maybe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.367,
    "end": 4363.995,
    "text": " I think it does, though I'm beginning to wonder whether that might not be a point where craft is actually quite different from reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4364.716,
    "end": 4375.427,
    "text": "Because I think in the craft, you want your strategy to anticipate those flaws in order to not have them happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4377.328,
    "end": 4384.075,
    "text": "Whereas I think when you're reading a literary text, you actually do want that kind of opening",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4384.291,
    "end": 4388.999,
    "text": " You want to be given that kind of freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4391.143,
    "end": 4404.747,
    "text": "So I think you have a similar process of developing exactly that capacity to anticipate, you know, if the killer is revealed on page three,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4405.587,
    "end": 4409.831,
    "text": " If it's a standard crime novel, you don't expect much more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4410.651,
    "end": 4433.772,
    "text": "But you also know that if someone, I don't know, like Agata Christie does that, so maybe there is then something else coming that provides a new way of integrating that information in a probability design that is interesting in a different way, because you know who the killer is, but maybe there is a new question that you hadn't even thought about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4435.22,
    "end": 4445.737,
    "text": " So I think there is similar development of let's call it expertise as you work with the material in that case of reading a book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4447.36,
    "end": 4452.368,
    "text": "But I think you don't, this anticipation is not to prevent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4452.736,
    "end": 4454.578,
    "text": " the floor from coming about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.618,
    "end": 4460.744,
    "text": "It's really to see, okay, so now I anticipate a floor and I want to see what it yields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4460.864,
    "end": 4464.147,
    "text": "I want to see what the consequences are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4464.167,
    "end": 4465.969,
    "text": "So I think there is a difference there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.99,
    "end": 4478.3,
    "text": "And it may be to do, yeah, I'm not entirely sure what element that would be based on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4478.32,
    "end": 4481.123,
    "text": "But perhaps it is to do with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4481.744,
    "end": 4508.629,
    "text": " letters being i mean they they don't need the kind of structural integrity that a pot needs to hold together so maybe there is something on the very materiality of what we're working with that allows for um that kind of looseness i get your point that's certainly true yeah sorry yeah towards",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4509.52,
    "end": 4529.098,
    "text": " a pause in the chapter a chapter break here thank you all for the work i think it the the book and the other writings have opened up many avenues for people to explore and i'll ask one question which is art has always been cognitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.787,
    "end": 4549.158,
    "text": " How though has this cognitive turn in explicitly exploring the generation, recognition and interpretation and analysis of art, how is that explicitly cognitive turn reentering into art itself?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4555.187,
    "end": 4557.651,
    "text": "That is a very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4558.525,
    "end": 4559.866,
    "text": " I don't actually know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4559.886,
    "end": 4567.353,
    "text": "I mean, there are obviously writers who have a great interest in various kinds of cognitive theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4568.654,
    "end": 4576.12,
    "text": "So would read that because they are also very self reflective and interested in, you know, how this works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4576.621,
    "end": 4587.891,
    "text": "And so, obviously, there are writers that take up cognitive science, neuroscience, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4587.971,
    "end": 4588.431,
    "text": "I'm not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4588.664,
    "end": 4594.47,
    "text": " familiar with anyone who's taken up predictive processing, though I'd be of course very interested in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4596.713,
    "end": 4606.443,
    "text": "So if you're talking specifically about the sort of creation, then I think it depends very much on what writers read.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.463,
    "end": 4613.811,
    "text": "Does that answer your question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.938,
    "end": 4626.18,
    "text": " yeah it's uh i mean it's an opening to see how this all happens but like the craft maker was already doing what they were doing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4627.426,
    "end": 4646.987,
    "text": " What does an explicitly cognitive lens and a unifying cognitive scientific approach to memory, anticipation, the layers of probability designs that you articulate, how does explicit knowledge of these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4647.71,
    "end": 4667.792,
    "text": " in contrast with an implicit tacit craft artisan approach to generating, I mean, isocating is still in play even if we were to take that into a sort of forensic literary cognitive science approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4667.812,
    "end": 4677.463,
    "text": "So certain things are in common and yet now increasingly aspects of the cognitive elements",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4678.709,
    "end": 4702.962,
    "text": " maybe in the future people are reading with augmentation and there's new accessory possibilities for interoception while you're reading or there's generated texts not just recommended or word of mouth dissemination but instantaneous generation of designed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4703.802,
    "end": 4705.124,
    "text": " probability designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4706.505,
    "end": 4712.232,
    "text": "These are shaping the structure of the form and the media.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.977,
    "end": 4725.989,
    "text": "Yeah, I think what you raise about the implicit and the explicit is very interesting, because on the one hand, of course, it is an implicit process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4726.049,
    "end": 4727.971,
    "text": "I mean, you go and you do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4729.153,
    "end": 4733.438,
    "text": "On the other hand, I do think that the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4733.705,
    "end": 4750.123,
    "text": " This meta dimension that I highlighted with the nudges is quite important, especially for the case of literature, that there is a constant element of adjusting, taking a second-order perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4752.025,
    "end": 4763.458,
    "text": "So you could very well use, say, an analysis of a novel through creative processing, where you actually identify and tag the elements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4764.147,
    "end": 4769.455,
    "text": " in order to think about what it is that you've been either reading or writing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4769.515,
    "end": 4781.052,
    "text": "So I can see very well that that kind of analytical language can provide nudges or metafictional nudges for readers or writers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4783.916,
    "end": 4792.028,
    "text": "So I think there is a place to think about predictive processing, not only in terms of the theory that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4793.003,
    "end": 4801.739,
    "text": " may explain what is going on and how it hangs together, but that could be used practically as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4807.649,
    "end": 4814.742,
    "text": "Perhaps the panelist and then Corinne, any closing thoughts or how you take this forward?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4819.21,
    "end": 4822.916,
    "text": " Perhaps Bruno, then Federico, if you have any comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4824.619,
    "end": 4838.704,
    "text": "Well, I think, um, I'll be brief, but, uh, I think there's a lot of, for me personally, it's got me thinking a lot about, um, how exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.405,
    "end": 4852.663,
    "text": " sequences of events or structure in my line of work and how to look at these things a little bit more fluidly with all these interruptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4852.723,
    "end": 4858.952,
    "text": "Maybe I think we tend to be a little bit more schematized with the way we engage with materials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.492,
    "end": 4866.803,
    "text": "And so I think this is a way of actually understanding the process as it's unfolding, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.165,
    "end": 4869.687,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.101,
    "end": 4872.32,
    "text": " Yes, I think the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.244,
    "end": 4881.494,
    "text": " The second part has to do a lot with this idea of uncertainty and contingencies, which are seldom used in our field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.735,
    "end": 4891.327,
    "text": "So I think it's been really insightful in that regard to look at how this is actually an inbuilt part of the design process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4892.007,
    "end": 4901.339,
    "text": "And people come with very different ways as to how to respond to these different elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.78,
    "end": 4902.12,
    "text": "Yeah, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.425,
    "end": 4914.875,
    "text": " That's a very interesting perspective in seeing how looking at archaeology and crafts can have commonalities with literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.915,
    "end": 4930.251,
    "text": "And I think what I would like to see done more, and also this is what we've been doing when writing this article together and thinking about, okay, this works with narrative and literature,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.345,
    "end": 4939.513,
    "text": " But then can we use this framework to see also what is specific about literature as a text in comparison to other media, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.553,
    "end": 4950.644,
    "text": "Because we live now in a society and in an era where literature and literary texts are not the primary medium through which people experience fictional worlds and narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.664,
    "end": 4956.61,
    "text": "And so this, I think, because of how it can work well across different mediated experiences,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.248,
    "end": 4977.287,
    "text": " I think the active inference framework can be a very good way to define what is specific to a certain medium or a certain genre, even if you want as a specific type of using a medium in a certain way, in comparison to how we can tell stories through a different media.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.307,
    "end": 4986.495,
    "text": "So I think this is the line I would like to, the line of research I would like to read more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.749,
    "end": 5006.634,
    "text": " I think it's really interesting how we're coming back to the question of the medium, which has been so much discussed for media that are not literature, which has been discussed for film and virtual reality, video games, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5006.654,
    "end": 5016.769,
    "text": "But not as much for literature, the fact that this is a written text that we spend so much time with, which is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5017.407,
    "end": 5023.794,
    "text": " which has an effect on it and which is different from the craft example that Bruno brought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5025.115,
    "end": 5030.161,
    "text": "So I think from our discussion now, that's something I want to think more about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.042,
    "end": 5044.697,
    "text": "The fact that this is a medium in and of itself and that exactly the specificity that Federico highlighted is very much rooted in that medium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5047.327,
    "end": 5063.85,
    "text": " cool the kinds of things that happen on the live stream medium thank you though all this is very awesome i hope people enjoy it too so till next time thank you very much thank you",
    "speaker": "SPEAKER_02"
  }
]