[
  {
    "start": 1.471,
    "end": 23.906,
    "text": " okay it is may 19th 2022 and it's week three of the textbook group first cohort we're in week three discussing appendix a and b and uh there are some notes in the sections of the book in the chapters",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 25.592,
    "end": 28.715,
    "text": " there are also some ideas and questions that people have raised.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 29.435,
    "end": 35.0,
    "text": "So we'll go to the questions and then start with the most upvoted.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 35.04,
    "end": 42.726,
    "text": "So feel free to add more upvotes if you want to discuss it, like even in this discussion.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 44.304,
    "end": 72.538,
    "text": " and then hopefully if people are available to take notes in this section that will help add their thoughts in and also capture what the speakers are saying and then we'll look at the question and then try to come to different answers and just add more information that people can add more structure to later okay the first question says appendix a is described as the mathematical background",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 74.372,
    "end": 101.36,
    "text": " so maybe question one for the authors or for you what is the process of determining what is figuring ground for the formalisms of active what other math concepts and formalisms are important for learning and applying active inference and then three what are some resources and approaches for learning math that help us learn what is what is useful for active inference",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 127.475,
    "end": 152.475,
    "text": " anyone can raise their hand or we can just start to add some annotations here like what should be included in the primary regime of attention with the reading of a book either linearly like some books are or in a maybe moving around the sections so what should be in the chapters what should be in the appendix what is not in the appendix",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 156.892,
    "end": 161.262,
    "text": " what did people expect would be in the chapter, in the appendix, not covered?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 187.11,
    "end": 188.771,
    "text": " Yeah, Jessica, and then anyone else?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 190.331,
    "end": 197.433,
    "text": "Yeah, I was wondering about the multiplication of the matrices that we covered yesterday.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 198.014,
    "end": 203.996,
    "text": "Which equations have the multiplication of the matrices?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 204.016,
    "end": 209.958,
    "text": "A couple of examples, just so I can play around with them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 213.759,
    "end": 216.6,
    "text": "In the actual active inference equations.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 221.465,
    "end": 223.806,
    "text": " Does anyone know one?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 225.686,
    "end": 240.211,
    "text": "This is referencing the way that the Appendix A is starting with linear algebra and then introducing this operation of multiplying two matrices to get a product.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 241.512,
    "end": 247.974,
    "text": "If someone can find an equation that we've already seen or some other equation while I'm typing up that question, that would be helpful.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 315.455,
    "end": 325.559,
    "text": " Could anyone just describe what they thought the intention was of starting with linear algebra and using 8.1 as the first equation of the appendix?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 326.239,
    "end": 329.54,
    "text": "Or we'll return to just the more general questions.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 341.464,
    "end": 343.305,
    "text": "I mean, linear algebra is kind of the most",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 344.861,
    "end": 362.536,
    "text": " discrete, I don't want to say fundamental, but like, practical and comprehensive way of kind of working with a large space of data, I guess, together and computing on it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 362.837,
    "end": 368.802,
    "text": "So it's kind of the basis for the discrete parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 381.229,
    "end": 383.771,
    "text": " and maybe easier than the non-discrete parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 385.432,
    "end": 386.232,
    "text": "Good reason to start.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 398.16,
    "end": 406.706,
    "text": "I guess if the question was, where is linear algebra used in the active inference",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 408.232,
    "end": 422.749,
    "text": " um math um when you go to appendix b then the equations of active inference and these are all expressed in terms of large vector spaces of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 423.59,
    "end": 425.831,
    "text": " variables, so probability distributions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 426.672,
    "end": 434.475,
    "text": "And so, for example, on page 245, you've got this dot notation, which is the expectation of a value.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 435.056,
    "end": 445.721,
    "text": "So that that goes directly back to that first section of Appendix A is what does that mean in terms of how do you take an expectation of a large vector of things?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 446.161,
    "end": 447.502,
    "text": "How do you express that compactly?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 450.66,
    "end": 450.98,
    "text": " Thanks.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 451.86,
    "end": 453.081,
    "text": "Could you unpack?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 453.441,
    "end": 465.903,
    "text": "We looked at the dot notation a little bit yesterday, and they were mentioning how, well, I think it was actually one of the questions too, but just see if someone asked this.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 467.164,
    "end": 467.404,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 469.124,
    "end": 472.065,
    "text": "They say the dot operator in A3.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 475.455,
    "end": 481.979,
    "text": " The dot operator is equivalent to standard matrix multiplication where the first matrix has been transposed.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 482.76,
    "end": 485.742,
    "text": "So what is the relationship with expectation?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 486.582,
    "end": 487.963,
    "text": "How does expectation relate to linear algebra?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 506.385,
    "end": 513.029,
    "text": " Yeah, expectation is the probability of a value, the average probability of some value.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 513.149,
    "end": 524.477,
    "text": "So you're going to take all the possible values and you're going to multiply them by the probability of that value and then divide by the sum of the probability of normals to one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 524.957,
    "end": 526.338,
    "text": "So that will be the expectation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 526.938,
    "end": 541.922,
    "text": " So if you have a whole array or a vector of, you know, in your distribution, you can express that all in compact notation by saying with this simple way of saying, we're going to take every one of these terms and we're going to multiply it by the probability of that term.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 543.602,
    "end": 545.503,
    "text": "And the probability sum to one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 545.683,
    "end": 549.023,
    "text": "So then that will be your average overall.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 551.564,
    "end": 551.884,
    "text": "Awesome.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 551.944,
    "end": 553.284,
    "text": "Thanks for that answer.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 559.375,
    "end": 584.21,
    "text": " okay thanks for that awesome answer does anyone have any other thoughts on just this first question and then we'll continue so what is figuring ground we're learning active inference in the chapters that's why the chapters are there the appendix is there to somehow lightly supplement that like they describe it as",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 586.409,
    "end": 611.967,
    "text": " introduction or a refresher to the basic basic mathematical techniques and linear algebra is the first section a2 that is discussing a lot of important things like derivatives and probabilities Taylor series variational calculus and stochastic dynamics are going to come in in the coming chapters but the linear algebra is is a important for the upcoming chapters",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 616.912,
    "end": 639.342,
    "text": " Okay, so this question asked, in A3, they say the dot operator is equivalent to standard matrix multiplication where the first matrix has been transposed, which is flipped, like it's the operation in Google Sheets or Excel, right click, paste, transpose.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 640.442,
    "end": 642.143,
    "text": "They say that in the case of column matrices,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 643.464,
    "end": 645.125,
    "text": " This is equivalent to the dot product.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 645.905,
    "end": 653.948,
    "text": "So the dot operator here is like a generalization of the vector dot operator, the sum of the products of the corresponding entries of the two sequences of numbers.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 655.529,
    "end": 662.111,
    "text": "So the questions here were, what is interpretation, implication, or use of the dot product of vectors?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 662.951,
    "end": 667.773,
    "text": "And then what is an interpretation, implication, or use of a more generalized dot product?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 667.913,
    "end": 669.894,
    "text": "And it looks like there's an awesome answer.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 712.083,
    "end": 734.162,
    "text": " would be a situation where if anyone can think of one like the dot product would be applied like you know we're just we're trying to do this in this situation this is the operation that we needed we wanted to compute matrix a on something of something we used b dot c",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 741.463,
    "end": 747.587,
    "text": " I'll just continue Eric's description of probability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 747.627,
    "end": 769.84,
    "text": "Like, you have expectation probability, and you wanted to kind of see the error or whatever the difference, I guess, between observation and the expectation, then a dot product would give you",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 778.59,
    "end": 802.742,
    "text": " it's a probability density of it what are some ways to compute differences like you can if there are scalars you can subtract like five minus three or something then it was mentioned of cosine similarity",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 803.697,
    "end": 824.343,
    "text": " Does anyone think of or imagine another way that you could compute the difference between two different kinds of features of different dimensions?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 824.363,
    "end": 830.305,
    "text": "Another example is divergence, because that's measuring the differences between these two distributions.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 830.725,
    "end": 832.046,
    "text": "And there's different divergences.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 832.126,
    "end": 832.946,
    "text": "The KL is one of them.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 834.281,
    "end": 840.663,
    "text": " What other things are in this space that might be just tractable possible distance measures?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 844.023,
    "end": 855.146,
    "text": "Well, I mean, these are the same dimensionality in all these cases, but another very popular one is the sum squared difference, sum squared error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 856.826,
    "end": 860.787,
    "text": "And then you can have absolute different value difference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 861.567,
    "end": 863.648,
    "text": "So these are called different norms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 866.107,
    "end": 866.828,
    "text": " I think that's the right word.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 867.89,
    "end": 868.15,
    "text": "Yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 869.052,
    "end": 877.966,
    "text": "There's also the Gini index, the Jacquard index, Euclidean distances, like sample to sample distances.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 908.103,
    "end": 917.583,
    "text": " So could anyone talk about L0, L1, and L2, et cetera norms while I'm adding some links?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 933.392,
    "end": 939.916,
    "text": " If I have the right numbers here, L2 norm would be the square root of the sum of squares.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 940.196,
    "end": 947.001,
    "text": "L1 norm would be the average of absolute value differences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 947.941,
    "end": 949.802,
    "text": "And L0, I don't know what that is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 949.822,
    "end": 953.024,
    "text": "I don't think it's a difference, is it?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 954.125,
    "end": 955.346,
    "text": "It's like a presence absence.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 956.767,
    "end": 956.867,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 956.887,
    "end": 957.007,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 958.511,
    "end": 963.912,
    "text": " So that kind of encoding is used in a lot of different algorithms.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 967.873,
    "end": 971.134,
    "text": "And then the L2 norm is the sum of squares.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 972.435,
    "end": 980.677,
    "text": "So the L2 norm is what is used in a least squares regression, classical statistics, t-test, ANOVA.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 981.817,
    "end": 985.298,
    "text": "That's a lot driven by the L2 norm.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 989.113,
    "end": 1007.727,
    "text": " and all of that is like in the genre of what the a3 notation is describing and there but depending on what the b and the c are and what the a is etc there's just and the dimensions of everything and other operations that are happening before or after it",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1013.388,
    "end": 1017.351,
    "text": " Later on, they mentioned the quadratic, which is the L2 norm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1017.691,
    "end": 1021.775,
    "text": "So that's where you have the same term as multiplied by itself.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1022.295,
    "end": 1025.057,
    "text": "Or if you have cross terms, then you get the covariance.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1029.06,
    "end": 1035.946,
    "text": "And that's going to be used later with the Laplace approximation and other approximation techniques.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1040.003,
    "end": 1062.968,
    "text": " any other comments on a3 or dot product or just like this like kind of linear algebra topic linear algebra the basics",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1066.141,
    "end": 1083.472,
    "text": " the trace and the determinant, which are probably less important than the dot product, but still come into play, the derivatives, how things change with respect to each other, possibly time, possibly some other surface, and then probabilities.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1088.532,
    "end": 1113.954,
    "text": " so does anyone have any other comments or thoughts on that whole section like anything that they read or like had uncertainty around up to equation a22 great that no one has uncertainty around any of the equations up to a22",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1118.755,
    "end": 1146.675,
    "text": " yeah i mean obviously there is a lot to like learn and to understand and we're not going to it's just i don't know people who want to think about that like what are we learning in appendix a why is appendix a there that hopefully we can start to understand some of this in math learning group the people who want to be really engaged with the math questioning and process",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1147.87,
    "end": 1175.845,
    "text": " and then and also connecting it to computer science into the applications like has been happening and then hopefully everyone can can benefit from this like finding the resources and stuff because the relationships between the terms relationships amongst the terms are driven by formalisms like the way that preferences and expectations are framed in active inference is related to equations not",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1177.026,
    "end": 1178.366,
    "text": " only a conceptual linkage.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1178.386,
    "end": 1188.069,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1190.37,
    "end": 1195.292,
    "text": "Maybe here we can just write math learning group and copy this to the resources.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1199.353,
    "end": 1199.573,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1200.433,
    "end": 1202.874,
    "text": "So what kinds of examples",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1204.878,
    "end": 1208.381,
    "text": " do you think would be useful for learning the equations and concepts in Appendix A?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1209.362,
    "end": 1222.092,
    "text": "If the equations felt too general and not applying to anything in particular, what example or scenario would have made sense or you felt would have made that clearer?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1227.236,
    "end": 1245.345,
    "text": " like we're running a business and first this person wants to do this and then this person wants to do that or what example or what would somebody have expected to have found or wanted to have found that would have made it clear examples or other exercises",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1251.149,
    "end": 1277.049,
    "text": " or a format this is kind of like a math lecture it's kind of directional versus like what other things could happen where you would feel like you were understanding and learning this and engaging with it yes thanks brock i was kind of reminded of a video that carl um a presentation um where he like in real time demonstrates uh and helps you",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1279.777,
    "end": 1287.321,
    "text": " work through like a pattern of red, like it's like three dots sort of that are moving around red, green and this pattern.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1287.361,
    "end": 1306.692,
    "text": "And so understanding like just a simple visual example of how active inference would work that doesn't, you know, require the formalism to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1308.775,
    "end": 1312.197,
    "text": " just surface level kind of pattern recognize.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1312.938,
    "end": 1321.563,
    "text": "That would be ideal, maybe, of then bringing in the map for this part and that part and some scaffolding.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1322.684,
    "end": 1333.391,
    "text": "But yeah, I'm not sure the appendix, I'm not sure it was meant to be bred in...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1334.582,
    "end": 1343.636,
    "text": " I'm not sure there's a great way to read one order or another there, because you kind of need it, but you kind of, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1343.656,
    "end": 1346.92,
    "text": "It's a lot, too, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1348.423,
    "end": 1348.563,
    "text": "Yeah.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1349.702,
    "end": 1360.727,
    "text": " Great point and like the organizing team for the textbook group, which was open to everybody who wanted to join the EDU and the comms weekly meetings.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1361.227,
    "end": 1371.271,
    "text": "So for future cohorts, people could totally be involved with planning it, communicating it, doing anything for future cohorts as a co-organizer or other role.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1372.472,
    "end": 1375.013,
    "text": "But we talked a lot about the reading order.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1376.471,
    "end": 1401.783,
    "text": " would it make sense to read them in without appendix or putting the appendix last or somewhere else um one was short and hopefully the one week of regime of attention on appendix a and b is like we're just skimming it in a week we're not getting a phd in math",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1402.642,
    "end": 1405.746,
    "text": " We're not generating these equations on a blank piece of paper.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1406.467,
    "end": 1410.513,
    "text": "We're just like seeing the forms that will be used.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1411.134,
    "end": 1418.124,
    "text": "And then some of the key areas in the order that the authors thought that those background topics were important.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1418.464,
    "end": 1419.465,
    "text": "So like for Appendix A,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1421.147,
    "end": 1436.153,
    "text": " linear algebra, which is what we talked the most about because it's gonna come into play most quickly, especially with these notions of like expectation and differences, which is gonna come into play with everything that's gonna happen.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1437.013,
    "end": 1444.416,
    "text": "Taylor series, variational calculus and stochastic dynamics, we talked less about.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1445.057,
    "end": 1449.979,
    "text": "They happened in a later order within the appendix, but hopefully there will still be many questions on them",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1451.004,
    "end": 1454.965,
    "text": " because they're probably also areas with a lot to learn and to clarify.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1454.985,
    "end": 1461.467,
    "text": "And also Appendix A is like not the final resource of it diffusing into us.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1462.007,
    "end": 1471.13,
    "text": "Like something that was really important that came up in the math learning group is there's not like a glossary of variables or table of variables.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1471.81,
    "end": 1478.932,
    "text": "So that's something we can work on with notation is connecting the variables to natural language ontology terms.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1480.421,
    "end": 1482.682,
    "text": " And then also things like this.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1483.422,
    "end": 1484.402,
    "text": "What do we even look up?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1485.342,
    "end": 1488.764,
    "text": "Or a symbol, or what does it mean when there's a double arrow?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1489.264,
    "end": 1494.845,
    "text": "There's a lot of things that, like a lot of dots that could be connected if people ask them.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1495.586,
    "end": 1499.427,
    "text": "And then we can probably get a response like, what was the double arrow in A3?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1500.543,
    "end": 1510.227,
    "text": " What does it mean anything that they're offset or what is, what are the parts of this shape that are mattering for the background of learning active inference?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1511.487,
    "end": 1529.194,
    "text": "Anyone can ask like any question, if it's coming to mind as an uncertainty, then writing it down just anywhere is really helpful because then on the first pass through learning or a primary branch of learning, we can just go, okay, here's what A1 shows.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1531.368,
    "end": 1538.744,
    "text": " and then have that in a way that reduces uncertainty more rapidly than how any of us would just give an ad hoc explanation.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1545.325,
    "end": 1546.626,
    "text": " Moritz wrote.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1547.066,
    "end": 1556.911,
    "text": "Yeah, one thing that I always find useful in thinking about matrix, you know, linear algebra matrices is to write out pictures of the matrices and their dimensions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1556.931,
    "end": 1564.695,
    "text": "Because often the notation, you've got these I's and J's and K's and stuff going around, but you don't know how that maps out into the actual elements of the matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1564.755,
    "end": 1571.879,
    "text": "So those illustrations are always helpful that could be added into this book.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1571.939,
    "end": 1573.48,
    "text": "They're in a few places, but not that much.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1575.171,
    "end": 1575.915,
    "text": " There you go.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1575.935,
    "end": 1576.478,
    "text": "Things like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1579.221,
    "end": 1588.066,
    "text": " Yeah, and also connecting the programming experience that people might have, even in no-code tools like Excel, Google Sheet.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1588.426,
    "end": 1589.407,
    "text": "You have rows and columns.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1590.628,
    "end": 1593.61,
    "text": "Ones have numbers and ones have letters, but they can be other things.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1594.43,
    "end": 1605.897,
    "text": "And then anyone who's used something like Python or R, or even just doing some statistical calculations, if you put two lists of numbers into the t-test,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1606.909,
    "end": 1608.952,
    "text": " that would be vector versus vector something.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1608.972,
    "end": 1611.997,
    "text": "And then you would address the fifth element of the list.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1612.859,
    "end": 1618.288,
    "text": "And then if it was in Excel, you would need to address two numbers to say where you were in the matrix.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1618.368,
    "end": 1620.892,
    "text": "And then the tensor is just any number of more than",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1621.758,
    "end": 1644.191,
    "text": " three dimensions which is sometimes like it's like oh but how spatially are we going to see it but then we're familiar with working with spreadsheets and data sets that are larger than two by two or but larger than two dimensions so like you could and that will come into play a lot and the numbers can be representing probabilities or be used for probabilities",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1647.119,
    "end": 1663.031,
    "text": " I also, Daniel shared in the chat, shared a link to a Python notebook that has, there's a link and it shows kind of the operations on matrices and kind of, you know, you can see both the mathematical, yeah, there you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.412,
    "end": 1667.355,
    "text": "And so you can see the actual matrix and you can actually run code to there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.455,
    "end": 1668.876,
    "text": "So that particular...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.787,
    "end": 1699.322,
    "text": " awesome so I pasted the link in here and then we'll just well you can fill out the rest of the row but then someone could be looking for a guide on Matrix or programming and Matrix or something before this state so then each person if they find it and add it here we'll have a lot to share and learn",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1705.549,
    "end": 1730.596,
    "text": " okay does anybody want to like if they were the one who asked it this question I think it's probably referring to long equations that that probably none of us are ready to give answers to at this point unless somebody wants to contextualize this question",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1738.353,
    "end": 1740.975,
    "text": " Okay, I'm hoping a read of chapter four will elucidate when the time comes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1741.115,
    "end": 1742.596,
    "text": "Just exploring the formal foundations here.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1745.359,
    "end": 1745.579,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1751.704,
    "end": 1751.964,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1756.628,
    "end": 1765.135,
    "text": "Does anyone have a favorite or recommended textbook that contains the KL divergence and Dirichlet distribution in the index?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1768.513,
    "end": 1769.594,
    "text": " This is for the math learning group.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1769.835,
    "end": 1770.035,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1770.055,
    "end": 1771.556,
    "text": "Maybe we could tag some questions too.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1771.617,
    "end": 1773.819,
    "text": "And so then we can know which ones they can look at.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1775.621,
    "end": 1776.342,
    "text": "Wikipedia is good.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1778.564,
    "end": 1780.146,
    "text": "The KL divergence is approachable.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1780.206,
    "end": 1781.227,
    "text": "The Dirichlet is tougher.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1782.989,
    "end": 1785.973,
    "text": "The links take you to definitions that enable you to put the pieces together.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1788.676,
    "end": 1788.876,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1791.9,
    "end": 1796.863,
    "text": " Any comments on KL and Dirichlet from someone who is familiar?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1796.943,
    "end": 1800.886,
    "text": "Otherwise, it sounds very technical and we don't need to go into it right now.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1816.837,
    "end": 1819.699,
    "text": "What is up with dividing by sigma in A31?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1824.525,
    "end": 1851.378,
    "text": " also a detail but we'll just see if there's any questions that are not going to be specific details because math is very hard to it like understand sometimes on the fly and there's definitely a space for the interactive discussions around math that are unrecorded which are important however this is a little bit of a different format so",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1852.469,
    "end": 1866.776,
    "text": " which is how I'm hopefully interpreting people's activity rather than their disengagements because they are here and hopefully have at least scanned these chapters.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1876.161,
    "end": 1880.403,
    "text": "Anyone can raise their hand at any time or add questions or upload things.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1882.648,
    "end": 1896.712,
    "text": " Mean field, mode, equation nine, equation 16, probability, resource, statistical question.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1900.473,
    "end": 1905.834,
    "text": "Appendix B, just to see if there was any, also seemed like all details.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1907.222,
    "end": 1909.062,
    "text": " So we have 23 minutes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1910.283,
    "end": 1914.184,
    "text": "What does anybody want to ask now?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1915.324,
    "end": 1927.967,
    "text": "Or is there some question here, like the most upvoted one or some other one that's far less challenging that they would like to address for the next 20 minutes?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1970.492,
    "end": 1974.094,
    "text": " Did anyone read Appendix A or B visually?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1983.199,
    "end": 1984.759,
    "text": "Did you just ask if anyone read it?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1985.48,
    "end": 1987.681,
    "text": "Yes, what would anyone like to share about reading it?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 1989.934,
    "end": 1997.138,
    "text": " I totally read it with a highlighter and made several notes in the margin in my physical book.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1998.358,
    "end": 1999.119,
    "text": "It was challenging.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1999.139,
    "end": 2001.58,
    "text": "A lot of the notation, I feel like...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2004.461,
    "end": 2028.3,
    "text": " is like crazy like like um i mean even just in appendix b like the very is was it the very first thing like are they using o for observations are they using o for outcomes like i was totally unclear on that um completely so like state inference markov decision processes like",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2029.878,
    "end": 2032.12,
    "text": " Um, the states that influence outcomes.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2032.54,
    "end": 2033.321,
    "text": "Oh, right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2033.962,
    "end": 2036.504,
    "text": "Like literally that's what it says on the top of page two 44.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2037.885,
    "end": 2040.187,
    "text": "So it says that the variable O is an outcome.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2041.188,
    "end": 2042.509,
    "text": "Is an outcome and observation.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2042.569,
    "end": 2043.47,
    "text": "Are those the same thing?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2043.53,
    "end": 2044.571,
    "text": "Are they interchangeable?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2044.831,
    "end": 2047.253,
    "text": "Like I've always thought it was observations.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2048.114,
    "end": 2050.836,
    "text": "Um, that I put that question in there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2051.437,
    "end": 2051.957,
    "text": "It's already there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2052.638,
    "end": 2052.718,
    "text": "Um,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2054.197,
    "end": 2059.641,
    "text": " And then the question right before it, like this is a really tricky section, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2060.181,
    "end": 2064.464,
    "text": "So there's the two questions that are in Appendix B that are together.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2064.524,
    "end": 2067.706,
    "text": "It says the likelihood of observations given a policy is not straightforward to compute.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2068.106,
    "end": 2080.114,
    "text": "This is because POMDP problem is structured so that policies pi influence trajectories indicated by tilde of states S that influence outcomes O without a direct influence of policies on outcomes.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2080.974,
    "end": 2089.683,
    "text": " The problem then involves a sum over trajectories of states to marginalize these out and find a marginal likelihood of observations given policies.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2090.164,
    "end": 2091.685,
    "text": "What does that these even refer to?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2092.106,
    "end": 2096.81,
    "text": "If you look in the questions in Appendix B, they're there in the questions already listed.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2097.271,
    "end": 2103.858,
    "text": "I felt like it was very obscure and not super clear, and also the notation gets crazy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2105.139,
    "end": 2112.271,
    "text": " And I'm like really a stickler for like defining every single variable and symbol in an equation to understand the math so that I can actually read it in English.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2112.812,
    "end": 2114.875,
    "text": "So I was a little bit lost.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2117.886,
    "end": 2118.746,
    "text": " Totally agree.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2119.407,
    "end": 2120.187,
    "text": "Thanks for sharing it.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2121.367,
    "end": 2121.527,
    "text": "Eric?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2121.567,
    "end": 2129.41,
    "text": "Just with respect to that particular question, I think that these refers to the trajectories of states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2130.63,
    "end": 2137.772,
    "text": "And you can see that because the sum is over the tilde S. So the tilde S is the trajectories of states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2139.813,
    "end": 2147.135,
    "text": "So you sum over all the trajectories of states to try to figure out, well, what are we going to get if we apply a given policy?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2148.649,
    "end": 2149.689,
    "text": " That's my intuition about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2150.99,
    "end": 2154.491,
    "text": "And I suspect also that observations are outcomes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2154.531,
    "end": 2155.992,
    "text": "They're sensory outcomes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2156.152,
    "end": 2163.094,
    "text": "They're the outcome of a generative model or a generative process, but they're the outcome that is observed.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2166.136,
    "end": 2174.879,
    "text": "But this is just showing how many dots we need to actually unpack and connect for unsighted, grammatically vague sentences.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2175.715,
    "end": 2175.975,
    "text": " Right.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2176.296,
    "end": 2176.956,
    "text": "So thank you.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2177.016,
    "end": 2181.78,
    "text": "My uncertainty has been reduced substantially just by figuring that out.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2182.08,
    "end": 2184.662,
    "text": "But I felt like that the whole time I was reading the appendix.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2184.682,
    "end": 2186.804,
    "text": "I was like, what is even going on here?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2186.824,
    "end": 2189.086,
    "text": "Yeah.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2189.586,
    "end": 2192.669,
    "text": "So in this... Yes, sir.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2192.729,
    "end": 2194.51,
    "text": "The way I view it is like exercising.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2195.191,
    "end": 2199.274,
    "text": "You're not going to run a marathon the first time you set out, but...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2200.407,
    "end": 2211.863,
    "text": " You know, the more you stretch and warm up, and that's kind of, I think, that's how I kind of view this going through the appendix is kind of refreshing on what you used to know about math, or at least for me.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2212.725,
    "end": 2215.929,
    "text": "And so that's like stretching and doing a little bit of exercise the last week.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2216.61,
    "end": 2221.352,
    "text": " And then every time you go through it, every time you see the notation, you've slept on it some more.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2222.292,
    "end": 2223.492,
    "text": "It becomes more and more familiar.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2223.572,
    "end": 2226.013,
    "text": "And so you can start to put together bigger and bigger chunks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2226.534,
    "end": 2230.715,
    "text": "Some vaguely you can map to the notation and the math.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2230.835,
    "end": 2237.517,
    "text": "Other ones, it's still going to be dangling, but that's OK because there's fewer dangling things that you're groping with at any given moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2237.757,
    "end": 2241.419,
    "text": "So I think it's great to go through these dependencies and see it all through one pass.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2242.319,
    "end": 2245.2,
    "text": " And all right, so I didn't run a marathon, but that's okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2245.24,
    "end": 2245.941,
    "text": "I ran two miles.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2245.981,
    "end": 2247.741,
    "text": "That's pretty good for a start.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2249.722,
    "end": 2250.243,
    "text": "Thanks, Eric.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2250.963,
    "end": 2254.024,
    "text": "Another, like, metaphor is just like, oh, yes, please, Jakob.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2256.265,
    "end": 2271.572,
    "text": "Yeah, I was just going to comment on what Blue said with kind of some confusion about the notation because I asked the question about the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2272.305,
    "end": 2295.303,
    "text": " marginalizing of states but then i was also confused about the o notation because um in the in equation b b.1 it kind of it it seems that it's a trajectory over outcomes but then there's also an o without a tilde on it so does that mean that it's an outcome at a particular point in time but then there's also a bold o",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2296.144,
    "end": 2298.666,
    "text": " which implies that it's kind of a vector.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2298.706,
    "end": 2303.41,
    "text": "But if it's a trajectory of outcomes, that also seems to be a vector.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2303.51,
    "end": 2311.256,
    "text": "A trajectory, for me, implies some kind of vector form because it's a sequence of outcomes given a policy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2312.217,
    "end": 2318.742,
    "text": "But then what does that bold O mean if not trajectories over outcomes?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2319.403,
    "end": 2324.567,
    "text": "So just to kind of add to the confusion, I guess.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2326.394,
    "end": 2327.114,
    "text": " Thanks, Jakob.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2327.234,
    "end": 2328.815,
    "text": "I'm glad, like, we're grokking.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2328.855,
    "end": 2333.296,
    "text": "We're on the same page, you and I. For sure.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2334.937,
    "end": 2338.318,
    "text": "It would be awesome for a description or any notes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2339.418,
    "end": 2343.059,
    "text": "What is the reading or a reading in language?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2345.0,
    "end": 2347.421,
    "text": "The this of this conditioned on that.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2348.481,
    "end": 2352.082,
    "text": "Is this over that of these two things?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2352.442,
    "end": 2354.163,
    "text": "The first thing is this, the second one is that.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2355.034,
    "end": 2357.596,
    "text": " An example of that is in this situation.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2358.396,
    "end": 2359.076,
    "text": "Here's the script.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2359.917,
    "end": 2361.178,
    "text": "Here's the graphical abstract.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2361.278,
    "end": 2361.978,
    "text": "Here's the paper.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2363.119,
    "end": 2364.219,
    "text": "Here's the person you could ask.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2365.58,
    "end": 2367.601,
    "text": "Which one of these do you think is going to be interesting?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2367.621,
    "end": 2376.306,
    "text": "Okay, so Mike asked, and I'll copy this in.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2377.547,
    "end": 2382.59,
    "text": "For those who have read the entire book, did you find the appendices useful as you went along through the chapters?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2399.202,
    "end": 2399.463,
    "text": " Ali?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2404.53,
    "end": 2415.486,
    "text": "Yeah, I also think that if the materials in these two appendices were to be integrated in the linear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.081,
    "end": 2439.509,
    "text": " narrative of the whole book it would be much more useful than separating out as I mean separate appendices because as we see I mean that's my own experience well reading the chapters independently and in isolation of the narrative doesn't give me a sense of their",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.349,
    "end": 2450.858,
    "text": " uh concrete applications and i don't know how to use them and how to use these for all of these equations and everything becomes much more fuzzy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.113,
    "end": 2488.787,
    "text": " i hope this is not controversial that linear reading of the appendix as something that you look through is extremely confusing or extremely imprecise because there's many symbols introduced that might have been introduced earlier like oh is probably discussed earlier but then it's briefly just sort of mentioned and then there's a lot of symbology that's not mentioned what it is",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2490.387,
    "end": 2500.372,
    "text": " So it's hard to read the appendix without prior knowledge, yet ostensibly Appendix A is the introduction refresher.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2505.235,
    "end": 2507.796,
    "text": "So is this the introduction offering?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2510.097,
    "end": 2515.48,
    "text": "They hope, so they expect and prefer perhaps, the appendix to go some way towards remedying it",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2517.827,
    "end": 2524.389,
    "text": " being the maths required to understand this not complicated basis.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2527.85,
    "end": 2533.212,
    "text": "The multidisciplinary basis means it is often difficult to find resources that bring together the necessary prerequisites.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2535.813,
    "end": 2536.873,
    "text": "They're going some way.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2538.089,
    "end": 2561.199,
    "text": " so this is like one kind of plank out there from their point of view from the chapters this is stuff and ali i also kind of agree like on what what ordering these are really interesting questions so then what is the next connector that picks up here with this artifact because um like someone mentioned how um",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2563.123,
    "end": 2586.378,
    "text": " more it's mentioned you could basically do a whole course on deep learning to apply most of the matrix operations and whole courses on like the math of them so they can't go into all this detail they can't spend one hour or like multiple coda pages on just what this means so there has to be some kind of compromise but then there's not going to be one specific perfect compromise",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2589.522,
    "end": 2592.203,
    "text": " with, especially with like length and audience considered?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2594.364,
    "end": 2603.988,
    "text": "So I think like, I mean, I undertook like a very detailed linear reading of the book because that's just kind of how I am of the appendixes at least.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2604.509,
    "end": 2618.855,
    "text": "But I think for many people that like, I mean, I've been there before, like where you're staring at math equations, like this is gibberish, but like, so just to read the text, you know, and like to read it and go through it, it's helpful to know that it's there.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2619.415,
    "end": 2626.809,
    "text": " So if nothing else, at least you can be reading the book and then be like, oh, I remember kind of reading about, you know,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2627.859,
    "end": 2630.821,
    "text": " Taylor series expansion in the appendix.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2631.262,
    "end": 2637.427,
    "text": "And so then you can just go back and just having access to it or the refresh recall access.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2638.327,
    "end": 2642.53,
    "text": "Even though it is confusing, I agree to try a linear read of the appendix.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2642.891,
    "end": 2649.996,
    "text": "I think skimming over it or deeply reading it and then being able to refer back to it is useful.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2650.016,
    "end": 2651.978,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2653.879,
    "end": 2655.881,
    "text": "So in next week...",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2657.37,
    "end": 2679.469,
    "text": " are going the next two weeks so the pace of one section per week might be like whatever it was for you however much time you put in etc the coming chapters are going to be very different because one didn't have any formalisms or figures really just the kind of overview figures but we're gonna have two weeks for two so",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2680.566,
    "end": 2703.462,
    "text": " no need to rush it read a couple pages and then just go back to the beginning and just restart the same pages like that's like the multiple coats of paint in a mural like the low road to active inference that's where they're going to pick up in that high road low road um dialectic that we talked about last time let's just see like what figures what equations might happen okay a lot of terms",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2704.773,
    "end": 2708.915,
    "text": " that hopefully are in the ontology already.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2709.296,
    "end": 2714.539,
    "text": "Like you can use the at symbol, hopefully to call most of them.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2716.34,
    "end": 2720.542,
    "text": "But if something's not there, we can add it to supplemental or entailed.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2720.562,
    "end": 2726.746,
    "text": "Okay, so what figures and equations we might see.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2727.806,
    "end": 2732.369,
    "text": "Here's a box, 2.1, about probability.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2735.014,
    "end": 2761.185,
    "text": " here's an equation that's the Bayesian kernel and it's going to be talking about this example of a frog and an apple and jumping or not jumping and that example is going to play a current role but then some likelihoods are shown in a specific example of like frogs and jumping or not and apples",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2763.424,
    "end": 2767.865,
    "text": " There's a work through example of exact Bayesian inference.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2770.966,
    "end": 2773.247,
    "text": "Here's a table on statistical distributions.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2776.648,
    "end": 2780.189,
    "text": "It would be really interesting like to hear what support and surprise mean.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2781.63,
    "end": 2784.351,
    "text": "And why, what are these, are these all the distributions?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2784.511,
    "end": 2787.952,
    "text": "Are there other ones or like why these ones or why are they useful?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2788.752,
    "end": 2789.793,
    "text": "Where have they been used?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2790.073,
    "end": 2790.733,
    "text": "What does it even mean?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2794.778,
    "end": 2797.679,
    "text": " Here's where the KL divergence is introduced.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2798.76,
    "end": 2805.784,
    "text": "And then some more analysis from a surprise perspective, Bayesian surprise with the KL divergence.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2807.504,
    "end": 2812.507,
    "text": "There's the box on expectations, which is also what we talked about a little bit today.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2812.687,
    "end": 2815.869,
    "text": "And that was like really interesting to connect it to the matrices.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2820.251,
    "end": 2820.571,
    "text": "A figure.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2822.159,
    "end": 2826.561,
    "text": " of the generative process and the generative model is the caption.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2831.364,
    "end": 2831.724,
    "text": "A figure.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2832.665,
    "end": 2836.467,
    "text": "Both perception and action minimize discrepancy between model and world.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2843.97,
    "end": 2845.011,
    "text": "Variational free energy.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2850.387,
    "end": 2873.713,
    "text": " variational free energy as an upper bound on negative log evidence the figure but with equations in it very common format bigger complementary roles of perception and action in the minimization of variational free energy big active theme and like something kind of a common fristinism",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2874.505,
    "end": 2881.629,
    "text": " like perception and action being in the same game or being in the same service of the same objective function.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2886.291,
    "end": 2892.114,
    "text": "Planning, but no specific equations, but probably citations.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2895.076,
    "end": 2902.34,
    "text": "Just introducing expected free energy, which Jakob and others can probably go into a lot more detail on.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2904.187,
    "end": 2926.001,
    "text": " expected free energy about a future where the outcomes haven't happened expected free energy figure with equations the end of the low road introducing the two key terms variational free energy expected free energy summary",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2932.296,
    "end": 2952.9,
    "text": " does anybody like want to like add or what was something cool or whether they read it already or not what does anyone oh ali yes please",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 2958.417,
    "end": 2965.161,
    "text": " Well, I've noticed the dispersion of some sidebar boxes like box 2.1 or in this chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.181,
    "end": 2983.072,
    "text": "I don't know the distinction between the purpose of these boxes and, I mean, what's the function of these boxes as compared to what we see in the appendices, because presumably these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.012,
    "end": 2990.718,
    "text": " Boxes cover the concepts that could be skipped over if one is familiar with these mathematical concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.838,
    "end": 2998.084,
    "text": "So, do you have any idea about the reason behind this decision?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.104,
    "end": 3008.273,
    "text": "I mean, covering some basic concepts, basic mathematical concepts in these sidebar boxes and some others in the appendices?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.192,
    "end": 3044.405,
    "text": " that's a great question a box could reflect like okay expectations got it or like okay some product rule all right but it's kind of like you might want to read that or is this introductory highlighting it this is the 101 on probability or is it saying this is a total skippable unit if you want to learn about how the lizard does it here's where you look",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3045.758,
    "end": 3048.079,
    "text": " It can sometimes mean both.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3049.099,
    "end": 3056.281,
    "text": "The format of the book is also relatively austere, though in a concise tone.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3058.661,
    "end": 3071.785,
    "text": "It's in black and white, which, especially in some later sections, makes some visualizations where it's hard to understand what curves are doing what.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3073.24,
    "end": 3089.092,
    "text": " a black and white image so what is there to see with the color i mean but it also might predispose towards more simple or visually accessible material so what is going to be accessible",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3091.178,
    "end": 3117.308,
    "text": " the order so those are all really important questions so we can just take notes on it you know in the weeks that we're going to continue to do this because we only have limited live time how about in the last like three minutes what does anybody think about the opening quotations or specifically this quotation my thinking is first and last and always for the sake of my doing william james",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3122.987,
    "end": 3126.829,
    "text": " You know, I thought the guy was a philosopher, so I guess you disabused me of that one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3137.353,
    "end": 3137.573,
    "text": "Yeah.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3142.955,
    "end": 3148.938,
    "text": "These would be really nice areas to look into for people who like the history part.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3150.513,
    "end": 3159.876,
    "text": " Blue and I and others are working on some different kinds of ways to reference papers and just, oh, cool paper.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3161.216,
    "end": 3162.396,
    "text": "Sensation, perception.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3163.096,
    "end": 3163.937,
    "text": "We have those terms.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3164.377,
    "end": 3166.457,
    "text": "We could just link the paper somewhere.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3166.477,
    "end": 3176.6,
    "text": "So if anyone's interested in that kind of architectures or that kind of philosophy question, those are",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3178.466,
    "end": 3206.976,
    "text": " the literature right now is small enough to know what has and hasn't been done in a lot of areas that are philosophical and applied and technical but just from like a first principles what does this seem to mean uh that shared that other group that were kind of both a part of Daniel um",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3210.271,
    "end": 3228.558,
    "text": " liminal Tao thing that's not really a Tao I don't know what it is but there's this debate for some reason that's going on there about you know different ways of knowing and being and doing and a bunch of stuff that is kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3230.683,
    "end": 3233.305,
    "text": " a mix of philosophy and linguistic fallacies.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3233.385,
    "end": 3248.857,
    "text": "But if thinking is actually a physical process, which I think, you know, I don't think anyone here is going to argue against, then it is something necessarily that is being done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3250.66,
    "end": 3271.488,
    "text": " And so however, I guess, small, you want to draw that Markov blanket, and then however large, whether that's your physical body actions or some extended thinking, it's literally what you're doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3273.208,
    "end": 3277.71,
    "text": "It's not just for the sake of your actions, but they are your actions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3278.78,
    "end": 3282.061,
    "text": " Like, they're just another set of your actions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3283.901,
    "end": 3284.141,
    "text": "All right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3284.801,
    "end": 3286.102,
    "text": "I'll offer a different take on it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3287.162,
    "end": 3288.022,
    "text": "Yeah, awesome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3288.342,
    "end": 3290.562,
    "text": "William James was a great visionary.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3291.463,
    "end": 3301.205,
    "text": "And he foresaw Mark Zuckerberg's metaverse 120 years ago or whatever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3301.445,
    "end": 3302.225,
    "text": "And he said, no.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3303.709,
    "end": 3307.212,
    "text": " I don't want to live just inside my mind, inside the metaverse.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3307.893,
    "end": 3311.636,
    "text": "I want to be out in the world, interact with real people and real things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3311.716,
    "end": 3317.101,
    "text": "So he was a meta or Facebook skeptic way before his time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3321.205,
    "end": 3322.226,
    "text": "Okay, thank you, Ali.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3326.338,
    "end": 3340.984,
    "text": " As Brock mentioned, I think it relates to an epistemological distinction between propositional knowledge and how-to knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.424,
    "end": 3350.047,
    "text": "And I think this statement here tries to blur this distinction, blurs the line between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.048,
    "end": 3377.541,
    "text": " propositional knowledge and know-how knowledge, because especially in analytical school of philosophy, there's always been a very, let's say, not heated debate, but there's a longstanding debate about the distinction between these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.321,
    "end": 3396.52,
    "text": " two kinds of knowledge and whether they're in fact they can be distinguished from each other or not thank you could you just unpack what are the two kinds of knowledge again and what are just they referring to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.685,
    "end": 3397.905,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.685,
    "end": 3410.789,
    "text": "Well, about propositional knowledge, well, an example of propositional knowledge is to know the exact mechanisms of walking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.729,
    "end": 3419.151,
    "text": "I mean, which muscles contract and which, I mean, in what angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.171,
    "end": 3422.112,
    "text": "I mean, the whole thing about the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.454,
    "end": 3434.422,
    "text": " Biomechanics of walking, the whole knowledge about the biomechanics of knowledge can constitute this kind of propositional knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.143,
    "end": 3438.747,
    "text": "And it's totally different from knowing how to walk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.908,
    "end": 3445.494,
    "text": "I mean, a three or four year old child has a know-how knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.954,
    "end": 3454.296,
    "text": " of walking but not necessarily where he or she doesn't know anything about the biomechanics of walking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.696,
    "end": 3458.797,
    "text": "So the biomechanics of walking is the propositional knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.918,
    "end": 3465.559,
    "text": "Actually knowing how to walk constitutes the know-how of walking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.5,
    "end": 3500.714,
    "text": " so when people say things like active inference is integrating perception cognition and action maybe it is rethinking some of these long-held mental frameworks for distinguishing or operating differently on action and perception like one fascinating recent example from me was and working with eric was",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3502.037,
    "end": 3512.308,
    "text": " In the area of ant pheromone modeling, without going into too many details, people often modeled preference as a function of the absolute amount of pheromone on trails.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3513.028,
    "end": 3520.857,
    "text": "Because that's what the exponential light decay is on, that's what can be manipulated, rather than the perceived intensity.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3522.048,
    "end": 3524.05,
    "text": " which might have a different scaling relationship.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3524.27,
    "end": 3526.572,
    "text": "So it's like a dim room, you can detect a small change.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3526.632,
    "end": 3528.833,
    "text": "Bright room, you can't detect a small change.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3529.554,
    "end": 3550.27,
    "text": "So that kind of psychophysics of perception gets ignored implicitly because of calls for measurability, because the cognitive can't be measured directly, even if you potentially had a electrical measurement or something like that happening.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3554.059,
    "end": 3570.65,
    "text": " then these are awesome questions can you think without acting or is thinking in action this active paper which was on a live stream so we can provide the link to",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3574.824,
    "end": 3600.947,
    "text": " it models like perception and action in the sort of like kernel level just the autonomous sensing sentient bot level and then attention and metacognition are both related as actions to the lower level which is like why the paper is relating computational phenomenology with mental action",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3603.519,
    "end": 3608.262,
    "text": " Again, just to have like a look at the kinds of models that can happen.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3609.303,
    "end": 3615.967,
    "text": "And then now, does making any model fitting any data well enough and saying, well, we modeled it as action.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3617.068,
    "end": 3618.109,
    "text": "So is thinking an action?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3619.65,
    "end": 3625.994,
    "text": "Will that model that says, yeah, it's consistent with that, will that ever constitute positive evidence for saying thinking is action?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3627.035,
    "end": 3629.817,
    "text": "Or why even say that?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3630.477,
    "end": 3631.478,
    "text": "Or what does it mean to say it?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3634.864,
    "end": 3635.925,
    "text": " And then here's a funny meme.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3638.606,
    "end": 3644.669,
    "text": "Here's the generative model and the generative, the partially observable Markov decision process.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3645.369,
    "end": 3646.21,
    "text": "Here's Carl Friston.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3652.233,
    "end": 3653.573,
    "text": "Jessica, and then anyone else?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3655.234,
    "end": 3655.474,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3656.635,
    "end": 3662.438,
    "text": "I guess it's sort of like a beginning understanding of this is that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3664.059,
    "end": 3669.963,
    "text": " I tend to think that there's like a bias towards action in active inference.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3670.283,
    "end": 3681.049,
    "text": "I think like the first chapter is saying like, you know, even if you want to like sense or like perceive, you have to do some kind of action in order to gain the information.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3682.23,
    "end": 3691.676,
    "text": "And this like, you know, quote is basically saying like, okay, even though the whole field is trying to understand cognition, it's sort of like",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3692.694,
    "end": 3699.719,
    "text": " what we decide to do and the thinking that we go through in order to determine our policy is to determine our actions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3699.859,
    "end": 3703.401,
    "text": "And then it sort of like feed into, um, the thinking itself.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3703.461,
    "end": 3706.143,
    "text": "So maybe that's why there's like the bias to action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3707.284,
    "end": 3714.669,
    "text": "Um, because like our actions is what it's going to be allowing the thinking, but, um,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3716.986,
    "end": 3723.152,
    "text": " when we update our models or like, you know, trying to come up with like the policies that we're going to be doing, like we have to be processing things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3723.772,
    "end": 3728.237,
    "text": "So, you know, the thinking is in like as a service to action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3728.937,
    "end": 3731.4,
    "text": "And that's sort of like what I was thinking.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3731.42,
    "end": 3731.66,
    "text": "I don't know.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3731.68,
    "end": 3735.203,
    "text": "It's a little bit like, you know, with the chicken and the egg, but yeah,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3736.274,
    "end": 3747.944,
    "text": " You know, I kind of tend to think of it as like, yes, we have to act in order to understand, but like the understanding which will be coming from the thinking is what determines our next action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3749.785,
    "end": 3751.166,
    "text": "Yeah, that's kind of what I was thinking.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3756.491,
    "end": 3756.851,
    "text": "Matthew?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3757.271,
    "end": 3757.812,
    "text": "Thanks, Jessica.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3760.928,
    "end": 3786.425,
    "text": " yeah i mean it kind of seems to me like we're stuck in a little bit of a linguistic godelian loop of some sort because you know thinking is you know essentially a verb and verbs tend to imply in like a linguistic emergent term actions and so we have to then pop outside of that and try to consider with our internal mental processes how to disentangle these concepts but i see no reason to think",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3787.301,
    "end": 3800.033,
    "text": " that to think ironically, that internal mental states aren't also conscious parameterizations of processes in the brain and our ability to grasp control of that to some extent.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3800.614,
    "end": 3811.444,
    "text": "And so it seems very strange to me to try to separate those linguistically from our current vantage point, even though I understand why historically working only with language, it might have made sense.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3812.273,
    "end": 3827.043,
    "text": " So those kind of quotes like James's strike me as somewhat antiquated or just operating on dichotomies that don't seem to make sense given that we've unpacked these processes to the degree we have.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3827.063,
    "end": 3831.365,
    "text": "Thank you, Matthew.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3831.425,
    "end": 3833.487,
    "text": "Very deep points.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3835.128,
    "end": 3837.95,
    "text": "Like you mentioned, thinking as a verb implies action.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3839.318,
    "end": 3847.352,
    "text": " And then just to kind of complete that, thought is like the word or the noun form of this one.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3848.354,
    "end": 3849.496,
    "text": "So then what does that imply?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3857.17,
    "end": 3867.597,
    "text": " And then also, like Jessica mentioned... To some extent, we can only express processes through their discretization via symbols, right?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3869.559,
    "end": 3886.871,
    "text": "The idea that there's this process, there's a flow, there's something that can't necessarily be separated, obviously, from the rest of the flows around it, but to reference it, to point to it, to describe it, communicate it to another agent, we have to nounize it",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3888.55,
    "end": 3892.472,
    "text": " kind of like, which is the opposite of verbalizing, so to speak.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 3895.634,
    "end": 3896.914,
    "text": "Wow, thank you, Matthew.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3897.615,
    "end": 3901.217,
    "text": "Again, these are, yes, Eric?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3910.242,
    "end": 3919.026,
    "text": " sorry i didn't have anything i didn't do it okay the hand was yeah so um carl friston had a influential 2019 uh paper long paper",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3924.244,
    "end": 3948.198,
    "text": " the free energy principle for a particular physics so that was in 2019 so it's been several years since then and like particular allegedly slash accidentally or intentionally is a pun so it can mean specific like a physics for the specific systems that we're modeling or it could be specific like this is a specific approach",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3950.074,
    "end": 3955.075,
    "text": " Another interpretation is it's for particulate entities.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3956.516,
    "end": 3972.02,
    "text": "When we define thing and the partition, which is going to co-instantiate the generative model and the generative process, and then the Markov blanket or the interface that's separating them, that is separating the figure from ground.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3972.06,
    "end": 3974.5,
    "text": "It's separating the entity from the niche.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3975.361,
    "end": 3977.021,
    "text": "It's separating what from what?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 3978.595,
    "end": 4004.465,
    "text": " what what can it represent the separation of something from all possible separations some separations and then Matthew you mentioned like yeah verbalizing speech but it feels like we're speaking that's sometimes yet verbalization is a process especially um dialogue yes Matthew",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4006.849,
    "end": 4012.413,
    "text": " Could I ask a question that brings in a little bit of content from the other chapters of the book?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4012.433,
    "end": 4012.613,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4015.25,
    "end": 4024.973,
    "text": " I'm just kind of curious, because when you're talking about the Markov blankets and integrating it into this idea of how we draw boundaries, I'm kind of curious.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4025.613,
    "end": 4039.637,
    "text": "Is it fair to say that to the extent we've drawn our boundaries and do see a reduction of free energy in this system, it reinforces the idea that there's something to that",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4040.646,
    "end": 4044.369,
    "text": " boundary structure as an entity in the world, that there's a reality to that.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4044.469,
    "end": 4045.631,
    "text": "Is that a fair interpretation?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4050.755,
    "end": 4053.518,
    "text": "I think many people would have a lot to say and add.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4053.678,
    "end": 4058.002,
    "text": "This touches on the question of reification of scientific models.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4059.853,
    "end": 4084.248,
    "text": " and the ability for a identified statistical model to be like transcending itself and used in a realist way like ontologically real about true joints of the world and um i'm gonna go to live stream table and find several of the of those who explained their research on this topic",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4086.169,
    "end": 4111.495,
    "text": " But even short of trying to claim it's real, like, is it just, does that ability, like once we've drawn a boundary using these Markov blankets, and we do see that it seems to be, let's say, using information to self-evidence, do we think that that's, I mean, it seems like this paradigm of thought is predicated on the idea that",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4112.375,
    "end": 4120.021,
    "text": " to the extent that that occurs and reduces free energy, it should attract or further attract attention, at the very least, for examination or investigation.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4122.923,
    "end": 4124.684,
    "text": "Yes, so great questions.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4125.105,
    "end": 4126.346,
    "text": "Jakob, do you have something to add on that?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4126.846,
    "end": 4130.489,
    "text": "Or is it a slightly different area?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4130.669,
    "end": 4134.231,
    "text": "I guess it's kind of related to the Markov blanket discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4136.893,
    "end": 4140.115,
    "text": "This may be completely wrong, but it seems to me like with",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4141.867,
    "end": 4150.493,
    "text": " Um, that this kind of discretization of the Markov blankets forces us to a specific kind of discrete thinking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4151.153,
    "end": 4170.045,
    "text": "But I feel like that just this model of a, of a Markov blanket, I think of it as a kind of classical model, but I presume that the reality is more something like a Schrodinger Markov blanket where it's not, we can't really draw boundaries between",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4170.882,
    "end": 4199.586,
    "text": " thinking and observing and generative process in the same way that we can think of say electrons as balls bouncing off each other but they're not really we can think of them as classical particles and that will help us to an extent but then we can also observe the process of thinking so thinking is also kind of entangled with the generative process so there's",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4200.768,
    "end": 4230.301,
    "text": " So even though the Markov blanket is a useful formalism, I think that there are definitely certain scenarios in which it's more like a probabilistic, well, it's already probabilistic, but in the sense that the entity that's performing inference also in its own inference loop",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4231.936,
    "end": 4243.326,
    "text": " performs inference on itself, and therefore thinking is at the same time an action, but at the same time it's part of the generative process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4243.346,
    "end": 4251.312,
    "text": "Okay, another...",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4252.463,
    "end": 4260.227,
    "text": " angle on this, thanks Jacob, is what Dean T. often talks about with like active inference as a framework or a filter.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4260.667,
    "end": 4267.611,
    "text": "These are just sort of like, you know, different distinctions that might be transiently useful in some axis, like fitting something to a framework.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4268.471,
    "end": 4270.092,
    "text": "It's kind of the Procrustes bed.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4270.592,
    "end": 4279.617,
    "text": "Stretch it out so that this perception and then active as a filter was reminding me of what Matthew was saying, like going out and discovering",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4280.836,
    "end": 4303.666,
    "text": " divergences from expectation of there not being metabolic activity on a planet and then there is some statistical deviation and so like in the classical statistical framework that might be like it's a one sigma difference in the bayesian framework well there's a base factor of two and here for this evidence",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4304.793,
    "end": 4333.66,
    "text": " there's other ways to like talk about detection of novel entities that might be part of like a reification process of the extended cognition of the modelers and then like one philosophical angle on that and then also anyone who who um wants to then ali is um this book by helen longino which talks about methodological pluralism",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4334.895,
    "end": 4353.503,
    "text": " about how there can be like disciplinary rigor and the ways in which often unstated like social priors can be the substance of what becomes understood to be science as like a complex phenomena um ali and then brock",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4356.153,
    "end": 4377.883,
    "text": " Adding to what Yakov said, I think the concept of Markov blanket emanates from the Platonian way of thinking, specifically the hylomorphism school of thought as opposed to hylozoism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.263,
    "end": 4385.206,
    "text": "The distinction between hylomorphism and hylozoism is that in hylomorphism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.454,
    "end": 4388.275,
    "text": " Everything is disconnected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.455,
    "end": 4394.019,
    "text": "Every concept is disconnected with every other concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.179,
    "end": 4400.123,
    "text": "And so there's a discontinuity, a metaphysical discontinuity between the concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.843,
    "end": 4414.012,
    "text": "But in hylozoism, the philosophers advocating this school of thought, well, they claim that hylomorphism is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.532,
    "end": 4420.696,
    "text": " fails at answering the question of what it is adequately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.177,
    "end": 4433.165,
    "text": "And they even rephrase the question and they claim that the right question to ask is not what it is, it's what it can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.825,
    "end": 4438.688,
    "text": "So that's basically the distinction between hylomorphism and hylozoism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.329,
    "end": 4441.911,
    "text": "But I think the Markov blanket",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.911,
    "end": 4450.252,
    "text": " is a way of formalizing this hylomorphic way of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.393,
    "end": 4452.593,
    "text": "At least that's my opinion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.013,
    "end": 4457.254,
    "text": "Thanks a lot for that, Ali.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4457.354,
    "end": 4457.614,
    "text": "Eric?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4468.776,
    "end": 4469.956,
    "text": "Sorry, I'm not hearing Eric.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4470.336,
    "end": 4471.316,
    "text": "Can others hear Eric?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4475.185,
    "end": 4476.048,
    "text": " Maybe I need to reload.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4478.295,
    "end": 4480.281,
    "text": "Okay, I'm going to reload.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4500.031,
    "end": 4500.951,
    "text": " Dando, can you hear me?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4500.971,
    "end": 4502.452,
    "text": "Yeah, no, I can hear Blue.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4502.812,
    "end": 4504.612,
    "text": "Okay, you're still not hearing Eric, though.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4505.192,
    "end": 4505.792,
    "text": "No, sorry.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4507.012,
    "end": 4509.033,
    "text": "Yeah, I just did like a small disrupt.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4516.014,
    "end": 4520.815,
    "text": "Okay, I'm gonna... Okay, wait, Eric, try again.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4521.415,
    "end": 4522.796,
    "text": "Okay, how about now?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4522.916,
    "end": 4524.376,
    "text": "Now I can see you in here again, okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4525.056,
    "end": 4525.916,
    "text": "How about everyone else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4527.597,
    "end": 4528.337,
    "text": "Who's the audience...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4529.477,
    "end": 4530.077,
    "text": " Okay, wow.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4530.798,
    "end": 4533.099,
    "text": "Disrupt on the high-low field.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4534.019,
    "end": 4534.7,
    "text": "It's happened before.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4534.72,
    "end": 4541.763,
    "text": "I would just throw in my two cents about my interpretation of a Markov blanket.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4541.823,
    "end": 4549.827,
    "text": "It's about trying to perform simplifications that make computation tractable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4550.668,
    "end": 4555.05,
    "text": "If you have everything interacting with everything else, then we can't do computing on that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4555.59,
    "end": 4556.751,
    "text": "So we apply...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4559.532,
    "end": 4566.176,
    "text": " compartmentalization and build objects and interfaces for how the objects interact with one another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4566.196,
    "end": 4571.518,
    "text": "And those become tractable.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4571.578,
    "end": 4581.384,
    "text": "That's what, you know, what a Bayes net does is it says what are independent and what are dependent variables on each other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4582.544,
    "end": 4592.837,
    "text": " And that works well when those abstractions, the objects and relations of nouns or verbs are a good fit to how the world actually operates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4593.418,
    "end": 4600.326,
    "text": "So that is a driver for learning or building representations that will use these Markov blankets in",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4601.067,
    "end": 4610.149,
    "text": " and put the compartments where they actually are faithful to the compartmentalization that we can abstract over the way the parts in the world operate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4610.589,
    "end": 4625.451,
    "text": "So things that are distant, that interact only weekly, we try to maybe factor those out, pretend they don't interact at all, or use some other intermediate variables to represent the interaction in order to simplify things so we can do computation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4625.731,
    "end": 4627.872,
    "text": "So that's how I think Markov blankets.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4627.952,
    "end": 4630.492,
    "text": "And we'll see if the math tells us that later on when we get to it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4632.293,
    "end": 4632.613,
    "text": " Awesome.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4633.194,
    "end": 4633.494,
    "text": "Brock?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4634.515,
    "end": 4634.996,
    "text": "And then Nellie.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4647.847,
    "end": 4649.869,
    "text": "Okay, I'm, like, not hearing Brock, unfortunately.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4650.45,
    "end": 4650.75,
    "text": "Do you?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4652.051,
    "end": 4653.252,
    "text": "Yes, we all hear Brock.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4653.332,
    "end": 4655.054,
    "text": "Brock is reloading, I think, now again.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4655.274,
    "end": 4656.555,
    "text": "Okay.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4656.656,
    "end": 4657.877,
    "text": "Yather does this sometimes...",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4659.585,
    "end": 4663.086,
    "text": " But I don't know if it's because we have 15 people.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4664.426,
    "end": 4666.827,
    "text": "Yeah, but it's, yeah, like Matthew said, I don't hear him.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4666.867,
    "end": 4668.768,
    "text": "It's just like there's different drop-offs.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4671.708,
    "end": 4674.289,
    "text": "I can hear you, but I still think Daniel can't hear you.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4674.429,
    "end": 4675.629,
    "text": "Daniel, you can't hear Brock.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4675.669,
    "end": 4677.49,
    "text": "Wait, Brock, now you're back.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4677.51,
    "end": 4677.71,
    "text": "Go for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4677.73,
    "end": 4678.15,
    "text": "Okay, continue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4678.79,
    "end": 4679.27,
    "text": "Interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4679.851,
    "end": 4680.311,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4680.751,
    "end": 4680.871,
    "text": "Yeah.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4681.494,
    "end": 4682.936,
    "text": " Oh, okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4684.037,
    "end": 4689.485,
    "text": "Yeah, no, this is just this ongoing thing that I don't know, we just keep keeps coming up about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4689.925,
    "end": 4692.008,
    "text": "Yeah, well, okay, maybe they exist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4692.048,
    "end": 4694.491,
    "text": "Maybe they don't markup blankets, really.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4694.571,
    "end": 4698.136,
    "text": "But like, how would they form in any?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4701.051,
    "end": 4702.953,
    "text": " How would they form and evolve and collapse?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4703.453,
    "end": 4720.608,
    "text": "Presumably there is some point in that process, this evolution part, where the Markov blanket is extremely poorly defined relative to the system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4722.146,
    "end": 4726.468,
    "text": " And that's basically these sort of underexplored areas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4726.748,
    "end": 4749.18,
    "text": "It was also in relation to Matthew's question also about the free energy minimization thing, where there's systems like non-equilibrium systems, basically, where still something interesting worthy of study is happening, but perhaps is not...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4751.101,
    "end": 4756.505,
    "text": " free energy minimizing in that state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4756.525,
    "end": 4760.207,
    "text": "Thanks for sharing it.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4760.267,
    "end": 4761.087,
    "text": "Just a few thoughts.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4761.688,
    "end": 4777.058,
    "text": "Let's just say some sort of mesoscale or global, as that's called, but that doesn't mean about the whole world, but some sort of global free energy minimization in the joint model is achieved, like in a conversation.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4778.433,
    "end": 4783.416,
    "text": " That isn't the same thing as the local disconnected free energy minimization.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4784.157,
    "end": 4793.623,
    "text": "Otherwise fitting high parameter models optimally would be simply reducing to fitting single dimensional models alone.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4793.923,
    "end": 4800.908,
    "text": "If we could just do the linear optimization on the standalone variables, then why would we ever need the larger dimensional methods?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4802.149,
    "end": 4806.552,
    "text": "And then like think of this textbook",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4808.174,
    "end": 4816.415,
    "text": " maybe with where things could be in the coming years, the Markov membrane is like the linear algebra.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4817.136,
    "end": 4819.676,
    "text": "And then Jakob mentioned that this is classical model.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4820.436,
    "end": 4825.977,
    "text": "It is kind of classical in a sense, in the timeless classic sense.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4827.137,
    "end": 4835.239,
    "text": "So the one layer Markov blanket, when thinking about like the rise and fall of civilization is not,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4836.223,
    "end": 4836.823,
    "text": " to end all.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4837.323,
    "end": 4853.788,
    "text": "That's like, I think maybe analogous to a linear regression, Y equals MX plus B. And then you have like the high, all these hundred years of development on the linear regression model and all these techniques and applications and pipelines.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4855.068,
    "end": 4863.191,
    "text": "So the Markov blanket one layer, potentially over-interpreting it as already presenting with strengths or weaknesses",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4864.372,
    "end": 4876.413,
    "text": " in certain situations when not being just like empirically demonstrated in the general case we'll see what could be said and when matthew",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4879.364,
    "end": 4881.785,
    "text": " Yeah, along those lines, I was kind of curious.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4881.825,
    "end": 4888.227,
    "text": "I've seen that there's been a decent amount of work on the sort of hierarchical or fractal composition of these models.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4888.647,
    "end": 4903.332,
    "text": "I'm curious if that implies that there's a fractality to the boundary by default, or is there any specific work on sort of hierarchical composition of the boundaries of that so-called membrane, as you said?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 4907.782,
    "end": 4929.825,
    "text": " with better annotation we could have better answers because there's many papers that we've discussed in a guest stream or a paper and there's also like many other papers obviously that that we don't have that kind of annotations of um because it's quite common to see nested models in the context of",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4931.169,
    "end": 4958.954,
    "text": " nesting of cognitive processes like in that sanford smith paper which was i think number 25 that was about cognition as mental uh action so that was nested and the nesting was interpreted as cognitive actions and counterfactuals basically and then sometimes nesting is used to refer to actual like well the state is inside of the country and then the region is inside of the state like it's a it's implied that the map is mapping on to the territory",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4959.833,
    "end": 4988.659,
    "text": " maybe even spatially the cell is inside of the tissue and that's like answering schrodinger's question everything happening with the planetary scale analyses cellular level um and then this is hopefully what is uh spoken to with like the composability of active inference and sometimes that's framed in terms of like the the lateral composability",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 4989.975,
    "end": 5000.745,
    "text": " of like how you could have three ants interacting or 300 ants and then the the nested composability you could have the fifth and the seventh and all those layers",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5001.943,
    "end": 5018.43,
    "text": " with computational trade-offs, maybe with no extra information to be gleaned, and then learning the structure of the generative model or just the structure of the partition more broadly and like what the variables are and everything, that's the structured learning challenge.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5019.791,
    "end": 5028.635,
    "text": "And cognition as structured learning, hashtag synergetics, geometry of thought, is what Fristin has,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5029.929,
    "end": 5039.336,
    "text": " and others have raised as like a total open area because there's the parameter fine tuning once you have the Bayes graph.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5040.717,
    "end": 5047.002,
    "text": "So then you're now inside of the ability to reify or not that model.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5048.022,
    "end": 5049.784,
    "text": "You're just doing parameter optimization.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5050.925,
    "end": 5055.128,
    "text": "We used two factors in this linear regression and then we optimized it with the L2 norm.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5056.148,
    "end": 5057.629,
    "text": "Two is the best number of factors.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5058.513,
    "end": 5061.676,
    "text": " But it couldn't be said at that scale.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5062.016,
    "end": 5070.183,
    "text": "You could say in a two parameter model, this is the best parameters with this norm, but then you couldn't pull back another level.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5071.564,
    "end": 5079.85,
    "text": "And so that's like meta-scientific and meta-Bayesian analyses, which they're going to talk about later.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5084.564,
    "end": 5108.375,
    "text": " OK, I guess I'm also kind of wondering if there are any examples that come to mind of something like a system that is structured such as the clearest or simplest example that comes to mind is like, let's say that you have a nation and a state within that nation and there is a port and there is an overlap of sort of that port interface to an outside structure that is shared by both the national and overlapping national and state.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5108.895,
    "end": 5110.336,
    "text": " interests and decision processes.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5111.556,
    "end": 5121.48,
    "text": "And so I'm kind of curious if there are examples of demonstrating that kind of composability of generative models, or if that's something that's still new and open.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5124.061,
    "end": 5126.982,
    "text": "Those are awesome questions, if people know any.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5128.743,
    "end": 5135.566,
    "text": "Some areas to investigate, like in the phenomena that you're overlapping interests informally,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5136.539,
    "end": 5158.495,
    "text": " there would be like shared regimes of attention there's the question of synchrony and that doesn't mean like um synchronization identically but generalized synchrony then there's like coordination of affordances we're not going to do this because of that so that's like",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5160.548,
    "end": 5178.212,
    "text": " and an area that Jakob and others have been working on is just describing that situation as an affordance on an affordance or like E sub E. It's not in the textbook, but if people are staying this long, then this is just kind of some ways that some people are thinking about it.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5178.792,
    "end": 5182.372,
    "text": "And these are the areas where people can also do research and learning with us.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5183.012,
    "end": 5185.613,
    "text": "But like affordances on affordances.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5188.05,
    "end": 5208.981,
    "text": " safety could be on or off so then there's like an affordance that modifies another affordance and could those have compositionality just like some of these other um generalization affordances for generalization basically what are those and then isn't it like discovering what those are",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5217.335,
    "end": 5240.345,
    "text": " Just really, I think, it's kind of also related to that question of this formation, evolution, collapse of Markov blankets is when, when does the observation actions of one system map to the, to the preferences of another and vice versa?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5240.425,
    "end": 5242.726,
    "text": "How does that come in to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5244.861,
    "end": 5268.379,
    "text": " being existence how does that start to happen and how does it unhappen i don't know awesome question thank you and and another like angle on that let me just check it um and then ali is like this is a graph that we're going to look at a ton and we will interpret what all of it means what is the o a s b pi g etc but",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5271.42,
    "end": 5280.224,
    "text": " This is a Bayesian graph, like Eric mentioned, and the edges are like dependencies, not causal influences in the world, but apparent potentially or different interpretations.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5281.305,
    "end": 5282.745,
    "text": "Is this the only skeleton?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5284.906,
    "end": 5288.488,
    "text": "No, this is the y equals mx plus b of skeletons.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5289.935,
    "end": 5295.097,
    "text": " And there's the linear regression in the first equation in the textbook of the stats textbook.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5295.737,
    "end": 5297.897,
    "text": "And then there's all these accessory tests.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5298.658,
    "end": 5301.878,
    "text": "Then there's like creation and destruction as applied.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5303.259,
    "end": 5309.081,
    "text": "Maybe there can just be a loop that's not active inference, just checking every day if something's within an arbitrary threshold.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5309.961,
    "end": 5313.802,
    "text": "So there could be some liminal or gray area",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5315.287,
    "end": 5319.509,
    "text": " Like an interface, I think Steven Silette mentioned it as like a nail bed or something.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5320.41,
    "end": 5326.953,
    "text": "Like an interface between more particulate and then less particulate, more field versus the particle.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5327.934,
    "end": 5328.094,
    "text": "Ali?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5332.006,
    "end": 5356.949,
    "text": " Well, as a little side note, there's a popular science book coming out, I think, in June, namely The Romance of Reality by Bobby Azarian, which touches on the emergence of markup blankets, the dynamics of emergence of markup blankets, and it attacks...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.846,
    "end": 5379.64,
    "text": " It attacks it from many different angles, evolutionary angle, I mean from a cosmic even perspective and it even goes as far as, well, considering the whole cosmos, the whole universe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5380.901,
    "end": 5389.567,
    "text": " as, let's say, a kind of meta-Markov blanket, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.808,
    "end": 5399.835,
    "text": "And, well, I think that could be an interesting thought put forward by Bobby Zarin in this book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5399.855,
    "end": 5400.075,
    "text": "All right.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5400.095,
    "end": 5400.656,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5403.134,
    "end": 5404.075,
    "text": " Thanks.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5404.395,
    "end": 5411.4,
    "text": "In fact, he gave part one of what was intended and may still be like a multiple part discussion.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5412.821,
    "end": 5414.962,
    "text": "This was him giving that presentation.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5417.084,
    "end": 5418.945,
    "text": "So we were in contact.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5419.005,
    "end": 5420.986,
    "text": "It's definitely, you know, it's an interesting view.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5421.987,
    "end": 5427.491,
    "text": "And it's going to take all kinds of research and education and communication.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5428.492,
    "end": 5428.872,
    "text": "Jessica?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5431.374,
    "end": 5431.554,
    "text": "Yes."
  },
  {
    "start": 5433.151,
    "end": 5451.979,
    "text": " Yes, I mean, I guess when I first joined the lab, some of the ideas that helped me a little bit to start even conceptualizing this, I mean, in addition to the filter that you mentioned before, Daniel, and how",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5454.306,
    "end": 5459.468,
    "text": " It could be more porous or more hard and allow things in and out.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5460.228,
    "end": 5467.411,
    "text": "But it was also about... It could be just grouping of relationships and interaction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5467.631,
    "end": 5474.753,
    "text": "So the closer a relationship... Different things are... Maybe that's more on biological systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5474.833,
    "end": 5475.193,
    "text": "I don't know.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5475.233,
    "end": 5482.176,
    "text": "If they're closely related or they have more interactions, even though they might be different, but...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5483.203,
    "end": 5484.684,
    "text": " grouping it in those sense.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5485.124,
    "end": 5510.793,
    "text": "And maybe that's relates to what Eric said and from the calculation of part, but that was sort of like, you know, some of the things like where I started connecting on Mark of Blankets to sort of like, okay, if, you know, items or like different objects and things like they're closely related, you can start like putting on like a blanket around",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5512.267,
    "end": 5518.331,
    "text": " And maybe it goes with the idea of wrapping things from some of the definitions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5518.471,
    "end": 5524.475,
    "text": "But yeah, those are kind of the kind of visual ideas that started helping me a little bit.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5524.855,
    "end": 5536.663,
    "text": "And I still don't understand properly, but those are the things I was like, okay, so relationships, filters, kind of like connecting interactions between things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5540.191,
    "end": 5540.472,
    "text": " Awesome.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5540.732,
    "end": 5541.935,
    "text": "Thanks a lot for that.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5542.075,
    "end": 5543.919,
    "text": "Like interacting entities.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5544.861,
    "end": 5549.391,
    "text": "So you could have the edges representing some interaction.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5550.424,
    "end": 5553.825,
    "text": " like when people are fitting a linear model, interacting variables.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5554.705,
    "end": 5563.947,
    "text": "So there's this whole discussion topic of whether the interactions are like the two ants bumping into each other, whatever that means in the quote real world.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5564.567,
    "end": 5566.547,
    "text": "And then there's like the statistical interaction.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5567.628,
    "end": 5572.089,
    "text": "So then defining certain variables in statistical models.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5572.309,
    "end": 5578.11,
    "text": "So leaving that debate behind us and just talking about the statistical models that we have Bayesian graphs.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5579.753,
    "end": 5592.357,
    "text": " some variables have edges between them that could be either designed to be there or not, or you could do some sort of thresholding approach and explore that your thresholding parameter was acceptable.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5592.897,
    "end": 5599.599,
    "text": "But the more of a loose interaction you allow, the more challenge there is to fit that statistical model.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5600.41,
    "end": 5622.983,
    "text": " and you may not have enough data to fit the 10 variable by 10 variable with all the interaction terms, which is why when doing linear modeling in a health population example, they would do model selection on what their statistical power is with that data set to resolve certain kinds of effects and correlations and non-sphericities.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5623.684,
    "end": 5628.567,
    "text": "And that is addressed a lot in the SPM textbook.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5629.577,
    "end": 5652.674,
    "text": " and for instance earlier like pre-act-inf work but then you mentioned like how to like be engaged with that process of like the wrapping or the seeing the clusters and then knowing like where is there going to be like maybe generative models arising that are consisting of other generative models or other generative processes and then like some things interact more with others",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5653.683,
    "end": 5659.528,
    "text": " statistically in the model as by design or just as an outcome of whatever.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5660.709,
    "end": 5663.331,
    "text": "So there's sparse connectivity amongst the variables.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5663.531,
    "end": 5665.393,
    "text": "They're not like all by all connected.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5666.354,
    "end": 5669.216,
    "text": "And then that sparse connectivity simplifies a lot of things.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5669.657,
    "end": 5675.602,
    "text": "That's also related to like a lasso regression and also to the below L2 norms.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5676.643,
    "end": 5678.844,
    "text": "And then a sparse model can be factorized.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5680.014,
    "end": 5690.477,
    "text": " And that is what allows for the variational Bayesian inference, which is like doing Bayesian model fitting on a factorized because it's sparsely connected graph.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5692.418,
    "end": 5701.56,
    "text": "And so a lot of these discussions are quite downstream of a lot of the philosophy of map and territory, but it's still super important conversation.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5702.561,
    "end": 5706.682,
    "text": "However, within the model, inference with a model, inference using a model,",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5708.792,
    "end": 5732.88,
    "text": " a lot of these questions are are very technical and downstream of importance qualitative things that are also important to keep in mind but of a different type jessica or anyone else yeah wow very interesting",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5738.969,
    "end": 5762.746,
    "text": " one other question i guess we can discuss like as the as it currently stands there's a one hour meeting and then at the end of the hour the very next hour begins the dot tools regular organizational unit meeting so is there i mean it is the people who are here now but hopefully others would be listening to it if they're not able to make this time but like",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5765.0,
    "end": 5791.207,
    "text": " what will help people with the synchronous and asynchronous make the most of the next few months do people appreciate having a longer discussion for this do people think that the main versus the math group like is there another subgroup like a philosophy discussion that people want to like kind of really do this",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5793.174,
    "end": 5818.944,
    "text": " because we're not like we don't we're experimenting with open-endedness on our first cohort and in these early phases of the book and people can probably imagine various of like the things we want to balance like respecting everyone's time and different backgrounds respecting their preferences for how much they want to learn about different topics being realistic about how much asynchronous and synchronous",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5820.555,
    "end": 5838.748,
    "text": " direct and peripheral time makes sense but also being realistic like there isn't a two minute video or a process so how do people think about like that those who have stayed this far",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5862.918,
    "end": 5864.079,
    "text": " Mike, and then anyone else.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5868.221,
    "end": 5868.621,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_13"
  },
  {
    "start": 5869.121,
    "end": 5869.321,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5870.202,
    "end": 5871.482,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5872.483,
    "end": 5884.609,
    "text": "Yeah, I think that, as noted earlier in the discussion, there are just so many themes that run through this that there are opportunities to pull on any of a number of threads in the course of discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5884.889,
    "end": 5888.871,
    "text": "And so today's discussion was interesting, and I stayed...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5889.926,
    "end": 5897.571,
    "text": " for this part of the discussion, simply because of the interesting threads that were being pulled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5899.032,
    "end": 5909.998,
    "text": "Certainly a contrast with the first part of the discussion around math, and I think a lot of uncertainty amongst the attendees about how to engage with the mathematical aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5910.358,
    "end": 5917.363,
    "text": "And so maybe to try and put a point on it, from my perspective,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5918.516,
    "end": 5928.751,
    "text": " Learning about what is active inference and how can active inference be applied in real world situations is a motivator for me participating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5930.911,
    "end": 5937.097,
    "text": " obviously, there are also sort of philosophical and maybe more scientific discussions that can take place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5938.018,
    "end": 5949.79,
    "text": "And so any, any meeting could touch on any of those aspects, as well as some of the asynchronous interaction could pick those up as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5952.192,
    "end": 5952.653,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5955.094,
    "end": 5956.394,
    "text": " Okay, anyone can raise their hand.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5956.514,
    "end": 5958.375,
    "text": "Here's just a few other options.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5958.395,
    "end": 5960.315,
    "text": "Like if somebody, here's something that's interesting to them.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5960.935,
    "end": 5974.918,
    "text": "We can, in the Discord, make a channel that is related, or people can participate in the regular channels, just like questions, like, or, and that's going to potentially be seen and interacted with by people more broadly.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5975.359,
    "end": 5977.679,
    "text": "Like, what if we posted questions that we're having?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5979.059,
    "end": 5981.76,
    "text": "We're in the cohort, one of the techs, and we now had this question.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 5983.368,
    "end": 6002.365,
    "text": " you know that's one option another um and this is like to mike's um expression that applied active inference is a motivator epistemic and pragmatic value expected epistemic value we expect to learn a lot by like staying in these sometimes",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6004.557,
    "end": 6032.587,
    "text": " challenging or oblique or whatever discussions but then there's also expected pragmatic value with applying active inference learning and applying active inference so then maybe that is a group we can partition like an applied active inference group so then we can be clear about what the focal artifact is because also we want to like not",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6033.587,
    "end": 6051.569,
    "text": " all groups at all times will be able to have uh nor is it useful to have open-ended discussions of any discussion length so like knowing how far and in what ways and how many minutes of people's linear time um ali yes",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6053.531,
    "end": 6068.788,
    "text": " the edu meetings well just one note on the organizational unit meetings the organization units in the act info lab like edu comms and tools for education communication and tools are like directory one hour",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6070.228,
    "end": 6093.317,
    "text": " lab meetings or group meetings because we're not doing the education work necessarily in that one hour but some groups sometimes it's possible to do some stuff but it's like increasingly moving towards sharing updates from people who want to commit in asynchronous work or smaller groups that want to commit to doing something like that so then",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6095.225,
    "end": 6100.334,
    "text": " educational related projects, that's their opportunity to ask for help, share updates, and so on.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6102.117,
    "end": 6105.643,
    "text": "But earlier on, there was more topical material",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6106.837,
    "end": 6121.741,
    "text": " But then through particularization and operations and other approaches, it becomes more like pragmatic and less discovery and less mixed media role specification, all these processes.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6122.281,
    "end": 6129.823,
    "text": "So people sticking around is sort of the, and being engaged and like seeing an affordance and then just making that contribution",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6130.771,
    "end": 6155.71,
    "text": " wanting to be a facilitator for a certain project or wanting to contribute actively or just even connect with another participant like you can email them if they've provided their information just some random things but like we want to have the applied angle the philosophical loop and how to even partition that discussion",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6158.243,
    "end": 6178.631,
    "text": " we couldn't just over go every math every philosophy every applied question and have the judge and the jury and all this apparatus so how can we scaffold that conversation around applied active inference for the people who are like super excited and motivated mike",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6181.38,
    "end": 6191.351,
    "text": " Yeah, I just wanted to add, there's an interesting duality related to what you just said in that we can't go into fine detail in all of the content.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6192.092,
    "end": 6199.36,
    "text": "And at the same time, I've found this group to be remarkable at unpacking things and sort of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6200.953,
    "end": 6208.558,
    "text": " really getting into what do we mean when we say that types of discussions and what does this term mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6208.598,
    "end": 6212.781,
    "text": "Not taking things for granted as going through the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6213.161,
    "end": 6230.073,
    "text": "And so there's a balance to be struck in taking that approach of asking what do we mean when we're talking about this and putting nouns on things and relating it to language and not going too far over into getting into fine detail about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6237.386,
    "end": 6238.167,
    "text": " Thank you, Lyle.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6239.248,
    "end": 6240.409,
    "text": "And then I'll leave it to your question.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6240.809,
    "end": 6243.731,
    "text": "Yeah, this has been personally a great session, really great conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6243.751,
    "end": 6244.372,
    "text": "I really enjoy it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6244.432,
    "end": 6245.533,
    "text": "This is new.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6245.693,
    "end": 6248.035,
    "text": "Much of this, most of this is new material for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6248.115,
    "end": 6266.55,
    "text": "And so I'm really enjoying the breadth of the conversation and I'm cognizant of this aspect you're digging into is, you know, how much do we sort of separate out the pieces and go deep dive in different places versus more of a, you know, touching on multiple threads and their interactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6267.415,
    "end": 6286.002,
    "text": " Uh, for me, while I understand there is a balance to be struck there, I'm really enjoying the challenge of relating as an example, the math to the philosophy, to all these different threads together because they are linked.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6286.343,
    "end": 6286.523,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6287.503,
    "end": 6294.546,
    "text": "And, and so I do understand that you can't, some of those, some of those areas",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6295.666,
    "end": 6323.601,
    "text": " need a separate group that you can drill down into for me personally and so this may be not the same as other people in the group i'm really enjoying understanding the connections the philosophy how these different thought processes came to be through history and get that depth of understanding thank you um lyle and for those who want to like listen or view these live streams have many many themes",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6324.608,
    "end": 6326.991,
    "text": " So check if there's papers that you're interested in here.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6328.292,
    "end": 6330.394,
    "text": "The live streams is about papers.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6331.395,
    "end": 6332.637,
    "text": "So there's 46 papers.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6333.798,
    "end": 6335.88,
    "text": "Guest streams are not driven by a paper.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6335.9,
    "end": 6339.003,
    "text": "Sometimes the person's sharing a paper, but these are like presentations.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6340.168,
    "end": 6341.329,
    "text": " hearing from different perspectives.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6341.389,
    "end": 6345.512,
    "text": "And if anybody wants to help organize these, that's what we do in comms.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6345.852,
    "end": 6359.361,
    "text": "If they want to facilitate and participate in these discussions, if they want to contact authors, recommend papers, these are all distributed tasks that are leverage points for people who care to just do a ton of amazing things.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6359.942,
    "end": 6366.406,
    "text": "Like if somebody's interested to connect it to a given community and make an artifact or a live stream, co-organize that.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6367.583,
    "end": 6391.714,
    "text": " we can catalyze it at the lab scale for individuals who know about the affordance but then want to take that affordance to just have really leveraged impacts in the active ecosystem so ali's question and then jessica sorry i don't have any questions",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6392.325,
    "end": 6404.604,
    "text": " asked about the timetable for the edu meetings like what specific times are they occurring at sure yeah exactly okay they are on mondays at 13 and 23 utc",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6408.561,
    "end": 6418.226,
    "text": " There's two EDU meetings to reflect like education being the primary mission of Act Inflab, and then that spreads them out by time zones.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6418.907,
    "end": 6426.371,
    "text": "But if somebody really wants to contribute to an area, the organizational unit meeting is not the rate limiting step.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6427.131,
    "end": 6453.778,
    "text": " anyone who has attention to contribute will be able to find a regime of attention that is like connected to a task that's meaningful the rate limiting step is not people's availability for a one hour meeting it's however much time people want to contribute whatever practices and things will find something that works for people who want to be engaged so don't take these meeting times as being like when we're doing it when we're deciding even",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6455.638,
    "end": 6463.057,
    "text": " Anybody who wants to can email or contact just the lab email address and be started on figuring that out.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6464.821,
    "end": 6465.182,
    "text": "Jessica?",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6468.526,
    "end": 6473.548,
    "text": " Yes, this was related to the question about applied projects.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6474.308,
    "end": 6485.071,
    "text": "I was thinking that maybe one thing that we could do is on the project ideas section to have a table where people can, like,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6485.791,
    "end": 6497.737,
    "text": " you know, briefly share what they want to do or like, you know, just say like, okay, I'm interested in machine learning and apply, you know, like active inference and maybe this specific topic.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6498.558,
    "end": 6503.36,
    "text": "Who will be interested in discussing this or exploring what to do?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6504.281,
    "end": 6508.383,
    "text": "And then like adding the names of the people who will be interested in that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6509.143,
    "end": 6513.906,
    "text": "And so the person who started the, you know, seeded the project, then they can be, you know,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6515.046,
    "end": 6521.87,
    "text": " can start maybe contacting those people and see what time they can meet and start creating their own subgroups.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6522.27,
    "end": 6527.593,
    "text": "So maybe that's something that we could do to facilitate that in a simple way.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6529.414,
    "end": 6535.598,
    "text": "Yeah, so just start saying, this is what I would like to do, apply active inference while also studying the course.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6536.872,
    "end": 6546.054,
    "text": " And you know, we like to connect with people here who might share the same interests on and, you know, see what kind of feedback on that person can get.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6547.854,
    "end": 6548.154,
    "text": "Thanks.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6549.174,
    "end": 6564.077,
    "text": "And just connecting and building trust and having like a buddy system or small groups or just people who are on the relatively long path to apply active inference on teams.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6565.745,
    "end": 6591.668,
    "text": " we don't have the speed dating hot swap active application protocol but connecting with people and then however it's authentic in that relationship seeing what you're interested in in three months will be in a pretty different situation but we still won't have even gone through the second half of the book",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6593.112,
    "end": 6595.853,
    "text": " on the application of the textbook.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6596.893,
    "end": 6604.115,
    "text": "So there's a lot of time for us to develop ideas and to connect with each other.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6604.135,
    "end": 6609.517,
    "text": "So thanks for sharing that a lot, Jessica.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6610.177,
    "end": 6620.88,
    "text": "And I tagged you so that we can create a table with the right way or do it however is the right way, because it helps enable connections for people who want to.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6622.148,
    "end": 6623.849,
    "text": " connect around applying.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6625.49,
    "end": 6640.939,
    "text": "And also it helps us remember these are the specific reference points in the text that are like our attractor regime of attention for this textbook group.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6641.52,
    "end": 6643.521,
    "text": "Like the textbook group isn't all of act and flap.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6643.581,
    "end": 6649.565,
    "text": "If people want to apply active inference, it doesn't have to be from the ground up, but it totally could be.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6650.498,
    "end": 6676.725,
    "text": " there's many ways to apply that are just in different codas that people get can get involved in immediately so if somebody feels like doing things i hope they feel like they have the agency to do that okay any final thoughts on this interesting semi-pattern breaking",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6678.979,
    "end": 6701.879,
    "text": " and also um yes one final thought for me is uh we would have had dot tools organizational unit meeting at this time which is why near the end like I asked if you wanted to do different scheduling because um in general it's probably not good practice or ways of working to like go over time",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6703.564,
    "end": 6706.105,
    "text": " to respect everyone's time and all of these types of things.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6706.905,
    "end": 6708.545,
    "text": "But also in the future, we're in Gather.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6709.085,
    "end": 6714.027,
    "text": "So people who want to keep discussing the textbook could go there into a different room.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6714.507,
    "end": 6717.687,
    "text": "People who want to do tools can go into another place.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6718.948,
    "end": 6729.89,
    "text": "So we need to figure out how to do that through the people who want to be there, like these people and the feedback that everybody has and the ways they want to co-create it.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6730.29,
    "end": 6732.331,
    "text": "Tim, and then anyone else who has like last thoughts.",
    "speaker": "SPEAKER_12"
  },
  {
    "start": 6733.24,
    "end": 6738.024,
    "text": " Hey, yeah, I was just going to say this is generally way more interesting than the tools meeting generally is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6738.124,
    "end": 6744.51,
    "text": "So this cross-pollination shows great potential already, I would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6744.53,
    "end": 6746.592,
    "text": "Yeah, sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6746.712,
    "end": 6760.884,
    "text": "I just wanted to add to that conversation, though, about someone even mentioned Plato and Socrates and all that, and that whole sort of recursive involution of the sort of that sort of reification thing you were talking about and sort of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6761.854,
    "end": 6772.139,
    "text": " the thought processes maybe being almost like a recapitulation of the, of the, of that, of the structure learning and that, and the correct Bayesian factor graphs and all that kind of thing you were talking about there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6772.799,
    "end": 6777.121,
    "text": "Plato had like a concept of knowledge, which, which he referred to as recollection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6778.442,
    "end": 6786.605,
    "text": "And, and this idea way, way back where all, all learning and knowledge is actually an act of recollecting what we already know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6787.325,
    "end": 6790.867,
    "text": "And I just wanted to point out, there's kind of a, maybe just more of a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6792.037,
    "end": 6813.339,
    "text": " interesting uh illusion or connection i guess between those two where there seems like a old new what's what's old is new again or what have you covered thanks tim anyone else who hasn't spoken or who would like to add anything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6831.402,
    "end": 6831.608,
    "text": " Okay."
  }
]