[
  {
    "start": 7.076,
    "end": 12.7,
    "text": " Hello and welcome everyone to the Active Inference Lab and to the Active Inference Livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.181,
    "end": 18.925,
    "text": "We're here in Active Inference Livestream 17.0 and it's March 3rd, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.866,
    "end": 24.069,
    "text": "I'm Daniel and I'm here with two of my colleagues who can introduce themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.961,
    "end": 28.301,
    "text": " Hi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.581,
    "end": 31.402,
    "text": "Are you going to go, Sarah?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.442,
    "end": 31.722,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.802,
    "end": 32.842,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.682,
    "end": 34.602,
    "text": "My name is Sarah Davis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.702,
    "end": 37.243,
    "text": "I'm a person who's interested in things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.403,
    "end": 46.945,
    "text": "I'm a student in Leibniz University in a master's program in philosophy of science, and I've been an engineer in a bunch of other things, so I'm just generally interested in how it's all connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.265,
    "end": 49.905,
    "text": "I'm Blue Knight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.965,
    "end": 52.966,
    "text": "I'm an independent research consultant based out of New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.326,
    "end": 54.606,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.127,
    "end": 58.269,
    "text": "Well, we're here for a fun discussion, so thanks both for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.05,
    "end": 65.395,
    "text": "At the Active Inference Lab, we're an experiment in online team communication, learning, and practice related to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.575,
    "end": 68.037,
    "text": "You can find us at our links and socials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.698,
    "end": 76.464,
    "text": "This is a recorded and an archived and a hastily produced livestream, so please provide us with feedback so that we can be improving on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.264,
    "end": 82.308,
    "text": "All perspectives and backgrounds are welcome here, and we'll follow good livestream etiquette.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.311,
    "end": 90.957,
    "text": " So here we are in paper number 17, and we've just completed our first quarterly Active Inference Lab roundtable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.058,
    "end": 93.419,
    "text": "So check that out on our channels if you haven't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.18,
    "end": 99.565,
    "text": "And today we're going to be setting the context for 17.1 and 17.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.445,
    "end": 108.932,
    "text": "The paper that we're discussing in 17 is Information Flow in Context-Dependent Hierarchical Bayesian Inference by Chris Fields and James F. Glazebrook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.775,
    "end": 110.936,
    "text": " It was published in October, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.317,
    "end": 117.462,
    "text": "And what's funny is that the dot zero videos have always been about context, setting context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.702,
    "end": 121.966,
    "text": "And we even wrote in the previous videos, the video's introduction and its context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.026,
    "end": 123.348,
    "text": "It's not a review of the final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.808,
    "end": 128.152,
    "text": "And then it got really meta with this paper because it's a paper about context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.153,
    "end": 148.844,
    "text": " The punchline or a punchline of this paper is that we can integrate various approaches from mathematics mostly to achieve a scale-free formulism that leads to an interpretation of nested systems where communicating systems are engaged in active inference and distinguished by informational or statistical patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.344,
    "end": 154.287,
    "text": "Or they're engaged in something that's related to active inference, let's say, because it's pretty out there with what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.55,
    "end": 158.412,
    "text": " And it's a challenging, but also a fun paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.053,
    "end": 163.416,
    "text": "So we're gonna start with the goals and the claims and the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.077,
    "end": 173.584,
    "text": "And at that point, it might be like, wait, what with the roadmap headers or with the abstract claims, it's like driving through a country where you don't speak the language perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.725,
    "end": 188.297,
    "text": " And that's okay because the bulk of this video in the keywords are going to be going through and kind of unpacking a lot of the key terms that are going to matter for even just understanding the lay of the land.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.057,
    "end": 191.099,
    "text": "And then we've pulled out a few other key topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.619,
    "end": 200.527,
    "text": "Some quotations didn't go as much into the formalisms of the paper itself, but we're looking forward to doing that with the authors in 17.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.048,
    "end": 203.209,
    "text": " And so we're just looking forward to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.97,
    "end": 207.453,
    "text": "In 17.1 and .2, we'll be discussing the same paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.994,
    "end": 213.62,
    "text": "So read it and save and submit your questions and get in touch if you want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.74,
    "end": 220.346,
    "text": "And also we're looking forward to your chats during this presentation, giving us a little support along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.128,
    "end": 232.769,
    "text": " here we go with the goals and claims of the paper under discussion so here are um the goals and the claims so maybe blue do you want to read the author's goals and claims",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.481,
    "end": 235.721,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.262,
    "end": 238.323,
    "text": "So the goals of the paper are twofold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 238.663,
    "end": 247.509,
    "text": "First, to model intrinsic or true contextuality using the general category theoretic methods of true spaces and channel theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.07,
    "end": 255.155,
    "text": "And second, to employ this formulation to reconstruct hierarchical Bayesian inference in a context-dependent way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.546,
    "end": 263.913,
    "text": " It goes on to say, here we have formulated an approach to intrinsic contextuality in general category theoretic terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.433,
    "end": 272.061,
    "text": "A set of observations exhibits intrinsic contextuality if no cocoon can be constructed over the observables that produce them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.502,
    "end": 279.807,
    "text": " Ooh, cone, co-cone, who knows how to say it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.507,
    "end": 283.59,
    "text": "So they're doing a couple of things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.87,
    "end": 286.973,
    "text": "They have two main goals, so it's great that they're laying it out clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.634,
    "end": 293.218,
    "text": "The first one is about context, and they want to be having a more advanced way to talk about context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.639,
    "end": 301.245,
    "text": "And it turns out that they're going to be doing that using category theory and two spaces and channel theory, all of which we're going to be going into at least a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.946,
    "end": 308.633,
    "text": " And then secondly, they're going to be linking all of this stuff that they just did up here with context, choose channel theory, category theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.153,
    "end": 313.277,
    "text": "And they're combining that with context-dependent Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.838,
    "end": 316.441,
    "text": "We've talked a lot about active inference and Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.961,
    "end": 322.226,
    "text": "So this is sort of the hinge where we connect some of these ideas to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.157,
    "end": 335.157,
    "text": " And then this is a quote from their conclusion, which is that they have formulated a new way of modeling contextuality in very general category theory terms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.779,
    "end": 347.983,
    "text": " specifically relating to this co-cone construction, but the category theoretic term allows them to move between a few different areas that we're going to be walking through today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.024,
    "end": 351.164,
    "text": "So here we go with the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.424,
    "end": 358.227,
    "text": "I'll read the first of the three slides of the abstract and anyone can give any thoughts or just start reading the second part of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.451,
    "end": 370.82,
    "text": " Recent theories developing broad notions of context and its effects on inference are becoming increasingly important in fields as diverse as cognitive psychology, information science, and quantum information theory and computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.761,
    "end": 381.569,
    "text": "Here we introduce a novel and general approach to the characterization of contextuality using the techniques of two spaces and channel theory viewed as general theories of information flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.45,
    "end": 386.113,
    "text": "This involves introducing three essential components into the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.219,
    "end": 389.761,
    "text": " Events, conditions and measurement systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.042,
    "end": 394.844,
    "text": "Any thoughts either of you two or someone can just start reading the second part of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.227,
    "end": 400.408,
    "text": "Let's go to the second part of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.428,
    "end": 404.291,
    "text": "I think we'll have a lot of time for off the cuff remarks soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.452,
    "end": 408.794,
    "text": "So Sarah, do you want to go for the second part of the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.075,
    "end": 410.295,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.505,
    "end": 419.129,
    "text": " Incorporating these factors in relationship to conditional probabilities leads to information flows both in the setting of two spaces and channel theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.809,
    "end": 427.292,
    "text": "The latter provides a representation of semantic content using local logistics from which conditionals can be derived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.933,
    "end": 437.357,
    "text": "We employ these features to construct cone-to-cone diagrams, commutativity of which enforces inferential coherence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.696,
    "end": 448.329,
    "text": " With these built, a scale-free architecture incorporating a Bayesian-like hierarchical structure in which there is an interpretation of active inference in Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.891,
    "end": 450.111,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.612,
    "end": 452.655,
    "text": "And then, Lou, how about finish out the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.095,
    "end": 460.879,
    "text": " We compare this architecture with other theories of contextuality, which we briefly review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.359,
    "end": 472.908,
    "text": "We also show that this development of ideas conveniently accommodates negative probabilities, leading to the notion of signed information flow and address how quantum contextuality can be interpreted within this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.529,
    "end": 484.117,
    "text": "Finally, we relate contextuality to the frame problem, another way of characterizing a fundamental limitation on the observational and inferential capabilities of finite agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.025,
    "end": 487.345,
    "text": " Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.905,
    "end": 489.886,
    "text": "So that is the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.926,
    "end": 497.51,
    "text": "That's how the authors wanted to present and communicate their work to a broad audience of specialists and non-specialists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.271,
    "end": 506.215,
    "text": "And again, we're going to be going into basically all the words that might be non-obvious in this abstract and the keywords that come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.395,
    "end": 508.176,
    "text": "That's what we wanted to be unpacking today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.016,
    "end": 528.192,
    "text": " So we're going to look over their roadmap because just like the abstract is how they want to communicate what they did, the roadmap is how they've chosen to organize what they've done and get us from A to Z. And then we're going to be really going into this road trip and unpacking what some of these key terms are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.093,
    "end": 532.334,
    "text": " It starts with an introduction, which I guess is helpful, context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.135,
    "end": 543.519,
    "text": "And then one of the focal ideas of the paper is this Chu space or the Chu construction, which we're going to be talking about the history of, some examples, some related topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.299,
    "end": 557.025,
    "text": "And just right off the bat, when we saw that the examples of Chu spaces and Chu morphisms included topological spaces, so that's all of network theory and graphs and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.805,
    "end": 558.945,
    "text": " So that's one big area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.266,
    "end": 575.491,
    "text": "But we're going to be talking about chew spaces as something that connects all of network theory and topological space to types as processes, probability spaces, Bayesian belief networks, event space structure, chew flows, Kolbach-Leibler divergence, and the free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.457,
    "end": 593.375,
    "text": " so we're going to be popping up a level from things that are already pretty abstract but it's going to be done in a way that's quite useful especially for formulating context and it's actually really interesting because a lot of times people will say that these topics in the examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.096,
    "end": 596.737,
    "text": " that they're general, but they actually don't have enough context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.077,
    "end": 603.899,
    "text": "For example, you can make a social network, but that wouldn't be the total context of the world if you only have some of the users on the social network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.359,
    "end": 612.201,
    "text": "So maybe there's a way where we're going to be able to step up from some of our previous conceptions and introduce context potentially by default.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.168,
    "end": 622.475,
    "text": " This leads the authors to a discussion of probability and how to use probabilistic models for contextuality, for modeling context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.255,
    "end": 631.341,
    "text": "And this comes to a recently derived framework called contextuality by default, which will be a topic we dive into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.441,
    "end": 648.916,
    "text": " Section four goes into some issues related to measurements and kind of the before, during, and after of measurements, because you gotta set things up and calibrate, and then you gotta make the measurements at a certain moment, and then you have to analyze it in the context of a certain system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.276,
    "end": 651.679,
    "text": "So it's like before, during, and after the measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.01,
    "end": 658.693,
    "text": " In section five, they head into channel theory and information channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.833,
    "end": 668.239,
    "text": "And this was really fascinating because it's quite distinct from Shannon information theory in some ways that people might not expect and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.179,
    "end": 693.978,
    "text": " i had never heard this discussed alongside shannon information theory it's like here's information theory and it's good at abc but it's not good in these three things that's where the discussion ended i didn't know that there was another area that kind of picked up where shannon left off in a sense and that's related to this idea of an infomorphism as well as classifiers conditional probabilities and this cocoon diagram",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.503,
    "end": 703.125,
    "text": " Thinking about information channels and flows of information leads to this formulation of context compliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.605,
    "end": 710.147,
    "text": "So context modeling or following hierarchical, multi-level, multi-scale Bayesian networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.068,
    "end": 711.848,
    "text": "And first,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.229,
    "end": 726.046,
    "text": " This section has a lot of technical detail, but it involves making a connection between Bayes networks approaches to probabilistic modeling and statistics and inference with context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.256,
    "end": 747.847,
    "text": " This leads to a sort of conclusion or a climax section where the hierarchical Bayesian networks that were just introduced in six are brought into the context of two specific practices, which is number one, the idea of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.967,
    "end": 750.169,
    "text": "I highlighted it because that's kind of our lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.189,
    "end": 751.689,
    "text": "That's what we're here to be thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.13,
    "end": 753.991,
    "text": "And then two was the frame problem,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.591,
    "end": 757.575,
    "text": " which is something that's also really interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.595,
    "end": 759.717,
    "text": "It's going to be the key motivator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.358,
    "end": 768.448,
    "text": "So although they put it last with active inference in the frame problem, we're actually going to have those topics closer to the front of the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.769,
    "end": 771.813,
    "text": "So people who are listening to this from the active inference perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.413,
    "end": 786.956,
    "text": " or from more generally the frame problem perspective, they're going to understand what motivated us to be studying the paper the way that we're doing it and hopefully what motivated Chris to select this paper when he suggested it to be discussed during his visit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.356,
    "end": 791.538,
    "text": " That's the sort of naked roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.698,
    "end": 794.16,
    "text": "That's the turn left at this part and turn right at this part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.76,
    "end": 800.704,
    "text": "But there was a narrative roadmap that the authors actually put out and their own words are on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.784,
    "end": 804.127,
    "text": "So you can see that in the paper or here, but on the left,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.727,
    "end": 819.1,
    "text": " I just thought of this is like the semantic roadmap as far as the flow of the paper, and I just extracted this semantic flow from the syntax that they wrote, not super knowing what all these topics are, but just rephrasing what they had put.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.041,
    "end": 825.767,
    "text": "Previously, these authors had been researching quantum and thermodynamics of separable systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.031,
    "end": 833.794,
    "text": " In this paper, they started with a recap of chew spaces and chew morphisms, which suggests that it's a foundational topic for the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.555,
    "end": 840.197,
    "text": "They then reviewed contextuality paradigms and the diversity of approaches that model contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.058,
    "end": 855.125,
    "text": "They then took a formal diversion into various ideas of probability theory above my detailed understanding, but they took an extension in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.933,
    "end": 860.315,
    "text": " They then turned to the semantically richer methods of channel theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.135,
    "end": 870.3,
    "text": "And they're using channel theory as an even more general approach to inference rather than the syntactic information theory like Shannon information theory, which we'll get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.78,
    "end": 871.801,
    "text": "They wanted something a little bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.801,
    "end": 876.543,
    "text": "Thinking about these kinds of local logics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.169,
    "end": 883.35,
    "text": " of information channels leads to some new ways that they also combined ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.47,
    "end": 897.033,
    "text": "And then they visualize this slash represent it as this cone-cocone diagram, as they say, as a natural scale-free representation of Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.533,
    "end": 901.194,
    "text": "So scale-free just means that it doesn't have an a priori scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.554,
    "end": 904.174,
    "text": "It's not in inches or in kilometers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.354,
    "end": 906.595,
    "text": "It's just at the level of abstractness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.839,
    "end": 922.164,
    "text": " And then they have the claim that is proven that the failure of the CCCD, the cone-co-cone diagram, to diagrammatically commute is a condition of the measurement operator's non-code deployability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.924,
    "end": 928.289,
    "text": " So it's just sort of like, if you have two shapes and then they fit together, what they represent fits together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.309,
    "end": 938.98,
    "text": "And if you have two shapes and the puzzle pieces don't fit together, something mathematical that the shapes represent isn't fitting together in the way that it would as if these two shapes fit together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.62,
    "end": 945.826,
    "text": "I don't know what non-codeployability is, but it's like a puzzle piece if it were codeployable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.667,
    "end": 966.599,
    "text": " and then the part that i think will be of special interest to a lot of our lab and colleagues is they're going to recover this new theoretical and inferential role for the markov blanket it's the locus at which free energy is minimized part one and part two the epistemic barrier that keeps contextual information hidden from the observer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.239,
    "end": 975.045,
    "text": " So when I saw that, I was like, whoa, it sounds fascinating because it's two distinct and critical roles of a blanket construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.445,
    "end": 987.695,
    "text": "And then I thought, so contextual information is hidden from the observer because a lot of times we might think about context as being like what's around us, but we'll see if that's actually the way that context is being used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.717,
    "end": 991.098,
    "text": "Can I jump in for a second, Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.278,
    "end": 991.378,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.569,
    "end": 1004.935,
    "text": " So I think that the way that I understood code deployability, like measurement operator code deployability, like you can't at the same time measure position and velocity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.055,
    "end": 1006.936,
    "text": "That was like one example that they gave in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.077,
    "end": 1012.259,
    "text": "So like, because those two things, like you can't, if you're moving, you're not at a stable position, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1012.339,
    "end": 1015.361,
    "text": "So it's those two measurements are not code deployable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1015.421,
    "end": 1017.842,
    "text": "You can't measure those two things at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.862,
    "end": 1021.404,
    "text": "And that's kind of what they meant, like about measurement code deployability, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.735,
    "end": 1025.037,
    "text": " Cool, thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.2,
    "end": 1032.326,
    "text": "Here's to why it matters before we even jump into the keywords, which will be the bulk of our journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.448,
    "end": 1035.11,
    "text": "And this is quotes from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.033,
    "end": 1040.277,
    "text": "While the results presented here are primarily technical, so just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.178,
    "end": 1046.22,
    "text": " Take a breath if it's worrying you because they wrote the paper so we don't have to, and it's a technical paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.4,
    "end": 1049.342,
    "text": "And that's what we're learning by doing and exploring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.062,
    "end": 1053.804,
    "text": "The paper is technical and abstract, but now we're looking for where we can go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.844,
    "end": 1057.045,
    "text": "It's like a car is technical, but it lets you get somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.226,
    "end": 1059.287,
    "text": "So where are we going and why will it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.586,
    "end": 1067.393,
    "text": " These results open a path to application in a number of areas where contextuality has largely been neglected, but is important in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.013,
    "end": 1073.779,
    "text": "That sounds really important because it sounds like there's systems that are unknown unknowns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.819,
    "end": 1084.209,
    "text": "We don't even know what to model, but there might be a large category of systems where we think we've modeled it well, but then there's this problem where context keeps on entering the picture or something that we didn't model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.83,
    "end": 1087.892,
    "text": " throws our local model off that we spent time and energy on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.952,
    "end": 1094.877,
    "text": "So if we could find a way to respectfully interface with contextuality across different areas, that would be really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.917,
    "end": 1096.118,
    "text": "Well, what are those areas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.039,
    "end": 1102.963,
    "text": "One of the models that they're interested in, just like Friston and a lot of active inference researchers, is neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.684,
    "end": 1110.389,
    "text": "And so they suggest that the current approach they're taking takes a previous model, which is the global neuronal workspace model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.149,
    "end": 1117.815,
    "text": " And that's actually related to what Ryan Smith and Christopher White will be talking to us about in number 18.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.816,
    "end": 1128.324,
    "text": "They're going to make that model contextuality compliant and provide the building blocks needed to incorporate context switching and attention switching into global neuronal workspace models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.804,
    "end": 1134.81,
    "text": "So it's kind of these two cool parts of the brain, which is that it can spiral in and really hone in with attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.814,
    "end": 1138.576,
    "text": " But then it can also move attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.257,
    "end": 1141.819,
    "text": "So it's like side to side and in and out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.42,
    "end": 1150.246,
    "text": "And that sort of context and attention switching is not dealt with well by our current models, which might be about attention or inattention to a stimulus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.887,
    "end": 1154.29,
    "text": "But they're not actually modeling what the regime of attention is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.016,
    "end": 1168.668,
    "text": " Another, then there's a formal result, which might matter to some people or others, that contextuality can always be associated with this sort of dawn communitivity, kind of related to the puzzle pieces, the context we just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.815,
    "end": 1172.336,
    "text": " And then this is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.796,
    "end": 1188.621,
    "text": "From a more probability theoretic point of view, our results further support the authors of the contextuality by default in showing that the distinction between quantum and classical probabilities lies not in any ontological difference, but rather in what has been explicitly labeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.241,
    "end": 1200.264,
    "text": " So this was really mind bending because a lot of times it's like quantum, you know, theory of small things where there's an observer that has an effect in the outcomes of how the system is modeled or set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.164,
    "end": 1208.346,
    "text": "And then the sort of disinfo debate is like, who's an observer or does it matter if it's a conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.386,
    "end": 1211.527,
    "text": "You're going to go down a rabbit hole because there aren't simple answers there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.067,
    "end": 1213.968,
    "text": "But the system of the particle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.628,
    "end": 1221.676,
    "text": " it turns out depends on how you structure the context of the experiment, just as is the case for macroscopic entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.657,
    "end": 1227.482,
    "text": "So these were some questions that... So in other words, is there a continuum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.798,
    "end": 1238.086,
    "text": " of tiny things and bigger things with context as being what is distinguishing the behavior that can seem quite different across scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.626,
    "end": 1245.512,
    "text": "So it's not that electrons are magical and they can do wave particle, but nothing else exists in a similar regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.172,
    "end": 1255.18,
    "text": "It's not that we're going to get the same diffraction of people walking through a doorway, but then again, maybe if it's set up the right way, there's more similarity than not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.553,
    "end": 1266.87,
    "text": " So a few opening questions before we jump into the keywords, just how will we connect across formal and informal or just plain different senses of the word context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.938,
    "end": 1277.246,
    "text": " And then what are some of these cases where, whether they said it in the paper or not, where contextuality has been largely neglected, but it's important in practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.266,
    "end": 1286.073,
    "text": "So even within an informal context definition, what's in an area where potentially context is not taken into account?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.493,
    "end": 1289.215,
    "text": "So I'll start with one, and then either of you could go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.956,
    "end": 1291.737,
    "text": "Maybe cultural context or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.638,
    "end": 1317.013,
    "text": " um for understanding geopolitics or individual context for an individual relationship so it does matter but when we approach those sort of individual or collective level problems as if we can ignore context again just using it informally we're not really operating in the space that the system is in we're operating in a reduced or a distorted model that we're projecting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.826,
    "end": 1328.168,
    "text": " Hey, Daniel, I don't know if this is going to mess up your video setup, but if you're able to go into present mode on your slides, it would make the whole thing a lot more readable for a small screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.929,
    "end": 1336.83,
    "text": "In the live stream, which you can look at and mute in the background, it looks different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.39,
    "end": 1339.631,
    "text": "But yeah, we've got a lot of small text on these slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.515,
    "end": 1341.755,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.175,
    "end": 1346.377,
    "text": "It's, I don't know, it's so worth unpacking that last bullet point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.557,
    "end": 1348.337,
    "text": "It's, there's just a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.477,
    "end": 1367.543,
    "text": "Is how, so are you reading, when I read this, you know, that he's saying ontological difference versus what's explicitly labeled, I immediately just think, well, of course, because you're, you know, you're either looking at small scale or you're looking at macro scale, but you think he's saying something, something a little more subtle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.563,
    "end": 1367.863,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.882,
    "end": 1392.491,
    "text": " I would love to have a quantum expert, but just speaking with our friend Jason Larkin, he has often pointed to these sorts of almost like classical meets quantum crossover situations where you get the classical quote behavior from when you define the full system with the quantum observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.371,
    "end": 1417.558,
    "text": " then it behaves let's just use the twin slit for example the system behaves a certain way when you define it a certain way with the observer in the picture but when you don't define the observer you're just talking about a different system and so that might not be something that only electrons exhibit it might be a feature of certainty and uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.605,
    "end": 1420.486,
    "text": " in measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.067,
    "end": 1423.169,
    "text": "And that would be various kinds of measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.309,
    "end": 1428.113,
    "text": "It wouldn't have to be just things that were smaller than a molecule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.735,
    "end": 1430.015,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.676,
    "end": 1431.417,
    "text": "That's how you're reading it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.437,
    "end": 1432.137,
    "text": "Yeah, that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.779,
    "end": 1437.903,
    "text": "But that's my non-technical physics for biologists take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.323,
    "end": 1438.543,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1439.344,
    "end": 1440.085,
    "text": "Any thoughts on this, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.125,
    "end": 1440.906,
    "text": "Or we can go to the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.825,
    "end": 1444.187,
    "text": " So I do have a little bit of thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.367,
    "end": 1449.771,
    "text": "And so it's tied into the quantum, but it's also tied into back in theorem 7.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.891,
    "end": 1460.258,
    "text": "So you had skipped over this word that I think is kind of critical and important in the previous bullet point that says our main form of result theorem 7.1 shows that intrinsic contextuality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.618,
    "end": 1463.202,
    "text": " can always be associated with non-commutativity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.622,
    "end": 1469.711,
    "text": "So like in that non-commutative, that means like you can't construct the big cacone diagram, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1469.751,
    "end": 1471.234,
    "text": "Like when it's not, when it doesn't commute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.814,
    "end": 1476.281,
    "text": "So I think that it's important to highlight that that kind of contextuality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1477.422,
    "end": 1501.836,
    "text": " is like you know where they were describing the context like for something that's beautiful like you know a beautiful what right like a beautiful leaf is not the same as a beautiful person if that leaf looked like a person it'd be a really ugly leaf or if a person looked like leaf it'd be a really ugly person right like so so beautiful it's always like that context dependent a beautiful what like beautiful does not always have the same referential um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.977,
    "end": 1509.527,
    "text": " And so I think that this is really important and ties right into the quantum aspect of things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.567,
    "end": 1514.415,
    "text": "Like how they were talking about the Alice and Bob with the machine, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.435,
    "end": 1515.897,
    "text": "Like, so it's always...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.259,
    "end": 1521.543,
    "text": " You know, when you can measure, like it's always what is explicit context, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.583,
    "end": 1524.785,
    "text": "So the quantum is tied into explicit context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.845,
    "end": 1535.154,
    "text": "Like when we have a set of variables that we measure for every circumstance at precisely the same exact time and under precisely the same conditions, that is extrinsic context, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.194,
    "end": 1538.257,
    "text": "And it's different and separate from intrinsic contextuality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.737,
    "end": 1539.678,
    "text": "Sorry, I just wanted to point that out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.489,
    "end": 1544.15,
    "text": " You might be saying something that I'm, yeah, it's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.21,
    "end": 1544.53,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.77,
    "end": 1557.774,
    "text": "It's, um, you might be saying something that, that, that I'm already about to say and, um, but in, or maybe just triggered my thought, but yeah, this intrinsic versus extrinsic, the way, what it made me think of was that, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.231,
    "end": 1561.813,
    "text": " You know, one thing is quantifiable and the other thing isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.974,
    "end": 1564.316,
    "text": "It's like a gradient, but that's essentially what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.356,
    "end": 1564.556,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.736,
    "end": 1564.936,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.597,
    "end": 1565.957,
    "text": "It's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.017,
    "end": 1566.337,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.198,
    "end": 1567.438,
    "text": "Fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.159,
    "end": 1570.601,
    "text": "Well, let's get to the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.721,
    "end": 1575.866,
    "text": "This was definitely one of our, you know, even though you look at the keywords, you think, oh, it's the ABCs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.206,
    "end": 1577.287,
    "text": "I mean, how hard is it going to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.527,
    "end": 1582.712,
    "text": "No, it was really fun and a good learning experience for all of us to go through these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.632,
    "end": 1586.034,
    "text": "And it includes active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.068,
    "end": 1593.491,
    "text": " And then Bayesian inference, which are things that we've definitely talked about before, as well as Markov blankets a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.211,
    "end": 1601.494,
    "text": "However, the other words were basically all just even new to learning about, not just in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.614,
    "end": 1604.135,
    "text": "So that's where we kind of started this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.155,
    "end": 1610.357,
    "text": "And that's why we want to just include people in the conversation and just see where everyone is at in learning these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.817,
    "end": 1611.638,
    "text": "So contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.518,
    "end": 1628.059,
    "text": " choose space channel theory information flow local logic cone co-cone diagram frame problem and then it wasn't a keyword but it's kind of related is concurrency and concurrent um processes and i just always want why is the second c capitalized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.335,
    "end": 1646.223,
    "text": " Let's motivate the paper, not with what shoe spaces are, which is how the paper begins if you were to read it, but let's kind of motivate it with the problems and the context that we're looking to be applying in, which is the frame problem and active inference and thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.043,
    "end": 1649.947,
    "text": " something that most of us are more familiar with, which is Bayesian computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.409,
    "end": 1659.979,
    "text": "The frame problem is the problem of, using their words, the problem of circumscribing what does not change when an action is performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.78,
    "end": 1665.106,
    "text": "Viewed broadly, it's the problem of circumscribing what is relevant in a situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.626,
    "end": 1689.898,
    "text": " it's kind of like if you want to say well what are all the connections in the social network it's the shadow of what are all the non-connections because those two answers are arrived at at the same time and if you have no false positives and no false negatives it's the same to know what has changed versus what hasn't changed so when we're thinking about scenarios those two are equivalent um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.024,
    "end": 1701.952,
    "text": " Instead of just reading this for a first pass, what did either of you, how would you summarize the frame problem or what is something that makes it valuable or important for study?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.274,
    "end": 1708.596,
    "text": "Okay, think about it and then raise your hand while I go through these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.822,
    "end": 1721.895,
    "text": " The issue with the frame problem and the reason why people are working on better solutions is that let's say we want to understand what does or doesn't change when an action is performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.996,
    "end": 1727.162,
    "text": "So we're making a self-driving car and we want to understand how something changes or not when the scene changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.266,
    "end": 1737.97,
    "text": " In order to look for all the changes, AKA what hasn't changed, it's really hard to know when to stop or what has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.431,
    "end": 1743.053,
    "text": "There's just an exponentially large number of things to check and you can't brute force it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.693,
    "end": 1745.394,
    "text": "So there are heuristic solutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.454,
    "end": 1748.596,
    "text": "So solutions that aren't exact, but get you on the right track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.738,
    "end": 1757.361,
    "text": " However, the heuristic solutions, which often work extremely well, like frame differencing, like if something doesn't move between two slides, you just cancel it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.501,
    "end": 1759.662,
    "text": "And if it does move, you're gonna do some other algorithm on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.582,
    "end": 1764.043,
    "text": "It's a good heuristic, but it assumes a coherent context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.444,
    "end": 1770.086,
    "text": "It assumes that what is observed could in principle be expanded to include all that there is to be observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.206,
    "end": 1777.989,
    "text": "So if it's a image and it's a 64 by 64 image, and I do frame differencing, and we're only studying the image, then I have captured everything that's changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.669,
    "end": 1784.194,
    "text": " But when there are systems with intrinsic contextuality, this coherence assumption is violated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.874,
    "end": 1787.397,
    "text": "If there is intrinsic contextuality, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.437,
    "end": 1794.303,
    "text": "some of the observables are non-code deployable, the current context cannot even in principle be expanded to include everything that's observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.563,
    "end": 1798.006,
    "text": "So, Blue, what do you think about that or the frame problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.575,
    "end": 1808.662,
    "text": " So one thing that I thought was cool about the frame problem is that they had this corollary 8.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1808.802,
    "end": 1821.032,
    "text": "I don't know if you have this up there, but when they're discussing the frame problems, it says a distributed information flow system can be informationally unencapsulated only in absence of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.372,
    "end": 1847.87,
    "text": " intrinsic contextuality but so so what that really meant to me it was they said again they reiterated practically that this means that proving the absence of contextuality in a domain requires discovering all of the information that is relevant to solving problems in that in that domain so the frame problem can only be solved if it has already been solved like it's like having ground truth data like if you're trying to predict something like you can only predict",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.332,
    "end": 1852.193,
    "text": " from or by.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1852.213,
    "end": 1855.016,
    "text": "Do you need me to repeat that, Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1855.116,
    "end": 1855.196,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.519,
    "end": 1860.941,
    "text": " Super interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.061,
    "end": 1861.722,
    "text": "Has it been solved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.802,
    "end": 1866.305,
    "text": "It has been solved in the past, present, or the future, and we're just figuring it out again or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.365,
    "end": 1867.326,
    "text": "Or what does it mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.706,
    "end": 1867.866,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.886,
    "end": 1871.849,
    "text": "So it's essentially like you can't go forward solving it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.909,
    "end": 1877.654,
    "text": "And I know we're going to get into the computing analogy later on in the paper, The Reservoir of Computing, but it goes into that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.934,
    "end": 1881.397,
    "text": "Without ground truth data, your neural network is useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.417,
    "end": 1881.977,
    "text": "You can't",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.018,
    "end": 1906.02,
    "text": " predict the future based on something that if you don't have the the context for it right and not this intrinsic contextuality but you have to have like like a real contextuality like know all the variables that are important for the for the problem um anyway sorry that's that's my thoughts on the frame problem cool and at the bottom here um how would domain specific or general solutions or simply better heuristics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.883,
    "end": 1936.229,
    "text": " lead to real world implications well we can probably think of a lot of software and hardware and hybrid systems that need to ask themselves what is relevant in a situation so that's going to be a recommendation engine a self-driving car whatever it is we want to be modeling relevant aspects of a sim of a situation so that is the big and it also has implications that each person is going to have their own take so you know put it in live chat or the comment but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.256,
    "end": 1938.278,
    "text": " it's a cool topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.878,
    "end": 1940.761,
    "text": "Of course, there's going to be new places of bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.821,
    "end": 1941.983,
    "text": "That'll be kind of interesting too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.745,
    "end": 1943.965,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.226,
    "end": 1945.728,
    "text": "Any other thoughts on frame problem, Sarah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.649,
    "end": 1948.231,
    "text": "No, that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.271,
    "end": 1950.394,
    "text": "So Bayesian inference is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.368,
    "end": 1955.129,
    "text": " Another big topic, but we can start it with a fun little meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.409,
    "end": 1960.01,
    "text": "So on the top right, it says, OK, gang, let's see what deep learning really is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.09,
    "end": 1961.531,
    "text": "And this is like Scooby Dooby Doo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.051,
    "end": 1962.711,
    "text": "Where are you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.511,
    "end": 1964.131,
    "text": "Meme genre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.891,
    "end": 1967.452,
    "text": "And so we're going to find out what deep learning is at the end of the episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.672,
    "end": 1968.792,
    "text": "We unmask the villain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.212,
    "end": 1970.153,
    "text": "Oh, it's Rev Baze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.933,
    "end": 1979.315,
    "text": "So this is sort of hinting at the idea that Bayesian inference or Bayesian thinking, Bayesian statistics is underlying what deep learning is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.475,
    "end": 1982.117,
    "text": " What is Bayesian inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.658,
    "end": 1984.32,
    "text": "So there's two ways we're gonna show it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.48,
    "end": 1996.335,
    "text": "There's the equation in its sort of most simple form on the top left, and then a more colorful unpacked version that's made a little bit closer to natural language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.276,
    "end": 2016.162,
    "text": " there's equations and then also we can look at it in a graphical way and what the equation as well as the graphical representation are getting at is the idea that there's a prior which means before and so there's a prior expectation and it is some type of distribution it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.142,
    "end": 2019.443,
    "text": " tight or wide, it could be different types of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.823,
    "end": 2022.024,
    "text": "And there's no uninformative prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.644,
    "end": 2027.245,
    "text": "Even if it's flat, like I'm not sure if it could be 0% or 100% chance or it's all equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.626,
    "end": 2029.246,
    "text": "That's not the same thing as unbiased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.346,
    "end": 2041.79,
    "text": "So this really gives a better lens to talk about bias and implicit or explicit bias because we can actually talk about priors being updated rather than who is or isn't coming to the table with no prior expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.33,
    "end": 2043.191,
    "text": "That person doesn't exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.158,
    "end": 2051.62,
    "text": " priors are transformed through measurement into posterior estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.38,
    "end": 2068.064,
    "text": "And so it's like reality is providing stimuli and then the prior gets dragged along either a little bit if the learning rate is low or a lot if it's going to be an overwhelmingly powerful stimuli, it gets pulled a little bit or a lot to the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.004,
    "end": 2072.545,
    "text": "And what else would you say about that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.029,
    "end": 2078.55,
    "text": " Um, nothing else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.651,
    "end": 2081.833,
    "text": "I mean, I think that that's, that's the, the deal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.634,
    "end": 2085.096,
    "text": "Um, we pretty well described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.136,
    "end": 2085.897,
    "text": "What about you, Sarah?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.218,
    "end": 2090.0,
    "text": "I mean, the only thing I thought about, it's a little vague.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.341,
    "end": 2096.906,
    "text": "Um, I mean, I was just looking at, um, some YouTubes on, uh, Koopman embedding and model discovery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.707,
    "end": 2104.553,
    "text": "And, and when I see these Bayes diagrams, I'm often like, oh, okay, well they have some data where they presuppose, you know, what,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.961,
    "end": 2106.583,
    "text": " what is connected to what prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.783,
    "end": 2112.628,
    "text": "And with this other method that I was looking at, it seems like that's not the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.849,
    "end": 2116.472,
    "text": "They just feed it into this gigantic structured AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.433,
    "end": 2120.436,
    "text": "But so I'm just thinking about Bayesian inference in a lot of different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.21,
    "end": 2130.441,
    "text": " Cool, and we can also ground Bayesian inference in a history and a developmental trajectory of statistics, which is to say, more memes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.222,
    "end": 2132.704,
    "text": "So first, here's just one quick meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.044,
    "end": 2136.268,
    "text": "Here's Bayes saying, I thought the volume of a high-dimensional hypersphere",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.253,
    "end": 2138.674,
    "text": " would be evenly distributed throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.655,
    "end": 2140.396,
    "text": "Just funny stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.736,
    "end": 2141.357,
    "text": "Truly funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.097,
    "end": 2143.579,
    "text": "And then... Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.839,
    "end": 2151.766,
    "text": "And on the right side is a SMBC comic just joking about how when data comes in, your model's updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.006,
    "end": 2154.489,
    "text": "But that doesn't mean it's going to be an adaptive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.109,
    "end": 2159.013,
    "text": " So there's a lot of ways to go about integrating new data into priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.574,
    "end": 2165.32,
    "text": "You could have fallacious priors, you could fallaciously update, you could make the wrong measurement, you could interpret the measurement wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.641,
    "end": 2170.186,
    "text": "So saying we did it Bayesian is like saying, you know, I built the car out of metal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.386,
    "end": 2171.347,
    "text": "It's like, what else do you want to know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.567,
    "end": 2172.088,
    "text": "Does it work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.168,
    "end": 2172.648,
    "text": "Is it safe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.889,
    "end": 2174.891,
    "text": "So we can't let the buzzwords",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.092,
    "end": 2179.039,
    "text": " confuse us, we just want to follow up with what the buzzwords are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.74,
    "end": 2185.273,
    "text": "And here in the sort of stereotypical human evolution meme,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.479,
    "end": 2195.908,
    "text": " There's, and with a little extra labeling, there's a progression from the, and theta here is the model parameters or just the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.028,
    "end": 2198.09,
    "text": "And then X is like the data or the observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.571,
    "end": 2203.515,
    "text": "So the a priori, homo a prioris, just is walking around with a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.776,
    "end": 2204.576,
    "text": "Here's how the world is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.618,
    "end": 2206.118,
    "text": "What data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.578,
    "end": 2207.579,
    "text": "Just, it's the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.76,
    "end": 2208.44,
    "text": "This is what's likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.471,
    "end": 2215.2,
    "text": " Homo pragmaticus is sort of, again, it's not an actual evolutionary or creationist parallel, it's just a meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.101,
    "end": 2218.464,
    "text": "The data is the only thing that's considered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.685,
    "end": 2219.346,
    "text": "What's the data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.566,
    "end": 2220.307,
    "text": "Show me the facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.507,
    "end": 2221.249,
    "text": "Facts don't lie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.829,
    "end": 2222.991,
    "text": "Facts don't care about your feelings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.171,
    "end": 2223.852,
    "text": "It's just the facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.893,
    "end": 2224.734,
    "text": "It's not even about the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.675,
    "end": 2228.616,
    "text": " And then we get to Homo, the frequentist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.376,
    "end": 2236.178,
    "text": "So the frequentist is asking the statistical question, what is the likelihood of the data given the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.738,
    "end": 2250.882,
    "text": "So what, for example, a p-value is coming from like a t-test is like, what is the likelihood of this height data given the model that the two classrooms don't have different heights?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.752,
    "end": 2254.955,
    "text": " And so you can say that's 0.01 p-value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.335,
    "end": 2259.578,
    "text": "So there's such and such likelihood for this data under that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.618,
    "end": 2261.22,
    "text": "So we can reject that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.04,
    "end": 2273.93,
    "text": "And then that's all this whole point with the rejection of null models and H naught versus H1 and rejecting things and the whole idea of falsification at the statistical level, but also at the philosophy of science level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.35,
    "end": 2277.933,
    "text": "Oh, one beautiful piece of data could ruin the theory and you just can disprove it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.153,
    "end": 2279.574,
    "text": "It's this whole idea of disproving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.654,
    "end": 2281.116,
    "text": "You have the model in the background,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.696,
    "end": 2285.059,
    "text": " explicitly or implicitly, and then new data comes in, you go, is this likely or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.5,
    "end": 2289.443,
    "text": "And then if it's unlikely, you think that it casts doubt on your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.045,
    "end": 2302.215,
    "text": "Homo sapiens here is thinking about the likelihood or modeling both the data and the model, but then the sort of advanced or at least farthest right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.163,
    "end": 2309.886,
    "text": " is thinking about the likelihood of the model given the data, which actually is what we want to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.906,
    "end": 2314.829,
    "text": "We don't need to know the likelihood of all board positions and all possible chess strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.949,
    "end": 2320.473,
    "text": "We want to know the likelihood of certain things happening given what we're observing, which can often be quite limited or confusing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.073,
    "end": 2323.074,
    "text": "So not to overanalyze mean, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.775,
    "end": 2323.955,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.733,
    "end": 2326.614,
    "text": " So wait, I want to interject really quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.814,
    "end": 2334.318,
    "text": "So we were talking earlier about frequentist and Bayesian statistics prior to pushing the broadcast button on the live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.398,
    "end": 2337.439,
    "text": "And, you know, I was thinking about the movie 50 First Dates, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.479,
    "end": 2342.362,
    "text": "Like, I don't know if you guys have seen the movie, but she wakes up every day and can't remember anything except like before her car accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.662,
    "end": 2343.542,
    "text": "So the model's there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2343.862,
    "end": 2345.063,
    "text": "It's existing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.183,
    "end": 2349.285,
    "text": "It's like she has the model, but just the model never updates, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.645,
    "end": 2354.046,
    "text": " So every day, like, you know, it's, it's, you just go based on the model, but then there's no, there's no update.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.066,
    "end": 2359.347,
    "text": "And so like, you know, the Bayesian would be like, if every day you updated the model while you're sleeping at night.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.387,
    "end": 2365.529,
    "text": "And I think like, you know, that's a huge, like, like lead in to the Bayesian brain, like framework, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2365.589,
    "end": 2367.269,
    "text": "Is that like what we're doing while we're sleeping?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2367.309,
    "end": 2367.589,
    "text": "Really?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2367.609,
    "end": 2369.13,
    "text": "Are we updating our model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.47,
    "end": 2372.831,
    "text": "Like, is this why we need less sleep as we get older and we get stuck in a decade?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.871,
    "end": 2378.232,
    "text": "Like, you know, you're stuck in your favorite decade because you're not updating your model as much or as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.571,
    "end": 2384.396,
    "text": " I don't remember the movie too well, but didn't the other character have memory across the dates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.576,
    "end": 2386.118,
    "text": "So it's almost like an alternative title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.178,
    "end": 2389.702,
    "text": "It could have been, you know, when a frequentist and a Bayesian date 50 times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.857,
    "end": 2395.0,
    "text": " That one definitely got left on the clipping room floor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.821,
    "end": 2406.83,
    "text": "So Bayesian networks are taking this Bayesian inference idea and putting it in a graphical or a topological framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.331,
    "end": 2410.654,
    "text": "So it's representing variables in the nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.974,
    "end": 2414.897,
    "text": "There's other graphical models, but just for the ones we're showing here, the nodes are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.618,
    "end": 2442.721,
    "text": " random variables and then conditional dependencies are shown with arrows or with edges so this is like a very general one on the left it's like a is just having a conditional dependency with b and it's directed in this case this one right here is actually a bayesian network called a neural network this is a single layer neural network where one input kind of unfolds to all these hidden layers just one here and then it goes to an output layer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.342,
    "end": 2446.084,
    "text": " but this is the structure of neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.244,
    "end": 2450.528,
    "text": "So everything that we're talking about, like neural networks, all kinds of deep learning are encapsulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.048,
    "end": 2454.431,
    "text": "And then on the top right from Parr et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.451,
    "end": 2456.833,
    "text": "2018 is the example of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.453,
    "end": 2472.085,
    "text": "And so here is the progression that we walked through in our model stream, but the simplest Bayesian network that we can imagine between a hidden state and an observable is you have S, the hidden state, and then there's some sort of P, which is the probability of an observation given the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.745,
    "end": 2474.046,
    "text": " of O, the observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.406,
    "end": 2476.728,
    "text": "So that's like hidden state, and then you're getting observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.288,
    "end": 2479.35,
    "text": "And then you're trying to model the hidden state given the observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.03,
    "end": 2482.272,
    "text": "In B, that same process happens through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.752,
    "end": 2486.195,
    "text": "A changing hidden state is emitting observables at different time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.655,
    "end": 2488.396,
    "text": "Still a Bayesian graphical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.477,
    "end": 2492.799,
    "text": "C introduces control theory with pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.079,
    "end": 2502.226,
    "text": "That's why our lab logo is a little pi, because it's action playing into the way that states are modeled to evolve through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.635,
    "end": 2518.916,
    "text": " d takes another level of complexity and allows actually policy so still we see this motif with pi influencing how s 1 2 and 3 change but at each time point let's take this one down into s1 at each time point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.597,
    "end": 2524.583,
    "text": " it's being evaluated how a policy is going to play out at S1, 2, and 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.404,
    "end": 2530.23,
    "text": "And notice that at 1, 2, and 3, there's an inference on 1, 2, and 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.811,
    "end": 2532.854,
    "text": "And so I'll re-enable my camera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.874,
    "end": 2533.194,
    "text": "Don't worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.638,
    "end": 2539.34,
    "text": " the trajectory of action is what is being estimated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.08,
    "end": 2545.885,
    "text": "So it's not just doing state estimation at each of these time points, it's estimating a trajectory of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.945,
    "end": 2551.589,
    "text": "And this idea of action trajectories is gonna come back into play in a kind of interesting way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.827,
    "end": 2562.271,
    "text": " Let's just take one more second more generally to think about active inference and what it is, why we're here, where the Markov blanket is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.911,
    "end": 2565.393,
    "text": "In active inference, we have internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.733,
    "end": 2569.935,
    "text": "And it's a scale-free framework because these internal states could be small or large in scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.215,
    "end": 2573.517,
    "text": "It's outside the level of specifying a specific scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.598,
    "end": 2577.8,
    "text": "And these internal and external states are separated by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.789,
    "end": 2579.129,
    "text": " a blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.029,
    "end": 2591.193,
    "text": "And as we're going to show in just a second, this Markov blanket concept is just the total layer of insulating nodes such that the internal and the external states have a certain type of independence relationship from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.993,
    "end": 2594.914,
    "text": "And then the innovation, we'll get to where it first came into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.214,
    "end": 2606.357,
    "text": "So that's active inference just as a way to integrate action and perception with sensations influencing internal states, internal states including generative model estimates of the world and policy estimations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.037,
    "end": 2615.705,
    "text": " implements action, and action can influence external states, which also is undergoing its own dynamics, which we might think of as actually contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.467,
    "end": 2618.528,
    "text": "Any other thoughts on active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.548,
    "end": 2624.494,
    "text": "Okay, so here's where we go from Bayes networks to Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.014,
    "end": 2625.575,
    "text": "This was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.165,
    "end": 2629.386,
    "text": " part of our discussion on Act 14.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.327,
    "end": 2635.53,
    "text": "And the idea of making a Markov blanket was introduced by Pearl 1988.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.471,
    "end": 2648.438,
    "text": "And where Friston's innovation occurred, and this is, I think, from Mel Andrews' paper in 14, is that Pearl's original construction of the Markov blanket was subdivided into two kinds of nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.341,
    "end": 2668.507,
    "text": " sensory states, nodes whose influence is directed towards the blanketed node under interest X, and active states, which are nodes influenced by X. So we can have an organismal metaphor with sense and action, but a little bit more generally, sense is like incoming of the system and action is outgoing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.267,
    "end": 2676.59,
    "text": "And the Markov blanket is the total set of all the ones that totally give you all the inputs and all the outputs of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.802,
    "end": 2688.867,
    "text": " So stating the conditional dependencies is the same thing as stating all the conditional independencies, just like we're showing where the social network, who's friends with who is the same question as who's not friends with who.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.548,
    "end": 2691.509,
    "text": "Who is there is the same question as who is not there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.649,
    "end": 2705.255,
    "text": "And then to put Markov, Perl, and Friston on a continuum, you have Markovian properties by Andrei Markov and other Markovs actually, who are working in a more mathematical frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.515,
    "end": 2706.596,
    "text": "They don't have access to computers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.639,
    "end": 2714.164,
    "text": " Perl brings in Bayesian statistics as well as computational approaches in the second half of the 1900s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.845,
    "end": 2734.682,
    "text": "And then the innovations of Friston were to divide those Markov nodes, the Markov blanket nodes, into sense and action nodes, which enables this cybernetic approach to input a generative model, internal states, and then outgoing action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.774,
    "end": 2738.436,
    "text": " in service of maintaining a non-equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.297,
    "end": 2760.552,
    "text": "And then though it's an ongoing and open and developing area with how we formalize these things, the idea is that by this kind of partition of the blanket happening, we'll be able to have modeling of non-local dependencies like latent causes, which are not observed in the world and therefore have cybernetic agents in niches that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.252,
    "end": 2765.733,
    "text": " enacting and embodied and encultured in a really rich way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.333,
    "end": 2780.975,
    "text": "And then just to show one more figure, this is from Wanja's paper with Carl Fristen, which we talked about just a few weeks ago, and just showing that you have internal states that influence active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.696,
    "end": 2784.296,
    "text": "Then there's a line with external, and so here's the blanket here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.796,
    "end": 2788.357,
    "text": "In the pink dashed line is the blanket states, and then there's the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.237,
    "end": 2789.457,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.27,
    "end": 2792.651,
    "text": " Any thoughts on active inference, or can we go to context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.931,
    "end": 2804.894,
    "text": "So again, putting the sort of end parts of the paper up closer to the beginning, the context in practice, the first context introduced is the idea of active inference in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.834,
    "end": 2815.937,
    "text": "And the motivation for active inference here, and we can definitely talk to the authors more, is that observers are constantly probing their environments through action influenced by hidden states and time-sensitive policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.96,
    "end": 2830.45,
    "text": " So these are some of the challenges that beset context agnostic or unspecified context modeling is when the environment is changing, how does the action policy update?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.87,
    "end": 2836.255,
    "text": "Does it just reevaluate at every single moment as if it was like fresh looking at a new environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.275,
    "end": 2843.9,
    "text": "But how do you have these sequences of action that might involve sequential modifications of the environment and uncertainty in the action policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.921,
    "end": 2850.004,
    "text": " And the big question, just like kindergarten, is what actions are appropriate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.785,
    "end": 2855.267,
    "text": "What actions will reveal aspects of the environment important for defining and reasoning within a context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.287,
    "end": 2856.428,
    "text": "That's the frame problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.948,
    "end": 2859.35,
    "text": "What actions will reveal that a context has changed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.393,
    "end": 2863.336,
    "text": " So we wanna know which of the three cups the ball is under.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.356,
    "end": 2874.689,
    "text": "And so there's like this complex thing that's happening as we guide our action by changing the context to resolve our uncertainty about actions, which we can then get more information on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.181,
    "end": 2892.203,
    "text": " And active inference tells us that there's two ways to minimize expected free energy, which is that we can modify internal state parameters of our generative model through learning and development, or external states can be modified through action or their own endogenous changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.904,
    "end": 2898.325,
    "text": " So active inference, we're kind of going even more abstract than some of the other papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.445,
    "end": 2913.988,
    "text": "And just thinking about this question of if you're an agent who's operating under uncertainty, modifying the niche, but you don't know whether you should modify or explore or wait, and all these things are coming together, we want to set a frame that's big enough to encompass that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.148,
    "end": 2916.029,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.049,
    "end": 2917.889,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.646,
    "end": 2921.268,
    "text": " Let's turn to context more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.628,
    "end": 2923.029,
    "text": "So that was active inference in context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.469,
    "end": 2938.979,
    "text": "They write, contextuality in the behavior of complex systems has traditionally been regarded as a practical problem of limited experimental control that could in principle be eliminated by obtaining more uniform experimental subjects and achieving better control of experimental conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.76,
    "end": 2945.203,
    "text": "This traditional view of contextuality as merely a practical limitation is however increasingly under strain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.184,
    "end": 2963.304,
    "text": " This kind of resonated with me as an experimentalist because in biology, you'd get the sense like, well, if it was a clonal animal and we just had the light-dark cycle the same and the same animal handler picked it up and there was no pipetting error and everything was the same, you'd get the same result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.265,
    "end": 2974.113,
    "text": " And it was really exciting to think about to what extent is that like a faith-based position and actually tiny amplifications in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.153,
    "end": 2985.161,
    "text": "You have two clonal animals, but if there's like a bifurcation point, then unless you truly have every single part of the system, you're always going to be subject to these intrinsic contextualities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.109,
    "end": 2987.349,
    "text": " So that's kind of cool to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.909,
    "end": 2995.931,
    "text": "And then here in the conclusion, context is often used to designate what is neglected when an observation is made or an action undertaken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.252,
    "end": 2997.692,
    "text": "Environment is used in a similar way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.972,
    "end": 3000.573,
    "text": "So that's how maybe informally people think about context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.593,
    "end": 3005.974,
    "text": "Like right now, one of my contexts is like this cup of water, it's in my environment, it's in my niche, it's in my local area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.014,
    "end": 3009.515,
    "text": "Like their context is used like that, like what is around something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.3,
    "end": 3019.482,
    "text": " And the formalism of a theory like context by default challenges us to acknowledge that context is always there, whether attended to or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.243,
    "end": 3028.225,
    "text": "So we're thinking about context in sort of a more active way in terms of what influences processes or where conditional dependencies are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.945,
    "end": 3033.288,
    "text": " And so it might be the case that you can ignore context because you've actually isolated the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.348,
    "end": 3036.451,
    "text": "So it's like a closed system or it's a system where you can fully describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.111,
    "end": 3043.936,
    "text": "And in those situations, context is there, but you've made a special sub problem where you have all the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.536,
    "end": 3048.68,
    "text": "But when you're in a situation where you don't have all the context, we need to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.5,
    "end": 3056.506,
    "text": " a framework for reasoning that has contextuality by default so that we can work better in those spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.567,
    "end": 3062.772,
    "text": "And let's talk a little bit more about this contextuality by default, CBD, not that CBD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.995,
    "end": 3072.941,
    "text": "This is the authors talking about contextuality by default and just totally, you know, raise your hand or jump in if you have a thought or a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.982,
    "end": 3076.124,
    "text": "And they say that the term...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.547,
    "end": 3088.337,
    "text": " Determining whether a particular instance of observed behavior of a complex system, particularly one with memory, exhibits intrinsic contextuality is not straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.502,
    "end": 3091.903,
    "text": " So that was interesting, makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.163,
    "end": 3097.565,
    "text": "Complex systems, hard to know what to do sometimes, whether you want to include memory and historicity or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.485,
    "end": 3106.868,
    "text": "And in some ways, like if you have like 10 different animals and you think, okay, well, they're the same background, so we can just consider them even, but they've actually had this history that differs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.388,
    "end": 3114.21,
    "text": "So they're not the same, but you want to imagine that they're replaceable or shuffleable in a statistical sense, but that might not be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.251,
    "end": 3118.212,
    "text": "And then here's the quantum sense of contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.662,
    "end": 3128.444,
    "text": " In quantum systems, a set of measurements exhibits contextuality if it cannot be characterized by mathematically consistent context-free joint probability distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.864,
    "end": 3140.727,
    "text": "Asking whether a set of measurement outcomes exhibits intrinsic contextuality is, in this case, asking whether a consistent, globally defined, globally connectable joint probability distribution exists or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.887,
    "end": 3145.748,
    "text": "And that's where this formulism of contextuality by default",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.781,
    "end": 3173.995,
    "text": " addresses questions by labeling context and includes them explicitly in conditional probabilities rendering probability distributions context dependent so let's look at the papers that were cited and referenced and think a little bit about where is this contextuality theory coming from where is it taking us what do you think i have a comment um that that brought to my mind um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.123,
    "end": 3202.237,
    "text": " emotion related to context because I've been thinking a lot about how like if I'm attached to some idea or something like that and then and I just remember that I was attached to it but then I go to sleep and whatever and then I forget what it was I have a tendency to like really be like no that was really important and so regardless of whether it was true or not I want to go back to it and so there's I'm thinking about the way in which emotion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.964,
    "end": 3206.607,
    "text": " is a kind of a context, but it takes you over a longer time domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.627,
    "end": 3213.853,
    "text": "Because it doesn't even just sit in a decay rate that would normally be related to the other information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.913,
    "end": 3216.295,
    "text": "It pulls you way back into another space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.335,
    "end": 3219.198,
    "text": "So it's this kind of long range driver.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.218,
    "end": 3220.159,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.219,
    "end": 3221.5,
    "text": "That's just context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.336,
    "end": 3223.576,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.276,
    "end": 3235.899,
    "text": "And it brings us to this next question, which is, is there, this is the title of a paper that's cited by Desafrov, 2016, is there contextuality in behavioral and social systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.479,
    "end": 3244.561,
    "text": "So if we were dealing with this informal definition of context is just like the environment, it's like, yes, the answer is just yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.141,
    "end": 3247.622,
    "text": "Behavioral and social systems, yes, there's social context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.642,
    "end": 3249.562,
    "text": "Like, oh, you missed the context on this dinner party.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.842,
    "end": 3251.843,
    "text": "Okay, so off the bat, we'll say yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.543,
    "end": 3255.107,
    "text": " but we're thinking about it formally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.788,
    "end": 3260.475,
    "text": "And this is the most hyphenated sentence I've just ever seen in science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.138,
    "end": 3267.226,
    "text": "So just the number of names, it was quite something to read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.06,
    "end": 3276.843,
    "text": " But we're thinking about contextuality in a more formal way, which is like, so let's say someone says, you're missing the dinner party context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.703,
    "end": 3282.004,
    "text": "And then it's like, well, if you would have told me all the info, then I would have had all the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.245,
    "end": 3289.067,
    "text": "So then that would make it, that's, it's a similar notion, but we're going for measurement systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.516,
    "end": 3306.064,
    "text": " And they're proposing that their CBD allows one to define and measure contextuality in all systems of all these hyphenated types, even if there are context-dependent errors in measurement, or if something in the context directly interacts with the measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.484,
    "end": 3309.625,
    "text": "These are the two cases that really matter a lot for scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.685,
    "end": 3316.849,
    "text": "Like what if at higher temperatures, your thermometer's biased towards overestimating or being more error-prone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.711,
    "end": 3323.216,
    "text": " Then you're going to get this distribution that looks like it has some sort of super specific relationship, but it's totally not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.256,
    "end": 3324.958,
    "text": "It's all an observation error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.518,
    "end": 3331.584,
    "text": "And the second one is that the context could directly interact with the measurement, aka every single time you want to know something new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.345,
    "end": 3342.514,
    "text": "So the context, which you don't have because you don't have the full context, because you're going out into the unknown to make a measurement, is going to interact with your measurement, maybe even modify it itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.954,
    "end": 3343.515,
    "text": "What do you think, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.678,
    "end": 3352.342,
    "text": " So I think this goes back to that intrinsic versus extrinsic context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3352.722,
    "end": 3357.504,
    "text": "In a social and behavioral system, there's no extrinsic concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3358.825,
    "end": 3360.326,
    "text": "There's no extrinsic context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.886,
    "end": 3366.331,
    "text": " Every like thing that you're going to try to measure if you ask like, what was the temperature at that dinner party?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3366.612,
    "end": 3367.513,
    "text": "Or how was the food?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3367.853,
    "end": 3375.08,
    "text": "You can ask like, you know, 12 different people and they're all going to have different things to say or like, did you have fun or whatever?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.14,
    "end": 3384.869,
    "text": "Like, I mean, everyone you ask because it's only defined by the intrinsic contextuality, which is the experience of each agent in the room, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.596,
    "end": 3386.876,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.717,
    "end": 3390.419,
    "text": "And interestingly, they look at several data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.299,
    "end": 3393.781,
    "text": "None of the data provide evidence for contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.981,
    "end": 3397.043,
    "text": "So again, don't just, yes, there's a niche, there's a context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.083,
    "end": 3405.589,
    "text": "We know what social context is, but we're actually thinking about it in this very interesting way where those data sets don't have contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.089,
    "end": 3413.575,
    "text": "So a good little gut check is if you're thinking about the applications of this paper and you're thinking about it like social context, it's just not that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3414.355,
    "end": 3430.695,
    "text": " because um it's not and their rule is that behavioral and social systems are non-contextual again if that makes you cringe it's because you're thinking about it informally and we're actually thinking about it in a way where that claim makes sense that's where we want to understand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.576,
    "end": 3451.538,
    "text": " to be like oh right informally we get where they're saying it but then we're interpreting their claims rigorously i.e all contextual effects in these contexts in these settings result from the ubiquitous dependence of response distributions on elements of context other than the ones to which the response is presumably or normatively directed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.259,
    "end": 3457.32,
    "text": " So let's say you have a driving simulation and then there's going to be some green lights and some big red stop signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.88,
    "end": 3464.281,
    "text": "And you do the behavioral measurements and you find out that conditioned on whether it was a green light or a stop sign, the people accelerate or brake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.801,
    "end": 3472.262,
    "text": "So that's your experimental data, what you controlled and what you observed was stoplight and then whether they stayed still or accelerated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.843,
    "end": 3475.603,
    "text": "Now that is context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.223,
    "end": 3478.283,
    "text": "It is context for the person who's driving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.583,
    "end": 3479.944,
    "text": "That's the social sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.524,
    "end": 3480.744,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.744,
    "end": 3501.307,
    "text": " all the contextual effects in this experiment result from the ubiquitous dependence so across the whole population of response distributions on elements of context other than the ones to which the response is presumably or normatively directed so it's like you thought you were measuring the response to a green light or a stop sign actually you're measuring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.108,
    "end": 3509.773,
    "text": " a social context and a group of people who were in a relation with those symbols such that they operated in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.273,
    "end": 3517.577,
    "text": "So we need contextuality by default so that we don't fall into like correlation causation, super fallacious scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.398,
    "end": 3521.9,
    "text": "Here's another case of where context matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.92,
    "end": 3526.483,
    "text": "And what's going to be fun is actually this decision making is going to matter for context and ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.203,
    "end": 3528.464,
    "text": "Here's a paper by Valev.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.702,
    "end": 3534.505,
    "text": " Local choices, rationality, and the contextuality of decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.685,
    "end": 3536.067,
    "text": "So every decision has a context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.247,
    "end": 3537.528,
    "text": "So we know about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.581,
    "end": 3548.486,
    "text": " However, rational explanation appears to be challenged by apparently systematic irrationality observed in psychological experiments, especially in the field of judgment and decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.866,
    "end": 3564.075,
    "text": "So how many times have we heard, oh, people are so irrational, they'll take the $1 today rather than the $1.20 tomorrow, or they'll pick up their children from the daycare at the right time unless there's a monetary penalty, and then that will make them later, they're so irrational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.015,
    "end": 3568.82,
    "text": " within this one variable that's being estimated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3569.941,
    "end": 3578.312,
    "text": "Here, it's proposed that the experimental results require not that rational explanation should be rejected, but that rational explanation is local, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.352,
    "end": 3579.193,
    "text": "within a context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.794,
    "end": 3583.699,
    "text": "Thus, rational models need to be supplemented with a theory of contextual shifts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.963,
    "end": 3586.163,
    "text": " makes a lot of sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.464,
    "end": 3589.384,
    "text": "It sounds like something that's relevant to learn about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.404,
    "end": 3605.608,
    "text": "And this paper has probably other relevant things, but it's like, instead of just saying, well, who's rational and who's irrational, couldn't we just understand that everyone is in a local logic and a local context, and then they're operating a certain way conditioned on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.148,
    "end": 3608.349,
    "text": "And so it's not a rational versus irrational divide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.369,
    "end": 3610.009,
    "text": "It's like, what's the context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.089,
    "end": 3610.949,
    "text": "Who's the agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.249,
    "end": 3611.99,
    "text": "What's the niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.35,
    "end": 3613.79,
    "text": "What's the context shift?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.154,
    "end": 3621.257,
    "text": " So that's a much more open, but also powerful way, I think, to talk about decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.277,
    "end": 3624.878,
    "text": "Okay, you should raise your hand if you wanna pause it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.478,
    "end": 3627.479,
    "text": "Let's take this idea of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.499,
    "end": 3635.342,
    "text": "So we started with context in the sort of folk sense and took it to this idea of defining all the relevant variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.942,
    "end": 3639.004,
    "text": "Now let's think about defining relevant variables in a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.106,
    "end": 3641.127,
    "text": " in terms of topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.648,
    "end": 3644.152,
    "text": "So here's some cool slides from the Simmons Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.033,
    "end": 3652.963,
    "text": "And in this top right one, it says topology is about distinguishing the continuous from the non-continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.264,
    "end": 3655.804,
    "text": " and also about moving around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.625,
    "end": 3664.006,
    "text": "So I was like, that's a cool definition of topology, not nodes and edges, not how things are connected, but it's a way, it's saying how things are connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.726,
    "end": 3666.187,
    "text": "And this slide was really informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.867,
    "end": 3671.028,
    "text": "When we're asking several questions at once, the answers could obey constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.368,
    "end": 3675.669,
    "text": "So like if you're gonna measure the pressure and the volume and the temperature of an ideal gas,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.752,
    "end": 3680.375,
    "text": " there's an equation PV equals NRT that's going to relate those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.475,
    "end": 3684.379,
    "text": "And if one of them is out of whack, like probably something is wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.22,
    "end": 3699.052,
    "text": "So those bundles of answers are related to each other, could be by the laws of physics, like here's velocity and time or whatever it happens to be, like physical constraints or logical constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.733,
    "end": 3705.378,
    "text": " So like if things are true, then if they're false, if they're not that, and then if it's double not that, it's back to being true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3705.799,
    "end": 3712.285,
    "text": "So you can have these bundles that are logical or a bundle that is based upon some of the constraints of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.7,
    "end": 3716.902,
    "text": " And then also the constraints can be rows of a table in a relational database.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.383,
    "end": 3728.01,
    "text": "That's the trip because that's where like SQL and a lot of programming comes into play and models distinguish good and bad ways of connecting the dots and bundles, just like continuous sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.791,
    "end": 3735.516,
    "text": "So this is kind of like thinking about SQL queries and database queries in terms of the context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.543,
    "end": 3738.583,
    "text": " that's being concerned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.903,
    "end": 3743.264,
    "text": "So in the context of this database, I want to make a query within it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.245,
    "end": 3748.765,
    "text": "So that's an interesting way to think about how things are connected and context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.805,
    "end": 3757.267,
    "text": "But this is also stuff that we're all just trying to put out there and hear people's reflections and thoughts on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.287,
    "end": 3757.947,
    "text": "What do you think, Sarah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.408,
    "end": 3761.848,
    "text": "I just wanted to restate it to make sure I understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.068,
    "end": 3765.429,
    "text": "I mean, basically, they're saying that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.616,
    "end": 3770.517,
    "text": " the way you move through context creates the topology space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.838,
    "end": 3773.938,
    "text": "Is that an accurate way to phrase it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.74,
    "end": 3784.801,
    "text": "Just another aspect of it, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.922,
    "end": 3792.724,
    "text": "In the space of making multiple measurements, those measurements can have different topologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.764,
    "end": 3794.364,
    "text": "If you make three measurements, they could be in a line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.785,
    "end": 3795.705,
    "text": "They could be in a triangle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.67,
    "end": 3806.835,
    "text": " Like, that's not at the formality that's on here, but when you're making different measurements, they can either be in a well-behaved bundle or a not well-behaved bundle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.915,
    "end": 3810.737,
    "text": "And then whether it's well-behaved or not is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.726,
    "end": 3815.807,
    "text": " related to whether it blew, what do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.148,
    "end": 3819.449,
    "text": "It's a hard question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.989,
    "end": 3820.81,
    "text": "I'll jump in for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3821.99,
    "end": 3836.898,
    "text": "So, so, um, going back to like the intrinsic and extrinsic, um, contextuality, like, so it's contextual, it's contextuality when you have like a set of measurements that, you know, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3839.053,
    "end": 3862.161,
    "text": " are corresponding measurements right like so i mean it's like um i don't know do you have bio background sarah like like i'll i'll talk about it just in terms of like you know rna sequencing right like you can sequence your sample in a different lane on the same flow cell or in two different flow cells and there's variability right so you always have to try to like design controls into your experiment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.501,
    "end": 3882.591,
    "text": " from flow cell to flow cell from lane to lane and so that's why you replicate the sample sequencing just to kind of control that that variation in just running it at a different time the temperature in the room might be different or you know the machine might not be feeling as well that day or or whatever so so it's these kinds of are the measurements are they all like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3883.652,
    "end": 3885.192,
    "text": " do they all link up together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3885.453,
    "end": 3888.594,
    "text": "Like, is there like a correlation between all of the measurements or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3889.014,
    "end": 3891.855,
    "text": "So that's the well-behaved bundle is when they do all link up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3892.195,
    "end": 3895.136,
    "text": "They have that shared information, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.296,
    "end": 3899.177,
    "text": "So I think as we get into the paper, maybe it might start to make more sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3899.557,
    "end": 3899.917,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.925,
    "end": 3902.646,
    "text": " Let's go to channel theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.966,
    "end": 3905.807,
    "text": "Okay, so this part was super fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.587,
    "end": 3917.452,
    "text": "And I'm drawing a little bit on one of the background papers, Mosaic of Two Spaces in Channel Theory 1 by Fields and Glazebrook, which we're going to talk more about the two mosaic papers soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.052,
    "end": 3924.379,
    "text": " but let's contextualize this in terms of information theory, so-called info theory, but I personally call it disinfo theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.16,
    "end": 3927.702,
    "text": "And I've called it that for a long time, and now I know why actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.163,
    "end": 3931.486,
    "text": "So here's the second paragraph of Claude Shannon's 1948 work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.443,
    "end": 3943.474,
    "text": " Shannon writes, the fundamental problem of communication is that of reproducing at one point either exactly or approximately a message selected at another point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.075,
    "end": 3946.478,
    "text": "Wait, is that the problem of communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.139,
    "end": 3950.142,
    "text": "Am I trying to reconstruct something bit for bit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.683,
    "end": 3959.167,
    "text": " via communication or is the goal of communication to impel joint action, to update other agents, not to replicate a message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.607,
    "end": 3962.168,
    "text": "Shannon's working with telegraphs and copper wire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.508,
    "end": 3968.871,
    "text": "So it makes sense why you want high fidelity data transmission, a signal of transportation of information, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.671,
    "end": 3987.723,
    "text": " let's think about how broad people have gone with info theory according to shannon and then he writes frequently the messages have meanings they refer to or are correlated according to some system with certain physical or conceptual entities these semantic aspects of communications are irrelevant to the engineering problem oh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.809,
    "end": 3993.152,
    "text": " Semantics are irrelevant to communicating information semantically for people or for what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.132,
    "end": 3998.655,
    "text": "The significant aspect is that the actual message is one selected from a set of all possible messages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.115,
    "end": 4005.139,
    "text": "The system must be designed to operate for each possible selection, not just the one which will actually be chosen since this is unknown at the time of design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.859,
    "end": 4006.64,
    "text": " So fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.98,
    "end": 4012.484,
    "text": "A through Z, you want to have all of those options because you don't know what next letter needs to be poked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.144,
    "end": 4026.735,
    "text": "But I think if people read through Shannon's work and considered a few of the aspects of the Shannon entropy, like how it disorders messages, like it just asks what's the symbol frequency of the whole message or page or genome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.295,
    "end": 4040.282,
    "text": " If you think about how it removes the ordering of symbols and is actually asking about replicating bit for bit messages, not communicating in any sense, people would really consider what information theory is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.923,
    "end": 4042.784,
    "text": "Thankfully, in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.431,
    "end": 4051.992,
    "text": " Fields and Glazebrook wrote about comparing, and this was cited in the 2020 paper, comparing and combining the Shannon theory of information with channel theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.573,
    "end": 4052.853,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.653,
    "end": 4062.234,
    "text": "So, though very general as a quantitative theory of communication flow, the original Shannon theory had largely overlooked the question of semantic content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.134,
    "end": 4068.455,
    "text": "In any Dretsky type theory, the basis of semantic content is in the world, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.495,
    "end": 4071.256,
    "text": "the events or situations that signals or states carry information about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.742,
    "end": 4092.568,
    "text": " the car you know it's out there it's in the world by showing how local logics are connected by information networks channel theory provides a generative general qualitative theory of information flow in this context so that's pretty interesting it's more about information flow that's semantic rather than syntactic and then this last part here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.965,
    "end": 4109.609,
    "text": " Um, this is, there's more to say here, but all in 2004, create a synthesis of Shannon's quantitative information theory with the bar wise Seligman qualitative theory to address how the question of how specific objects, situations and events carry information about each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.37,
    "end": 4129.175,
    "text": " that's what people are always talking about when they want to be talking about sharing information not sharing surprising symbols but updating each other semantically informationally in the terms of bayesian priors about the world things that we're referencing in the world the temperature not just as a variable but like as about something in the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.995,
    "end": 4132.237,
    "text": " So some thought questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.797,
    "end": 4140.743,
    "text": "Is Shannon 1948 correct about the stance taken on the fundamental issues of communication or what communication is or isn't?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.623,
    "end": 4144.045,
    "text": "How is channel theory distinct from information theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.465,
    "end": 4146.687,
    "text": "So called disinfo theory, we can start calling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.167,
    "end": 4152.19,
    "text": "And then how is real communication the kind that we care about and want to model in many cases?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.691,
    "end": 4154.912,
    "text": "How is it both syntactic and semantic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.072,
    "end": 4155.813,
    "text": "All these things at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.313,
    "end": 4157.914,
    "text": "Grammatical, logical,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.991,
    "end": 4187.198,
    "text": " well as lexical word based it's also narrative driven a narrative or the narrative context can make just one word semantically powerful speak now or forever hold your peace it's a narrative context where one word cannot be reduced to just the bits or something like that oh well but no is a common word or yes is a common word it doesn't matter that it's a common token because it's semantic information and then how is it contextual blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.529,
    "end": 4196.311,
    "text": " I like Shannon information theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4196.391,
    "end": 4201.853,
    "text": "I like how it's very logical and it appeals to my brain structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4201.873,
    "end": 4208.776,
    "text": "The semantic information that's contained in this channel theory description is very squishy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.592,
    "end": 4216.18,
    "text": " Not as appealing to me, but I do think that it's more correct, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.2,
    "end": 4220.83,
    "text": "Like, when you say... When you reproduce the information, like, if I say...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.493,
    "end": 4225.555,
    "text": " something like, oh, it's raining outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4225.575,
    "end": 4226.496,
    "text": "I live in the desert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4226.596,
    "end": 4230.638,
    "text": "So, like, it's raining outside is, like, a really awesome, like, event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4230.678,
    "end": 4232.039,
    "text": "Like, let's go play in the rain, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.379,
    "end": 4236.222,
    "text": "So when I say that and someone else says, oh, it's raining outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.682,
    "end": 4242.246,
    "text": "Like, oh, my plans are, you know, destroyed because I wanted to go to the park and I can't because it's raining outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4242.546,
    "end": 4250.572,
    "text": "So it's two, it's the same information, but, like, the way that I said it was very different in those different contexts, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.672,
    "end": 4250.812,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4252.039,
    "end": 4257.963,
    "text": " Cool, let's return the discussion from information flows and communicating information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.083,
    "end": 4264.226,
    "text": "And we're kind of thinking Shannon syntax information, reproducing bits, bits on this computer to bits here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.246,
    "end": 4268.509,
    "text": "We're gonna take it up a level to semantic information and then semantic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.829,
    "end": 4271.09,
    "text": "So like I'm thinking of a purple cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.651,
    "end": 4274.893,
    "text": "Now you're thinking of a purple cat, but that could have been in a different language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.993,
    "end": 4277.754,
    "text": "And it's not really related to how surprising each word is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.795,
    "end": 4281.838,
    "text": " Let's return to this question of local logic and contextuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.519,
    "end": 4290.748,
    "text": "So here's a paper, not sure if it was cited or not, but it's going to bring together local logics, contextuality, and topological approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.208,
    "end": 4293.691,
    "text": "So we're just going to kind of give multiple coats of paint on everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.391,
    "end": 4298.255,
    "text": "Local logic is like the local rules or the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.278,
    "end": 4312.085,
    "text": " And in this Kishida 2016 paper, they wrote, the topological approach characterizes contextuality as global inconsistency coupled with local consistency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.825,
    "end": 4314.006,
    "text": "So that was kind of cool to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.046,
    "end": 4318.408,
    "text": "It's like if you have this field and it's globally consistent, then it's like transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.448,
    "end": 4320.569,
    "text": "There's nothing inconsistent to speak of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.609,
    "end": 4322.25,
    "text": "There's no fracture in the glass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.831,
    "end": 4324.492,
    "text": "So it just is purely transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.212,
    "end": 4325.332,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.481,
    "end": 4345.469,
    "text": " that's just the same it's part of the same context but local consistency coupled to global inconsistency is like a bubble it's like it's an inconsistency in the tank of water but then locally it has another transparency that makes sense in that local context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.405,
    "end": 4354.813,
    "text": " And so you could have like a computer program and then that could be a local logic, but it's embedded in another logic of being a Turing complete or whatever kind of computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.173,
    "end": 4361.318,
    "text": "And then within that program, there could be like a simulation of another program of an N64 running another program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.779,
    "end": 4367.644,
    "text": "And even if it's all the way back up at the top, it's running on Linux, but that local program is running on the N64s",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.341,
    "end": 4369.882,
    "text": " local logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.703,
    "end": 4379.576,
    "text": "And then another kind of metaphor in the paper, they write, our goal is to capture this local consistency part, not just the global inconsistency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.596,
    "end": 4385.244,
    "text": "So the global inconsistency is like our receptor is not getting any photons, boom, it got a photon, inconsistency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.945,
    "end": 4389.209,
    "text": " So not just that part, but the local consistency part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.849,
    "end": 4393.093,
    "text": "So how do we know that it was consistent before that photon hit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.493,
    "end": 4397.498,
    "text": "Which requires a novel approach to logic, sensitive to the topology of contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.038,
    "end": 4403.645,
    "text": "To achieve this, we formulate a logic of local inference by using context-sensitive theories and models in regular categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.724,
    "end": 4405.745,
    "text": " And that's going to be powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.146,
    "end": 4407.988,
    "text": "Here's how I was thinking about this in terms of chess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.608,
    "end": 4414.595,
    "text": "So the rules of the game of chess are like which piece can move which way and then some of the imperatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.695,
    "end": 4418.94,
    "text": "Like you have to alleviate check, otherwise you lose the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.761,
    "end": 4422.004,
    "text": "That's the context, the local rules of the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4423.208,
    "end": 4452.169,
    "text": " then there are local or situational patterns like a pin where one piece is like in front of the king and it can't move out of the way because then the king would go into check so that's not a rule of chess but it's an emergent pattern that arises from constraints in the space given the local logic of chess but now we're in this even sub-local logic i'm not going hyper formal maybe chess players have another way of doing this but it's like there's a local logic in the corner of the board with a king",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.07,
    "end": 4481.726,
    "text": " and not every piece or rule of chess like okay well the pawn can move two or one but that rule might not matter for this pin with these pieces and so not every single rule or piece is going to matter for these local logics and maybe there's a way to pursue this topologically in terms of the connectedness of different relationships of the system let's take that to choose spaces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.924,
    "end": 4486.307,
    "text": " Okay, so this one was, you know, it's the second section of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.347,
    "end": 4490.249,
    "text": "So it's like, okay, you've got to understand and learn this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.349,
    "end": 4491.951,
    "text": "So we were kind of excited to do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.921,
    "end": 4494.822,
    "text": " So they start by defining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.162,
    "end": 4501.265,
    "text": "One of the simplest categories, so we're in category theory, is the category of Chu spaces, which we're going to talk more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.185,
    "end": 4511.609,
    "text": "And it basically is about a set K, and then within K, there are kind of two kinds of things, objects and attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.33,
    "end": 4521.174,
    "text": "And the Chu space is like a matrix that is the relationship over that set K of the relationships of A and X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.165,
    "end": 4525.966,
    "text": " So it's actually probably a data form that we've seen a ton of times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.026,
    "end": 4530.087,
    "text": "Like, here's 10 people, and then have they RSVP'd for my event or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.287,
    "end": 4531.247,
    "text": "Yes, yes, yes, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.168,
    "end": 4531.247,
    "text": "1, 1, 1, 0."
  },
  {
    "start": 4533.708,
    "end": 4535.589,
    "text": "That's a chew space for RSVPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.289,
    "end": 4540.13,
    "text": "But it's like that, you know, here, but it could be a lot more general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.21,
    "end": 4542.39,
    "text": "And we're going to keep on generalizing on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.53,
    "end": 4544.211,
    "text": "But the basic chew space...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.62,
    "end": 4554.726,
    "text": " is a matrix, but it probably can be higher dimensional, that is just a regular matrix, but a topological space is also a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.746,
    "end": 4556.828,
    "text": "So you can have like the adjacency matrix, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.888,
    "end": 4561.911,
    "text": "Like all the nodes by all the nodes, one or zero, connected or not, or a weighted graph, how strong is the connection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.512,
    "end": 4563.413,
    "text": "Or it could be symmetric,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.193,
    "end": 4566.376,
    "text": " in undirected or there could be a from and a to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.836,
    "end": 4571.642,
    "text": "So like all of topology is matrix forms and it turns out that they're two spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.343,
    "end": 4576.688,
    "text": "But also we can think about like programming languages and we can have a type",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4578.69,
    "end": 4605.225,
    "text": " as one of like an attribute or a type you know is the wood tabling chew space or is the object a table that's a chew space so there's a lot of programming relationships that the chew space covers probability spaces um coin flip you know content you know that is it gonna happen or not so this it's like if it's a matrix i don't know if it's you can go as far as say it is a chew space but it certainly a broad family",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.025,
    "end": 4611.649,
    "text": " of objects or categories, I don't even know what to say there, are within this chew space paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4612.97,
    "end": 4615.192,
    "text": "There's a few more definitions because we looked up just a bunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.712,
    "end": 4616.633,
    "text": "Here's from Wikipedia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.413,
    "end": 4624.539,
    "text": "And basically the big idea is that the chew morphisms are transformations on chew spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.539,
    "end": 4632.684,
    "text": "And if things are set up properly, the morphisms continuous and the pair of functions has some special relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.465,
    "end": 4634.125,
    "text": "So, um...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.308,
    "end": 4642.234,
    "text": " One example this makes me think of is like the typographical number theory in Gödel, Escher, Bach, where it's like one plus one equals two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.614,
    "end": 4656.044,
    "text": "And then you make a set of text rules like you can add an S to the string under these contexts or you can add or you can, you know, it's like it's basically doing addition and subtraction by typographical like letter based rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.065,
    "end": 4663.69,
    "text": "So if you can prove something in one system because you've super strongly shown that there's a morphism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.648,
    "end": 4668.11,
    "text": " you can show that that same relationship should exist in another system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.391,
    "end": 4672.133,
    "text": "It also turns out that's actually at the heart of the whole Gödel question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.954,
    "end": 4675.215,
    "text": "But that's the static interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.356,
    "end": 4681.28,
    "text": "And then here's dynamically, two spaces transform in the manner of topological spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.3,
    "end": 4685.603,
    "text": "Yeah, don't wanna go too deep down here, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.499,
    "end": 4691.361,
    "text": " There's special relationships of two chew spaces that are chew morphisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.222,
    "end": 4703.367,
    "text": "And then if that morphism is bidirectional, it just allows a really nice thing where you can sort of make a finding on one side and then arbitrage it to some relationship that might've been difficult to show on the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.948,
    "end": 4705.588,
    "text": "So it's like a perfect language mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.269,
    "end": 4709.23,
    "text": "You can say, you know, the boy is younger than the car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.75,
    "end": 4712.232,
    "text": "If you had a perfect language mapping semantically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.123,
    "end": 4716.864,
    "text": " you could say it in another language and the semantic information would be perfectly preserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.544,
    "end": 4727.186,
    "text": "So then maybe one person has a piece of semantic information in English and then they could convey it through the perfect morphism and it would be correctly, semantically understood on the other side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.206,
    "end": 4737.848,
    "text": "Okay, here is just a couple, we wanted to actually understand it and also shout out to master students everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.549,
    "end": 4739.689,
    "text": "So here's history from this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.714,
    "end": 4740.934,
    "text": " paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.194,
    "end": 4754.862,
    "text": "The Chu construction takes a symmetric monoidal closed category V and with pullbacks, just reading it, and an object K of V and completes V to a self-dual category Chu VK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.622,
    "end": 4757.703,
    "text": "The details of this construction appear in P.H.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.763,
    "end": 4765.727,
    "text": "Chu's master's thesis, published as an appendix to his advisor's M. Barr's book, introducing the notion of an asterisk autonomous category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.388,
    "end": 4766.508,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.731,
    "end": 4786.353,
    "text": " chapter that was an appendix and now here we are many years later so it's all good to research whatever you're researching on if it appears to you to be the big question here's Barr's perspective so Barr is another perspective on shoe spaces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.912,
    "end": 4797.319,
    "text": " Barr had this idea during his sabbatical to study duality in categories in some depth, just what most of us take our sabbatical wondering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.26,
    "end": 4807.947,
    "text": "He wasn't wondering about the simple dualities, but self-dual categories like complete semi-lattices or finite abelian groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.808,
    "end": 4815.893,
    "text": "He was interested in the possibility of having a category that was not only self-dual, but one that had an internal home",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.989,
    "end": 4821.323,
    "text": " and for which the duality was implemented as the internal home into a dualizing object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.16,
    "end": 4823.78,
    "text": " It's technical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.921,
    "end": 4828.263,
    "text": "So duality is gonna mean something different to a mathematician than a non-mathematician.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.343,
    "end": 4830.605,
    "text": "And I don't know what a home is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.385,
    "end": 4837.529,
    "text": "However, searching for an internal home, I just thought, okay, the dual, it's like forwards and backwards, or it's like, it goes both ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.77,
    "end": 4838.31,
    "text": "That would be nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.75,
    "end": 4839.471,
    "text": "You know, reversible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.051,
    "end": 4841.252,
    "text": "It's like, those are always good things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.832,
    "end": 4842.773,
    "text": "And then the internal home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.553,
    "end": 4848.557,
    "text": "Internal homes, when changed together, form a language called the internal language of the category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.657,
    "end": 4851.399,
    "text": "And I thought, okay, so now we're going from categories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4852.179,
    "end": 4855.187,
    "text": " and attributes to like something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.689,
    "end": 4859.799,
    "text": "The most famous of these internal homes are simply typed lambda calculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.377,
    "end": 4867.999,
    "text": " which is the internal language of Cartesian closed categories and the linear type system, the internal language of closed symmetric monoidal categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.859,
    "end": 4873.901,
    "text": "Lambda calculus is something that's quite broad and central to computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.381,
    "end": 4881.963,
    "text": "So this is like something about how logic, local logics and nested logics are related to categories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.619,
    "end": 4904.795,
    "text": " an analytical way such that the kinds of logic that we see on computers is only a type of it because in a way we're dealing with syntax based logic you know you have two files are they the same it lines up the bits and if they're the same it's yes no but what would this mean it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.931,
    "end": 4930.943,
    "text": " if it could be semantically the same and how would we make that non-squishy because to ask whether semantics were the same you need all the context so that's kind of this fun twist and it makes sense why for simplicity you use frequentist statistics instead of bayesian inference because it is hard to do sometimes or you do have to grapple with unknown unknowns and it's easier to just do a t-test",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.403,
    "end": 4950.905,
    "text": " or a multilinear regression rather than some other type of generative model because that takes bravery to specify your uncertainty and to give support to why you did a certain thing rather than just say, well, the countries differ with a p-value of 0.01, but it's easy just to say that and move on rather than actually do some sort of rich modeling underneath.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.566,
    "end": 4951.766,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.952,
    "end": 4954.093,
    "text": " Two spaces and channel theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.254,
    "end": 4962.063,
    "text": "We're trying to connect two of the ideas and then you can start nucleating some ideas from the ones that are making sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.088,
    "end": 4984.593,
    "text": " In channel theory, which again, we're thinking of like the more general cousin of Chan and disinfo theory, in channel theory, two transforms, these are the transformations between the two sets or spaces, become infomorphisms, which are natural maps between classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.334,
    "end": 4990.335,
    "text": "Okay, so Blue, what would you say about the red underlined part or what you wrote at the bottom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4991.807,
    "end": 5020.829,
    "text": " um so this will i'll like transition you into the next slide maybe here in a minute but um just the red underlines part it's the transform from a to b so if you have one two space and another two space the whatever it's like you know you can think about like a territory and the map of that territory like whatever transform going from the territory to the map that is that channel right it's is thought informally of as a channel",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.669,
    "end": 5026.173,
    "text": " That is like the channel that we're talking about here in terms of channel theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5026.754,
    "end": 5040.685,
    "text": "And so these, the classifiers here, so the, a classifier is the set of, where did I have that here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.765,
    "end": 5041.125,
    "text": "Somewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.688,
    "end": 5045.169,
    "text": "Classifiers link tokens to types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.087,
    "end": 5066.364,
    "text": " yeah but so oh that's that's this is the definition of classifier so classifiers link tokens to types that encompass them oh yeah because you've already read this so the channel theory the two transforms become infomorphisms which map between classifiers so if you have different sets of classifiers right so classifiers link tokens to types that encompass them",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5066.884,
    "end": 5073.188,
    "text": " So for the type stoplight, the set of tokens could be like you could have a red stoplight, a yellow stoplight or a green stoplight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5073.228,
    "end": 5080.492,
    "text": "And that's also known as a local logic, the classifier, which we talked about local logics just a few slides back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5080.813,
    "end": 5083.014,
    "text": "But flip to the next slide and I'll continue this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5083.694,
    "end": 5085.756,
    "text": "So mapping between classifiers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5086.761,
    "end": 5093.084,
    "text": " So here, if you have the classifier stoplight and then you have like what the motorist should do at the stoplight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5093.184,
    "end": 5095.185,
    "text": "So that's the second classifier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5095.245,
    "end": 5105.811,
    "text": "You could have the tokens like stop at the red light, go forward at the green light or proceed slowly at the yellow light or like get out of the intersection or whatever it is you think you should actually do at the red light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5106.051,
    "end": 5107.432,
    "text": " at the stoplight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5107.452,
    "end": 5109.073,
    "text": "But then you can have other classifiers too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5109.093,
    "end": 5112.155,
    "text": "So it doesn't just have to be the stoplight and what the motorist should do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5112.555,
    "end": 5114.397,
    "text": "It's also like what pedestrians should do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5114.837,
    "end": 5121.301,
    "text": "And like at the game, like red light, green light that you play when you're a kid, like you should run forward, run slowly or walk or then and stop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5121.361,
    "end": 5129.127,
    "text": "So, I mean, there's different classifiers that you can have that all map to the same central information core, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5129.167,
    "end": 5130.307,
    "text": "And so that's what you see here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5130.327,
    "end": 5135.271,
    "text": "The classifiers are these things, A1, A2, and you can have many of them up to A to the K.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5136.231,
    "end": 5140.254,
    "text": " And then you have at a core, this information channel, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.334,
    "end": 5147.68,
    "text": "So this is the infomorphism that allows semantic information, not just Shannon information, to be transmitted between classifiers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5148.16,
    "end": 5150.742,
    "text": "So this comes down to having a shared memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5150.802,
    "end": 5154.285,
    "text": "So we all learn from the time of verse six, that red means to stop,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5154.725,
    "end": 5155.886,
    "text": " Green means to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5156.066,
    "end": 5157.428,
    "text": "Yellow means to slow down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5157.448,
    "end": 5159.83,
    "text": "But to a six-year-old, it means running.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5160.21,
    "end": 5168.678,
    "text": "You know, when you're a pedestrian, you're looking out for other cars, and there are other behaviors that you do, and as a motorist also, and as a police officer, policing the motorist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5168.718,
    "end": 5174.923,
    "text": "There's all kinds of people that have different reactions to what the stoplight is doing, but that's all based on this shared memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5174.983,
    "end": 5178.807,
    "text": "Like, everybody has been taught, like, this is what you're supposed to do out of light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5179.748,
    "end": 5184.935,
    "text": " And so that's this core information channel through which information flows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5185.315,
    "end": 5190.983,
    "text": "It can also be thought of as a shared memory or a shared context, if you will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5193.257,
    "end": 5210.828,
    "text": " Ooh, one thing that that makes me think of here is like this sentence that said, the existence of a chew transform A to B is equivalent for every flow formula valid in A being valid in B. So it's kind of like you have the chessboard and the board position says it's game over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.848,
    "end": 5211.649,
    "text": "And then you have the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.409,
    "end": 5222.256,
    "text": " the data file and then those two are within a bigger C that is establishing a connection between these very different types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.716,
    "end": 5235.485,
    "text": "And so it's like there's in the example you gave the local logic is like there is a total logic that it does all come back to even though there's disparate types and there's sub logics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.577,
    "end": 5241.626,
    "text": " let's hear what everyone else and Chris can bring to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.667,
    "end": 5243.631,
    "text": "Cause it's like super interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.172,
    "end": 5244.353,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.633,
    "end": 5244.854,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.616,
    "end": 5247.761,
    "text": "So what about sequence blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5251.474,
    "end": 5258.679,
    "text": " So the sequence here, I just wanted to put this in because I thought it was important for information flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5259.12,
    "end": 5268.906,
    "text": "So sequence, when a sequence encodes a semantic, like a causal constraint, that effectively functions as a logic gate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5268.986,
    "end": 5269.987,
    "text": "So this really what...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5270.927,
    "end": 5277.253,
    "text": " it's what enables semantic information as opposed to just Shannon information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5277.333,
    "end": 5285.16,
    "text": "So it's like you have the message, but there's a logic gate there that says if the message is applicable or not applicable or to be transmitted or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5285.68,
    "end": 5295.169,
    "text": "And also that it I think puts forward into the, it enables putting forward into the scale free or scalable,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5296.049,
    "end": 5316.486,
    "text": " infrastructure here I think and then I like all this like mass symbols like I've never seen this stuff before these like what is this like parallel line lollipop stick I don't know but but I just I put a box around this because it's like oh that goes back to Bayes probability all right I know this so it's coming home again",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5317.441,
    "end": 5317.781,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.981,
    "end": 5326.467,
    "text": "I think this one, just reading this one, X then shape N to assign a probability X satisfies N. So maybe it's the sign of satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5327.928,
    "end": 5330.43,
    "text": "I guess it just says something that we don't know what it looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.55,
    "end": 5343.979,
    "text": "But it's like, there's a satisfaction of X to assign a probability that X satisfies N given that it satisfies M. So it's like, what's the probability that we're in checkmate on the board given that the file says checkmate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.519,
    "end": 5346.741,
    "text": "Well, if you have the morphism, it's perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.521,
    "end": 5375.215,
    "text": " but if you don't have that morphism then it's probabilistic or it's different so it's a conditional probability that's conditioned upon the way that you can map across different kinds of things and it was the perfect connection to bayesian inference because at the bottom here we have um basically m satisfying um a is the chew space that's the the scarlet letter the fancy a is the chew space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.275,
    "end": 5396.495,
    "text": " um and so this is almost like saying m is satisfying some two flow relationship with n that is itself about how tightly the spaces are connected and so then we can take this p m given n single line not satisfied um and it is belief updating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.509,
    "end": 5403.114,
    "text": " And so then, yeah, it provides the necessary semantic consistency for such updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.755,
    "end": 5415.365,
    "text": "Infomorphisms thus capture a significant representation of Bayesian inference with the necessary coherence since the target classifier context admits the same semantics as that as the source within the information flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.366,
    "end": 5431.648,
    "text": " information or infomorphisms are information flows that capture the updating of something semantic because it's semantic in that Dretzky meaning is in the world way like the prior and the posterior are about the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.631,
    "end": 5447.322,
    "text": " And then as new data or events come in, which I didn't think we captured as much here, but like this event theory connection, it's like Bayesian statistics is kind of like the steady state and then new data comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.362,
    "end": 5448.883,
    "text": "It's like an event in a network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.023,
    "end": 5454.807,
    "text": "And that event propagates through a network of semantic information flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5455.891,
    "end": 5458.351,
    "text": " And then that updates the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.371,
    "end": 5460.532,
    "text": "And maybe it's like the system's already vibrating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.572,
    "end": 5463.812,
    "text": "And so the new event comes in, nothing changes with a vibration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.592,
    "end": 5472.314,
    "text": "That might be a situation like the system semantically is already at its non-equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.474,
    "end": 5484.456,
    "text": "And so it was like not surprising, but then there's other kinds of events that enter a system that might be more surprising, but it's all about the semantic nature of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.464,
    "end": 5485.744,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.565,
    "end": 5488.646,
    "text": "So wait, wait, can I just add on to this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5488.786,
    "end": 5504.835,
    "text": "But like in our, in our contextualizing, like, and I didn't know if you were going there or not, but I just want to explicitly state that like Bayesian inference is the event, like which we are updating with active inference and category theory and two spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.875,
    "end": 5506.736,
    "text": "Were you like, like implying that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5506.916,
    "end": 5513.72,
    "text": "Or I just wanted to state that explicitly because in this context, contextuality talk about contextuality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5514.48,
    "end": 5518.911,
    "text": " Like, we are updating our own, like, event with our own knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5519.332,
    "end": 5519.573,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.558,
    "end": 5539.011,
    "text": " And I think what's sort of fun about this semantic info flow idea, the whole channel theory thing, which I really didn't get exposed to in a lot of contexts was that instead of the propagation of bits and bytes on wires and the signal fidelity, and then it's like, well, then where does the semantics get unpacked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.291,
    "end": 5541.633,
    "text": "Does it get unpacked at every little post office?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5542.113,
    "end": 5544.275,
    "text": "And they just say, no, no, just syntax all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5544.975,
    "end": 5554.599,
    "text": " So it's inherently reductionist because you go, no, we've explained away meaning because we're studying the connection from a entropy perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5555.28,
    "end": 5560.162,
    "text": "And then it's sort of a strong internally logical argument, which is why there's people who believe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5560.862,
    "end": 5565.966,
    "text": " And then it's like, could we actually think of semantics as the heart of the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5566.567,
    "end": 5574.914,
    "text": "Because when we're talking about communication of action or modification of the niche or solving the frame problem, we don't need the syntactic differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5575.014,
    "end": 5576.355,
    "text": "We want the semantic differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5576.715,
    "end": 5577.436,
    "text": "Like what has changed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5577.516,
    "end": 5578.197,
    "text": "My car is broken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.917,
    "end": 5585.78,
    "text": " I don't need to know the syntax, but from an action-oriented semantic view, that's what we're communicating on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.86,
    "end": 5592.582,
    "text": "And then we're seeing these specialized communication message passing systems like on a silicone chip, it's a special case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5593.343,
    "end": 5603.727,
    "text": "It's a controlled system where we've defined the context semantically so that it isomorphically maps onto bits and voltages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5605.137,
    "end": 5608.838,
    "text": " Okay, here's the two Fields and Glazebrook papers from 2018.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.319,
    "end": 5614.499,
    "text": "Mosaic of two spaces in channel theory one and two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.139,
    "end": 5622.721,
    "text": "So one, category theory concepts and tools is like a lot of formalisms, diagrams, but two has some nice images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.721,
    "end": 5628.922,
    "text": "And that's applications to object identification and merological complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.082,
    "end": 5631.843,
    "text": "Merological is parts and whole relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.311,
    "end": 5638.061,
    "text": " And this is to go from the chew spaces to this toe cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.923,
    "end": 5644.454,
    "text": "A system capable of both object history construction and its dual category learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.7,
    "end": 5649.283,
    "text": " So just there, history reconstruction and its dual category learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5649.323,
    "end": 5653.205,
    "text": "It's like, I'm learning about cars being broken or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5653.766,
    "end": 5657.789,
    "text": "And then if you tell me it's a broken car, I can generate a vision in my mind of a broken car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5658.409,
    "end": 5673.38,
    "text": "So it's like you have a bi-directional relationship that's open to generating specifics from the abstract or updating the abstract from the specifics, which is really related to this hierarchical Bayesian learning and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5674.62,
    "end": 5692.288,
    "text": " And they have reached, after many years of research, an understanding that objects that have this sort of analytical relationship between object history construction and category learning, with a singular category maintenance as a special case, not sure, I think that maybe that has to be one object that does both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5692.829,
    "end": 5699.532,
    "text": "A self-dual, not just two objects, one that does one part, one that does the other, is characterized by a cone-co-cone diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.598,
    "end": 5711.967,
    "text": " A cone-co-cone diagram captures the simultaneous upward and downward flow of constraints that characterize human visual object identification, and it is reasonable to suppose other sense modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.787,
    "end": 5724.877,
    "text": "And they then take it very instantly into something fascinating, which is the functional duality between a high precision expectations and high precision inputs in an active inference system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5726.124,
    "end": 5729.525,
    "text": " and hence the duality between dorsal, active and ventral passive attention systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.965,
    "end": 5737.928,
    "text": "So it is about this precision modulation and the way that you get high precision expectations and high precision inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5738.248,
    "end": 5749.711,
    "text": "So how do you have a clear generative model of the visual field, but then at the same time, you wanna be able to recognize new objects at high fidelity as they come into the screen, come into your field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5750.191,
    "end": 5754.573,
    "text": "So how are you gonna have high precision generating and high precision learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5755.573,
    "end": 5764.704,
    "text": " And there's going to be this rich multi-level ongoing integration of priors and new events and posteriors that's semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5765.888,
    "end": 5767.949,
    "text": " So it's like, I'm looking at, oh, it's a face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5768.029,
    "end": 5775.172,
    "text": "And then my eyes engage in an action selection pattern appropriate for a face that reveals some sort of anomalous information pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5775.552,
    "end": 5778.293,
    "text": "And all of a sudden the meaning has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5778.373,
    "end": 5791.439,
    "text": "And so it's almost like what is crossing the interface perhaps is the data, the observable, the measurements, but what is crossing is actually like the reconstruction of semantics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5792.367,
    "end": 5815.321,
    "text": " rather like if it's a car driving across your view but it's going 5 000 miles an hour and you can't see it then for you as the measurer it doesn't matter because you didn't see it so even though it was perhaps there but it's just a blur and so this is just getting at something very interesting which is these systems that are exquisitely generative yet also hyper able to recognize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5816.341,
    "end": 5821.666,
    "text": " and to update the generator based upon the specifics of which have been generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5822.327,
    "end": 5823.828,
    "text": "All cats have stripes, all right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5823.848,
    "end": 5827.051,
    "text": "You just saw one that had polka dots, and now you can generate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.071,
    "end": 5830.995,
    "text": "And then maybe you might generalize and even generate another type of pattern of cats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.795,
    "end": 5833.417,
    "text": "And then you could see whether that was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.925,
    "end": 5836.485,
    "text": " accurate or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5837.466,
    "end": 5842.47,
    "text": "So here is the diagram that Blue talked us through here with the core information channel C at the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5843.331,
    "end": 5845.172,
    "text": "And so this is the cone diagram on the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5845.892,
    "end": 5851.437,
    "text": "It's like a pyramid diagram, but maybe if it rotates, it's like a cone or there's some other way of thinking of it like a cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5852.751,
    "end": 5856.773,
    "text": " And you have the classifiers, and this is the whole choose space as classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5856.933,
    "end": 5858.414,
    "text": "Scarlet letter A, choose space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5859.035,
    "end": 5866.139,
    "text": "So the classifiers are linked through infomorphisms, semantic bridges to the core information channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.719,
    "end": 5871.241,
    "text": "So like here's the chess board, here's another choose space, and here's another choose space for chess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.261,
    "end": 5873.883,
    "text": "And they're all linking to this like game of chess, local logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5874.503,
    "end": 5877.025,
    "text": "And then there's a map between the board and the computer program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5877.705,
    "end": 5880.166,
    "text": " So G1223 are the commutivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.486,
    "end": 5884.967,
    "text": "So this is like, you got a link between the board and the computer and the computer and the drawing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5885.928,
    "end": 5889.569,
    "text": "And they're all infomorphisms to see the game of chess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.249,
    "end": 5894.15,
    "text": "So semantically, if there's a checkmate on one board, it's like a checkmate across paradigms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.371,
    "end": 5895.471,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5896.653,
    "end": 5904.686,
    "text": " When you're, when this is a tight cone and it represents like a huge variety of things and then I'll get you the second blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.227,
    "end": 5907.811,
    "text": "The co-cone is when we- Wait, wait, wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.871,
    "end": 5908.753,
    "text": "Oh yeah, go ahead, go ahead, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.244,
    "end": 5911.104,
    "text": " Let me let me interject before you do the cocoon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5911.124,
    "end": 5912.325,
    "text": "That's why I was like trying to flag it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5912.785,
    "end": 5924.788,
    "text": "OK, so I want to interject here for Sarah because remember we were talking about like the observables being like a tight, like a tight little cluster of measurements versus a not tight cluster of measurements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5925.248,
    "end": 5928.729,
    "text": "And so here they define it in this before we go into the cocoon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5929.929,
    "end": 5936.174,
    "text": " So you can kind of take this back to the stoplight and the kids playing and what the driver does and what the pedestrian does and whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5936.214,
    "end": 5957.208,
    "text": "But here, if you think about it, instead of like that, the categories, or sorry, the classifiers, it says when we define a finite information channel C as a finite indexed family of infomorphisms, those are all the Fs, having a common core, the component classifiers will be taken to characterize",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5957.948,
    "end": 5979.373,
    "text": " system of observables or some sub components thereof so here they're specifically stating that all of the classifiers here are all of the things that can be measured or observed in a in a context that's extrinsic as opposed to intrinsic I think so I could be wrong I hope that someone someone corrects me but I feel like this is where where it's going",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5981.854,
    "end": 5982.114,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5982.494,
    "end": 5983.635,
    "text": "Cone diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5984.376,
    "end": 5989.119,
    "text": "Then we introduce the co-cone, the shadow, as above, so below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5989.819,
    "end": 5991.02,
    "text": "Wouldn't have it any other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5991.741,
    "end": 5997.504,
    "text": "A commuting finite cone, co-cone diagram, which one's the cone, which one's the co-cone, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5998.125,
    "end": 6002.588,
    "text": "Comprises both a cone and a co-cone on a finite set of classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6002.608,
    "end": 6006.75,
    "text": "So they're mapping to the same set of A classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.79,
    "end": 6008.572,
    "text": "The same two spaces are being bridged",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.768,
    "end": 6016.35,
    "text": " And then you have like sort of two systems looking at the same bridge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6017.51,
    "end": 6025.652,
    "text": "And then if there's a commutivity across the elements of the two spaces, we have that from above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.492,
    "end": 6035.515,
    "text": "And then there's infomorphisms from all the A's to C prime and all the A's to D prime, then it's a special kind of object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.475,
    "end": 6036.655,
    "text": "What?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6037.731,
    "end": 6061.998,
    "text": " is special about it it captures in addition to a ton of other stuff probably a more subtle duality remember the whole thing about studying objects that were dual objects from like bar's 1975 paper and chris fields's other research like what is a dual object shadow a more subtle duality between processes so not an object duality but a process duality maybe forward and backwards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6063.433,
    "end": 6073.582,
    "text": " It enables object files, object tokens, and object histories to be viewed not as tokens, but as types that organize, respectively,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.097,
    "end": 6084.667,
    "text": " trajectory components, that's files, features, that's tokens, and feature-based singular categories, histories, into mutually consistent collections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6085.527,
    "end": 6088.831,
    "text": "So this is some next level token algebra.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6089.471,
    "end": 6095.638,
    "text": "And I wondered if it related to crypto because it's like, instead of the history, like the object history, my web history,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6096.138,
    "end": 6098.66,
    "text": " Well, that's actually a singular category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.981,
    "end": 6100.182,
    "text": "It's a singular trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6100.202,
    "end": 6105.647,
    "text": "So you take this list of a million things and it's like one of a unique kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.548,
    "end": 6117.739,
    "text": "And then even objects and tokens and descriptors are all being understood as highly relational, highly semantically mappable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6119.08,
    "end": 6120.041,
    "text": "So that's pretty...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6121.277,
    "end": 6128.225,
    "text": " Cool, and I guess we'll look forward to seeing what the authors can help us with, or what system could we apply this to first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.785,
    "end": 6131.709,
    "text": "Or what would be an empirical system where this is being measured?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6132.049,
    "end": 6135.132,
    "text": "Or what would we gain by measuring something this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.993,
    "end": 6137.835,
    "text": "Yeah, what are various examples of context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6139.589,
    "end": 6143.492,
    "text": " And then here's just a few figures from that other paper, the number mosaic two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.052,
    "end": 6144.672,
    "text": "So here's a cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.913,
    "end": 6145.833,
    "text": "Well, it's an image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6146.754,
    "end": 6148.415,
    "text": "It's a pattern on a Google slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6148.595,
    "end": 6149.616,
    "text": "Who's to say it's a cat, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6149.676,
    "end": 6150.257,
    "text": "That's semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6150.797,
    "end": 6154.72,
    "text": "But there's all kinds of things that we might want to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6155.221,
    "end": 6161.706,
    "text": "So it says an object token is classified at construction into multiple types by distinct but cross-modulating processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6162.426,
    "end": 6170.935,
    "text": " This includes animacy and agency detection, emotion-mediated threat detection and entry level, followed by super and subordinate categorization into types of objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6171.761,
    "end": 6192.117,
    "text": " So it's like, depending on the context and the agents observing this stimuli, whether it's a predator or prey, whether it's a cat or whether it's Felis domesticus, or whether it's a sub breed of cat, whether it's something that you approach or something that you withdraw from, or something you associate culturally with good or bad luck,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.757,
    "end": 6199.248,
    "text": " That is like the agent's ontology semantically as they interface with a cue in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.789,
    "end": 6200.931,
    "text": "And then this is a funny image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6201.472,
    "end": 6203.195,
    "text": "It's mapping Chris Fields' brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6204.477,
    "end": 6205.218,
    "text": "So it's like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.999,
    "end": 6209.261,
    "text": " It says like CF, that's him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.901,
    "end": 6212.283,
    "text": "So here's, CF is a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.883,
    "end": 6214.364,
    "text": "Humans has a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.645,
    "end": 6216.946,
    "text": "And then here's like another ontology of brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6217.286,
    "end": 6220.509,
    "text": "A private brain is a mammal brain, is a vertebrate brain, is a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.029,
    "end": 6233.678,
    "text": "So you can go superordinate and subordinate categories in a relational ontology, as well as have these like totally disparate classification schemes, just like you could in programming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6234.326,
    "end": 6237.688,
    "text": " So you could say this person has a height and a weight and that's in their public health record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6238.048,
    "end": 6240.009,
    "text": "And then there's this other thing, are they a friend or foe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6240.029,
    "end": 6241.33,
    "text": "And that's my private information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6241.911,
    "end": 6248.254,
    "text": "And then all of those are being linked semantically in a special kind of system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.655,
    "end": 6249.895,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6251.296,
    "end": 6254.078,
    "text": "That kind of, that's one little section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.714,
    "end": 6258.356,
    "text": " Here is bringing in this element of concurrency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6258.396,
    "end": 6264.5,
    "text": "So some people will have heard about this from programming languages like Golang or from other kinds of concurrent programming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6265.28,
    "end": 6270.224,
    "text": "But this is pretty interesting because it's from 2005 and it's called Paper by Pratt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6270.304,
    "end": 6272.605,
    "text": "It's I think cited in Glazebrook and Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6273.046,
    "end": 6275.487,
    "text": "Chew spaces and their interpretation as concurrent objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6275.827,
    "end": 6285.294,
    "text": "So it's yet another way that we can think about chew spaces, not just as mapping attributes to types or doing all these other transformations, but like also as concurrent programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6286.014,
    "end": 6295.777,
    "text": " So they write here that the two pressing questions for computer science in 2005, maybe forever, are what is concurrency and what is an object?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6296.377,
    "end": 6305.779,
    "text": "The first question is of interest to today's sibling growth industries of parallel computing and networks, both of which stretch our extant models of computation all well beyond their sequential origins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.239,
    "end": 6309.5,
    "text": "So you have the Turing tape and it's just zooming backwards and forwards on a tape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6309.54,
    "end": 6310.441,
    "text": "It's a standalone machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6310.481,
    "end": 6311.481,
    "text": "It's not connected to the internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6312.381,
    "end": 6335.676,
    "text": " when you have machines that are in networks, then there's semantic logics that are happening due to those local logics that are Boolean, but at a higher level, they might be more like a complex adaptive system, like a DDOS attack on a network or a certain type of governance game theory situation in a crypto economic network using a CAD-CAD model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6336.337,
    "end": 6340.499,
    "text": "Those kinds of complex adaptive dynamics at the network level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.576,
    "end": 6348.926,
    "text": " may or may not actually be able to recapitulate from the syntactic or from the lower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6349.627,
    "end": 6356.276,
    "text": "And so that's the first question is how do we think about concurrency and about designing for concurrency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.82,
    "end": 6366.022,
    "text": " good concurrent systems when our parallel and distributed computational and even unconventional computational paradigms are rapidly expanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6366.843,
    "end": 6376.625,
    "text": "The second question is relevant to programming languages where the definition of object seems to be based more on whatever software engineering methodologies happen to be in vogue than on the intuitive sense of object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6376.945,
    "end": 6383.247,
    "text": "So in other words, people use object and process in a way that might have a namespace meaning for computer science, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.687,
    "end": 6387.108,
    "text": " is actually less connected than we might want it to be to the formal math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6388.248,
    "end": 6391.568,
    "text": "And this is pretty, another last quote on this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6392.649,
    "end": 6406.331,
    "text": "They write, as the separate chapters of a theory of concurrency, all these different topics, petri nets, event structures and domains, stone duality and process algebras, these topics make concurrency something of a jigsaw puzzle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.051,
    "end": 6411.572,
    "text": "One is then naturally led to ask whether the pieces of this puzzle can be arranged in some recognizable order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6412.666,
    "end": 6415.827,
    "text": " And then they give a strong endorsement of the chew space framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.247,
    "end": 6427.152,
    "text": "So it's just interesting that these chew spaces can be objects of relations that can be processes, but also it can include context, that's what this paper is about, and algorithmic and game-like elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6427.192,
    "end": 6436.115,
    "text": "So if you can do it in Golang, if you can do it in the process algebra, if you can use higher order reflexive process algebra, maybe that's a chew space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.456,
    "end": 6437.656,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6438.533,
    "end": 6440.535,
    "text": " Let's talk a little bit about ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6441.315,
    "end": 6444.017,
    "text": "So this is gonna have a few slides and definitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6444.057,
    "end": 6451.103,
    "text": "So on the top left, a process is says to be ergodic if the ensemble average and time average are equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6451.644,
    "end": 6455.246,
    "text": "And here's a more formal definition from, this is from the NeuroBytes site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6455.787,
    "end": 6462.452,
    "text": "A more formal definition is from Ole Peters, who's been at the Santa Fe Institute, an economics professor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.593,
    "end": 6468.137,
    "text": " The ergodic hypothesis is a key analytical device of equilibrium statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6468.657,
    "end": 6473.361,
    "text": "It underlies the assumption that the time average and the expectation value of an observable are the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6474.002,
    "end": 6478.846,
    "text": "Where it is valid, dynamical descriptions can often be replaced with much simpler probabilistic ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.306,
    "end": 6481.348,
    "text": "Time is essentially eliminated from the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6482.089,
    "end": 6484.611,
    "text": "So this is on the website NeuroBytes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6484.771,
    "end": 6487.513,
    "text": "It's live and updating, but here it's just static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6488.374,
    "end": 6491.455,
    "text": " It's kind of thinking of two ways you can make purple from blue and red.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6492.275,
    "end": 6499.898,
    "text": "One is to have the spatial resolution increasing, and pretty soon, semantically, it's interpreted as purple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6500.178,
    "end": 6509.222,
    "text": "So if you doubt that, you can zoom in on an old comic book and see how they made color, which is by increasing the scale of resolution really small, then it makes it look like a new color is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6509.862,
    "end": 6512.723,
    "text": "Or you can flash things really fast, and then it will appear as if there's purple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6513.523,
    "end": 6523.547,
    "text": " And those equivalencies or ways of reaching and also deviations from ergodicity spatially and deviations from ergodicity temporally are what we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6524.027,
    "end": 6527.308,
    "text": "Now, why does the ergodic assumption matter and what happens if this is violated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6529.369,
    "end": 6551.89,
    "text": " So here's an example from modern portfolio theory, which is what Ole Peters and others like Glenn Begerman study, which is that, and this is a quote from Neurobytes, modern portfolio theory stipulates there exists some optimal risk to return profile, but the theory rests on the ergodic hypothesis by conflating an ensemble aggregate return with the individual's path-dependent return through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6552.731,
    "end": 6552.891,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6553.712,
    "end": 6554.593,
    "text": " It's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6555.173,
    "end": 6556.134,
    "text": "And this is related to the St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6556.154,
    "end": 6569.363,
    "text": "Petersburg paradox and a couple other economic ideas that basically the total population's performance or a hundred different portfolios performance at one snapshot is not the same thing as any portfolio being carried forward through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6570.084,
    "end": 6570.985,
    "text": "Why does that matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6571.485,
    "end": 6574.287,
    "text": "How off on the wrong track would we be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6574.667,
    "end": 6579.971,
    "text": "So here's some funny examples of ergodicity violations and also a hypothetical example of ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6580.492,
    "end": 6580.592,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6582.58,
    "end": 6588.452,
    "text": " Number two from the NeuroBytes, if it takes one pregnant woman nine months to give birth, nine pregnant women should only take one month?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6589.602,
    "end": 6594.926,
    "text": " And then this says, recipe says bake for 60 minutes at 200 degrees, but I'll just bake for 30 minutes at 400 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6595.446,
    "end": 6603.051,
    "text": "So like if the degree minute is all things being equal, why couldn't we just vaporize it with 10,000 degrees Celsius for just a split second?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6604.132,
    "end": 6607.474,
    "text": "It turns out that there's a process that has to play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6608.255,
    "end": 6609.836,
    "text": "And so, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6609.956,
    "end": 6610.837,
    "text": "What do you think about this, Bloop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6611.217,
    "end": 6613.699,
    "text": "Or how would you link it to anything else we talked about today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6617.639,
    "end": 6619.241,
    "text": " I'm like, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6619.321,
    "end": 6625.885,
    "text": "I think my brain is like at the nine pregnant months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6627.347,
    "end": 6628.167,
    "text": "I'll say something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6628.788,
    "end": 6638.035,
    "text": "I find those examples actually worse than just giving me no example, because like ergodicity implies you have to have a system level demarcation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6638.835,
    "end": 6644.598,
    "text": " And so, you know, to compare it to like nine pregnant women, it's like, well, the system is the woman.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6644.659,
    "end": 6646.88,
    "text": "So you can't really do that in the analog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6646.92,
    "end": 6648.621,
    "text": "It actually makes it harder to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6649.842,
    "end": 6651.122,
    "text": "Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6651.162,
    "end": 6656.866,
    "text": "Yes, it's like, but it just, yeah, I think it makes it more confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6657.346,
    "end": 6658.667,
    "text": "Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.687,
    "end": 6659.888,
    "text": "It's not a perfect mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6660.348,
    "end": 6663.55,
    "text": "It's like syntactically, it's the kind of error you'd be making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6663.67,
    "end": 6664.951,
    "text": "Like, here's the ergodic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6665.871,
    "end": 6674.373,
    "text": " in a lifespan, but then if you go too down the rabbit hole with trying to add the variables, that's why we always pull back to the actual formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6675.013,
    "end": 6677.434,
    "text": "So here is from Math Encyclopedia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6678.394,
    "end": 6680.635,
    "text": "And here, I thought it was quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6680.935,
    "end": 6689.117,
    "text": "So it's about trajectories of points and saying that, as you'll hear with many other definitions, that it's about visiting a phase space through space and through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6689.617,
    "end": 6690.857,
    "text": "That was sort of that first example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6692.438,
    "end": 6693.579,
    "text": " Here's what was interesting though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6694.18,
    "end": 6701.267,
    "text": "When the Birkhoff Ergodic Theorem had been proved, it became clear that ergodicity is equivalent to metric transitivity, measurement transitivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6703.569,
    "end": 6708.835,
    "text": "The more general situation, it was no longer suitable to talk of the equality of time and space averages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6710.091,
    "end": 6716.714,
    "text": " Systems with an infinite... So what kinds of systems are beyond spatial and temporal ergodicity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6717.335,
    "end": 6720.216,
    "text": "Systems with an infinite invariant or quasi-invariant measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.536,
    "end": 6724.318,
    "text": "Not only flows and cascades, but also more general transformation groups and semi-groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6725.339,
    "end": 6728.4,
    "text": "Transformations, groups, categories, semi-groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6728.501,
    "end": 6731.782,
    "text": "We saw abelian semi-groups earlier in the bar paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6731.842,
    "end": 6738.426,
    "text": "So it's almost like we're taking ergodicity even beyond the trajectory visitation idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6739.42,
    "end": 6754.606,
    "text": " I don't know where it's going in the way that the authors are using it, but it's like, there's, there's like the, you know, the totally inadequate metaphor, like of just making a total category error with the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6755.406,
    "end": 6760.808,
    "text": "And then there's the more empirically observable strategy violations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.828,
    "end": 6762.349,
    "text": "And like, you're gonna have a bad strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6762.409,
    "end": 6764.53,
    "text": "If you make, if you're using a model with an ergodic assumption,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6765.29,
    "end": 6767.412,
    "text": " you're going to do strategy that's just ridiculous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6767.632,
    "end": 6773.418,
    "text": "You're going to fit what seems to be the best or the most likely strategy, and you're just going to be way off base empirically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6774.198,
    "end": 6775.72,
    "text": "But this is even taking it to another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6775.92,
    "end": 6780.344,
    "text": "Okay, let's just, with a couple of these questions, bring some of our clothes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6782.306,
    "end": 6789.533,
    "text": "I think you may have raised this one, Sarah, but it was asking that this context by default...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6791.075,
    "end": 6801.52,
    "text": " generalizes the intrinsic contextuality of quantum theory to the case in which other properties of a context, for example, the order in which questions are asked, also affect the distribution of a variable of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6802.301,
    "end": 6812.506,
    "text": "This kind of direct influence is generally avoided by experiment design, particularly by imposing no signaling conditions in physics, but it's virtually inescapable when studying complex macroscopic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6813.399,
    "end": 6815.181,
    "text": " So these are some pretty open questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6815.881,
    "end": 6822.927,
    "text": "How does context relate to ergodicity, especially when systems are changing their context or vice versa or both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6823.968,
    "end": 6830.914,
    "text": "And how does this contextuality by default specifically help us here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6831.915,
    "end": 6841.063,
    "text": "And then how does Fields and Glazebrook build upon contextuality by default to maybe add another plank to this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6843.154,
    "end": 6845.775,
    "text": " Okay, here's another set of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6847.135,
    "end": 6850.496,
    "text": "The existence of complementary observables has perplexed physicists for decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6851.176,
    "end": 6853.856,
    "text": "Feynman characterized it as the only mystery of quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6854.997,
    "end": 6860.798,
    "text": "How are such paradoxes resolved at the implementation level if they are or worked around if they're not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6861.398,
    "end": 6863.398,
    "text": "What happens when workaround mechanisms fail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6863.918,
    "end": 6866.079,
    "text": "What is required to detect failure post hoc?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6867.432,
    "end": 6877.077,
    "text": " Ability to prove this experimentally would begin to answer the broader question of how prior probabilities are represented in memory and how different sets of priors can be deployed in different contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6877.777,
    "end": 6885.621,
    "text": "So how do we know what we don't know for a given context and how can a context be made to entail unknown unknowns?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6885.761,
    "end": 6889.062,
    "text": "How do we bound our not knowing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6889.883,
    "end": 6891.964,
    "text": "And I think part of the way is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6893.144,
    "end": 6897.81,
    "text": " defining everything as the Markov blanket, which is going to be us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6898.091,
    "end": 6900.894,
    "text": "Internal states and blanket states is what we can observe and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6901.435,
    "end": 6905.32,
    "text": "And so everything is going to be conditioned on generative model of external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6905.86,
    "end": 6908.784,
    "text": "So we're never even going to peep outside of the blanket states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6909.628,
    "end": 6917.691,
    "text": " we're gonna be super serious about modeling ourself and the blanket states as interacting with and modeling external world states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6918.192,
    "end": 6925.635,
    "text": "So instead of how tall is the tree, you're gonna have like you and the measuring device and the measurement in a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6926.255,
    "end": 6929.556,
    "text": "And maybe for some easy questions, it's gonna be total overkill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6929.917,
    "end": 6934.959,
    "text": "But I think for other questions, it's gonna really open the door because once people frame it in this way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6935.94,
    "end": 6942.22,
    "text": " What was an unknown unknown is going to be something that we can actually encapsulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6945.137,
    "end": 6946.979,
    "text": " So that's bringing us to this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6947.359,
    "end": 6947.78,
    "text": "Here's a quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6948.42,
    "end": 6955.087,
    "text": "We apply this development of ideas to recover, among other things, a new theoretical and inferential role for the Markov blanket concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6955.167,
    "end": 6957.409,
    "text": "We read this in the introduction because it's a key point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6958.09,
    "end": 6965.798,
    "text": "As the locus at which free energy is minimized and the epistemic knowledge barrier that keeps contextual information hidden from the observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6966.198,
    "end": 6966.318,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6967.406,
    "end": 6969.147,
    "text": " Where's Markov Blanket coming into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6970.067,
    "end": 6974.349,
    "text": "What does this have to do with our active inference modeling and learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6975.049,
    "end": 6987.134,
    "text": "And then just all these issues that we've been talking about, representation, internal versus external perspectives, and where is this paper coming into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6987.554,
    "end": 6994.197,
    "text": "Okay, then Sarah, this is one of your suggestion slides from a couple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6995.632,
    "end": 7014.157,
    "text": " weeks ago so but it's relevant here again so what maybe what if you want to anything that's interesting like about context or frame or reservoir just you're you know a high foraging philosopher of science so it's always good to hear what you think about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7015.319,
    "end": 7019.722,
    "text": " And my brain is pretty fried, but I think I can... My eyeballs are fried.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7021.523,
    "end": 7030.568,
    "text": "Anyway, the thing that strikes me as a kind of contrast about what I'm able to read from this paper is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7033.781,
    "end": 7046.525,
    "text": " I don't know, I get the sense when they're writing in the paper that they just have this, like, you know, how can we have the eye of God in, like, all contexts and shift, like, you know, or at least they're talking about that in the context of, like, modeling and talking about how our world actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7046.605,
    "end": 7056.287,
    "text": "But the thing that makes reservoir computing so powerful, one of the things, is its non-ergodicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7056.767,
    "end": 7058.448,
    "text": "It's kind of natural partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7059.946,
    "end": 7061.527,
    "text": " heterogeneity in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7062.608,
    "end": 7076.999,
    "text": "And so I don't know, that's really interesting to me, this kind of how can a body compute and what are the attributes about a body that, what are the kind of imperfections about the body that make it intelligent in that sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7077.339,
    "end": 7082.123,
    "text": "So yeah, in what way do channels",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7082.833,
    "end": 7087.406,
    "text": " form like these natural cut at natural joints or make these kind of boundaries and why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7087.426,
    "end": 7088.209,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7088.61,
    "end": 7089.994,
    "text": "Those are the interesting parallels for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7092.261,
    "end": 7092.561,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7093.202,
    "end": 7112.738,
    "text": "Yep, that idea of like, it's the local consistency, the organismality, the end in of itself, that's like the Kantian organism concept, but it's an aberration, it's far from equilibrium from the global context, which is just hydrogen molecules dispersed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7113.519,
    "end": 7120.245,
    "text": "So it's like when you have a global disordering or some sort of perturbation, and then you have a locally organized bubble,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7121.528,
    "end": 7129.558,
    "text": " Then it's like, it is our unique differences and situation that allow that agent to be adept in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7130.299,
    "end": 7135.405,
    "text": "It almost couldn't be another way, or it's hard to see how... I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7135.445,
    "end": 7137.827,
    "text": "The thing that's interesting is you don't even have to think about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7138.686,
    "end": 7143.487,
    "text": " Well, I'm sure there is more you have to think about in terms of adaptation and, you know, response and things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7143.507,
    "end": 7145.668,
    "text": "But just, you know, how does a rock compute?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7146.128,
    "end": 7153.949,
    "text": "And there was one paper that I was reading where they were talking about, like, well, okay, if you stick a rock in the oven, you know, it doesn't necessarily heat up in all the same places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7153.989,
    "end": 7160.111,
    "text": "So you do have this kind of, you do have these non-homogeneous kind of attributes about the rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7160.171,
    "end": 7160.231,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7161.465,
    "end": 7168.554,
    "text": " It's a very loose analogy, but that is essentially like this non-Boltzmann type distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7168.614,
    "end": 7174.922,
    "text": "That is what makes these bodies computable in some way that is yet still a little bit mysterious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7175.942,
    "end": 7176.142,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7176.702,
    "end": 7186.327,
    "text": "And it's like, if it were a little worm, you said if it, oh, its body is set up with a muscle and the connective tissue in the nerve so that it moves away from a prick from on the side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7187.127,
    "end": 7189.668,
    "text": "It doesn't need to be computing where everything is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7189.828,
    "end": 7195.131,
    "text": "If its body is able to respond, then it can do what it needs to do in the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7195.511,
    "end": 7195.751,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7196.712,
    "end": 7198.372,
    "text": "But I mean, you don't even need to be alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7198.392,
    "end": 7201.114,
    "text": "That's the thing that kind of blows my mind about how this computing works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7203.775,
    "end": 7203.975,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7205.979,
    "end": 7228.686,
    "text": " so implications next steps the first so this is good that they went there so the first question which is expanded upon more in this besieva paper is exploring contextuality for human measurements cool a second is understanding how context switching is implemented at the neurocognitive level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7229.406,
    "end": 7231.888,
    "text": " So that's the Feynman quote that we just looked into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7231.928,
    "end": 7247.158,
    "text": "But basically, what is happening when it's like somebody's your friend, you're in a narrative of friendship and like from the cultural down to the, you know, the day down to the second, down to the micro expression, you're in a narrative and then a stimuli happens and a context switches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7247.958,
    "end": 7254.763,
    "text": " and that trajectory is still a unitary, your relationship with them is still a thing, but it's changed in a way that the context has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7255.163,
    "end": 7257.084,
    "text": "Like, how does that get implemented?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7257.545,
    "end": 7261.807,
    "text": "This combination of the high precision priors and the high precision inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7262.408,
    "end": 7268.112,
    "text": "How do we get the best of both worlds with this rapid attentional modulation as brains",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7269.201,
    "end": 7293.281,
    "text": " into and away from objects and then context switching those are features that are just not within the scope of shannon disinfo theory and they're much more semantic questions a third and broader question is whether intrinsic contextuality can be detected and characterized at multiple scales in complex systems generally by formulating a scale-free model of contextuality in category theory terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7294.201,
    "end": 7304.187,
    "text": " And in particular, by employing the concepts of classifiers and information channels, we hope to have opened a new pathway towards addressing these questions in multiple ways or addressing these questions in multiple systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7306.449,
    "end": 7322.259,
    "text": "So maybe if there is something special to be said about contextuality or the violations thereof, two sides of the same coin, maybe we could identify in a less biased way what scales of organization are relevant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7323.368,
    "end": 7338.561,
    "text": " or just detect new dynamics of complex systems because there's a lot of recent work showing that like with complex systems, they can emit structured outputs that have the signature of white noise or have a signature of nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7338.621,
    "end": 7348.889,
    "text": "Like an encrypted file is gonna have a distribution syntactically that's gonna be looking like nothing different from the frequentist's expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7349.73,
    "end": 7367.106,
    "text": " but it's a semantically encoded local logic that is allowing communication through that channel so if all you have is the white noise detector you're going to think up that looks like the signal is not containing information but actually semantically it is so there's there could be systems just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7368.007,
    "end": 7384.299,
    "text": " in and around us that are doing things we don't even see and that would be no weirder than if there was wavelengths we didn't see we know that's true we know that there's things that are too big or too small for us to see so could there be things informationally or from a narrative perspective that we're just not perceiving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7386.243,
    "end": 7411.462,
    "text": " doesn't seem out of the picture so i think it's a it actually is a major area and you know for those who have participated or listened to this deep in chris fields was the one who recommended this paper to us and just said i think this is a topic that is not really thought about in the active inference community that much but it will become important later i don't even know what topic he was referring to but this was a paper that really raised some huge questions so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7412.503,
    "end": 7433.519,
    "text": " all kinds of questions that we have but i think it's fair enough just to say um thanks to our two slash three brave and awesome participants thanks sarah and blue because that was a fun convo and we definitely laughed and memed because it was like the hardest paper i think we've read yet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7435.396,
    "end": 7435.797,
    "text": " Definitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7435.837,
    "end": 7437.659,
    "text": "But, you know, the paper was so well written.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7437.719,
    "end": 7442.465,
    "text": "Like, I am not a big fan of reading, like, math papers and lemma this and theorem that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7442.545,
    "end": 7444.988,
    "text": "Like, I'm not, I usually don't enjoy it at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7445.008,
    "end": 7448.833,
    "text": "But I really did find this paper to be very well written and easy to follow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7450.481,
    "end": 7450.941,
    "text": " I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7451.542,
    "end": 7455.744,
    "text": "When there was a formalism, it's a theorem, definition, figure, formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7455.804,
    "end": 7459.245,
    "text": "It's like, okay, I'm not going to understand that, but I know that that's just the theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7459.866,
    "end": 7461.486,
    "text": "So I could just say, okay, got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7462.007,
    "end": 7464.808,
    "text": "Something I don't understand, put it away, encapsulate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7464.828,
    "end": 7465.288,
    "text": "So I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7466.829,
    "end": 7468.97,
    "text": "Any last thoughts, Sarah Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7470.01,
    "end": 7477.374,
    "text": "I just said I was almost wishing, like as I was reading the paper, like for some concrete examples, but we would have ended up with like a 65 page paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7479.147,
    "end": 7481.828,
    "text": " So I guess that's our job to be the concrete example, you know?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7483.029,
    "end": 7483.229,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7483.709,
    "end": 7485.65,
    "text": "And that'll be fun to talk to Chris about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7485.73,
    "end": 7494.113,
    "text": "So let's until the time we actually get to talk about this paper, which is going to be on March 9th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7494.794,
    "end": 7501.016,
    "text": "So between now and March 9th, let's just chill, you know, do our other jobs instead of just read this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7502.637,
    "end": 7508.179,
    "text": "Think about what would be really powerful and meaningful to ask them semantically.",
    "speaker": "SPEAKER_00"
  }
]