[
  {
    "start": 3.305,
    "end": 4.867,
    "text": " Hey everyone, welcome back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.93,
    "end": 16.203,
    "text": "It is September 26th, 2023, and we're in cohort four, meeting 14 on our second discussion of chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.486,
    "end": 27.439,
    "text": "So before we jump over to the text, does anyone want to just give any thought or take on six?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.302,
    "end": 73.626,
    "text": " yeah briefly just Charles it's it alternates time so the earlier time now we're in cohort four chapter six and vice versa but it's all different angles on the same thing so it's not like there's something that won't make sense in six because that's cool I'll just hang around and absolutely carry on thanks yeah so you want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.361,
    "end": 99.006,
    "text": " give a thought on six or we can look at the questions that haven't been addressed yet okay let's just go to a question and then if somebody has another question they can write in the chat or raise their hand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.061,
    "end": 108.144,
    "text": " The authors talk about language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.164,
    "end": 112.027,
    "text": "But in language processing, one usually assumes recursive processes, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.047,
    "end": 113.128,
    "text": "a context-free grammar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.149,
    "end": 117.032,
    "text": "How can FEP active inference account for recursivity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.393,
    "end": 122.257,
    "text": "In my understanding, hidden Markov models implement types of regular grammars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.557,
    "end": 125.6,
    "text": "I assume that hierarchical extensions, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.62,
    "end": 128.783,
    "text": "section 642, does not fundamentally change this, does it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.504,
    "end": 133.667,
    "text": "Did anyone here ask the question or does anyone want to give a thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.289,
    "end": 161.076,
    "text": " I'm not exactly sure what the question is getting at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.477,
    "end": 166.927,
    "text": "However, some senses of recursion can be accommodated by hierarchical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.129,
    "end": 178.208,
    "text": "So active inference models of reading have, for example, letters nested within words, words nested within sentences, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.47,
    "end": 179.871,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.032,
    "end": 193.688,
    "text": " this hierarchical model embodies the sparsity associated with this kind of a recursive process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.39,
    "end": 204.842,
    "text": "And then another kind of related notion of recursion is closer to reentry, where something is more like self-reflexive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.783,
    "end": 209.588,
    "text": "And so that is less referring to like the hierarchically nested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.023,
    "end": 232.437,
    "text": " like kind of nested for loops notion and more having to do with like re-entry of input and reference which we might point to first off just the fundamental re-entry of the consequences of action through perception via the niche for the agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.024,
    "end": 249.6,
    "text": " And then a little bit more, um, on the sophisticated cognitive entity, the recursive identity concept and like identity reentering in reference to itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.188,
    "end": 258.909,
    "text": "Ali go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.089,
    "end": 259.369,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.083,
    "end": 269.005,
    "text": " Well, perhaps the question also, I'm not sure, but maybe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 269.272,
    "end": 279.144,
    "text": " one angle to answer this question is to answer whether generative models are exclusively recursive models or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 279.264,
    "end": 293.181,
    "text": "So I believe in active inference framework, and especially its current formulation, there isn't any restrictions for generative models to be exclusively recursive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 293.301,
    "end": 296.865,
    "text": "So they can be applied for both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 297.807,
    "end": 313.79,
    "text": " I mean, nested and recursive models, and also in some situations, we can have purely, I mean, non-recursive or sequential models as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 314.13,
    "end": 327.73,
    "text": "So yeah, in its current standing, it is much more broader than only a recursive kind of structure as HHMs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 328.064,
    "end": 354.342,
    "text": " that we're dealing with a couple of decades ago great point and it kind of returns to the theme of chapter six and the questions that are asked in chapter six it's like is or what kind of recursive phenomena is being desired to to be modeled and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.57,
    "end": 359.134,
    "text": " They're sort of like what you intentionally include in your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.333,
    "end": 368.044,
    "text": " Like you know that you want to have this phenomena and you're going to engineer and implement motifs or mechanics to get this phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.164,
    "end": 369.466,
    "text": "Like it's your target phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.067,
    "end": 375.974,
    "text": "You want to have a phase transition associated with people like leaving a crowded room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.475,
    "end": 380.64,
    "text": "And then like you want to like kind of like build that into the model super explicitly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.462,
    "end": 388.851,
    "text": "And then a little bit more indirectly would be you want to have some phenomena arising",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.101,
    "end": 396.478,
    "text": " but you don't want that phenomena to be like explicitly a parameter in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.707,
    "end": 426.364,
    "text": " that's the chapter six question what do you actually want to model what system of interest do you want to model and and that's non-trivial to identify the boundaries of the system and to subset what you actually want to model about it and what's interesting what questions you want to model because otherwise you're just making a map that's the territory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.913,
    "end": 429.336,
    "text": " And there's no point in doing so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.344,
    "end": 433.605,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.208,
    "end": 442.243,
    "text": "How is the active inference modeling recipe or approach to modeling similar and different from other modeling approaches?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.265,
    "end": 444.387,
    "text": "That's a very good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.635,
    "end": 482.271,
    "text": " just from what people have seen or what they feel what's what's one or more similarities or differences whether people have have done some quantitative modeling like statistics or systems engineering or whether they've done some other informal analysis approach how is or could be active inference chapter six recipe different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.975,
    "end": 494.518,
    "text": " Yeah, Ali.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.538,
    "end": 504.287,
    "text": "Well, I think this question is, I don't know, perhaps too general to be answered sufficiently or helpfully.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 504.327,
    "end": 520.982,
    "text": "But when it comes to active inference modeling, my own understanding is that the main thing that sets it apart from perhaps all the other or many other approaches is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 521.063,
    "end": 529.079,
    "text": " It's emphasis on constructing the useful and appropriate generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 529.5,
    "end": 533.588,
    "text": "In all the other approaches,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 534.783,
    "end": 553.77,
    "text": " the representation of the world or the phenomena we're trying to model is not something that, it's not on very clear probabilistic representation terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 553.75,
    "end": 565.667,
    "text": " uh so to speak but in active inference uh there is this clear distinction between what ex what kind of phenomena or uh what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 566.187,
    "end": 581.053,
    "text": " Maybe we can say what kind of structure the phenomena or the the system we're trying to model encapsulates in terms of its probabilistic behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 581.114,
    "end": 589.208,
    "text": "So it is much more clear than other modeling approaches.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 589.188,
    "end": 603.227,
    "text": " when it comes to the representation of that specific system, world, or the phenomena of interest in relation to its generative model construction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 604.028,
    "end": 614.402,
    "text": "So yeah, I think the main distinction lies exactly in the approach to constructing that representation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 619.445,
    "end": 628.788,
    "text": " Thanks anyone else feel free to raise your hand or go for it all also point to recent work by now at all from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.848,
    "end": 630.552,
    "text": "This year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.489,
    "end": 639.042,
    "text": " where they designing explainable artificial intelligence with active inference, a framework for transparent introspection and decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.445,
    "end": 652.388,
    "text": "It points towards some of the motifs that make it different and which give it a semantic interpretability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.368,
    "end": 681.362,
    "text": " because when features of the system including its own introspection its own confidence on its answers or its sense making are framed in terms of probabilistic parameters that are just what it says on the label then there is a clear sense of what structure or phenomena arising from structure of the system that we're modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 683.857,
    "end": 712.058,
    "text": " that doesn't mean that the model in hand is going to be the system we're modeling obviously that's the whole map territory fallacy map territory fallacy fallacy situation but when we have um interpretable parameters that play explicit roles in semantic Bayesian networks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.535,
    "end": 739.598,
    "text": " then um at least we're on that path yeah i'll um i'll bring that paper into i don't i'm sure it's somewhere else in in here but um charles this is the paper of uh ramstead at all on the map territory fallacy fallacy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.624,
    "end": 750.98,
    "text": " And just in brief, commonly people talk about map territory fallacy, which would be the fallacious equivalence of a map in a territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.081,
    "end": 754.765,
    "text": "People are pretty familiar with map territory fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.865,
    "end": 759.412,
    "text": "Map is not the territory, all of that, maps are useful, some are, all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.816,
    "end": 765.822,
    "text": "And in this paper, they point to a kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.101,
    "end": 790.003,
    "text": " extreme case where people will look at active inference free energy principle modeling and say oh well it's just making a map so it's just making a map of the territory so it's not the territory so it's kind of like what's what's the issue like what's the value add um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.726,
    "end": 816.582,
    "text": " and so uh there's a few aspects to this and uh it relates to on one side um reification of the map and the territory like you go with the map to the territory and then like you you know that it's that the map's not the territory yet still they are used to kind of co-justify each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.68,
    "end": 844.662,
    "text": " then another flavor is oh well then free energy principle does nothing if it's just helping us build maps that's nothing that's just a mapping framework and that's like a fallacy on the map territory fallacy ollie or or anyone else what what what other angles are there i i can actually just chime in quickly because it relates to the one or sort of two-part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.148,
    "end": 855.884,
    "text": " question comment that I did put in Dakota last week relating to chapter one, but maybe it's another angle on the same thing, which is the modeling versus action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 856.786,
    "end": 863.456,
    "text": "It's kind of a can of worms, but I don't know if that's enough of a prompt to kind of address these terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 864.477,
    "end": 865.279,
    "text": "Yeah, how do you see it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.661,
    "end": 867.822,
    "text": "Well, I'm not sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 867.843,
    "end": 871.748,
    "text": "This is just one of my initial questions that came up right away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 871.768,
    "end": 874.092,
    "text": "Is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 874.713,
    "end": 887.014,
    "text": " I guess the answer is in the definitions, but in practice, how is the modeling as action compared to modeling in contrast to action?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 887.174,
    "end": 889.819,
    "text": "I guess that's the best I can put it right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.35,
    "end": 898.594,
    "text": "That's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.059,
    "end": 916.043,
    "text": " like modeling is an action it's an iterated process that a modeler takes in fact we could even do a chapter six on chapter six and make a cognitive model of somebody applying active inference to modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.204,
    "end": 940.09,
    "text": " eventually I expect that that would be relevant so there is a sense in which modeling is an action it's a practice it has explicit and implicit skills associated with it so modeling is action however modeling throwing a baseball isn't throwing a baseball",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.318,
    "end": 949.187,
    "text": " There's a tiny bit more I can add, which I see I had written also, I think, in Code Word 5.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 949.687,
    "end": 956.075,
    "text": "Of course, observing and documenting are both also action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 956.275,
    "end": 962.502,
    "text": "However, the systems and behaviors being observed would be the primary actors in the sense of action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 964.484,
    "end": 966.126,
    "text": "Yeah, anyway, it has to do with that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 966.526,
    "end": 969.79,
    "text": "Observing as action relates to that, too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 974.613,
    "end": 1001.937,
    "text": " thank you yeah we'll um return to these but but um think about the setting of of so let's just say we're chapter sixing a baseball game so we have a person who's a spectator they are still taking action with their eye Cicade to look at different parts of the field reducing their uncertainty and then covertly internally",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.355,
    "end": 1008.943,
    "text": " they are deploying attention as action, attending to different parts of their experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.965,
    "end": 1030.911,
    "text": "So even a seemingly passive, perhaps overtly passive observer is active at least in the attentional covert internal sense, if not also in the epistemic foraging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.397,
    "end": 1056.392,
    "text": " eye Cicade sense like choosing where to look but none of that activity happening in the spectator is the action happening on the field and then to connect this back to the map territory fallacy fallacy no matter how deep we go into this um model of like a spectator and an athlete",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.511,
    "end": 1082.667,
    "text": " it does the end of the process isn't going to be like a material spectator and an athlete the map of that setting that cognitive setting isn't the territory that's so so now now we're immune to the map territory fallacy map is not the territory but then what is it it's a map and then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.693,
    "end": 1101.015,
    "text": " I'll also note that Ramstad and Saktiva Devel and Friston go a little bit further than just naming their critique of this deployment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.035,
    "end": 1110.207,
    "text": "They come back even stronger and say, actually, free energy principle is the ideal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.773,
    "end": 1124.368,
    "text": " And any model that doesn't conform to the free energy principle with respect to the map territory scenario is either saying too much or too little.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.431,
    "end": 1125.732,
    "text": "Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.15,
    "end": 1152.933,
    "text": " Uh, so there's this heated debate in, uh, the philosophy of mind and, um, um, I don't know the philosophy of neuroscience about the meteorological fallacy, um, which, uh, says something to the effect that, uh, it is a fallacy to ascribe, uh, a psychological action to a part of a cognitive agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1153.754,
    "end": 1160.14,
    "text": "Uh, so when we say that, uh, the brain does something, it's not actually what brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1160.423,
    "end": 1170.219,
    "text": " that does that specific action, but the whole agent that possess the brain is responsible for the action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1170.259,
    "end": 1183.68,
    "text": "So I'm not sure how, I mean, in this kind of self-referential scenario of modeling, this meteorological fallacy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1183.66,
    "end": 1191.869,
    "text": " holds or not, or whether at what point we can escape this meteorological fallacy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1192.409,
    "end": 1210.208,
    "text": "But when it comes to map territory fallacy fallacy, my understanding is that the FEP and active inference escape this exact meteorological fallacy right from the beginning by not",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1210.829,
    "end": 1234.66,
    "text": " uh conflating map and the territory and uh or in other words by taking a totally different approach to the concept of agency uh uh and uh it it's not something that's just metaphorically uh ascribed to uh part of the system so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1234.64,
    "end": 1244.346,
    "text": " when they say that a part of a system looks as if it does some kind of inference or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1245.085,
    "end": 1248.489,
    "text": " any action, it's not just a pure metaphor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1248.649,
    "end": 1256.098,
    "text": "It's built into the very fabric of active inference theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1256.658,
    "end": 1270.674,
    "text": "So yeah, I believe in that case, this kind of self-referential scenario can be applied indefinitely if we wanted to with this specific kind of approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1272.917,
    "end": 1273.978,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.764,
    "end": 1302.278,
    "text": " see if this is kind of another piece of it when we say a system looks as if it is bounding surprise or it's reducing surprise that's not metaphorical or the realist claim about the territory it's a narrow and limited claim about the map",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.08,
    "end": 1315.935,
    "text": " which, and now all claims about maps, unless they're being considered in some abstract mapping setting, are on the foundation of the relationship between the map and the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.678,
    "end": 1322.102,
    "text": "How is it being approached differently in ACT-INF?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.747,
    "end": 1332.315,
    "text": "We have figure 9.2, 9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.025,
    "end": 1351.502,
    "text": " the meta Bayesian so here in the center we have the cognitive model of the system of interest of the subject of the modeling subject and then outside of the subject is the the this is figure and ground",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.663,
    "end": 1360.815,
    "text": " So we're being explicit that we're making a map about the cognitive model of the subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.275,
    "end": 1366.884,
    "text": "Now, that subject's cognitive model could be a map of the environment as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.125,
    "end": 1381.725,
    "text": "But once we enter into this mode of modeling, we're not making claims about the subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.566,
    "end": 1394.12,
    "text": " we're either making claims about our map of the subject, and then a subset of that is maps that the subject makes about the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.006,
    "end": 1411.982,
    "text": "I hope that didn't say too much or too little, but I think that is what it resonates with me when Alisa says that we kind of head off that fallacy from the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.755,
    "end": 1428.999,
    "text": " because the task that we're doing in cognitive modeling, if this is a rat in a T maze, or if this is some digital environment or something like that is we set up our work explicitly as making a map rather than like, well, what does the amygdala do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.521,
    "end": 1432.104,
    "text": "It's like, well, then you're gonna get into a situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.164,
    "end": 1433.746,
    "text": "It's like, are we making claims about the amygdala?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.608,
    "end": 1436.05,
    "text": "Because that's a claim about the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.512,
    "end": 1440.957,
    "text": "But if we say, well, we're building a map of the amygdala",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.19,
    "end": 1466.033,
    "text": " and one of the functionalities in our map is that the amygdala is making a map of its environment so that's the kind of nested mapping and that's this that may relate to the earlier recursion question but now if we have um prevented or stymied off this map territory fallacy which is actually fairly easy to identify if it's approached hygienically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.228,
    "end": 1487.481,
    "text": " then we're just not making claims about the amygdala directly we're building the map which can include sub maps but then there doesn't have to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.267,
    "end": 1492.81,
    "text": " I mean, this is the Scylla and the Charybdis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.331,
    "end": 1498.176,
    "text": "Map territory fallacy on one hand, and then the fallacy fallacy on the other hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.122,
    "end": 1511.189,
    "text": "Because the map's utility and relevance is related to its mapping, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.79,
    "end": 1517.755,
    "text": "Which we want to be able to say things like, yeah, 4th Street and 5th Street run in parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.072,
    "end": 1519.614,
    "text": " And I'm not just talking about my map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.197,
    "end": 1524.781,
    "text": "But that's the empirical question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.009,
    "end": 1533.672,
    "text": "I had a question about the map and territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.712,
    "end": 1537.617,
    "text": "Could you explain more about what the fallacy is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.292,
    "end": 1571.097,
    "text": " yeah i'll give a first take broadly the map territory fallacy is when a constructed map which is to say an abstraction or a model of some real material system of interest or territory when especially in a science or research or modeling setting it can be easy to kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.465,
    "end": 1574.951,
    "text": " conflate or use rhetoric from one regarding the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.572,
    "end": 1581.922,
    "text": "So we have a bunch of healthcare data on doing this and this health outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.623,
    "end": 1590.015,
    "text": "And we did a linear regression and we found that smoking was increasing the risk of lung cancer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.516,
    "end": 1596.426,
    "text": "Sounds like a relevant thing to say, but the more narrow statistical claim would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.3,
    "end": 1617.115,
    "text": " there was a statistically significant positive regression slope between this measure and that measure so that's on the mapping we did a linear regression and we want to be able to I mean it's like look at the line don't we want to be able to say that there's like a positive relationship between these things in the real world so that's the tension",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.888,
    "end": 1625.618,
    "text": " Because you'd want to be able to just, first off, look at your statistical results on the map and make a statement about the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.139,
    "end": 1628.302,
    "text": "Like doing this increases that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.486,
    "end": 1636.052,
    "text": "But that's already leaving the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.072,
    "end": 1637.073,
    "text": "It's like you're looking at the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.093,
    "end": 1641.959,
    "text": "It's like, well, it looks like these two roads intersect at this GPS coordinate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.78,
    "end": 1644.403,
    "text": "But that doesn't mean that they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.504,
    "end": 1647.827,
    "text": "Especially if you're like extrapolating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.82,
    "end": 1678.776,
    "text": " so so then if somebody were to have smoked twice as much then they would have this much more so the map territory fallacy is just it's done in science communication it's done in self-talk it's done in so many different settings where something is gleaned or constructed in the map as all maps are and then that is used to justify and sometimes even linguistically is is woven",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.224,
    "end": 1707.582,
    "text": " or completely mixed into claims about the territory which may be valid or aligned or resonance or like pointing in the same direction so it's not like we're not in a situation where like maps are like deceptive unless they are but that is the tension what can you say about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.253,
    "end": 1733.13,
    "text": " the map and the territory but it starts with just the fundamental recognition and and the repeated exhortation that the map is not the territory which is why you hear that as well as like all models are wrong some are useful or the Borges story of the the map maker who like makes a map that's so detailed that it covers everything and then like it becomes the territory those are all kind of allegorical ways to talk about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.072,
    "end": 1757.751,
    "text": " but the big issue is when we're doing scientific modeling we're doing map making and there's this complexity of relationship between any map and any territory and again it would be so simple and straightforward to just make the map do the statistics and then the statistics should just apply right back to the territory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.498,
    "end": 1763.302,
    "text": " You know, I have GPS locations on these two objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.943,
    "end": 1766.007,
    "text": "I made a statistical model of their location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.728,
    "end": 1768.31,
    "text": "In the statistical model, they're close.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.971,
    "end": 1770.754,
    "text": "So can we say that the objects are close?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.956,
    "end": 1772.897,
    "text": "It's like, just let me say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.419,
    "end": 1778.105,
    "text": "But if it were that way, yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.185,
    "end": 1780.549,
    "text": "As Charles says, it's not so clean and distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.569,
    "end": 1783.493,
    "text": "There are settings where it is clean and distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.457,
    "end": 1786.438,
    "text": "But those are not every setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.532,
    "end": 1818.467,
    "text": " that makes sense and it happens a ton in neuroscience as well because the territory is so messy and ineffable that it's like somebody will make some list of terms or they'll make some axes that they're studying summary statistics or um personality traits or just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.51,
    "end": 1830.724,
    "text": " Somebody brings some framework to reckon or to grasp with neuroscience or with psychology, and then they start reifying the existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.625,
    "end": 1835.31,
    "text": "It's like, I can't believe there's things in the upper left quadrant of this thing that I made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.551,
    "end": 1838.474,
    "text": "But that's, again, it's a statement on maps, not territories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.155,
    "end": 1841.097,
    "text": "Ajith, or Ali, sorry, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.637,
    "end": 1854.252,
    "text": " I just wanted to mention a probably useful distinction made by Deleuze between representation and cartography.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1855.053,
    "end": 1871.758,
    "text": "He makes a clear distinction between what we want to represent, in other words, what we want to trace in our models, and the cartography or the action of mapping something in the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1871.738,
    "end": 1874.783,
    "text": " or diagramming or metamodeling or whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1875.685,
    "end": 1894.438,
    "text": "So in this sense, I think what active inference does, I mean, in light of this distinction between representation and cartography, more maps into the representation side of modeling, in other words,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1894.418,
    "end": 1909.735,
    "text": " the very act of constructing a generative model of the world or the phenomenon of interest is done by tracing the probabilistic states of the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1910.276,
    "end": 1920.527,
    "text": "So it's not cartography in the sense of mapping or diagramming or metamodeling, but rather it actually does",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1920.676,
    "end": 1924.364,
    "text": " this very active tracing representation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1924.484,
    "end": 1940.237,
    "text": "So I think it also helps to distinguish between the usual way of talking about mapping or modeling in other scientific endeavors and the active inference way of doing things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1947.777,
    "end": 1963.469,
    "text": " Would there ever be a case where you are talking about the territory like i'm just kind of wondering like when you would ever talk about the territory and science because wouldn't it always be sort of some representation you're working with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.696,
    "end": 1967.237,
    "text": "What do you think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.08,
    "end": 1983.4,
    "text": " Ali?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1986.603,
    "end": 1999.756,
    "text": "Yeah, so it depends on what we mean by representation in relation to the territory we're trying to, quote unquote, represent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.057,
    "end": 2010.066,
    "text": "But I mean, even the simplest act of observing the world and observing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2010.451,
    "end": 2024.277,
    "text": " anything that we want to model entails at least an elementary kind of representational cartography combined.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2024.878,
    "end": 2028.645,
    "text": "So maybe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2028.963,
    "end": 2040.878,
    "text": " I mean, it's not possible theoretically and philosophically even to have a direct access to the territory we want to study.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2041.479,
    "end": 2053.314,
    "text": "But the only way we can we can have anything useful to say about that specific territory is through the representation and cartography.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2054.175,
    "end": 2058.16,
    "text": "At least this is one of the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2058.882,
    "end": 2062.146,
    "text": " Hamed Nademiya, views held held by structural realists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2063.108,
    "end": 2067.934,
    "text": "Hamed Nademiya, and specifically ontological structural realists so it's not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2069.476,
    "end": 2075.324,
    "text": "Hamed Nademiya, it's not about the content of the world, but the structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2075.364,
    "end": 2081.312,
    "text": "Hamed Nademiya, structure, the content of that world manifest themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2081.528,
    "end": 2108.886,
    "text": " that scientists are interested in so yeah at least in in some perspectives it's not possible to have that direct knowledge of the territory I think it's an excellent question as many we just kind of surface them and it's for people to consider but but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2110.503,
    "end": 2138.299,
    "text": " we were engineers and if we were building a bridge and we had the blueprint and we were talking about the blueprint like is it sufficient to just make strong claims about blueprints that we have in hand on the table and then understand that there's a relationship between the blueprints that we make and the territory that we care about is that enough like is that like a firewalled approach where we're only going to talk about the blueprint that we have on the table",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.853,
    "end": 2140.896,
    "text": " And blueprints are related to bridges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.961,
    "end": 2155.358,
    "text": "Or are there times where we want to bypass the blueprint and just say, um, you know, maybe look at the bridge and say, these two things look like they're this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.378,
    "end": 2157.922,
    "text": "Um, and then, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.022,
    "end": 2158.723,
    "text": "What do you think about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.947,
    "end": 2161.608,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2161.628,
    "end": 2167.577,
    "text": "Like, I guess there are some cases where you'd have to make sure, you know, that they're distinct, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.515,
    "end": 2174.441,
    "text": " especially when you're considering the things the blueprint can't really capture about the bridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.745,
    "end": 2178.006,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.466,
    "end": 2188.399,
    "text": "And in neuro and psychology, these come up, especially when classifying brain regions or when classifying different neurodiversities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.58,
    "end": 2195.708,
    "text": "One topic that Ollie's mentioned of the traces is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.857,
    "end": 2213.916,
    "text": " in the world this reminded me of bruno latour's work on actor network theory and ants and this is a very like proto-active approach it's all about resuming the task of tracing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.908,
    "end": 2228.365,
    "text": " And it's very provocative, and another, I think, provocative philosophical term in this space is always already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.206,
    "end": 2231.189,
    "text": "Like, these are just two English words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.309,
    "end": 2231.81,
    "text": "Come on now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.774,
    "end": 2244.426,
    "text": "The perception of phenomena by the mind of an observer, the features of phenomena that seem to precede any perception of it are said to be always already present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.376,
    "end": 2276.337,
    "text": " that is very provocative I believe or evocative it's like it was already that way so we're showing up in the stream of things potentially resuming the tracing of associativity in a map making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.055,
    "end": 2304.45,
    "text": " setting charles quick context definition of blueprint and bridge there i was being completely exoteric i really was talking about a civil engineering setting with people sketching out a blueprint like an architectural grounds plan about a bridge that like cars would drive over so compared to the actual bridge then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.953,
    "end": 2330.185,
    "text": " yeah and then a neuroscience setting you know we'd have we have the person's body is the territory okay and then yeah and then the blueprint would be some some you know chapter five like well here's how you know the elbow bone is connected to the knee bone but the body is a complex territory which is why so much has been written and explored on it indeed thank you yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.818,
    "end": 2353.843,
    "text": " cool bridge too right sorry go ahead and the body's a bridge and the body's body as map body as void you know this as that this already always as that like that's that's the fun um okay let's go to this question from andrew",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.792,
    "end": 2374.916,
    "text": " Okay, self talk is one of the topics or activities where map territory concerns apply any direct work or paper references on this topic, you could share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.747,
    "end": 2380.489,
    "text": "What do people think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.548,
    "end": 2399.401,
    "text": " And yeah, just to chime in, I mean, I just heard you say that along the way whenever we were discussing the fallacy there, and it just really piqued my interest.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2400.883,
    "end": 2412.298,
    "text": "But I mean, I can already imagine how that could play out as far as someone considering, you know, the self, the cognitive process of like they're attempting to map",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2412.7,
    "end": 2431.35,
    "text": " whatever it is that's going on with them, whatever it is they're directing their attention towards versus the territory that is an entire generative process going on that probably from an active inference framework, they're only gonna be able to kind of approximate in their own model of that territory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2431.735,
    "end": 2441.486,
    "text": " In any case, I just feel like I could get into an infinite regress here with just thinking of what's going on whenever I self-talk.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2442.568,
    "end": 2448.595,
    "text": "And I was curious if there was any published work here or anything along those lines.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2453.22,
    "end": 2454.722,
    "text": "I don't know of any.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.845,
    "end": 2464.105,
    "text": " published work on this I'm sure there are analyses on like self-reported self-talk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.958,
    "end": 2473.145,
    "text": " but it's something that is understandably hard to measure in flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.726,
    "end": 2478.731,
    "text": "And you get into all these kind of like recursive questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.791,
    "end": 2486.419,
    "text": "What have you remembered saying it to yourself, but you didn't in the moment, or you did say it in the moment, but you didn't remember it or tend to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.739,
    "end": 2486.899,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.922,
    "end": 2494.547,
    "text": "I, I mentioned it just because it is like the kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.232,
    "end": 2519.691,
    "text": " singularity of map and territory like okay let's just say that the that a cognitive activity is making maps so um just you know putting ourselves in the driver's seat not figure 9.1 not behavioral researcher but you could take that stance too but view from the inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.11,
    "end": 2547.366,
    "text": " we are making maps of our territory you know where our objects are in the room and all these other things and then that map re-enters through heard language and sub vocalized language so it is embodied action as well Ajith",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.017,
    "end": 2570.417,
    "text": " to myself talk do you mean like an inner monologue um I think I might be missing some context yeah yeah like stream of consciousness whether they just the the internal flow and imagination or even explicit self-coaching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.186,
    "end": 2588.911,
    "text": " I've seen a paper published where they use like FMRI data to predict what people's inner monologues are, if that might be something that could be some way of mapping out this territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.951,
    "end": 2601.45,
    "text": "Also what people are sort of imagining visually and also what they're listening, like what they're perceiving in terms of music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.325,
    "end": 2602.986,
    "text": " Things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.006,
    "end": 2614.642,
    "text": "I think, like the latest sort of deep learning models are actually getting sophisticated enough where they can be able to predict what people are intuiting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2616.284,
    "end": 2619.128,
    "text": "Just using like the right type of data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2623.935,
    "end": 2623.995,
    "text": "um."
  },
  {
    "start": 2627.148,
    "end": 2640.504,
    "text": " And just to say that very much is in line with the kind of thing i'd be interested in I guess bonus points that i'm interested in neuro imaging data, especially so I just shared is this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2641.706,
    "end": 2643.829,
    "text": "I can send some papers that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.609,
    "end": 2645.611,
    "text": "Actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2645.651,
    "end": 2650.797,
    "text": "yeah put them in here just follow the little token and then add them in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.857,
    "end": 2652.379,
    "text": "Oh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.169,
    "end": 2656.974,
    "text": " I just shared one, just to see if I could confirm with you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2657.294,
    "end": 2664.463,
    "text": "Is this at all in line with what you were referring to there, Ajit?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2664.543,
    "end": 2665.604,
    "text": "AJIT ACHARYA- Is it on the screen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.764,
    "end": 2666.465,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2666.485,
    "end": 2667.726,
    "text": "Yeah, that is .",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2678.019,
    "end": 2678.88,
    "text": "Quick Google search.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2679.22,
    "end": 2681.623,
    "text": "I'm trying to throw a self-check here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2682.16,
    "end": 2686.935,
    "text": " This is not the one I was referring to, but I can find the one I was referring to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.035,
    "end": 2688.118,
    "text": "I think it was like recent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.138,
    "end": 2688.78,
    "text": "It was like in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.8,
    "end": 2691.328,
    "text": "Oh, that's even better.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2692.13,
    "end": 2692.371,
    "text": "Great.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2692.411,
    "end": 2693.254,
    "text": "I really appreciate it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2693.354,
    "end": 2693.976,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2696.723,
    "end": 2724.402,
    "text": " wow yeah it's this is very I mean and to kind of return to chapter six like this is why we have a chapter six this is why unified approaches to perception cognition action matter this is why having an active inference ontology is important this is why having a recipe for making generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.787,
    "end": 2752.937,
    "text": " and having some of this meta theory or meta position on the relationship of map and territory fallacy and fallacy fallacy and fallacy cubed um because these are not just massively interactive and non-linear systems of interest they're also ones that were always already experiencing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.824,
    "end": 2780.224,
    "text": " So if it was just a Rube Goldberg machine, that would be one thing, but it still wouldn't even be of the type qualitatively of, without even going too deep into phenomenology and like experience and awareness, it just wouldn't necessarily be of the type",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.93,
    "end": 2806.347,
    "text": " that would be a recursive re-entrant cognitive system and this is why um i think the textbook ends with these lines important rights of passage in theoretical neurobiology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.272,
    "end": 2830.123,
    "text": " are trying to write down a generative model experiencing the frustration when simulations misbehave and learning from violations of your prior belief when something unexpected happens so it's like this isn't just a hot take like there's what can you say about some of these settings that's just like oh okay it's it's you don't just like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.027,
    "end": 2860.195,
    "text": " dropped the mic and like dust off your hands in this iterated generative modeling practice it's like especially if we're applying it to a setting like self-talk let's say or some other psychological phenomena um which you know impinges or overlaps on self-talk um you write down the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.575,
    "end": 2887.718,
    "text": " there's a recipe it's chapter six plus some of the other pieces that people have added in you write it down you roll it out you see what happens did you expect what happens well if you understand act inf and you made a simple example you may have you may expect get exactly what you expect back like well I made it I made an oscillating pendulum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.812,
    "end": 2910.482,
    "text": " and it did exactly that it's like great well that might be like a homework assignment for like a certain course but if we're interested in something with more richness than like a pendulum then when we unroll that generative model we will be surprised",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.222,
    "end": 2936.976,
    "text": " and then what do we do with surprise well we know there's two ways to bound it change mine change the world change your mind learn and update change the world re-enter change the generative model itself on the table so having a structured approach profession ontology methodology toolkit et cetera et cetera comes into play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.069,
    "end": 2953.389,
    "text": " And chapter six is kind of the transition point or like the fulcrum that the book is actually organized around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.409,
    "end": 2957.877,
    "text": "Chapters one through three get us to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.3,
    "end": 2963.648,
    "text": "Context, low road, high road, to or of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.11,
    "end": 2966.052,
    "text": "Chapter four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.993,
    "end": 2973.824,
    "text": " generative models themselves, chapter five, generative models in the mammalian neuroscience setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.186,
    "end": 2982.277,
    "text": "And then pretty much as soon as we can, chapter six, now it's us making that generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.639,
    "end": 2995.397,
    "text": "And even without extensive math or programming experience, we can start to address some of these questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.174,
    "end": 3002.898,
    "text": " And then we're already in the flow of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.908,
    "end": 3026.042,
    "text": "It can definitely feel like chapter four is like, well, chapters two and three can feel like waiting through like every single department of learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.355,
    "end": 3040.67,
    "text": " just to get to, and then chapter four can feel like getting through is like impossible slash improbable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.633,
    "end": 3052.063,
    "text": "All totally makes sense in terms of their evaluation and how they're experienced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.702,
    "end": 3078.49,
    "text": " but then like we break out on the other side of four just from a page Turner perspective in six and this is like such an incredible open conversation about modeling and these they're hard questions to talk about but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.208,
    "end": 3099.347,
    "text": " hopefully people can see that at the single entity or at the research group scale having alignment or shared reference frames around some of these topics are make or break",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.506,
    "end": 3117.148,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.188,
    "end": 3126.571,
    "text": "You can add and just, you know, add, make little sub pages or add your own question or just, you know, just the more references and the more things people add, the better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.611,
    "end": 3127.052,
    "text": "It's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.135,
    "end": 3128.356,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.376,
    "end": 3129.037,
    "text": "Yeah, I can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.579,
    "end": 3130.06,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.278,
    "end": 3165.092,
    "text": " One other piece I'll just add on this kind of map territory is that the digital introduces a very interesting setting that's kind of like a chessboard in the sense that it's fully observable and that these are virtualized settings where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.388,
    "end": 3188.953,
    "text": " strong concordances between maps and territories can be constructed to exist so like there can be a schema an abstract pattern or scheme that then generates the territory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.532,
    "end": 3200.264,
    "text": " In a we know, ultimately it's embodied through like thermodynamics and information all this so not but but to a first approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.324,
    "end": 3203.609,
    "text": "The digital systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.492,
    "end": 3208.836,
    "text": "have a different map territory relationship than.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.68,
    "end": 3212.241,
    "text": "birds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.875,
    "end": 3252.213,
    "text": " to the inner talk point, body's eye, this is just making things like inner talk is, is reentrance auditory action and perception, even though it doesn't go through the ear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.233,
    "end": 3263.532,
    "text": "I assume that these imaging studies ask the question, maybe even find the result that there's like activation of, of auditory processing or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.517,
    "end": 3267.979,
    "text": "Then we have visual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.068,
    "end": 3282.941,
    "text": " So those are internalized exteroceptive processes, inner eye, inner ear, inner touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.203,
    "end": 3293.512,
    "text": "But then like, do we have internalized interoceptive as well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.733,
    "end": 3299.518,
    "text": "Like, can we take an inner virtual view on something that's already inner?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.198,
    "end": 3311.086,
    "text": " And is that, you know, different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.008,
    "end": 3315.374,
    "text": "Where is it more or less relevant than self-talk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.641,
    "end": 3331.682,
    "text": "But if you could take an inner position on the interpretation of the self-talk, then I think we get into Andrew's infinite regresses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.783,
    "end": 3339.465,
    "text": " Yeah, I don't know.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3339.526,
    "end": 3350.886,
    "text": "It just brings up so many questions for me about how to conceptualize that one, because I mean, in a certain way, if someone were to engage in self-talk, I could view it as like they're",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3351.727,
    "end": 3364.55,
    "text": " If we view the self itself as like a kind of map that the person has constructed so you're you're you've taken your map and now you're making a map of your map, perhaps like analyzing it or.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3365.031,
    "end": 3376.03,
    "text": "Maybe you're just engaging in some kind of nested structure learning like Oh, let me revise my model of myself I don't know there's only.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3376.01,
    "end": 3388.019,
    "text": " I think, you know, some kind of more empirical work would need something a little bit more finesse than the way I'm talking about it right now, but it's very interesting ways it could go, I could imagine.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3391.387,
    "end": 3392.55,
    "text": "Yeah, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.399,
    "end": 3421.103,
    "text": " the system can't a system cannot just provide if it if it just represents everything then it's just a pass-through system there's no attention or distillation or representation just a straight pass-through so whether we're talking about ourselves or some other hypothetical system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.382,
    "end": 3449.605,
    "text": " the self-representation that it explicitly makes to itself is a sample or a selection or an attention distribute reallocation of something else like that's just like kind of light and dark like is it all equally lit and it's just a pass-through or is there going to be some area that is brought more into focus in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.268,
    "end": 3480.3,
    "text": " the re-presentation and then so what should be re-presented maybe that's where people have different um views obviously but there's the preference to have our re-presentation be amicable or like pleasant that's clearly one drive another drive is for meaning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.715,
    "end": 3505.073,
    "text": " all these different things and i think you recall somewhere earlier in the textbook uh tristan will the author say something about a an agent having a model of itself in order to differentiate itself from its environment i.e the generative process around it and how that may be an essential",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3506.858,
    "end": 3513.169,
    "text": " possibly an essential aspect, at least for certain entities in maintaining something along the lines of homeostasis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3513.269,
    "end": 3526.351,
    "text": "That is, if you don't have a sense of what you need and what you need to do, which is part of you, then potentially you dissipate, you know, to the entropic processes around you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3526.451,
    "end": 3531.6,
    "text": "So anyway, I don't want to keep us off here, but it's interesting, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3532.846,
    "end": 3533.407,
    "text": " It's fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.427,
    "end": 3539.196,
    "text": "Yeah, as usual, another great chapter six journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.997,
    "end": 3545.726,
    "text": "Chapter six is like an inflection point in the book and in how we approach things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.826,
    "end": 3558.887,
    "text": "So we will then, in the coming weeks with alternating times, head into chapter seven and eight on discrete and continuous time models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.238,
    "end": 3561.883,
    "text": " Chapter 9 on data-based analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.124,
    "end": 3564.448,
    "text": "Chapter 10, wrapping things up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.793,
    "end": 3568.376,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.396,
    "end": 3568.917,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.379,
    "end": 3570.941,
    "text": "Until next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.185,
    "end": 3573.265,
    "text": "Bye."
  }
]