[
  {
    "start": 4.874,
    "end": 8.139,
    "text": " Hello, everybody, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.499,
    "end": 11.824,
    "text": "Today, I am honored to be speaking with Professor Mark Soames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.405,
    "end": 22.539,
    "text": "Professor Soames is a neuropsychologist and psychoanalyst, best known for his discovery of the full brain mechanisms underlying dreams and his integration of psychoanalytic theories with modern neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.1,
    "end": 29.049,
    "text": "More recently, he's been focusing on active inference and what it might bring to bear on the hardest problem of them all, consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.79,
    "end": 31.653,
    "text": "Mark, thank you so much for joining me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.213,
    "end": 34.797,
    "text": "As I said in the introduction, it's a real honor and privilege.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.738,
    "end": 37.582,
    "text": " It's great to be here, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.602,
    "end": 38.384,
    "text": "Thanks very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.306,
    "end": 51.756,
    "text": "So yeah, I mean, you have been in the field of cognitive neuroscience for many decades, but I guess have only recently in the last 10 years or so have really taken an interest in active inference and seen, you know, as many people have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.36,
    "end": 66.842,
    "text": " I think when I read your book, The Hidden Spring, which is a wonderful read, and I think what I really liked about it, I've been looking, I'm very interested in the hard problem and trying to kind of see different perspectives with which we can take to approach the hard problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.584,
    "end": 71.269,
    "text": "And I've been looking for what I've been calling the synthetic a priori of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.83,
    "end": 80.123,
    "text": "And what I mean by that is, can we determine a function of cognition that needs to be conscious a priori?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.065,
    "end": 82.788,
    "text": " So for example, you could say attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.848,
    "end": 85.692,
    "text": "Well, I can imagine offline attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.993,
    "end": 89.178,
    "text": "I'm just sort of pinging around without it being online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.859,
    "end": 102.659,
    "text": "And I thought you got very close and I will not say determined, you know, I will not say in a determined fashion because David Chalmers will shouts at me, but I think you got very close with this notion that affect is a good candidate for what I would call the synthetic a priori of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.4,
    "end": 104.862,
    "text": "Now affect is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.466,
    "end": 107.57,
    "text": " can be seen as a kind of loose term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.83,
    "end": 120.914,
    "text": "So I think where we might want to start is just if you could give a kind of brief definition of what you mean by affect, because obviously, maybe what you and your pants up and basic emotion theory thinkers affect might differ from a constructionist account of affect and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.954,
    "end": 124.42,
    "text": "So maybe if we could just start laying down what affect is before we get to consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.783,
    "end": 126.304,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.824,
    "end": 134.692,
    "text": "Yes, that's a good point to start with because, as you say, different people do mean different things by that term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.813,
    "end": 143.582,
    "text": "So what I mean by affect is first, and not foremost, but first that it is valenced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.142,
    "end": 151.69,
    "text": "In other words, there's a goodness and badness to affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.67,
    "end": 168.696,
    "text": " Apropos of your opening remarks about a apraori synthetic function, I think I should mention that the goodness and badness of affect applies only to the subject of the affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.177,
    "end": 170.539,
    "text": "So it's good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.519,
    "end": 177.472,
    "text": " From my point of view, or bad from my point of view, it doesn't mean that it is objectively or universally good or bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.073,
    "end": 181.339,
    "text": "So an affective state is a valenced state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.519,
    "end": 183.342,
    "text": "It has goodness and badness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.963,
    "end": 194.282,
    "text": "The second, and perhaps this is the, when I said I don't want to say first and foremost valence, because perhaps this is the foremost characteristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.262,
    "end": 202.691,
    "text": " is that it is qualified, by which I mean it has a specific differentiated quality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.831,
    "end": 206.175,
    "text": "There are different affects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.195,
    "end": 217.907,
    "text": "So although all affects share the property of valence, of goodness or badness, each affect has its own unique quality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.887,
    "end": 235.939,
    "text": " I don't mean to say that they aren't intermediate forms of affect, but what I mean is that the feeling of hunger is qualitatively different from the feeling of thirst, is qualitatively different from the feeling of sleepiness, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.66,
    "end": 238.984,
    "text": "And this is important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.251,
    "end": 251.588,
    "text": " because you can't say I have currently 6 out of 10 of sleepiness and 6 out of 10 of thirst.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.008,
    "end": 259.398,
    "text": "Therefore, I have 12 out of 20 of total bodily need and all I need is sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.379,
    "end": 265.967,
    "text": "If you did that, you would reduce the common denominator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.947,
    "end": 293.372,
    "text": " uh the the continuous variable of need but you would die uh that is because uh sleepiness and thirst are not the same thing they are qualitatively different they are categorical variables so so that's for me uh the essential features of affect that they're valenced um which which implies they're subjective their valence is subjective and they are categorical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.352,
    "end": 296.657,
    "text": " qualitatively differentiated states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.359,
    "end": 299.221,
    "text": "Okay, that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.421,
    "end": 312.96,
    "text": "So I think before we get into the qualitative distinctions, because I, you know, people may have seen your debates with Lisa Feldman Barrett, and how deep that distinction runs was kind of a sticking point in your in your conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.041,
    "end": 315.104,
    "text": "Before we go there, we don't even necessarily need to go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.065,
    "end": 320.271,
    "text": "I think the really interesting point there is that good or badness is only good or badness for a subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.943,
    "end": 331.397,
    "text": " I've been thinking about this in terms of relevance or prioritization that whatever enters into the space of consciousness is always prioritized or relevant to the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.238,
    "end": 341.189,
    "text": "Now, I think there's a second question that I will come to about, are we not putting a cart before the horse by inferring the presence of an agent for whom something is good or bad?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.89,
    "end": 347.878,
    "text": "But before I go there, folding in something like salience, relevance, or priority, is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.314,
    "end": 355.284,
    "text": " built into the goodness or badness of the signal of the phenomenal state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.005,
    "end": 360.551,
    "text": "Or does it necessarily underlie or underwrite that phenomenal state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.136,
    "end": 372.008,
    "text": "The way I look on it is that the underlying category is a category of need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.889,
    "end": 375.132,
    "text": "You do not feel all your needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.398,
    "end": 400.528,
    "text": " so for example your need for energy resources is met by your constantly burning up the glucose deposited in your adipose tissues but you don't feel anything when that need is prioritized you then feel hunger",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.812,
    "end": 409.059,
    "text": " So the prioritization and the becoming conscious of the need are, I think, intimately bound up with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.6,
    "end": 426.394,
    "text": "And so what, therefore, does that say for this kind of synthetic a priori of consciousness insofar as if relevance or salience or priority, whatever you want to say, is it's difficult to imagine being conscious of something which is not in some way salient to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.976,
    "end": 429.857,
    "text": "Does that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.495,
    "end": 448.504,
    "text": " put that notion of salience, which I've been proposing that consciousness might be something like a relevance filter or a salience filter, would that make that function, that relevance function, more akin to this synthetic a priori of consciousness than affect per se?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.969,
    "end": 459.08,
    "text": " I think that the answer to that is bound up with what do we mean when we say we are prioritizing one need over another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.481,
    "end": 463.386,
    "text": "The prioritization is not an end in itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.947,
    "end": 465.929,
    "text": "It's a prioritization for action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.812,
    "end": 476.462,
    "text": "You can't do everything at once in terms of this prioritization imperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.482,
    "end": 478.525,
    "text": "And I'll explain what I mean by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.505,
    "end": 487.945,
    "text": " And it has everything to do with when you say an a priori synthetic function, it has everything to do with what function we are talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.406,
    "end": 496.463,
    "text": "So what I'm saying is that that function is not merely the function of need or the registration of a need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.443,
    "end": 516.561,
    "text": " uh it's the feeling of the need and what functionality is added by the feeling of the need has everything to do with the action bottleneck that i was talking about the prioritized need is felt so that you can monitor how well or badly you're doing in your attempts to meet that need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.541,
    "end": 521.188,
    "text": " The non-prioritized needs are relegated to automaticity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.428,
    "end": 539.376,
    "text": "The actions that you perform in relation to the non-prioritized needs do not have to be felt because they are being met or at least attempts are being made to meet them outside of consciousness by existing fixed policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.356,
    "end": 562.174,
    "text": " the prioritized need which is felt the the function of the feeling is precisely because you're in a state of uncertainty um the the the automaticity uh doesn't cut it automaticity is dangerous uh you because you don't know what to do so you're feeling your way through a novel situation or through an unpredicted situation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.154,
    "end": 571.077,
    "text": " And the feeling tells you whether what you're currently doing, the policy you're currently following, whether it's working or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.137,
    "end": 572.541,
    "text": "So it underwrites choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.604,
    "end": 578.256,
    "text": "It underwrites the possibility of changing your mind on the fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.236,
    "end": 589.106,
    "text": " And then, of course, learning from the experience, which results in the laying down of new predictions, which may in future be executed unconsciously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.648,
    "end": 593.258,
    "text": "It's sort of predictive work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.778,
    "end": 597.121,
    "text": " I suppose, is a good way of describing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.422,
    "end": 602.186,
    "text": "And I want to make explicit something in what I've just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.787,
    "end": 608.433,
    "text": "When I said that this underwrites choice, it means that it underwrites voluntary action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.913,
    "end": 615.42,
    "text": "So this is the mechanistic difference, in my view, between voluntary and automatic or autonomic action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.282,
    "end": 619.804,
    "text": "Okay, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.824,
    "end": 623.548,
    "text": "There are some things that I think we can fold in from an active inference perspective, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.608,
    "end": 631.577,
    "text": " you were talking about almost metacognitive monitoring of how well you're doing at minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.597,
    "end": 637.824,
    "text": "And that actually has been fleshed out in Active Inference as a Joffrely and Corricelli paper all the way back in 2013.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.185,
    "end": 646.795,
    "text": "But recently, people have been talking about aerodynamics, which is this awareness of how well you're doing at minimizing free energy over a span of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.216,
    "end": 649.198,
    "text": "And they have associated that with valence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.174,
    "end": 652.397,
    "text": " My question here is more therefore philosophical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.437,
    "end": 655.121,
    "text": "So it's not really pulling that apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.501,
    "end": 663.652,
    "text": "Although there might be some people who would encourage me to do so, but rather why couldn't that monitoring be done offline?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.514,
    "end": 669.46,
    "text": "So what is it about, then this really gets to the heart of this notion of a synthetic a prior of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.482,
    "end": 679.354,
    "text": "I can imagine in some sense, a robot in some thought experiment who was able to offline attribute goodness or badness to their experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.908,
    "end": 684.937,
    "text": " and use that in a functional manner to guide their expected free energy calculations, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.239,
    "end": 698.721,
    "text": "Is there something critical to experience per se, which makes it adaptive for these free energy minimizing systems and their metacognitive capacities to track their ability to minimize free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.883,
    "end": 701.205,
    "text": "Yes, I believe that there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.225,
    "end": 704.751,
    "text": "Before I explain why,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.068,
    "end": 724.208,
    "text": " I just want to flag maybe for later discussion, so I don't divert us from the question that you're, the line of questioning that you're currently following, that I'm not so sure that I would describe the mechanism that I just articulated as a metacognitive mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.66,
    "end": 725.682,
    "text": " mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.363,
    "end": 731.955,
    "text": "I think there's a difference between the feeling and what the feeling is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.296,
    "end": 745.723,
    "text": "In other words, there's a difference between the raw feeling, which is the registering of what's happening to your, in the terms that you were just using, to your free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.957,
    "end": 772.065,
    "text": " and um you're cognizing uh representing uh to use another language um what uh in in the context within which i'm feeling this uh what is causing me to feel this so sure yeah i certainly i certainly agree with that yeah i didn't mean to say in terms of metacognitive purely this notion that it can be done in some pre-reflexive non-conceptual non-representational manner purely this notion that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.518,
    "end": 784.175,
    "text": " there is at least embedded in phenomenal space, some self-referential, it could be very low level, like lived experience, I am doing well, I am doing badly, but it doesn't have to be a higher order narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.177,
    "end": 786.318,
    "text": "I'm doing well, I'm doing badly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.26,
    "end": 787.961,
    "text": "Okay, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.402,
    "end": 800.82,
    "text": "Now, to your question, you ask, why can't this function that I've just described as the mechanism of feeling, you're asking why can't it go on in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.222,
    "end": 806.43,
    "text": " Why is it necessary for it to be felt?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.071,
    "end": 817.226,
    "text": "So let me, if you'll just bear with me for a couple of minutes, let me unpack the mechanism in slightly more pedantic detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.488,
    "end": 829.525,
    "text": "We're talking about a self-organizing system which is intrinsically imbued with the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.517,
    "end": 840.358,
    "text": " the function that it must continue, what it does must maximize its chances of continuing to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.378,
    "end": 848.695,
    "text": "So that's a sort of, that's a starting point of any complex dynamical self-organizing system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.468,
    "end": 857.139,
    "text": " So there is a kind of intrinsic, I don't say kind of, there is an intrinsic intentionality in such a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.579,
    "end": 859.022,
    "text": "It's trying to achieve something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.062,
    "end": 861.765,
    "text": "I don't mean it's metacognitively trying to achieve something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.785,
    "end": 864.77,
    "text": "I just mean it has a goal-directedness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.811,
    "end": 867.173,
    "text": "Let me put it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.727,
    "end": 885.432,
    "text": " Now, I then said that the monitoring of how well or badly I'm doing, this valence function, that's what valence is, because it's just to the extent that what I'm doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.412,
    "end": 908.263,
    "text": " is moving me out of my viable balance is making me less likely to survive to and vice versa you know when it's moving me back towards my viable bonds that just is good or bad for the system but again i need to emphasize the point that i emphasized earlier it just is good or bad for the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.222,
    "end": 916.466,
    "text": " in Nagel's sense, it's good for the system and good to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.807,
    "end": 920.92,
    "text": "So it's not good or bad in any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.372,
    "end": 922.513,
    "text": " objective sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.974,
    "end": 925.777,
    "text": "It's good or bad only in a subjective sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.797,
    "end": 930.823,
    "text": "Now you're saying why can't that sort of monitoring be done in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.323,
    "end": 932.184,
    "text": "I'm saying it can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.565,
    "end": 945.76,
    "text": "That's why I made the point earlier about the difference between the continuous variable of total need or total free energy and the categorical variable of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.094,
    "end": 948.517,
    "text": " Which need am I talking about here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.618,
    "end": 952.403,
    "text": "Categorical variables just are distinguished qualitatively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.563,
    "end": 958.291,
    "text": "As I said earlier, thirst and sleepiness just are not the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.112,
    "end": 961.115,
    "text": "They are categorical variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.756,
    "end": 963.739,
    "text": "That means they're qualitatively different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.48,
    "end": 966.583,
    "text": "So what I've just described",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.833,
    "end": 971.881,
    "text": " is something which mechanistically is a felt state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.382,
    "end": 982.578,
    "text": "I'm saying from the point of view of the system, there is an existential variable called valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.818,
    "end": 987.205,
    "text": "In other words, this is good or bad for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.185,
    "end": 1015.757,
    "text": " uh for my continued existence whether or not this is metacognitively reflected it doesn't matter there is this thing which just is good or bad and just is subjective and it just is qualitatively differentiated so if you're saying that there's a certain function that the system has which is intrinsically subjective intrinsically valenced and intrinsically qualitatively distinguished",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.737,
    "end": 1017.481,
    "text": " I'm saying that is a feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.962,
    "end": 1020.307,
    "text": "So if you say, how can that go on in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.387,
    "end": 1021.389,
    "text": "I would say, what do you mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.111,
    "end": 1026.2,
    "text": "This intrinsically is something that is felt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.24,
    "end": 1029.607,
    "text": "That's a mechanistic description of what a feeling is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.208,
    "end": 1032.413,
    "text": "And I think that the crucial step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.697,
    "end": 1044.141,
    "text": " that needs to be identified there is that, is it justifiable to take the point of view of the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.582,
    "end": 1050.073,
    "text": "In other words, what is it that justifies one taking the viewpoint of the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.394,
    "end": 1053.54,
    "text": "And I hope you can see in what I said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.52,
    "end": 1058.588,
    "text": " in the intrinsically subjective nature of the things that I was talking about there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.968,
    "end": 1060.07,
    "text": "That justifies us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.511,
    "end": 1065.198,
    "text": "The selfhood of the system justifies us in taking the subjective point of view of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.238,
    "end": 1072.889,
    "text": "And if you do that from a subjective point of view, the mechanism I've just described just is a feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.929,
    "end": 1074.271,
    "text": "That's what we mean by a feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.832,
    "end": 1080.0,
    "text": "So I hope I've been plain and clear enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.79,
    "end": 1082.152,
    "text": " You have, well, you have been for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.252,
    "end": 1085.856,
    "text": "I mean, I'm familiar with these arguments of sort of intrinsic intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.876,
    "end": 1093.564,
    "text": "I mean, as you know, they go all the way back to Heidegger and this notion of taking a stance on your own being and the idea that it's kind of open-ended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.824,
    "end": 1098.009,
    "text": "We are naturally, as you say, directed towards this kind of open-ended futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.25,
    "end": 1106.038,
    "text": "And that gets fleshed out in, you know, I've recently just finished Evan Thompson's mind in life, and he is wonderfully clear on that about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.39,
    "end": 1112.257,
    "text": " this idea of kind of we sense make we the umwelt comes out of our own stance that we take upon the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.698,
    "end": 1124.052,
    "text": "I guess I still have a kind of residual charmers skepticism, which is does, and I think, therefore, it's necessary to get kind of clear on the axioms that you're taking here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.554,
    "end": 1131.862,
    "text": "Does taking an intentional stance on your own being require consciousness, maybe intense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.882,
    "end": 1134.345,
    "text": "Well, intentional is actually not necessarily the wrong word here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.106,
    "end": 1135.587,
    "text": "But I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.904,
    "end": 1138.607,
    "text": " can you have a self organizing complex dynamical system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.727,
    "end": 1140.97,
    "text": "And I think there's an interesting point here about the imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.49,
    "end": 1142.311,
    "text": "But I'll come back to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.551,
    "end": 1165.236,
    "text": "But can you have a complex self organizing system, which is auto poetic in the sense that it is intended towards its own self persistence, which need not be conscious, or at least conscious in the way that we think of a conscious as subjectively conscious, I can almost imagine that you have a non subjective consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.705,
    "end": 1166.186,
    "text": " i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.486,
    "end": 1182.304,
    "text": "an object of consciousness, if one could imagine such a thing, which might in some ways suit that self-organizing process because it gets rid of bias and overfitting your data and confirmation bias and all this other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.324,
    "end": 1187.931,
    "text": "I recognize we've gone slightly off the beaten track here, but I'm just wondering whether there's one thing that I'm missing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.971,
    "end": 1194.058,
    "text": "Maybe it's an axiom or maybe it's an argument, I'm not sure, about exactly why autopoetic self-organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.292,
    "end": 1195.994,
    "text": " entails subjectivity per se?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.156,
    "end": 1203.801,
    "text": "Well, let me start with an appeal to authority, which is not a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.762,
    "end": 1209.566,
    "text": "And then let me add a semantic point, which is not a good thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.907,
    "end": 1212.569,
    "text": "And then I'll answer your question properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.09,
    "end": 1222.999,
    "text": "The appeal to authority, I have to say, I was very pleased that Tom Nagel wrote a commentary on my book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.35,
    "end": 1227.256,
    "text": " Yeah, he wrote it in the Journal of Consciousness Studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.117,
    "end": 1242.377,
    "text": "And there he said, in relation to exactly the question you've just asked, that he thinks that it's a non-starter, the idea of an affective zombie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.397,
    "end": 1246.503,
    "text": "So he accepts that it cannot be an affective zombie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.324,
    "end": 1249.527,
    "text": "This is a non sequitur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.726,
    "end": 1251.027,
    "text": " But that's an appeal to authority.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.047,
    "end": 1263.098,
    "text": "I'm just saying no less a person with the nature of subjectivity, he says, he accepts that there cannot be an affective zombie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.118,
    "end": 1269.865,
    "text": "In other words, there cannot be a system equipped with the functionality that I've just described that is a zombie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.905,
    "end": 1272.948,
    "text": "Because if it were a zombie, it wouldn't have the functionality I've described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.968,
    "end": 1274.529,
    "text": "But that's just an appeal to authority.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.589,
    "end": 1276.611,
    "text": "Then there's the semantic point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.591,
    "end": 1286.605,
    "text": " I want to make clear that I'm talking about feeling and you asked me earlier about affect and you said different people use the word in different ways and they mean different things by it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.047,
    "end": 1295.116,
    "text": "I hope from my description of what I mean by the word, you can see why I use it synonymously with feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.498,
    "end": 1302.126,
    "text": "I like to use the word feeling when I'm discussing the issues that you're raising because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.595,
    "end": 1307.362,
    "text": " It just is an oxymoron to speak of a feeling that you don't feel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.464,
    "end": 1311.268,
    "text": "It's not a feeling if you don't feel it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.969,
    "end": 1316.856,
    "text": "And so the thing denoted by that word is the thing I'm talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1316.916,
    "end": 1321.383,
    "text": "Now, I said already that I accept that that's just a semantic point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.044,
    "end": 1326.19,
    "text": "But it leads to something more than a semantic point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.17,
    "end": 1337.767,
    "text": " When I say the thing I'm talking about is the thing denoted by the word feeling, therefore the thing I'm talking about cannot be unfelt because that's the thing I'm talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.267,
    "end": 1341.071,
    "text": "The thing I'm talking about is the thing that we call feeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.332,
    "end": 1344.276,
    "text": "Now, that leads me to the substantive answer to your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.037,
    "end": 1352.548,
    "text": "I really do believe that this question, as you formulated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.849,
    "end": 1363.869,
    "text": " I recognize, of course, as you formulated it, derived from or with reference to David Chalmers' formulation of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.672,
    "end": 1377.473,
    "text": "I don't think this question would ever have arisen if it wasn't for the fact that we were using, at the time that Chalmers wrote his famous paper and the book that followed it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.01,
    "end": 1386.443,
    "text": " and formulated this term, the hard problem of consciousness, we were using as our model example of consciousness, visual consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.526,
    "end": 1394.876,
    "text": "This was perhaps inevitable because consciousness is dominated by vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.537,
    "end": 1405.873,
    "text": "And it was perhaps because Francis Crick used it as his model example in his book,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.208,
    "end": 1407.31,
    "text": " What was it called?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.33,
    "end": 1412.04,
    "text": "The Astonishing Hypothesis, which came out one year before Chalmers' paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.362,
    "end": 1416.949,
    "text": "The thing is that I think that was the wrong place to start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.49,
    "end": 1424.284,
    "text": "That all of those questions arise only because vision is not an intrinsically conscious function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.264,
    "end": 1440.636,
    "text": " Even the highest of visual functionality, in other words, uniquely human cortical visual functions like reading with comprehension, can be done without consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.785,
    "end": 1453.613,
    "text": " So the question, why doesn't all this information processing go on in the dark without any inner field, which is to quote exactly the physiology that Chalmers used, I think that that's a legitimate question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.653,
    "end": 1460.127,
    "text": "And I can see why the puzzlement arises, because you can do exactly the same thing without consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.309,
    "end": 1462.651,
    "text": " So, you know, reading with comprehension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.732,
    "end": 1470.22,
    "text": "Why on earth do you ever, why does there have to be something it is like to read if the exact same thing can be done without there being something it's like to do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.82,
    "end": 1484.735,
    "text": "Now, you then, once you've got this puzzlement, then somebody like you, a reader of Chalmers, comes to my argument and says, well, why is it inconceivable that this thing couldn't be done by an affective zombie?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.255,
    "end": 1489.54,
    "text": "And I'm saying, well, that's a silly question because look at what I've just told you, you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.52,
    "end": 1517.215,
    "text": " i've told you what the function is i've told you that it is intrinsically subjective it's intrinsically existential it's intrinsically valence and it's qualitatively distinguished and if you describe such a mechanism which is necessarily registered by the system then you're describing a feeling so what do you mean it could be not felt it wouldn't be a feeling if it was not felt and i've told you what the feeling does you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.195,
    "end": 1521.08,
    "text": " And I guess I guess I need to be a little bit more philosophically robust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.1,
    "end": 1528.17,
    "text": "And it's come to mind here that one can take traumas is claims and that 95 paper and the book in multiple ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.75,
    "end": 1530.332,
    "text": "So one is why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.654,
    "end": 1533.617,
    "text": "Couldn't this functionality be done in the dark?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.318,
    "end": 1541.968,
    "text": "And I take and I agree, actually, the feeling a priori in and of itself, by definition has to be felt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.268,
    "end": 1543.59,
    "text": "So that's something that you can have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.212,
    "end": 1545.353,
    "text": " Which needs to be felt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.373,
    "end": 1564.197,
    "text": "So that, that notion of in the darkness doesn't really stand when it comes to affect another, the other part of David Chalmers, his argument is how do neural processes give rise to subjective states to what it feels like to be me or you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.078,
    "end": 1572.868,
    "text": "And I guess that is a different direction, which I presume you probably don't think there is an answer to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.118,
    "end": 1578.604,
    "text": " And I guess what that leads me back to is when I'm talking about the synthetic a prior consciousness, sure feeling gets us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.285,
    "end": 1587.013,
    "text": "I guess what I was saying is if we go, if we have the sort of view from nowhere, we can go back all the way to the art evolutionary start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.693,
    "end": 1590.416,
    "text": "And let's say we did start as non-conscious beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.077,
    "end": 1597.624,
    "text": "Why was it functionally adaptive for human beings to develop feelings in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.144,
    "end": 1614.954,
    "text": " If this metacognitive, non-representational, self-referential process became imbued with feeling, I'm not going to ask how that happened because no one knows, but I guess the question here is why did that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.277,
    "end": 1619.202,
    "text": "And that's when I say, well, couldn't it have happened in the dark?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.302,
    "end": 1622.127,
    "text": "Sure, feelings themselves can't happen in the dark per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.765,
    "end": 1632.564,
    "text": " But the function that feelings fulfill, namely this monitoring process, why did that have to evolve so as to contain qualia, subjectivity and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.585,
    "end": 1634.328,
    "text": "That's the kind of crux of the question, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.653,
    "end": 1643.406,
    "text": "I think either you're asking three questions or I've got three answers to your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.639,
    "end": 1673.494,
    "text": " i'm so i'm not so okay so i don't okay i think there's actually only one here one is okay so i'm not fussed about how i'm going to lose my train of thought i'm an old man so um if i haven't already lost it um yeah what i want to say first of all is the um mary uh the visual neuroscientist um if if if she were an affective neuroscientist uh if she were to describe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.643,
    "end": 1682.592,
    "text": " to know everything there is to know about the mechanism of feeling, it would necessarily predict that it feels like something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.753,
    "end": 1689.399,
    "text": "And she would know something about what it is like to have a feeling from the mechanistic account of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.64,
    "end": 1696.406,
    "text": "That's the first thing that you were saying in your question brought that answer to my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.446,
    "end": 1698.688,
    "text": "But I think you said you concede that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.158,
    "end": 1700.581,
    "text": " I'm not an interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.641,
    "end": 1701.402,
    "text": "I'm uninterested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.422,
    "end": 1704.427,
    "text": "I now I'm interested, but I was uninterested in the how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.609,
    "end": 1707.753,
    "text": "And I'll give you the feelings need to be felt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.793,
    "end": 1713.403,
    "text": "I guess my question is, evolutionarily, why does the function of feeling need to be felt?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.67,
    "end": 1713.991,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.672,
    "end": 1730.718,
    "text": "So that leads to, to get to that, I've got to go via a second thing that I heard you say, which is, you know, how does the physiological process cause the subjective feeling state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.219,
    "end": 1736.648,
    "text": "And there I have to make clear that I am a dual aspect monist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.309,
    "end": 1739.813,
    "text": "You may want to explain what that is for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.928,
    "end": 1741.23,
    "text": " Yes, I will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.973,
    "end": 1744.836,
    "text": "I'll put it very simply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.737,
    "end": 1752.307,
    "text": "When I wake up in the morning, before I open my eyes, I experience my existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.567,
    "end": 1756.013,
    "text": "I think to myself, I am Mark Psalms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.033,
    "end": 1757.114,
    "text": "Thank God I'm still alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.475,
    "end": 1758.156,
    "text": "That's my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.676,
    "end": 1759.317,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.078,
    "end": 1769.651,
    "text": "Then I stagger over to the bathroom and I look in the mirror and I see this body called Mark Psalms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.132,
    "end": 1774.418,
    "text": "And I say, there is further evidence that I still exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.498,
    "end": 1774.959,
    "text": "Thank God.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.88,
    "end": 1777.523,
    "text": "Now, please note both of those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.623,
    "end": 1778.864,
    "text": "I'm calling them Mark Psalms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.666,
    "end": 1782.81,
    "text": "In other words, these are two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.79,
    "end": 1789.922,
    "text": " two phenomenal, two appearances, two observational perspectives upon one and the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.624,
    "end": 1798.197,
    "text": "So there is the subjective being of Mark Solms that I experience mentally when I wake up before I open my eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.798,
    "end": 1807.954,
    "text": "And then there is the objective bodily thing called Mark Solms that I experience visually when I look at him in the mirror.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.934,
    "end": 1816.468,
    "text": " The dual aspect monist says these are not two different things, not two different ontological entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.729,
    "end": 1823.66,
    "text": "There's one underlying ontological entity, and that's called Mark-Solmes, which is an abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.061,
    "end": 1827.867,
    "text": "Then the question becomes, well, what stuff is Mark-Solmes made of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.847,
    "end": 1843.41,
    "text": " And I'm saying Mark Solms is made of a functional mechanism, which the one I was describing earlier is a self-organizing, therefore, in biological terms, a homeostatic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.211,
    "end": 1845.974,
    "text": "Homeostasis is a mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.054,
    "end": 1846.895,
    "text": "It's an abstraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.818,
    "end": 1855.508,
    "text": "We infer the underlying mechanisms from the observed data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.488,
    "end": 1867.271,
    "text": " when it comes to the apparatus of the mind, the thing that we are talking about here, which is also the apparatus of the brain, it's that apparatus that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.311,
    "end": 1873.804,
    "text": "It's the functional principles governing this part of nature that we infer from the two observables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.305,
    "end": 1875.167,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.232,
    "end": 1880.549,
    "text": " When it comes to, for example, memory, you know, you can have a memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.609,
    "end": 1882.234,
    "text": "That's the experience of a memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.077,
    "end": 1888.093,
    "text": "Or you can see optogenetically the neurons that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.31,
    "end": 1892.679,
    "text": " activated whilst you are having that same memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.719,
    "end": 1901.017,
    "text": "These are two perspectives upon one thing, which is an abstraction called the memory system or the function of memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.037,
    "end": 1908.192,
    "text": "So I think that that is the actual thing that we are studying in cognitive neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.172,
    "end": 1915.325,
    "text": " Although I don't like to call it cognitive neuroscience because that seems to exclude affective neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.345,
    "end": 1929.37,
    "text": "So the thing that we are studying in what we are, let's call it neuropsychology, which is a slightly less prejudiced word, in this mind and brain science, I think that the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.35,
    "end": 1940.352,
    "text": " The ultimate object of study of neuropsychology is things like the memory system, the perceptual system, the executive system and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.372,
    "end": 1945.502,
    "text": "We're trying to discern the laws, the underlying monistic laws",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.482,
    "end": 1953.979,
    "text": " governing this part of nature that we can observe from these two different perspectives, both the objective and the subjective one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.06,
    "end": 1959.21,
    "text": "Now, if I'm getting quite abstract... No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.691,
    "end": 1960.673,
    "text": "That was very useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.041,
    "end": 1980.366,
    "text": " To come back to the essential point, if that is the framework, the metaphysical framework within which I'm working, and we all have to when it comes to the mind-body relation, we have to adopt a metaphysical framework, and it's good that we are clear about which one we're adopting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.507,
    "end": 1981.748,
    "text": "That's the one I'm adopting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.269,
    "end": 1990.66,
    "text": "Within that framework, it doesn't make any sense to say, how did the physiological phenomenon cause the psychological phenomenon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.792,
    "end": 1996.598,
    "text": " Those two phenomena are dual manifestations of a single underlying cause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.939,
    "end": 2000.963,
    "text": "That underlying cause is the mechanism that I spoke of earlier, which explains them both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.805,
    "end": 2006.369,
    "text": "The free energy principle is such a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.869,
    "end": 2018.402,
    "text": "It's a principle which governs both how we feel and what brain arousal mechanisms we observe physiologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.382,
    "end": 2027.513,
    "text": " In other words, what you see with your eyes and what you feel with your feelings are both manifestations of that single underlying mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.593,
    "end": 2034.701,
    "text": "So to say, how does the brain process cause the feeling is to ask the wrong question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.282,
    "end": 2041.369,
    "text": "It's to ask a question that assumes a metaphysical relationship, which I think is the wrong assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.869,
    "end": 2047.596,
    "text": "It's like saying, if I look with my eyes, I see a flash of lightning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.576,
    "end": 2061.07,
    "text": " if I listen with my ears, I hear a clap of thunder and I ask the question, how does that visual thing, the flash of lightning, cause that auditory thing, the clap of thunder?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.691,
    "end": 2076.587,
    "text": "It's to misunderstand that they're actually both caused by a geo-electrical event, which we describe abstractly using the laws of physics, using the language of physics or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.922,
    "end": 2080.266,
    "text": " ultimate forces, that kind of language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.286,
    "end": 2085.732,
    "text": "It's not something that you observe, it's the mechanism, the thing that you infer that underlies it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.513,
    "end": 2094.582,
    "text": "So when you're saying you're wanting to know how, I'm saying I have answered you how when I described to you what the mechanism is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.343,
    "end": 2102.811,
    "text": "And very importantly, I need to make this clear, the mechanism I described to you, the mechanism of feeling that is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.791,
    "end": 2108.642,
    "text": " which you can observe from two observational perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.983,
    "end": 2119.763,
    "text": "In other words, you can observe brain arousal processes and you can observe subjectively feelings, that these are both manifestations of a single mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.803,
    "end": 2121.947,
    "text": "That's the one that I described to you, and this is the important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.18,
    "end": 2134.85,
    "text": " said very importantly, it also explains why this mechanism has two perceptual surfaces, why it has two perceptual perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.95,
    "end": 2138.839,
    "text": "It explains why such a mechanism has a subjective perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.819,
    "end": 2144.267,
    "text": " Because not everything, everything geometrically has a subjective perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.287,
    "end": 2154.141,
    "text": "In other words, you can say there is such a thing as the perspective of being a cup or being a table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.702,
    "end": 2158.587,
    "text": "But that doesn't mean that there is something it is like to be a cup or to be a table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.968,
    "end": 2168.742,
    "text": "So I'm saying the mechanism I've described, which is a mechanism which does not exist, does not explain the behavior of cups and tables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.722,
    "end": 2172.127,
    "text": " is why there is nothing it is like to be a cup or a table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.628,
    "end": 2184.146,
    "text": "So remember that the underlying monistic ontological entity that we are studying is that mechanism which we can study both objectively and subjectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.226,
    "end": 2189.495,
    "text": "And I've described why this particular mechanism has a subjective aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.975,
    "end": 2196.045,
    "text": "Now to come to what I understood to be the third part of or third aspect of your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.582,
    "end": 2199.586,
    "text": " which is a sort of an evolutionary question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.967,
    "end": 2202.391,
    "text": "You're saying, why did this happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2202.431,
    "end": 2204.193,
    "text": "What functionality is added?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.095,
    "end": 2209.501,
    "text": "What is gained by this that couldn't go on in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.541,
    "end": 2213.327,
    "text": "I've already explained why I believe that mechanism can't go on in the dark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.988,
    "end": 2216.672,
    "text": "Now I want to explain what it adds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.793,
    "end": 2224.463,
    "text": "It is, in fact, I have in a way already explained it, but let me articulate it in a slightly different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.05,
    "end": 2233.282,
    "text": " Let's say an organism, because we're talking about living things here, but there's another question as to whether they necessarily have to be living things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.742,
    "end": 2240.953,
    "text": "But we could say a system, but let's just say a biological system, an organism, which has needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.894,
    "end": 2249.886,
    "text": "In other words, it has its own biologically viable states, and it has to remain within those states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.926,
    "end": 2254.332,
    "text": "In other words, it's an organism which functions homeostatically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.312,
    "end": 2259.358,
    "text": " It needs predictions as to how to satisfy those needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.398,
    "end": 2264.084,
    "text": "In other words, how to return to homeostasis when it's deviating from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.525,
    "end": 2266.507,
    "text": "And we are born with such predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.068,
    "end": 2269.571,
    "text": "Us living things have innate predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.972,
    "end": 2271.594,
    "text": "Those are called reflexes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.114,
    "end": 2274.778,
    "text": "Those precisely are our autonomic functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.378,
    "end": 2278.362,
    "text": "So when I...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.342,
    "end": 2285.938,
    "text": " I have a constant need to balance my blood gases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.299,
    "end": 2290.849,
    "text": "There's a balance between oxygen and carbon dioxide that's viable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.048,
    "end": 2292.269,
    "text": " for a human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.73,
    "end": 2298.235,
    "text": "And I have a very simple way of meeting that need, which is that I breathe automatically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.136,
    "end": 2304.982,
    "text": "My intercostal muscles expand my diaphragm, that sucks in oxygen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.662,
    "end": 2313.77,
    "text": "And then there's the relaxing of those muscles, and that expels carbon dioxide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.19,
    "end": 2318.895,
    "text": "And there is actually a need detector in your hypothalamus, if you want to describe this mechanism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.179,
    "end": 2324.746,
    "text": " anatomically, which is constantly monitoring oxygen, carbon dioxide, oxygen, carbon dioxide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.027,
    "end": 2334.058,
    "text": "But there's one prediction as to how to maintain the viable balance, and that is this autonomic breathing mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.599,
    "end": 2338.003,
    "text": "Now, why do we ever become conscious of our need to breathe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.123,
    "end": 2340.967,
    "text": "I know you are now becoming conscious of it because I'm talking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.508,
    "end": 2343.33,
    "text": "Normally, you're not conscious of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.31,
    "end": 2347.075,
    "text": " In other words, what is added by becoming conscious of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.575,
    "end": 2361.792,
    "text": "So imagine an organism equipped with the need I've just described and with the reflexive prediction, the innate prediction, the fixed innate instinctual prediction as to how to meet that need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.133,
    "end": 2367.499,
    "text": "That's fine until you place such an organism in an unpredicted environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.559,
    "end": 2370.803,
    "text": "In other words, something not predicted by natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.783,
    "end": 2379.333,
    "text": " In other words, not the default environment for which this prediction is an appropriate one, the one that you should just breathe at a regular rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.734,
    "end": 2384.379,
    "text": "In other words, for example, what happens if you're in a carbon dioxide filled room?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.06,
    "end": 2388.825,
    "text": "You're no longer in the usual default environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.165,
    "end": 2393.811,
    "text": "You're in a burning building and the room is full of carbon dioxide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.831,
    "end": 2397.195,
    "text": "At that point, you become conscious of your need to breathe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.58,
    "end": 2400.845,
    "text": " this is the why question that you're asking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.925,
    "end": 2404.39,
    "text": "Why do you become conscious of your need to breathe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.75,
    "end": 2407.834,
    "text": "It's because now you're in a state of uncertainty as to what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.575,
    "end": 2412.881,
    "text": "Your reflex autonomic prediction doesn't cut it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.542,
    "end": 2416.386,
    "text": "So you behave stochastically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.027,
    "end": 2418.97,
    "text": "You're in a state of distress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.092,
    "end": 2422.575,
    "text": "You're suffering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.825,
    "end": 2430.158,
    "text": " a suffocation alarm or respiratory distress or air hunger, it goes by various names.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.599,
    "end": 2444.023,
    "text": "And why it comes to consciousness as a feeling is because as you randomly go upstairs trying to do something other than your instinctual, your normal reflexive action, it feels worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.003,
    "end": 2463.868,
    "text": " uh and so that was the wrong decision uh it was a bad choice to go upstairs and this and and the organism registers it in the form of this feeling of suffocation is getting worse so you change your mind and you go downstairs instead and there you get the enormous relief of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.848,
    "end": 2467.794,
    "text": " feeling better, being able to breathe the oxygen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.814,
    "end": 2472.12,
    "text": "So that feeling has guided your voluntary action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.18,
    "end": 2476.406,
    "text": "In fact, has made possible what we call voluntary action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.007,
    "end": 2483.737,
    "text": "It's not just random behavior because your existing prediction doesn't cut it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.358,
    "end": 2487.783,
    "text": "What you do is, as I said earlier, predictive work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.843,
    "end": 2491.088,
    "text": "In other words, you actually feel your way through the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.068,
    "end": 2494.872,
    "text": " and come up with a new prediction, which you then lay down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.333,
    "end": 2497.435,
    "text": "That is the adaptive advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.535,
    "end": 2513.512,
    "text": "That is what is evolutionarily added by this extended form of homeostasis, in which you don't just have some sort of automatic regulator that keeps you within your viable bounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.853,
    "end": 2515.995,
    "text": "You have, in addition to those automatic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.975,
    "end": 2526.417,
    "text": " regulators, you have a further mechanism, which kicks in when the automatic regulator isn't working, because you're not in the environment that it expects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.018,
    "end": 2536.077,
    "text": "And it enables you to navigate that novel, unpredicted, uncertain environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.057,
    "end": 2544.366,
    "text": " What I've just said is one of the reasons why I say that consciousness is felt uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.967,
    "end": 2550.493,
    "text": "That's a pithy way of describing what it actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.854,
    "end": 2554.698,
    "text": "But I hope that I've answered your question there by saying what it adds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.38,
    "end": 2562.807,
    "text": "It adds the ability to survive in unpredicted novel environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.107,
    "end": 2578.163,
    "text": " Prior to the evolution of this mechanism, this extended form of homeostasis, this subjective form of extension of homeostasis, what would have happened is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.21,
    "end": 2590.647,
    "text": " If you have a population of the organisms, the hypothetical organisms I'm talking about, they all have this stereotyped fixed prediction as to what to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.108,
    "end": 2604.066,
    "text": "If they find themselves in a novel situation because of the innate variation in the genome, some of them will do the right thing and some of them will do the wrong thing in their random sort of thrashing about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.046,
    "end": 2612.579,
    "text": " The few that do the right thing will then pass on that adaptation to the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.88,
    "end": 2620.992,
    "text": "In other words, the next generation, when they find themselves in this, what was previously a novel situation, it will not be a novel situation for the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.41,
    "end": 2625.616,
    "text": " The functionality that I've described supersedes that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.796,
    "end": 2633.667,
    "text": "That is the mechanism of natural selection whereby over generations, the predictions are improved by natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.308,
    "end": 2648.548,
    "text": "The functionality I've described enables the organism within its own lifetime to improve its predictive model in radically uncertain circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.524,
    "end": 2673.253,
    "text": " thereby to survive and reproduce there's a lot there um so i want to start by being philosophically skeptical and therefore annoying and say that i still think that this is resting on an axiom that for example consciousness is there for unpredictability because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.942,
    "end": 2685.392,
    "text": " I still can't see why, in principle, natural selection couldn't have endowed us with just a very good monitor of what to do in uncertain circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.752,
    "end": 2695.701,
    "text": "So I can't imagine why a zombie, a philosophical zombie, wouldn't be able to recognize as I go up the stairs, there's more smoke, it's getting worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.382,
    "end": 2697.462,
    "text": "Oh, let me go downstairs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.043,
    "end": 2703.848,
    "text": "And this is just, you can just keep fleshing out and having recursive iterations on the mechanism before it needs to come on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.925,
    "end": 2706.427,
    "text": " and become online matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.087,
    "end": 2734.898,
    "text": "And so the way that I thought about it, just to sort of put my cards on the table, because I've been acting cryptic, is I wonder whether I wonder whether consciousness acts as a coarse grained representation that allows for speed and manageable data compression and engenders manageable data compression, such that we cannot, we can't, in principle, attend to every single data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.232,
    "end": 2736.413,
    "text": " sources out there in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.354,
    "end": 2745.481,
    "text": "But what consciousness allows us to do is to compress the data that is in the world into something one that's prioritized, and two that can be acted upon in a fast manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.682,
    "end": 2751.486,
    "text": "Whether this is in predictable, unpredictable circumstances, and often it will need to be done in unpredictable circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.167,
    "end": 2765.138,
    "text": "But the pure notion that consciousness is unpredictable, is therefore unpredictable circumstances, I don't think can skirt the problem or the contention that hypothetical, we can never run the counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.708,
    "end": 2769.839,
    "text": " But there is a hypothetical counterfactual where all of this is being done offline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.859,
    "end": 2778.823,
    "text": "You just have a very adaptive sensor in the hypothalamus, let's say, who doesn't need an online self model to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.597,
    "end": 2806.988,
    "text": " recognize any signal in some phenomenal way so that's that again i didn't feel we need to go down this rabbit hole um well you have articulated your view i will just say something very briefly about it which is that that is in in in essence and i'm i'm sorry to be so reductionist about you the subtleties in what you've just said but it is in essence a attentional mechanism that you've described",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.968,
    "end": 2809.752,
    "text": " And I'm saying that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.932,
    "end": 2812.015,
    "text": "I spoke earlier about prioritization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.356,
    "end": 2814.479,
    "text": "So that's built into what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.32,
    "end": 2819.326,
    "text": "But it's not just any old attentional mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.767,
    "end": 2823.752,
    "text": "It's attention to my homeostatic state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.153,
    "end": 2827.658,
    "text": "In other words, to my deviation from my viable bounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.999,
    "end": 2830.122,
    "text": "It's not attention to anything in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.482,
    "end": 2832.545,
    "text": "In other words, just unpredictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.585,
    "end": 2834.528,
    "text": "I'm saying, no, it's not just unpredictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2834.508,
    "end": 2863.772,
    "text": " its unpredictability as to how to satisfy this need in other words it's a certain kind of unpredictability for a certain kind of system i think that that is the ground zero of feeling that is how it comes into existence so it is by the mechanism you describe but only applied to a particular part of nature and not not to everything in the universe that's that's very useful i've actually just written this paper uh with the help of carl and lance da costa about sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.36,
    "end": 2876.199,
    "text": " eliding the endogenous exogenous attention distinction within active inference by saying that attention is basically as we've been speaking about a priority filter, but always for the sense making organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.04,
    "end": 2886.655,
    "text": "And inactive inference, you can say, well, and then you flesh out and say, well, the deepest, most precise preferences are encoded at the deepest level of the generative hierarchy, hence why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.327,
    "end": 2915.427,
    "text": " don't care where my phone is when i'm suffocating for example because the preference i have my phone is far less precise and far higher than um that is exactly how i see it yep yeah okay so so i wanted to ask you said something about so we have dual aspect monism that we can describe two phenomena we can take two perspectives on a phenomena like memory for example we can think of the hippocampus and we can also think of what it is like to have a memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.896,
    "end": 2924.524,
    "text": " And you said that what the real target of cognitive neuroscience or neuropsychology should be is the single mechanism that underlies both of those perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.564,
    "end": 2928.968,
    "text": "And you preferred the active inference or the free energy principle might be one of those mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.189,
    "end": 2937.196,
    "text": "I wonder whether this was relating to what people talk about in active inference as a dual information geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.796,
    "end": 2939.718,
    "text": "And what that is, is for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.778,
    "end": 2943.302,
    "text": "And I spoke to Vanya Visa about this actually yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.322,
    "end": 2944.823,
    "text": "So the podcast should be out before this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.275,
    "end": 2946.296,
    "text": " So people can go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.717,
    "end": 2956.207,
    "text": "But the idea is that we have an intrinsic geometry, which looks at how the actual internal states of the Markov blanket evolve over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.227,
    "end": 2964.436,
    "text": "And then we have the extrinsic geometry, which is what how they are manifesting variational beliefs about the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.997,
    "end": 2972.785,
    "text": "And one is kind of one you can kind of view as if you wanted to take a metaphysical stance or a phenomenal stance, one is the view from within and one is the view from without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.237,
    "end": 2978.583,
    "text": " I wonder whether that dual aspect fits quite nicely onto your dual aspect monism or whether you thought about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.564,
    "end": 2983.588,
    "text": "Yes, what you're saying intuitively appeals to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.77,
    "end": 2989.955,
    "text": "When you say, have you thought about it enough for precisely 10 seconds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.335,
    "end": 2993.378,
    "text": "And it intuitively appeals to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.398,
    "end": 2999.925,
    "text": "There's a paper called Markovian Monism, which is by Vanya Vista and Karl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.005,
    "end": 3001.347,
    "text": "So that's where this is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.867,
    "end": 3002.468,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.224,
    "end": 3007.909,
    "text": " I just wonder, I spoke to Vanya about this yesterday and I said, what are the metaphysical consequences for this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.929,
    "end": 3020.221,
    "text": "Before we move on, may I just say there's something about because now I'm remembering that paper and I'm remembering what I thought when I read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.802,
    "end": 3028.81,
    "text": "I think that there is something special about precision optimization in relation to what you're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.79,
    "end": 3036.775,
    "text": " in that the precision assigned to the incoming error signal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.008,
    "end": 3048.721,
    "text": " in relation to the outgoing prediction is assigned by the system to that message passing, as it were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.162,
    "end": 3059.613,
    "text": "So I think that there's a special place for precision optimization in the story that you just described there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.394,
    "end": 3061.075,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.175,
    "end": 3063.117,
    "text": "I mean, in terms of the paper that I just wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.316,
    "end": 3076.795,
    "text": " that's exactly it in terms of a more like in terms of a technical base graph POMDP schema, what we're saying here is that sort of higher order preferences govern precision weighting over what's called the likelihood matrix, the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.135,
    "end": 3082.683,
    "text": "And that's kind of been, you know, Feldman and Friston and then later papers have proposed that that really is what attention is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.723,
    "end": 3084.285,
    "text": "It's optimizing that precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.726,
    "end": 3084.946,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.986,
    "end": 3086.328,
    "text": "And that means that we're not, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.009,
    "end": 3089.352,
    "text": "No, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.372,
    "end": 3090.133,
    "text": "Only to add that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.367,
    "end": 3094.792,
    "text": " I think a really critical point that I really want to stress in that paper is that that's not just precision per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.812,
    "end": 3102.782,
    "text": "So precision, I take to be a very strict mathematical construct in inverse entropy, or inverse covariance, whatever you want to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.822,
    "end": 3114.096,
    "text": "But not all signals which are given a gain, you know, extra gain, synaptic gain, or given attention are only those which are precise, ie, which have a clear cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.877,
    "end": 3119.563,
    "text": "Rather, we govern our attention is governed fundamentally by our goals, even if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.847,
    "end": 3122.691,
    "text": " that the object of attention isn't necessarily precise, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.711,
    "end": 3124.974,
    "text": "It can be very ambiguous, but it's very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.014,
    "end": 3128.238,
    "text": "I pay attention to whether my garden hose is a garden hose or a snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.679,
    "end": 3131.703,
    "text": "And that will also be affected for whether I'm in London or whether I'm in Sydney.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.264,
    "end": 3140.535,
    "text": "So just to add that, I think people, it's really important to distinguish attention, precision and precision waiting as free individual constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.555,
    "end": 3143.319,
    "text": "Yes, that makes good sense to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.44,
    "end": 3146.563,
    "text": "Um, so I, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.948,
    "end": 3151.141,
    "text": " I'll put it in more sort of everyday terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.824,
    "end": 3155.355,
    "text": "Yeah, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.538,
    "end": 3171.342,
    "text": " it has to do, because remember, I was saying it's a particular type of system, and that's another way of saying what you're saying, that if things, with respect to the precision over my policies, if things are turning out as expected, that's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.043,
    "end": 3173.825,
    "text": "If uncertainty prevails, that's bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.326,
    "end": 3179.554,
    "text": "And so, you know, this is why it is good to have confidence in your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.534,
    "end": 3184.727,
    "text": " in your policies because it will result in good feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.114,
    "end": 3187.555,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.537,
    "end": 3188.778,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.44,
    "end": 3192.748,
    "text": "No, but I gathered that you wanted to move on to another topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.37,
    "end": 3196.598,
    "text": "Well, yeah, I mean, actually, just in reference, I like making sure that people know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.135,
    "end": 3200.04,
    "text": " I kind of feel like I should let people know where they can go to read all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.06,
    "end": 3205.348,
    "text": "So just in terms of the precision over your policies, this is known as the gamma parameter in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.388,
    "end": 3213.621,
    "text": "And if people want to read about that Casper Hesp's 2021 paper is a really good place to start where he talks about valence in terms of this gamma precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.182,
    "end": 3214.502,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.056,
    "end": 3219.841,
    "text": " Yes, I saw I watched your two conversations with Lisa Feldman Barrett and greatly enjoyed them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.442,
    "end": 3227.91,
    "text": "And yeah, I thought they were really fascinating and a very novel way of doing scientific discussion because normally it's very angry and on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.411,
    "end": 3238.221,
    "text": "I thought really interesting thing that came up, although it was only really briefly touched upon was kind of the distinction between interception and extra reception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.402,
    "end": 3244.067,
    "text": "And I found that I've never really thought that it could potentially be quite a blurry line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.604,
    "end": 3255.361,
    "text": " But I feel like Lisa was keen to say that some of the things that you were proposing were fundamentally extra receptive, ie a pinprick or something like that could also be construed as inter receptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.302,
    "end": 3259.347,
    "text": "So if we say, okay, let's take the pinprick example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.308,
    "end": 3261.41,
    "text": "And let's talk about affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.45,
    "end": 3268.281,
    "text": "So you're not I if I say that if I'm correct, you wouldn't believe that all affects this fundamentally inter receptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.461,
    "end": 3270.544,
    "text": "Is that a fair play for that thing to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.811,
    "end": 3273.197,
    "text": " Oh, yes, I absolutely disagree with that view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.217,
    "end": 3286.693,
    "text": "But slightly comically, in relation to the discussion with Lisa Feldman Barrett that you're referring to, that was the starting point of that discussion was that I said I disagree with her and Neil Seth in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.673,
    "end": 3290.738,
    "text": " in their associating affect with interception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.119,
    "end": 3297.367,
    "text": "For them, interception is affect and extraception is this other form of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.387,
    "end": 3300.431,
    "text": "Remember, to them, affect is just a modality of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.451,
    "end": 3302.313,
    "text": "It's an interceptive modality of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.353,
    "end": 3304.176,
    "text": "And I was saying, no, I don't agree with that at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.556,
    "end": 3305.497,
    "text": "I don't think that it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.798,
    "end": 3307.5,
    "text": "And then I used the example of pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.48,
    "end": 3313.405,
    "text": " And I said, what could be more extra receptive, you know, than this thing is from the outside being stuck into my finger?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.046,
    "end": 3320.272,
    "text": "Or a fright, you know, there's something happens out there in the world and that thing out there in the world startles me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.332,
    "end": 3322.214,
    "text": "So it's extra receptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.234,
    "end": 3326.798,
    "text": "And so I was saying affect clearly is not extra receptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3326.818,
    "end": 3334.165,
    "text": "Then she got into these gymnastics that you're referring to and saying, well, you know, if you do this, then a pinprick is interoceptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.205,
    "end": 3335.766,
    "text": "And I'll say, well, fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.746,
    "end": 3339.09,
    "text": " you know, if you do this, then that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.35,
    "end": 3349.783,
    "text": "But to me, the crucial thing is that it's neither the extraceptive stimulus nor the intraceptive stimulus that is felt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.084,
    "end": 3352.847,
    "text": "In other words, I don't believe the feeling is the perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.449,
    "end": 3358.594,
    "text": "I believe that the feeling is the homeostatic deviation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.695,
    "end": 3360.657,
    "text": "Homeostats are not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.637,
    "end": 3364.121,
    "text": " They are not interoceptive or extraoceptive, they're both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.541,
    "end": 3378.757,
    "text": "They are registering a configuration which it infers, this is bad for me or this is good for me, in relation to the particular category of need that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.458,
    "end": 3389.749,
    "text": "So I don't think you and Lisa would necessarily disagree on that if I listened to that conversation correctly, because I think she was keen, and I guess it's a fundamental part of her theory, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.134,
    "end": 3406.492,
    "text": " There isn't necessarily meaning in the data signal itself, and it's only in its collision with the prediction that we get in Bayesian terms, a posterior, which relates to our actual fundamental prior and that divergence is what you might call affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.133,
    "end": 3408.013,
    "text": "So I can disagree on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.934,
    "end": 3418.605,
    "text": "Can I just make clear that because these disagreements with Lisa, I think are very important for the future of our field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.99,
    "end": 3421.954,
    "text": " By which I mean affective science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.495,
    "end": 3423.956,
    "text": "That's the field I'm talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.997,
    "end": 3439.136,
    "text": "What I share with Lisa is an interest in the fundamental nature of affect or what she calls emotion, because as you said at the beginning, affect and emotion and so on, these words are used differently by different people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.557,
    "end": 3441.96,
    "text": "For her, affect does not have quality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.193,
    "end": 3450.444,
    "text": " It has valence and arousal, but it is not categorically distinguishable in its intrinsic nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.746,
    "end": 3460.037,
    "text": "So you're quite right in everything you just said there that she and I don't differ in the things that you just said there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.578,
    "end": 3471.593,
    "text": "But for me, the crucial point, and you can see in relation to everything that I've said to you already why it's crucial, is that I think that the starting point is that those homeostats are innate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.045,
    "end": 3477.232,
    "text": " You know, that we are born with categorically distinct homeostats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.793,
    "end": 3490.01,
    "text": "And I won't repeat everything I said earlier, but it is from those homeostats that ultimately the quality of feeling arises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.43,
    "end": 3493.214,
    "text": "When I was saying thirst feels different from hunger and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.254,
    "end": 3495.717,
    "text": "And remember, I'm saying these are not only interceptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.757,
    "end": 3499.082,
    "text": "The fright feels different from pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.062,
    "end": 3518.286,
    "text": " uh these are extra receptive pain to me pretty obviously when you stick something in from the outside it's extra receptive it's part of the somatosensory system you know this is one of the classical extra receptive senses um so the the homeostat um the the the the detection of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.266,
    "end": 3530.121,
    "text": " this particular pattern of extraceptive and intraceptive signals, this is a deviation from this category of need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.742,
    "end": 3541.316,
    "text": "And if you prioritize that deviation, in other words, this is the one that I'm going to now, I'm going to, this is the most salient category of need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.097,
    "end": 3546.923,
    "text": "This is the one where I'm going to palpate my uncertainty as I act in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.903,
    "end": 3551.829,
    "text": " This is, in other words, the one that I'm going to, that is now going to govern my voluntary behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.69,
    "end": 3563.403,
    "text": "The quality of the feeling that governs that action cycle is going to arise from the category of need that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.423,
    "end": 3564.764,
    "text": "In other words, from the homeostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.265,
    "end": 3569.57,
    "text": "Her view is that there are no innate categories of emotion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.051,
    "end": 3572.233,
    "text": "And I've just explained why I don't agree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.293,
    "end": 3575.357,
    "text": "That, I think, is the fundamental difference between her and me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.978,
    "end": 3579.062,
    "text": " And that's what I felt was, that's what I felt was the fundamental difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.262,
    "end": 3591.556,
    "text": "And just so I can get clarity for myself, is your view that there is a strict mapping, at least numerically, between the number of homeostats and the number of basic categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.497,
    "end": 3599.125,
    "text": "So is there a homeostat for well, these are the panc sepi and basic emotion, you know, is there a homeostat for seeking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.145,
    "end": 3601.868,
    "text": "Is there a homeostat for rage or lust or whatever?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.489,
    "end": 3608.539,
    "text": " I do believe that there's a homeostat for each one of those, what he calls basic emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.36,
    "end": 3625.847,
    "text": "But I need to make clear that those, what he calls basic emotions, are not the sum total of the basic homeostatic need mechanisms that are at work in the human or mammalian, or for that matter, vertebrate organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.131,
    "end": 3643.37,
    "text": " Many of the things that we spoke about at the beginning of our conversation, things like hunger and thirst and respiratory feelings and so on, these are not emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.19,
    "end": 3649.616,
    "text": "At least they don't feature in Panksepp's taxonomy of the emotions, because for him emotions are not these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.656,
    "end": 3651.278,
    "text": "He calls them bodily affects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.663,
    "end": 3655.388,
    "text": " So there are many homeostats, not seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3655.969,
    "end": 3659.673,
    "text": "There are many, many, many, many, many homeostats in the human organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.254,
    "end": 3667.043,
    "text": "And it's a very telling fact that not all of them give rise to feelings like blood pressure regulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.083,
    "end": 3675.814,
    "text": "For example, there's no feeling of how well or badly you're doing in terms of regulating your blood pressure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.199,
    "end": 3679.427,
    "text": " And I'm just using one example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3679.467,
    "end": 3681.09,
    "text": "There are many such examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.592,
    "end": 3688.207,
    "text": "There are ones which are transitional, which are normally run autonomically, and sometimes we feel them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.227,
    "end": 3692.858,
    "text": "And I just gave an example of that when I spoke about respiration, that normally it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.838,
    "end": 3695.301,
    "text": " it's handled autonomically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.622,
    "end": 3699.427,
    "text": "But then under certain circumstances, it comes to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.988,
    "end": 3705.796,
    "text": "So I'm sorry, I'm probably being overly pedantic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.816,
    "end": 3711.544,
    "text": "But my point is, yes, I do agree with you that for each need, there's a homeostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.045,
    "end": 3713.807,
    "text": "But there are more than seven of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.468,
    "end": 3716.29,
    "text": "There are many, many, many more than seven of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.911,
    "end": 3718.153,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.133,
    "end": 3725.543,
    "text": " Only some of them ever come to consciousness, and only some of them might be called emotions, in my way of using the word emotion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.903,
    "end": 3728.487,
    "text": "But here's a very important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.889,
    "end": 3735.656,
    "text": "The fact that they are categorical needs doesn't mean that they aren't amalgams of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.377,
    "end": 3745.069,
    "text": "It doesn't mean that they also aren't higher order metacognitive amalgams and elaborations and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.049,
    "end": 3748.18,
    "text": " For her, for Lisa, that's the starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.2,
    "end": 3756.831,
    "text": "The starting point is that there are these learned categories that we then that we then they are what she calls emotion concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.047,
    "end": 3763.958,
    "text": " which we then apply to what we experience perceptually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.539,
    "end": 3772.933,
    "text": "And I'm saying, yeah, of course there are these learnt concepts, but they start with innate concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.193,
    "end": 3777.3,
    "text": "Those are the homeostats that I'm talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.28,
    "end": 3796.572,
    "text": " how we come to regulate through allostasis and learning all of these different mechanisms and orchestrate them all with each other and so on, especially us human beings with all of these higher order abstract concepts that we use to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.552,
    "end": 3798.775,
    "text": " It includes everything that she writes about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.835,
    "end": 3803.281,
    "text": "I think that what she writes about describes something that definitely does happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.782,
    "end": 3813.375,
    "text": "But I just question the assumption that there are no innate categories to begin with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.475,
    "end": 3818.361,
    "text": "It just makes no evolutionary sense and makes no physiological sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.441,
    "end": 3821.586,
    "text": "It just doesn't map onto what we know about how the brain works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.687,
    "end": 3824.77,
    "text": "That's the point I wanted to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.391,
    "end": 3827.594,
    "text": " Yes, that was the, that was the big sticking point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.014,
    "end": 3833.962,
    "text": "Um, and there was this kind of back and forth about what evidence is, uh, which we don't, we don't necessarily need to go into, but people can watch it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.982,
    "end": 3835.063,
    "text": "And I thought it was very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.404,
    "end": 3835.564,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.624,
    "end": 3845.937,
    "text": "Well, when they, when, if, and if you do, if you dear listener or viewer do watch it, I want you to, to, to notice one thing, which I thought was, was, was especially important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.658,
    "end": 3853.727,
    "text": "Um, it's that, uh, because Lisa's starting point is that this idea that they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.707,
    "end": 3865.867,
    "text": " particular circuits for particular emotions and so on, which of course can be parodied and can be caricatured and can be made to look like an idiotic localisationist stupid idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.609,
    "end": 3879.951,
    "text": "But when she says there are no such systems, there are no innate brain systems for innate emotions and other categories of organismic meat,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3879.931,
    "end": 3893.263,
    "text": " When she says that, please note in this conversation with me, I learned that she says the same of vision as opposed to somatic sensation, as opposed to olfaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3893.604,
    "end": 3897.012,
    "text": "She says these two are not innate systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.992,
    "end": 3914.595,
    "text": " So if that's what she means, if her way of understanding what we mean by an innate system, her way of using that terminology excludes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.575,
    "end": 3921.665,
    "text": " the usefulness of speaking about a visual system which we all have and an auditory system that we all have and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.205,
    "end": 3929.255,
    "text": "I think you need to understand that it's in that way that she's questioning whether there are basic emotional systems in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.556,
    "end": 3940.65,
    "text": "If it's such a radical claim that she's making that we should not speak of any innate systems of the kind that we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.63,
    "end": 3944.575,
    "text": " do when we speak of a visual auditory or somatosensory and so on system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.777,
    "end": 3952.206,
    "text": "If emotion is being lumped in with that claim, then it's not a claim only about emotion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.266,
    "end": 3956.472,
    "text": "It's a whole different way of thinking about what are useful concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.614,
    "end": 3966.486,
    "text": "And her reasoning for saying there's no innate visual system is that if you're blind, your visual system will serve different functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.466,
    "end": 3995.511,
    "text": " um not innately visual well of course if you're blind it's going to go in an anomalous it's going to organize in an anomalous way but that doesn't mean that it's not useful in biology to speak of the the fact that in the normal state of things there is an innate visual system but yes i wonder whether i could you know lisa's not here to stay her piece and so people should go and listen and i'd love to have her on um i'm wondering whether i can sort of steal man",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.217,
    "end": 4013.133,
    "text": " And well, actually not still man, either yourself or her, but also potentially, you know, offer a middle suggestion, which is, could we perhaps propose that rather than, well, I wonder whether Lisa would say she might disagree that there are innate concepts, which you disagree that there are innate processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.954,
    "end": 4023.743,
    "text": "And by that, I mean, I can take a sort of active inference, biological, active inference stance on this, that there are functions and anatomical systems in the body and brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.28,
    "end": 4027.384,
    "text": " which have priors to self-organize in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.085,
    "end": 4034.113,
    "text": "And this is the work of Mike Levin and Franz Kuckling and this kind of work about morphospace and how that fleshes out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.774,
    "end": 4043.346,
    "text": "And so I wonder whether, because I personally, and I think this is an argument that goes all the way back to Jerry Fodor and the debates around Chomsky and innate language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.366,
    "end": 4051.317,
    "text": "I can't see how, for example, fear would even ever get off the ground with no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.022,
    "end": 4053.904,
    "text": " innate priming for fear, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.924,
    "end": 4057.388,
    "text": "Like, I agree, fear then becomes socially modulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.749,
    "end": 4077.709,
    "text": "But how would that categorization like, I don't think Lisa would deny that for you and I as fully flesh conscious proposition that you're using, like language users, we can think about fear and have it as a concrete object, but how that ever gets off the ground, in terms of what makes something feel what makes something first, without some, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.195,
    "end": 4106.042,
    "text": " something guiding that process whether it's just a singular concept that acts as a template which things get fit fit into or a process uh like let's say an innate inductive in process something like that as way that someone like fodor might talk about it and arguably where chomsky has ended up in in merge and things like this uh maybe that would give us the inductive background from which we can slot these emotions into different categories and in many ways i mean this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.41,
    "end": 4116.762,
    "text": " this is kind of go, you know, it takes us all the way to something like a connection this network, which is that these connections networks are not completely unsupervised, in the sense that they do have prior weights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.563,
    "end": 4121.828,
    "text": "And so, yes, I do think the radical tabula rasa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.509,
    "end": 4126.273,
    "text": "Well, one, I one, I guess I'd have to ask her because again, I don't want to speak on her behalf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4126.353,
    "end": 4132.08,
    "text": "I wonder whether in steel manning her position, she might have space for something like an innate mechanism or innate process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.482,
    "end": 4137.15,
    "text": " Yeah, well, you're right that our viewers or listeners must go and watch those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.594,
    "end": 4141.076,
    "text": "I think they're on YouTube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.417,
    "end": 4142.238,
    "text": "Yes, they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.639,
    "end": 4144.502,
    "text": "The discussions I had on her channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.363,
    "end": 4145.643,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.226,
    "end": 4158.945,
    "text": "And so you must watch it yourself and listen to her speaking for herself and form your own opinion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.398,
    "end": 4162.828,
    "text": " the topic that you've just mentioned did come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.189,
    "end": 4167.441,
    "text": "Not very, not very, it wasn't discussed at great length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.942,
    "end": 4173.458,
    "text": "But it came up periodically in our two, our two conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.995,
    "end": 4192.712,
    "text": " And my understanding of what she said is, yes, she certainly agrees that there are these innate mechanisms and they are instinctual behaviors or reflexive action, not necessarily only external behaviors, but also internal actions within the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.063,
    "end": 4199.639,
    "text": " But all that's innate is those stereotyped actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.323,
    "end": 4209.081,
    "text": "She doesn't think or believe that there is a feeling that goes with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.128,
    "end": 4227.871,
    "text": " So given everything that I said earlier, you can see why I think that some of them have feeling attached to them because that's precisely what makes you know, I am suffocating as opposed to I am sleepy and you act accordingly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4228.632,
    "end": 4234.98,
    "text": "I think the feeling attaches to the category of need because of what feeling does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.061,
    "end": 4238.224,
    "text": "You can, I believe,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.508,
    "end": 4245.496,
    "text": " well, I don't want to go into too much detail, but let's just say, so I believe that the feeling is attached to the innate category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.377,
    "end": 4251.343,
    "text": "She accepts there are innate categories, but doesn't believe that feelings are attached to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.663,
    "end": 4253.225,
    "text": "But here's the really interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.245,
    "end": 4257.59,
    "text": "She then says, so we then learn, we make inferences about these categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.291,
    "end": 4266.54,
    "text": "So the state I am in now, which I have been in before, I recognize this state, this is called fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.52,
    "end": 4288.208,
    "text": " um and that's when fear arises fear is the concept uh the learned concept that you apply to the state that you find yourself in so the first time that this um in my view the first time that this action uh this instinctual action freezing and fleeing occurs um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.188,
    "end": 4291.876,
    "text": " The feeling that you will have is fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.038,
    "end": 4298.67,
    "text": "Her position seems to be the first time that it happens, nothing will occur mentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4298.971,
    "end": 4303.54,
    "text": "The second time that it happens, you will recognize I've been in this situation before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.182,
    "end": 4305.004,
    "text": "I call this fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.204,
    "end": 4307.108,
    "text": "And now you've formed the concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.223,
    "end": 4308.245,
    "text": " That's her way of seeing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4308.265,
    "end": 4311.913,
    "text": "But the crucial thing there is there's no place for a feeling in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.434,
    "end": 4313.836,
    "text": "Why do you have a feeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.578,
    "end": 4317.283,
    "text": "You've just categorized this state as fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.965,
    "end": 4321.572,
    "text": "And she says, yes, indeed, it's exactly the same as any other type of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4321.672,
    "end": 4322.755,
    "text": "It's perceptual inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.636,
    "end": 4324.438,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.498,
    "end": 4350.257,
    "text": " me that leaves qualia entirely out you know it is this there's no need so i asked her the question why then do we feel uh and she said i don't go there that's not a scientific question yes well again uh people should go and watch and i will email lisa again i emailed her and um i think she was very very busy she's a very busy woman i will i will get back in contact so i couldn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.592,
    "end": 4351.514,
    "text": " So we're running out of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.534,
    "end": 4352.496,
    "text": "So we're in about 10 minutes left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.516,
    "end": 4355.141,
    "text": "But I wanted to very briefly touch upon dreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.702,
    "end": 4356.263,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.005,
    "end": 4360.793,
    "text": "We haven't spoken, we haven't done anything to do with the kind of earlier work of yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.873,
    "end": 4366.685,
    "text": "As I said, you know, you're very famous for discovering the four brain mechanisms underlying dreams, and I think the late 90s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.326,
    "end": 4371.334,
    "text": "And you wrote in the worst, I think it's the 2000 paper, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.668,
    "end": 4376.213,
    "text": " what you're, what you're really drawing into question there is, is a association of REM and dreaming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.253,
    "end": 4380.938,
    "text": "So REM rapid eye movement, sleep and dreaming when that, well, were historically tied together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.459,
    "end": 4387.746,
    "text": "And you show in that paper that really nicely, there's this sort of double dissociation that you can have dreams without REM and REM without dreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.407,
    "end": 4392.331,
    "text": "And you said at the very end of that paper, the biological function of dreaming remains unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.212,
    "end": 4400.46,
    "text": "This is at least partly attributable, attributable to the fact that the function of dreaming and the equally unknown function of REM sleep have been conflated for more than 40 years of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.761,
    "end": 4403.267,
    "text": " Future studies of these functions should be uncoupled from one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4403.788,
    "end": 4407.036,
    "text": "I was curious, one, have they been uncoupled from one another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.457,
    "end": 4412.61,
    "text": "And two, has that given us any purview or insight into the function of dreaming?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.62,
    "end": 4415.263,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4415.303,
    "end": 4419.269,
    "text": "Thank you for raising this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.97,
    "end": 4441.804,
    "text": "I spent many happy years doing dream research, and I was very fortunate in the discoveries that I made in that area, which, like most really significant discoveries, happen purely by luck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.784,
    "end": 4467.471,
    "text": " it wasn't something i was looking for so i just want to make sure that that people understand the double dissociation you're talking about it's not only that you can dream outside of rem and you can uh be in the rem state without dreaming that is a is an interesting fact but it's a that's not that's a i think was always recognized that the correlation between dreaming uh and and rem sleep is a probabilistic one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4467.451,
    "end": 4471.375,
    "text": " you are much more likely to be dreaming in REM than outside of REM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.817,
    "end": 4490.337,
    "text": "But the thing that I found which was much more interesting, I thought, is that lesions which destroy the part of the brain that generates REM, which is a cholinergic system in the mesopontan tegmentum,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.317,
    "end": 4501.643,
    "text": " that people who have lost the capacity to have the REM state because that part of the brain is lesioned, they continue to dream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.943,
    "end": 4504.687,
    "text": " So with no REM, they continue to dream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.067,
    "end": 4512.397,
    "text": "And conversely, there are patients who lose the capacity to dream due to a brain lesion elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.158,
    "end": 4514.74,
    "text": "They continue to have REM sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.821,
    "end": 4516.923,
    "text": "That's the double dissociation we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.224,
    "end": 4518.225,
    "text": "That's a gold standard as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.686,
    "end": 4519.307,
    "text": "Yes, indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.667,
    "end": 4523.192,
    "text": "And that lesion, the one that leads to a loss of dreaming,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.172,
    "end": 4531.083,
    "text": " Actually, there are two lesion sites, but the interesting one is in the mesocortical mesolimbic dopamine circuitry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.563,
    "end": 4536.81,
    "text": "So it's a different circuit from the one that generates REM sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.831,
    "end": 4541.637,
    "text": "It's a different neurotransmitter from the one that modulates REM sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.617,
    "end": 4547.33,
    "text": " So dreaming as opposed to REM sleep, they correlate with each other, but they're not the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.172,
    "end": 4554.968,
    "text": "And there's an interesting question as to why they should correlate with each other, because they do very highly correlate with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.309,
    "end": 4559.98,
    "text": "But you can totally dissociate them from each other in the way that I've just described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.145,
    "end": 4569.777,
    "text": " Now, I said, which is the quotation you just read, that we don't know what the function of dreaming is, partly because we conflated it with REM sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.797,
    "end": 4580.77,
    "text": "So the research that we were doing for decades into what is dreaming for, the causal research that we did, the variable that we manipulated was REM sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.75,
    "end": 4606.116,
    "text": " so you know it's not surprising that we never got to the answer because we've been manipulating something that correlates with dreaming but isn't actually the mechanism of dreaming so i said at that point in the paper that you're quoting that now that we can see that they're two separate mechanisms and now we can research the mechanism and function of dreaming by looking at the at that mechanism not this one um and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.18,
    "end": 4609.044,
    "text": " that was bound to lead to progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4612.85,
    "end": 4615.794,
    "text": "You said, has progress been made?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.775,
    "end": 4618.378,
    "text": "A lot of progress has been made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.398,
    "end": 4625.208,
    "text": "And in fact, when I said I spent many happy years in a sleep lab, I in fact still am doing some research in that area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.268,
    "end": 4630.315,
    "text": "And so there's one study that's still ongoing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.295,
    "end": 4635.727,
    "text": " that I've only completed the pilot study for it, but we're now doing the main study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4636.127,
    "end": 4642.922,
    "text": "But the findings were so dramatic in the pilot study that I feel able to say a thing or two about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4644.586,
    "end": 4647.532,
    "text": "But it's not really in the active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.173,
    "end": 4648.654,
    "text": "Don't worry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.135,
    "end": 4649.957,
    "text": "No, no, no, no, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.393,
    "end": 4651.454,
    "text": " Go, go, go, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.474,
    "end": 4652.256,
    "text": "It can be linked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.276,
    "end": 4661.949,
    "text": "And you know, Carl and Hobson, Carl Friston and Alan Hobson wrote some very interesting papers within the Active Inference Framework about dreaming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.23,
    "end": 4678.611,
    "text": "But the first thing to say is that this mesocortical, mesolimbic dopamine system, which clearly is the driving mechanism, the causal mechanism of dreaming, and there's all sorts of, every method we've thrown at it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.591,
    "end": 4692.717,
    "text": " you know, single cell recordings, micro dialysis, pharmacological probes, lesion studies, positron emission tomography, everything, everything points to that system, that system, that system, that's the one that causes the dream state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4694.6,
    "end": 4700.751,
    "text": "The really interesting thing about it is that it is, it's been called",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.731,
    "end": 4711.963,
    "text": " by Panksepp, who you mentioned earlier, the seeking system, you know, the instinctual behaviour that attaches to this system is foraging exploratory interest and curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.085,
    "end": 4719.552,
    "text": "It drives the most sort of intense exploratory foraging behaviours that an animal is capable of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.092,
    "end": 4729.843,
    "text": "And when you look at the dreaming brain, for example, by positron emission tomography, it's really quite astonishing to see this system is lit up like a Christmas tree, but you're asleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.823,
    "end": 4731.706,
    "text": " It's like, what the hell?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4731.846,
    "end": 4735.413,
    "text": "How can this creature be asleep or this person be asleep?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.813,
    "end": 4749.216,
    "text": "If you weren't told that they were asleep and you just looked at that brain image, you would say, this person's manic and high on cocaine or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.196,
    "end": 4762.061,
    "text": " That's the first thing that I think is really interesting, is that the mechanism that drives the dream is an intensely motivated, active state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.762,
    "end": 4765.467,
    "text": "And so the first",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.447,
    "end": 4773.359,
    "text": " step toward an understanding of why do we dream has to be, you have to start there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.5,
    "end": 4777.446,
    "text": "Why do we have these intense, activated, motivated states while we're sleeping?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.846,
    "end": 4781.212,
    "text": "And secondly, why don't we wake up when we have them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.554,
    "end": 4783.455,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.823,
    "end": 4791.33,
    "text": " one way of thinking is that the dream happens instead of real behaviour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4791.57,
    "end": 4802.88,
    "text": "You have a virtual reality in which you are imagining or deluding yourself that you are acting on your motivated states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.201,
    "end": 4813.29,
    "text": "Why these motivated states have to happen while you're asleep is another question, but the fact that they do happen is obvious, physiologically demonstrably true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.76,
    "end": 4828.008,
    "text": " this state is acted on in the virtual hallucinatory reality of the dream rather than in real reality, because to act on them in reality would be incompatible with the state of sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.028,
    "end": 4830.773,
    "text": "So that is, I think, a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.753,
    "end": 4836.426,
    "text": " a very simple and reasonable hypothesis as to why do we dream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.487,
    "end": 4843.323,
    "text": "We dream so that we can stay asleep during this highly motivated state of mind and body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.944,
    "end": 4848.154,
    "text": "If it weren't for the fact that we're paralyzed, we would be running around like lunatics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4848.134,
    "end": 4852.882,
    "text": " So you don't run around like a lunatic because you're running around in your dreams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.964,
    "end": 4856.148,
    "text": "So how do you test that hypothesis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4856.528,
    "end": 4863.921,
    "text": "I said earlier that there are two lesion sites which lead to cessation of dreaming, and we've spoken only about the one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.221,
    "end": 4870.632,
    "text": "The other one is damage to the visuospatial cortices at the back of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.612,
    "end": 4882.276,
    "text": " If you can't generate the mental image, the heteromodal and predominantly visual, but not only visual imagery that is the dream, then how can you dream?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.396,
    "end": 4885.984,
    "text": "So they're theoretically less interesting, those patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.024,
    "end": 4890.493,
    "text": "They stop dreaming due to occipitoparietal strokes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4890.777,
    "end": 4906.558,
    "text": " But if the prediction that I've just made, the hypothesis I've just formulated as to what the function of dreaming is, if it were correct, then these patients who can't generate the hallucinated reality because of those lesions, they should wake up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.538,
    "end": 4908.641,
    "text": " they should have very bad sleep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.843,
    "end": 4913.83,
    "text": "When this arousal state occurs, it should wake them up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4913.85,
    "end": 4916.814,
    "text": "So that's the prediction that I tested in my pilot study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4917.215,
    "end": 4923.325,
    "text": "And let me tell you, I have never seen worse polysomnographs than in these patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.345,
    "end": 4931.618,
    "text": "So I think we're onto something there, that what dreams do is they enable you to stay asleep by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4931.598,
    "end": 4960.44,
    "text": " letting off steam letting off motivational steam in a in an hallucinatory world rather than the real world i'm not saying that's the function but that's a function that's very cool that's very cool people have to keep their eyes out for that for those sets of papers mark this was awesome we covered so much ground uh i'm really really very grateful indeed i always like to ask people just to say at the very end where people can find them if they have you know people have questions or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.707,
    "end": 4961.816,
    "text": " People want to read your work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.877,
    "end": 4965.064,
    "text": "How can people reach out to you or where should they find your work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.057,
    "end": 4970.182,
    "text": " So to contact me, you can contact me by email.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.284,
    "end": 4981.777,
    "text": "It's just my name, mark.solms, at uct, University of Cape Town, .ac, academic, .za, which is South Africa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.797,
    "end": 4984.821,
    "text": "So mark.solms at uct.ac.za.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4985.442,
    "end": 4992.351,
    "text": "I am also, for my sins, on what used to be called Twitter, but it's now called something else that I don't want to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4992.331,
    "end": 4997.685,
    "text": " So there I'm Mark underscore Psalms, at Mark underscore Psalms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4998.527,
    "end": 5003.661,
    "text": "We'll make sure to put your Google Scholar and website and all this stuff on in the video description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.721,
    "end": 5006.127,
    "text": "Again, Mark, thank you so, so very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.408,
    "end": 5006.949,
    "text": "I enjoyed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.069,
    "end": 5007.511,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.233,
    "end": 5008.433,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  }
]