[
  {
    "start": 7.785,
    "end": 8.466,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.126,
    "end": 14.43,
    "text": "It's ACT-INF Livestream 52.2 on March 9th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.211,
    "end": 17.772,
    "text": "Welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.513,
    "end": 23.937,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.629,
    "end": 27.65,
    "text": " You can find more information on these links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.551,
    "end": 33.654,
    "text": "This is a recorded and archived live stream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.655,
    "end": 39.938,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.519,
    "end": 47.283,
    "text": "Head over to ActiveInference.org to learn more about getting involved with projects and learning groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.204,
    "end": 52.826,
    "text": "All right, we are back in live stream 52.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.549,
    "end": 63.301,
    "text": " In our third discussion on the paper Geometric Methods for Sampling, Optimization, Inference and Adaptive Agents,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.704,
    "end": 91.813,
    "text": " we had a dot zero background and context video and last week lance joined for 52.1 where we had a great overview discussion on the paper so today we're going to see where it goes see where our last week has taken us and how we're thinking about it or curious about it if you're watching live of course feel free to write questions in a live chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.993,
    "end": 98.317,
    "text": " Otherwise, let us pick up on a mostly blank slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.278,
    "end": 103.441,
    "text": "And just thanks again, Lance, for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.501,
    "end": 111.908,
    "text": "If you want to give any sort of introduction or recap opening here, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.309,
    "end": 116.851,
    "text": "Well, yeah, I mean, thanks a lot, Daniel, for organizing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.871,
    "end": 118.313,
    "text": "I'm super happy to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.333,
    "end": 122.436,
    "text": "I think, well, last time we went through most of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.725,
    "end": 128.047,
    "text": " We discussed a lot about sampling, I guess, the idea of sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.147,
    "end": 137.512,
    "text": "We discussed a bit less about Hamiltonian Monte Carlo, which is one of the, I guess, state of the art methods for sampling in continuous space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.212,
    "end": 141.273,
    "text": "We discussed a lot about optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.293,
    "end": 150.798,
    "text": "There's a nice figure actually that we can discuss today, which gives some nice intuition about the kind of optimization methods that we reviewed in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.817,
    "end": 155.441,
    "text": " And then there's another section on statistical inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.262,
    "end": 167.256,
    "text": "So this is a bit of a different section than people in the free energy principle literature and active inference are used to, because here the goal of inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.467,
    "end": 176.571,
    "text": " is about approximating expectations as opposed to just approximating distributions in and of themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.552,
    "end": 194.76,
    "text": "These two perspectives turn out to be dual, but I guess here we want to develop notions of divergences and discrepancies that are a bit more general than the KL divergence and that can be used to solve problems that the KL divergence cannot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.485,
    "end": 206.936,
    "text": " And I guess the overall picture for what we want to do that is the KL divergence soon turns out to have a lot of really nice properties that we can discuss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.594,
    "end": 218.876,
    "text": " One of them is that if the KL divergence is reduced, it means that the two distributions in play are more similar in terms of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.296,
    "end": 232.178,
    "text": "So there is this idea of information monotonicity where the KL divergence sort of gives an ordering as to what extent two distributions quantify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 232.198,
    "end": 236.619,
    "text": "I mean, so if you have three distributions and you compute the KL divergence between them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.663,
    "end": 242.346,
    "text": " And now KL is lower than KL .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.046,
    "end": 255.754,
    "text": "It means that B is more closer in terms of information to A than C is to A. So you have this really nice thing that is captured by the KL divergence, which makes sense when we're dealing with information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.314,
    "end": 259.436,
    "text": "The KL divergence also has so many other nice properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.09,
    "end": 289.178,
    "text": " it it's not a distance but it turns out to behave a bit like a square distance so you have this kind of like really nice pythagorean theorem um and i won't get into the exact statement but it's like if you have a b and c distributions then k l a b plus k l a c equals k l b c if you have like a rectangle triangle if a b c define a rectangle triangle in information space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.514,
    "end": 293.636,
    "text": " You have other properties that the KL divergence gives and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.337,
    "end": 304.181,
    "text": "So the KL divergence is, in general, I would say the divergence of choice, but it turns out that in many cases you just can't use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 304.281,
    "end": 312.465,
    "text": "For example, when you have samples and you want to approximate some samples with a distribution, then the KL divergence just is not going to work there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.904,
    "end": 314.705,
    "text": " So you need to derive from other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.485,
    "end": 324.287,
    "text": "So this is to say that we're considering statistical inference a bit more generally than what we do in active inference in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.407,
    "end": 334.91,
    "text": "And so this speaks to why the section here is a bit different from the standard inference literature that we usually consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.994,
    "end": 358.881,
    "text": " then i think there's the well then this section five which is about active inference and i think we should discuss that a little bit more because the formation of active inference that's presented there is to my mind the most general and also the simplest concept conceptually that's been out there i mean we sort of like recap the derivation of active inference and also like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.631,
    "end": 370.417,
    "text": " The properties of the expected energy properties of active inference and also how to scale active inference and so on, and we do that in just seven pages or five or five pages, I mean it's just very short.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.978,
    "end": 387.507,
    "text": "So it stands sure it's like a really concise summary and actually from there, you can really write a lot of you know technical papers on active inference it's like to me it's the most general and if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.49,
    "end": 395.415,
    "text": " If you as a reader can understand that section, then you can sort of really understand what active emphasis is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.435,
    "end": 399.577,
    "text": "So yeah, this is kind of the overview for today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.597,
    "end": 406.882,
    "text": "I would really like to be discussing questions because last time we really discussed about most of the papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.962,
    "end": 409.364,
    "text": "So, but yeah, whatever comes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.445,
    "end": 411.765,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.546,
    "end": 412.826,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.447,
    "end": 413.647,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.287,
    "end": 415.068,
    "text": "Well, let us...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.324,
    "end": 426.96,
    "text": " talk about some of the more foundational pieces Hamiltonian Monte Carlo and then on through section four",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.45,
    "end": 457.314,
    "text": " with the points that you raised about the kl which generalized inference beyond how it may have been brought up in other active and then we can spend most of the time in section five and looking at some of those figures connecting some of the intuitions about the ball rolling down the bowl to the person running so sounds good on hamiltonian monte carlo where do you want to pick up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.723,
    "end": 465.865,
    "text": " Sure, I mean, so last time we discussed a lot about the problem of sampling and why that's a difficult problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.006,
    "end": 473.228,
    "text": "And we arrived at the conclusion or presented like Monte Carlo methods, how they work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.328,
    "end": 486.912,
    "text": "So you're basically running a stochastic process, like a random motion and sort of the distribution defining the process is gonna convert their target distribution, which means that when you run the process long enough,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.791,
    "end": 495.374,
    "text": " then every point that it's going to be in is going to be like a sample of the distribution that you want to sample from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.654,
    "end": 497.195,
    "text": "Now there's a lot of issues with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.215,
    "end": 512.882,
    "text": "I mean conceptually it's not so difficult, but actually when you want to implement this in practice, it turns out to be really hard because if you just implement the simplest stochastic process to sample your target distribution,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.784,
    "end": 521.732,
    "text": " it's going to be extremely slow and I think that's the main bottleneck when developing Monte Carlo methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.912,
    "end": 533.124,
    "text": "Monte Carlo sampling in general is slow and that's also one of the reasons why one might want to do variational inference instead of sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.123,
    "end": 537.644,
    "text": " So sampling is slower, but it's also more accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.105,
    "end": 541.707,
    "text": "It can approximate distributions that are completely arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.207,
    "end": 547.85,
    "text": "So if you care about accuracy and you have time and computational resources, then for sure go for sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.45,
    "end": 555.814,
    "text": "If you care about speed, about doing things online, and you don't care about accuracy so much, then variational inference is the way to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.194,
    "end": 558.456,
    "text": "At least that's my understanding right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.574,
    "end": 564.755,
    "text": " So let's say you wanted to sample a distribution in a continuous space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.975,
    "end": 570.756,
    "text": "So it could be just as last time, let's imagine the state space is the desk where I'm at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.236,
    "end": 575.697,
    "text": "And you sort of had this distribution, which could be like multimodal, very weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.717,
    "end": 578.098,
    "text": "And you just want to take samples from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.118,
    "end": 585.639,
    "text": "Hamiltonian Monte Carlo is probably the state of the art method to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.249,
    "end": 594.62,
    "text": " There's a lot of other methods out there, but Hamiltonia Monte Carlo typically just works very well and in a wide variety of situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.702,
    "end": 599.467,
    "text": "And so the idea of Hamiltonia Monte Carlo is you're going to augment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.743,
    "end": 603.366,
    "text": " The state space with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.946,
    "end": 608.03,
    "text": "So let's let's say that the original state space you start with are the positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.951,
    "end": 624.325,
    "text": "And so you're going to augment that with a velocity state space, so you kind of if your original state space was Euclidean space of n dimensions you just end up with an Euclidean space of two n dimensions, so you double the size of the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.475,
    "end": 633.701,
    "text": " And now you say, OK, well, the distribution that I want to sample from actually defines an energy landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.322,
    "end": 645.149,
    "text": "So technically, it's like if you have a distribution which is p, then minus log p is an energy landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.729,
    "end": 652.274,
    "text": "So points where minus log p is low are points where p is high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.494,
    "end": 655.056,
    "text": "And so these are points that you want to sample a lot from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.209,
    "end": 667.494,
    "text": " And contrary wise, if minus log p is very high, then p is low and you don't really want to go there so much because these are points of low probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.434,
    "end": 682.92,
    "text": "So I think this minus log p, actually there's many reasons why minus log p is meaningful in physics, but just note for now that minus log p is just like a function and the minima of the functions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.782,
    "end": 695.286,
    "text": " of that function at a high probability point and these are high energy points where you basically don't want to go there so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.687,
    "end": 704.09,
    "text": "So let's call this minus log p potential energy and so this is what this really is in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.31,
    "end": 707.531,
    "text": "Technically in physics p would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.398,
    "end": 712.099,
    "text": " distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.3,
    "end": 717.802,
    "text": "Last time we saw like softmax of minus something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.262,
    "end": 721.284,
    "text": "The something is the potential energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.885,
    "end": 727.148,
    "text": "Anyway, and so minus log p would be the potential energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.429,
    "end": 739.055,
    "text": "And then if you add kinetic energy on your velocities, then you get what's called a Hamiltonian, which is the sum of the potential and kinetic energies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.736,
    "end": 739.876,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.398,
    "end": 743.22,
    "text": " What is exactly the kinetic energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.26,
    "end": 746.063,
    "text": "The kinetic energy is like velocity squared, pretty much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.064,
    "end": 752.629,
    "text": "So if you add, remember that your state space is position and velocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.35,
    "end": 766.242,
    "text": "If you add, and you take a point in state space, so you would have kinetic energy, which is velocity squared, and a potential energy, which would be minus log t.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.338,
    "end": 781.693,
    "text": " Now, if you add the two together what you get is a Hamiltonian, which is the sum of the kinetic energy and potential energy, and this is just standard physics Hamiltonian is a sum of kinetic and potential energy and it gives us the total energy of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.255,
    "end": 790.142,
    "text": "So why we started with the problem of sampling and here I just told you something very complicated where.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.612,
    "end": 794.416,
    "text": " we get a Hamiltonian, there's actually a good reason why we want to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.137,
    "end": 802.245,
    "text": "And it comes back to the idea of geometric integration that we talked about last time, which is that typically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.631,
    "end": 817.502,
    "text": " Maybe I have a process that I know will give very efficient sampling, but actually when I implement it on a computer in discrete time, I just lose all the properties that make that sampling efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.043,
    "end": 823.848,
    "text": "So actually it turns out that most people working in Monte Carlo sampling, they're working on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.821,
    "end": 830.344,
    "text": " efficient discretizations of continuous processes as opposed to on the continuous processes themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.785,
    "end": 834.887,
    "text": "Really the bottleneck and the difficulty here is the implementation part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.028,
    "end": 844.433,
    "text": "Implementing processes on a computer like you and I had in such a way that we retain all the good sampling properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.773,
    "end": 853.275,
    "text": " So one very powerful idea is that of geometric integration, which is preserving geometric properties of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.715,
    "end": 868.178,
    "text": "I mean, geometric integration is the field that develops computational methods of numerical integration and numerical discretization in such a way that they preserve important geometric properties of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.522,
    "end": 873.324,
    "text": " Here, the geometry in play is the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.164,
    "end": 876.685,
    "text": "And so you might think, well, that's pretty weird.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.725,
    "end": 878.886,
    "text": "I mean, a Hamiltonian is an energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.906,
    "end": 884.149,
    "text": "And here we're talking about preserving the geometry and preserving the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.189,
    "end": 886.57,
    "text": "How do these two things fit together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.25,
    "end": 894.794,
    "text": "And so it turns out that the presence of a Hamiltonian and the fact that we have a state space that has positions and velocity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.558,
    "end": 903.181,
    "text": " Technically, in mathematics, what we then get is what people call symplectic geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.881,
    "end": 913.446,
    "text": "So symplectic geometry just arises when we have those state spaces that comprise positions and velocity, and when you have Hamiltonians.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.706,
    "end": 925.251,
    "text": "So this is just a way of explaining why the Hamiltonian is closely and intimately related to geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.425,
    "end": 936.492,
    "text": " So geometric integration enables you to discretize processes in such a way that the Hamiltonian is preserved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.292,
    "end": 944.157,
    "text": "Now, when you think about the Hamiltonian, the Hamiltonian gives you the energy of a particular point in state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.658,
    "end": 952.623,
    "text": "And so if you simulate trajectories that preserve the Hamiltonian, what you're effectively doing is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.661,
    "end": 959.884,
    "text": " sampling from the contours of the probability distribution, contours that have the same probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.904,
    "end": 968.887,
    "text": "So you're basically going around, let's say, for example, in circles in a region that has the same probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.508,
    "end": 976.15,
    "text": "When we want to sample, we want to go everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.21,
    "end": 982.093,
    "text": "I mean, we want to sample regions of high probability, low probability, and want to be able to go from one to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.194,
    "end": 995.302,
    "text": " So what geometric integration allows us to do is to simulate dynamics that are going to preserve the contours of the probability distribution, and they're going to do so very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.103,
    "end": 1006.268,
    "text": "The advantage here is that when we use geometric integration to simulate Hamiltonian dynamics, which are conservative and, again, stay in the contours,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.041,
    "end": 1020.207,
    "text": " What geometric integration allows us to do is to take time steps that are very long, so it enables us to travel very far in the landscape, while still preserving the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.227,
    "end": 1032.993,
    "text": "So you don't need to take very small time steps to remain accurate and preserve the Hamiltonian, but actually geometric integration allows you to take very long time steps and still preserve the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.672,
    "end": 1045.696,
    "text": " Now we have a dynamic that's Hamiltonian preserving that's just very good, because you can take very long time steps and that enables you to go around the contours of the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.917,
    "end": 1054.2,
    "text": "So what you want to do next is, you know, to change contours, you want to go to contours that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.659,
    "end": 1068.928,
    "text": " of high probability, contours of lower probability, and you want to do so in a way that the contours of high probability are sampled much more and much more often than the contours of lower probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.95,
    "end": 1080.736,
    "text": "So what you do is that you augment your Hamiltonian dynamic with what people call a velocity refreshment or a momentum refreshment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.806,
    "end": 1084.387,
    "text": " And so this is how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.308,
    "end": 1091.07,
    "text": "So you're going to simulate your Hamiltonian dynamic for some time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.051,
    "end": 1103.796,
    "text": "And then after a while, you're going to be like, OK, well, now I'm going to change the velocity at random by just drawing a new velocity from a Gaussian distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.796,
    "end": 1110.999,
    "text": "And so by drawing a new velocity from a Gaussian distribution, you're just going to change contour completely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.495,
    "end": 1118.729,
    "text": " And then there's the constraint that I just talked about, which is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.642,
    "end": 1130.172,
    "text": " You want to change contours of the probability distribution in such a way that contours of high probability are visited much more often than contours of low probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.212,
    "end": 1131.494,
    "text": "So you want to preserve that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.554,
    "end": 1135.077,
    "text": "You want to do that proportionately in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1136.018,
    "end": 1143.165,
    "text": "So the third ingredient of Hamiltonian Monte Carlo comes in, which is Metropolis Hastings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.991,
    "end": 1150.173,
    "text": " And so Metropolis Hastings is this accept reject that we discussed briefly last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.033,
    "end": 1168.659,
    "text": "And so Metropolis Hastings is just super clever and it enables you to say, it just tells you whether this momentum refreshing step is actually a good one or a bad one and should be rejected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.014,
    "end": 1182.103,
    "text": " A momentum refreshment is good if overall your sampling is going to remain faithful to the target distribution, but it is bad if it remains unfaithful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.684,
    "end": 1189.569,
    "text": "So actually, running these metropolis things, except reject step, allows you to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.743,
    "end": 1197.649,
    "text": " change contours of the probability distribution in a way that remains faithful to the target distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.43,
    "end": 1199.631,
    "text": "And so there you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.851,
    "end": 1202.494,
    "text": "That's basically Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.634,
    "end": 1207.479,
    "text": "So to recap, you amend the state space by adding velocities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.98,
    "end": 1212.223,
    "text": "This allows you to build a Hamiltonian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.782,
    "end": 1224.946,
    "text": " by declaring that the original probability distribution gives you a potential energy and you add a kinetic energy on the velocities, which is just velocity squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.026,
    "end": 1235.389,
    "text": "Because you have a Hamiltonian, you can use geometric integration to simulate Hamiltonian dynamics very accurately and with very long time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.104,
    "end": 1242.228,
    "text": " very long time steps is a crucial thing, because it means that with very low computational costs, you can sample very far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.648,
    "end": 1250.894,
    "text": "So it means that you don't get stuck in a region of the probability distribution, but you can actually visit it much more fast and efficiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.914,
    "end": 1253.255,
    "text": "So that's the first part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.936,
    "end": 1257.258,
    "text": "The problem with those dynamics again is that they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.808,
    "end": 1263.131,
    "text": " remain on the contour of the probability distribution, and so you want to sample the whole probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.571,
    "end": 1283.142,
    "text": "So what you do is every once in a while, and I think that's a hyperparameter in your sampling algorithm, let's say every 10 iterations of the Hamiltonian dynamic, every 10 time steps of the Hamiltonian dynamic, you're gonna sample, you're just gonna randomly take a new velocity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.76,
    "end": 1287.922,
    "text": " So you're going to change contour in the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.043,
    "end": 1295.406,
    "text": "And the crucial point there is you want to change contour in a way that's faithful of the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1295.506,
    "end": 1298.528,
    "text": "And that's faithful of the sampling problem that you want to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.808,
    "end": 1310.694,
    "text": "There comes the last thing, which is Metropolis Hastings, which ensures that the momentum refreshment will be good for sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.774,
    "end": 1311.214,
    "text": "I mean, we'll,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.892,
    "end": 1314.734,
    "text": " preserve your target probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.874,
    "end": 1322.138,
    "text": "So with that, you just get a very efficient sampling algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.518,
    "end": 1324.739,
    "text": "And so it seems a bit convoluted, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.24,
    "end": 1330.403,
    "text": "The one bottleneck, of course, is that you need to double the dimension of the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.844,
    "end": 1335.886,
    "text": "And if your state space is already extremely large, that could be a bottleneck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.546,
    "end": 1337.807,
    "text": "It could be the case that actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.402,
    "end": 1343.788,
    "text": " doubling the dimension to add velocities, it could be a computational bottleneck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.028,
    "end": 1345.57,
    "text": "So that's a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.59,
    "end": 1351.517,
    "text": "But still, in most cases, that's not a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.738,
    "end": 1359.906,
    "text": "So again, Hamiltonian Monte Carlo is convoluted, but the overall take-home message, I would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.771,
    "end": 1370.213,
    "text": " want you to take from this is that it is a method that remains faithful to the probability distribution they want to sample, and this is crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.314,
    "end": 1379.816,
    "text": "And it is also a method that through geometric integration, it enables you to take time steps that are very long and still get accurate sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.016,
    "end": 1383.457,
    "text": "So this is the really cool thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.455,
    "end": 1395.281,
    "text": " Um, if you, you could come up with a whole bunch of other methods that did not require to, you know, double the dimension of the state space or that didn't use geometric integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.301,
    "end": 1411.569,
    "text": "The problem that you would probably run into is that the over that, that the thing that you came up with when you implemented in the computer, it doesn't exactly preserve the, the, the probability distribution that you want to sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.719,
    "end": 1417.402,
    "text": " And so the problem with that is that this would lead to bias sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1418.083,
    "end": 1431.173,
    "text": "And bias sampling is like you're going to sample a different probability distribution, which might be just a bit different, but still a different probability distribution than what you really want to sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.153,
    "end": 1434.935,
    "text": "And this would bias your predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.696,
    "end": 1441.1,
    "text": "So the really cool thing of Hamiltonian Monte Carlo is that you're actually able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.721,
    "end": 1445.222,
    "text": " have unbiased sampling through the Metropolis-Hastings step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.384,
    "end": 1449.504,
    "text": "And this is a crucial thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.564,
    "end": 1452.365,
    "text": "So it's computationally implementable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.046,
    "end": 1458.048,
    "text": "In general, there's no computational bottlenecks apart from this doubling of state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.928,
    "end": 1460.649,
    "text": "And it leads to unbiased sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.529,
    "end": 1462.87,
    "text": "It's also relatively simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.01,
    "end": 1465.451,
    "text": "So this is why this is really used all over the place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.727,
    "end": 1491.036,
    "text": " there's um there's another few perspectives that might explain why it works so well so in in the paper in in section in the last subsection of of uh of section two which is about optimization um so the the section on optimization is about how to accelerate optimization how to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.256,
    "end": 1494.137,
    "text": " derive an optimization algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.157,
    "end": 1495.518,
    "text": "Yeah, yeah, 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.698,
    "end": 1497.479,
    "text": "Yeah, that's the one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.899,
    "end": 1506.704,
    "text": "So the whole thing about section two is about deriving an optimization algorithm that accelerated in a physical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.204,
    "end": 1515.529,
    "text": "And by I mean, accelerate what I mean by accelerated, it's not about just going faster, but it's about having acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.888,
    "end": 1527.273,
    "text": " which means that, so if you go slightly up in the paper on the figure, I think this figure is great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.353,
    "end": 1532.516,
    "text": "And by the way, I wasn't the one who came up with this figure, but I think this figure is great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.596,
    "end": 1536.938,
    "text": "It really gives a lot of intuition for what acceleration really is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.719,
    "end": 1545.283,
    "text": "So if you look at the green cup, I don't know how you call this, the green well on the left,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.91,
    "end": 1556.579,
    "text": " This would be like a bowl rolling down the well, and the well is filled with honey to a certain level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.26,
    "end": 1559.221,
    "text": "And so there you get a lot of friction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.742,
    "end": 1568.59,
    "text": "So your bowl would just roll down very, very slowly, and the speed of the bowl would be proportionate to the slope of the well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.924,
    "end": 1594.228,
    "text": " um so this is not accelerated because there's a lot of friction and so the speed is just proportional to the slope of the well and this so this is actually what grade in the sand does but now if you go on the right you get what people call in physics on under them system which is also an accelerated system a system that's meaningfully accelerated so if you replace the honey",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.386,
    "end": 1607.016,
    "text": " in the well by some water, then there's going to be way less friction and your bowl is actually going to accelerate and overshoot the minimum of the well, and then sort of stabilize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.536,
    "end": 1614.282,
    "text": "But the point here is that this, this bowl is just going to get so much faster to the minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.49,
    "end": 1626.274,
    "text": " Now, um, so let's say that we just, um, I mean, so this optimization, this idea for optimization is, is just extremely powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.054,
    "end": 1635.477,
    "text": "And, um, and by the way, on the right hand side, in the graph, you can see the improvements that you get when you, when you implement these sort of ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.061,
    "end": 1642.567,
    "text": " So this was on... I'll come back to sampling in a bit, I promise, but this is actually very related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.349,
    "end": 1649.954,
    "text": "You can see on the graph on the right what kind of improvements you get when you go from an under...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.058,
    "end": 1657.383,
    "text": " damped first order gradient descent system to an underdamped second order accelerated system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.463,
    "end": 1658.784,
    "text": "And so you can see the curve, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.423,
    "end": 1670.286,
    "text": " So the black slash orange curve is overdone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.627,
    "end": 1671.828,
    "text": "There's no acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.048,
    "end": 1672.869,
    "text": "It's very slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.35,
    "end": 1680.155,
    "text": "The last curve, the blue one, it's accelerated and it's just super fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.175,
    "end": 1691.906,
    "text": "So you can see it sort of gives you quantitative data as to how many improvements you can get by implementing this acceleration in a physically meaningful way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.047,
    "end": 1699.049,
    "text": " Could you just describe the axes of the graph and also what the Lie group is here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.269,
    "end": 1708.232,
    "text": "So the Lie group is, so in the figure legend in the fourth line, you see the Lie group is S-O-N.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.852,
    "end": 1715.735,
    "text": "So technically that's the special orthogonal group of dimensions N.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.55,
    "end": 1726.617,
    "text": " And so if I, if I remember correctly, these are all the matrices, all the square matrices of size N by N that have a determinant equal to one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.177,
    "end": 1733.862,
    "text": "So the determinant is just like, um, a function where you give it a matrix and it gives you a number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.922,
    "end": 1740.486,
    "text": "The fact that, um, the fact that the determinant is equal to one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.081,
    "end": 1754.107,
    "text": " means that here we're just taking matrices which produce not translations but changes of coordinates that preserve the geometry in a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.608,
    "end": 1765.252,
    "text": "So just to elaborate on this a little bit because for people who are not intimately familiar with matrices it might seem a little opaque.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.252,
    "end": 1767.393,
    "text": "So when you have a matrix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.173,
    "end": 1771.294,
    "text": " A matrix can multiply vectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.075,
    "end": 1781.16,
    "text": "So a square matrix takes in vectors of dimension n, and it outputs vectors of dimension n by multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.481,
    "end": 1797.43,
    "text": "So if you have a square matrix, it just induces a transformation of your state space, because each vector, each point, which is a vector, gets converted into another point, which is another vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.453,
    "end": 1804.715,
    "text": " Now, so there's a lot of, I guess, properties there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.755,
    "end": 1813.617,
    "text": "You could have all sorts of translations of state space or rotations in state space or transformations of state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.397,
    "end": 1825.901,
    "text": "If the determinant of the matrix is equal to one, it means that the transformation of state space that the matrix induces will preserve the geometry of the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.961,
    "end": 1827.181,
    "text": "It will preserve distances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.382,
    "end": 1849.074,
    "text": " if you and it will preserve crucially orientation as well because if if you only asked um the determinant to be equal to one or minus one then you would the the matrix transformation would preserve the geometry but it would not preserve the orientation it could like mirror things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.151,
    "end": 1860.919,
    "text": " So if you only asked the determinant to be equal to 1 or minus 1, you would get a Lie group that's called the orthogonal group, which is usually denoted O .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.861,
    "end": 1870.928,
    "text": "And here we require the determinant to be just equal to 1, and so you get the special orthogonal group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.389,
    "end": 1874.611,
    "text": "And so it's this group of matrices that have this property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.472,
    "end": 1876.333,
    "text": "Now this is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.544,
    "end": 1905.625,
    "text": " really i mean this is not really important for the example here because you could have taken any other d group and got something similar and got a similar difference in performance but but um yeah i guess it's just interesting for its own take um and so the graph though the k is the number of iterations so the number of time steps so that's the x-axis and the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.792,
    "end": 1909.773,
    "text": " The y-axis is how close you are from the minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.033,
    "end": 1912.513,
    "text": "And it's in log scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.014,
    "end": 1924.976,
    "text": "So as you can see, the blue curve is going to get like, in 100 iterations, it's going to get basically 10 to the minus 4, 10 to the minus 5 distance from the minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.617,
    "end": 1927.097,
    "text": "So it's like super, super close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.157,
    "end": 1929.338,
    "text": "It basically gets there in 100 iterations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.618,
    "end": 1935.079,
    "text": "When you take the other normal gradient descent methods, where you see that it's going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.424,
    "end": 1943.485,
    "text": " So yeah, this is really the advantage of using second order methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.705,
    "end": 1960.671,
    "text": "And what I mean by second order methods is that by second order means that you actually double the state space to introduce velocities so that you not only have a dynamical system over positions, but you have a dynamical system of velocities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.371,
    "end": 1964.672,
    "text": "And so it means that you have a physical notion of acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.291,
    "end": 1971.192,
    "text": " because acceleration is a movement of velocities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.693,
    "end": 1986.519,
    "text": "And so if you double the state space by saying, this is position, this is velocities, and you say, I have a motion in this, like a state space that's twice as big, then you have a meaningful notion of acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.92,
    "end": 1988.96,
    "text": "And this is really powerful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.521,
    "end": 1992.442,
    "text": "And so you can see already a parallel here, which is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.343,
    "end": 2005.965,
    "text": " Antonio Monte Carlo also has this notion of acceleration in some way, at least just intuitively, because we also double the size of the state space to introduce velocities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.006,
    "end": 2012.747,
    "text": "And so it turns out that this intuition is actually, you can make it into a formal correspondence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.607,
    "end": 2018.948,
    "text": "And this is, I think, this is something that quite interests me, to be honest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.535,
    "end": 2040.226,
    "text": " so if you if you remember if we come back to the intuition for sampling the intuition for sampling through monte carlo methods is we have a target distribution that we want to sample from so we're going to run a dynamic a random dynamic towards that towards that distribution now what makes sampling efficient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.334,
    "end": 2059.946,
    "text": " is that the distribution that characterizes the process, because again the process is random, so that each time it is at a random location that is characterized by a distribution, what makes sampling efficient is that the distribution characterizing the process just converges as fast as possible to the thing that you want to sample from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.927,
    "end": 2061.987,
    "text": "So there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.726,
    "end": 2070.354,
    "text": " This is to say that you can think of sampling as an optimization on the space of probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.935,
    "end": 2076.682,
    "text": "You want to move your probability distribution of the process as fast as possible to your target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.97,
    "end": 2084.394,
    "text": " And so you can see from there that sampling is actually not so different from variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.696,
    "end": 2087.857,
    "text": "It's just the same idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.877,
    "end": 2105.469,
    "text": "Only variational inference, you're typically going to take a parameterized family of distributions and approximate the target, while here you have a non-parameterized family that's given by your dynamic that's going to perfectly match the target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.101,
    "end": 2125.189,
    "text": " So again, so with that, I want you to have the take-home message that sampling, you can think about it as an optimization on the space of probability distributions in the sense that you have a target distribution and you want to get there as fast as you can with the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.23,
    "end": 2136.995,
    "text": "Now, let's suppose, and so here is the crucial connection between sampling and optimization in the way that we've described it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.283,
    "end": 2145.604,
    "text": " Let's suppose that you run this accelerated optimization scheme on the space of probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.684,
    "end": 2162.047,
    "text": "Then the process, so you would get the dynamic on the space of the probability distributions that has a meaningful notion of acceleration through the accelerated method that was shown here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.227,
    "end": 2167.388,
    "text": "So if you look at what kind of dynamic this really gives you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.641,
    "end": 2176.886,
    "text": " It gives you a process which is given by a stochastic differential equation that is known as underdumped Langevin dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.547,
    "end": 2181.989,
    "text": "So there's an equation for it in, I think, subsection 2.8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.43,
    "end": 2197.278,
    "text": "But the point is underdumped Langevin dynamics is a stochastic differential equation whose density or probability distribution stalls this accelerated optimization problem on the space of probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2198.635,
    "end": 2208.725,
    "text": " So just from there, you know, that under that long dynamics is going to be a very efficient sampler because it meaningfully accelerate and it gets to the target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.906,
    "end": 2210.767,
    "text": "I mean, quite fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.065,
    "end": 2218.813,
    "text": " The problem is under large band dynamics, you cannot simulate it accurately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.833,
    "end": 2224.24,
    "text": "Well, you can simulate it accurately, but you cannot simulate it exactly on your computer in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.84,
    "end": 2230.027,
    "text": "So this comes back to the numerical integration problem that we discussed just before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.463,
    "end": 2253.498,
    "text": " um and so you have to to find a way to to discretize or or in other words implement underdumped longer bound dynamics on your computer in such a way that you retain that the thing that you implemented on the computer retains this meaningful notion of acceleration and so it turns out that you can see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.875,
    "end": 2273.22,
    "text": " on Hamiltonian Monte Carlo as a faithful numerical discretization or numerical implementation of underdamped Langevin dynamics that's going to preserve these acceleration properties and therefore this efficient sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.38,
    "end": 2278.881,
    "text": "So this is all like a lot of interesting connections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.673,
    "end": 2292.338,
    "text": " But basically what I want to get at is you really have this notion of acceleration that permeates, well, I guess physics, but here it permeates sampling and it permeates optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.019,
    "end": 2301.402,
    "text": "And so the method that was shown here about optimization and Hamiltonian Monte Carlo, they're just the same in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.602,
    "end": 2303.243,
    "text": "Only one is applied to optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.963,
    "end": 2308.025,
    "text": "The other is applied to optimization on probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.602,
    "end": 2332.864,
    "text": " sampling great i guess last question on this part what is the shadow hamiltonian and why does it sound so cool i know right yeah it's uh it's really cool um it's a really cool name so the shadow hamiltonian is um okay so so let's go back to the hamiltonian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.142,
    "end": 2338.945,
    "text": " Um, so we have a Hamiltonian and I want to simulate the dynamic that preserve the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.065,
    "end": 2340.866,
    "text": "We want to implement that on the computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.627,
    "end": 2343.888,
    "text": "We're going to do that through geometric integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.989,
    "end": 2350.212,
    "text": "Geometric integration gives you a bunch of algorithms to preserve the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.632,
    "end": 2356.336,
    "text": "I mean, a bunch of algorithms they can implement on the computer and they're going to preserve the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.256,
    "end": 2360.278,
    "text": "Um, do they actually really preserve the Hamiltonian?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.03,
    "end": 2362.411,
    "text": " It turns out that no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.711,
    "end": 2381.899,
    "text": "So what I, what I said before is a bit of a shortcut, like because the numerical integration or that you get through any, any numerical methods, including geometric integration is not going to exactly preserve the Hamiltonian, but it's going to preserve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.341,
    "end": 2394.046,
    "text": " what people call a shadow Hamiltonian, which is almost the same as the Hamiltonian, but with extra terms that sort of vanish if the time step is very short.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.487,
    "end": 2411.834,
    "text": "So this is to say that your numerical dynamic implemented through geometric integration is going to exactly preserve the shadow Hamiltonian and approximately preserve the true Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.611,
    "end": 2420.934,
    "text": " And so in the papers, we show, I don't know if it's, well, it's probably algorithm dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.095,
    "end": 2430.158,
    "text": "But basically, depending on the algorithm that you choose, you want to show to what extent the shadow Hamiltonian truly approximates the true Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.819,
    "end": 2438.862,
    "text": "The virtue of geometric integration methods is that actually the shadow Hamiltonian turns out to be extremely close to true Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.471,
    "end": 2446.795,
    "text": " which means that you can take a very long time steps and still be very good at preserving the true Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.516,
    "end": 2457.301,
    "text": "So here you don't, when you implement these methods, you don't exactly preserve the true Hamiltonian, but you do, you still do it pretty well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.882,
    "end": 2468.508,
    "text": "And so in Hamiltonian Monte Carlo, the momentum refreshment and Metropolis, crucially the Metropolis Hastings accept rejects that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.525,
    "end": 2477.669,
    "text": " is going to correct for those failures of truly preserving the Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.149,
    "end": 2493.197,
    "text": "So even though you don't exactly preserve the Hamiltonian in your numerical integration in Hamiltonian Monte Carlo, the Metropolis-Hastings accept-reject step is going to correct for this inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.937,
    "end": 2497.999,
    "text": "And so this is really the true beauty of Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.102,
    "end": 2521.65,
    "text": " is that even though you get a lot of things that are not exactly preserved when you implement things on a computer thanks to metropolis hastings overall your sampling is going to be perfect in the sense that you're going to truly preserve your target distribution so this is really the key",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.491,
    "end": 2531.742,
    "text": " Now a follow-up question to that is, okay, well, if Metropolis-Hastings is just so crucial and it just gives your dynamic...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.542,
    "end": 2553.132,
    "text": " the property that it's going to preserve whatever it does even if it samples really badly if you add metropolis hastings it's still gonna um preserve your target distribution then why can't you just come up with the average process like whatever kind of process and that metropolis hastings at the end",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.255,
    "end": 2583.272,
    "text": " and so you can do that you can take any kind of process um and after and so let's say you take a random process it could be the worst in the world let's say you wanted to sample from a gaussian and you actually take a brownian motion now this is clearly not going to work because brown emotion just goes all over the place it could go infinitely far brown emotion it's just like random motion right completely random motion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.187,
    "end": 2596.451,
    "text": " No, there is structure to it, but there's no, the structure in Brownian motion means that it's touched that Brownian motion is just going to just spread really, really far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.071,
    "end": 2600.232,
    "text": "So Brownian motion is not going to preserve your target distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.972,
    "end": 2603.493,
    "text": "So it's going to, and it's also going to be very slow by the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.533,
    "end": 2606.674,
    "text": "So it's not going to be a good sampler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.754,
    "end": 2611.495,
    "text": "If you add Metropolis Hastings on Brownian motion, which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.699,
    "end": 2624.13,
    "text": " You integrate Brownian motion, so you simulate a step of Brownian motion on the computer, and then you do Metropolis-Hastings to know whether you should accept or reject that step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.791,
    "end": 2627.394,
    "text": "Metropolis-Hastings will tell you whether you should do it or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.052,
    "end": 2640.235,
    "text": " You either accept and you stay and you keep going from that new position or you reject and you start from where you started from and take a new sample, accept, reject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.715,
    "end": 2642.136,
    "text": "If you accept, you keep going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.296,
    "end": 2645.216,
    "text": "If you reject, you go back and you sort of go like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.876,
    "end": 2650.358,
    "text": "So if you do metropolis hastings there, your stumbler is going to be exact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.458,
    "end": 2652.438,
    "text": "So it is going to preserve the target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.918,
    "end": 2655.599,
    "text": "And so you're going to have accurate sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.498,
    "end": 2659.039,
    "text": " And so this is crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.059,
    "end": 2662.561,
    "text": "This really highlights the importance of Metropolis-Hastings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.462,
    "end": 2671.006,
    "text": "But, and there is a big but, your stamper here is going to be extremely slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.687,
    "end": 2679.692,
    "text": "And it's going to be extremely slow, first of all, because random motion in and of itself, it doesn't at all preserve the target distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.712,
    "end": 2686.196,
    "text": "I mean, it just goes all over the place and you just want to sample a lot around the mode of the Gaussian, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.017,
    "end": 2700.986,
    "text": " So it means that Metropolis Hastings will reject a lot of your steps, because a lot of your steps will try to go further away while you want to stay around the mode, typically, of the Gaussian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.206,
    "end": 2703.367,
    "text": "So you're going to do a lot of steps for nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.988,
    "end": 2712.433,
    "text": "And also, Brownian Motion just does not have the qualities that make a sampler efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.703,
    "end": 2731.157,
    "text": " And so the reason why Hamiltonian Monte Carlo is so good is because it's able to integrate Metropolis Hastings and still preserve a lot of other properties that make the sampler efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.098,
    "end": 2741.606,
    "text": "So if we remember Hamiltonian Monte Carlo has this geometric integration that does not exactly preserve the Hamiltonian, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.597,
    "end": 2747.204,
    "text": " it still does it pretty well, approximately, by preserving a shadow Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.704,
    "end": 2751.43,
    "text": "So this means already that integration step is going to be really good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2751.51,
    "end": 2756.477,
    "text": "So there's going to be a lot of acceptance in the metropolis Hastings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.778,
    "end": 2767.8,
    "text": " So and also the way the way the scheme is set up, there's going to be a lot of acceptance step in the Metropolis Hastings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.82,
    "end": 2775.382,
    "text": "So it means that most of the samples that you would draw will actually be used instead of being rejected and you have to start over again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.402,
    "end": 2777.102,
    "text": "So that's one advantage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.022,
    "end": 2786.184,
    "text": "The other the other advantage of Hamilton and Monte Carlo, and this is a crucial one, and we kind of discussed this last week, is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.467,
    "end": 2792.711,
    "text": " One crucial thing to be a good sampler is this idea of time irreversibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.611,
    "end": 2801.136,
    "text": "And so I'll emphasize it again because it's really crucial and there's a lot of literature on this and it's something that we reviewed also in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.156,
    "end": 2806.4,
    "text": "So a sampler that is time irreversible is always going to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.808,
    "end": 2826.33,
    "text": " better or it's at least not going to be worse than a than a sampler that is time reversible so what do we mean by this a sample is time irreversible um if and only if uh were you to play the dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.823,
    "end": 2842.308,
    "text": " forward or backward, there will be... So going on your bullet point here, a sample is time-reversible if and only if you were to play the dynamics forward or backward in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.608,
    "end": 2849.15,
    "text": "So forward in time, and then maybe you would play them by reversing the movie, by playing the movie backward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.365,
    "end": 2879.312,
    "text": " uh if you were to do that then you um then the the two movies that you would see would be qualitatively the same and statistically the same so the process is time reversible if and only if the process if you run it forward or backward it's basically statistically the same now what does this mean in practice well if your process is time reversible then it's going to backtrack very often actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.457,
    "end": 2899.371,
    "text": " So it means that you would be somewhere in the probability distribution just sampling there and you will go forward and then you probably go backward and so on and you kind of get stuck in a region until you go somewhere else, but it's just going to be very slow to move around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.553,
    "end": 2910.183,
    "text": " It's going to be very slow to get good sampling because it's going to take you a long time to visit all the regions of the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.784,
    "end": 2917.352,
    "text": "In other words, the distribution characterizing the process is going to move very slowly to the target distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.213,
    "end": 2919.455,
    "text": "That's another way to look at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.771,
    "end": 2930.037,
    "text": " If the process is time irreversible, on the other hand, then it's a lot less likely to go backward during the sampling process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.457,
    "end": 2934.92,
    "text": "So it means that it's going to visit the target distribution a lot more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.96,
    "end": 2936.381,
    "text": "I mean, it's just going to go around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.881,
    "end": 2946.908,
    "text": "Imagine if you're not allowed to go backward just as a human being and you're walking around, you're just going to end up in many more places than if you were allowed to go backward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.356,
    "end": 2958.478,
    "text": " And if you were just going backward all the time to where you started, then you wouldn't be able to do a lot of visiting, so it would be a bad sampler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.239,
    "end": 2964.66,
    "text": "So I guess there's some straightforward intuition there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.9,
    "end": 2974.622,
    "text": "So one idea in sampling is we want to optimize the extent to which a sampler is time irreversible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.942,
    "end": 3000.696,
    "text": " increase time irreversibility as much as we can to force the sampler to just move around as much as possible so that's an idea and and it is explored currently i guess it's a bit of an open problem of how do you really do that and how do you implement that on a computer in a way that you know works and preserves all the properties um but the point i want to i wanted to get to is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.655,
    "end": 3006.578,
    "text": " Um, Metropolis Hastings is a blessing and it's also a curse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.439,
    "end": 3014.345,
    "text": "It is a blessing because when you add it to any kind of process, you will make your sampling unbiased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.645,
    "end": 3029.777,
    "text": "So it means that you will sample the right distribution, even though you're implementing this on a computer and there can be a lot, uh, so many issues with the numerical, numerical integration, numerical approximation and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.144,
    "end": 3041.468,
    "text": " But it's also a curse because whenever you add Metropolis Hastings on a process, it's going to make it time reversible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.488,
    "end": 3055.814,
    "text": "So actually, yeah, if you just took a random process and added Metropolis Hastings, you would get something that's inevitably going to be quite low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.139,
    "end": 3062.7,
    "text": " Um, and so now you get to the, you know, the problem or the conundrum where, what, what do I do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.04,
    "end": 3065.26,
    "text": "Um, do I go for unbiased sampling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.3,
    "end": 3066.501,
    "text": "Do I care about accuracy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.801,
    "end": 3074.562,
    "text": "Um, and then I should add a metropolis Hastings or do I not care about accuracy so much?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.762,
    "end": 3081.443,
    "text": "Um, and then I should not have metropolis space Hastings and it's going to go faster generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.683,
    "end": 3086.384,
    "text": "Um, and so Hamiltonia Monte Carlo actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.136,
    "end": 3089.539,
    "text": " of the blessing and does not have the curse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.279,
    "end": 3093.303,
    "text": "And this is why Hamiltonia Monte Carlo is just so good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.263,
    "end": 3120.897,
    "text": " again it's also complementary to all of the things that we've been discussing and the reason why hamiltonian monte carlo is blessed and not cursed is because the momentum the how do you call this the metropolis hastings is just done on the momentum refreshment step as opposed to being done on the overall dynamic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.883,
    "end": 3126.648,
    "text": " So, because if you remember, you do geometric integration to simulate Hamiltonian dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.208,
    "end": 3140.261,
    "text": "Now, every once in a while, you will take a momentum refreshment and then do Metropolis Hastings on that momentum refreshment, as opposed to doing Metropolis Hastings on both the Hamiltonian dynamic and the momentum refreshment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.222,
    "end": 3149.984,
    "text": " So it's not something that I can really explain how that works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.104,
    "end": 3165.549,
    "text": "But it turns out that by just doing the metropolis, I mean, not only Monte Carlo is a way of having metropolis Hastings in a way that you preserve the unbiasedness so that your sampling is accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.425,
    "end": 3170.788,
    "text": " But you don't sacrifice the time irreversibility, and so you get both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.809,
    "end": 3178.994,
    "text": "And this is because the metropolis hitting is just on one of the components and not on both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.316,
    "end": 3186.48,
    "text": "To kind of connect that to an example, as we move into active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.186,
    "end": 3205.887,
    "text": " here we have some probability isocontours some we have the high probability carpool lane and then we have some lower probability lanes and uh we can go different speeds in these lanes and we want to have a full accelerated model here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.116,
    "end": 3226.557,
    "text": " it's almost like the mh is is refreshing our velocity just asking when we want to change the lanes but it's not our full self-driving car metropolis hastings algorithm but we're able to use our position and acceleration when we're in our lane",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.577,
    "end": 3237.141,
    "text": " to take full advantage of the acceleration following the shadow road, not necessarily the true road, but the shadow road is close enough or the shadows on the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.921,
    "end": 3250.386,
    "text": "And then lane changes are these computationally costly and reversible, but still super useful propositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.567,
    "end": 3252.987,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.008,
    "end": 3257.269,
    "text": "And they're actually not computationally costly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.682,
    "end": 3260.825,
    "text": " They would be if you were to reject many samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.947,
    "end": 3266.972,
    "text": "But here in Hamilton and Monte Carlo, typically you don't get to reject many samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.572,
    "end": 3272.137,
    "text": "So yeah, that's such a great picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.197,
    "end": 3279.345,
    "text": "So the car follows the shadow road by just doing geometric integration and following the shadow Hamiltonian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.815,
    "end": 3288.503,
    "text": " Every once in a while, you get a momentum refreshment, a velocity refreshment, which is, oh, now I move to the first lane or the second lane, third lane, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.244,
    "end": 3299.333,
    "text": "And you get a Metropolis Hastings correction step that says, do I accept this proposal of lane change or do I reject it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.613,
    "end": 3300.494,
    "text": "And so on it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.955,
    "end": 3305.138,
    "text": "So how does this connect to active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.133,
    "end": 3332.536,
    "text": " well i mean great question uh so in active inference in active inference proper you don't have any sampling in active inference uh whenever you want to scale active inference to implement it to solve any kind of problem in the world you want to do something because there's a lot of computations that are not going to be tractable otherwise and so one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.301,
    "end": 3339.164,
    "text": " One cool example is in the figure after this, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.264,
    "end": 3350.45,
    "text": "So for any kind of decision-making in active inference, you need to approximate the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.47,
    "end": 3351.911,
    "text": "This figure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.232,
    "end": 3354.312,
    "text": "No, the one just before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.332,
    "end": 3354.993,
    "text": "Here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.276,
    "end": 3356.897,
    "text": " Yeah, perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.218,
    "end": 3368.785,
    "text": "So if you look at the second equation there, you get this minus log p of an action sequence equals expectation of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.426,
    "end": 3375.931,
    "text": "This minus log p of the action sequence is our notation in this paper for the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.092,
    "end": 3380.014,
    "text": "So the expected, I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.874,
    "end": 3406.156,
    "text": " you probably all know this the expected free energy is given by the expectation of something now typically and when you have a very high dimensional model which happens in in most applications i would say you get a very high dimensional expectation what is an expectation an expectation is an integral with respect to a probability distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.014,
    "end": 3409.055,
    "text": " How do you compute expectations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.616,
    "end": 3411.177,
    "text": "Well, you do that through sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.797,
    "end": 3420.203,
    "text": "Or at least, sampling is the way to compute high dimensional expectations that's the most efficient in statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.044,
    "end": 3425.827,
    "text": "And this is the reason why sampling is studied in statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.947,
    "end": 3428.229,
    "text": "It's because that's how you solve these problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.449,
    "end": 3432.352,
    "text": "I mean, expectations just come up everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.525,
    "end": 3463.965,
    "text": " just like so many things about machine learning boil down to computing expectations and so here in particular the expectation that is very dear to to us very close to our hearts is the one that gives you the expected free energy the expected free energy is the expectation of something so how do you compute that in a high dimensional model uh where you have to use something and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.445,
    "end": 3469.747,
    "text": " There comes the usefulness of Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.687,
    "end": 3479.531,
    "text": "If you have a discrete state space model, you're not going to be able to use Hamiltonian Monte Carlo because Hamiltonian Monte Carlo is on continuous state space models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.292,
    "end": 3482.773,
    "text": "It's on continuous state space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.813,
    "end": 3485.474,
    "text": "We talked about continuous positions, continuous velocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.974,
    "end": 3491.957,
    "text": "I talked about sampling of probability distribution on my desk, which is a continuous state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3492.437,
    "end": 3493.698,
    "text": "So you're not going to be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3494.614,
    "end": 3501.358,
    "text": " use Hamiltonian Monte Carlo if you have a partially observed Markov decision process and you're doing active inference there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.958,
    "end": 3518.388,
    "text": "But if you have, for example, I've been talking recently to Ryan Smith who does a lot of active inference and he's really leading a lot of the modeling work with active inference and real data of patients of all sorts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.669,
    "end": 3524.071,
    "text": "Many medical data and also using active inference to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.221,
    "end": 3527.003,
    "text": " model psychological experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.963,
    "end": 3537.87,
    "text": "And one of the things he told me about, well, is, okay, well, I have a bunch of data and partially observed Markov decision process is just not going to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.131,
    "end": 3540.312,
    "text": "Why is it not going to do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.372,
    "end": 3544.595,
    "text": "Because the data that he has lives on a continuous space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.615,
    "end": 3553.762,
    "text": "I don't remember exactly what it was, but let's just say for the sake of example, that that data was, you know, the temperature in the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.625,
    "end": 3562.548,
    "text": " And people had to, the subjects had to infer the temperature in the room based on their sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.689,
    "end": 3565.51,
    "text": "So that's a continuous state space problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.49,
    "end": 3580.236,
    "text": "Now imagine that you asked someone to infer the temperature in a room, then maybe you would change the temperature in the room or not, and you would ask them again, change the temperature or not, and ask them again, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.371,
    "end": 3594.723,
    "text": " In when you have this sort of setup, you have a discrete, you have a phenomenon that unfolds in discrete time, because you just repeatedly ask some question and some time elapses between the questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.426,
    "end": 3599.908,
    "text": "But you also have a state space that continues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.765,
    "end": 3612.692,
    "text": " When you have this sort of data, then the kind of model that you want to use is a partially observed Markov decision process that like we know and love, but the state space is going to be continuous instead of discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.912,
    "end": 3614.733,
    "text": "The time is still going to be discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.374,
    "end": 3623.098,
    "text": "Now, when you have this sort of model, I just want to say it as an aside that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.243,
    "end": 3638.248,
    "text": " For the moment, a lot of the modeling work and simulation work in active inference uses discrete state space POMDPs, partially observed Markov decision processes, just because it's been sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.548,
    "end": 3642.29,
    "text": "And when you simulate agent, it's often like in grid worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.39,
    "end": 3649.393,
    "text": "And when you maybe have state spaces in experiments, they often by design discrete because it's just easier to handle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.029,
    "end": 3659.756,
    "text": " But that's not an assumption, a simplifying assumption that we're going to be able to keep for that much longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3659.776,
    "end": 3663.619,
    "text": "There's just so many things that you cannot account with these sort of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.219,
    "end": 3672.826,
    "text": "So one other model that is interesting to have is a partially observed markup decision process, but with a continuous state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3674.142,
    "end": 3701.543,
    "text": " with those you get the problem of you know estimating the expected free energy which would be then an expectation or in other words an integration an integral in a continuous state space and so how do you do that efficiently if you are in a high dimensional state space where you use Hamiltonian Monte Carlo i think this would be really the the best method so this is how you join the dots",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.88,
    "end": 3712.746,
    "text": " In this paper, we didn't talk about sampling in discrete space because the methods are quite different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.926,
    "end": 3715.608,
    "text": "So we really had to choose what to focus on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.188,
    "end": 3720.891,
    "text": "There's, of course, a lot more methods in the literature than there are in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.971,
    "end": 3726.375,
    "text": "We just wanted to sort of review what were the main ones and what people really used in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.616,
    "end": 3730.778,
    "text": "But, you know, when you have the expected",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.946,
    "end": 3754.795,
    "text": " computing the expectation that defines the expected pre-entity can often be a little bit easier because it comes down computationally to a bunch of matrix multiplications, matrix vector multiplications, which generally is doable unless",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.754,
    "end": 3757.835,
    "text": " I mean, the state space is enormously high.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.255,
    "end": 3761.456,
    "text": "And then we'd have to think of sampling methods in discrete space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3763.197,
    "end": 3777.983,
    "text": "But as soon as you move to a partially observed Markov decision process with a continuous space, which I argue and Ryan Smith argues, and I'm sure a lot of people have run into this, as soon as you have this kind of model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.083,
    "end": 3783.385,
    "text": " Well, yeah, you just have an integration problem in continuous space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.485,
    "end": 3785.925,
    "text": "And so Hamiltonian Monte Carlo is the way to go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.786,
    "end": 3789.167,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.787,
    "end": 3798.43,
    "text": "And your 2020 paper was a synthesis on some of the discrete state space formalisms of active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.45,
    "end": 3806.212,
    "text": "So it's very interesting to see how you're now talking about where continuous time, continuous state spaces can come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.232,
    "end": 3806.292,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.598,
    "end": 3818.305,
    "text": " How interesting that active inference has the capacity to deal with discrete and continuous state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.166,
    "end": 3831.255,
    "text": "And sometimes we lean on one leg or the other leg more, but it spans the gap in a way that's actually like a value adding, not like there's some sort of missing piece from one side or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.275,
    "end": 3834.177,
    "text": "Yeah, yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.727,
    "end": 3839.309,
    "text": " I think active inference is great because it's so flexible in the sort of models that you can consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.37,
    "end": 3848.053,
    "text": "But yeah, I mean, historically, the first models to be developed were continuous space and continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.974,
    "end": 3856.998,
    "text": "And then it works quite well because you can take gradients of the free energy and just minimize them over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.438,
    "end": 3863.961,
    "text": "So you could get around basically everything by doing a gradient descent on free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.901,
    "end": 3867.402,
    "text": " And then after that, around late, so that was like 2010.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3867.822,
    "end": 3877.925,
    "text": "And then around 2015, people started thinking, Okay, well, how do I model discrete time decision making with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3881.026,
    "end": 3886.148,
    "text": "And typically, the decision making tasks, at least the simple one, there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3886.849,
    "end": 3895.872,
    "text": " studied in behavioral neuroscience, just to make things simple, the number of actions that you have is discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.592,
    "end": 3899.893,
    "text": "So you have a finite number of actions, which is pretty small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.313,
    "end": 3903.634,
    "text": "You would also have a finite number of states, which would be pretty small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3904.835,
    "end": 3908.956,
    "text": "And then people started to think, okay, well, how do we use active inference to actually account for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.585,
    "end": 3919.272,
    "text": " And so that's how the whole expected free energy and partially observed market decision processes came into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.633,
    "end": 3927.178,
    "text": "And now the community has grown a lot and there's more and more data that we want to account for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.198,
    "end": 3929.12,
    "text": "There's more and more projects that are going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.146,
    "end": 3935.547,
    "text": " And you know, people are realizing, and I think, I mean, it's an obvious realization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.627,
    "end": 3948.29,
    "text": "It's just not surprising at all that these two models developed in 2010, 2015, they're just not going to account for everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.99,
    "end": 3950.371,
    "text": "Think about other kinds of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.311,
    "end": 3953.572,
    "text": "It really depends on what kind of data you have at hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.303,
    "end": 3962.585,
    "text": " important and obvious type of model would be partially observed Markov decision process with continuous space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.385,
    "end": 3965.685,
    "text": "And actually, this is not a new thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.745,
    "end": 3971.847,
    "text": "I mean, people have been using these kind of models in reinforcement learning and control for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.587,
    "end": 3981.349,
    "text": "I don't know to what extent they've arrived at practically, I mean, they've arrived at practically implementable algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.889,
    "end": 3985.67,
    "text": "I don't know to what extent they're used to what extent they're state of the art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.673,
    "end": 3993.4,
    "text": " Um, but the point is they, it's something that it's a kind of model that, you know, has existed for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.081,
    "end": 4004.792,
    "text": "Um, and so this sampling is, would be a way to actually practically implement this and scale it when you want to put that within active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4005.352,
    "end": 4008.836,
    "text": "So I think, yeah, it's an important thing to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.73,
    "end": 4012.071,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.491,
    "end": 4026.427,
    "text": "Yeah, Thomas Parr also recently in a discussion on the textbook was sharing some timelines and it's just so interesting how these things have been developing and from continuous through characterization of the discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.443,
    "end": 4033.506,
    "text": " in a sense, not culminating, but being synthesized in your 2020 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.267,
    "end": 4049.415,
    "text": "And now there's, with an increased emphasis on empirical data, the desire to bring in a lot of these methods that actually help us implement it rather than just think about it really parsimoniously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.175,
    "end": 4054.818,
    "text": "So what is your active inference method?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.016,
    "end": 4075.106,
    "text": " representation in the figure of the running person and then how do the variables and the processes described in this figure relate to all of this you know five hours of talking about shadow hamiltonians and all of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.44,
    "end": 4077.34,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.48,
    "end": 4079.601,
    "text": "Yeah, that's a broad question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.641,
    "end": 4083.083,
    "text": "We might need another 10 hours to answer that in detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.103,
    "end": 4095.287,
    "text": "But just very short, well, so the active inference section was meant to be as complete as possible, even though it was very short.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.187,
    "end": 4102.33,
    "text": "And by completeness, I mean that we started by deriving active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.75,
    "end": 4105.131,
    "text": "And deriving active inference from first principles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.535,
    "end": 4116.524,
    "text": " So this is really what the Free Energy Principle does, even though we weren't able, of course, to review the whole Free Energy Principle in like one or two pages, but we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.042,
    "end": 4123.045,
    "text": " What we focused on was deriving the expected pre-energy from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.105,
    "end": 4126.967,
    "text": "And then from there you get the full active inference algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4127.227,
    "end": 4129.748,
    "text": "So proactive inference algorithm, I think you just went past it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.768,
    "end": 4130.549,
    "text": "It's just below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.569,
    "end": 4135.671,
    "text": "If you go slightly below, I think maybe page 29 or page 30.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.267,
    "end": 4140.588,
    "text": " Yeah, still I think next, yeah, realizing adaptive agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4140.968,
    "end": 4146.43,
    "text": "Yeah, so this is the active inference algorithm, like 0.1, 2.3 or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.95,
    "end": 4156.474,
    "text": "So just from a duration of the expected free energy, you actually get as a corollary from there, the active inference algorithm that we know and love.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.614,
    "end": 4159.395,
    "text": "This is actually a more general version than what people use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.335,
    "end": 4161.956,
    "text": "And I'd be excited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.156,
    "end": 4164.477,
    "text": "And I'm actually talking to people to actually implement that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.97,
    "end": 4170.193,
    "text": " But this is actually the most general version that has been established in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.213,
    "end": 4181.659,
    "text": "It is more general in a meaningful way, in the sense that all the beliefs, all the probability distributions, they are over trajectories or sequences of events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4182.439,
    "end": 4190.924,
    "text": "So it means that all the computations, they not only consider events at a particular time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.941,
    "end": 4197.869,
    "text": " in the future, for example, where they consider trajectories, so sequences of events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.51,
    "end": 4207.585,
    "text": "And so this is equivalent to considering different events at different points in time and their kind of independencies and dependencies between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.331,
    "end": 4236.714,
    "text": " So this is just to say that if you would take then this algorithm and you would perform a mean field approximation over time, which is saying that all the things that you see in the future are sort of independent of each other at different points in time, then you would recover what people typically use in the literature, which is easily implementable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.408,
    "end": 4261.876,
    "text": " The point I want to make here is that you can actually not have that limitation and have things that are a bit more complex, that are able to capture more complex relationships in the time series and input that they might be receiving, like the kind of sensory data that they might be receiving, and the kind of generative models that they would have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.317,
    "end": 4266.478,
    "text": "So anyway, this is the active inference algorithm, the most general one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.202,
    "end": 4272.225,
    "text": " We derive that from first principles by deriving the expected free energy from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.026,
    "end": 4277.849,
    "text": "And so this relates us to that figure that you just showed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.35,
    "end": 4288.036,
    "text": "So that figure that you showed with S, O, and A is the starting point of the free energy principle described in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.837,
    "end": 4294.861,
    "text": "And so the point is that we want to describe decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.86,
    "end": 4298.983,
    "text": " We want to describe actions as a function of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.144,
    "end": 4309.092,
    "text": "And we want to come up with the most general description of actions as a function of sensations to be able to account for everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.152,
    "end": 4311.094,
    "text": "That's kind of the idea of the 300 Principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.575,
    "end": 4319.641,
    "text": "So what do we do is we consider a world, a world in which there is an environment and an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.162,
    "end": 4322.243,
    "text": "And so the environment here is denoted by S.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.214,
    "end": 4325.056,
    "text": " and S is a stochastic process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.676,
    "end": 4326.977,
    "text": "Why a stochastic process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.598,
    "end": 4334.203,
    "text": "Because a stochastic process is the most general type of dynamic that exists, at least as far as I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.244,
    "end": 4339.567,
    "text": "It's really a random dynamic and it could be random in all sorts of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.627,
    "end": 4340.928,
    "text": "It could also be non-random.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.408,
    "end": 4351.636,
    "text": "We sort of take the stochastic, the random aspect as an extra ingredient just to include a lot more types of scenarios and things you can be confronted with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.149,
    "end": 4369.795,
    "text": " You partition the world into the agent, which is O and A, and the environment, which is S. And the agent, then you subdivide it into two more components, which are O and A. O are what we call the observable states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.815,
    "end": 4374.036,
    "text": "So these are like the sensations of the observations that you get at any point in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.696,
    "end": 4375.857,
    "text": "Also a stochastic process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4377.082,
    "end": 4383.089,
    "text": " And finally, you have the autonomous states, or you could think about it loosely as the active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.41,
    "end": 4385.852,
    "text": "They turn out to be the active states in the implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.653,
    "end": 4393.742,
    "text": "But so the active states, they're really, you know, like the models, the things you can actually activate and make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4394.52,
    "end": 4397.422,
    "text": " and then activate to influence the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.663,
    "end": 4408.167,
    "text": "So we just partitioned the world into these three sets of states that interact and evolve in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.247,
    "end": 4411.709,
    "text": "They're both really stochastic processes that interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.31,
    "end": 4423.676,
    "text": "And then the goal of the theory principle, at least when applied to decision-making, is that you want to describe A as a function of O. So what happens as an organism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.413,
    "end": 4426.309,
    "text": " you have control over A,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.648,
    "end": 4455.911,
    "text": " you have access to O but you don't have direct control of O over your sensations and you don't have access to S because that's the environment and beyond the mark of like it beyond you beyond your envelope so you don't have access to S you know O and you can control A, A is what you can choose from and so the free energy principle just answers the question okay well if I take this very general description of the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.468,
    "end": 4462.311,
    "text": " what is the equation of A as a function of O?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.351,
    "end": 4464.353,
    "text": "How can I describe A as a function of O?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.494,
    "end": 4481.39,
    "text": "And so it turns out that there's some mild assumptions in this, and these assumptions, they're guided by physical considerations about how humans are and how humans interact with the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.134,
    "end": 4506.776,
    "text": " they're very mild but whenever you take these assumptions you get that the active states or the autonomous states minimize expected free energy so so this is like a very succinct um derivation of the expected free energy from first principles we start with the partition of the world we describe active states as a function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.509,
    "end": 4508.329,
    "text": " of observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.87,
    "end": 4514.652,
    "text": "And so it turns out that the expected free energy is what describes the active states as a function of observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.093,
    "end": 4535.1,
    "text": "And so the basic active inference algorithm which everybody uses and which we have also in the paper is about, it's all about computing the expected free energy and then selecting actions that minimizes expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4535.88,
    "end": 4537.121,
    "text": "So the expected free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.028,
    "end": 4542.589,
    "text": " As we saw, I think it's in the next figure, so the one with all the panels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.969,
    "end": 4545.99,
    "text": "We've seen it a couple times already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.57,
    "end": 4550.51,
    "text": "It's an expectation with posterior distributions in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.811,
    "end": 4564.833,
    "text": "What I mean by posterior distributions here is that these are distributions conditioned on the history of the agent, so on the observations that he has already seen and on the actions that he has already taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.027,
    "end": 4575.114,
    "text": " In any case, so you have the expected free energy is an expectation with posterior distributions within.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.134,
    "end": 4578.956,
    "text": "So it means that to compute the expected free energy, you have two problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.497,
    "end": 4592.086,
    "text": "You have computing posterior distributions through Bayesian inference, Bayes rule, and you then, once you have them, you can plug them in into this equation, and then you need to compute the expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.194,
    "end": 4594.635,
    "text": " and then you get the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.075,
    "end": 4598.938,
    "text": "So the first thing is about computing the posterior distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4599.598,
    "end": 4606.583,
    "text": "Now, what has been proposed in the literature so far is, well, how do you do approximate inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.603,
    "end": 4608.784,
    "text": "How do you actually approximate distributions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.804,
    "end": 4613.588,
    "text": "You do that through variational inference or approximate inference by minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.124,
    "end": 4625.673,
    "text": " The treatment here, the derivation, and our aim was to provide a derivation that was as conceptually simple as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.374,
    "end": 4631.638,
    "text": "Actually, it highlights that the free energy is not the most important thing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.06,
    "end": 4635.302,
    "text": "The important thing is really the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.642,
    "end": 4641.527,
    "text": "The free energy is just a tool to approximate the posterior distributions to then get the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.358,
    "end": 4645.66,
    "text": " But you could actually use any other type of divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.661,
    "end": 4651.044,
    "text": "The free energy is just like a KL divergence plus some term that makes the whole thing tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.184,
    "end": 4655.667,
    "text": "And so you can minimize the KL divergence to approximate the targeted distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.407,
    "end": 4663.172,
    "text": "But actually, what this view highlights, and by the way, I'm not at all against the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.232,
    "end": 4664.313,
    "text": "I think it's really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4664.833,
    "end": 4667.615,
    "text": "And there's so many methods to minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.636,
    "end": 4694.851,
    "text": " and if you can do that then fine and sure go for it like way to go but imagine you could not do that it would not at all be a problem because you could use any other kind of divergence to solve those inference problems um so so that would be the first step you're going to approximate those procedure distributions by doing some kind of approximate inference which would be through minimization of the energy or through minimization of something else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.115,
    "end": 4699.438,
    "text": " And then you have the second step, which is computing the expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.458,
    "end": 4711.407,
    "text": "Now, either you're in a low number of states, discrete states, POMDP-like thing, and it's all a matter of vector matrix multiplications that are tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.387,
    "end": 4724.717,
    "text": "Either you have a very, very high number of discrete states, and then you need to think about sampling in discrete states, which we didn't discuss in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.66,
    "end": 4735.162,
    "text": " either you are in a continuous state space and then you have an expectation in continuous state space, and then you want to think about Hamiltonian Monte Carlo, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.183,
    "end": 4747.886,
    "text": "So now with these two steps, you have now an estimate of the expected free energy, which gives you the quality of any action sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.106,
    "end": 4752.607,
    "text": "And so it's not only the quality, but it's actually the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.465,
    "end": 4773.06,
    "text": " negative log probability of any action sequence regarding in this formalism because if you remember the you know the premise of all this was to describe actions as a function of sensations in a physical system in not even a physical system but in interacting stochastic processes um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4774.46,
    "end": 4783.265,
    "text": " And so the answer to that was, well, the expected free energy gives us, you know, gives us how actions relate to sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.286,
    "end": 4800.834,
    "text": "The expected free energy, and this is why we used the letter, we used minus log P of A as opposed to G to emphasize that the expected free energy is not just like a function of action sequences, but it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.88,
    "end": 4806.742,
    "text": " really the negative log probability of an action sequence, given some sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4808.322,
    "end": 4816.325,
    "text": "And so once you have computed the expected free energy, you had this minus log probability of an action sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.265,
    "end": 4829.75,
    "text": "If you take the exponential negative of that, the exponential negative of the expected free energy, you get the probability distribution over action sequences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.557,
    "end": 4838.782,
    "text": " And so, by the way, this exponential negative of expected free energy is what we use all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.822,
    "end": 4843.366,
    "text": "You might recognize this as the softmax of negative expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.386,
    "end": 4848.47,
    "text": "This is just all the time kind of fundamental thing in active inference models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4848.49,
    "end": 4851.313,
    "text": "So I'm really talking about the same thing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.792,
    "end": 4863.381,
    "text": " So once you take the softmax of negative expected free energy, you get p , which is the distribution of reaction sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.661,
    "end": 4865.703,
    "text": "And now you have two possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.723,
    "end": 4872.069,
    "text": "Either you want to stimulate the most likely action sequence, in which case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.17,
    "end": 4879.032,
    "text": " you want to simulate the action sequence that maximizes the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4880.713,
    "end": 4883.354,
    "text": "So in effect you have an optimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.654,
    "end": 4892.717,
    "text": "You need to find the action sequence that is going to maximize this probability distribution that's given by the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.878,
    "end": 4916.962,
    "text": " or um or you want to simulate a typical action so what do I mean a typical action a typical action or a typical action sequence is just a sample from the distribution and so if you want to sample from I mean if you want to do that then you have a sampling problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.54,
    "end": 4924.381,
    "text": " over action sequences given by the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.542,
    "end": 4929.224,
    "text": "So this is really how all these methodologies connect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4932.185,
    "end": 4934.627,
    "text": "Yeah, I think that's kind of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.647,
    "end": 4942.591,
    "text": "Yeah, one last thing is typically when we simulate active inference, we never do the sampling at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4943.071,
    "end": 4946.533,
    "text": "We always take the action sequence that minimizes expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.62,
    "end": 4954.966,
    "text": " In other words, the action sequence that maximizes that probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.347,
    "end": 4958.709,
    "text": "And this is because when we simulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.881,
    "end": 4984.297,
    "text": " things we it turns out i mean this is how people have done in the literature people are more interested in the most likely action sequence that um that an organism or an agent would produce but if you want to model data if you want to use active inference to model data then you actually want to not just simulate the most likely action sequence but simulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4985.518,
    "end": 5001.839,
    "text": " any kind of action sequence that would fall out of this and so this is really the case where you need to sample from that final distribution as opposed to do optimization so depending on the use case you either have a sampling or an optimization problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.842,
    "end": 5025.768,
    "text": " after you've um you've computed the expected free energy so this is how these whole things um fall together and and so you might be asking okay well you talked about sampling and optimization there's also a section about inference where does that fit in and so it fits in to uh it fits in on on the remark i gave that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5026.621,
    "end": 5029.944,
    "text": " you know, we have these posterior distributions within the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.025,
    "end": 5031.326,
    "text": "How do we compute them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.526,
    "end": 5032.587,
    "text": "How do we approximate them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.168,
    "end": 5035.09,
    "text": "One way is by minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5035.77,
    "end": 5039.134,
    "text": "Another way is by minimizing any other kind of divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5040.416,
    "end": 5054.423,
    "text": " And in that section over there, we just reviewed some kind of divergences that are very popular in the statistical inference literature, mainly because they have desirable properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5056.084,
    "end": 5064.268,
    "text": "And so if you weren't able to use the variation of free energy for some reason, or maybe something to be explored,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.569,
    "end": 5072.072,
    "text": " is just to use other types of divergences and just see what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5074.534,
    "end": 5083.32,
    "text": "So the open problem to be explored is whether we can get better performance by using different kinds of divergences and see what we get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.501,
    "end": 5094.928,
    "text": "Maybe there's powerful algorithms that are out there with these other types of divergences that we can make use of to do better performance, to get better performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5096.051,
    "end": 5102.676,
    "text": " Can we actually describe and quantify the improvement in performance that we get by using these other types of algorithms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.177,
    "end": 5105.879,
    "text": "When would these be appropriate and useful?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.539,
    "end": 5108.04,
    "text": "These are all open questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.982,
    "end": 5122.111,
    "text": "Another open question that I think is interesting is, can we model maladaptive behavior by using different kinds of divergences that would not work as well as the free energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.109,
    "end": 5129.393,
    "text": " And there's an interesting paper on that by Noor Sajid, I think, and colleagues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5129.854,
    "end": 5135.918,
    "text": "I think it's called Bayesian Brains and the Rainier Divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.998,
    "end": 5141.542,
    "text": "It's been published on neurocomputation, I think, last year or the year before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5142.558,
    "end": 5158.889,
    "text": " And so in that paper, instead of using the variational free energy to approximate all these posterior distributions, she used the Rennie divergence, which generalizes the KL divergence in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.631,
    "end": 5165.573,
    "text": " and showed that for different rainy divergences, you get different types of approximate posteriors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.833,
    "end": 5175.336,
    "text": "And she basically looked into what kind of differences you get from there in terms of perception, in terms of decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5176.236,
    "end": 5185.038,
    "text": "And she showed that for that particular divergence, I think the conclusion was that you basically get different phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.078,
    "end": 5186.419,
    "text": "You get different behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5187.914,
    "end": 5189.636,
    "text": " So just something to be explored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.656,
    "end": 5207.47,
    "text": "I think the upshot was that maybe, I don't remember how far the paper went in this, but I think kind of the goal was to model maladaptive behavior using some kinds of random divergences that did not work as well as the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.388,
    "end": 5233.817,
    "text": " so this is to say so this is an interesting work um one could examine other kinds of divergences and see whether you actually get better or worse performance than with the free energy uh one thing one word of caution though is the the free energy is is just so good in the sense that it uses the kl divergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.987,
    "end": 5241.596,
    "text": " And as I mentioned at the beginning, the KL average has so many properties and it's just so fundamental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.078,
    "end": 5250.067,
    "text": "It's not straightforward to see that when you first come up with it, but I guess the more I read,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5251.408,
    "end": 5262.171,
    "text": " in different disciplines and the more the KL divergence comes up and the more I see properties of KL divergence in different disciplines that just make it so interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.671,
    "end": 5266.772,
    "text": "Like for example, the KL divergence in statistical physics is the relative entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.392,
    "end": 5273.154,
    "text": "So it quantifies the amount of entropy that a distribution has with respect to another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5273.174,
    "end": 5276.955,
    "text": "Entropy, as we know, is just a very fundamental thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.91,
    "end": 5295.965,
    "text": " In information theory, the KL divergence quantifies the difference in information between two distributions, the amount of bits that you would need to... I mean, if you take two distributions A and B, the KL between the two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5297.657,
    "end": 5304.103,
    "text": " quantifies the amount of information that it takes to go from one to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.683,
    "end": 5320.818,
    "text": "So now you might object and say, okay, but KL A and B is different from KL B and A. And so how can it be that, you know, it quantifies the amount of information they need to go from A to B or B to A because it's not symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.859,
    "end": 5322.599,
    "text": "So the answer is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.389,
    "end": 5333.038,
    "text": " It's either KL of A and B that has this meaning or KL of B and A that has this meaning and I just can never remember which direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.058,
    "end": 5339.084,
    "text": "But it's one of them that has this interpretation in terms of the difference in information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.125,
    "end": 5345.13,
    "text": "Anyway, so KL is just like something, it just comes up everywhere and it's just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.522,
    "end": 5354.618,
    "text": " so useful and it has all of these nice properties which makes the free energy really a construct of choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5355.911,
    "end": 5368.235,
    "text": " Um, but that said there's other divergences, one of them, which we describe a bit in the paper, call them the maximum mean discrepancy, which I think also has nice properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.995,
    "end": 5373.396,
    "text": "It's not necessarily, well, it's a bit different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5373.517,
    "end": 5376.918,
    "text": "It's very different in terms of how you construct it from the KL divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.618,
    "end": 5381.239,
    "text": "But I think my current understanding right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5382.057,
    "end": 5389.279,
    "text": " And my current understanding right now is that if you cannot use KL, then maximum mean discrepancy is just really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5391.64,
    "end": 5402.984,
    "text": "But yeah, so the word of caution was that probably most divergences out there are not going to do as good of a job as a free energy, but some clever ones might.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.984,
    "end": 5407.405,
    "text": "And it's an open problem of determining which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.247,
    "end": 5413.349,
    "text": " And yeah, so this is how we get the link between all these different sections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5413.869,
    "end": 5417.551,
    "text": "So to do perception, we need inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5418.351,
    "end": 5425.074,
    "text": "To do decision making, that is computing the expected free energy, we need sampling typically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.774,
    "end": 5430.316,
    "text": "And then to do action selection, we either need sampling or optimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5430.916,
    "end": 5432.497,
    "text": "And also inference is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.316,
    "end": 5441.122,
    "text": " An optimization of beliefs sampling of that we as we've discussed is also an optimization of probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5441.562,
    "end": 5443.884,
    "text": "You can see that as an optimization of beliefs as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5444.524,
    "end": 5446.626,
    "text": "So it's all very tightly interconnected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.646,
    "end": 5450.729,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.51,
    "end": 5452.23,
    "text": "Thank you, Lance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5452.41,
    "end": 5455.032,
    "text": "That's very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.294,
    "end": 5458.315,
    "text": "brings up a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.139,
    "end": 5477.684,
    "text": " ways to go and it it really shines a different light on even what learning active inference or learning free energy principle it was a roller coaster just listening when you describe the figure of the running person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.085,
    "end": 5492.734,
    "text": " And the new generalized representation here, which is so sparse, it looks like it's pseudocode, but it's actually basically necessary and sufficient to describe action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5493.695,
    "end": 5496.837,
    "text": "Yeah, it is pseudocode, and it is also exact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5496.897,
    "end": 5499.799,
    "text": "This is really what active inference boils down to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.239,
    "end": 5502.24,
    "text": "And that was kind of where we got at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.641,
    "end": 5506.203,
    "text": "We're like, okay, well, we have this mess of papers of active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.423,
    "end": 5513.696,
    "text": " not that they're actually a mess but you know there's so much information and we're you know really thinking reading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5515.84,
    "end": 5544.967,
    "text": " free energy principle literature that I've also worked on a lot and also the active inference literature and really thinking okay well how do we strip all that of the neuroscience how do we strip all that of the cognitive science how do we just retain the math and present it in the simplest way possible that would be appealing for a mathematician and also hopefully for a computer scientist it turns out that we got a way simpler perspective than anything that's out there I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.889,
    "end": 5554.774,
    "text": " And really, yeah, so this is the active inference algorithm in pseudocode and in detail also in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.476,
    "end": 5558.777,
    "text": "So I totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5558.977,
    "end": 5568.324,
    "text": "Again, thanks for the work and for sharing it this way because it is the fewest pixels for the highest resolution picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.305,
    "end": 5572.267,
    "text": "So then to describe the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.496,
    "end": 5595.127,
    "text": " fundamental cybernetic challenge as a partition an axiomatic partition which one can then say also has grounding in the spatial temporal boundaries of the world or in geometric boundaries in informational spaces but the particular partition is used to separate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5597.538,
    "end": 5625.448,
    "text": " in the map not necessarily making claims about the territory and the actual nature of the objects and their articulations or anatomy but on the map which we get to construct we make it in a way that's amenable to the particular partition which is not too much more than the separation of figure from ground or agent-based modeling it's just a separation of some autonomous entity from some external process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.717,
    "end": 5655.782,
    "text": " then the task of the free energy principle applied to decision making as you said was to describe action as a function of observation and everything in between is broadly considered cognitive but for any given system it's going to play out in this immensely nuanced way with a lot of bespoke mechanisms and why do we take that particular partition step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5656.621,
    "end": 5661.063,
    "text": " Well, it's kind of like read, write, access in the computer system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.623,
    "end": 5671.427,
    "text": "There's things we don't have access to, hidden states, and also the reverse of that, which is we can't access hidden states, nor them influence or affect us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5671.487,
    "end": 5674.688,
    "text": "So I think of that as like no telekinesis, no telepathy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.228,
    "end": 5677.309,
    "text": "You can't go directly across the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5677.79,
    "end": 5681.711,
    "text": "You have to intermediate through the blanket of observation action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5682.371,
    "end": 5685.693,
    "text": "And then with respect to our particular states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.713,
    "end": 5688.573,
    "text": " our blanket and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5689.214,
    "end": 5709.198,
    "text": "We have access to observations, but not direct control, nor necessarily would we want to, because if we had the lever to change what we directly received, then algorithms might learn strategies that basically self-deceive so that the observations look good, look good, look good until the whole system crashes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5709.738,
    "end": 5713.239,
    "text": "So we want access to observations, but not direct control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5713.979,
    "end": 5723.868,
    "text": " And then the autonomous states are what we in the optimal ideal situation have total control of, which is like our mind and our body, what we think and what we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.848,
    "end": 5725.389,
    "text": "It turns out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5726.886,
    "end": 5752.145,
    "text": " through the pragmatic turn and the inactivist insights in cognitive science that a lot of action sequences have to do with changing what observations are sought after like epistemic affordances so there is an enmeshment of action but it's also really important that we have access but not control of observations we don't want to have like our control on the thermometer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5752.765,
    "end": 5764.796,
    "text": " but we want the best possible thermometer, and then we want to control the best possible interpretation, that's like signal processing, and the best possible action sequence, which is like decision-making and control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5765.877,
    "end": 5769.201,
    "text": "And then free energy principle is addressing that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.821,
    "end": 5775.707,
    "text": "What is the equation of action as a function of observation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5777.995,
    "end": 5784.798,
    "text": " But then it was quite a roller coaster when you said that the free energy wasn't even necessarily the only way to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5785.279,
    "end": 5786.579,
    "text": "But it's absolutely true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5787.34,
    "end": 5800.987,
    "text": "The properties of the free energy are inherited from one of the terms being KL divergence and the other having the ability to basically ignore in certain relative expected free energy calculation contexts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.627,
    "end": 5826.512,
    "text": " so then in that situation differences in free energy do come down to differences in the KL which does have all these properties but that doesn't mean that the free energy is itself axiomatically posited it's actually downstream of the particular partition to use free energy or anything like that at all and other discrepancies may have other properties in different ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.453,
    "end": 5828.914,
    "text": " Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5829.275,
    "end": 5832.562,
    "text": "And so there's a bit of a nuance in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.176,
    "end": 5850.845,
    "text": " describing decision-making, as you summarized, describing A as a function of O. And by the way, about that, we didn't even talk about Markov blanket in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.906,
    "end": 5860.371,
    "text": "I would say that the Markov blanket is under the hood because we're saying, okay, well, these are the states that you have access to, and these are the states that you do not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5861.012,
    "end": 5864.374,
    "text": "The states that you have access to are A and O, the states of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5864.914,
    "end": 5867.076,
    "text": "The states that you do not have access to are the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.682,
    "end": 5874.706,
    "text": " So in some sense, there is a Markov blanket, but we didn't even have to mention that in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.726,
    "end": 5891.676,
    "text": "It's just you partition the world into three sets of states, S, O, and A, that are by definition A. And you just, yeah, just from this tripartition, you want to describe one as a function of another, ignoring the third.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.837,
    "end": 5895.278,
    "text": "And so that, yeah, that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5895.871,
    "end": 5905.921,
    "text": " how you derive expected free energy, you see that action sequences are described by the expected free energy, and this is a function of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5907.823,
    "end": 5916.151,
    "text": "If we went further in the, and so this is just what you need, crucially this is just what you need to derive the active inference algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5916.952,
    "end": 5939.723,
    "text": " if you if we went further in reviewing the free energy principle then we would see the fundamental role that the free energy plays and so actually when you know reading the latest papers on the mathematical theory of the free energy principle the role of the variation of free energy is pretty clear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.311,
    "end": 5953.221,
    "text": " But here, the point is that if we just care about decision-making, if we just care about the normal active inference algorithm, then we don't even need the variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.661,
    "end": 5956.484,
    "text": "So sure, the free energy should be preferred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.584,
    "end": 5957.065,
    "text": "Why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5958.326,
    "end": 5964.712,
    "text": "If it is available, but if it is not for some reason, then there's no reason why not to use another kind of divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5971.274,
    "end": 5973.979,
    "text": " So, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5974.64,
    "end": 5976.444,
    "text": "It's making me think about linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.939,
    "end": 6003.257,
    "text": " and the sum of squares the l2 norm is one approach that's often used to fit a regression line because it has good optimization properties there's good software packages there's good education there's good communication around it and so on but one can select other norms and choose to fit a linear regression with an l1 norm or with an l3 norm and so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6004.87,
    "end": 6020.807,
    "text": " entire question of fitting the linear regression is a degree of freedom how the regression is fit that's downstream of a commitment to for example model a system in a generalized linear modeling framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6022.029,
    "end": 6051.509,
    "text": " so analogously the upstream commitment or the first principles which yes can be understood as axiomatic and also have some empirical status in terms of this partitioning a figure from ground the particular partition can simply be accepted axiomatically which is to say without appeal to evidence or somebody might have another upstream axiom and choose to model uh things according to a particular partition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6052.689,
    "end": 6077.834,
    "text": " from there just like we could have chosen the l123 norm there are different discrepancy criteria or measures that we might want to use and some of them apply better or worse or not at all depending on what software hardware data set and generative model we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6079.898,
    "end": 6093.765,
    "text": " And so it makes sense to pull back into the upstream understanding of active inference as a process theory for particular partitioned systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6095.105,
    "end": 6101.889,
    "text": "And then for those who want to engage in the modeling to have that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6104.296,
    "end": 6118.156,
    "text": " a discussion about the garden of the branching paths well you could use a discrete time or you could use a continuous time and then from here you could do this sampling or you could do that one and if we have this computer access we can do that but if we have to do it this way we'll do it like that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6119.161,
    "end": 6135.164,
    "text": " And that's all operational and logistical, but it's actually all under the umbrella or under the auspice of the theoretical or conceptual commitments that are actually not being questioned once one is in that modeling discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.644,
    "end": 6146.566,
    "text": "Just like you could have the L123 norm conversation and maybe a reviewer asks you why you chose the two norm versus the three, but it's a broader level of questioning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6147.532,
    "end": 6150.334,
    "text": " why one took on the linear modeling framework at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.095,
    "end": 6160.623,
    "text": "And our analogous upstream bottleneck, not in terms of rate limiting, but just in terms of like eye of the needle, is the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6164.707,
    "end": 6165.367,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6165.748,
    "end": 6175.676,
    "text": "And I just want to add something actually about the choice of divergences or the choice of discrepancy that you might want to use to solve the inference problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6176.375,
    "end": 6179.217,
    "text": " I think the analogy with linear regression is a really good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6180.137,
    "end": 6184.739,
    "text": "When you do linear regression, yeah, you can use all types of norms, and it's really a design choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6184.759,
    "end": 6188.241,
    "text": "And here in the algorithm, you also have that design choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6188.301,
    "end": 6192.583,
    "text": "Are you going to use KL, so free energy, to do these inferences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6194.885,
    "end": 6202.148,
    "text": "By the way, the inferences are really equation 43 and 44, which are approximate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6203.369,
    "end": 6204.97,
    "text": "Actually, you had them in the slide already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6206.532,
    "end": 6206.972,
    "text": " Oh, 43 and 44?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6207.052,
    "end": 6208.933,
    "text": "Oh, here, got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.373,
    "end": 6210.233,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6210.413,
    "end": 6216.394,
    "text": "Which are approximate, you know, some posterior distribution with an approximate posterior distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6216.414,
    "end": 6223.656,
    "text": "So you can do that with the free energy, which is the same as the KL divergence, or you could do that with a whole bunch of other divergences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6223.836,
    "end": 6229.017,
    "text": "One that I mentioned and that I think is particularly interesting is the maximum mean discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6229.977,
    "end": 6230.257,
    "text": "And so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6232.133,
    "end": 6240.38,
    "text": " Here's the difference between KL and maximum mean discrepancy, at least, I guess, an important conceptual difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.921,
    "end": 6257.475,
    "text": "So the KL, when you look at distributions that are very close to each other, it's basically going to become symmetric when the distributions are very close, and it's going to measure the amount of information that differs between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6258.556,
    "end": 6272.581,
    "text": " The maximum mean discrepancy, when you take two distributions that are very close, it reduces to what people call the earth movers distance, also called the Wasserstein distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6273.061,
    "end": 6274.142,
    "text": "So here is the intuition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6274.762,
    "end": 6285.426,
    "text": "If you take two distributions that are very close, just imagine distribution A as a pack of dirt and distribution B as a pack of dirt or sand with some shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6286.412,
    "end": 6307.631,
    "text": " the maximum mean discrepancy is gonna tell you the amount of work that you need to put all that dirt from distribution A and pile it in the shape of distribution B. So of course there's so many different ways in which you could take all that dirt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6308.672,
    "end": 6336.05,
    "text": " from distribution a and remodeled in distribution b but you're interested in the minimal um the minimal energetic cost that would take so like the optimal way of doing that movement people call that optimal transport um now if you're if you're familiar with optimal transport you know that the vasterstein distance um is a distance between probability distributions that regardless of how far they are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6337.446,
    "end": 6346.152,
    "text": " is going to give you this cost of optimal transport.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6346.172,
    "end": 6354.939,
    "text": "So the energetic cost of moving all that pack of dirt from place A to place B in the optimal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6357.161,
    "end": 6360.123,
    "text": "So the Wasserstein distance is something that we could use here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6362.44,
    "end": 6372.063,
    "text": " But maximum mean discrepancy, it has a lot of very nice properties and basically reduces to the Wasserstein distance when we consider very close distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6372.743,
    "end": 6381.285,
    "text": "So this is not something that just a mathematical curiosity, but it says that when one builds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6382.202,
    "end": 6393.772,
    "text": " When one builds a distance out of a divergence, what one does is one takes very close distributions, measures the divergence between them, at which point the divergence is pretty much symmetrical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6394.844,
    "end": 6421.073,
    "text": " and then you basically keep adding divergences along a trajectory until you get to the final one and this way by aggregating divergences between very close distributions and doing that and you know adding that along a trajectory you get a distance a meaningful distance between you know distributions that could be very far if you do that with the KL divergence you get what's called the Fischer information distance which measures really the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6425.887,
    "end": 6433.736,
    "text": " the amount of information that took you to go from one distribution to another distribution, regardless of how far they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.598,
    "end": 6444.528,
    "text": "If you do that with advanced search time distance, you will get the optimal transport cost, so the amount of energy that you need to put all that dirt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6445.532,
    "end": 6447.433,
    "text": " they say to place me in the optimal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6448.214,
    "end": 6451.275,
    "text": "If you do that with the maximum discrepancy, you would also get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6451.356,
    "end": 6453.897,
    "text": "You would also get the optimal transport thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6454.597,
    "end": 6471.488,
    "text": "So I just want to say that the maximum discrepancy, minimum discrepancy between two distributions that are far away will not coincide with the Wasserstein distance, which gives you this optimal transport cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6472.501,
    "end": 6488.042,
    "text": " but when you actually derive a distance from these divergences the distance derived from the maximum new discrepancy and the Wasserstein distance will end up being the same and this distance that you actually get or the topology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6489.422,
    "end": 6491.685,
    "text": " that is derived from the distance, so by topology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6492.045,
    "end": 6495.248,
    "text": "But topology is really a notion of closeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6497.23,
    "end": 6502.074,
    "text": "And so to understand closeness, you need to understand infinitesimal distances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6503.435,
    "end": 6508.139,
    "text": "So the infinitesimal distances derived from Wasserstein or MMD, they're the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6509.156,
    "end": 6518.485,
    "text": " The topology that results is the topology of what people call weak convergence, which is the standard topology that's considered in probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6521.328,
    "end": 6528.795,
    "text": "So MMD and Wasserstein, they are very natural in that sense, in the sense that they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6531.938,
    "end": 6540.304,
    "text": " People say that they match rise with convergence, like they give rise to the standard topology between probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6542.645,
    "end": 6553.272,
    "text": "So coming back to the choice of divergences, if you're interested in approximating distributions in the sense of approximating their information content,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6553.976,
    "end": 6555.456,
    "text": " then KL is very natural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6556.056,
    "end": 6573.86,
    "text": "But if you were, for some reason, and maybe it would not be in this kind of application, but another kind of application, if for some reason you're interested in approximating distributions for the sake of how close they are when you look at them, then you would use MMD or Wasserstein.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6577.241,
    "end": 6577.561,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6578.761,
    "end": 6579.021,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6580.754,
    "end": 6605.595,
    "text": " information and i'm just thinking about we're switching lanes on the highway we're trying to get from here to there yes we want to know about the informational closeness of this tale of two densities but we also want to know about the transport closeness because we have a schedule and a budget and decisions to make and there are trade-offs so being able to move the earth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6607.162,
    "end": 6631.217,
    "text": " optimally while we're switching lanes and accelerating and slowing down i know this is mixing many angles informally we want to have a lot of options for how to think about that challenge of moving dirt between the tail of two densities and make sure everybody is driving in the right lane at the right time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6633.482,
    "end": 6634.023,
    "text": " Definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6634.343,
    "end": 6641.149,
    "text": "And yeah, it's a, it's a design choice and it's an important one because it depends on, you know, what kind of properties we want to preserve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6642.249,
    "end": 6654.36,
    "text": "And, um, yeah, so all these, all these divergences, some, some are not so useful, I guess, but, um, some of them, they're, they're just very natural and, um, Western shine and MMD, they're very natural in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6655.441,
    "end": 6658.003,
    "text": "Um, so yeah, very important to keep in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6659.284,
    "end": 6666.331,
    "text": " And not only for active inference, but just in general for any kind of inference problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6669.634,
    "end": 6674.058,
    "text": "Well, let us each have a closing round or reflections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6674.338,
    "end": 6681.726,
    "text": "Any thoughts or any next steps or any suggestions or other information you'd like to provide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6684.476,
    "end": 6702.735,
    "text": " it's hard to say i feel we've you know we've covered so much already um there's still i think to me what's most exciting about is um scaling active inference right now um because you know you get this active inference algorithm in the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6703.759,
    "end": 6705.4,
    "text": " that's derived from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6705.48,
    "end": 6709.541,
    "text": "And just from the derivation, you see, okay, well, there's actually so many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6709.942,
    "end": 6715.644,
    "text": "I mean, the assumptions are so small that there are so many things that you can model with this active inference algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6716.504,
    "end": 6722.426,
    "text": "And basically you, and all the heavy lifting is done by the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6723.167,
    "end": 6726.668,
    "text": "So if you use one generative model, you will get one behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6726.708,
    "end": 6731.53,
    "text": "If you use another generative model, you will get another behavior, but all the equations will remain the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6732.865,
    "end": 6756.586,
    "text": " um so so it speaks to generality now in in having something that's very general you get something that's also very non-specific and i guess for for neuroscientists and people who are interested in intelligence you just um generality comes at a cost of being you know non-specific and non-specific about the brain in general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6757.878,
    "end": 6770.786,
    "text": " So really the big question to me long term is what kind of genitive models do we need to simulate brain-like behavior because this is really the interesting behavior or the most interesting behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6772.186,
    "end": 6783.753,
    "text": "So it speaks to a big research program that a lot of people are carrying and have been carrying for a long time but you know it's about what kind of representations do we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6784.805,
    "end": 6810.211,
    "text": " of the world what kind of priors do we have what kind of can we identify the priors that we are born with there's a lot of research on computational or just playing cognitive science like normal cognitive science just studying babies and seeing what kind of priors what kind of you know basic information they have when they come out of the womb there's a lot of things that they can already do there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6811.291,
    "end": 6821.296,
    "text": " our genetic code is preconditioning us to operate efficiently in this world and be able to flexibly adapt to any kind of situations that might arise in the natural world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6822.016,
    "end": 6835.723,
    "text": "And so it's a huge research program to understand and model these priors and not only the priors, but also the likelihood, all the representation, all the state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6837.129,
    "end": 6839.39,
    "text": " So I think that's the way forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6839.79,
    "end": 6848.631,
    "text": "The free energy principle is very elegant because it gives you a very succinct description in terms of a generative model that enables you to simulate pretty much everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6849.311,
    "end": 6852.272,
    "text": "But we're not interested in simulating anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6852.352,
    "end": 6855.133,
    "text": "We're interested in simulating brain-like behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6855.153,
    "end": 6862.474,
    "text": "So now we need to drill down even more onto the kind of generative models that would be amenable to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6867.335,
    "end": 6889.344,
    "text": " great my closing reflection i feel like i know less about fep but more about something else for what we've discussed earth was moved bayesian mechanics were called in decisions were made",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6890.962,
    "end": 6893.903,
    "text": " And it's been a really great series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6893.963,
    "end": 6902.465,
    "text": "So I'm appreciative and thankful that you suggested this paper in our correspondence as one to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6903.505,
    "end": 6911.307,
    "text": "You were absolutely right that it is relevant to bring to the attention of the active community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6912.347,
    "end": 6918.769,
    "text": "And I hope that everybody who reads or listens this far has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6921.013,
    "end": 6944.339,
    "text": " shifted lanes so they can be where they want to be too well that yeah i mean uh thank you so much um i also really enjoyed this session and i think we had a really cool discussion um so thanks again and hope to just do this again soon excellent anytime you'd like farewell see you lance yes",
    "speaker": "SPEAKER_01"
  }
]