[
  {
    "start": 8.339,
    "end": 14.322,
    "text": " hello and welcome it is march 2nd 2023 and we're here in actin live stream 52.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.677,
    "end": 22.518,
    "text": " Welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.178,
    "end": 29.779,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.52,
    "end": 35.841,
    "text": "This is a recorded and an archived livestream, so please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.841,
    "end": 42.063,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.403,
    "end": 49.865,
    "text": "Head over to activeinference.org to learn more about getting involved in learning groups and projects such as livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.499,
    "end": 69.836,
    "text": " All right, we are in 52.1, and our goal today is to learn and discuss this awesome paper, Geometric Methods for Sampling, Optimization, Inference, and Adoptive Agents of BARP and ACOSTA et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.856,
    "end": 73.579,
    "text": "And we're going to just jump right in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.28,
    "end": 76.502,
    "text": "Thanks a lot, Lance, for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.362,
    "end": 77.603,
    "text": "And, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.813,
    "end": 83.416,
    "text": " Those who have listened to 52.0 will know me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.477,
    "end": 88.36,
    "text": "I'm a researcher and a learner with respect to this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.021,
    "end": 99.249,
    "text": "So thanks again for joining and it'll be great to have you introduce yourself and also tell a little bit of the story of how this paper came to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.971,
    "end": 101.191,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.752,
    "end": 103.413,
    "text": "Thanks, Daniel, for organizing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 103.493,
    "end": 106.435,
    "text": "I mean, this is really great and I'm very happy to be here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.853,
    "end": 109.875,
    "text": " So, my name is Lance Da Costa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.756,
    "end": 111.777,
    "text": "Some of you may know me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.037,
    "end": 123.289,
    "text": "I'm a PhD student both at Imperial College London and UCL, mostly working on active inference and the free energy principle, also some probabilistic machine learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.35,
    "end": 130.673,
    "text": " And today we're going to be discussing geometric methods for sampling, optimization, inference, and adaptive agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 132.794,
    "end": 141.399,
    "text": "So how this paper came to be where I happen to know people who do more like statistics, machine learning, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.459,
    "end": 153.065,
    "text": "And we've always been talking about the similarities and differences between what we do in active inference and what they do in sampling optimization, which are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.211,
    "end": 156.994,
    "text": " kind of the workhorses of statistics and machine learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.315,
    "end": 174.712,
    "text": "And at some point we had a paper invitation for the Handbook of Statistics and we decided to team up and make a review article to see how all these fields that come from very different places scientifically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 175.693,
    "end": 192.55,
    "text": " uh that have very different contributors as well and we wanted to know how they're interconnected and also how they can help each other um because we realized for all this time that we're actually doing similar things but the communities are very different they're not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.511,
    "end": 195.353,
    "text": " very much talking to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.853,
    "end": 201.057,
    "text": "And I think a main barrier is a difference in language, difference in jargon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.157,
    "end": 204.34,
    "text": "So that was kind of an issue when we started.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.221,
    "end": 221.754,
    "text": "And so we wanted to put that all, I mean, as much as possible in a paper and see how these different approaches to statistics, whether it is sampling, optimization, inference, or decision-making, how they can benefit from each other and how they relate to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.797,
    "end": 228.381,
    "text": " And so long story short, we're going to delve into this into more detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.441,
    "end": 236.807,
    "text": "But long story short, if you want to sample from a distribution, you can also view that as an optimization problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.827,
    "end": 245.134,
    "text": "So optimization is kind of, you can see it as the root of sampling and you want to optimize sampling, make sampling as efficient as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.115,
    "end": 249.017,
    "text": "Inference, you can also see it as an optimization of beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.89,
    "end": 273.627,
    "text": " optimization of probability distributions that's also an optimization procedure and if you want to do decision making which is what we do in active inference and reinforcement learning and all many different places well through decision making you actually need optimization and inference and if you want to do decision making efficiently you often are going to need something as well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.327,
    "end": 285.601,
    "text": " So decision-making and active inference is kind of like what comes at the very end and requires all of the sophisticated machinery of sampling, inference, and metronization in order to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.862,
    "end": 288.905,
    "text": "So this was really the idea of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.543,
    "end": 292.224,
    "text": " How does optimization come about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 292.304,
    "end": 293.865,
    "text": "How do you do efficient optimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.466,
    "end": 296.567,
    "text": "And of course, there's many different ways to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 297.528,
    "end": 302.231,
    "text": "So we decided to focus on natural ways, and we'll get to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.311,
    "end": 309.356,
    "text": "But one way to do optimization that is very natural is through techniques from geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 312.153,
    "end": 331.864,
    "text": " And so same with sampling in sampling and inference you have geometry that just comes out very naturally when you when you want to solve these problems and So decision-making puts it all together So that was really the idea of of the paper Can we put all these fields together and have like a you know, like a connecting line which is based in geometry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 331.965,
    "end": 339.309,
    "text": "And so that's what we did Awesome great overview so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.376,
    "end": 343.337,
    "text": " so many places to jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.357,
    "end": 349.64,
    "text": "I barely even know where to sample from this distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.04,
    "end": 352.421,
    "text": "Let's just start with sampling though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.861,
    "end": 357.323,
    "text": "So what is sampling and how is it being used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.383,
    "end": 358.643,
    "text": "How has it been used?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.744,
    "end": 365.926,
    "text": "And let's characterize sampling and then move on to these other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.867,
    "end": 375.83,
    "text": " Right, well, sampling, I mean, the idea of sampling is very simple and it's also a very difficult thing to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.43,
    "end": 377.831,
    "text": "So first, explain the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.791,
    "end": 383.953,
    "text": "The idea is, let's say you have a Gaussian in one dimension, so that's very easy to picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.994,
    "end": 392.717,
    "text": "Sampling would be, so for example, the Gaussian I just mentioned describes the temperature in the room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.396,
    "end": 401.228,
    "text": " So in my room, it's maybe currently 18 degrees Celsius, plus or minus some variance representing my uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.269,
    "end": 405.273,
    "text": "Now, sampling from the distribution would be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.272,
    "end": 424.101,
    "text": " saying it is maybe 19 degrees or maybe 17 degrees, you know, drawing a lot of different temperatures so that if you put them all together as a histogram with like their frequency, for example, if you ask me what temperature it is in my room, I would say,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 425.397,
    "end": 427.838,
    "text": " there's a higher chance that I say 18 degrees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.499,
    "end": 441.925,
    "text": "So I would say more often if you ask me this question many times, and you know, if you put my answers, if you collect all my answers in a histogram, for example, I'd say 18 degrees more often, so that bar around 18 degrees",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.898,
    "end": 445.64,
    "text": " would be higher and the other temperatures will be slightly lower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.78,
    "end": 452.005,
    "text": "And if you aggregate that, you would get a Gaussian, get the Gaussian we started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.526,
    "end": 460.732,
    "text": "So sampling in other words, and very simply, it's like drawing a data point or an observation from an underlying probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.752,
    "end": 464.435,
    "text": "So you have a distribution, let's say a Gaussian that represents your",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.828,
    "end": 470.615,
    "text": " most likely value of what the temperature in the room is and some uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.156,
    "end": 476.803,
    "text": "And you just want to draw one or several observations from that distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.834,
    "end": 501.132,
    "text": " and you want to draw these observations so as to preserve the overall statistics of the distribution that you started with so that if you draw infinitely many data points or infinitely many observations from the distribution then you can recover the original distribution so that's what we want to do and so why is this useful in the first place well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.372,
    "end": 507.777,
    "text": " It just happens all the time in the things that you want to compute integrals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.757,
    "end": 509.878,
    "text": "It just happens all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.938,
    "end": 523.008,
    "text": "So if you want to, for example, if you have a Bayesian inference problem, you have, you know, you observe some data in the world, it could be medical data, it could really be anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.624,
    "end": 539.38,
    "text": " and you have a prior and a likelihood of observing that data, so these are two terms in Bayes rule, then you want to know, then if you apply Bayes rule, you get a posterior belief about what caused that data that you observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.061,
    "end": 540.742,
    "text": "So for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.283,
    "end": 566.6,
    "text": " a practical use case would be some medical data of a patient that's sick and you want to know so you get for example you know it's blood pressure collection of symptoms and so on so that's your data and you want to know what kind of disease or what kind of malfunction caused that data so let's say typically you would have a model of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.561,
    "end": 588.991,
    "text": " if i get this uh if i have this malfunction of this disease i would have these symptoms about if i have this other disease i would get these other symptoms and so basero enables you to infer in the best way possible um the disease that caused the symptoms that you just saw",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.992,
    "end": 591.973,
    "text": " So this is like a common thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.993,
    "end": 596.476,
    "text": "I mean, something that people use every day in statistics all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 597.236,
    "end": 610.164,
    "text": "And arguably, everybody uses it every day because like the kind of the thesis of the 300 principle of the result that it provides is that you can describe percent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.084,
    "end": 616.325,
    "text": " as doing Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.006,
    "end": 620.749,
    "text": "Bayesian inference is a very ubiquitous thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.809,
    "end": 631.178,
    "text": "You can use it to describe perception in humans, and you can also use it to do statistics and solve all kinds of problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.238,
    "end": 642.027,
    "text": "Coming back to sampling, actually doing Bayesian inference, you have this problem of how do you compute the posterior distribution in the first place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.172,
    "end": 654.519,
    "text": " And it turns out that this distribution is generally intractable because you have kind of a term in the denominator that's very hard to compute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.259,
    "end": 661.122,
    "text": "And so one way to compute it is to use what's called Monte Carlo methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.783,
    "end": 663.884,
    "text": "And Monte Carlo methods are based on sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.645,
    "end": 674.548,
    "text": " So long story short, in order to do Bayesian inference, you need to compute this log likelihood term, which is a high dimensional integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.589,
    "end": 678.83,
    "text": "And one way to do it is by using Monte Carlo methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.59,
    "end": 681.771,
    "text": "And Monte Carlo methods are based on sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.631,
    "end": 688.753,
    "text": "So the sampling enables you to approximate the high dimensional integral that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.106,
    "end": 695.58,
    "text": " So now many listeners or also readers of this work will wonder, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.531,
    "end": 709.681,
    "text": " Um, one thing that people do in the free energy principle, and also like, kind of like the, um, the raison d'etre of the free energy principle is you're actually not going to compute this denominator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.721,
    "end": 720.249,
    "text": "That's very expensive to the Bayesian inference, but you're going to approximate the posterior, um, by minimizing free energy, um, which is called variational inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 721.29,
    "end": 723.572,
    "text": "That's another method of doing Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.799,
    "end": 727.623,
    "text": " And it has many advantages over sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.703,
    "end": 731.708,
    "text": "Sampling also has advantages with respect to variational inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.349,
    "end": 733.37,
    "text": "We can get into that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.372,
    "end": 740.098,
    "text": "But if that's what you're thinking, well, this is not necessarily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.979,
    "end": 743.341,
    "text": " interesting because we can do variational inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.442,
    "end": 749.366,
    "text": "There's so many other places where we need sampling in statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.006,
    "end": 757.452,
    "text": "I would say basically any time you need to compute an integral and integrals are all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.853,
    "end": 765.639,
    "text": "But I think the Bayesian inference motivation is a nice one because it just speaks to all of us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.31,
    "end": 794.418,
    "text": " um so how does so so how does actually sampling getting to the picture of integration let's say we have an integral that we need to compute um an integral is basically let's say you have a state space so to be very simple let's say the state space is my desk it would be like a planner surface and we have a function that's defined on the desk so this would be like a landscape",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 795.777,
    "end": 796.717,
    "text": " over the desk, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.778,
    "end": 801.839,
    "text": "Like a 2D surface landscape that could be rugged or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 802.859,
    "end": 808.281,
    "text": "The integral of this function is going to be the volume between the landscape and the desk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.382,
    "end": 816.124,
    "text": "So this is kind of like the geometric picture of what an integral is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.643,
    "end": 832.471,
    "text": " Um, so this turns out to be very hard to, you know, compute in practice because you have like, um, let's say you have a very rough surface and it's not clear how to, you know, compute all this volume, which is very irregular.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.491,
    "end": 841.856,
    "text": "Um, what sampling does, it's going to pick a few locations on the desk, um, as many as you wish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.917,
    "end": 847.019,
    "text": "Uh, so let's start by one and it's going to compute the height.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.225,
    "end": 856.111,
    "text": " the height under the function and then pick another location and compute that height as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.592,
    "end": 860.776,
    "text": "Since sampling is gonna pick locations on the desk at random,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.239,
    "end": 870.383,
    "text": " And from there, it's going to build a histogram that's going to approximate the surface that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.063,
    "end": 878.487,
    "text": "And so histogram is very simple because you get a whole bunch of skyscrapers if you wish to approximate the surface that we started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.567,
    "end": 886.851,
    "text": "And computing the volume of skyscrapers is very simple because you know they're like squares.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.351,
    "end": 891.213,
    "text": "It's like depth times height times width.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.671,
    "end": 894.292,
    "text": " of those things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.574,
    "end": 897.417,
    "text": "So this is kind of the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.437,
    "end": 904.71,
    "text": "We want to compute the volume under a rock surface and to do that we're going to pick arbitrary locations on the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.36,
    "end": 916.483,
    "text": " on the desk, on the face space, and at those locations, build skyscrapers at the height of the surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.103,
    "end": 929.847,
    "text": "So you get a skyline, a histogram that approximates your original function, and it's very simple to know the volume of the histogram, the volume of the skyline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.547,
    "end": 935.409,
    "text": "And so from then, you get an estimate of the integral that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.565,
    "end": 939.187,
    "text": " So that's kind of like the geometric picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.808,
    "end": 947.995,
    "text": "The beauty of this is that it works in arbitrary dimensions and it doesn't suffer from the curse of dimensionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.276,
    "end": 949.657,
    "text": "So this is why it's so powerful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.938,
    "end": 954.681,
    "text": "If you want to know, so there's a formula that tells you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 956.785,
    "end": 965.168,
    "text": " how well the volume of your skyline will approximate the volume that you initially wanted to compute the integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.568,
    "end": 981.592,
    "text": "So this difference between the integral and your estimate basically decreases as a function of the number of skyscrapers that you put in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.092,
    "end": 984.473,
    "text": "The more skyscrapers, the more precise you get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.862,
    "end": 998.607,
    "text": " And this bound on the error that you have on your integral that you started with, it doesn't depend on the dimension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.509,
    "end": 1014.936,
    "text": "So as the higher dimensional your state space, so let's say, let's imagine I had a high dimensional desk, which is very hard to imagine, and I had a function on top of it, and I wanted to compute the area under the function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.155,
    "end": 1027.298,
    "text": " If my desk was very high dimensional, the higher the dimension, the harder it would be to solve this problem numerically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1027.899,
    "end": 1036.502,
    "text": "But with sampling, actually the degree of accuracy that you get through sampling would be agnostic to the dimension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1037.583,
    "end": 1058.212,
    "text": " says this is why it's so so powerful and and just used all the time in statistics and machine learning when you imagine you know practical problems that you have in machine learning coming back to medical data you could get a whole bunch of data about a patient which could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1059.181,
    "end": 1066.825,
    "text": " you know, heart rate over time, blood oxygen levels, blood glucose levels, body temperature and whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1066.845,
    "end": 1070.507,
    "text": "There's so many data modalities that you would have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1070.567,
    "end": 1073.869,
    "text": "So your state of face would have many, many dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.243,
    "end": 1088.909,
    "text": " And also the state space of the different diseases that could have given rise to all these symptoms would be also very high.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.009,
    "end": 1096.473,
    "text": "So it could be that the patient has fever or it could be that it has flu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.493,
    "end": 1098.234,
    "text": "No, fever is a symptom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.274,
    "end": 1099.975,
    "text": "It could be that the disease is flu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1100.675,
    "end": 1126.074,
    "text": " that the disease is tuberculosis it could be a disease it is AIDS you know there's so many different conditions or problems that one might want to you know examine so in this particular case of medical data and this is just like a very simple use case I would say you have a very high dimensional state space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.048,
    "end": 1131.631,
    "text": " And to do Bayesian inference, you have a very high dimensional integral to estimate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1132.491,
    "end": 1141.056,
    "text": "And so one way to do that efficiently or maybe efficiently is disingenuous because it's just very hard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.617,
    "end": 1145.279,
    "text": "I mean, it's just very computationally intensive to do these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.999,
    "end": 1155.045,
    "text": "But one way to do this that's state of the art is through sampling, just by drawing different points at random on the state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.56,
    "end": 1163.162,
    "text": " and approximating the function landscape and approximating the integral like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.363,
    "end": 1169.544,
    "text": "So yeah, this is really why this is so important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1173.006,
    "end": 1173.366,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.146,
    "end": 1176.487,
    "text": "So we've made a sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.455,
    "end": 1201.455,
    "text": " where does these topics of accepting or rejecting a move amongst samples or discretizing how do we pick that next sample and then what does it mean to accept or reject that sample that's a great question this is basically like the the heart of sampling you know uh so if you if you knew how to do that in full generality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.515,
    "end": 1210.309,
    "text": " Sampling would be solved Which it isn't so so I'm gonna tell you a bit like where where things stand So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.17,
    "end": 1234.026,
    "text": " The yeah to so to do sampling you need to pick places at random and you need to pick places random so as to preserve probability distribution so coming back to the example of the desk you want to pick in indicate in that case, you want to pick samples uniformly on the desk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.53,
    "end": 1246.717,
    "text": " Um, if we come back to the previous example of like a Gaussian distribution, you want to pick samples, um, you know, that, that preserve the Gaussian distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.777,
    "end": 1252.661,
    "text": "So you want to preserve it, to take a lot of samples around the mean a very few samples on the tails.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1254.062,
    "end": 1255.983,
    "text": "Um, so it turns out that for those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.071,
    "end": 1271.759,
    "text": " very simple distributions like uniform distribution, Gaussian distribution, there are ways to sample that do not require what this paper is talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.2,
    "end": 1280.904,
    "text": "So there are ways to sample exactly that do not lead to any kind of error and that are very fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.145,
    "end": 1283.906,
    "text": "So for Gaussian and uniform,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.004,
    "end": 1302.959,
    "text": " and a bunch of other distributions from the exponential family you have ways to sample exactly so the problem is these distributions they they're not there all the time and it turns out that very often",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.11,
    "end": 1307.291,
    "text": " you don't have these kind of very simple distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.971,
    "end": 1309.151,
    "text": "Otherwise, we would be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.911,
    "end": 1317.752,
    "text": "So one simple example, coming back to Bayesian inference, is the idea of Jeffries prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1318.853,
    "end": 1331.415,
    "text": "So Jeffries prior is the idea that you should take the highest entropy prior that's consistent with what you know about the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.697,
    "end": 1338.26,
    "text": " So why entropy maximizing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.3,
    "end": 1344.144,
    "text": "So we know that entropy is a measure of the uncertainty present in a distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.545,
    "end": 1357.915,
    "text": "And so what Jeffries prior says is that you should take a prior belief about a system, the belief that is maximally uncertain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.023,
    "end": 1384.93,
    "text": " but that is also compatible with your knowledge so out of all priors that are compatible with what you know about the system you would take the one that's most uncertain and this seems pretty intuitive right um so when you take jeffrey's fryer what you what you get is often a distribution that's in the form of what people call a gibbs measure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.169,
    "end": 1401.884,
    "text": " So Gibbs measures or Gibbs distributions, they're of the form exponential minus v. So they're proportional to exponential minus v. And v could be an arbitrary function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.651,
    "end": 1413.996,
    "text": " So if V, just as an example, if V were like a parabola, a quadratic function, then the associated Gibbs distribution is a Gaussian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.816,
    "end": 1416.737,
    "text": "So we all know what Gaussians are, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.357,
    "end": 1418.038,
    "text": "But V could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.278,
    "end": 1441.913,
    "text": " pretty much anything if you take V to be like X to the power of 4 minus X to the power of 2 then V is kind of like a camel but upside down so you know it has like two humps and therefore the exponential minus V distribution the Gibbs measure would be like a Gaussian but with two humps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.595,
    "end": 1453.021,
    "text": " So these Gibbs measures, they just arrive, they're just there like everywhere and they come up all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.482,
    "end": 1458.205,
    "text": "So one example, one other example is in statistical mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.388,
    "end": 1473.237,
    "text": " So let's say you have a system of molecules that just interact with each other, and these system of molecules, they could also be subject to thermal fluctuations and whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.438,
    "end": 1479.942,
    "text": "This system is going to relax to what people call a steady state, often a non-equilibrium steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1480.842,
    "end": 1486.586,
    "text": "These steady states, which is kind of like the end configuration of the system,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.155,
    "end": 1515.35,
    "text": " is um in general a gibbs measure um so so yeah so now you can see that in statistical mechanics and also in statistics uh gibbs measures comes up come up also in you know basin inference and um it's very hard in general to sample from a gibbs measure i mean there's ways to do it and and we're going to come back to it but you know we need to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.099,
    "end": 1528.763,
    "text": " And so when, you know, the, the most common way to solve from this distribution is, uh, what's called Markov chain Monte Carlo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.783,
    "end": 1532.505,
    "text": "And so the idea is to run a Markov chain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1532.545,
    "end": 1543.87,
    "text": "So to run like a stochastic process, and you could think of it as, um, stimulating, um, you know, molecule that interact with each other with some thermal fluctuations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.55,
    "end": 1548.412,
    "text": "And that are going to relax to this gives distribution, this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.735,
    "end": 1560.562,
    "text": " So coming back to the original examples, the steady state could be like a Gaussian that we want to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.363,
    "end": 1567.25,
    "text": "Going back to the example of the desk, it could be the uniform distribution on the desk that we want to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.911,
    "end": 1569.352,
    "text": "It could also be a Gibbs measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1570.033,
    "end": 1570.454,
    "text": "So we can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1571.9,
    "end": 1592.69,
    "text": " so once we know the distribution that we want to sample from um we're going to run we're going to design a stochastic process some kind of random motion that's who whose distribution is going to converge to the target distribution so as you run the process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.012,
    "end": 1600.337,
    "text": " Think of it as running, you know, simulating those molecules that interact and that converge to your target.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.357,
    "end": 1605.381,
    "text": "Yeah, so you're just going to simulate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.881,
    "end": 1613.908,
    "text": "And once your system has converged to steady state, which is the target distribution, then each movement...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.893,
    "end": 1617.675,
    "text": " on the steady state density is going to give you a new sample.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.277,
    "end": 1629.184,
    "text": "So just for intuition, let's come back to the desk and say that we have this uniform measure, uniform distribution on the desk that we want to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.804,
    "end": 1640.492,
    "text": "So we're going to design a dynamic that moves randomly around, and that's going to converge to the uniform distribution, which means that if you run it long enough,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.345,
    "end": 1646.487,
    "text": " It's just going to sample everywhere on the desk and it's going to sample each point equally often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.807,
    "end": 1651.208,
    "text": "And so you're just going to run this dynamic for a very long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.569,
    "end": 1661.112,
    "text": "And, and then you're going to collect the samples, collect the samples and use them to approximate the integral that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.132,
    "end": 1665.193,
    "text": "Um, so this is how sampling is done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1666.445,
    "end": 1674.971,
    "text": " Now there's two, there's, yeah, basically one big question, one big outstanding question is how do you choose this dynamic?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1676.212,
    "end": 1683.837,
    "text": "How do you choose this random motion to converge to your target distribution, to sample from the distribution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.778,
    "end": 1689.702,
    "text": "So given a target distribution, there's like a closed form formulas for,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.817,
    "end": 1717.015,
    "text": " all all the possible choices of processes that you can use to sample from them so that's a closed problem and that's also explained in the in the paper but then out of all of these processes you would like to know which one is going to sample the most efficiently and you also want to know um and and the second of all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.668,
    "end": 1722.952,
    "text": " A lot of the analysis of stochastic processes is done in continuous time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.513,
    "end": 1730.419,
    "text": "So you know that if you implement this process, it's gonna converge at this rate to the target distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.6,
    "end": 1733.042,
    "text": "And so the faster it converges, the better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1734.17,
    "end": 1745.296,
    "text": " Um, but it could be that when you simulate this on a computer and in a computer, you can only, you know, have like discrete time steps or like discrete operations in discrete time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.316,
    "end": 1748.678,
    "text": "So you cannot really simulate this dynamic in continuous time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.738,
    "end": 1752.94,
    "text": " So every time you simulate it, it's going to introduce some error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1753.64,
    "end": 1762.645,
    "text": "Now it could be that the thing that you simulate on your computer actually goes a lot slower than the, than the original process that you wanted to simulate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.225,
    "end": 1766.047,
    "text": "So there's these two questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.347,
    "end": 1773.691,
    "text": "How do you take a process that, you know, samples very efficiently converges very fast to your target, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.341,
    "end": 1789.057,
    "text": " In addition to that, how do you stimulate the process accurately on your computer so as to retain all the important characteristics of that process?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.358,
    "end": 1796.205,
    "text": "So there's many different criteria and this is what we discussed essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.06,
    "end": 1802.983,
    "text": " among the state of the art is called Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1803.965,
    "end": 1809.151,
    "text": "Now Hamiltonian Monte Carlo, without getting into too much detail,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.766,
    "end": 1815.23,
    "text": " Um, it takes, uh, it has two advantages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.61,
    "end": 1822.655,
    "text": "The first advantage is that it can be analyzed, um, using mathematical methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.816,
    "end": 1827.259,
    "text": "So you can get guarantees based on your target distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.299,
    "end": 1833.344,
    "text": "You can get guarantees of how fast you're going to converge, how accurate your samples are going to be and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.796,
    "end": 1840.498,
    "text": " It has also many other desirable properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.959,
    "end": 1849.943,
    "text": "One of them, which we discuss a lot in the paper, is the importance of being irreversible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.783,
    "end": 1856.926,
    "text": "Being irreversible means that if you run the process forward in time,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.05,
    "end": 1866.453,
    "text": " Or if, and so let's say, let's say you run the process forward in time for like 10 seconds, let's say you run the process backward in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.493,
    "end": 1870.634,
    "text": "So you kind of like run the process backward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1870.654,
    "end": 1877.096,
    "text": "Um, you just like take a movie and play backward and look at how the process behaves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.997,
    "end": 1880.258,
    "text": "Now a process is reversible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.898,
    "end": 1887.32,
    "text": "If the forward and the backward movies, uh, are statistically in this indistinguishable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.018,
    "end": 1897.803,
    "text": " And a process is irreversible if you run time as time goes forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.963,
    "end": 1904.167,
    "text": "If you run time forward, it would look statistically different from if you run the process backward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.023,
    "end": 1915.647,
    "text": " So, so this, there's some, yeah, I think that you can kind of like picture what, what irreversibility is now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.407,
    "end": 1926.092,
    "text": "Um, irreversibility is crucial to, to do efficient sampling because if you're reversible, um, it means that you're going to backtrack very often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.473,
    "end": 1932.155,
    "text": "When you're sampling positions on the decks, on the desk, say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.915,
    "end": 1934.856,
    "text": " You're going to start somewhere and go somewhere else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.056,
    "end": 1941.299,
    "text": "And then there's a non-trivial chance, a significant chance that you're going to come back to where you started.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1941.319,
    "end": 1946.401,
    "text": "So they're going to be very slow to explore all the desks and build skyscrapers everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.703,
    "end": 1951.304,
    "text": "So then sampling turns out to be very slow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.139,
    "end": 1981.2,
    "text": " now when you're irreversible um there's way less chances that you just come back to where you started so you're gonna like explore the desk a lot faster because you're not allowed to come back to the same place so much and so you're gonna sample faster and it's gonna be much more efficient um so it's actually by going from a reversible process for sampling to an irreversible process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.285,
    "end": 1986.507,
    "text": " you can gain orders and orders of magnitude efficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1986.527,
    "end": 1988.448,
    "text": "It's actually pretty crazy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1991.23,
    "end": 2004.637,
    "text": "So Hamiltonian Monte Carlo has guarantees, is irreversible, it has other desirable properties, and the main one is that you can actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2005.689,
    "end": 2022.875,
    "text": " stimulated on your computer in a way that the discretized version, which you actually simulate on the computer is going to be very, very, um, very close to, um, to the true Hamilton in Monte Carlo that you get, you know, by writing the equation now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.836,
    "end": 2032.179,
    "text": "Um, so these, this is like why, why it's so big and, and you know, why, why people use it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.779,
    "end": 2035.18,
    "text": "Um, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.148,
    "end": 2038.991,
    "text": " Yeah, I think this is pretty much it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.392,
    "end": 2045.904,
    "text": "Oh yeah, so Hamiltonia Monte Carlo has an accept-reject step, which is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.378,
    "end": 2058.747,
    "text": " So coming back to when you simulate a process on your computer, every time you discretize a process, you introduce some error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.368,
    "end": 2072.138,
    "text": "Now you want to make that discretization error as small as possible so that the process that you actually simulate on your computer is very close to what you want to simulate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2073.779,
    "end": 2075.781,
    "text": "So Hamiltonia Monte Carlo has",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2077.293,
    "end": 2092.679,
    "text": " a very important step called Metropolis Hastings, which is going to say, should I keep this sample or should I drop this sample and go to the next sample?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.679,
    "end": 2101.582,
    "text": "And by using Metropolis Hastings, it's a very clever but also simple procedure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.702,
    "end": 2104.123,
    "text": "By using Metropolis Hastings,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.091,
    "end": 2112.798,
    "text": " you guarantee that the distribution that you're going to sample is exactly the same as the distribution that you want to sample.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.599,
    "end": 2118.484,
    "text": "So just to put in other maybe simpler terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2119.685,
    "end": 2122.848,
    "text": "So you have this process that you want to simulate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.949,
    "end": 2128.914,
    "text": "This process is going to sample your target distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.764,
    "end": 2139.071,
    "text": " Now, it could be that when you discretize the process, because the discretized process is different, you're going to sample from a slightly different distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.811,
    "end": 2150.339,
    "text": "Now, by using Metropolis-Hastings, you're going to guarantee that this distribution that you sample from in practice is exactly the same as what you really want to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2151.297,
    "end": 2166.672,
    "text": " And so that's very important because it just tells you that, um, asymptotically, um, as, as the number of samples just rose to infinity, uh, you're going to recover exactly what you want it to recover, which is the adamant run to Google.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.433,
    "end": 2199.858,
    "text": " awesome i remember the metropolis hastings and the monte carlo markov chains in phylogenetics where you might have many many species and many many locations in the genome that you're doing phylogenetic inference over and you just sample sample sample and so all these techniques help accelerate what's possible with any given computational hardware",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.08,
    "end": 2225.205,
    "text": " so how would you bring this towards adaptive agents are we thinking about this sampling process as being guided by an adaptive agent and or are we sampling distributions about an adaptive agent that that's you know a great question and i think it sort of brings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.465,
    "end": 2247.81,
    "text": " us to the conclusion of this work is you can so in order to have adaptive agents and to scale adaptive agents so so that they're able to solve complex problems and you're able to implement them with like finite computational resources one useful tool is sampling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.587,
    "end": 2253.849,
    "text": " And we'll see many different places where sampling can be used and has been used in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.409,
    "end": 2278.096,
    "text": "But, and that's basically what you said, sampling is at the heart of sampling is, you know, choosing data points intelligently so as to approximate your integral or whatever it is that you want to do with those samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.292,
    "end": 2286.577,
    "text": " So you could think of adaptive agents as solving the sampling problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2287.278,
    "end": 2290.22,
    "text": "You could think of an active inference agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.24,
    "end": 2293.842,
    "text": "Let's say that you have a problem of sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.563,
    "end": 2302.128,
    "text": "You could think of an agent, an active inference agent, that's going to choose, oh, I'm going to sample here, and I'm going to sample here, and I'm going to sample here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.149,
    "end": 2306.071,
    "text": "So active inference agents in the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.179,
    "end": 2310.12,
    "text": " proper sense of the word, they do sampling all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.14,
    "end": 2329.809,
    "text": "The only, I would say slight difference with what we've just discussed is that active inference agents, they sample observations so that they're, they comply with their preferences and the observations that also bring them new information about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.098,
    "end": 2339.566,
    "text": " So the objective that active inference agents use to select new samples is the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.326,
    "end": 2356.701,
    "text": "So typically, we select actions or policies that have the lowest expected free energy, which means that the resulting observations will be close to your preferences or goal and also bring you new information about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.198,
    "end": 2371.128,
    "text": " But you could also conceivably think of an agent as, you know, selecting actions so that the resulting samples or observations accurately sample distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2374.048,
    "end": 2382.319,
    "text": " So how could sampling be used in the context of active inference and adaptive agents?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.08,
    "end": 2385.363,
    "text": "And so this is actually a great slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2387.085,
    "end": 2390.71,
    "text": "Because, so if you look at the upper panel,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2392.889,
    "end": 2395.51,
    "text": " is what I just discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.61,
    "end": 2410.313,
    "text": "So in the first equation that's up there, you see that the sequence of actions that you choose in active inference is the one that minimizes this minus log p, this probability distribution over action sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.133,
    "end": 2413.934,
    "text": "So this minus log p is actually the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.314,
    "end": 2418.255,
    "text": "So we choose action sequences that minimize expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.744,
    "end": 2425.525,
    "text": " As you see on the equation just below, the expected free energy is a sum of risk and ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.245,
    "end": 2432.446,
    "text": "So you're going to choose action sequences that minimize risk, but that also minimize ambiguity about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2433.527,
    "end": 2446.409,
    "text": "And in other words, as shown below, you're going to choose action sequences that maximize extrinsic value, so you could think of that as expected reward, and intrinsic value, so that would be expected information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.489,
    "end": 2450.19,
    "text": " value that's intrinsic because you gain information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.951,
    "end": 2463.374,
    "text": "So really the key here is that this expected free energy, as its name suggests, it's given by an expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.394,
    "end": 2468.576,
    "text": "So you see this minus log p on the left equals expectation of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.392,
    "end": 2485.129,
    "text": " now when you have a very big genitive model a very big world model which is going to be the case all the time when you have like a real world application or a complex application because the world around us is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.879,
    "end": 2494.124,
    "text": " so high dimensional, so complex, well, the expected free energy then is going to be a high dimensional expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.925,
    "end": 2496.065,
    "text": "What is an expectation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.305,
    "end": 2499.688,
    "text": "It's an integral with respect to a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.748,
    "end": 2513.216,
    "text": "So the point I want to get to is that to do decision making, you need to evaluate the expected free energy of different action sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.298,
    "end": 2519.421,
    "text": " And this expected free energy is an expectation with respect to probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.682,
    "end": 2527.726,
    "text": "It's a very high dimensional integration problem, very high dimensional integration expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2528.867,
    "end": 2530.468,
    "text": "And so how do you approximate that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.548,
    "end": 2531.749,
    "text": "Well, you use sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.589,
    "end": 2541.835,
    "text": "And I think the first work that actually used that in the context of active inference is the work by Funtas et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.007,
    "end": 2550.109,
    "text": " Uh, 2020 of, um, I think it's called scaling active inference with Monte Carlo method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.37,
    "end": 2551.69,
    "text": "Uh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.73,
    "end": 2558.212,
    "text": "Funtas with F O U. Um, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2558.232,
    "end": 2560.613,
    "text": "F O U N. Um, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.633,
    "end": 2563.333,
    "text": "Scaling active inference with Monte Carlo methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.134,
    "end": 2565.234,
    "text": "So this is what they did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2565.414,
    "end": 2568.535,
    "text": "They, and I think it was published in NeurIPS.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2569.795,
    "end": 2571.476,
    "text": "Um, so very big machine learning conference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.498,
    "end": 2594.28,
    "text": " and you know their observation was okay well we have this active inference method which theoretically is very powerful i mean in the sense that you have this expected free energy objectives that puts a lot of known constructs together so you know the expected free energy has shown in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.978,
    "end": 2621.133,
    "text": " in figure three here puts together this risk so this is the divergence between your predicted distribution of where you're going to be in the world and your target distribution of where you want to be in the world and it has this ambiguity term as well which has some nice links with phenomena in psychology like the streetlight effect so when you minimize",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.823,
    "end": 2631.925,
    "text": " When you choose actions that minimize ambiguity, you can recover phenomenology that's known in psychology, like the streetlight effect or the drunkard's search.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2632.465,
    "end": 2641.066,
    "text": "Risk is also an objective that's used in engineering in control as inference, so you can see it on the left panel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2641.927,
    "end": 2647.848,
    "text": "So there are a few methods for doing adaptive agents that use the scale term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2647.948,
    "end": 2649.308,
    "text": "One would be control as inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2650.309,
    "end": 2678.385,
    "text": " which is also known as maximum entropy reinforcement learning and KL control and also I think although it needs to be investigated further it hasn't been formally I think so far but with the KL term there you can recover predictions that are made by prospect theory which is a big theory from the end of the 20th century about decision making in human agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.577,
    "end": 2692.786,
    "text": " Um, so this is, I think, um, worthwhile to look into further, but, um, I think there's some very clear links between that theory and, and the scale term in the expected free energy anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.806,
    "end": 2696.749,
    "text": "Um, so you had this expected free energy objective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.809,
    "end": 2701.172,
    "text": "That's very powerful, has a lot of, puts a lot of things together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.272,
    "end": 2705.335,
    "text": "So I think theoretically it's very nice, um, in, in the, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.411,
    "end": 2716.694,
    "text": " Last line of the upper panel, you can also see that you can view expected PNG as weighing expected reward and expected information gain, so extrinsic value, intrinsic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.634,
    "end": 2726.897,
    "text": "And extrinsic value, it's used in expected utility theory, Bayesian decision theory, RL, optimal control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2726.937,
    "end": 2732.839,
    "text": "So these are all equivalent names for maximizing this extrinsic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.879,
    "end": 2736.12,
    "text": "And intrinsic value, expected information gain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.758,
    "end": 2738.659,
    "text": " It's also used in many different places.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.46,
    "end": 2749.424,
    "text": "And in, for example, in Bayesian experimental design, which is in statistics, it was a seminal paper by Lindley in 1956.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.584,
    "end": 2760.83,
    "text": "And Lindley basically said, okay, well, suppose that you can do two experiments or many different experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.87,
    "end": 2762.891,
    "text": "How should you choose between them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.931,
    "end": 2765.312,
    "text": "What's the best experiment that you should do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2766.152,
    "end": 2773.831,
    "text": " The answer that he came up with is, you should do the experiment that gives you the most information about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.095,
    "end": 2780.617,
    "text": " So you have to keep in mind that in that paper, there was no extrinsic goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.737,
    "end": 2787.841,
    "text": "It was not like, we're going to do an experiment to solve this problem or achieve these results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.021,
    "end": 2792.143,
    "text": "It was only doing an experiment for the sake of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.223,
    "end": 2798.146,
    "text": "And so he came to the conclusion that the best experiment was the one that maximized expected information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2798.931,
    "end": 2825.439,
    "text": " now suppose that you have a goal in mind a target um your target result or or whatnot then you would weigh reasonably only one thing you could do is weigh the expected information gain with your expected reward or expected utility or expected how close you're going to get to your goal and so this is exactly what the expected free energy does it puts these two things on the same footing so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.184,
    "end": 2836.165,
    "text": " So you have this expected free energy, which is very nice, and which is, you know, what active inference brings to the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.426,
    "end": 2849.028,
    "text": "And what Funtas et al did in their paper is, okay, well, we have this cool method, active inference, let's use it to solve non-trivial machine learning slash reinforcement learning problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.968,
    "end": 2857.99,
    "text": "And so when you actually want to solve those problems, you have some high dimensional giant models, high dimensional state spaces,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2858.85,
    "end": 2867.783,
    "text": " that just come up and you need sampling to approximate the expected pre-energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.823,
    "end": 2868.724,
    "text": "So this is what they did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.225,
    "end": 2875.273,
    "text": "And they also put together a lot of other cool tricks based on neural networks and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.504,
    "end": 2897.773,
    "text": " Um, so very cool paper, totally recommend, but I think the point it suggests, and this is also the point that we make, although in a very different way in this paper is that to actually do decision-making efficiently in practice efficiently, but also you want to do take good decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2898.493,
    "end": 2899.854,
    "text": "Um, you actually need sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2906.315,
    "end": 2908.078,
    "text": " And this is not a new point, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.098,
    "end": 2912.306,
    "text": "I think many people would agree with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.257,
    "end": 2924.626,
    "text": " Um, but I think the, the active inference approach is nice because you have this, um, explicit characterization of expected PNG as an expectation of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.067,
    "end": 2931.552,
    "text": "So then it becomes pretty clear that you want to do sampling because this is what the sampling is made for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.353,
    "end": 2941.16,
    "text": "Um, so I initially introduced sampling, as you know, wanting to approximate integrals, but expectations are integrals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.696,
    "end": 2945.06,
    "text": " So yeah, sampling is really what you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2945.161,
    "end": 2949.971,
    "text": "It just comes up like extremely directly when you want to do these kinds of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.251,
    "end": 2973.281,
    "text": " thanks and one sensory example of information driven sampling is the eye saccade the movement of the eyes which also has been modeled in many works from the active inference perspective and it's even below our level of conscious awareness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.221,
    "end": 2985.446,
    "text": " with the eyes darting around to reduce their uncertainty such that our visual generative model can have high resolution and color throughout the visual field",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.448,
    "end": 3013.281,
    "text": " even though that doesn't reflect the anatomy of the retina which has a blind spot and differential resolution and color detection in the periphery so i kind of see that as slam dunk evidence that our visual experience and by extension other sensory modalities are coming from the generative model they're not just received and processed in an inward bound fashion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.475,
    "end": 3036.529,
    "text": " and that adaptive sampling is vital to maintain the coherence of that generative model absolutely absolutely you want to do adaptive sampling in order to preserve preserve the structure i mean you have this beautiful structure in the expected free energy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.035,
    "end": 3066.749,
    "text": " expect information gain um so let's say we're just like wanting we're just like looking at stuff so we don't have any direct goal the expected energy reduces to expect information gain or you know approximates that and you just want to sample you sampling is the key to approximate you know this expected information gain term while preserving the statistics of the genitive model so it's very um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3067.711,
    "end": 3070.753,
    "text": " they're very central to scaling active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.214,
    "end": 3076.277,
    "text": "I wouldn't say it's central to active inference proper, just the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.618,
    "end": 3082.622,
    "text": "Because in the theory, you get these expectations and you know how to select actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.443,
    "end": 3093.69,
    "text": "But anytime you want to scale active inference, deploy active inference to solve a problem, you want to, I mean, sampling is going to come into play inevitably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3096.132,
    "end": 3096.973,
    "text": "And if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3098.593,
    "end": 3103.146,
    "text": " Yeah, I mean, there's other ways to scale active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3104.69,
    "end": 3105.672,
    "text": "One other way could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.208,
    "end": 3136.346,
    "text": " what's called amortizing amortization so with deep neural networks so one thing you could do is train a neural network to predict the expected free energy based on your genetic model and your sensory data but this amortization procedure as does any training of neural networks it's going to require a lot of data so it's going to be slow it's not something that you can deploy right away so this is a very nice way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3137.202,
    "end": 3146.886,
    "text": " I mean, amortization is a very nice way of doing things, but it's not something that you can use the first time you use Active Inference to solve a new task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.586,
    "end": 3158.93,
    "text": "So a nice way of scaling Active Inference, and it's not the only way or it's not going to solve all the problems, but it would be to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.827,
    "end": 3165.871,
    "text": " use sampling to approximate the expected free energy to make decisions in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.891,
    "end": 3171.435,
    "text": "And as you accumulate data, then you can train a neural network to predict the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3172.196,
    "end": 3176.32,
    "text": "I think this is exactly what Funtas et al did in their paper, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.36,
    "end": 3178.742,
    "text": "So if you're interested, make sure to check it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.605,
    "end": 3204.37,
    "text": " Figure three, it's something that one can just look at for so long because the imperative, what is being utilized in action selection by an active inference agent is something like a generalization of all the words that we see written lower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.53,
    "end": 3210.351,
    "text": "And unless we knew about that generalization or that unified imperative,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.576,
    "end": 3215.179,
    "text": " it seems like these are quite literally orthogonal or disparate from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.199,
    "end": 3217.841,
    "text": "I mean, what could be more different than",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.056,
    "end": 3226.557,
    "text": " maximum information gain oriented strategies and maximum reward driven strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.397,
    "end": 3235.959,
    "text": "And sometimes to get both those flavors in the same model, people might try to coerce one into the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.339,
    "end": 3247.801,
    "text": "Usually we see that in terms of a novelty bonus or an exploratory impulse bolted on to a reward or a pragmatic value driven agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.681,
    "end": 3258.131,
    "text": " And so once you start modifying the models and just adding in these arbitrarily constructed components, you may get adaptive behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.672,
    "end": 3263.077,
    "text": "It's never been a claim in the active space that other models don't have efficacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.378,
    "end": 3270.725,
    "text": "Rather that by thinking about all of these special cases as being adaptive,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.033,
    "end": 3297.523,
    "text": " situationally arising from a more general imperative with expected free energy for future oriented policy selection we might gain the ability to do what what will we gain conceptually or or in practice by taking situations where today people are using maybe just one of these terms as an imperative for what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.57,
    "end": 3323.404,
    "text": " their models are doing and what do we gain or what might we expect from potentially generalizing those imperatives you know that's um that's a brilliant and very difficult question um it's also a question that i would say everybody in active inference gets asked at some point because people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3324.927,
    "end": 3335.229,
    "text": " Um, let's say people doing reinforcement learning, they, they use many different objectives, uh, that would be tailored to solving one particular task or a different task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3335.309,
    "end": 3344.071,
    "text": "And they would, um, have these, um, ad hoc novelty bonuses that would work very well in certain tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3344.371,
    "end": 3348.032,
    "text": "And so it's a, it's a different approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.412,
    "end": 3349.572,
    "text": "Um, the.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3350.716,
    "end": 3357.538,
    "text": " This approach that I was just mentioning with reinforcement learning tends to be much more bottom-up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.718,
    "end": 3364.38,
    "text": "It's like we want to have an agent that solves this problem, makes this work, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.42,
    "end": 3370.302,
    "text": "So we're going to start building and test it until it works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.064,
    "end": 3396.872,
    "text": " The active inference approach is top-down so it's you know, it starts from the furniture principle and It's very theoretical and the approach is like, okay Well, let's model how an agent interacts with its environment the most generic kind of agent and let's impose constraints that an agent has to satisfy so the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.004,
    "end": 3406.15,
    "text": " The basic constraint that we have in this paper is that you have three sets of variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.871,
    "end": 3412.375,
    "text": "You have variables in the external world that you cannot directly have access to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.276,
    "end": 3416.878,
    "text": "So this would be maybe the temperature in the room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.7,
    "end": 3422.663,
    "text": "Then you have sensory variables or observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3423.764,
    "end": 3427.507,
    "text": "So by the way, the environmental variables, they're denoted as S.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.796,
    "end": 3434.962,
    "text": " The sensory observations are denoted as O. This is what belongs to the world and you have direct access to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.011,
    "end": 3445.313,
    "text": " This would be like your sensations, what you see and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.153,
    "end": 3458.359,
    "text": "And then you have the actions, uh, denoted in the paper by a, which is, uh, basically what you can do and that, I mean, the different things, the different options that you can choose from at any point in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3459.079,
    "end": 3464.562,
    "text": "And this is what will enable you to influence the world S and influence your observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3464.762,
    "end": 3469.704,
    "text": "Oh, so we start from a very generic model of an agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3470.601,
    "end": 3475.805,
    "text": " and how it interacts with the world, these three sets of variables that evolve in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.926,
    "end": 3499.823,
    "text": "And just by adding a few other, I would say, constraints that agents satisfy or intelligent agents hopefully satisfy, you get that these agents can be described as minimizing, as taking decisions that minimize the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.41,
    "end": 3505.775,
    "text": " So the expected free energy just comes up from this general theory of how agents behave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3508.337,
    "end": 3514.802,
    "text": "So to answer your question, what does this actually bring in practice?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3515.623,
    "end": 3522.609,
    "text": "Well, first of all, there's many methods out there that are similar to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3524.15,
    "end": 3526.933,
    "text": " In some cases, they're almost the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.735,
    "end": 3535.203,
    "text": "The first difference is, which is not necessarily an advantage or a disadvantage, but it's the approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3535.964,
    "end": 3543.333,
    "text": "These other methods that you see out there that come very close to active inference, they have been designed from a bottom-up perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3544.608,
    "end": 3570.585,
    "text": " approach of like we want to model this system or we want to solve this task so we're going to add all the components that are needed until our agent does what we want it to do and it turns out that sometimes all these ingredients turn out to be exactly what we get in active inference or very similar other times maybe the task would be simpler and you would get less ingredients",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.647,
    "end": 3600.985,
    "text": " the disadvantage of that i would say is that it can turn out to be very messy so you get a new task or a new thing to model maybe a new paradigm that some subject would do and you end up using a very different model a very different objective to describe the behavior at hand so it's not very um you know it's harder to have like a unified perspective of what's going on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3602.293,
    "end": 3618.822,
    "text": " active inference, the I would say the key, the key contribution is that you get this unified perspective from it, you get this objective that puts together a lot of other constructs that we that we know and love, and put them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.842,
    "end": 3630.588,
    "text": "And you know that with this objective, you can do a lot of things, which is, for example, decision making, that weighs exploration and exploitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.658,
    "end": 3640.007,
    "text": " Now there are some challenges with Active Inference and anybody using Active Inference would be familiar with them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3640.628,
    "end": 3642.67,
    "text": "The first one is the scaling up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3643.851,
    "end": 3648.996,
    "text": "Because you have this approach, Active Inference, which is so complex in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.477,
    "end": 3652.32,
    "text": "I mean, you need to have a giant model of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.314,
    "end": 3682.117,
    "text": " you need to have uh to be able to compute all these expectations no first of all you need to be able to compute all these posterior distributions using bayes rule or variational inference then once you have those posterior or approximate posterior distributions based on your high dimensional model of the world then you need to compute some expectations very high dimensional expectations using sampling or whatnot to then get the expected free energy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3683.106,
    "end": 3685.147,
    "text": " So expected free energy doesn't come up for free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3685.167,
    "end": 3688.59,
    "text": "It's actually a very, um, I would say it's quite sophisticated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.69,
    "end": 3690.111,
    "text": "It's a quite sophisticated thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3690.151,
    "end": 3693.513,
    "text": "I mean, he puts all these things together, but it doesn't come for free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3693.533,
    "end": 3699.037,
    "text": "It's, um, it's hard to implement on a practical problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3699.277,
    "end": 3705.061,
    "text": "That's non-trivial beyond, beyond toy simulations and people have done it, but it's a challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3705.941,
    "end": 3708.463,
    "text": "Um, so the.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.226,
    "end": 3736.252,
    "text": " problem the problem that active inference has is okay well we have this nice theory we have this um very nice objective that theoretically works very well and theoretically it's it's like or it's similar to what you would like to have for any kind of um yeah any kind of agenda but we need to find ways of scaling this up and and so here comes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3737.045,
    "end": 3746.447,
    "text": " Here comes the beauty of this is that in scaling up Active Inference, you're going to use sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3746.467,
    "end": 3749.548,
    "text": "You're going to use techniques from optimization from inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3751.748,
    "end": 3757.33,
    "text": "And so you're going to get something that's slightly different from the Active Inference scheme that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3758.07,
    "end": 3762.991,
    "text": "So you had the Active Inference scheme proper, which was in the picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3764.907,
    "end": 3766.348,
    "text": " in the previous slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3769.409,
    "end": 3782.994,
    "text": "And so, you know, this is active inference as you would like to implement it if you could, but because the problem is complicated and you have a high dimensional state space and so on, you have many things that are computationally intensive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3783.564,
    "end": 3786.806,
    "text": " You're going to use sampling, you're going to use optimization, you're going to use inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3787.506,
    "end": 3798.393,
    "text": "And so you're going to get something, an active inference algorithm that scales, but that's slightly different from what you started because it has all these other steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3799.653,
    "end": 3805.017,
    "text": "Now, in doing so, the active inference agent becomes engineered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3806.477,
    "end": 3827.49,
    "text": " So it becomes closer to these reinforcement learning and bottom-up agents that are built in a bottom-up way to solve certain tasks, you know, because you want to engineer the active inference algorithm to be able to work to solve a certain problem, to scale it in a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3828.627,
    "end": 3832.608,
    "text": " So in doing so, active inference becomes closer to reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3833.428,
    "end": 3843.49,
    "text": "Now, conversely, in reinforcement learning, the amount of compute is increasing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3845.311,
    "end": 3854.173,
    "text": "People want to build reinforcement learning agents that increasingly learn in an unsupervised manner,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3858.13,
    "end": 3867.436,
    "text": " Um, you can't always, you know, design all the, um, all the components of your reinforcement learning agent to solve any single tax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3867.456,
    "end": 3868.636,
    "text": "It's just too impractical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3868.656,
    "end": 3885.466,
    "text": "And especially when a task become more and more complicated, uh, you just would like general solutions that, you know, are going to work, um, and are going to handle a lot of different types of situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.443,
    "end": 3892.629,
    "text": " So reinforcement learning is adding or subtracting ingredients to their algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.549,
    "end": 3911.205,
    "text": "All these algorithms are evolving, but in some sense you can see, this is debatable, I suppose, but you can see a general tendency towards moving to world models and generative models, moving to intrinsic motivation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3911.713,
    "end": 3930.59,
    "text": " which is another word for expected information gain or or variance thereof and an intrinsic motivation or intrinsic value that's added onto extrinsic value which is your expected reward so you see um many",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.414,
    "end": 3955.491,
    "text": " I mean, I think we're seeing reinforcement learning evolve in a direction also that is closer to active inference because everybody wants algorithms that solve different tasks and not to have to change the algorithms for changing environments and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3955.691,
    "end": 3958.353,
    "text": "So in my view, even though we started with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.888,
    "end": 3962.29,
    "text": " two different approaches, a bottom-up approach and a top-down approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3963.611,
    "end": 3964.612,
    "text": "These are converging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3965.853,
    "end": 3982.665,
    "text": "Now, to come back to the contribution of active inference, if one reads through the paper and one looks at the derivation of active inference, the point is that it's very agnostic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3982.925,
    "end": 3985.227,
    "text": "It's agnostic to the environment that we're in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3986.149,
    "end": 3988.33,
    "text": " It's an agnostic to many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.39,
    "end": 3989.81,
    "text": "So it's very, very general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.831,
    "end": 4006.917,
    "text": "And so if you take, um, many practical reinforcement learning agents, um, you will see that they interact with their environment in a way that's compatible with the assumptions of the 300 principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4008.097,
    "end": 4015.46,
    "text": "In other words, um, the, uh, reinforcement learning agents can be recast",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4016.181,
    "end": 4019.924,
    "text": " as specific active inference agents with specific giant models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4020.885,
    "end": 4022.507,
    "text": "So this is really the key thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4022.807,
    "end": 4026.35,
    "text": "It's this unifying perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.59,
    "end": 4037.2,
    "text": "I'm not saying it unifies everything, but I'm saying that many different reinforcement learning algorithms can be recast as active inference agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4038.658,
    "end": 4059.629,
    "text": " And so this is not to say that the active inference implementation of those reinforcement algorithms is going to be better, but it's more like a theoretical contribution of like this set of equations given by the expected pure energy is a complete recipe or almost complete recipe to generate adaptive agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4060.349,
    "end": 4063.571,
    "text": "So in some sense, you don't have to go any further than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4064.477,
    "end": 4079.326,
    "text": " And so you can view all these reinforcement learning algorithms that comply with the assumptions, so that can be recast as active inference algorithms, as ways of scaling active inference and making active inference work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4080.406,
    "end": 4091.233,
    "text": "So it's not like I don't see any kind of conflict between active inference and reinforcement learning, but it's more like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4092.441,
    "end": 4097.843,
    "text": " the reinforcement learning algorithms that work well and that can be recast as active inference algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4097.983,
    "end": 4105.466,
    "text": "And there are many, I mean, I would say more algorithms that can be recast than algorithms that cannot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4106.566,
    "end": 4110.388,
    "text": "When you look at the assumptions of the pre-energy principle that are super generic,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4111.283,
    "end": 4121.171,
    "text": " So you can view all these algorithms as specific implementations of active inference in a way that active inference is meant to scale well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.152,
    "end": 4125.114,
    "text": "So this is kind of like the thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.274,
    "end": 4130.759,
    "text": "And so I think ultimately, again, these two fields are going to converge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4131.98,
    "end": 4135.322,
    "text": "But I do not see any tension between them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.522,
    "end": 4138.945,
    "text": "It's more like the tools from one can be used in the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.646,
    "end": 4144.728,
    "text": " And, and yeah, I see, I mean, I see great work going forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.868,
    "end": 4154.432,
    "text": "And this is kind of like, what do we want to do with this paper, you know, put this active influence where it comes from very succinctly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4155.512,
    "end": 4162.855,
    "text": "And also, you know, make it accessible for people who don't know the jargon from the French principal and active influence community.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4163.856,
    "end": 4168.978,
    "text": "And yes, see, see, I mean, the exciting developments that that will follow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4171.36,
    "end": 4172.802,
    "text": " Wow, great comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.062,
    "end": 4175.646,
    "text": "Two things that that reflects to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.607,
    "end": 4187.783,
    "text": "The constraints that you mentioned, which we sometimes call the particular partition, essentially cleaving the particle, which you show in figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.905,
    "end": 4216.67,
    "text": " cleaving the particle from the environment this is something that's widely applied in agent-based modeling just anytime you're talking about some field of action and a player we're basically at least qualitatively within the space of partitioning agents from environments and then further saying well there's no edge between the internal and the external states so there's no telepathy and there's no telekinesis and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.648,
    "end": 4245.184,
    "text": " incoming information we're going to call sense outgoing we're going to call action that qualitatively and formally is basically consistent with almost any cybernetic formulation of adaptive action so the constraints are really quite minimal and seemingly being generalized year after year with the work so many colleagues are involved in so the constraints are not onerous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.383,
    "end": 4251.851,
    "text": " And I think it's a really interesting question which reinforcement learnings are compatible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.392,
    "end": 4262.826,
    "text": "And then coming from the other side, in a lot of active modeling contexts, we find ourselves sometimes proposing like auxiliary variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.587,
    "end": 4265.789,
    "text": " Like, let's just do a parameter sweep over this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.57,
    "end": 4269.473,
    "text": "And then we'll look back to the textbook or to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.513,
    "end": 4271.856,
    "text": "We think, well, where was that in expected free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.276,
    "end": 4274.318,
    "text": "We just proposed this random thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.059,
    "end": 4276.18,
    "text": "Where was that in the equation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.6,
    "end": 4282.126,
    "text": "Or we'll look at step-by-step guide to active inference, where it's all written in terms of matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.166,
    "end": 4283.107,
    "text": "It's all very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.128,
    "end": 4289.811,
    "text": " read it like a sentence and all of a sudden it's like, wait, A could be a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.891,
    "end": 4291.172,
    "text": "It doesn't just have to be a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.812,
    "end": 4300.537,
    "text": "So it's kind of like we bring in these methods and ingredients that are being used widely empirically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.758,
    "end": 4303.899,
    "text": "And these are the two approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.199,
    "end": 4310.143,
    "text": "Do we build the bottom up mosaic of approaches stopping when it works?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.716,
    "end": 4334.841,
    "text": " and or do we start with this most general agent-based cybernetic formulation and then kind of build the castle in the sky and meet in the middle again with something that works it's just incredibly laid out and this paper is at that saddle point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.072,
    "end": 4356.746,
    "text": " because it has one hand or antenna or whatever in this smooth information geometry conceptual area, but the motivator of all of the conceptual moves that are made, which honestly are extensive, like page after page, it was just like, where's it going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.307,
    "end": 4362.93,
    "text": "It's going somewhere that can be simulated on everyday hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.869,
    "end": 4391.759,
    "text": " so many of the moves were about reshaping or reframing what was to be done in a way that could be simulated and so those two paths are connecting and like you said there's not necessarily attention but it'll be quite interesting to see how this develops on the theory practice and social frontiers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.217,
    "end": 4419.793,
    "text": " as more and more of these threads start to combine yeah i agree i think it's um particularly beautiful when you know theory meets practice um you oftentimes have you know practice that works but you have no theory or you have a theory that's beautiful but that doesn't work in practice and you know this just happens all the time um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.889,
    "end": 4425.871,
    "text": " Typically, you would have practice that works and then you would try to build a theory out of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.052,
    "end": 4430.313,
    "text": "But then often the theory turns out to be too hard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4430.333,
    "end": 4433.895,
    "text": "So, you know, make some extra assumptions and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4433.955,
    "end": 4437.917,
    "text": "You end up with a theory, but the theory turns out to be quite removed from the practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4438.017,
    "end": 4439.138,
    "text": "You kind of get that gap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4440.739,
    "end": 4446.522,
    "text": "It's very beautiful and quite unique and also quite rare when the theory meets the practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4447.561,
    "end": 4454.644,
    "text": " And I would say when the theory meets the practice and in particular meets the state of the art, then you kind of have a complete theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.265,
    "end": 4469.691,
    "text": "So what we wanted to do in this paper is review these different fields in a way that we could show how far the community has gone between making a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4473.985,
    "end": 4474.645,
    "text": " state of the art.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4475.545,
    "end": 4492.25,
    "text": "And every section was started with theoretical considerations about what should be when you need to solve a particular problem, let's say adaptive agents or sampling or optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.59,
    "end": 4500.893,
    "text": "And then from there and from logical steps about, okay, well, it should be like this and not like that because there's this,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4501.932,
    "end": 4506.255,
    "text": " you know, whatever kind of geometric argument or or other arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.096,
    "end": 4526.089,
    "text": "And so from there, logically arriving at state of the art methods that are used in practice, the the other kind of like sequence of logical steps was, OK, well, we're going to start with optimization, which is, in my view, at the root of everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4527.591,
    "end": 4533.435,
    "text": " So sampling, it could be about optimizing samples to obtain the best approximation to your integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4534.035,
    "end": 4541.279,
    "text": "Inference is about optimizing beliefs and decision-making is about optimizing decisions based on their counterfactual consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4541.319,
    "end": 4547.903,
    "text": "So we started with optimization because it's the simplest thing, both conceptually and also in terms of use case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4548.82,
    "end": 4571.664,
    "text": " you need optimization to do everything else we then went to sampling and to inference and finally to decision making because it just brings all these three ingredients together we didn't go as far as showing okay well this is how you should scale active inference in order to solve all the problems in the world because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4575.004,
    "end": 4588.315,
    "text": " But we listed a few ingredients that have gone into the literature and also a few ingredients that this perspective offers to, you know, how to scale active inference and make it more effective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4588.756,
    "end": 4599.064,
    "text": "So it's actually future work and an open problem to, you know, use the techniques that have been developed in the sampling section and the sampling literature to make",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.884,
    "end": 4617.017,
    "text": " active inference even more scalable and same with optimization and same with inference so there's many things many things that have been put forward in this article and also elsewhere that can be used to you know scale active inference but at least yeah the goal was to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.004,
    "end": 4630.873,
    "text": " comprehensive as possible without sacrificing too much of actually understanding what's really going on and show how the theory meets the practice throughout and really where the field stands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4632.954,
    "end": 4636.736,
    "text": "So one kind of reflection on this again is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.109,
    "end": 4648.773,
    "text": " If we start with reward as our basal imperative pragmatism, I mean, after all, don't we want to get things done, achieve results in the world, realize our preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.393,
    "end": 4661.437,
    "text": "We start with pragmatism and then it is empirically ad hoc how people introduce these novelty bonus or intrinsic motivations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.158,
    "end": 4663.898,
    "text": "In contrast,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.127,
    "end": 4687.069,
    "text": " we can start with this information gain approach and then the thumb is put on the scale to bring more and more emphasis onto the alignment with preference so it's like two roads two paths and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4688.996,
    "end": 4711.503,
    "text": " maybe this is our bias or corner of the information space that starting with a broader epistemic imperative allows the careful introduction of pragmatic value whereas a pragmatic foundation that uh it's hard to then recast",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4712.972,
    "end": 4717.695,
    "text": " epistemic value in terms of pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.915,
    "end": 4720.336,
    "text": "That's kind of like the question of valuing basic research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.157,
    "end": 4732.123,
    "text": "And the approach taken here is develop an imperative that can look entirely like one or the other or mixtures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.243,
    "end": 4741.068,
    "text": "But what's always so perplexing is that it has this extrinsic and intrinsic value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.749,
    "end": 4771.839,
    "text": " phrasing but there are other ways to decompose the function so even intrinsic and extrinsic value are not necessarily the ingredients that were put in it's more like they were two ingredients that were split out of something else that is much more integrated it wasn't like the free energy was constructed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.502,
    "end": 4802.397,
    "text": " by composition of any given decomposition of which there are multiple for variational free energy and expected free energy and so then a question that i've often wondered is there might be two policies that are very close or have essentially identical expected free energy but they could be radically different for example one could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.162,
    "end": 4830.372,
    "text": " having a good expected free energy because it realizes a lot of preferences another might because it provides a lot of information gain so is it really as simple asterisk asterisk asterisk as a unified imperative or how do we make sense of the fact that one value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.925,
    "end": 4857.559,
    "text": " could rank policies that might have for example extremely different danger profiles or envelopes of outcomes how can that seemingly multi-dimensional space be projected into essentially a ranking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.676,
    "end": 4862.638,
    "text": " Yeah, it's a complicated question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4862.658,
    "end": 4868.143,
    "text": "I would say, as we can see, the Expected Free Energy does this in some way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4868.984,
    "end": 4877.911,
    "text": "It provides an answer to this question based on your preferences and how much you would gain by observing this new data, how much information you would gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4879.052,
    "end": 4882.014,
    "text": "You can put these two things on the same footing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.074,
    "end": 4885.136,
    "text": "This is what Expected Free Energy does, and it gives you a ranking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4886.598,
    "end": 4888.039,
    "text": "You're right to say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.678,
    "end": 4894.662,
    "text": " you're right to say that two very different courses of action could have the same expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4896.624,
    "end": 4897.945,
    "text": "And so how do you choose between them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4898.666,
    "end": 4909.614,
    "text": "Well, the standard formulation that you would see in textbooks or papers has, okay, well, G of action sequence equals this and G of action sequence equals that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4910.155,
    "end": 4913.197,
    "text": "So these two action sequences have the same G and you don't know what to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4914.138,
    "end": 4914.558,
    "text": "But here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4916.207,
    "end": 4923.71,
    "text": " the theoretical development in this paper makes it very clear that the expected PNG is a minus log probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4924.37,
    "end": 4934.634,
    "text": "And this is why, so to make it more transparent, instead of using the letter G that's commonly used in the literature we used, we kept the minus log P throughout.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4934.654,
    "end": 4941.397,
    "text": "So we never used the letter G. And so the expected PNG is this minus log P of action sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4942.475,
    "end": 4970.471,
    "text": " so it says okay well if two action sequences have the same expected free energy well then you have let's say you just have two of them with the same expected energy the lowest one well then you choose probabilistically like half of the time you choose one and half of the time you use the other actually it's uh even a bit more complicated because if you since it's a minus log p you could have like um an action sequence with a very high",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4972.448,
    "end": 4994.909,
    "text": " expected free energy and so this means that you can still take it but if you would take it like not very often so you have an exponentially low chance of taking that action sequence so it's it's a probabilistic description it doesn't say it says that the most likely action sequence would be the argument",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4995.743,
    "end": 5010.298,
    "text": " the minimum of the expected free energy so this is like the top line in in the figure and so if you have uh two most likely action sequences well then you choose like half of the time you choose one half of the time you use the other but then in general",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5010.982,
    "end": 5032.46,
    "text": " if you didn't want to simulate the most likely action sequence, then you choose probabilistically between all of them, and the action sequences that have the lowest expected free energy have an exponentially higher chance of being selected, and the others don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5032.52,
    "end": 5035.402,
    "text": "So there's another very nice perspective is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.109,
    "end": 5053.798,
    "text": " the probability over action sequences, so this p of a greater than equal to t, is then the exponential of minus the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5054.198,
    "end": 5059.322,
    "text": "Because if you take exponential minus of what you get in the equality on the left,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5060.282,
    "end": 5065.084,
    "text": " then you recover this probability distribution over action sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.544,
    "end": 5073.388,
    "text": "So this probability distribution over action sequences is exponential minus expected free energy, exponential minus what's in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5074.168,
    "end": 5079.411,
    "text": "And we saw before that Gibbs measures, they arise everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5079.591,
    "end": 5081.492,
    "text": "And so this is an example of a Gibbs measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5081.512,
    "end": 5083.893,
    "text": "You have exponential minus something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5085.674,
    "end": 5088.535,
    "text": "Basically based on the formalism of the free energy principle,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5089.767,
    "end": 5095.591,
    "text": " it comes up that the probability distribution over actions is a Gibbs measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5097.172,
    "end": 5102.335,
    "text": "It is the Gibbs measure where what's inside is the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5103.896,
    "end": 5107.798,
    "text": "So, yeah, it's kind of like a full circle thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5108.218,
    "end": 5118.705,
    "text": "And this is basically this sort of like connections that just happened all the time when we were writing this paper and discussing because this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.517,
    "end": 5139.086,
    "text": " so many things that just there's so many crossovers at so many different levels, like on the sort of like object level that you're studying, but also on the methodological level, like methodologies that are used in some field, they're used in a different field to do something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.167,
    "end": 5141.588,
    "text": "So there's so many crossovers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5142.248,
    "end": 5146.27,
    "text": "And so this is, I would say an interesting example of why",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5147.361,
    "end": 5150.483,
    "text": " you know, gives measures, it gives distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5150.503,
    "end": 5151.783,
    "text": "They just arise everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5151.823,
    "end": 5153.144,
    "text": "They arise in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5153.984,
    "end": 5157.666,
    "text": "And as we saw before, they're hard to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5158.346,
    "end": 5169.111,
    "text": "So if you wanted to, so let's say you have your Gibbs distribution that says, okay, well, this is my distribution of our action sequences that I get from the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5169.772,
    "end": 5170.812,
    "text": "Now you have two choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5171.493,
    "end": 5174.314,
    "text": "Either you sample from it to sample like, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5175.886,
    "end": 5201.179,
    "text": " um yeah an average i would say not a typical a typical action sequence or you could optimize the distribution or optimize the expected free energy to sample the most likely action sequence in in the two cases after you've done your planning with the expected free energy you have a choice between sampling and optimization so you kind of go back full circle of like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5202.228,
    "end": 5210.91,
    "text": " Um, if I want to select my action in the end, I either select the most likely action by optimizing the expected free energy or the Gibbs measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.93,
    "end": 5227.233,
    "text": "Uh, this, I mean, by optimizing this minus slot P by taking the, the, yeah, the action sequence with the minimal expected free energy, or, um, I have my Gibbs measure and then we'll sample from it to like get a typical action sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5228.094,
    "end": 5229.914,
    "text": "So it's all like super interrelated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5233.988,
    "end": 5242.037,
    "text": " very interesting in the par at all textbook from 2022",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.514,
    "end": 5266.981,
    "text": " that dialectic is mapped onto the mammalian nervous system where policies can be selected by essentially passing through habit proportionally or expected free energy can be applied to sharpen or optimize the posterior on action and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.977,
    "end": 5274.859,
    "text": " Does this influence how you select micro, meso, or macro actions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.421,
    "end": 5288.625,
    "text": "Do you mean like for a human being, like actions at the cellular level, actions at the global level, or is it something different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.825,
    "end": 5293.928,
    "text": "Like at the personal, grasping a coffee cup at the micro,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.31,
    "end": 5301.658,
    "text": " larger scale decisions, attention allocation, communication emissions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.68,
    "end": 5304.261,
    "text": "Yeah, I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5306.215,
    "end": 5312.2,
    "text": " I think all of these things can be formulated in this treatment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5312.24,
    "end": 5319.645,
    "text": "So for example, attention would be where you choose to place your focus or your mental eye, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5321.207,
    "end": 5322.988,
    "text": "So that's an internal action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5323.068,
    "end": 5326.611,
    "text": "It could be unconscious, it could be undirected, but it's still happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5326.631,
    "end": 5331.855,
    "text": "I'm not an expert, but there's a lot of talking",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5333.166,
    "end": 5337.128,
    "text": " consciousness research of like you being conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5337.428,
    "end": 5349.714,
    "text": "I mean, there's a very low amount of processes that are conscious and these change according to where your inner eye or your conscious eye, whatever you want to call it, like moves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5351.575,
    "end": 5360.403,
    "text": " This could be thought of as a mental action or an inner action that you may or may not control, but it's still an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5362.605,
    "end": 5373.396,
    "text": "All other actions, whether it is planning at the short timescale, taking a coffee cup, standing, or planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5374.494,
    "end": 5378.395,
    "text": " at the longer time scale, like what am I going to do after my PhD and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5379.616,
    "end": 5381.157,
    "text": "All of these things are actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5383.237,
    "end": 5395.442,
    "text": "So typically, and as you know, of course, we model that by using hierarchical models where you have different levels in your gianted model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5395.502,
    "end": 5400.964,
    "text": "So in your model of the world and the higher levels that are like more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5401.471,
    "end": 5406.394,
    "text": " represent more abstract representations more and also longer timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5406.414,
    "end": 5417.302,
    "text": "So it could be, let's say, at some higher level, I'm going to take the plane to go to Amsterdam, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5417.322,
    "end": 5422.345,
    "text": "And at the lower level, okay, well, once in Amsterdam, I'm going to do this, this and this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5422.445,
    "end": 5429.43,
    "text": "It's like this action at the higher level of taking the plane predates everything that you're going to do at the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.652,
    "end": 5446.477,
    "text": " And so factorizing these different decisions into different levels of a model allow you to be computationally practical and practically implementable when you make those decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5446.557,
    "end": 5457.841,
    "text": "And presumably this is why we do in our everyday life factorize decisions and representations into low level and high level things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5460.089,
    "end": 5481.04,
    "text": " The beauty of the free energy principle and of the treatment here, but the treatment here is again just the free energy principle in its most bare bones and general form, is that the expected free energy is formulated for any kind of generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5482.272,
    "end": 5488.555,
    "text": " The generative models that you have in the figure on the bottom right there, they could be arbitrary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5488.615,
    "end": 5497.82,
    "text": "So you could use this form of expected free energy for hierarchical generative models that have all these high-level, low-level decisions and representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.261,
    "end": 5504.163,
    "text": "But you could also use it for any other kind of generative model or world model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.764,
    "end": 5511.067,
    "text": "The only difference is that with some world models, it would be very hard to implement this in practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5513.222,
    "end": 5515.345,
    "text": " and with other world models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5515.826,
    "end": 5519.732,
    "text": "And in particular, those that are highly factorized and distributed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5520.447,
    "end": 5523.728,
    "text": " like hierarchical models, like the ones we just talked about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5524.328,
    "end": 5544.695,
    "text": "With these, it would typically be much simpler to take decisions that minimize expected free energy when it comes to practical computation, just because when you have factorized representations, computations just factor out a lot, and it's just way simpler to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5545.796,
    "end": 5549.617,
    "text": "But the formulation here is entirely generic, and it could apply to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5551.059,
    "end": 5578.236,
    "text": " um all kinds of models and all kinds of situations very interesting well in our last little segment on the dot one let's hear your perspective or overview on the roadmap just walk through what the sections are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.614,
    "end": 5584.976,
    "text": " And you mentioned some related topics, but what do the subjects probably cover?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.117,
    "end": 5586.897,
    "text": "Why are they structured in that order?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5588.598,
    "end": 5588.818,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5589.539,
    "end": 5601.464,
    "text": "Um, so the, well, first of all, the, the introduction, it just puts like everything in context, um, the kind of the, the conducting line or, or one of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5602.15,
    "end": 5606.353,
    "text": " common points between all of these sections is that there's a lot of geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.914,
    "end": 5614.92,
    "text": "So this was not purely, you know, because the journal is like the handbook of statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5614.98,
    "end": 5616.381,
    "text": "It was called geometry and statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5616.401,
    "end": 5623.546,
    "text": "So this is not just for that, but it's because geometry just comes up naturally, you know, in all these places.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5625.087,
    "end": 5631.612,
    "text": "So this is what we explained in the introduction, like the, how geometry comes up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5632.284,
    "end": 5638.33,
    "text": " the different branches of geometry that come up in these different fields and how they're interrelated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5638.49,
    "end": 5651.963,
    "text": "And so just from there, you kind of get a picture of, okay, well, this branch, let's say, simplex geometry, for example, it comes up in accelerated optimization, and it also comes up in sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5653.204,
    "end": 5656.127,
    "text": "And so you can already see from there, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5657.213,
    "end": 5679.732,
    "text": " what is going to be discussed of course but also like which branches geometry of geometry occur where and what what kind of like parallels there are um already um so going from the introduction to accelerated optimization so optimization it's um conceptually it's a very simple thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5680.327,
    "end": 5681.987,
    "text": " It's like, okay, we have a function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5682.427,
    "end": 5692.91,
    "text": "So coming back to, let's say that my state space come back to where we started with, and you have a function and a landscape over it, let's say like a mountain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5695.31,
    "end": 5701.952,
    "text": "And so the goal is to find like the minimum of the mountain, like go from where you start to the minimum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5702.612,
    "end": 5708.633,
    "text": "There's so many different ways of solving this problem, practically speaking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5709.701,
    "end": 5717.225,
    "text": " The main challenge, of course, is that you don't know, you cannot see anywhere else except where you have been.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5717.245,
    "end": 5723.728,
    "text": "So you start somewhere and you're completely blind and you need to find the minimum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5723.748,
    "end": 5724.649,
    "text": "So how do you do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5726.15,
    "end": 5730.312,
    "text": "There's so many ways, so many approaches to optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.352,
    "end": 5734.174,
    "text": "I mean, it's a whole field and it's, in my opinion, a very messy one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5735.632,
    "end": 5757.987,
    "text": " And this is understandable because there's the no-freelance theorems that are very well known that say that under some hypotheses, two ways of doing optimization will behave the same on average if you test them again, all possible sorts of problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5759.768,
    "end": 5761.109,
    "text": "So this is to say that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5764.144,
    "end": 5774.108,
    "text": " then the optimization methods that will work well are those that implicitly use the prior information that you have about the problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5775.288,
    "end": 5782.371,
    "text": "In other words, according to the theorems, there's no optimization methods that will beat everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5783.676,
    "end": 5805.002,
    "text": " Um, it just doesn't exist because they're all on average the same, but this is not to say that you cannot make any, you know, practical, meaningful steps by doing optimization because, um, not all optimization problems are, you know, the optimization problems that we have in life, they're not completely random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5805.974,
    "end": 5829.95,
    "text": " not completely random landscapes that we need to optimize but that they actually have some structure so we can actually exploit that in algorithms and have things that just behave they just work a lot better for the type of problems that we're interested in than others so this is what um kind of like the starting point for all optimization so the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5831.195,
    "end": 5846.943,
    "text": " the the type of optimization that we considered here is optimization of smooth functions this is already like a big restriction there's so so many methods that are designed to optimize functions that are rugged",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5848.209,
    "end": 5852.093,
    "text": " or non-smooth or have discontinuities and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5852.793,
    "end": 5860.04,
    "text": "Um, when, when you actually get rugged or discontinuous landscapes, it's a whole different problem here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5860.1,
    "end": 5863.803,
    "text": "We chose to focus on smooth functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5865.144,
    "end": 5871.87,
    "text": "And, uh, so the idea is that, well, so you have a smooth landscape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5871.91,
    "end": 5875.073,
    "text": "You want to find the minimum and.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5876.082,
    "end": 5884.626,
    "text": " One way to do so and to do so well is through the use of a tool called geometric integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5886.267,
    "end": 5890.689,
    "text": "So I'll walk through the main ideas of this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5891.93,
    "end": 5900.614,
    "text": "The idea, first of all, is that you may design a method that theoretically works very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5901.678,
    "end": 5920.727,
    "text": " But when you implement it in practice on your computer, your discretization errors, because you can only implement it in discrete time, what you actually end up implementing ends up differing significantly from what you initially wanted to implement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5921.937,
    "end": 5931.4,
    "text": " This is a problem that we discussed previously in sampling, and it just comes up everywhere in applied mathematics and numerical mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5932.28,
    "end": 5942.463,
    "text": "The fact that you can only do discrete computations on your computer is a big limitation and it's something that needs to be looked into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5942.523,
    "end": 5948.264,
    "text": "It's maybe even the most important thing that needs to be looked into when building a numerical method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5949.105,
    "end": 5950.765,
    "text": "You want the numerical, you want",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5951.365,
    "end": 5961.628,
    "text": " to be able to implement numerical methods that are very close from what you theoretically would like to implement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5963.089,
    "end": 5969.511,
    "text": "So typically, you would have some theoretical algorithm that would have some convergence guarantees or performance guarantees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5970.131,
    "end": 5975.433,
    "text": "And so you would like a way to implement it on your computer so as to preserve those guarantees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5977.193,
    "end": 5979.254,
    "text": "And this turns out to be very hard in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5980.475,
    "end": 5994.208,
    "text": " The one way to do it, I would say maybe the most powerful way out there to do this is through procedures from the field of geometric integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5995.419,
    "end": 6022.49,
    "text": " And so geometric integration is a set of techniques that allow you, under certain conditions, to discretize your theoretical dynamic or theoretical optimization procedure, your dynamical system, and make it into an algorithm that you can practically implement on a computer that's going to respect the performance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6023.416,
    "end": 6025.238,
    "text": " guarantees that you already have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6027.18,
    "end": 6032.525,
    "text": "So now the tricky part, geometric integration is based on geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6033.206,
    "end": 6042.295,
    "text": "So you need to find, it's not as simple as like, okay, well, I have my landscape, my function landscape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6043.055,
    "end": 6063.368,
    "text": " i'd like to just go down and find the minimum one way to do that is just by you know doing like gradient descent and continuous time and you know that that's gonna like go down until it reaches a local minimum at the very least so it's not too bad if you were to implement gradient descent numerically wouldn't be exactly the same",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6065.766,
    "end": 6067.547,
    "text": " as the continuous time dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6067.947,
    "end": 6077.894,
    "text": "It could be that actually by implementing gradient descent numerically, you get all sorts of numerical problems or whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6079.595,
    "end": 6084.458,
    "text": "Maybe gradient descent, it's so simple, it's not actually a good example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6084.718,
    "end": 6093.644,
    "text": "But the point I want to make is that it's not as simple as like, okay, well, I have this dynamic that works really well and that gets to the minimum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6094.719,
    "end": 6097.767,
    "text": " And I know that it's going to get to the minimum this fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6099.852,
    "end": 6104.223,
    "text": "And so geometric integration will give me will give me an algorithm that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6105.493,
    "end": 6109.314,
    "text": " I can implement on my computer and that's going to get to the minimum this fast as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6109.374,
    "end": 6110.755,
    "text": "It's not as simple as this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6111.955,
    "end": 6119.018,
    "text": "Geometric integration works by preserving geometric structures in the dynamic that you started with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6120.178,
    "end": 6133.583,
    "text": "So in order to be able to apply geometric integration to have algorithms that work for optimization, you need to design a dynamical system that converges to the minimum and that has some geometric",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6134.762,
    "end": 6151.145,
    "text": " some important geometric features that can be preserved in this way and so this is basically the goal of the whole section and it goes into into the following steps um so one thing that can be um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6152.572,
    "end": 6164.838,
    "text": " you know, discretized or implemented on a computer in a way that is close to the true dynamical system is what's called Hamiltonian flows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6165.698,
    "end": 6181.346,
    "text": "So if you specify a Hamiltonian, which is a kinetic energy and potential energy, then you get the Hamilton-Jacobi equations of motion that gives you the behavior of the system that has the prescribed Hamiltonian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6182.532,
    "end": 6195.321,
    "text": " So for those who've taken a course in physics, you probably know or may have seen that all of Newtonian mechanics can be reformulated as Hamiltonian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6196.021,
    "end": 6204.407,
    "text": "So all of that can be described as with Newton's laws of motion can be described through Hamiltonian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6204.527,
    "end": 6208.75,
    "text": "It's a very general framework or a very general way to look at physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6213.193,
    "end": 6225.963,
    "text": " Because it's such a general point of view on physics and just Hamiltonians, they come up everywhere, this mixture of kinetic and potential energy to concisely summarize the behavior of a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6227.384,
    "end": 6238.233,
    "text": "Because they occur so much, they have been studied extensively, and it turns out that Hamiltonians and specifically the motion they entail, so the Hamilton-Jacobi equation of the motion,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6239.412,
    "end": 6250.622,
    "text": " they can be discretized or implemented accurately on a computer using symplectic integration, which is a part of geometric integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6251.382,
    "end": 6259.469,
    "text": "So, in short, you can use symplectic integration to accurately simulate a Hamiltonian dynamical system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6260.69,
    "end": 6262.211,
    "text": "Now, the problem is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6266.096,
    "end": 6269.722,
    "text": " These dynamics are conservative, so they preserve the Hamiltonian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6270.444,
    "end": 6279.519,
    "text": "So if, if you're at some point in state space with like a certain kinetic energy, potential energy, and you run the dynamic forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6280.67,
    "end": 6282.731,
    "text": " your overall energy is not going to change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6282.791,
    "end": 6283.991,
    "text": "So that's standard physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.131,
    "end": 6287.332,
    "text": "Energy is always conserved when there's no friction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6287.932,
    "end": 6297.375,
    "text": "So all kind of like ideal physical systems with like no friction, the energy is conserved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6297.415,
    "end": 6306.257,
    "text": "So when you're going to run this symplectic optimization scheme to simulate these Hamilton-Jacobi equations of motion, the energy is going to be conserved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6306.829,
    "end": 6318.115,
    "text": " Now we're in trouble if we want to do optimization because in optimization, if you think of the function as the energy, you want to dissipate energy as much as possible to reach the minimum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6318.355,
    "end": 6319.476,
    "text": "So you want to lose energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6321.497,
    "end": 6327.6,
    "text": "So what the section does, so this section, by the way, is a review of more technical papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6328.581,
    "end": 6335.405,
    "text": "What these papers do, it's a very clever trick, is they say, okay, well, we want to minimize a function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6336.836,
    "end": 6339.757,
    "text": " Um, we're going to say the function is a potential energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6339.897,
    "end": 6345.838,
    "text": "And so we're going to add a kinetic energy on top of that to get a Hamiltonian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6345.858,
    "end": 6357.1,
    "text": "And so now this Hamiltonian, we could stimulate it through, um, Stimplactic integration, but actually if we did, we wouldn't dissipate the function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6357.12,
    "end": 6364.661,
    "text": "So now, um, what the, what the section does is it introduces like, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6366.598,
    "end": 6376.342,
    "text": " a higher dimensional state space with the Hamiltonian that if you simulate those dynamics, it actually optimizes the function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6377.243,
    "end": 6384.426,
    "text": "So this was a convoluted way to say it reformulates optimization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6385.82,
    "end": 6390.224,
    "text": " as a conservative system with a different Hamiltonian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6393.327,
    "end": 6405.619,
    "text": "Because we know how to simulate dynamics with Hamiltonian so well, a good way of doing optimization is by finding a Hamiltonian so that when you discretize it, you get the optimization process that you wanted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6406.58,
    "end": 6411.901,
    "text": " And so if you do that, you get a numerical method that's stable, that works well, that has good convergence guarantees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6412.541,
    "end": 6422.663,
    "text": "And it turns out the numerical methods that are developed, they work for optimization on any kind of smooth manifold, for smooth functions on any smooth manifold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6423.343,
    "end": 6424.164,
    "text": "They work well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6424.244,
    "end": 6429.665,
    "text": "They're generalized gradient descent, in the sense that you recover gradient descent in a certain limit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6430.565,
    "end": 6435.026,
    "text": "And they can be seen as accelerated because they have this notion of acceleration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6435.894,
    "end": 6458.915,
    "text": " in a sense that if you if you let's say the function that you want to optimize it like a hill and you want to go down if you just did great in the scent you're like blindingly going down at the same speed or or your speed is like proportional to the slope of the of the landscape but when you actually let a roll ball",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6459.82,
    "end": 6486.031,
    "text": " a bull rolling down this is not really what happens the bull is going to roll faster and faster and it's going to accelerate it's going to go down it's going to overshoot the minimum and then it's going to like oscillate until it converges to a minimum and so these are the kind of optimization methods that are developed here they're optimization methods that are accelerated in a physical sense that has a physical sense acceleration of physical meaning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6487.028,
    "end": 6490.912,
    "text": " because they're gonna accelerate as they go down, overshoot and then stabilize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6492.334,
    "end": 6495.397,
    "text": "So this is the whole point of this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6496.198,
    "end": 6502.726,
    "text": "Now briefly, because I think we're running out of time, but we can of course revisit these sections later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6504.84,
    "end": 6508.122,
    "text": " So in the third section, we have sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6508.162,
    "end": 6510.384,
    "text": "So we talked extensively about sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6511.205,
    "end": 6518.03,
    "text": "The sampling, as we discussed, can be seen as an optimization of probability distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6518.71,
    "end": 6523.674,
    "text": "So we have this distribution that we want to sample from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6524.329,
    "end": 6527.49,
    "text": " And we just run a process that is random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6528.01,
    "end": 6529.871,
    "text": "So it can be described by its own distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6530.351,
    "end": 6533.292,
    "text": "We want the process to converge as fast as possible to the target.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6534.012,
    "end": 6541.875,
    "text": "So we want the distribution of the process to converge as fast as possible to the target distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6543.476,
    "end": 6551.459,
    "text": "So in a way that it can be seen as, I guess, complicated for many people, I think it's pretty abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6553.205,
    "end": 6560.23,
    "text": " But it's been known for a long time that you can reformulate sampling as just optimization of distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6562.472,
    "end": 6580.547,
    "text": "Now it turns out that when you use the accelerated optimization method of the second section to sampling, so when you do accelerated optimization on the space of probability distributions,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6581.314,
    "end": 6589.156,
    "text": " in order to solve the sampling problem, you get a process that's called underdumped Langevin dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6589.956,
    "end": 6605.961,
    "text": "So if you solve that process, you're basically going to get good samples, very good samples of your target distribution, because that process can be seen as doing an accelerated optimization on the space of probability distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6606.621,
    "end": 6611.086,
    "text": " In other words, the distribution describing the process is going to accelerate towards the target.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6611.126,
    "end": 6615.25,
    "text": "So you're going to get there very fast, and your symbols are going to be very good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6618.197,
    "end": 6624.101,
    "text": " So this is 2.6, where this is kind of derived.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6625.942,
    "end": 6633.467,
    "text": "In 3.1, we basically talk about the good properties of samplers in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6634.387,
    "end": 6637.049,
    "text": "So sampling is not like a complete field, but there's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6637.711,
    "end": 6666.725,
    "text": " lot of work showing that certain processes have i mean certain characteristics of processes make them better samplers and others make them worse so this is what we discussed and then in 3.2 we put this all together in hamiltonian monte carlo which is a state-of-the-art method for sampling um where where um so hamiltonian monte carlo is a way of using",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6667.771,
    "end": 6678.461,
    "text": " If you use symplectic integration under damped Langevin dynamics, which is your accelerated sampling method that you cannot simulate directly, again, you get the same problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6679.142,
    "end": 6684.226,
    "text": "If you use symplectic integration to simulate that, then you get Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6685.087,
    "end": 6693.515,
    "text": "Hamiltonian Monte Carlo is a tractable way of doing accelerated sampling that's based on ideas of symplectic integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6696.243,
    "end": 6700.946,
    "text": " Now, very briefly, so the section four is on inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6701.927,
    "end": 6714.116,
    "text": "So inference, the inference in its most general form is variational inference, so what we typically do, know, and love from active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6714.316,
    "end": 6723.403,
    "text": "And it's, I have a target probability distribution that I'm not able to compute directly, so I'm gonna approximate it as best as I can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6724.753,
    "end": 6732.178,
    "text": " Now, these distributions, they're often used to compute expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6732.899,
    "end": 6744.067,
    "text": "Or in other words, in statistics and machine learning, we often need to compute expectations with respect to some probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6745.408,
    "end": 6750.532,
    "text": "What this section does is it derives a whole bunch of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6751.523,
    "end": 6754.724,
    "text": " divergences, like the KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6754.904,
    "end": 6758.165,
    "text": "I mean, the KL divergence is not discussed so much in this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6758.846,
    "end": 6759.706,
    "text": "I'll explain why.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6761.006,
    "end": 6773.331,
    "text": "But it derives a whole bunch of divergences that can be used to approximate this unknown distribution with some other distributions that are tractable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6776.212,
    "end": 6776.392,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6777.822,
    "end": 6804.299,
    "text": " to like put in a different way you have this abstract variational inference problem where you have this target distribution and then you have this family of distributions that you know and you want to select the distribution in your family that best approximates your target distribution now you in order to do this you first need to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6804.924,
    "end": 6811.426,
    "text": " derive a measure of similarity between distributions to know, okay, well, what is the best distribution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6811.466,
    "end": 6818.067,
    "text": "Like, how can you quantify being the best distribution, being the best approximation to your target distribution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6818.167,
    "end": 6824.229,
    "text": "And to do that, you need to specify a divergence, like the KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6824.429,
    "end": 6827.43,
    "text": "But the problem is the KL divergence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6828.34,
    "end": 6831.561,
    "text": " is not always practically applicable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6832.962,
    "end": 6836.883,
    "text": "One example is when the target distribution is just given by samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6837.744,
    "end": 6840.665,
    "text": "So maybe you don't even know the target distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6842.326,
    "end": 6844.426,
    "text": "Maybe it's a Gaussian, but you don't know it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6844.546,
    "end": 6846.387,
    "text": "You just have samples from the Gaussian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6846.407,
    "end": 6848.148,
    "text": "So you cannot just have a histogram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6848.988,
    "end": 6853.93,
    "text": "And you need to best approximate the histogram with the distribution in some family.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6854.65,
    "end": 6856.371,
    "text": "So when you have a problem like this, which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6857.749,
    "end": 6861.191,
    "text": " which just happens all the time, you cannot use the KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6861.211,
    "end": 6863.052,
    "text": "So you need to think about other divergences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6863.932,
    "end": 6872.717,
    "text": "And so what this section does is deriving other classes of divergences that are more generally applicable than the KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6873.818,
    "end": 6883.202,
    "text": "And they have also some very nice properties and then showing, okay, well, how is it that I can minimize these divergences to solve a variational inference problem?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6884.923,
    "end": 6885.704,
    "text": "So I think there's a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6887.304,
    "end": 6900.054,
    "text": " a lot of things to be done there in the sense that in active inference, we always use the KL divergence to do variational inference and minimize free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6900.935,
    "end": 6911.363,
    "text": "And this KL divergence is available because we typically have alternative models that are nice and they're expressed in graphical models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6913.638,
    "end": 6922.245,
    "text": " But there's this whole other plethora of divergences and algorithms to minimize the divergences that's out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6922.626,
    "end": 6934.035,
    "text": "And it could be the case that there's, you know, very interesting recipes and methods that can be either brought back to the KL case that we use or just used altogether in our setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6936.357,
    "end": 6936.958,
    "text": "In particular,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6938.012,
    "end": 6959.181,
    "text": " when uh for example let's say that we wanted to you know approximate the expected free energy in active inference um the expected free energy is an expectation and we want to approximate that expectation it could be the case uh well i think i think these methods uh that are like summarized in section four could be very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6960.639,
    "end": 6971.066,
    "text": " useful because they basically develop divergences that quantify how far the expectations are going to be if you choose a different distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6971.406,
    "end": 6975.128,
    "text": "So it's all very natural in that computational sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6976.109,
    "end": 6980.131,
    "text": "And then finally, adaptive agents through active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6980.191,
    "end": 6989.997,
    "text": "Well, I think we've discussed that already extensively, but I won't spoil it more today and we can come back to it next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6996.496,
    "end": 6998.099,
    "text": " Thanks a lot for that overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6998.119,
    "end": 6999.783,
    "text": "That was very powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7001.847,
    "end": 7002.429,
    "text": "Incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7003.09,
    "end": 7003.751,
    "text": "Dot one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7004.673,
    "end": 7005.676,
    "text": "Very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7007.304,
    "end": 7015.107,
    "text": " Looking forward to starting with some questions from the live chat and people's comments on the video between now and next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7015.587,
    "end": 7023.91,
    "text": "If anybody else of your colleagues or anyone in the Institute wants to join, we'll be here next week for 52.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7025.21,
    "end": 7027.091,
    "text": "So thank you, Lance, for the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.251,
    "end": 7028.131,
    "text": "Really appreciate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7029.311,
    "end": 7029.952,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7031.072,
    "end": 7031.432,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7033.353,
    "end": 7033.973,
    "text": "See you next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7034.273,
    "end": 7034.433,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]