[
  {
    "start": 13.083,
    "end": 13.904,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.484,
    "end": 17.186,
    "text": "This is ACT-INF Livestream number 52.0 and it is February 28th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.458,
    "end": 27.479,
    "text": " Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.179,
    "end": 35.662,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.722,
    "end": 38.643,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.383,
    "end": 45.005,
    "text": "This is a recorded and an archived livestream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.265,
    "end": 51.127,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.23,
    "end": 62.442,
    "text": " Head over to ActiveInference.org if you want to learn more and participate in learning groups and projects at the Institute, including these live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.784,
    "end": 65.005,
    "text": "Well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.385,
    "end": 88.994,
    "text": " We're here today to learn and discuss the paper Geometric Methods for Sampling Optimization Inference and Adaptive Agents by Alessandra Barp, Lancelot DeCosta, Guilherme Franca, Karl Fristen, Mark Ghiralami, Michael Jordan, and Gregorios Pavliotis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.895,
    "end": 92.856,
    "text": "This video, like all DOT Zero videos are,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.108,
    "end": 96.709,
    "text": " is a introduction for some of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.909,
    "end": 100.091,
    "text": "It is not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.271,
    "end": 104.573,
    "text": "And as we've joked before, it's more than anything, a call for help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.114,
    "end": 122.823,
    "text": "So if you're curious about these topics, if you're knowledgeable about these topics, we would really look forward to you getting involved in the upcoming 52.1 and 52.2 discussions, as well as in an ongoing basis to help us understand some of the technical details",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.763,
    "end": 135.388,
    "text": " This is going to get technical at times and certainly beyond the technicalities I understand, though I am looking forward to presenting them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.388,
    "end": 143.852,
    "text": "And it'll be great to have those who have backgrounds of all different types to come together and talk about this awesome work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.012,
    "end": 154.015,
    "text": " Also, a big thanks to Ali and Kandon for the assistance, technical and moral, during the preparations here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.396,
    "end": 163.338,
    "text": "In 52.0, we're going to bring up some aims and claims, read the abstract, look at the roadmap, and talk about the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.039,
    "end": 170.181,
    "text": "And then we will walk through the paper with an emphasis on the figures, formalisms, and key points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.121,
    "end": 191.867,
    "text": " in the coming weeks we're going to be discussing this paper with one or more authors so as usual get in touch if you want to participate or if it's after the fact you can still get involved we can start with an introduction or a warm-up I'm Daniel I'm a researcher in California and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.286,
    "end": 220.312,
    "text": " i'm tempted to say just totally honestly i'm happy to get this one over with but that sounds a little bit different than i might intend it to be i'm really excited to dive into this work which is going to be approaching active inference from an angle that we haven't necessarily highlighted on these streams so i think it's going to be a fascinating discussion it's going to run the gamut span the gap however you choose to see it between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.292,
    "end": 237.107,
    "text": " technical sophistication and intuition which is a great place to be so i've been really excited and motivated to prepare and i'm looking forward to the dot zero we're doing right now and to the upcoming discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.408,
    "end": 253.92,
    "text": " so let's jump in with the big questions that might motivate one to read this paper this kind of paper even if they were not familiar with the authors or topics and these are just a few ways to write it up of course not the only ways so first question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.881,
    "end": 277.338,
    "text": " how can we effectively and efficiently navigate information geometric or information theoretic landscapes and how can we tackle that question from an analytical which is to say equation based as well as a computational which is to say real implementation based perspective often it's really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.527,
    "end": 286.012,
    "text": " fun, intuitive, natural to talk about information theory, even for those who haven't taken the technical prerequisites.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.812,
    "end": 301.182,
    "text": "And this work may help us navigate to a space where we're able to think with good intuitions about information geometry, information theory, and also make sure that those intuitions are going to be caught by our technical tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.57,
    "end": 313.562,
    "text": " Second, how can we optimize inference in complex models, including cases where we are doing inference on action as a parameter, also known as active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.16,
    "end": 333.278,
    "text": " Optimization and functional analysis, as we'll come to see soon, has long been interested in these complex or challenging models that are right at the margin, right at the border of what is tractable or not, given the computational hardware that modelers have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.638,
    "end": 339.043,
    "text": "For example, big data sets, high dimensional state spaces, complex dynamics, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.319,
    "end": 354.432,
    "text": " How about cases where we're also interested in doing parametric inference and optimization on action or action plans as a parameter, also known as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.566,
    "end": 361.233,
    "text": " And third, what technical underpinnings support the rigor and applicability of active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.254,
    "end": 366.559,
    "text": "And what special cases are revealed when we consider possibilities and constraints?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.86,
    "end": 372.465,
    "text": "These are those two branches of analytical and computational coming back again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.106,
    "end": 383.831,
    "text": " We want to make sure that when we're thinking within the active inference paradigm, the active inference ontology is the language that we're speaking and that there's a technical rigor to what's being discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.491,
    "end": 393.956,
    "text": "Additionally, we want to make sure that it's not just an analytical rigor, but it's also going to be computationally plausible, tractable, or maybe even preferable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.316,
    "end": 395.356,
    "text": "That would be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.257,
    "end": 398.918,
    "text": "Those are the questions that at least appeared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.563,
    "end": 413.55,
    "text": " We are discussing this paper, Geometric Methods for Sampling, Optimization, Inference, and Adaptive Agents by Barp and DaCosta et al., shared first authorship, and it was published on Archive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.391,
    "end": 417.893,
    "text": "I'll just note a few key claims from this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.885,
    "end": 430.914,
    "text": " They wrote, our goal in this chapter is to discuss the emergence of natural geometries within a few important areas of statistics and applied mathematics, namely optimization, sampling, inference, and adaptive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.434,
    "end": 432.055,
    "text": "That's the title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.493,
    "end": 442.477,
    "text": " We provide a conceptual introduction to the underlying ideas rather than a technical discussion, highlighting connections with various fields of mathematics and physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.157,
    "end": 455.223,
    "text": "Well, I can tell you that they do make connections with various fields of mathematics and physics, though whether it is a conceptual introduction or a technical discussion is all going to be about your perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.452,
    "end": 471.001,
    "text": " Third, to illustrate a generic use case for the previous methodologies that are going to be discussed, we consider active inference, a unifying formulation of behavior, subsuming perception, planning, and learning as a process of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.781,
    "end": 476.864,
    "text": "So inference on adaptive agents is not necessarily new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.405,
    "end": 480.727,
    "text": "It goes by reinforcement learning, machine learning, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.287,
    "end": 485.23,
    "text": "However, to use those methodologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.09,
    "end": 514.788,
    "text": " in the context of active inference a unifying formulation of behavior is something that the authors are bringing forth here and last we describe decision making under active inference using information geometry revealing several special cases that are established notions in statistics cognitive science and engineering so active inference is not just unifying it's going to be shown to be generalized as well which is to say that special cases of the generalization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.474,
    "end": 523.718,
    "text": " emerge different formalisms that were known disparately across fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.979,
    "end": 526.02,
    "text": "On to the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.144,
    "end": 542.53,
    "text": "They write, in this chapter, we identify fundamental geometric structures that underlie the problems of sampling, optimization, inference, and adaptive decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.697,
    "end": 551.66,
    "text": " Based on this identification, we derive algorithms that exploit these geometric structures to solve these problems efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.78,
    "end": 565.684,
    "text": "We show that a wide range of geometric theories emerge naturally in these fields, ranging from measure-preserving processes, information divergences, Poisson geometry, and geometric integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.844,
    "end": 568.245,
    "text": "Specifically, we explain how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.637,
    "end": 578.44,
    "text": " 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.277,
    "end": 578.44,
    "text": "Leveraging the symplectic geometry of Hamiltonian systems enable us to construct accelerated sampling and optimization methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.46,
    "end": 578.44,
    "text": "2."
  },
  {
    "start": 579.12,
    "end": 586.523,
    "text": "The theory of Hilbertian subspaces and Stein operators provides a general methodology to obtain robust estimators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.723,
    "end": 586.523,
    "text": "3."
  },
  {
    "start": 588.443,
    "end": 595.506,
    "text": "Preserving the information geometry of decision making yields adaptive agents that perform active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.786,
    "end": 610.9,
    "text": " Throughout, we emphasize the rich connections between these fields, e.g., inference draws on sampling and optimization, and adaptive decision-making assesses decisions by inferring their counterfactual consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.404,
    "end": 622.711,
    "text": " Our exposition provides a conceptual overview of underlying ideas rather than a technical discussion, which can be found in the references herein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.111,
    "end": 626.554,
    "text": "And indeed, there are several hundred references in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.655,
    "end": 628.695,
    "text": "Let's go to the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.396,
    "end": 632.178,
    "text": "So, first, we can start on the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.138,
    "end": 634.399,
    "text": "Here's an active agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.779,
    "end": 635.28,
    "text": "Vroom, vroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.223,
    "end": 648.211,
    "text": " doing accelerated optimization in the carpool lane, looking ahead to the almost dessert-like visual representation of active inference, that's where we're going to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.372,
    "end": 652.113,
    "text": "And on the right side, it's just some cars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.554,
    "end": 653.634,
    "text": "One of them is accelerated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.854,
    "end": 654.415,
    "text": "The other one isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.677,
    "end": 677.723,
    "text": " The paper begins with an introduction, and then in section two gets into the topic of accelerated optimization, covering the areas of principle of geometric integration, conservative flows and symplectic integrators, rate matching integrators for smooth optimization, manifold and constrained optimization, gradient flow as a high friction limit, and optimization on the space of probability measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.743,
    "end": 685.747,
    "text": " In Section 3, they turn from accelerated optimization in general to Hamiltonian-based accelerated sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.627,
    "end": 692.49,
    "text": "The subsections of 3 are Optimizing Diffusion Processes for Sampling and Hamiltonian Monte Carlo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.919,
    "end": 702.688,
    "text": " From the Hamiltonian-based accelerated sampling, they turn towards doing statistical inference with kernel-based discrepancies in section four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.489,
    "end": 709.495,
    "text": "The subsections are topological methods for MMDs, smooth measures and KSDs,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.396,
    "end": 726.259,
    "text": " the canonical Stein operator and Poincaré duality, kernel Stein discrepancies and score matching, information geometry of MMDs and natural gradient descent, minimum Stein discrepancy estimators, likelihood inference with generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.165,
    "end": 735.01,
    "text": " Finally, in Section 5, Adaptive Agents Through Active Inference, they're going to bring it home to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.051,
    "end": 746.878,
    "text": "Section 5.1, Modeling Adaptive Decision Making, Behavior, Agents, and Environments, Decision Making in Precise Agents, the Information Geometry of Decision Making,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.939,
    "end": 775.541,
    "text": " and 5.2 realizing adaptive agents the basic active inference algorithm sequential decision making under uncertainty world model learning as inference and scaling active inference a quick note we have all the formalisms entered into our dot zero teams coda document there are 46 numbered equations in this paper and 83 overall",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.742,
    "end": 789.067,
    "text": " We're going to bring in some, but not all of these formalisms in the .zero video, and we're ready to bring in more during the .one and .two discussions with the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.227,
    "end": 796.49,
    "text": "Just for those who are watching along, I'm going to scan through all of the formalisms from our coda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.09,
    "end": 804.974,
    "text": "And again, for those who want to help get involved with a .zero preparation, this is a little bit of what .zero preparation looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.919,
    "end": 811.948,
    "text": " I'm going to now scroll through the formalisms just in case anybody wants to screenshot or see them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.431,
    "end": 841.731,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.552,
    "end": 844.953,
    "text": "On to the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.074,
    "end": 866.564,
    "text": "Keywords of the paper are information geometry, Hamiltonian Monte Carlo, Stein's method, reproducing kernel, variational inference, accelerated optimization, dissipative systems, decision theory, and active inference in no particular pedagogical order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.525,
    "end": 869.786,
    "text": "Let's start with decision theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.172,
    "end": 888.923,
    "text": " From the Stanford Encyclopedia of Philosophy, the article begins, decision theory is concerned with the reasoning underlying an agent's choices, whether this is a mundane choice between taking the bus or getting a taxi, or a more far reaching choice about whether to pursue a demanding political career.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.884,
    "end": 895.248,
    "text": " Decision theory is about agents making decisions, cognitive things making decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.129,
    "end": 904.876,
    "text": "And we can take a peek ahead to figure three, which is shown here, as well as invoke some of the keywords that we're about to walk into now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.637,
    "end": 911.902,
    "text": "So if this is your first time hearing some of this vocabulary or you're super familiar, either way, it's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.823,
    "end": 918.467,
    "text": "In this paper and in this discussion, we're going to see how different decision theoretic settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.972,
    "end": 942.101,
    "text": " such as no ambiguity, no ambiguity or no preference, no extrinsic value, and no intrinsic value, are going to be operationalized within an information theoretic formalism, an information geometric formalism, and specifically one that we're able to do accelerated inference on using variational methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.186,
    "end": 947.587,
    "text": " we're going to be involving action as a parameter, so we can call that active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.987,
    "end": 954.229,
    "text": "And that's how we're approaching decision theory and getting from here to there with all those fun stops in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.849,
    "end": 956.909,
    "text": "Let's go to information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.75,
    "end": 965.752,
    "text": "The paper in the introduction writes, of particular relevance to this chapter is information geometry, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.292,
    "end": 970.273,
    "text": "the differential geometric treatment of smooth statistical manifolds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.499,
    "end": 990.708,
    "text": " whose origin stems from a seminal article by Rao , who introduced the Fischer metric tensor on parameterized statistical models, and thus a natural Riemannian geometry that was later observed to correspond to an infinitesimal distance with respect to the Kolbach-Leibler divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.508,
    "end": 993.529,
    "text": "So, going into citation 23 and 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.45,
    "end": 1012.5,
    "text": " Citation 23 is Rao from 1992, and Rao wrote, The objective of the paper is to derive certain inequality relations connecting the elements of the information matrix as defined by Fisher and the variances and covariances of the estimating functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.701,
    "end": 1020.485,
    "text": "A class of distribution functions which admit estimation of parameters with the minimum possible variance has been discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.425,
    "end": 1030.367,
    "text": " The concept of distance between populations of a given type has been developed starting from a quadratic differential metric defining the element of length.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.927,
    "end": 1033.388,
    "text": "So I'm only going to give the disclaimer one time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.608,
    "end": 1037.128,
    "text": "Everything in red text is beyond speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.449,
    "end": 1043.13,
    "text": "It's just priming the pump for discussions with those who know more and with those who know less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.75,
    "end": 1046.851,
    "text": "And it's just a first pass that we're going to continue to develop on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.571,
    "end": 1048.231,
    "text": "But broadly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.071,
    "end": 1061.017,
    "text": " If we can compute inequality relationships, which this paper developed in 1992, we can bound estimators, test for relative improvements, and basically do stuff with those distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.978,
    "end": 1069.281,
    "text": "And if we can compute certain kinds of statistical distances, such that a distance requires a length metric,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.382,
    "end": 1086.755,
    "text": " we can find optimal estimators of parameters, specifically their variances and covariance structure, in principle and in practice, by finding the maximum informational alignment to other estimators or empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.235,
    "end": 1093.22,
    "text": "So we'll often say like, if you had the optimum parameterization, you'd be predicting as well as you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.8,
    "end": 1098.704,
    "text": "And so we want to be able to operationalize that using distances and metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.858,
    "end": 1123.739,
    "text": " and citation 24. this is an invariant form for the prior probability and estimation problems by harold jeffries and jeffries wrote it has shown that a certain differential form depending on the values of the parameters in a law of chance is invariant for all transformations of the parameters when the law is differentiable with regard to all parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.38,
    "end": 1134.186,
    "text": " For laws containing a location and a scale parameter, a form with a somewhat restricted type of invariance is found even when the law is not everywhere differentiable with regard to the parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.206,
    "end": 1142.431,
    "text": "This form has the properties required to give a general rule for stating the prior probability in a large class of estimation problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.231,
    "end": 1147.514,
    "text": "So, if all the parameters in our model, whether there's one, two, or more,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.379,
    "end": 1152.462,
    "text": " are differentiable, which is to say they're smooth, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.702,
    "end": 1153.723,
    "text": "There are technical details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.463,
    "end": 1157.565,
    "text": "Then there are certain transformational invariances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.106,
    "end": 1165.191,
    "text": "So just like every Gaussian distribution, by shifting it and stretching and shrinking it, you can map those onto each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.211,
    "end": 1166.492,
    "text": "It's like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.126,
    "end": 1171.647,
    "text": " It turns out that some of those constraints can even be somewhat relaxed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.287,
    "end": 1178.03,
    "text": "For example, this approach may still be effective even where parameters are not differentiable everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.97,
    "end": 1192.795,
    "text": "And this is big for helping us do Bayesian estimation, which can be seen as a special case of informational transformations or of manipulations of statistical distributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.835,
    "end": 1197.498,
    "text": " in the information theoretic or information geometric sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.62,
    "end": 1200.881,
    "text": "Functional analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.421,
    "end": 1208.267,
    "text": "So let's begin as tradition in our year 2023 with a brief quote from ChatGPT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.007,
    "end": 1212.99,
    "text": "How is functional analysis helpful for us who are learning and applying active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.411,
    "end": 1214.932,
    "text": "I'll just read the last section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.653,
    "end": 1222.158,
    "text": "Overall, functional analysis provides a powerful mathematical toolset for understanding and analyzing the principles of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.096,
    "end": 1224.837,
    "text": " and one can read more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.138,
    "end": 1230.121,
    "text": "Functional analysis is the study of functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.041,
    "end": 1246.853,
    "text": "And here we see one way of showing what a function does in terms of being this box f of x that takes in an input, an argument x, and outputs a result y. And also that can be understood as a mapping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.774,
    "end": 1249.876,
    "text": " between or amongst spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.797,
    "end": 1252.199,
    "text": "And there's a lot more to go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.579,
    "end": 1259.106,
    "text": "Just wanted to bring up that in math, sometimes people have analyzed functions and their properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.887,
    "end": 1268.656,
    "text": "And we're interested in the properties of a special class of functions, which are probability distributions, well-behaved probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.95,
    "end": 1273.692,
    "text": " What do we do with those probability distributions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.792,
    "end": 1276.535,
    "text": "Well, one thing we might want to do is sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.135,
    "end": 1284.581,
    "text": "So the paper writes, sampling methods are critical to the efficient implementations of many methodologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.782,
    "end": 1294.69,
    "text": "Most modern samplers are based on Markov chain Monte Carlo methods, which includes slice samplers, piecewise deterministic Markov chains, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.345,
    "end": 1308.033,
    "text": " The original Hamiltonian Monte Carlo, or HMC, which we're gonna get to, algorithm was introduced in physics to sample distributions on gauge groups for lattice quantum chromodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.154,
    "end": 1318.26,
    "text": "It combined two approaches that emerged in previous decades, namely the Metropolis-Hastings algorithm and the Hamiltonian formulation of molecular dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.421,
    "end": 1323.724,
    "text": "So the way that they state it in the beginning of section three of the paper is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.287,
    "end": 1337.028,
    "text": " The purpose of sampling methods is to efficiently draw samples from a given target distribution, rho, or more commonly to calculate expectations with respect to rho by equation 33 and other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.431,
    "end": 1360.761,
    "text": " They write, modern Hamiltonian Monte Carlo, which again we're going to get to in a second, relies heavily on symplectic integrators, another keyword, to simulate a deterministic dynamic responsible for generating distant moves between samples and thus reduce their correlation, while at the same time preserving important geometric properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.741,
    "end": 1366.202,
    "text": " Now, we want to make our samples as informative as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.642,
    "end": 1372.663,
    "text": "If we're just drawing samples and it's the same sample again and again, one can imagine that it is uninformative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.244,
    "end": 1378.244,
    "text": "Conversely, one can imagine a situation where samples are informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.405,
    "end": 1389.627,
    "text": "And that is brought into practice by making sure that the samples are minimally correlated with each other, as noted above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.509,
    "end": 1393.25,
    "text": " And this also has analogy in cryptography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.03,
    "end": 1402.273,
    "text": "So if we're sampling something where the successive samples are 99% correlated, you can imagine that you're oversampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.733,
    "end": 1408.795,
    "text": "So you're taking 10,000 frames per second of a YouTube video with 30 frames per second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.915,
    "end": 1411.576,
    "text": "I think I'm streaming at 25 frames per second right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.95,
    "end": 1422.952,
    "text": " Conversely, if one were to sample every 10 minutes, then their correlation structure would also not capture the video's 25 frames per second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.953,
    "end": 1436.836,
    "text": "So in order to generate good and large moves in the space, we would need perfect knowledge of what the space is or how it's generated, which is sometimes knowable in cryptography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.254,
    "end": 1442.356,
    "text": " However, empirically, we need to use heuristics and statistical approximations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.877,
    "end": 1448.339,
    "text": "So this is the applied statistics angle on the analytical relationships that we're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.78,
    "end": 1460.026,
    "text": "And it's going to come up again and again, this tension between analytical formulations, what's true in principle, and the statistical or numerical or computational applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.266,
    "end": 1465.949,
    "text": "To Hamiltonian Monte Carlo from Wikipedia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.793,
    "end": 1484.515,
    "text": " The Hamiltonian Monte Carlo algorithm, originally known as hybrid Monte Carlo, still HMC, is a Markov chain Monte Carlo method for obtaining a sequence of random samples which converge to being distributed according to a target probability distribution for which direct sampling is difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.336,
    "end": 1488.158,
    "text": " So just a few first pass reflections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.899,
    "end": 1503.29,
    "text": "We're sampling, which is to say Monte Carlo, and Monte Carlo is hearkening back to a different time when gambling was done in Monte Carlo and the state space of all the hands of poker were too vast to compute analytically or equations were not known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.791,
    "end": 1506.053,
    "text": "And so what one used to do and still does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.713,
    "end": 1518.443,
    "text": " is draw samples and say, well, I don't know if this is the final estimate on how likely a royal flush is, but from the two billion hands that I sampled, there were two royal flushes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.543,
    "end": 1521.285,
    "text": "And so it's one in a billion based upon my sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.659,
    "end": 1532.47,
    "text": " So we're sampling because this is a complex distribution for which an analytical solution is not possible, not known, not relevant, or not tractable computationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.03,
    "end": 1537.455,
    "text": "So there's various situations where we want to sample and we don't necessarily have an analytical solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.636,
    "end": 1550.143,
    "text": " When we're sampling from a converged stationarity of a statistical landscape, from a numerical perspective, we understand that landscape well enough to do inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.683,
    "end": 1560.049,
    "text": "So imagine that we're sampling height estimates from GPS locations in the X and the Y coordinates, and we're getting a Z value in our sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.17,
    "end": 1565.913,
    "text": "At some point, we can say we're unsurprised by new samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.929,
    "end": 1571.173,
    "text": " At that point, we understand the landscape well enough to do statistical inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.353,
    "end": 1582.943,
    "text": "And just like the frames per second in the previous example, one can imagine if the landscape is changing on the spatial scale of one mile and you're sampling every millimeter, you might be oversampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.524,
    "end": 1588.688,
    "text": "If you were sampling every league, maybe you'd be too coarse grained with your samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.795,
    "end": 1595.516,
    "text": " And so one reason that comes up in science all the time for using sampling is that the search space might be just too large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.316,
    "end": 1601.337,
    "text": "For example, the combinatorics of a phylogenetic tree with a thousand species might be vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.977,
    "end": 1615.32,
    "text": "And so it might be better to say something like, well, 99% of the million samples we drew were consistent with X because an analytical solution or a brute force search, neither might be possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.676,
    "end": 1623.78,
    "text": " And the Wikipedia wrote, this sequence of samples can be used to estimate integrals with respect to the target distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.58,
    "end": 1633.325,
    "text": "So sometimes we're sampling not from the target distribution itself, but rather from a distribution that is related or transformed from the target distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.165,
    "end": 1640.368,
    "text": "This is because sampling directly from the target distribution might be difficult or less than perfectly informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.109,
    "end": 1642.69,
    "text": "So we might, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.561,
    "end": 1652.752,
    "text": " Hint, hint, sample from the derivative of the target, which might help us identify points where, for example, the derivative is flat in all directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.374,
    "end": 1660.722,
    "text": "In the case that we're sampling from a derived landscape of the target distribution, this is called a symplectic integrator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.789,
    "end": 1664.492,
    "text": " So let's look at what a symplectic integrator is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.593,
    "end": 1669.756,
    "text": "So first, backing up to what is differential geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.577,
    "end": 1677.504,
    "text": "Differential geometry is a mathematical discipline that studies the geometry of smooth shapes and smooth spaces, otherwise known as smooth manifolds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.451,
    "end": 1691.692,
    "text": " Symplectic geometry is a branch of differential geometry and differential topology that studies symplectic manifolds, that is, differentiable manifolds equipped with a closed non-degenerate two-form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.092,
    "end": 1704.481,
    "text": " Symplectic geometry has its origins in the Hamiltonian formulation of classical mechanics, where the phase space of certain classical systems takes on the structure of a symplectic manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.001,
    "end": 1709.544,
    "text": "So, the keyword density is high, these topics are all very closely linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.731,
    "end": 1722.87,
    "text": " From the paper, it has been known for a long time that the class of symplectic integrators is the preferred choice for simulating physical systems, only the finest for our simulations of physical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.58,
    "end": 1731.525,
    "text": " These discretization techniques are designed to preserve the underlying symplectic geometry of Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.286,
    "end": 1737.149,
    "text": "And they also form the basis of Hamiltonian Monte Carlo or hybrid Monte Carlo methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.17,
    "end": 1742.373,
    "text": "We're gonna come back to this tension again and again, which is what good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.414,
    "end": 1768.874,
    "text": " is a in principle smooth and differentiable analytical formulation if our discretization scheme the way that we actually implement the steps on a computer are inferior we might ruin all those nice properties that we work to get about the analytical form we might just throw those out when we discretize it coarsely or inappropriately",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.017,
    "end": 1771.458,
    "text": " So what is a symplectic integrator?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.099,
    "end": 1774.782,
    "text": "It's a numerical integration scheme for Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.843,
    "end": 1781.989,
    "text": "Symplectic integrators form the subclass of geometric integrators, which by definition are canonical transformations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.81,
    "end": 1784.311,
    "text": "They're transformations we know a lot about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.494,
    "end": 1789.356,
    "text": "Symplectic integrator schemes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.447,
    "end": 1802.978,
    "text": " are referring to, again, just broadly, both the analytical formulations and the software packages and approaches that we can use to implement those formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.819,
    "end": 1814.968,
    "text": "And these integration schemes are useful across difficult estimation problems, which is why they're used to study nonlinear dynamics, molecular dynamics, like protein simulation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.649,
    "end": 1821.432,
    "text": " discrete element methods, accelerator physics, plasma physics, quantum physics, celestial mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.412,
    "end": 1832.156,
    "text": "The time evolution of Hamilton's equation is a symplectomorphism, meaning that it conserves the symplectic two-form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.217,
    "end": 1838.139,
    "text": "A numerical scheme is a symplectic integrator if it also conserves this two-form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.819,
    "end": 1843.962,
    "text": " Let's hear more if this is not correct or not complete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.482,
    "end": 1848.506,
    "text": "But the one form is like the differentiation and integration of a line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.226,
    "end": 1853.41,
    "text": "The two form is like the differentiation and integration of a surface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.55,
    "end": 1857.714,
    "text": "And the three form is like integration or differentiation of a volume.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.655,
    "end": 1864.02,
    "text": "And John Denker has a great blog post on the basic properties of a symplectic integrator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.188,
    "end": 1872.451,
    "text": " Some really interesting quotes that are good to just keep in mind when we're hearing about all these avenues we're going to be exploring in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.392,
    "end": 1878.754,
    "text": "A symplectic integrator conserves the area in phase space delimited by an ensemble of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.835,
    "end": 1886.318,
    "text": "For a periodic system, there is an area that is conserved, namely the area inside the phase space orbit of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.452,
    "end": 1893.637,
    "text": " The main reason for mentioning the orbit is to make the point that there are lots of different things with dimensions of area in face space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.177,
    "end": 1895.818,
    "text": "Some are conserved and some not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.779,
    "end": 1898.54,
    "text": "Some are interesting and some not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.221,
    "end": 1903.183,
    "text": "You have to specify which sort of area you are talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.744,
    "end": 1911.329,
    "text": "So another theme that's going to arise is we're interested in very well-behaved outcomes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.199,
    "end": 1918.825,
    "text": " from a very specific or constrained, still broad, but definitely constrained set of distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.125,
    "end": 1926.532,
    "text": "For example, distributions that can be interpreted in an information theory sense as probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.374,
    "end": 1932.277,
    "text": "What was that mention of the Hamiltonian and the shadow Hamiltonian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.138,
    "end": 1934.419,
    "text": "So the author's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.496,
    "end": 1947.723,
    "text": " For symplectic brackets, which is the kind of operation that reflects the symplectic integrator, the existence of a shadow Hamiltonian can be guaranteed beyond the case of splitting methods, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.763,
    "end": 1955.348,
    "text": "for variational integrators, which use variational inference, which use a discrete version of Hamilton's principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.788,
    "end": 1962.833,
    "text": "And we've heard it before, that free energy principle is a principle of least action for inference and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.215,
    "end": 1973.561,
    "text": " and more generally for most symplectic integrators in which the symplectic bracket is preserved up to topological considerations described by some technicalities that we can learn about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.841,
    "end": 1986.268,
    "text": "As we shall see, such geometric integrators can be constructed by leveraging the shadow Hamiltonian property of symplectic methods on higher dimensional conservative Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.53,
    "end": 1991.732,
    "text": "In short, as a consequence of having shadow Hamiltonian,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.893,
    "end": 2016.512,
    "text": " such geometric integrators are able to reproduce all the relevant properties of the continuum system these arguments are completely general so even before one knows what the shadow hamiltonian necessarily is the authors are letting us know that if we can discretize the shadow hamiltonian appropriately",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.489,
    "end": 2031.756,
    "text": " Through symplectic integration, we can provide a discretization scheme that ends up staying consistent and compatible and all down the middle with the analytical properties that we worked so hard to get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.497,
    "end": 2038.92,
    "text": "And there were some different papers that were cited and some that were found during research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.08,
    "end": 2044.763,
    "text": "This paper, Timestep and Shadow Hamiltonian in Molecular Dynamics Simulations by Kim",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.403,
    "end": 2051.704,
    "text": " demonstrates symplectic integrators on the simplest possible system, a simple harmonic oscillator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.124,
    "end": 2058.005,
    "text": "So if one wants to go to a technical example, but one that builds intuition, that's a great place to start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.945,
    "end": 2066.546,
    "text": "And from the Wikipedia article on energy drift, these integrators do not in fact reproduce the actual Hamiltonian mechanics of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.927,
    "end": 2074.668,
    "text": "Instead, they reproduce a closely related shadow Hamiltonian whose value they conserved many orders of magnitude more closely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.828,
    "end": 2081.472,
    "text": " The accuracy of the energy conservation for the true Hamiltonian is dependent on the time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.032,
    "end": 2096.102,
    "text": "So if we can, for example, just metaphorically speaking, capture a high resolution image of the shadow, then we'll be able to know something, do something with the actual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.923,
    "end": 2100.265,
    "text": "Some technical details on Stein's method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.072,
    "end": 2110.721,
    "text": " which is a general method in probability theory to obtain bounds on the distance between two probability distributions with respect to a probability metric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.401,
    "end": 2120.009,
    "text": "And Stein's method is used in the context of Stein operators and Stein class, which we're going to get to in the subsequent discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.245,
    "end": 2123.166,
    "text": " Reproducing kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.607,
    "end": 2129.193,
    "text": "Our discussion of inference builds upon the theory of Hilbertian subspaces and in particular, reproducing kernels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.614,
    "end": 2138.224,
    "text": "These inference schemes rely on the continuity of linear functionals such as probability and Schwartz distributions over a class of functions to geometrize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.065,
    "end": 2144.91,
    "text": " the analysis of integral probability metrics, which measure the worst case integration error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.271,
    "end": 2155.078,
    "text": "We shall explain how maximum mean, kernelized, and score matching discrepancies arise naturally from topological considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.738,
    "end": 2162.403,
    "text": "So we've added some background links here to the slide, but it'll be a great place to start with authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.704,
    "end": 2165.586,
    "text": "What is a reproducing kernel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.787,
    "end": 2168.208,
    "text": "And how is it used in this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.776,
    "end": 2171.237,
    "text": " Onwards through the keywords we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.817,
    "end": 2174.578,
    "text": "Accelerated optimization and variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.198,
    "end": 2182.52,
    "text": "So here's a 2016 paper from Michael Jordan and other authors and some quotes from the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.96,
    "end": 2189.963,
    "text": "Accelerated methods achieve faster convergent rates than gradient methods and indeed under certain conditions they achieve optimal rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.933,
    "end": 2195.697,
    "text": " However, accelerated methods are not descent methods and remain a conceptual mystery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.758,
    "end": 2201.342,
    "text": "We propose a variational continuous time framework for understanding accelerated methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.262,
    "end": 2209.448,
    "text": "We provide a systematic methodology for converting accelerated higher order methods from continuous time to discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.549,
    "end": 2216.614,
    "text": "Our work illuminates a class of dynamics that may be useful for designing better algorithms for optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.635,
    "end": 2221.021,
    "text": " And this is going to be, again, something awesome to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.364,
    "end": 2229.697,
    "text": "We've talked about on many streams variational inference in the context of gradient-based analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.541,
    "end": 2247.37,
    "text": " optimization for example the ball is rolling to the bottom of the bowl bottom of the hill and what you can do is you can take the gradient div grab curl and all that of where the ball is and just go downhill and if you designed the hill to be the right shape",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.17,
    "end": 2258.3,
    "text": " or you're using a chosen family of variational estimators that are the right shape, are a good shape, well-behaved shape, then you follow the gradient on down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.68,
    "end": 2260.602,
    "text": "And that's how we've talked about variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.303,
    "end": 2266.608,
    "text": "Accelerated optimization is going to be accelerated from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.908,
    "end": 2270.292,
    "text": "And so it's fun to think about, and it'll be great to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.165,
    "end": 2272.965,
    "text": " Dissipative systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.306,
    "end": 2279.069,
    "text": "The vast majority of statistics and machine learning applications involve solving optimization problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.249,
    "end": 2280.829,
    "text": "The author is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.53,
    "end": 2287.213,
    "text": "Accelerated gradient based methods and several variations thereof have become workhorses in these fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.273,
    "end": 2292.695,
    "text": "Recently, there has been great interest in studying such methods from a continuous time limiting perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.036,
    "end": 2299.439,
    "text": "Such methods can be seen as first order integrators to a classical Hamiltonian system with dissipation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.279,
    "end": 2301.42,
    "text": "This raises the question,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.467,
    "end": 2312.357,
    "text": " on how to discretize the system such that important properties are preserved, assuming the system has fast conversions to critical point and desirable stability properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.819,
    "end": 2319.245,
    "text": "Originally, such a theory of geometric integration was developed with conservative systems in mind while optimization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.959,
    "end": 2324.34,
    "text": " In optimization, the associated system is naturally a dissipative one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.341,
    "end": 2337.886,
    "text": "More recently, it has been proved that a generalization of symplectic integrators to dissipative Hamiltonian systems is indeed able to preserve rates of convergence and stability, which are the main properties of interest for optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.846,
    "end": 2342.048,
    "text": "So, from the Wikipedia on Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.124,
    "end": 2366.589,
    "text": " example of a time independent hamiltonian system is the harmonic oscillator so it's just a frictionless spring oscillating around the hamiltonian of the system does not depend on time and thus the energy of the system is conserved and so we can say that that is a conservative hamiltonian if the hamiltonian decays in time it is dissipative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.194,
    "end": 2386.388,
    "text": " recently the advances of these authors and others have extended our ability to make discretizations of dissipative hamiltonians that respect the rates of convergence and stability which are the main properties of interest for optimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.299,
    "end": 2403.542,
    "text": " and we've talked about hamiltonians on live stream number 49 with dalton on bayesian mechanics so pretty cool what is conservative what is dissipative we'll explore as the final keyword here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.396,
    "end": 2432.789,
    "text": " i just wanted to start with a blank slide on active inference and see what happens in 52.1 so consider the slide to be blank and for the authors and discussants looking forward to hearing how are we approaching active inference given everything that we've just loaded onto the table and everywhere that we're about to go with the paper let's get into it section one introduction so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.831,
    "end": 2438.243,
    "text": " the authors begin with differential geometry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.338,
    "end": 2464.851,
    "text": " a fundamental role in applied mathematics statistics and computer science including various domains citations 1 through 22 which can be shown here various citations from this well-cited paper the geometric study of statistical models has had many successes ranging from statistical inference where it was used to prove the optimality of maximum likelihood estimator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.192,
    "end": 2472.015,
    "text": " to the construction of the category of mathematical statistics generated by Markov morphisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.676,
    "end": 2475.798,
    "text": "So what are Markov morphisms from NCAT lab?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.998,
    "end": 2485.883,
    "text": "The formalism of Markov categories can be thought of as a way to express certain aspects of probability and statistics synthetically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.124,
    "end": 2493.248,
    "text": "In other words, it consists of structure and axioms, which one can think of as fundamental in probability and statistics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.525,
    "end": 2499.409,
    "text": " which one can use to prove theorems without having to use measure theory directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.89,
    "end": 2510.998,
    "text": "Intuitively, for the purposes of probability, a Markov category can be seen as a category where morphisms behave like random functions or Markov kernels, hence the name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.319,
    "end": 2515.321,
    "text": "So just some red text speculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.182,
    "end": 2523.268,
    "text": "It was a big success and a breakthrough to think about the category from a formal category theoretic perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.383,
    "end": 2530.024,
    "text": " to think about the category of statistical distributions from an information geometric perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.464,
    "end": 2545.247,
    "text": "This means that we can understand many analytical properties and transformations of statistical distributions, hashtag Bayesian, and develop general methods that work for that whole category, like accelerated optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.788,
    "end": 2548.088,
    "text": "And the applications are vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.539,
    "end": 2556.847,
    "text": " Originally, such a theory of geometric integration was developed with conservative systems in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.728,
    "end": 2562.235,
    "text": "While in optimization, the associated system is naturally a dissipative one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.176,
    "end": 2566.742,
    "text": "Nevertheless, symplectic integrators were exploited in this context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.123,
    "end": 2581.787,
    "text": " More recently, it has been proved that a generalization of symplectic integrators to dissipative Hamiltonian systems is indeed able to preserve rates of convergence and stability, which are the main properties of interest for optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.087,
    "end": 2584.508,
    "text": "So, citation nine, what is it about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.528,
    "end": 2592.89,
    "text": "2021 paper on dissipative symplectic integration with applications to gradient-based optimization by some of the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.039,
    "end": 2600.043,
    "text": " And it's interesting to pull out some quotes from the abstract and just hear a little bit about what they're up to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.464,
    "end": 2611.571,
    "text": "Recently, continuous time dynamical systems have proved useful in providing conceptual and quantitative insights into gradient-based optimization, widely used in modern machine learning and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.392,
    "end": 2619.517,
    "text": "An important question that arises in this line of work is how to discretize the system in such a way that its stability and rates of convergence are preserved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.177,
    "end": 2621.419,
    "text": " So this is the sampling problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.159,
    "end": 2624.823,
    "text": "In continuous time, the math is continuous and nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.824,
    "end": 2635.335,
    "text": "However, the sampling problem, which actually comes into play when we use modern computational methods that are implemented on discrete time, space, and constraints,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.498,
    "end": 2639.719,
    "text": " What happens when we use unconventional computing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.54,
    "end": 2646.443,
    "text": "That's an interesting discussion question, but in practice today, the discretization approach is going to matter a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.863,
    "end": 2657.769,
    "text": "In this paper, we propose a geometric framework in which such discretizations can be realized systematically, enabling the derivation of rate matching algorithms without the need for a discrete convergence analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.749,
    "end": 2669.116,
    "text": " More specifically, we show that a generalization of symplectic integrators to non-conservative and in particular dissipative Hamiltonian systems is able to preserve rates of convergence up to a controlled error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.916,
    "end": 2680.143,
    "text": "So this is the advance of this paper, that within a controlled error, good enough, they can model conservative and non-conservative, even dissipative Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.738,
    "end": 2690.767,
    "text": " Moreover, such methods preserve a shadow Hamiltonian despite the absence of a conservation law, extending key results of symplectic integrators to non-conservative cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.448,
    "end": 2697.293,
    "text": "Our arguments rely on a combination of backwards error analysis with fundamental results from symplectic geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.194,
    "end": 2715.364,
    "text": " We stress that although the original motivation for this work was the application of optimization, where dissipative systems play a natural role, they are fully general and not only provide a differential geometric analysis for dissipative Hamiltonian systems, but also substantially extend the theory of structure-preserving integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.145,
    "end": 2720.788,
    "text": "So, they made this generalization in the case of optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.208,
    "end": 2726.231,
    "text": "However, it's exciting that it extends even deeper into the math and the symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.745,
    "end": 2729.546,
    "text": " Those are a few highlights from section one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.666,
    "end": 2733.848,
    "text": "On to section two, accelerated optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.408,
    "end": 2735.488,
    "text": "Vroom, vroom, here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.109,
    "end": 2741.511,
    "text": "So there are going to be a lot of slides from sections two through five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.331,
    "end": 2753.876,
    "text": "And to keep the video a reasonable length, I'm going to just highlight a few pieces, not even necessarily what I intended to highlight, but I'm just going to go for it so we can get through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.276,
    "end": 2771.367,
    "text": " Section two, we shall be concerned with a problem of optimization of a function, finding a point that maximizes V of Q or minimizes negative V of Q over a smooth manifold M, R in the real numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.888,
    "end": 2776.79,
    "text": "Many algorithms and optimization are given as a sequence of finite differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.531,
    "end": 2780.353,
    "text": "Even when these algorithms are seen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.628,
    "end": 2804.961,
    "text": " discretizations of a continuum system whose behavior is presumably understood it is well known that most discretizations break important properties of a system and they continue to write the analysis of such finite difference iterations is usually challenging relying on painstaking algebra to obtain theoretical guarantees such as conversions to a critical point stability and rates of convergence to a critical point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.179,
    "end": 2817.782,
    "text": " Even when these algorithms are seen as discretizations of a continuum system whose behavior is presumably understood, it is well known that most discretizations break important properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.602,
    "end": 2819.763,
    "text": "It can't be highlighted enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.763,
    "end": 2828.845,
    "text": "When we implement optimization algorithms on modern computers, we have to make discretizations in space and time and in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.565,
    "end": 2835.087,
    "text": "So even if the analytical properties of the distribution are totally fire,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.124,
    "end": 2848.987,
    "text": " When we try to solve and fit models to empirical data, unless we also match that elegance and power with a discretization approach, we end up failing to realize analytical promises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.007,
    "end": 2859.949,
    "text": "2.1 The Principle of Geometric Integration Fortunately, the authors write, here comes into play one of the most fundamental ideas of geometric integrations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.925,
    "end": 2867.736,
    "text": " Many numerical integrators are very close, exponentially in the step size, to a smooth dynamics generated by a shadow vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.699,
    "end": 2871.902,
    "text": "A little whisper of a shadow Hamiltonian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.659,
    "end": 2875.98,
    "text": " and the shadow vector field is a perturbation of the original vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.101,
    "end": 2888.645,
    "text": "This allows us to analyze the discrete trajectory implemented by the algorithm using powerful tools from dynamical systems and differential geometry, which are a priori reserved to smooth systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.165,
    "end": 2894.668,
    "text": "So we're going to be able to discretize our cake and have it be smooth too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.948,
    "end": 2905.332,
    "text": " Crucially, while numerical integrators typically diverge significantly from the dynamics they aim to simulate, geometric integrators respect the main properties of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.192,
    "end": 2911.494,
    "text": "In the context of optimization, this means respecting stability and rates of convergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.174,
    "end": 2915.916,
    "text": "Seems like a good idea to respect the main properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.182,
    "end": 2920.383,
    "text": " This was first demonstrated in 9 and further extended in 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.023,
    "end": 2923.004,
    "text": "Our discussion will be based on these work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.444,
    "end": 2928.666,
    "text": "So, citation 9, Franca, Jordan, and Vidal, mentioned previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.526,
    "end": 2939.11,
    "text": "And citation 10, Franca, Barp, Girolami, and Jordan, Optimization on Manifolds, A Symplectic Approach, author's previous work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.77,
    "end": 2941.471,
    "text": "So, big development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.779,
    "end": 2956.305,
    "text": " We can use geometric rather than coarse numerical integrators, so our sampling-based optimization schemes, including their discretization, respect the main properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.885,
    "end": 2957.525,
    "text": "Sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.546,
    "end": 2961.867,
    "text": "Section 2.2, conservative flows and symplectic integrators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.148,
    "end": 2967.51,
    "text": "As a stepping stone, we first discussed the construction of suitable conservative flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.475,
    "end": 2975.641,
    "text": " These are very well studied and they're very intuitive, more intuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.103,
    "end": 2985.954,
    "text": "To construct vector fields along the derivative of x, which is the function of flows along which some function is constant,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.731,
    "end": 2988.652,
    "text": " we shall need brackets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.412,
    "end": 2996.196,
    "text": "Geometrically, these are morphisms, x star to x, also known as contravariant tensors of rank two in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.816,
    "end": 3001.979,
    "text": "So calling back the two form and the brackets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.359,
    "end": 3009.743,
    "text": "Importantly, vector fields that preserve F correspond to bracket vector fields in which B is anti-symmetric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.158,
    "end": 3013.919,
    "text": " Constructing conservative flows is thus straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.76,
    "end": 3020.463,
    "text": "Unfortunately, it is a rather more challenging task to construct efficient discretizations that retain this property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.343,
    "end": 3034.971,
    "text": "Most well-known procedures, namely discrete gradient and projection methods, only give rise to integrators that require solving implicit equations at every step, and they may break other important properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.131,
    "end": 3036.592,
    "text": "Citation 96.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.683,
    "end": 3039.523,
    "text": " This is the issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.083,
    "end": 3056.028,
    "text": "Again, no matter how nicely behaved, in principle, our analytical underlying smooth differentiable function is, if we discretize it and we chop it up in a way that's inappropriate, we don't respect the properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.528,
    "end": 3060.41,
    "text": "We don't end up with being able to realize those analytical promises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.512,
    "end": 3078.304,
    "text": " Indeed, in practice, the Hamiltonian usually decomposes into a potential energy associated to position and independent of momentum, and a kinetic energy associated to momentum and invariant under position changes, both generating tractable flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.525,
    "end": 3085.189,
    "text": "Thanks to this decomposition, we are able to construct numerical methods through splitting the vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.201,
    "end": 3099.117,
    "text": " few ideas coming together here recalling some of our generalized coordinate based approaches to non-equilibrium steady states in bayesian mechanics and also decomposition of complex functions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.638,
    "end": 3108.26,
    "text": " Note also that for symplectic brackets, the existence of a shadow Hamiltonian can be guaranteed beyond the case of splitting methods, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.3,
    "end": 3124.605,
    "text": "for variational integrators, which use a discrete version of Hamiltonian's, Hamilton's principle of least action, and for most symplectic integrators in which the symplectic bracket is preserved up to topological considerations described by the first Dirham cohomology of face space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.165,
    "end": 3128.226,
    "text": "So for discussion with authors and you all,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.346,
    "end": 3155.932,
    "text": " what are the splitting integrators what is split from what and why what is the bracket notation or operation and what is a Poisson bracket what is a Poisson system section 2 3 rate matching integrators for smooth optimization so having obtained a vast family of smooth Dynamics and integrators that closely preserve F we can now apply these ideas to optimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.486,
    "end": 3160.124,
    "text": " What is being set up in this section and why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.064,
    "end": 3177.055,
    "text": " In equation seven, we see that the damping coefficient gamma of T being greater than zero reflects the dissipative component or the second term in that right-hand side of equation seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.556,
    "end": 3181.278,
    "text": "So damping coefficient controls the strength of the dissipation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.899,
    "end": 3189.904,
    "text": "One can imagine that if the damping coefficient is zero, the dissipative side zeroes out and B has conservative behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.865,
    "end": 3213.203,
    "text": " and so on so what is being set up here and why dot dot dot dot dot the existence of such a lyopin of function described above implies that trajectory starting in the neighborhood of q star will converge to q star so it's like a ball rolling to the bottom of a hill just like we've always wanted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.335,
    "end": 3225.341,
    "text": " In other words, the above system provably solves the optimization problem, minimum of V on Q, such that Q is in the D dimensional real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.501,
    "end": 3241.809,
    "text": "Punchline, we're setting up a system with good smooth optimization characteristics, ball rolling to the bottom of a smooth hill, that is also on the path or using the notation of or prepared to make the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.035,
    "end": 3247.741,
    "text": " Transformation two, a tractable discretization approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.702,
    "end": 3250.905,
    "text": "So some more on the damping coefficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.943,
    "end": 3261.491,
    "text": " They bring up some common choices for the damping coefficient and big O notation describes on the order of which something occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.192,
    "end": 3270.218,
    "text": "For example, linearly order of the variable or sub or super linearly as a function of time or data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.779,
    "end": 3278.766,
    "text": "So in computational complexity analysis, people are often interested as I double the amount of data I'm analyzing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.266,
    "end": 3281.607,
    "text": " Does that make the algorithm take twice as long?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.727,
    "end": 3284.248,
    "text": "That's linear computational complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.748,
    "end": 3286.529,
    "text": "Does it take four times as long?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.569,
    "end": 3288.59,
    "text": "Does it take the same amount of time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.49,
    "end": 3290.01,
    "text": "And so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.031,
    "end": 3308.298,
    "text": "And it'll be great to talk about the intuitions and implications and generalizations about how the damping coefficient influences the computational complexity estimates for convergence in different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.53,
    "end": 3317.017,
    "text": " They write, the conservative system from equation 16 reduces precisely the original dissipative system, 13.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.257,
    "end": 3328.551,
    "text": "The second equation in 16 reproduces 14 and the remaining equations are equivalent to the equations of motion associated to 13, which in turn are equivalent to eight as previously noted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.873,
    "end": 3330.253,
    "text": "Formally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.107,
    "end": 3344.595,
    "text": " What we have done is to embed the original dissipative system with phase space R2D, so real with 2D dimensions, into a higher dimensional conservative system with phase space R2D plus two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.696,
    "end": 3351.98,
    "text": "The dissipative dynamics thus lies on a hyper surface of constant energy k equals zero in high dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.401,
    "end": 3358.384,
    "text": "The reason for doing this procedure called symplectification is purely theoretical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.423,
    "end": 3361.164,
    "text": " Oh come on, it's not purely theoretical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.124,
    "end": 3376.191,
    "text": "Since the theory of symplectic integrators only accounts for conservative systems, we can now extend this theory to dissipative systems settings by applying a symplectic integrator to 13 and then fixing the relevant coordinates, 17, in the resulting methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.232,
    "end": 3380.854,
    "text": "Geometrically, this corresponds to integrating the time flow exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.937,
    "end": 3397.704,
    "text": " going to talk about a relationship between time and dissipative systems after all it's dissipative systems that are dissipating in time and so discretization of time plays a role in the appropriate discretization of a dissipative hamiltonian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.968,
    "end": 3413.021,
    "text": " And in citation 9, previously raised, such a procedure was defined under the name of presymplectic integrators, and these connections hold not only for the specific example above, but also for general non-conservative Hamiltonian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.481,
    "end": 3415.503,
    "text": "So, what is happening here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.444,
    "end": 3422.149,
    "text": "What's an intuition for conservative and dissipative systems, and how have the recent works of Franke et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.269,
    "end": 3423.29,
    "text": "expanded what is possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.861,
    "end": 3451.833,
    "text": " are now ready to explain why this approach is suitable to construct practical optimization methods the coordinate t sub k becomes simply the time discretization which is exact and so is u sub k since it is a function of time alone importantly u does not couple to any of the other degrees of freedom so it is irrelevant whether we have access to u or not because we're looking to solve a function of t",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.622,
    "end": 3481.165,
    "text": " 17a can be substituted in 15 to get 18 and you can replace 13 to get 19. we'll talk more about it with the authors therefore the known rates equation 11 for the continuum system are nearly preserved and so would be any rates of more general time dependent dissipative hamiltonian systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.779,
    "end": 3487.203,
    "text": " Let us now present an explicit algorithm to solve the optimization problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.586,
    "end": 3499.675,
    "text": "This is all happening as a consequence of having a shadow Hamiltonian such that geometric integrators are able to reproduce all the relevant properties of the continuum system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.858,
    "end": 3502.118,
    "text": "Section 2.4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.533,
    "end": 3505.134,
    "text": " Manifold and constrained optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.615,
    "end": 3512.0,
    "text": "Following 10, we briefly mentioned how the previous approach can be extended in great generality to an optimization problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.4,
    "end": 3522.649,
    "text": "So, equation 21, we present our minimization problem, V of Q, variational distribution on Q, citation 10, Franke et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.09,
    "end": 3528.454,
    "text": "They write, there are essentially two ways to solve this problem through a dissipative Hamiltonian approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.881,
    "end": 3538.406,
    "text": " One is to simulate a Hamiltonian dynamics on T star M by incorporating the metric of M in the kinetic moving part of the Hamiltonian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.407,
    "end": 3548.132,
    "text": "Another is to consider a Hamiltonian dynamics on Rn and embed M into Rn by imposing several constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.313,
    "end": 3552.095,
    "text": "The first approach uses a Lie group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.755,
    "end": 3553.656,
    "text": "We'll talk more about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.237,
    "end": 3556.638,
    "text": "An example of a second approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.794,
    "end": 3568.725,
    "text": " One can constrain the integrator on Rn to define a symplectic integrator on M via the discrete constrained variational approach by using some techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.807,
    "end": 3600.724,
    "text": " above method consists in a dissipative generalization of the well-known rattle integrator from molecular dynamics citations 100 through 103 used in computational biology section 2.5 gradient flow as a high friction limit let us provide some intuition why simulating second order systems is expected to yield faster algorithms as an illustration consider figure one on the left we'll look at in a second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.806,
    "end": 3624.98,
    "text": " where a particle immersed in a fluid falls under the influence of a potential force negative delta sub q on v and q so partial differential with respect to q of v on q that plays a role of gravity and is constrained to move on a surface so ball rolling down the hill we weren't joking about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.112,
    "end": 3632.795,
    "text": " In the underdamped case, the particle is underwater, which is not so viscous, so it has acceleration and moves fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.275,
    "end": 3634.235,
    "text": "It may even oscillate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.056,
    "end": 3648.201,
    "text": "In the overdamped case, the particle is in a highly viscous fluid, such as honey, and the drag force, that damping coefficient, gamma, is comparable or stronger to the gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.741,
    "end": 3651.282,
    "text": "Thus, the particle moves slowly since it cannot accelerate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.602,
    "end": 3657.985,
    "text": " During the same elapsed time, delta T, an accelerated particle would travel a longer distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.087,
    "end": 3660.807,
    "text": "Here's figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.868,
    "end": 3667.291,
    "text": "So here, why simulating second order systems yields accelerated methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.331,
    "end": 3671.154,
    "text": "So on the left, constrained particle falling in fluids of differential viscosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.074,
    "end": 3675.356,
    "text": "Here on the left, we have the particle falling through honey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.497,
    "end": 3680.88,
    "text": "It's slowly making its way to the bottom of the bowl, but it never really,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.179,
    "end": 3707.818,
    "text": " builds speed its terminal velocity is being dominated by the viscosity of the fluid whereas this ball falling through water or falling through air is with respect to the honey dampened bowl this is like an accelerated optimization and they present some numerical results that help us bolster that intuition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.079,
    "end": 3714.583,
    "text": " Really fun and embodied way to think about optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.143,
    "end": 3730.334,
    "text": "We've talked about that ball rolling to the bottom of the hill and what the ball does when it hits a small bump, but we have not talked about what media the ball is floating through and the media is the message and the fish doesn't know what it's swimming through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.344,
    "end": 3735.926,
    "text": " Section 2.6, optimization in the space of probability measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.426,
    "end": 3744.649,
    "text": "It'll be great to explore more because we're gonna see free energy calculations on the stationary density, KL divergence and more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.55,
    "end": 3758.115,
    "text": "For now, we can just say all those optimization techniques we were bringing up earlier, we're gonna be able to do them on information geometric spaces that correspond to probability measures that are well-behaved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.875,
    "end": 3763.899,
    "text": " not all distributions are probability measures or probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.259,
    "end": 3771.425,
    "text": "Just because you draw a line doesn't mean you can use that in part of your variational inference scheme for Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.846,
    "end": 3773.626,
    "text": "That's section two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.248,
    "end": 3778.59,
    "text": "On to section three, Hamiltonian-based accelerated sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.85,
    "end": 3787.157,
    "text": "So we talked about the Hamiltonian, conservative and dissipative, and the shadow Hamiltonian, which is going to be orders of magnitude better to approximate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.171,
    "end": 3795.237,
    "text": " We talked about gradient-based methods and how accelerated sampling is going to help us accelerate those sampling techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.997,
    "end": 3799.78,
    "text": "And now Section 3 brings it together with Hamiltonian-based accelerated sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.161,
    "end": 3801.582,
    "text": "Section 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.803,
    "end": 3810.689,
    "text": "The purpose of sampling methods is to efficiently draw samples from a target distribution row, or more commonly to calculate expectations with respect to row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.51,
    "end": 3812.931,
    "text": "And from the end of the paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.691,
    "end": 3835.203,
    "text": " efficient sampling scheme is one that minimizes the variance of the monte carlo markov chain estimator monte carlo that means that we're sampling hands from the poker table and markov chain which means that the past only influences the future through the present it's a quote memoryless process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.111,
    "end": 3864.206,
    "text": " other words fewer samples will be needed to obtain a good estimate intuitively good samplers are markov chains that converge as fast as possible to the target distribution it's like if you laid down a jump rope on a mountain if that jump rope converged quickly to the topography of the mountain it would have been a fast converging jump rope and we're doing something like that but with sampling from the jump rope",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.419,
    "end": 3868.961,
    "text": " 3.1, optimizing diffusion processes for sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.202,
    "end": 3882.091,
    "text": "As many MCMC methods are based on discretizing continuous time stochastic processes, the analysis of continuous time processes is informative of the properties of efficient samplers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.211,
    "end": 3892.258,
    "text": "And diffusion processes possess a rich geometric theory, extending that of vector fields and have been widely studied in the context of sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.706,
    "end": 3920.687,
    "text": " lot of very fascinating ideas here stratanovich stochastic differential equations are going to come into play equation 34 more technical details on diffusion the calculus of twisted differential forms allows us to have a measure-informed calculus on multi-vector fields",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.283,
    "end": 3925.066,
    "text": " What are twisted differential forms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.048,
    "end": 3927.771,
    "text": "I'm looking forward to that conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.071,
    "end": 3930.535,
    "text": "What is the untwisted differential form?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.196,
    "end": 3933.059,
    "text": "Have we been twisted all along or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.99,
    "end": 3936.991,
    "text": " and they go on to write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.631,
    "end": 3941.433,
    "text": "A fundamental criterion for efficient sampling is non-reversibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.433,
    "end": 3950.617,
    "text": "A process is non-reversible if it is statistically distinguishable from its time reversal when initialized at the target distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.298,
    "end": 3957.241,
    "text": "So once the jump rope is lying flat on the mountain, it's like in a position of reversibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.761,
    "end": 3961.663,
    "text": "Mixing metaphors at will here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.755,
    "end": 3969.159,
    "text": " Measure-preserving diffusions are non-reversible precisely when some conditions are met.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.14,
    "end": 3976.905,
    "text": "Intuitively non-reversible processes backtrack less often and thus furnish more diverse samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.705,
    "end": 3982.849,
    "text": "So if you're that ball rolling on the mountain, you want to just plow forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.19,
    "end": 3992.817,
    "text": "And whether you're going up or downhill, you want to be sampling and making moves, but you don't want to be going back and forth because at that point, it's not an efficient sampling path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.451,
    "end": 4001.178,
    "text": " It's well known that removing non-reversibility worsens the spectral gap and the asymptotic variance of the MCMC estimator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.719,
    "end": 4004.622,
    "text": "So, time discretization, spectral gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.484,
    "end": 4013.231,
    "text": "In diffusions with linear coefficients, one can construct the optimal non-reversible matrix A to optimize the spectral gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.295,
    "end": 4038.351,
    "text": " we can have well-behaved parameters that help us get at optimal discretization schemes so that that shadow hamiltonian can be preserved when we do discretize it during optimization so that we can respect the key properties of the system however there are no generic guidelines on how to optimize non-reversibility in arbitrary diffusions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.161,
    "end": 4042.542,
    "text": " This suggests a two-step strategy to construct efficient samplers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.003,
    "end": 4045.844,
    "text": "One, optimize reversible distributions, diffusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.384,
    "end": 4049.505,
    "text": "And two, add a non-reversible perturbation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.726,
    "end": 4053.147,
    "text": "Equation 36, citation 125.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.209,
    "end": 4065.192,
    "text": "Diffusions or manifolds, diffusion on manifolds are reversible when certain things are the case and they're not when other things are the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.102,
    "end": 4072.564,
    "text": " Equation 37, we got a triangle pointing down and a triangle pointing up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.764,
    "end": 4075.484,
    "text": "We're gonna talk more about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.525,
    "end": 4082.166,
    "text": "Underdamped Langvin dynamics combine all the desirable properties of an efficient sampler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.766,
    "end": 4088.068,
    "text": "It is reversible, has degenerate noise, and achieves accelerated conversions to the target density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.008,
    "end": 4091.809,
    "text": "So all of this groundwork",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.07,
    "end": 4116.735,
    "text": " is helping us get to an analytical formalization that's going to have the right kind of properties so we can do that discretization right on the shadow hamiltonian so we can get the accelerated optimization done 3.2 hamiltonian monte carlo a challenging task consists of constructing efficient sampling algorithms with strong theoretical guarantees",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.895,
    "end": 4131.53,
    "text": " We now discuss an important family of well-studied methods known as Hamiltonian Monte Carlo, HMC, which can be implemented on any manifold for any smooth, fully supported target measure that is known up to a normalizing constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.811,
    "end": 4138.517,
    "text": "Some of these methods can be seen as an appropriate geometric integration of the underdamped Langvin diffusion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.434,
    "end": 4162.515,
    "text": " diffusing down that hill but in simpler it is in general simpler to view them as combining a geometrically integrated deterministic dynamics with a simple stochastic process that ensures ergodicity equation 38. if we interpret the negative log density v of q as a potential energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.658,
    "end": 4163.998,
    "text": " e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.238,
    "end": 4181.509,
    "text": "a function depending on position Q, one can then plug in the potential within Newton's equation to obtain a deterministic proposal that is well-defined on any manifold, as soon as the acceleration and derivative operators have been replaced by their curved analogs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.249,
    "end": 4185.611,
    "text": "So, what pulls the ball down the hill?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.132,
    "end": 4191.775,
    "text": "Or, if you're an instrumentalist, what force describes the movement of the ball moving down the hill?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4192.716,
    "end": 4193.096,
    "text": "Gravity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.554,
    "end": 4196.135,
    "text": " I think there's a John Mayer song about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.216,
    "end": 4198.576,
    "text": "Surprises like gravity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.477,
    "end": 4209.323,
    "text": "It can be understood as the minimizing force that pulls the ball down the hill or describes the movement of the ball on its path of least action down the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.243,
    "end": 4210.703,
    "text": "How cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.105,
    "end": 4214.806,
    "text": "More discussion around 38.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.33,
    "end": 4223.151,
    "text": "Bringing these ingredients together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.056,
    "end": 4226.698,
    "text": " We thus have the following HMC algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.319,
    "end": 4239.849,
    "text": "Given dot, dot, dot, we're going to compute a function according to one, a heat bath, two, shadow Hamiltonian dynamics, and three, metropolis correction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4240.67,
    "end": 4241.59,
    "text": "That's the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.831,
    "end": 4244.533,
    "text": "We're bringing those ingredients together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.874,
    "end": 4247.736,
    "text": "The above rudimentary HMC method",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.496,
    "end": 4266.922,
    "text": " was proposed for simulations in lattice quantum chromodynamics, with M being the special unitary group and used a Hamiltonian dynamics ingeniously constructed from the Maurer-Cartan frame to compute the partition function of discretized gauge theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.142,
    "end": 4271.563,
    "text": "This method has later been applied in molecular dynamics and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.585,
    "end": 4280.168,
    "text": " There are three critical properties underpinning the success of HMC in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.548,
    "end": 4288.672,
    "text": "The first two are the preservation of the reference measure and the existence of a conserved shadow Hamiltonian for the numerical method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.672,
    "end": 4300.678,
    "text": "The third critical property is the existence of splittings methods for which all the composing flows are either tractable or have adequate approximations, namely the geodesic integrators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.9,
    "end": 4323.451,
    "text": " so geodesic geodesic methods buckminster fuller tensegrity synergetics or however you think about geodesics as paths in curved space that is the kind of approximation and splitting we're gaining access to with appropriate discretizations on those balls rolling to the bottom of the hill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.037,
    "end": 4329.9,
    "text": " Let us also briefly mention some useful upgrades that have been proposed in recent years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.52,
    "end": 4335.804,
    "text": "So, for those who it's been a few years since you checked in with this domain, this is a great place to look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.444,
    "end": 4342.988,
    "text": "First, you can grant the method extra integration steps when the proposal is rejected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.009,
    "end": 4345.069,
    "text": "Or,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.144,
    "end": 4358.139,
    "text": " You can use criterion that aim to ensure the motion is long enough to avoid random walks, but short enough that we do not waste computational effort, such as the no U-turn sampler, which is integrated in a lot of software packages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.341,
    "end": 4359.561,
    "text": "Second,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.376,
    "end": 4372.925,
    "text": " Modern HMC methods bypass this issue of slow convergence by replacing the heat bath with an Ornstein-Ohlbeck process, which ensures the overall algorithm is irreversible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.625,
    "end": 4379.37,
    "text": "An OU process is like a Brownian diffusion with a linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.81,
    "end": 4385.094,
    "text": "So it vibrates and has volatility, and it has a trend line that's linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.431,
    "end": 4392.442,
    "text": " Third, many modifications of the rudimentary HMC algorithm only provide improvements when the acceptance rate is sufficiently high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.163,
    "end": 4399.114,
    "text": "A third class of upgrades improve the acceptance rate by using the fact that the shadow Hamiltonian is exactly preserved by the integrator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.031,
    "end": 4401.553,
    "text": " Big point of the whole paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.514,
    "end": 4413.767,
    "text": "Finally, the metropolis step can be replaced with a multinomial correction that uses the entire numerical trajectory accepting a given point along it according to the degree by which it distorts the target measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4414.488,
    "end": 4418.713,
    "text": "Some path-based inference methods with some caveats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.669,
    "end": 4425.173,
    "text": " All right, on to section four, statistical inference with kernel-based discrepancies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.953,
    "end": 4443.867,
    "text": "So section four, the problem of parameter inference consists of estimating an element theta star within big theta using a sequence of random functions or estimators theta hat n of omega onto big theta equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.789,
    "end": 4458.501,
    "text": " Conveniently, reproducing kernel Hilbert spaces are precisely Hilbert spaces over which the Dirac distributions, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.662,
    "end": 4467.704,
    "text": " a statistical distribution type where it's like a spike at one location and zero elsewhere, act continuously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.404,
    "end": 4472.865,
    "text": "So whether we're talking about events or spiking neurons, this is a really good property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.805,
    "end": 4484.768,
    "text": "And more generally, the probability distributions that act continuously by integration on an RKHS, H, are exactly those for which all elements of H are integrable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.568,
    "end": 4488.329,
    "text": "So analytically, we have that nice property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.949,
    "end": 4502.259,
    "text": " Denoting by fancy p sub h the set of such probability measures such that dot dot dot, we can define the maximum mean discrepancy, or MMD, as such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.04,
    "end": 4504.981,
    "text": "More definitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.682,
    "end": 4508.264,
    "text": "A practical expression for the squared MMD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.964,
    "end": 4518.011,
    "text": "So just like in linear regression, we're often interested in the sum of squared errors, here we're interested in the sum of squared MMD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.965,
    "end": 4523.547,
    "text": " 4.1, topological methods for MMDs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.908,
    "end": 4528.633,
    "text": "Just remember, MMDs, maximum mean discrepancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.396,
    "end": 4535.36,
    "text": "A key feature of RKHS is that they are Hilbertian subspaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.021,
    "end": 4540.125,
    "text": "More details about embedding in Hilbert spaces and subspaces later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.974,
    "end": 4550.821,
    "text": " The geometric description of RKHS and MMD allows us to swiftly apply topological methods in their analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.022,
    "end": 4552.623,
    "text": "There are reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.344,
    "end": 4557.267,
    "text": "This reduces the matter to a topological question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.969,
    "end": 4568.796,
    "text": "Instead of defining T star to be the set of probability measures, it is commonly done to define statistical manifolds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.73,
    "end": 4582.741,
    "text": " It's desirable to embed fancy P within a more structured space, such as the space of finite radon measures, which enables the method to learn the target function independently of the data generating distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.962,
    "end": 4585.504,
    "text": "What is a radon measure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.084,
    "end": 4586.945,
    "text": "We're going to find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.585,
    "end": 4593.971,
    "text": "However, it enables the method to learn the target function independently of the data generating distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.471,
    "end": 4597.374,
    "text": "Sounds pretty important if we want that tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.066,
    "end": 4601.809,
    "text": " MMD can discriminate distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.13,
    "end": 4604.593,
    "text": "That makes it useful to do other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.675,
    "end": 4606.577,
    "text": "Let's find out more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.0,
    "end": 4609.641,
    "text": "Section 4.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.463,
    "end": 4612.526,
    "text": "Smooth measures and KSDs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.548,
    "end": 4613.648,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.702,
    "end": 4619.104,
    "text": " more information on MMDs and about making them computationally tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.104,
    "end": 4636.89,
    "text": "And citations to Stein's method are provided for 195, which is the 1972 Stein paper, and 196, which is a paper written by some of the authors about Stein's method meets statistics, a review of some recent developments from 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.49,
    "end": 4642.713,
    "text": " And I thought it'd be fun to look at some figures from this paper and look at the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.254,
    "end": 4644.655,
    "text": "So I'll put the figures up above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.46,
    "end": 4657.605,
    "text": "Stein's method compares probability distributions through the study of a class of linear operators called Stein operators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.265,
    "end": 4665.931,
    "text": "While mainly studied in probability and used to underpin theoretical statistics, Stein's method has led to significant advances in computational statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.185,
    "end": 4691.017,
    "text": " topics that are discussed in that review include tools to benchmark and compare sampling methods such as approximate markov chain monte carlo deterministic alternatives to sampling methods control variant techniques parameter estimations and goodness of fit testing and from the paper they write the list of results given in this paper are but a mere sample",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.264,
    "end": 4702.648,
    "text": " of the ongoing activity in this newly established area of research at the boundary between probability, functional analysis, data science, and computational statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.228,
    "end": 4721.698,
    "text": "For instance, Stein's method has been used for designing sampling-based algorithms for non-convex optimization, learning semi-parametric multi-index models in high dimensions, and in Bayesian statistics, Stein discrepancies have been used as variational objectives for posterior optimization, which is what we're all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.379,
    "end": 4723.505,
    "text": " Free energy functionals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.563,
    "end": 4733.99,
    "text": " using variational inference as objectives for posterior approximation of inference and action, free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.71,
    "end": 4737.352,
    "text": "And these images have some nice intuitions too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.113,
    "end": 4743.437,
    "text": "Here we see, depending on our step size, we're getting different sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4744.237,
    "end": 4752.103,
    "text": "When our step size is to the negative fifth power, we're oversampling one part of the space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.732,
    "end": 4759.337,
    "text": " Then as we make the step size larger, our samples are drawn from different distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4759.437,
    "end": 4764.541,
    "text": "So that's selecting the step size epsilon for a stochastic gradient Langvin dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.162,
    "end": 4769.165,
    "text": "And also from the Anastasio paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.805,
    "end": 4771.447,
    "text": "Here's another fun way to see that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.95,
    "end": 4789.278,
    "text": " Here we have that bowl that we're rolling the ball to the bottom of and the Stein points and the Stein thinning, which is helping us understand maybe how starting the ball in different locations or critical locations accelerates what we're doing with optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.998,
    "end": 4793.4,
    "text": "So cool to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.42,
    "end": 4797.502,
    "text": "4.2.1, the canonical Stein operator and Poincaré duality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.002,
    "end": 4806.848,
    "text": " There are two fundamental theorems that help us understand the integral differential geometry of the manifold, Durham's theorem and the Poincaré duality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.048,
    "end": 4815.594,
    "text": "The former, Durham's theorem, relates the topology of the manifold to information on the solutions of differential equations defined over the manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.674,
    "end": 4825.561,
    "text": "The latter, which contains the fundamental theorem of calculus, describes the properties of the integral pairing, alpha-beta, of differential forms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.633,
    "end": 4829.875,
    "text": " which include the pairing of test functions with smooth measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.536,
    "end": 4832.617,
    "text": "Let's learn more about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4834.999,
    "end": 4837.921,
    "text": "4.2.2, kernel Stein discrepancies and score matchings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.022,
    "end": 4845.626,
    "text": "Technical definitions, facilitating Stein variational gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.548,
    "end": 4853.852,
    "text": "4.3, information geometry of MMDs and natural gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.18,
    "end": 4878.002,
    "text": " these tools have proved to be useful in a wide range of contexts more information about the divergence and how divergence can improve the speed of convergence by following the natural gradient descent okay red text speculation beware so the operator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.298,
    "end": 4889.868,
    "text": " which is a phone routing system like Ring Ring Hello Operator, is constructed in Section 4.2.2, Colonel Stein discrepancies and score matching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.708,
    "end": 4893.911,
    "text": "You can't have a t-test without the t-distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.632,
    "end": 4900.277,
    "text": "The t-test statistic is using a t-distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.678,
    "end": 4904.401,
    "text": "So, a class of Fancy V",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.365,
    "end": 4916.247,
    "text": " a set, fancy V, of vector fields, or more generally tensor fields, whose image F under the operator, ring, ring, has mean zero under mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.327,
    "end": 4923.008,
    "text": "That's going to give us this discrepancy, the SD, and the Stein variational gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.728,
    "end": 4933.13,
    "text": "So, there's some class of V vector fields such that the mean of something about them is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.981,
    "end": 4963.523,
    "text": " does this enable the central limit theorem or just statistics more broadly like the parametric and non-parametric methods that we know and love from spm does that mean zero enable us to use gaussian methods generalized gaussian methods generalized linear methods spm and does it enable the proposed smooth distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.551,
    "end": 4972.733,
    "text": " the one generating the shadow Hamiltonian that's getting inferred over, to be interpreted or used truly as a statistical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.753,
    "end": 4979.415,
    "text": "It's easy to forget that not all distributions are formal probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.615,
    "end": 4986.196,
    "text": "For example, the area under the curve from zero to one of a probability distribution is one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.816,
    "end": 4987.817,
    "text": "Something has to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.437,
    "end": 4993.938,
    "text": "But not all functions have an area under the curve of one between zero and one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.327,
    "end": 5021.945,
    "text": " so in variational bayesian inference the kind which we do in active inference in fact the kind that's done in machine learning and statistics more broadly but we're interested when action is a parameter that we're doing inference on we're concerned with the extremely well behaved properties of a certain subset of distributions so why are we doing this why is it important that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.67,
    "end": 5035.378,
    "text": " We didn't need the input data that we could construct measures that are independent of the input data because we want to enable the tail of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.218,
    "end": 5045.727,
    "text": "We want to make generative models that can be used generatively, generative AI, in the forward or the generative direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.09,
    "end": 5056.014,
    "text": " but we also want to be able to enable the recognition distribution, which is from empirical data to do hidden state inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.954,
    "end": 5073.702,
    "text": "And so just like least squares regression, in the linear modeling case, where the sum of squares above and below the regression line should be as low as possible, L2 norm, sum of squares minimization, always works, never complains,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.455,
    "end": 5097.926,
    "text": " We want that kind of ball rolling to the bottom of the hill with free energy functionals, variational and expected free energy functionals as the optimized or satisficed imperative for optimal perception, which is signal processing, signals intelligence, and control, which is control theory or action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.866,
    "end": 5106.507,
    "text": " More technical details and equations 39b and 39c.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.347,
    "end": 5116.329,
    "text": "So what does it mean that the resulting Stein discrepancy can be thought of as an MMD that depends only on rho and is known as a kernel Stein discrepancy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5116.629,
    "end": 5117.109,
    "text": "What is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5120.05,
    "end": 5128.372,
    "text": "As we did previously, we can remove the supremum by rewriting the above as a supremum over some unit ball of continuous linear functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.611,
    "end": 5136.336,
    "text": " Is this like simulating or modeling a sphere rolling on a landscape like we've been talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.557,
    "end": 5142.341,
    "text": "Is the ball of optimal radius for rolling on that landscape or what is being optimized?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.781,
    "end": 5151.248,
    "text": "And what is the unit, the scaling or the scale specificity that this scale friendly sphere is scaled to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.045,
    "end": 5155.606,
    "text": " Equation 42 and 42a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.926,
    "end": 5159.607,
    "text": "While in the Euclidean space yields the diffusion score matching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.007,
    "end": 5160.447,
    "text": "Citation 204.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.088,
    "end": 5162.828,
    "text": "Barp et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.588,
    "end": 5163.888,
    "text": "Again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5165.129,
    "end": 5168.45,
    "text": "Minimum Stein discrepancy estimators from 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5168.61,
    "end": 5181.174,
    "text": "They write, the main strength of our methodology is its flexibility, which allows us to design estimators with desirable properties for specific models at hand by carefully selecting the Stein discrepancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.874,
    "end": 5182.935,
    "text": "We illustrate this advantage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.755,
    "end": 5188.856,
    "text": " for several challenging problems for score matching, such as non-smooth, heavy-tailed, or light-tailed densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.436,
    "end": 5198.179,
    "text": "So again, just with a little bit of speculation here, and I think my camera has frozen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.021,
    "end": 5207.581,
    "text": "It's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.601,
    "end": 5211.962,
    "text": "I'll just go without the camera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.545,
    "end": 5243.585,
    "text": " okay um one can estimate infer or optimize the zero point and hence the variance structure of the distribution this is going to enable generalized well-behaved modeling again from all of those nice perspectives that we raised earlier like gaussian central limit theorem smoothness statistical distance euclidean all of those well-behaved properties that we're looking for this is going to help us get there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.69,
    "end": 5251.316,
    "text": " We are only talking about a specific subset or type of landscape here, the one that we're doing variational inference on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5251.776,
    "end": 5252.457,
    "text": "That's the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.818,
    "end": 5255.719,
    "text": "This is not the structure of the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.84,
    "end": 5264.467,
    "text": "These well-behaved attributes of models, for better, worse, and different, through sickness and health, is because they're maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.973,
    "end": 5274.102,
    "text": " It is always the case that our statistically nice generative models are of a different structure or form than the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.662,
    "end": 5278.727,
    "text": "So this is actually not a criticism of quantitative modeling as a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.427,
    "end": 5282.871,
    "text": "In fact, this is the entire basis of quantitative modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5283.371,
    "end": 5286.295,
    "text": "So we've approached this map territory distinction,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5286.835,
    "end": 5304.846,
    "text": " map territory fallacy fallacy fallacy from many angles and one will still hear things like well the structure of the statistical model is not the same as the territory or how can you say that the organism has these well-behaved properties just because the model does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.002,
    "end": 5321.413,
    "text": " And this brings a really sharp light on it, which is we're doing this insane amount of analytical groundwork so that the map has the good properties, not to constrain what the territory is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.013,
    "end": 5323.575,
    "text": "So map territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.455,
    "end": 5345.6,
    "text": " all of the math we've been talking about is map we want well-behaved maps so that we can describe well-behaved and unruly territories but it isn't the case that the organism minimizes variational free energy it's the generative model that minimizes variational free energy so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.974,
    "end": 5350.456,
    "text": " a little bit of a leading discussion topic or question for you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.776,
    "end": 5354.558,
    "text": "Feel free to give a thought in the live chat or write a comment or join our discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5355.719,
    "end": 5358.921,
    "text": "How is this line of basic and fundamental math research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5359.824,
    "end": 5371.251,
    "text": " by Barp et al., creating new models that have the operational or denotational semantics that we want for computational statistics, which is to say applied information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.251,
    "end": 5386.7,
    "text": "For example, distributions that can be interpreted or used as statistical distributions, ideally directly compatible with current computational methods, SPM in MATLAB, PyMDP in Python, and Forney Lab in Julia, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.737,
    "end": 5390.497,
    "text": " Section 4.3.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.158,
    "end": 5392.958,
    "text": "Minimum Stein discrepancy estimators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.278,
    "end": 5395.539,
    "text": "More technical details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.219,
    "end": 5397.359,
    "text": "More citation to 204.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.619,
    "end": 5405.201,
    "text": "The parameters can be adjusted to achieve characteristicness, consistency, bias, robustness, and obtain central limit theorems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.801,
    "end": 5406.462,
    "text": "See 204.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5406.522,
    "end": 5409.482,
    "text": "2019 paper with Barp et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.062,
    "end": 5414.164,
    "text": "And let's just look at a really cool image from that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.904,
    "end": 5415.784,
    "text": "Figure one and figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.267,
    "end": 5421.429,
    "text": " Pretty cool SD estimators, looking nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.63,
    "end": 5437.916,
    "text": "Section 4.3.2, likelihood-free inference with generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5438.776,
    "end": 5446.72,
    "text": "So for many applications of interests, the densities of the model mu sub data cannot be evaluated or differentiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5448.394,
    "end": 5470.946,
    "text": " thus need density-free inference methods super convenient for bayesian statistics more technical details information tensor under appropriate choices of kernels and models one can derive theoretical guarantees such as concentration and generalization bounds consistency asymptotic normality and robustness so a little bit of a summary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.486,
    "end": 5483.122,
    "text": " we have good analytical and computational footing in certain kinds of situations or under certain constraints certainly not all constraints but definitely for some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.338,
    "end": 5505.154,
    "text": " that might enable the efficient computation, not just specification, but actual implementation of large generative models, such as described in the paper of Friston et al, 2022, designing ecosystems of intelligence from shared, sorry, designing ecosystems of intelligence from first principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5505.914,
    "end": 5510.317,
    "text": "And they use the term ecosystems of shared intelligence in that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5511.258,
    "end": 5538.377,
    "text": " and so it's relevant to learn about the actuality and build intuition why slash how do we know well here's the one figure in that paper of friston at all the one figure in this absolutely positional paper that they have released beliefs as parameters of a probability distribution here's the sharpening of a belief as a distance belief updating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.597,
    "end": 5550.547,
    "text": " as traversing a statistical manifold, which is to say a lower dimensional projected space, and what's being shown as the parameter space of a probability distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.727,
    "end": 5567.041,
    "text": "So whether we see this as gradient ascent to climb to the top of the hill, or we take the negative and we have gradient descent to the bottom of the hill, this is the figure chosen by some very well-informed authors to describe Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.984,
    "end": 5593.531,
    "text": " and long last we get to section five adaptive agents through active inference we close as the authors write with a generic use case called active inference a general framework for describing and designing adaptive agents that unifies all aspects of behavior including perception planning and learning as processes of inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.585,
    "end": 5611.673,
    "text": " By exploiting this geometric structure in a generic framework for designing adaptive agents, we derive the objective functional overarching decision-making and describe its information geometric structure, revealing several special cases that are established notions in statistics, cognitive science, and engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.594,
    "end": 5615.255,
    "text": "So section 5.1, modeling adaptive decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.115,
    "end": 5619.157,
    "text": "First, they're going to talk about behavior agents and environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5620.302,
    "end": 5629.467,
    "text": " Behavior is going to be defined as the interaction between an agent and its environment, and the system is going to describe the agent plus its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5631.268,
    "end": 5643.835,
    "text": "There's going to be a set of states that are partitions from a state space, big X. External states, S, are going to be unknown to the agent and constitute the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5644.976,
    "end": 5649.499,
    "text": "States belonging to the agent, pi, particular states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.512,
    "end": 5653.575,
    "text": " are going to be a subset of two different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5653.795,
    "end": 5657.479,
    "text": "So here is S, which is here, external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.619,
    "end": 5661.343,
    "text": "Note that in some other settings, S will refer to sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.503,
    "end": 5663.204,
    "text": "So look at the notation in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5664.325,
    "end": 5671.392,
    "text": "And pi, which in other papers is sometimes used to describe policy inference, here is gonna describe particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5672.333,
    "end": 5683.244,
    "text": " So pi is O and A. O are the observable states, states that the agent can see but cannot directly control, sense states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.705,
    "end": 5690.311,
    "text": "And A are the autonomous states, states that the agent sees and can directly control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.891,
    "end": 5694.475,
    "text": "And those are going to be internal states and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.708,
    "end": 5697.429,
    "text": " Figure two has a great representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5697.869,
    "end": 5704.013,
    "text": "And again, note the way that pi, s, o, and a are being used in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5705.734,
    "end": 5711.277,
    "text": "S is the external process, hidden state, latent state, causal inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.678,
    "end": 5714.098,
    "text": "O are the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5715.059,
    "end": 5723.984,
    "text": "And the agent process consists of pi, which is the observations, and alpha, or a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5725.635,
    "end": 5749.67,
    "text": " a is consisting of according to the particular partition two different kinds of states which is internal states cognitive states and action states and so we're going to compute bounds for free energy functionals with a special focus on autonomous processes because controlling our perception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5750.951,
    "end": 5772.007,
    "text": " is not possible and maybe not even preferable by controlling it at the level of what we observe but rather if we control our internal states which is our interpretation of the perception and our action states we'll be doing optimal perception and optimal action so those are the two sides of the coin with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.402,
    "end": 5792.357,
    "text": " inference as perception slash learning and action selection that's how we unify action and inference inactive inference is by caring about the bounding of self-surprisal just like gravity on our autonomous processes so this will be super fun to discuss more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.855,
    "end": 5797.417,
    "text": " 5.1.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5795.576,
    "end": 5797.417,
    "text": "Decision-making in precise agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5798.018,
    "end": 5800.279,
    "text": "So what distinguishes people from small particles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.26,
    "end": 5804.622,
    "text": "People are subject to classical as opposed to statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.243,
    "end": 5813.329,
    "text": "Check out ACDIMF Livestream 49 for more on Bayesian mechanics and some of these distinctions with classical, statistical, quantum, and thermo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5814.57,
    "end": 5817.692,
    "text": "In other words, they are precise agents with conservative dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.096,
    "end": 5820.257,
    "text": " Precise agent, definition 5.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5820.298,
    "end": 5825.584,
    "text": "An agent is precise when it evolves deterministically in a possibly stochastic environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.047,
    "end": 5828.728,
    "text": "More definitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.848,
    "end": 5833.709,
    "text": " And it's useful here to highlight Friston et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.669,
    "end": 5855.958,
    "text": "'s recent paper, Path Integrals, Particular Kinds, and Strange Things, which provides a taxonomy of things, taxonomy of particular entities that run the gamut of sophistication from inert particles, which have no active states, active particles, which have active states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.062,
    "end": 5883.284,
    "text": " conservative particles, which have cognitive dynamics that are described as classical, and strange particles, which represent, in this visualization, the highest level of cognitive sophistication, in which those internal hidden states themselves have this kind of what would happen if this happens counterfactual type or thinking through other minds type cognitive model structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.807,
    "end": 5889.148,
    "text": " doing forward and inverse inference on these great times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5892.389,
    "end": 5894.049,
    "text": "5.1.2, decision-making and precise agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.77,
    "end": 5901.871,
    "text": "We have mathematical formalisms for decisions, preferences, and predictions, all using the partitioned variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.312,
    "end": 5906.593,
    "text": "5.1.2, more formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.433,
    "end": 5910.113,
    "text": "We get to expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5910.674,
    "end": 5912.154,
    "text": "Expected free energy is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5913.658,
    "end": 5915.1,
    "text": " Equation 41k.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.123,
    "end": 5929.302,
    "text": "Active inference is Hamilton's principle of least action on expected free energy and expresses the most likely decision where certain features are met.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5930.848,
    "end": 5941.514,
    "text": " Principle of least action on manifolds of inference and action subsuming or bringing together inference and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5942.255,
    "end": 5942.895,
    "text": "Active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.435,
    "end": 5946.377,
    "text": "Free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5946.777,
    "end": 5946.377,
    "text": "5.1.3."
  },
  {
    "start": 5947.538,
    "end": 5952.361,
    "text": "Active inference framework, AIF, looks like it describes agents that engage in purposeful behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5953.154,
    "end": 5961.256,
    "text": " we can rearrange the expected free energy, EFE, in several ways, each of which reveals a fundamental trade-off that underwrites decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5961.957,
    "end": 5970.499,
    "text": "This allows us to relate active inference to information theoretic formalizations of decision-making that predominate in statistics, cognitive science, and engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.04,
    "end": 5972.44,
    "text": "Figure three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5974.0,
    "end": 5992.444,
    "text": " as hinted at in the early early keywords here on the top we have the general formalizations of active inference and one of the partitions or better to say decompositions is shown here where extrinsic value is the surprisal about observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5993.789,
    "end": 5999.457,
    "text": " making sure that what we're getting in observations are what we expect slash prefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5999.918,
    "end": 6005.826,
    "text": "If the body wants to be expecting homeostatic temperature, that's what this is going to determine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.407,
    "end": 6009.091,
    "text": "And it plays a role equivalent to reward",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.092,
    "end": 6027.56,
    "text": " in reward and reinforcement learning based approaches, because we don't need to actually set a reward function, but we get something that looks like self-surprisal aligned with reward using the preference variable over observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6027.58,
    "end": 6029.601,
    "text": "A lot more to say there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.629,
    "end": 6038.676,
    "text": " And the second term is the intrinsic value, the epistemic value, curiosity, novelty, learning, reduction of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6039.797,
    "end": 6042.54,
    "text": "And another partitioning is between risk and ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6044.061,
    "end": 6052.168,
    "text": "There are four colored dots, red, tan, gray, and blue corresponding to special cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6053.049,
    "end": 6056.312,
    "text": "So under the setting where there's no ambiguity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6057.392,
    "end": 6068.181,
    "text": " we realize or manifest the special case where control can be seen as inference, maximum entropy reinforcement learning, prospect theory, and KL optimal control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6068.761,
    "end": 6076.927,
    "text": "This is like doing as good as you can strategically or tactically, given that there's no ambiguity in how your decisions play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6078.469,
    "end": 6083.172,
    "text": "Now, under the setting where there's no ambiguity or preferences,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6084.324,
    "end": 6086.588,
    "text": " a maximum entropy principle is realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6087.249,
    "end": 6095.424,
    "text": "And work with Bayesian mechanics and Dalton et al has shown that the constrained maximum entropy principle is dual to the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6097.808,
    "end": 6105.633,
    "text": " In the case of no extrinsic value, so no quote reward, no quote goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.773,
    "end": 6113.819,
    "text": "We don't use reward or goals in the active inference ontology, but borrowing those words from some long, long forgotten ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6115.14,
    "end": 6117.081,
    "text": "In the case of no extrinsic value,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6118.424,
    "end": 6124.308,
    "text": " we realize the special case of maximum information gain, Bayesian experimental design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6124.508,
    "end": 6128.33,
    "text": "So not to prove or disprove, but the maximally informative experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.811,
    "end": 6131.092,
    "text": "That's the Bayesian scientific epistemology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6132.313,
    "end": 6134.454,
    "text": "Intrinsic motivation and Bayesian surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.435,
    "end": 6138.477,
    "text": "Seeking out optimally informative stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6139.797,
    "end": 6144.14,
    "text": "And contrast that with a setting where there's no intrinsic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6145.001,
    "end": 6146.882,
    "text": "So where there's nothing to learn,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6148.783,
    "end": 6156.065,
    "text": " we realize expected utility theory, Bayesian decision theory, reinforcement learning, and optimal control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6157.186,
    "end": 6174.731,
    "text": "So special cases from many different fields ranging from statistical mechanics to Bayesian decision-making and statistics integrated or perhaps better generalized across in the formalisms of active inference, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.084,
    "end": 6187.97,
    "text": " is something like a Hamilton's principle of least action on variational or expected free energy expressing the most likely inference and action under certain constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6188.73,
    "end": 6191.612,
    "text": "Not the most rewarding, but the most likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.893,
    "end": 6198.155,
    "text": "5.1.3, decision-making minimizes both risk and ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.895,
    "end": 6202.077,
    "text": "Risk, first term on the right-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.857,
    "end": 6204.578,
    "text": "Ambiguity, second term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.629,
    "end": 6210.21,
    "text": " Minimizing ambiguity leads to a type of observational bias commonly known as the streetlight effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.81,
    "end": 6216.091,
    "text": "When a person loses their keys at night, they initially search for them under the streetlight because of the resulting observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6216.971,
    "end": 6225.613,
    "text": "I see my keys under the streetlight, or I do not see my keys under the streetlight, accurately disambiguate external states of affairs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6226.653,
    "end": 6231.634,
    "text": "First place to look makes sense under the streetlight, and the last place you look is where you find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6233.624,
    "end": 6251.85,
    "text": " more in 5.1.3 decision making maximizes extrinsic and intrinsic value another decomposition of the formalisms of active inference maximizing information gain leads to a goal-directed form of exploration driven to answer what would happen if i did that true counterfactuals",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6253.683,
    "end": 6263.049,
    "text": " This decision-making procedure underwrites Bayesian experimental design in statistics, which describes optimal experiments as those that maximize expected information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6263.67,
    "end": 6276.879,
    "text": "And we've had some great discussions recently in textbook groups and in discussion hours where we contrasted that falsificationist concept of accept or reject a hypothesis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6277.819,
    "end": 6290.851,
    "text": " And even the idea of a scientist or a researcher setting out to accept or reject hypothesis, whether you take that positivist or you take the other path of falsificationism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6292.085,
    "end": 6310.033,
    "text": " In both cases, you might end up with an informative experiment or not, but you can easily imagine cases where you end up with an uninformative experiment because you set out to confirm something you knew, or you set out to disprove something by constraining your experiment so that it was locally disproven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6310.974,
    "end": 6315.096,
    "text": "In contrast, when we take into account the richness of our generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6316.038,
    "end": 6330.73,
    "text": " We motivate this Bayesian epistemology and ultimately professional Bayesianism, where we make optimal experiments in terms of their maximum expected information gain, which requires you to also state your generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6332.951,
    "end": 6342.459,
    "text": "Decision-making under active inference weighs the imperatives of maximizing utility and information gain, which suggests a principled solution to the exploration exploitation dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6343.92,
    "end": 6369.695,
    "text": " great point to jump into does active inference simply by written down by being written down on a paper resolve or transcend or dissolve exploration exploitation no does it provide a space or a framework a method an approach software packages research community that can help us address and navigate and surf on the edge of that dilemma absolutely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6372.234,
    "end": 6394.943,
    "text": " 5.2.1 the basic active inference algorithm we're going to go through it with authors preferential inference we want to infer preferences about external and observable trajectories two for each possible sequence of past present and future actions a we're going to engage in both sides of the coin perceptual inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6395.928,
    "end": 6398.609,
    "text": " What would I perceive if that happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.229,
    "end": 6400.53,
    "text": "And planning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6401.29,
    "end": 6404.511,
    "text": "Assess the action sequence by evaluating its expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6405.252,
    "end": 6407.613,
    "text": "And then three, decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.893,
    "end": 6413.035,
    "text": "Execute the most likely decision at T plus one according to some distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6414.035,
    "end": 6415.916,
    "text": "Sample from your action posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.896,
    "end": 6419.417,
    "text": "Action prior, that's like your habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6420.278,
    "end": 6425.32,
    "text": "It gets sharpened or modified with expected free energy, and then you sample from the action posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6428.409,
    "end": 6456.79,
    "text": " 5.2.1 sequential decision making under uncertainty a partially observable markov decision process pomdp is a discrete time model of how actions influence external states in a pomdp each external state depends only on the current action and previous external state that's the markov property each observation depends only on the current external state and one can additionally specify a distribution of preferences over external trajectories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6458.309,
    "end": 6461.632,
    "text": " 1 and 2 form the agent's POMDP prediction model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.673,
    "end": 6469.838,
    "text": "2 and 3 form the agent's hidden Markov preference model, which defines the active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6471.232,
    "end": 6475.233,
    "text": " A simple simulation of active inference on a POMDP is provided in Figure 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6476.054,
    "end": 6479.115,
    "text": "Implementation details on generic POMDPs are available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.755,
    "end": 6483.956,
    "text": "For more complex simulations of sequential decision making, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6484.196,
    "end": 6488.818,
    "text": "involving hierarchical POMDPs, please see citations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6490.298,
    "end": 6490.818,
    "text": "Figure 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.819,
    "end": 6492.699,
    "text": "It's a prediction model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6493.544,
    "end": 6497.247,
    "text": " This is sequential decision-making in a T maze environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6498.127,
    "end": 6503.491,
    "text": "On the left, the agent's prediction model as a POMDP, represented here as a Bayesian network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6504.292,
    "end": 6506.394,
    "text": "On the right, information on the T maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6507.014,
    "end": 6514.74,
    "text": "So here we have some type of Bayesian graph reflecting, hopefully,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6515.836,
    "end": 6521.744,
    "text": " a statistical system that's going to have all of these well-behaved properties that we've been talking about in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6522.845,
    "end": 6526.37,
    "text": "And then the team A's is played out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6527.131,
    "end": 6527.772,
    "text": "We'll talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6530.052,
    "end": 6531.313,
    "text": " 5.2.3, world model learning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6532.073,
    "end": 6536.315,
    "text": "Due to a lack of domain knowledge, it may be challenging to specify an agent's prediction and preference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6536.655,
    "end": 6539.176,
    "text": "For example, how do external states map to observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6539.616,
    "end": 6542.958,
    "text": "Should external states be represented in a discrete or continuous state space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.898,
    "end": 6556.124,
    "text": "Also some great questions that come up every day and are addressed in chapter six, a recipe for active inference modeling by the Parr, Pizzullo and Friston 2022 textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6558.396,
    "end": 6564.702,
    "text": " So how do we get the right priors or at least approximately adequate priors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6565.643,
    "end": 6572.229,
    "text": "One way to answer the question lies in optimizing a free energy functional F, which is an evidence lower bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6573.05,
    "end": 6583.259,
    "text": "We see here variational free energy decomposed into an energy minus entropy and decomposed into a complexity minus accuracy framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6585.72,
    "end": 6590.482,
    "text": " Maximizing accuracy usually results in generative models involving universal function approximators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.402,
    "end": 6603.466,
    "text": "Minimizing complexity results in organizing representations in sparse, compartmentalized and hierarchical generative models, where higher levels of a hierarchy encode more abstract representations and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6604.546,
    "end": 6609.808,
    "text": "A computationally efficient method to compare priors by their free energy is Bayesian model reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6611.052,
    "end": 6616.298,
    "text": " Free energy unifies inference and model selection under a single objective function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6619.963,
    "end": 6626.39,
    "text": "5.2.4 Scaling Active Inference Planning for all possible courses of action is computationally expensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6627.327,
    "end": 6635.512,
    "text": " One way to finesse this is by planning only for intelligently chosen subsets of action sequences using sampling algorithms like Monte Carlo tree search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6636.213,
    "end": 6641.516,
    "text": "If you're interested in that, check out the recent research on branching time active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6642.777,
    "end": 6647.76,
    "text": "Similarly, Monte Carlo sampling finesses the expectations inherent in assessing action sequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6649.028,
    "end": 6659.391,
    "text": " A complementary approach is to assess actions instead of action sequences by conditioning all future actions to be optimal in the sense that they minimize the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6660.771,
    "end": 6669.093,
    "text": "It leads to smarter agents whose computational complexity scales linearly as opposed to exponentially in the length of action sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6670.394,
    "end": 6671.294,
    "text": "Let's learn more about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6673.88,
    "end": 6678.249,
    "text": " Scalable inference methods can be used to make active inference more efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6678.991,
    "end": 6684.582,
    "text": "We can train neural networks to predict the various posterior distributions, including the posterior overactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6685.953,
    "end": 6698.556,
    "text": " While training, the output of the neural network can be used as an initial conditions for variational inference, resulting in accurate inferences whose computational costs decrease as the network learns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6699.596,
    "end": 6709.299,
    "text": "Additionally, optimizing free energy reduces to efficient message passing schemes when one imposes certain simplifying restrictions to the family of candidate distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6709.919,
    "end": 6715.46,
    "text": "Lots of really exciting work in neurobiology and statistics around message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6717.079,
    "end": 6718.221,
    "text": " Getting close to the end here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.803,
    "end": 6726.091,
    "text": "A much cheaper implementation of active inference exists for continuous states evolving in continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6727.841,
    "end": 6728.341,
    "text": " Pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6728.942,
    "end": 6729.722,
    "text": "Parr et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6729.742,
    "end": 6731.023,
    "text": "2022 textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6731.364,
    "end": 6731.704,
    "text": "Chapter 7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6732.184,
    "end": 6733.985,
    "text": "Discrete-time active inference generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6734.446,
    "end": 6734.786,
    "text": "Chapter 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6735.487,
    "end": 6738.329,
    "text": "Continuous-time active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6739.81,
    "end": 6747.956,
    "text": "This method frames perception and decision-making as variational inference by simulating a gradient flow on free energy in an extended state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6749.065,
    "end": 6755.59,
    "text": " It can be combined with discrete active inference to operate efficiently in generative models combining discrete and continuous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6756.511,
    "end": 6759.593,
    "text": "We talked about that in Livestream 46.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.714,
    "end": 6763.076,
    "text": "Active inference does not contradict folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6763.756,
    "end": 6770.562,
    "text": "Discrete active inference, decision-making active inference, DAI, and continuous time motor active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6772.805,
    "end": 6776.327,
    "text": " being used together, also seen in the Pardal textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6777.127,
    "end": 6781.169,
    "text": "As an example, high-dimensional observations in the continuous domain, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6781.249,
    "end": 6788.413,
    "text": "speech, processed through continuous active inference are converted into discrete abstract representations, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6788.633,
    "end": 6794.096,
    "text": "semantics, and we can even go further and say rhetorical and narrative information spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6795.543,
    "end": 6799.826,
    "text": " Based on these representations, the agent makes high-level categorical decisions, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6800.026,
    "end": 6805.87,
    "text": "I want to move over there, which contextualize low-level continuous actions, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6805.91,
    "end": 6808.832,
    "text": "the continuous motion of a limb towards the goal location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6810.634,
    "end": 6812.715,
    "text": "And that is how the paper ends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6813.516,
    "end": 6815.057,
    "text": "So, closing thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6815.457,
    "end": 6818.499,
    "text": "If anybody wants to write a comment live, feel free to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6819.24,
    "end": 6820.521,
    "text": "We'll be over very shortly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6821.941,
    "end": 6845.954,
    "text": " what are the implications of this work we have an open space to talk about it what questions and discussion topics are you interested in please write comments before or after the dot one and the dot two so we can have those interesting discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6847.242,
    "end": 6876.598,
    "text": " and just as a little bit of a closer I'll share some stable diffusion images that were generated using the paper title as well as various other terms free energy lots of fun images a lot of good balance to some of the technical aspects that were being described in the paper was good to look at what diffusion looks like aesthetically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6878.536,
    "end": 6900.837,
    "text": " and so that is the end of this live stream 52.0 i hope that you found it useful that you're interested to act and for serve to learn more contribute more write a comment make it happen in your own life or in your own way with this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6901.929,
    "end": 6904.75,
    "text": " honestly challenging paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6905.671,
    "end": 6921.157,
    "text": "So if you've listened this far, thanks a lot for your attention and looking forward to 51, I'm sorry, 52.1 and 0.2 when we will speak with some authors and some of you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6921.977,
    "end": 6927.96,
    "text": "So till next time, thanks again and see you in the dot one.",
    "speaker": "SPEAKER_00"
  }
]