[
  {
    "start": 8.902,
    "end": 28.898,
    "text": " hello everybody welcome to the active inference lab today it's october 22nd 2021 and it's actinflab guest stream number 11.1 i'm daniel i'm here with blue and our guest greg so greg thank you so much for being here and please introduce yourself and take it away",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.679,
    "end": 31.222,
    "text": " We'll be monitoring the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.242,
    "end": 36.45,
    "text": "So if you have any questions during the presentation, please feel free to ask them and we'll talk about them at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.551,
    "end": 40.677,
    "text": "But otherwise, thanks again for being here and looking forward to this event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.735,
    "end": 42.175,
    "text": " Wonderful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 42.415,
    "end": 44.056,
    "text": "Hey, it's a real honor to be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 45.196,
    "end": 47.917,
    "text": "I've seen a couple of other presentations that are really fascinating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.397,
    "end": 51.638,
    "text": "I look forward to sharing some of my version of reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 52.678,
    "end": 56.56,
    "text": "So let me give you a little bit of orienting coordinates for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 57.48,
    "end": 66.523,
    "text": "So I am professor in the Combined Integrated Clinical and School Doctoral Program at James Madison University, where I've been since 2003.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 68.503,
    "end": 75.369,
    "text": " The role I function there is to train individuals to be psychological doctors is the term we use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 76.17,
    "end": 81.634,
    "text": "The reason we use that is because in psychology, in the profession side, there are different practice areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 82.495,
    "end": 86.758,
    "text": "Clinical, counseling and school are the dominant practice areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 87.399,
    "end": 89.621,
    "text": "But we want to transcend those into a more professional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.941,
    "end": 102.905,
    "text": " general combined integrated perspective that affords us a way to kind of get out of some of the old traditional institutional silos and get a more general integrated picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.385,
    "end": 104.206,
    "text": "So I've been there since 2003.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 106.819,
    "end": 117.826,
    "text": " My journey in this is I went to undergrad, got my major in psychology and was just going to be a behavioral scientist that wanted to be a clinician.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.446,
    "end": 124.29,
    "text": "My sense was the right thing to do was to apply the methods and findings of science to the clinical world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.331,
    "end": 129.874,
    "text": "I went off, got my master's in clinical and community psychology in 1994.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.768,
    "end": 149.501,
    "text": " And, well, why don't I go ahead and start the presentation, and then I'll walk you through some of that history, and then we'll get to this scenario where ultimately you get this weird cartoon of a garden behind me, and we'll get to there over a period, and then we'll start into what we're actually dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 149.521,
    "end": 151.343,
    "text": "So let me share my screen here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 151.363,
    "end": 151.403,
    "text": "So...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.918,
    "end": 160.599,
    "text": " So we're talking about the ontology of mental behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.959,
    "end": 176.725,
    "text": "And just to kind of give it a context, my basic point for defining this talk is then to be in contrast to the current mainstream approach in academic psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 177.745,
    "end": 185.088,
    "text": "The mainstream approach in academic psychology is really best frame as what I would call methodological behaviorism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 186.4,
    "end": 203.899,
    "text": " Methodological behaviorism, a term by Jay Moore, but all it means is basically what is psychology in the academy right now is that it applies the methods of behavioral science to a thing very vaguely defined as behavior and mental process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 204.667,
    "end": 214.798,
    "text": " OK, and indeed, the methods of science really are what end up defining the term behavior, which is the shit you can see from a science perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 215.159,
    "end": 225.91,
    "text": "OK, and then the mental processes are sort of the stuff that's inferred that give rise to the change in behavior, at least if you're a mentalist or a cognitivist in traditional psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 226.511,
    "end": 228.453,
    "text": " as opposed to, say, a radical behaviorist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.514,
    "end": 244.246,
    "text": "So the science of psychology is really defined by an institution that applies methods of science, methods of behavioral science in particular, to analyze behavior and then develop models of mental process that afford the explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.946,
    "end": 249.09,
    "text": "Now, the structure of it is broken at the level of coherence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.37,
    "end": 254.014,
    "text": "And what I mean by that is there's no organizing framework for psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.212,
    "end": 269.157,
    "text": " Psychology is not defined by and never has been defined by a paradigm, meaning a full, in a Kuhnian sense, paradigm, meaning a full, like Newton developed a paradigm for classical mechanics that then established.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.177,
    "end": 277.98,
    "text": "Psychology is a field that had lots of different schools of thought, many paradigms that tried to manifest itself as sort of the dominant paradigm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.38,
    "end": 279.201,
    "text": "That didn't happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.221,
    "end": 279.681,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.591,
    "end": 282.712,
    "text": " There were no dominant paradigms in psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.632,
    "end": 288.353,
    "text": "It gave rise to what's called the crisis in psychology that Lev Vygotsky specifies in 1927.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 288.413,
    "end": 293.055,
    "text": "So we're talking now over almost 100 years ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.495,
    "end": 296.796,
    "text": "In fact, it was first identified in 1899, the crisis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.816,
    "end": 300.037,
    "text": "And psychology then just punts on the issue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 300.077,
    "end": 303.377,
    "text": "It's like, what do you mean by the, what's the field subject matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 303.417,
    "end": 307.038,
    "text": "And the answer is, well, different schools of thought will frame that in different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 307.579,
    "end": 307.779,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.192,
    "end": 312.995,
    "text": " The ontology of mental behavior is the argument that actually we can do better than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.115,
    "end": 317.958,
    "text": "We don't have to define the field based on epistemology, i.e.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 317.978,
    "end": 327.244,
    "text": "the methods of science, but we actually can define the field based on a scientific ontology that clarifies what is meant by mental behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 328.125,
    "end": 333.688,
    "text": "And in so doing, it affords a coherent solution to the problem of psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.392,
    "end": 342.455,
    "text": " particular conception of its subject matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.896,
    "end": 345.437,
    "text": "So that's the basic structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 347.319,
    "end": 349.921,
    "text": "Like I said, I'm at James Madison, combined, integrated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.261,
    "end": 354.504,
    "text": "So what's the basic gist, just to get a lay of the landscape from where I'm coming from?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.865,
    "end": 356.506,
    "text": "And I'm an odd bird.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.109,
    "end": 364.953,
    "text": " So we should be very clear that I've been doing a weird version of psychology now for a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 365.674,
    "end": 367.034,
    "text": "I started to say this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.134,
    "end": 369.816,
    "text": "I entered into the field sort of in a conventional sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.856,
    "end": 376.78,
    "text": "I got trained in the normal methods of behavioral science and analysis of variance and all that good stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.84,
    "end": 385.946,
    "text": "And it's like, oh, well, clearly we want to employ a standard empirical method to delineate what the sort of the truth is or the most accurate models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.066,
    "end": 390.971,
    "text": " And so but then I encountered this thing called the problem of psychotherapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.913,
    "end": 392.353,
    "text": "What's that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 392.373,
    "end": 394.276,
    "text": "You actually get into the room with people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 395.77,
    "end": 396.371,
    "text": " That's a trick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.431,
    "end": 406.678,
    "text": "And then you're a real person in a real situation in the idiosyncratic processes by which you have to make active inferences about what is operating in the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.878,
    "end": 414.683,
    "text": "OK, means that the generalized aggregate variable analysis that the rest of the field does like, oh, here's a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 414.723,
    "end": 416.224,
    "text": "It's called major depressive disorder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.684,
    "end": 420.427,
    "text": "Here's a specified intervention called cognitive therapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 420.727,
    "end": 425.21,
    "text": "And now you're to imply this cognitive therapy intervention with this person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.37,
    "end": 441.613,
    "text": " Sorry, but what I learned, and I didn't know it at the time, but what I learned was the level of abstraction at the variable aggregate level relative to the actual process by which you engage in feedback in the room in a participatory real relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.053,
    "end": 454.316,
    "text": "Of course, I have language for this now that I didn't have then, but the bottom line was, God, what I actually saw in the field was that the best of the best, regardless of the school of thought, the best of the best did the best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 455.171,
    "end": 461.874,
    "text": " Surprisingly enough, and lousy players from various all the different schools did lousy and most people did average.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 462.214,
    "end": 468.456,
    "text": "And the schools of thought really don't generate systematic difference, at least the bona fide schools of thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.816,
    "end": 473.358,
    "text": "So essentially what you get in psychotherapy is what's called the dodo bird findings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 473.998,
    "end": 485.61,
    "text": " I'm president-elect of the Society for the Exploration of Psychotherapy Integration, which is a field that has long-standing questions in relationship to the relationship between the schools of thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 486.811,
    "end": 496.221,
    "text": "And I got then introduced in 1994, this is, basically to the field through a potentially integrative perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 497.001,
    "end": 497.121,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.359,
    "end": 499.64,
    "text": " For me, that was fascinating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 500.381,
    "end": 515.753,
    "text": "It turns out that my orientation is actually what's called a big picture coherentist orientation, meaning that I actually want to zoom way back, organize pieces in a particular way so that I can create a coherent frame of reference and then zoom back in with the coherent frame of reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 515.773,
    "end": 517.515,
    "text": "That's the way my mind operates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.995,
    "end": 523.922,
    "text": " So I had zoomed out and then realized there is actually no coherence at the level of psychotherapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 524.263,
    "end": 525.885,
    "text": "And people had known this for a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 525.945,
    "end": 528.428,
    "text": "And then this whole field had emerged in the mid 1980s.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.448,
    "end": 535.957,
    "text": "This was like, you know, 15 years, 10 years down the road from that emergence of that field with the psychotherapy integration problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 537.281,
    "end": 538.842,
    "text": " And then I was fascinated by it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 539.223,
    "end": 542.645,
    "text": "And I did something that's actually no one's ever done, which is kind of interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.746,
    "end": 546.168,
    "text": "I looked at medicine and this was just all intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.588,
    "end": 552.113,
    "text": "I looked at medicine and I said, you know, you don't have all these different schools of thought in medicine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 552.153,
    "end": 553.654,
    "text": "It's not like you have, you know, the.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.894,
    "end": 567.619,
    "text": " the cardiologists are not battling with the endocrinologists versus, you know, the people that emphasize the gut, you know, they all are like, Hey, there are different systems of, you know, biological adaptation that function together in a whole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 567.679,
    "end": 570.0,
    "text": "And they, we have a thing called human biology and,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.6,
    "end": 581.522,
    "text": " Human biology is the science that organizes the various domains and that affords a descriptive explanatory framework that then should inform the practice of medicine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.022,
    "end": 599.305,
    "text": "So if we jump up a level, it seems reasonable to me, or it seemed intuitively reasonable to me, that there should be a science of human psychology that should organize the descriptive explanatory network of understanding and then apply that to the field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.512,
    "end": 600.732,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.133,
    "end": 602.353,
    "text": "So now notice what I had done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.374,
    "end": 611.14,
    "text": "I got socialized into the empirical methodological behavioral science approach of psychology, dropped into the problem of psychotherapy, backed up and was like, oh, wait a minute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 611.16,
    "end": 620.227,
    "text": "What I really need as a practitioner is I need a holistic conception of human psychology that affords clarity about what the hell the field is actually talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 620.267,
    "end": 623.35,
    "text": "Sorry, I'll probably drop an F-bomb here or there if that's OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.65,
    "end": 625.892,
    "text": "But anyway, what I basically realized was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.71,
    "end": 647.264,
    "text": " then here is i shifted perspective and i said well what is psychology and then i realized oh my god nobody knows what the psychology is there's no word that everyone's got different reference points for this fundamental word okay and that's the problem of psychology there's a dramatic set of reference points um that and so i then uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.844,
    "end": 652.167,
    "text": " I took a couple of left turns that I can tell you about in 1996 and then a big one in 1997.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 653.648,
    "end": 659.231,
    "text": "And all of a sudden, I actually developed a vision, not like some transcendent vision, although it has these elements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 660.432,
    "end": 670.118,
    "text": "I developed a picture, an organizing picture, really a new map of big history, as it were, that afforded me a new way to address this problem of what psychology is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.619,
    "end": 674.901,
    "text": "And that ultimately gives rise to a clear ontology of the mental.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 675.441,
    "end": 677.343,
    "text": " We'll specify what I mean by that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 677.683,
    "end": 689.515,
    "text": "And then by affording clarity about what the scientific conception of the mental is, I could then organize my work, then return to the original problem and develop a framework for psychotherapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 690.376,
    "end": 691.978,
    "text": "And so that's what the project is about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 693.001,
    "end": 698.604,
    "text": " Now, my journey over this time period basically is the first thing is, hey, there's a problem and I need this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 698.644,
    "end": 702.145,
    "text": "And then I built this thing called the tree of knowledge system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 702.586,
    "end": 711.19,
    "text": "The tree of knowledge system is this natural scientific ontology that maps the world in a particular way that affords a science of a natural science view of what the mental is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.537,
    "end": 714.959,
    "text": " I worked on that and said, hey, it organizes the field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 715.98,
    "end": 719.542,
    "text": "I did a, you know, I can tell about my publication history, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 720.563,
    "end": 724.546,
    "text": "And then ultimately that evolved in what's called the unified theory of psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 725.287,
    "end": 739.797,
    "text": "The unified theory of psychology specifies the tree of knowledge and then a couple of other key ideas that then provide a conceptual architecture for assimilating and integrating the schools of thought and major empirical findings into a coherent whole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.674,
    "end": 750.716,
    "text": " I'll say again, it provides a conceptual architecture for assimilating and integrating the schools of thought and the major schools of thought and major empirical findings to afford a coherent whole of the picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.497,
    "end": 756.038,
    "text": "And basically then create a new unified theory of psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 757.778,
    "end": 760.439,
    "text": "I then shifted that, I did that, I published that in 2011.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.599,
    "end": 773.1,
    "text": " I then returned to the original problem and from 2011, 2016 or so, worked out then given this framework, what would a unified approach to psychotherapy be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.475,
    "end": 783.945,
    "text": " And I then delineated four key ideas that could help organize the field and generate a unified approach to psychotherapy, at least with individual adults.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.165,
    "end": 786.127,
    "text": "OK, childs are different, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.147,
    "end": 794.395,
    "text": "I was honed in on sort of standard individual psychotherapy, especially for neurotic adults, which are the vast majority of people come in for psychotherapy or neurotic adults.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.516,
    "end": 799.578,
    "text": " So this forwards then a way to organize the key insights.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 799.618,
    "end": 805.282,
    "text": "And so then you would have a unified theory of psychology and a unified approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 807.063,
    "end": 811.806,
    "text": "Well, then in 2016, as I was delineating that, I took another weird turn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.427,
    "end": 814.948,
    "text": "And there are a lot of reasons as to why.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.849,
    "end": 822.754,
    "text": "But the short story is I was at a conference called Cultivating the Globally Sustainable Self.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.055,
    "end": 828.919,
    "text": " about transformative education and the massive global problems that we face in relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.2,
    "end": 832.201,
    "text": "And it was in the context of that conference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 833.362,
    "end": 836.485,
    "text": "I had created this model, the unified theory and unified approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.525,
    "end": 837.746,
    "text": "It was called a TUA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.246,
    "end": 838.666,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.007,
    "end": 839.267,
    "text": "That's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.287,
    "end": 840.828,
    "text": "It just dropped into the language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.848,
    "end": 842.389,
    "text": "You know, things would get more and more efficient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.409,
    "end": 845.251,
    "text": "You know, it's UT and UA and a TUA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.572,
    "end": 846.893,
    "text": "Somebody's like, what the hell is a TUA?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 846.913,
    "end": 848.574,
    "text": "And it's like, well, it's blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.4,
    "end": 866.308,
    "text": " So I'm at this conference and they're doing this talking fundamentally about how to do this thing called cultivate a globally sustainable self, meaning how do we transform our education for children in the world that we're in, given all the crises and challenges that we face?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.388,
    "end": 867.468,
    "text": "What does that actually look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 867.548,
    "end": 868.529,
    "text": "It was fascinating conference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.386,
    "end": 871.847,
    "text": " And at the end of it, there was a panel discussion, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.167,
    "end": 878.749,
    "text": "And the panel discussion actually got all the people they invited there and they came up and they actually all fumbled over the question as far as I was concerned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.789,
    "end": 879.809,
    "text": "Like they were brilliant people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 879.849,
    "end": 880.269,
    "text": "They did this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 880.309,
    "end": 882.81,
    "text": "They couldn't actually, there was a summary opportunity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.25,
    "end": 885.771,
    "text": "I left the conference and I was walking away and I was talking to somebody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.791,
    "end": 886.891,
    "text": "I was like, you know what we should do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 887.131,
    "end": 890.872,
    "text": "We should plant it to a seeds and grow it to a trees, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 891.492,
    "end": 896.814,
    "text": "And which just sort of fell out of me as a light bulb moment and then turned into the thing behind me, which is this garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 898.631,
    "end": 906.817,
    "text": " All of a sudden, I basically then transformed this build, this construction that I had with all these different sort of like a cathedral that got transformed into a garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 907.057,
    "end": 912.722,
    "text": "I actually then got called into like spiritually, artistically to build this garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 913.362,
    "end": 919.286,
    "text": " So that now this knowledge system then could be represented symbolically in a garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 919.646,
    "end": 921.407,
    "text": "And that's what's behind me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 921.748,
    "end": 923.469,
    "text": "It's a layered knowledge system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.489,
    "end": 929.253,
    "text": "So like, for example, well, I'll just, so that's, and then, you know, I got pulled more into that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 929.573,
    "end": 933.315,
    "text": "And then that shifted me further and further into the orbit of weirdness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.596,
    "end": 933.896,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.976,
    "end": 943.022,
    "text": "But anyway, that's basically what I realized fundamentally as to why I got pulled into this level of abstraction was something that I,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 943.582,
    "end": 966.662,
    "text": " sort of got clear on as i've been writing my current book and that is a real understanding fundamentally of what's going on here in relationship to kind of our knowledge system so we have a foundational problem in our knowledge and what i call and it's foundational problems called the enlightenment gap what the hell is that the enlightenment gap is the point that when science emerged okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.263,
    "end": 985.833,
    "text": " From Galileo and Newton coming off of the scholastics, when we built physical science and the epistemology and ontology that emerged with physical science, there was never an ability to take what we learned from the physical sciences and create a holistic synthetic philosophy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.394,
    "end": 987.955,
    "text": "Kant tried, Hegel tried, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.775,
    "end": 996.578,
    "text": " But what you basically get in the Enlightenment is a gap, a failure to get the proper relationships first on the relationship between matter and mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 996.598,
    "end": 997.738,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 997.838,
    "end": 999.679,
    "text": "So based mind body problem, what the hell is that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.719,
    "end": 1000.539,
    "text": "How do you actually solve that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.879,
    "end": 1008.061,
    "text": "And then the other thing that emerges as a secondary or joint problem is what is actual scientific knowledge relative to social knowledge?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.742,
    "end": 1009.062,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1009.602,
    "end": 1015.704,
    "text": "And this problem emerges, we see in the 20th century with the emergence of the philosophical postmodern critique of modernity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.837,
    "end": 1032.143,
    "text": " which basically says, hey, modernity made too many abstract, pure reason progress claims that they were actually, that you could find genuine truth that's not contextualized in a socio-historical justification context of the postmodern critique.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.443,
    "end": 1035.584,
    "text": "And actually, you can't really make knowledge claims that are transcendent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1035.804,
    "end": 1039.766,
    "text": "They're all eminently contextualized in the socio-historical context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.126,
    "end": 1042.507,
    "text": "And lo and behold, look at the way the knowledge systems emerge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.767,
    "end": 1049.489,
    "text": " privileged cisgendered white colonial men who go around and create, oh, yes, this is true reason.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.529,
    "end": 1054.892,
    "text": "And lo and behold, it's actually normative for us and we get to distribute our power structures around the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1054.932,
    "end": 1060.594,
    "text": "And so you've got a philosophical and a social justice postmodern critique about what science is relative to social knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.854,
    "end": 1062.115,
    "text": " that never actually gets resolved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.156,
    "end": 1068.66,
    "text": "That's why we have postmodern versus modern onto epistemological debates about the nature of knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1069.08,
    "end": 1081.83,
    "text": "And so the enlightenment gap basically is a description of the current state of affairs where we are lacking a philosophical framework that affords us clarity about matter and mind on the one hand and science and social knowledge on the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1084.052,
    "end": 1087.074,
    "text": "So that's the gist of the location about where we are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.877,
    "end": 1091.459,
    "text": " I built this thing called the unified theory of knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.96,
    "end": 1093.82,
    "text": "What is unified?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.14,
    "end": 1098.083,
    "text": "Unified is taken directly from the book Consilience, the Unity of Knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1098.103,
    "end": 1098.463,
    "text": "E.O.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1098.503,
    "end": 1103.326,
    "text": "Wilson wrote a book called Consilience in 1998 called the Consilience, the Unity of Knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.247,
    "end": 1105.187,
    "text": "That's what unified means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1105.207,
    "end": 1106.008,
    "text": "It means conciliant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.168,
    "end": 1114.213,
    "text": "There's a conciliant, coherent, big picture view that actually gets the pieces of the puzzle correct so we actually understand knowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.243,
    "end": 1131.786,
    "text": " And knowing how we know and knowing what we mean when we know things physically and what we know things biologically, what we actually mean psychologically, human psychologically into the social sciences, how we know scientifically relative to how do we know subjectively, what do we know about ethics, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1131.826,
    "end": 1138.448,
    "text": "There's actually a coherent synthetic philosophy that is available that frames these problems that wasn't achievable before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.569,
    "end": 1142.151,
    "text": " And so here's the garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.753,
    "end": 1149.701,
    "text": "And what it has here is, so for example, right here, this little thing's called the stepping stone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.301,
    "end": 1150.842,
    "text": "What is that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.243,
    "end": 1156.569,
    "text": "S-T-E-P-P stands for the standard theory of elementary particle physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1157.17,
    "end": 1160.932,
    "text": " And the stepping stone then grounds you in physics in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1161.372,
    "end": 1171.538,
    "text": "Then this first branch is the tree of knowledge system, the base of which is the energy information quantum field structures that live underneath matter and go back to Big Bang.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.438,
    "end": 1178.003,
    "text": " And then each one of these is a layered system of information processing called life, mind, and culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1178.644,
    "end": 1183.928,
    "text": "And it is that arrangement of energy information gives rise to a classic material field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.209,
    "end": 1185.63,
    "text": "And then life emerges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1185.71,
    "end": 1190.774,
    "text": "And then mind, and I'll explain what I mean by mind here, emerges at the animal mental behavioral level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1191.155,
    "end": 1198.962,
    "text": "And then culture emerges so that we go from primates to people as we talk to each other and build what are called systems of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.036,
    "end": 1201.657,
    "text": " So that just gives you a flavor for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.677,
    "end": 1208.539,
    "text": "There's other things that are going on here that I won't necessarily get into, but it basically says there's actually a knowledge system here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.559,
    "end": 1211.96,
    "text": "The left side is the unified theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.98,
    "end": 1217.302,
    "text": "You can see actually there's a little U here and a T, and these four ideas make up what's called the unified theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.723,
    "end": 1221.644,
    "text": "There's a U and an A, which stands for the unified approach theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.643,
    "end": 1224.804,
    "text": " This right here is a symbol of mindfulness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.484,
    "end": 1230.246,
    "text": "On the right side of the branch is the way in which we relate to people in healthy psychological ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.266,
    "end": 1232.027,
    "text": "It's actually called calm MO.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1232.067,
    "end": 1234.428,
    "text": "It's an integrative approach to psychological mindfulness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1234.968,
    "end": 1250.774,
    "text": "It's the processes by which we can hold each other in ourselves and deal with difficult socio-emotional relations that afford productive, virtuous looping, as opposed to what often happens to people as they get trapped in negative cycles, attack each other, and then get in vicious, destructive looping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.334,
    "end": 1252.255,
    "text": " That's just one example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1252.495,
    "end": 1256.639,
    "text": "So the tree then has eight key ideas, four of which make up the unified approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1257.039,
    "end": 1258.46,
    "text": "And this is, by the way, the tree of life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1258.74,
    "end": 1260.342,
    "text": "The tree of knowledge is the first branch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.622,
    "end": 1268.108,
    "text": "Tree of life has four here, four here, and then has the symbol in the middle, which is actually called the metaphysical empirical flower.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1268.948,
    "end": 1273.273,
    "text": " metaphysical empirical flower creates a dialectic between metaphysics and empiricism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1273.893,
    "end": 1277.878,
    "text": "And that was missing in the structure of the enlightenment, which we need.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.898,
    "end": 1283.204,
    "text": "This is the other thing down here called the coin, but I'll pause here just so there's plenty of structure there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1283.384,
    "end": 1285.806,
    "text": "Let me make a few more comments and then actually I'll pause after this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.127,
    "end": 1288.609,
    "text": "So ultimately what the unified theory does is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.571,
    "end": 1294.113,
    "text": " is it affords a new opportunity to think about the enlightenment gap and I argue resolve it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.313,
    "end": 1301.735,
    "text": "And what it does is it sets the stage for a unified theory of psychology and frames a unified approach to psychotherapy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.456,
    "end": 1312.499,
    "text": "So that's basically, then we can get into what does all this mean in relationship to some of the deep theory, but I wanted to give folks an opportunity for the basic gist of where I'm coming from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.226,
    "end": 1320.489,
    "text": " Thank you for the summary, cool work and symbolic images.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.389,
    "end": 1325.812,
    "text": "So anyone watching live can definitely write questions, but that's a great place to stop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.072,
    "end": 1337.2,
    "text": "We got the personal and the multi-level narrative coming together with a little bit of a challenge and a response, which we'll then learn more about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.68,
    "end": 1342.143,
    "text": "So maybe we can just go blue if you have any comments, otherwise we can go into the next section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.591,
    "end": 1346.275,
    "text": " I don't know if we want to go through some of my questions now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.395,
    "end": 1350.581,
    "text": "I mean, I have some that relate to the universal theory of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.763,
    "end": 1356.709,
    "text": "So if we want to maybe pull up that slide or if Greg is still sharing slides, we don't have to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.038,
    "end": 1379.729,
    "text": " cannot just read it off this slide so the first perfect yeah and it's on the screen as well so here's um uh one just summary quote first the the utok differentiates the mental behavior of animals from the behavior of other living creatures both metaphysically and meta theoretically which you mentioned and second it differentiates the mental behavior of human persons from the mental behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.287,
    "end": 1384.667,
    "text": " of other animals, both metaphysically and meta theoretically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.068,
    "end": 1385.268,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.288,
    "end": 1387.368,
    "text": "So similar, but a little bit different there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.388,
    "end": 1390.829,
    "text": "So what are the distinctions that are critical for psychology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.569,
    "end": 1393.729,
    "text": "What distinctions does your work make?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.889,
    "end": 1395.19,
    "text": "How do we know those are the right ones?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.63,
    "end": 1399.591,
    "text": "How did you carve UTOK at the jigsaw joints?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.471,
    "end": 1400.871,
    "text": "Beautiful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.231,
    "end": 1401.531,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1401.591,
    "end": 1402.431,
    "text": "So yeah, love that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.571,
    "end": 1406.692,
    "text": "That's a wonderful set of questions and gets right to the heart of some of the key issues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.395,
    "end": 1414.978,
    "text": " OK, so let's talk about the so the tree of knowledge divides is a descriptive metaphysical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1415.038,
    "end": 1420.76,
    "text": "That's a picture is and it shows matter, life, mind and culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1421.04,
    "end": 1423.381,
    "text": "OK, so basically coming off Big Bang.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.401,
    "end": 1426.562,
    "text": "So you start at what's called an energy information singularity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1427.642,
    "end": 1431.183,
    "text": " So you go back to Big Bang, 13.8 billion years ago, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1431.563,
    "end": 1439.985,
    "text": "You run the tape back and everything collapses into, quote unquote, a point or a singularity, because this is just general cosmology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.065,
    "end": 1444.326,
    "text": "I'm getting to the question, but I just give this background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1444.826,
    "end": 1448.847,
    "text": "So according to modern cosmology, the universe essentially begins in a state of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.187,
    "end": 1464.335,
    "text": " pure energy information that's at least what i refer to it as we can talk about the term and then out of that comes matter okay uh and basically what you get is you get all the four fundamental forces in nature that's electromagnetism gravitation strong weak",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.055,
    "end": 1467.156,
    "text": " differentiating to create fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1467.216,
    "end": 1478.319,
    "text": "And then you get a coalescence, a cooling and freezing and coalescence of energy into chunks of matter in the form of particles, atoms up into the chemicals in certain unique contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1478.599,
    "end": 1483.681,
    "text": "And then across scale that builds things like stars and galaxies and mega galaxy clusters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1484.461,
    "end": 1484.581,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.506,
    "end": 1488.127,
    "text": " So this is then our physical universe, all right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.488,
    "end": 1503.956,
    "text": "And notice what I've done, and the reason I had to say this is because one of the first things we have to note from classical mechanics is that modern physics teaches us that there's a thing beneath the classical material world called quantum field theory and the energy information singularity of Big Bang.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1505.477,
    "end": 1514.322,
    "text": "The reason that's really important because we have to understand the fundamental substance ontology of the world, which is energy information fields, not billiard balls.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1515.932,
    "end": 1519.573,
    "text": " So they were working in the initial sort of ontology is billiard ball shit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1519.993,
    "end": 1523.595,
    "text": "And it's like, no, that's actually not the ground of the universe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1523.995,
    "end": 1527.616,
    "text": "Ground of the universe is sort of like an energy information super force field theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.156,
    "end": 1528.356,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.736,
    "end": 1534.998,
    "text": "Which, by the way, for mental implications to understand the way mental structures work, it's important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.038,
    "end": 1538.119,
    "text": "It's some people like Bernardo Castro drop it all the way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.179,
    "end": 1539.12,
    "text": "Call that big mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1539.16,
    "end": 1539.88,
    "text": "I don't agree with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.22,
    "end": 1541.961,
    "text": "But fundamentally, we do want to understand that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1542.281,
    "end": 1542.421,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.288,
    "end": 1544.81,
    "text": " Then we come and we jump up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.35,
    "end": 1559.067,
    "text": "We don't know how this exactly happens, but about 4 or 3.8 billion years ago, we see the jump in the world from chemicals, complicated chemical, protein, lipid structures that somehow get jumped together, organized, and we get life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.228,
    "end": 1561.149,
    "text": "So the miracle of life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.875,
    "end": 1584.466,
    "text": " So the miracle of life then creates the jump from quasi-organizing systems that then get into fundamentally slooping into self-organized, what Deakin, Terence Deakin, calls intentional phenomena that operate across absentia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1584.486,
    "end": 1584.846,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1584.906,
    "end": 1595.013,
    "text": " OK, so intentional phenomenon, meaning that basically there is some descriptively not explanatory, but descriptively these cells behave with a goddamn purpose and they're doing shit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.273,
    "end": 1604.6,
    "text": "OK, and it somehow is that they're imagining that they have lack and then they move toward the lack like they're hungry and they and they don't want to die and they move around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1604.62,
    "end": 1608.463,
    "text": "OK, incomplete nature is Terence Deacon's analysis of this jump.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1609.599,
    "end": 1615.461,
    "text": " Well, this is really important to understand the emergence of complex adaptive dynamic systems, because that's what life is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.541,
    "end": 1633.387,
    "text": "It's a complex adaptive dynamic system that has embedded in it energy information systems that afford the capacity to pull, I'll use a slightly different call, free energy from the environment to do work to maintain its complex organization so it survives and reproduces it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.596,
    "end": 1645.57,
    "text": " And the reason I have to tell you all of that is because the ground, we need to understand the dynamic biological ground out of which then minded animals are going to emerge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.511,
    "end": 1646.671,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.11,
    "end": 1651.473,
    "text": " So that we get a natural selection operating on genetic combinations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1651.513,
    "end": 1658.018,
    "text": "And what happens, according to the unified theory, is actually you get an orthogonal dimension of activity, orthogonal to the real in some ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1658.379,
    "end": 1659.359,
    "text": "What do I mean by that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.64,
    "end": 1664.624,
    "text": "It's the subjective information processing, the epistemic information processing of a cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1665.445,
    "end": 1673.512,
    "text": "It's like the cell is actually making judgments and quasi even decisions as it engages in some kind of primitive act of inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1674.753,
    "end": 1674.993,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1676.014,
    "end": 1677.434,
    "text": "And so then that becomes the ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1677.454,
    "end": 1681.937,
    "text": "And then basically you get bacteria that are doing that for a long time and other kinds of animal kingdom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.117,
    "end": 1686.499,
    "text": "I mean, you know, algae and other kinds of produce kind of kingdom stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.299,
    "end": 1689.12,
    "text": "And then you get multicellular plants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.44,
    "end": 1689.821,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1690.441,
    "end": 1694.063,
    "text": "That afford the opportunity for what big historians call big life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1694.403,
    "end": 1697.965,
    "text": "So you get multicellular plants and you also going to get fungi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1699.185,
    "end": 1702.467,
    "text": "Mycologists study things like they do really weird stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.007,
    "end": 1703.407,
    "text": "Fungi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.688,
    "end": 1719.632,
    "text": " And then you get so you're going to get these active multicellular entities that are still the fundamentally organized and grounded and change their environment through their growth potentials within the cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1719.732,
    "end": 1724.433,
    "text": "So even things like mushrooms, what mushrooms don't do is they don't get up and walk around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1724.453,
    "end": 1725.553,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1726.213,
    "end": 1730.934,
    "text": "But what they do is they send out growth signals into particular things and then they grow in really interesting ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1731.094,
    "end": 1733.155,
    "text": "But they are confined by their boundaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1733.976,
    "end": 1734.256,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.057,
    "end": 1746.806,
    "text": "But what happens in the in the animal kingdom is a shoot off in relationship to this so that this system now becomes as a multi organizing system becomes mobile.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.907,
    "end": 1748.187,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.607,
    "end": 1762.438,
    "text": "So 700 million years ago, you're going to get then a transition into basically jellyfish like creatures that have distributed neural networks that have some degree of capacity for coordinating their behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.658,
    "end": 1765.098,
    "text": " through the distributed neural net.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1765.718,
    "end": 1768.079,
    "text": "That's the first step towards a minded animal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.159,
    "end": 1769.619,
    "text": "It's not there yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1770.179,
    "end": 1779.241,
    "text": "You then get bilateral planning with an emerging integration between the sensory motor structures, like in a planaria worm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.981,
    "end": 1787.502,
    "text": "Now, a planaria worm's got a centralized controlled center that's then distributing, and it's got bilateral movement to coordinate its movement in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.762,
    "end": 1790.823,
    "text": "Now, you're very close with a planaria worm to what I would call a minded animal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1791.721,
    "end": 1798.366,
    "text": " The final thing is that you then get the Cambrian explosion 550, 520 million years ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.766,
    "end": 1804.19,
    "text": "And in this short period of time, basically, you get a much greater complexification of the nervous system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1804.23,
    "end": 1808.193,
    "text": "You get a centralized nervous system and you get a complex active body plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1808.713,
    "end": 1815.758,
    "text": "That complex active body plan then regulates a sensory motor looping that affords the animal to get up and move around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1816.854,
    "end": 1817.134,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1817.554,
    "end": 1818.955,
    "text": "Now, that's a game changer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.095,
    "end": 1822.036,
    "text": "It moves the entire structure as a sensory motor loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.317,
    "end": 1838.443,
    "text": "And it is that division, that joint point between life, living organisms and minded animals that the tree of knowledge points to and says, hey, that Cambrian explosion thing is when minded animals blew out of living organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.743,
    "end": 1846.166,
    "text": "There's a joint point thing that's as important to understand in our big picture as the joint point between non inanimate matter and matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.117,
    "end": 1851.238,
    "text": " And it follows a very similar pattern because what you see, like with cells, what did you get?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1851.258,
    "end": 1860.161,
    "text": "You get an RNA-DNA information processing closure around a lipid with protein generation that then creates a communication network between other cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1860.881,
    "end": 1863.862,
    "text": "Well, the nervous system is very much akin to the RNA-DNA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.962,
    "end": 1865.662,
    "text": "It's a centralized control system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1866.042,
    "end": 1872.324,
    "text": "And what it does is it yokes all the cells together in a coordinated way so the animal gets to move as a whole unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1873.191,
    "end": 1880.536,
    "text": " So the sensory motor looping of animal movement then becomes a fundamental another dimension of information processing communication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1881.037,
    "end": 1885.0,
    "text": "And we get animal animal movement at working with each other in a communication network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.26,
    "end": 1887.682,
    "text": "You get the base of the mind dimension.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.382,
    "end": 1894.247,
    "text": "OK, so in the unified theory, that's and you can and then it's defined behaviorally and descriptively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1894.307,
    "end": 1899.711,
    "text": "So it's a complex active bodies moving in relationship to each other with functional outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1900.66,
    "end": 1901.26,
    "text": " That's what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.5,
    "end": 1905.422,
    "text": "So when you go and you walk your dog, your dog is exhibiting this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.482,
    "end": 1906.902,
    "text": "The insects are exhibiting this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1907.302,
    "end": 1907.702,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1908.543,
    "end": 1911.324,
    "text": "And it's called mindedness or mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1911.684,
    "end": 1915.065,
    "text": "It's the functional animal, the behavior as a whole mediated by the nervous system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.445,
    "end": 1915.745,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.945,
    "end": 1918.006,
    "text": "That produces a reliable, understandable effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1918.649,
    "end": 1925.078,
    "text": " The base of this looping I see as basic predictive processing active inference, essentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1925.699,
    "end": 1936.233,
    "text": "There's a fundamental iterative process that is regulating information energy in particular structures that theory, the meta-theoretical structure I bring to bear is called behavioral investment theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1937.056,
    "end": 1942.841,
    "text": " OK, behavioral investment theory is a meta perspective that takes together what's called energy economics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1943.341,
    "end": 1947.865,
    "text": "So you have to solve the problem of entropy and energy expenditure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.205,
    "end": 1949.906,
    "text": "So the first principle is energy economics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1950.127,
    "end": 1955.311,
    "text": "Second is evolution, the natural by natural selection and other any other things we have to add to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1955.331,
    "end": 1956.452,
    "text": "But that's the general gist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.952,
    "end": 1963.417,
    "text": "The third principle is behavioral genetics, which means the genetic the gene system is going to bias the system in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1964.018,
    "end": 1966.54,
    "text": "The fourth principle is neuro computational control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.472,
    "end": 1976.911,
    "text": " So neurocomputational control, then the processes by which we engage in neurocomputational control then is analyzed deeply by an active inference predictive processing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1977.813,
    "end": 1979.275,
    "text": " The fifth principle is learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1979.295,
    "end": 1982.638,
    "text": "And of course, then that's how a system upgrades in relationship to experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.999,
    "end": 1988.044,
    "text": "And the sixth principle is life history development, meaning depending on where the animal is in its life history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.064,
    "end": 1988.605,
    "text": "Is it young?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1989.126,
    "end": 1989.886,
    "text": "Is it adolescent?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1990.227,
    "end": 1991.428,
    "text": "Is it late life, et cetera?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.568,
    "end": 1995.853,
    "text": "Its reproductive and survival strategies are going to change based on its life history development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.993,
    "end": 1997.895,
    "text": "So those are the six principles of behavioral investment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1998.556,
    "end": 2010.384,
    "text": " And what they do then is they yoke together neuroscience and evolutionary theory and computational cognitive and, by the way, behavioral science from the vantage point of a radical behavioral position like a Skinner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.104,
    "end": 2014.306,
    "text": "This is actually I come through this Skinner, by the way, which is weird.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.771,
    "end": 2019.493,
    "text": " So Skinner actually, what Skinner does is he just sits on the outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2019.513,
    "end": 2022.374,
    "text": "He basically says, oh, it's fucking black box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.694,
    "end": 2024.054,
    "text": "It's physiology black box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.515,
    "end": 2028.856,
    "text": "But what I will track is I will track at a very fine grained analysis consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2029.377,
    "end": 2030.637,
    "text": "The animal is fucking doing something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.657,
    "end": 2031.717,
    "text": "It's got consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2031.857,
    "end": 2035.399,
    "text": "And it is the consequences that pull the animal in its behavioral investment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.619,
    "end": 2037.52,
    "text": "And I can navigate the consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.24,
    "end": 2040.962,
    "text": " As an instrument, as an engineer, he thinks like an engineer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2041.042,
    "end": 2042.163,
    "text": "He's not thinking like a theorist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2042.183,
    "end": 2043.023,
    "text": "He's really an engineer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.043,
    "end": 2044.164,
    "text": "You know, he wanted to be a poet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2044.724,
    "end": 2047.106,
    "text": "OK, but it basically fails as a poet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2047.146,
    "end": 2048.326,
    "text": "And he's like, well, what really?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2048.346,
    "end": 2051.729,
    "text": "But, you know, really, we can do a psychodynamic interpretation of what happens to him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2051.969,
    "end": 2058.213,
    "text": "But then he starts just focusing on how to control the consequences to pull investment from an animal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.653,
    "end": 2060.994,
    "text": "And so that's an exterior behavioral position.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2061.014,
    "end": 2064.317,
    "text": "And that's radical behaviorism, which, by the way, is totally different than methodological behaviorism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.377,
    "end": 2065.037,
    "text": "It's a very specific.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2065.217,
    "end": 2086.546,
    "text": " you know five percent of psychologists go this route applied behavior analysis but it's really key because we want to be able to bring the fact of the matter is the dynamic control consequential system from the outside behavioral outside is going to connect to the after active inference so somebody asks there's a question it's like hey can we connect enactment and an activism and representationalism with a behavioral selection structure",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.846,
    "end": 2087.286,
    "text": " Fuck yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.707,
    "end": 2088.227,
    "text": "Yeah, you can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2088.247,
    "end": 2089.007,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.408,
    "end": 2091.349,
    "text": "So anyway, that's behavioral investment theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2091.369,
    "end": 2100.595,
    "text": "And what that does is it takes you from basic, the Cambrian explosion in crabs all the way up, although everything's changing, but you can go all the way up to primates following this line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.775,
    "end": 2102.556,
    "text": "And that's the dimension of mindedness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.896,
    "end": 2110.561,
    "text": "We can talk about the stack, but behavioral investment theory tracks that stacking, the evolution of mind-brain behavior in the animal kingdom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.882,
    "end": 2114.464,
    "text": "It's called mind as a capital M as really an introduction of a particular term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.484,
    "end": 2115.845,
    "text": "And that's the first joint point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2116.385,
    "end": 2120.826,
    "text": " And so the descriptive metaphysics and ontology is, oh, here's the set of mental behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2121.166,
    "end": 2123.786,
    "text": "The meta theory is behavioral investment theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.087,
    "end": 2128.167,
    "text": "And that goes then from organisms into animal mental behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.547,
    "end": 2131.268,
    "text": "And it's a joint point that people fail to see too often.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.808,
    "end": 2136.169,
    "text": "So I'll stop there and say, this is then the ground of mental behavior is we've set up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2136.229,
    "end": 2138.029,
    "text": "And then we'll go all the way up through the animal kingdom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.049,
    "end": 2143.07,
    "text": "And then we'll jump into the human primate to become a person and what that does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2143.65,
    "end": 2146.011,
    "text": "And then finally, we actually got to come back and actually talk about the psyche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2146.835,
    "end": 2149.016,
    "text": " The whole nother, the whole nother set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.056,
    "end": 2162.26,
    "text": "So, so just to clarify here, like you're, you're presenting two things as central and kind of required for mind with a capital M and those are mobility and a central nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.46,
    "end": 2162.94,
    "text": "Is that correct?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.618,
    "end": 2163.838,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2163.878,
    "end": 2171.0,
    "text": "It's really it's a complex active body with a central nervous system that ties up a motor system and a sensory system together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.28,
    "end": 2175.841,
    "text": "There's interesting analysis of evolution about how you get a sensory system and a motor system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2175.881,
    "end": 2177.561,
    "text": "How do they actually evolve when they come together?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2177.981,
    "end": 2186.763,
    "text": "So it's when you have an exemplar of a minded animal is a complex centralized nervous system sent active body that produce a functional effect on the animal environment relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2187.588,
    "end": 2191.774,
    "text": " Well, so how do you rectify things like people who are paralyzed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.894,
    "end": 2194.018,
    "text": "Are they then mindless because they're not mobile?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.904,
    "end": 2195.464,
    "text": " Oh, of course not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2195.545,
    "end": 2196.885,
    "text": "So then we need a little dialogue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.945,
    "end": 2197.346,
    "text": "Exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.406,
    "end": 2200.528,
    "text": "So so now we're in dialogue about the different domains of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.988,
    "end": 2205.131,
    "text": "OK, so ultimately we'll take somebody like, you know, Stephen Hawking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.311,
    "end": 2209.694,
    "text": "OK, so Stephen Hawking had an entire shell of existence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2210.014,
    "end": 2210.215,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.055,
    "end": 2218.06,
    "text": "Through the mediation of the sensory motor control system on the behavioral external to Lou Gehrig's disease, unplugs that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2219.123,
    "end": 2220.104,
    "text": " What a nightmare, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2220.364,
    "end": 2223.065,
    "text": "And then you get what he then experiences, what's called mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2223.465,
    "end": 2225.987,
    "text": "He still has, in my language, we can get to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2226.187,
    "end": 2231.93,
    "text": "Mind one is inside the organism, the neurocomputational layering and the modeling inside the organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.97,
    "end": 2235.771,
    "text": "It's called mind one, and that's the neurocomputational structure, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2235.992,
    "end": 2242.815,
    "text": "If you mind one A is the inside, mind one B is the mediated by the sensory motor looping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2243.871,
    "end": 2244.151,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2244.672,
    "end": 2250.858,
    "text": "So definitely you then, the entire definition in the large scale of what the exemplar is, is the sensory motor loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2251.418,
    "end": 2257.564,
    "text": "But obviously then what happens is what's called mind 1A is the neurocognitive infrastructure within the nervous system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2257.584,
    "end": 2258.825,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2258.905,
    "end": 2265.151,
    "text": "Versus mind 1B, which is the actual observable from the exterior mediated by the muscle movements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2265.592,
    "end": 2268.855,
    "text": "So what happens with people that would get this is mind 1B gets X'd.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.147,
    "end": 2272.028,
    "text": " But mind 1A, the architecture is still there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.309,
    "end": 2276.892,
    "text": "Now, if we now jump up to humans, they have what's called mind 2, like other primates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2276.952,
    "end": 2278.633,
    "text": "And we can argue how far it goes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.833,
    "end": 2281.815,
    "text": "Mind 2 is called subjective conscious experience of being.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.255,
    "end": 2286.078,
    "text": "This is first for the heart, trauma, consciousness, the first person experience of being.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.558,
    "end": 2289.82,
    "text": "Mind 1 gives rise to, and we can dialogue about this, mind 2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.541,
    "end": 2295.024,
    "text": "Mind 2 is available from the inside, subjective conscious experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2295.564,
    "end": 2299.447,
    "text": "And then mind 3 is the justifying mind, which other animals don't have, but humans do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.227,
    "end": 2300.467,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.108,
    "end": 2313.137,
    "text": "And then we created informational interface with Stephen Hawking so that he kept after his entire system got shut down, instead of locking him in, we were able to create a verbal interface so we can maintain contact with his brilliant mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2313.337,
    "end": 2319.041,
    "text": "And he could tell us about, hey, actually, I don't think the information is lost in black holes and I can actually even do the analysis of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2320.117,
    "end": 2322.199,
    "text": " OK, but if we didn't have that interface, he would have been lost.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.639,
    "end": 2332.889,
    "text": "But we would have known that, yes, he would have had mind 1A, the inside information architecture, mind 2, the first person experience of being, and mind 3A, which is the internal narrator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.37,
    "end": 2336.933,
    "text": "But he would have lost mind 3B, which is what I'm doing right now, talking to you publicly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2337.313,
    "end": 2342.078,
    "text": "But thankfully, we maintained his information interface and maintained contact with his great mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2344.329,
    "end": 2345.009,
    "text": " Thank you, Greg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.33,
    "end": 2355.256,
    "text": "So I just want to kind of recap two points and just maybe show a little point of contact with what you mentioned in some of the big themes in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.856,
    "end": 2363.541,
    "text": "So first, you mentioned how there was these abstractions and mean field approximations in the clinical field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.981,
    "end": 2364.442,
    "text": "And so that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.282,
    "end": 2373.548,
    "text": " didn't, that was like speaking to a disconnect between theory and application and practice and making impact on the systems that people care about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.908,
    "end": 2385.177,
    "text": "And then also to the more deeper physical question about mean field approximations and whether you can study like the trajectory of one particle versus just take the time average, the space average.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.657,
    "end": 2392.362,
    "text": "We're not going to go into the whole ergodicity, non-equilibrium, steady state definition, but those are key terms for active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.382,
    "end": 2394.544,
    "text": "So they come into play with that difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.584,
    "end": 2394.704,
    "text": "Like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.284,
    "end": 2400.645,
    "text": " I don't have mastery around the active inference meaning of a lot of those terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.665,
    "end": 2403.246,
    "text": "So I need to be brought up to speed on some of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2403.626,
    "end": 2404.726,
    "text": "But it's exactly that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.846,
    "end": 2409.147,
    "text": "If someone says, well, you know, the machine in the mean field, it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.747,
    "end": 2411.687,
    "text": "But what if one in a hundred fail catastrophically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.767,
    "end": 2414.188,
    "text": "Then is that an approach that works, for example?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.528,
    "end": 2416.288,
    "text": "So we've seen that come up in some machine learning context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.308,
    "end": 2421.609,
    "text": "So that was kind of a cool showing how that idea of the particular trajectory works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.809,
    "end": 2431.751,
    "text": " versus the mean field and how that plays out in the way that our knowledge and application systems, healthcare systems are constructed, which is a niche modification through us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.591,
    "end": 2445.354,
    "text": "And then, so then the second one was like that combination of appeal to general frameworks, universals, and the historical trajectory of the whole system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.794,
    "end": 2474.732,
    "text": " horizon of life on earth and of course our developmental trajectory as psychological individuals so then it's like well that looks goal oriented a lot i thought goal orientation had to be purged well i mean the first easy answer is just that was a period of disinformation and that that stance is simply incorrect so that's one way to simplify the debate but then the other maybe longer answer you said it's energy information fields not billiards",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.592,
    "end": 2480.676,
    "text": " So we don't appeal to anything when we see diffusion and ink diffusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.277,
    "end": 2490.484,
    "text": "Now that's kind of slam dunk, but are there diffusion processes for metabolism, strategy, narrative, communication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.865,
    "end": 2496.029,
    "text": "So why don't we need anything more to just allow those flows to also happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.109,
    "end": 2500.353,
    "text": "And so in Act-Inf, we talk a lot about those types of models as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.993,
    "end": 2502.815,
    "text": " So it's totally a lot of cool areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.055,
    "end": 2503.316,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.636,
    "end": 2503.896,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.056,
    "end": 2504.597,
    "text": "First section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.657,
    "end": 2504.917,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.218,
    "end": 2505.418,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.438,
    "end": 2511.985,
    "text": "So, and the tree of knowledge is both continuous or allows for full deflation on the one hand or reductive continuity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.749,
    "end": 2514.471,
    "text": " into energy information on the one hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.812,
    "end": 2519.717,
    "text": "And then if you look at it, it's actually discontinuous, dramatically so, in its funnels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.358,
    "end": 2522.68,
    "text": "So matter, life, mind, and culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.101,
    "end": 2525.523,
    "text": "And so there's a profound discontinuity as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.803,
    "end": 2533.432,
    "text": "And it is the process by, if we really want to get at this, it's the process by understanding this very complicated dynamic of continuity and discontinuity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2533.792,
    "end": 2544.801,
    "text": " And the unified theory affords a particular way to understand the discontinuity of matter out of energy, life out of matter, mind out of life, and culture out of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.541,
    "end": 2551.206,
    "text": "And so, yeah, but the reason when I heard Carl's, you know, especially free energy stuff,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.137,
    "end": 2554.999,
    "text": " although I still am trying to wrap my head around all the terminology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2555.039,
    "end": 2557.12,
    "text": "I haven't devoted myself to really uncovering it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2558.1,
    "end": 2562.182,
    "text": "But the tree of knowledge basically is a depiction of negentropic curvature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.683,
    "end": 2565.904,
    "text": "And then the question is, how does a system pull",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.325,
    "end": 2570.369,
    "text": " how to via tracking forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2570.449,
    "end": 2572.892,
    "text": "It actually functions to track forms and make predictions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.932,
    "end": 2582.384,
    "text": "And it's got to create anticipatory structures that both navigate the dialectic of stability and plasticity to pull free energy into the structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2582.464,
    "end": 2584.927,
    "text": "And I use that term more in an Eric liaison way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2584.967,
    "end": 2586.729,
    "text": "He's a cosmic evolutionary biologist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.069,
    "end": 2592.612,
    "text": " I mean, a cosmologist and talks about the evolution of mega entropy through a free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2593.833,
    "end": 2602.357,
    "text": "And because I learned that first, and then I was, I've been entangled some with some of the confusion on at least classic Carl Friston's free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.637,
    "end": 2604.338,
    "text": "But anyway, it's, it's very close.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2604.398,
    "end": 2609.441,
    "text": "I mean, I just, I'm sure it's just a technical set of terms I need to download to be clear about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2610.081,
    "end": 2610.281,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.889,
    "end": 2620.278,
    "text": " We and many others, including anyone who listens to this, are part of the sensemaking and we're working on a participatory ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.318,
    "end": 2626.404,
    "text": "There's a lot more to say, but let me just give one free energy answer and then maybe let's dive back to a presentation of yours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.345,
    "end": 2632.911,
    "text": "So to return to this idea of energy and information fields being primary, not billiards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.732,
    "end": 2654.794,
    "text": " So in a world where matter energy is heterogeneously distributed, some is in stars, some is in interstellar space or whatever, systems that resist dissipation, what we use the blanket terminology to discuss, Markov blanket, systems that reduce dissipation and have a non-death equilibrium stationary state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.814,
    "end": 2654.975,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.555,
    "end": 2670.328,
    "text": " Those systems are at least acting as if they're trying, which in complex symbolic ecosystems means anticipatory predictive behavior, anticipatory predictive signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.189,
    "end": 2678.615,
    "text": "And therefore, it's helpful to have a action loop model, perception, cognition, action, niche impact model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.522,
    "end": 2692.189,
    "text": " It's helpful to have that type of model, which is in the pre-active inference work of Carl Frist and others also central, the dynamical equations and stochastic simulations and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.229,
    "end": 2697.292,
    "text": "So there's a lot to say, but we all hope to be resolving that uncertainty in the coming years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.133,
    "end": 2698.333,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2698.373,
    "end": 2700.434,
    "text": "I'll pop into where I'm coming from on this real fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.454,
    "end": 2702.855,
    "text": "I'll share a screen, go to a different... Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.015,
    "end": 2703.396,
    "text": "There's a...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.855,
    "end": 2706.857,
    "text": " I need to go here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.877,
    "end": 2711.442,
    "text": "Hold on one second, because I wanted to pull this up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.462,
    "end": 2716.328,
    "text": "And did I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2716.908,
    "end": 2717.989,
    "text": "Maybe I closed it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.27,
    "end": 2718.55,
    "text": "Oh, well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.89,
    "end": 2722.694,
    "text": "Yeah, I'll take a second here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.775,
    "end": 2723.175,
    "text": "One second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2723.595,
    "end": 2724.436,
    "text": "Let me just look at this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.456,
    "end": 2725.918,
    "text": "I thought for sure I had it up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2743.263,
    "end": 2743.523,
    "text": " Sure."
  },
  {
    "start": 2743.823,
    "end": 2744.784,
    "text": "Reset your priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.705,
    "end": 2745.985,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.886,
    "end": 2749.427,
    "text": "Hold on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.988,
    "end": 2752.15,
    "text": "This is more complicated than normal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.25,
    "end": 2753.391,
    "text": "Let me see if I got it right here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.951,
    "end": 2754.191,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.211,
    "end": 2761.297,
    "text": "If I go here and then... One other short thought while you're... Okay, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.166,
    "end": 2769.569,
    "text": " I'm going to just close that down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2769.67,
    "end": 2770.151,
    "text": "One second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.191,
    "end": 2770.652,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.792,
    "end": 2771.032,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.053,
    "end": 2771.413,
    "text": "Take your time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.433,
    "end": 2772.616,
    "text": "Just one other short thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.656,
    "end": 2774.239,
    "text": "Blue, do you want to say anything first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.874,
    "end": 2778.635,
    "text": " Okay, Tinbergen's questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.775,
    "end": 2786.458,
    "text": "So part of a pluralistic approach towards understanding includes mechanistic and historical answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.478,
    "end": 2801.484,
    "text": "And so the way that you situated this in the sort of ecological critique and the socio-ecological critique, the relativist, and not just like nihilist, like relativist things are relational, it's interactions all the way down rather than particles all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.504,
    "end": 2801.564,
    "text": "So-",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.964,
    "end": 2828.187,
    "text": " that and the dialectical tradition as well so many interesting threads so appreciate how you concisely discussed that great um yeah and i'm happy to pick that up sorry for my clumsiness here but this is so here we go in terms of the a basic structure that you will recognize um so here's the i came at this for what's called perceptual control theory i don't know if you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2828.787,
    "end": 2829.368,
    "text": " Not too many.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.929,
    "end": 2835.054,
    "text": "It's underdeveloped relative to, at least in my field, clinical psych really doesn't pay any attention to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2835.395,
    "end": 2836.736,
    "text": "Well, William W.T.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2836.796,
    "end": 2838.918,
    "text": "Powers developed perceptual control theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.279,
    "end": 2841.021,
    "text": "It comes off the old cybernetic tradition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2841.241,
    "end": 2845.125,
    "text": "OK, and a lot of this will feel similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.165,
    "end": 2847.228,
    "text": "But anyway, behavioral investment theory, then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2847.708,
    "end": 2872.007,
    "text": " evolves in from a perceptual control theory model which i see is very very much in line and essentially what you're doing here this is the basic schematic i don't get in i'm not well versed in mathematics my son's a math major he teased me all the time i can't even goddamn do have differential equations which is to my shame but whatever it is part of my reality um the bottom line is is here's the basic schematic okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2872.287,
    "end": 2883.718,
    "text": " So you get salient control variables, you get an input transduction function, then you're going to create a model perception that's going to create a valence valuing structure that's an energizing action in return.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2884.419,
    "end": 2889.224,
    "text": "So this basic loop is the loop that I've been operating off of, and basically it's an active inference function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2889.844,
    "end": 2898.23,
    "text": " control loop in, you know, not without getting under the hood of the neuro computational specifics about how things are set in terms of its sensitivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2898.891,
    "end": 2905.816,
    "text": "But you can follow this at a more sort of psychologically higher level of organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.436,
    "end": 2908.978,
    "text": "So that's what I just wanted to show is that it's that the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2909.278,
    "end": 2916.581,
    "text": " The ground of behavioral investment theory is this perception action calibrating loop structure that functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2916.661,
    "end": 2926.766,
    "text": "An example in perceptual control theory is you create an image of an ideal egg, and then you run through a bunch of sub-goals in relationship to reducing discrepancy towards that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.046,
    "end": 2929.727,
    "text": "You're having emotional reactions in relationship to whether or not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.967,
    "end": 2933.83,
    "text": " you're achieving the efficiency of those goals in expected timeframes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.151,
    "end": 2941.477,
    "text": "As long as you're not getting surprised and in the constraints and moving in the right direction, you're getting jolted with positive affect and continue to the investment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2941.957,
    "end": 2954.488,
    "text": "If all of a sudden, you break the egg the wrong way, you overcook it, there's no eggs in the fridge, they can interrupt the structure, you get negative activation of affect, and then that reboots a possible new behavioral investment path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.235,
    "end": 2959.977,
    "text": " So anyway, just in terms of sort of the basic architecture of that structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.298,
    "end": 2966.2,
    "text": "That's actually a perfect short section, so thanks for making that clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.28,
    "end": 2967.941,
    "text": "Let's get the Act-Inf loop up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.641,
    "end": 2974.124,
    "text": "So I'll mention two points of contact with Act-Inf and the loop that you described, and then Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.904,
    "end": 2980.967,
    "text": "So the first one is that in Act-Inf, the preferences are over sensory outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.915,
    "end": 2991.822,
    "text": " So that's very much, and I don't know which, if we had a unified knowledge management system theory of knowledge, then we could search through which discussions we discussed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.902,
    "end": 2996.946,
    "text": "But perceptual control theory did come up because preferences are over sensory outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.526,
    "end": 3005.051,
    "text": "So they're not over hidden states of the world, which are inferred using latent Bayesian models, but the preferences are over sensory outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.191,
    "end": 3007.213,
    "text": "So that relates very well to the embodied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.893,
    "end": 3018.345,
    "text": " And then another just key point of contact, which in the Bayesian space, it might not feel like this is a major thing, but relative to the development of ideas, it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.885,
    "end": 3022.029,
    "text": "And that's related to the experience is perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.07,
    "end": 3025.412,
    "text": " And the experience of perception is generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.072,
    "end": 3043.546,
    "text": "So like Anil Seth's Being You new book, summarizing it as well as many other approaches, like we're experiencing the generative half, not the sensory incoming half, which is the total signal processing info out there model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.306,
    "end": 3044.527,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.848,
    "end": 3045.968,
    "text": "Amen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.988,
    "end": 3046.108,
    "text": "Amen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.451,
    "end": 3048.332,
    "text": " Yeah, that's all part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.352,
    "end": 3055.197,
    "text": "So I have, in terms of my own, I don't know if you guys know John Vervaeke's work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3055.257,
    "end": 3056.637,
    "text": "I don't know if his work has come up at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3057.398,
    "end": 3059.299,
    "text": "So me and John have completely synced up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3059.599,
    "end": 3061.18,
    "text": "We found each other 18 months ago or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.634,
    "end": 3077.889,
    "text": " And he built, you know, cognitive science and philosophy built what's called recursive relevance realization as a core structure that builds right into predictive processing, you know, and then the, what level that like, then that becomes really refined in terms of the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3078.289,
    "end": 3078.67,
    "text": " difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3078.73,
    "end": 3080.411,
    "text": "And I certainly get John here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.431,
    "end": 3081.512,
    "text": "If he's got time, he's really busy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3081.852,
    "end": 3093.162,
    "text": "But the bottom line is that John's recursive relevance realization model, meta theory of cognition, and his taxonomy of knowing, and he's got four peers of knowing, are now completely synced up with the unified Utah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3093.942,
    "end": 3100.726,
    "text": " We did three different video series, one on consciousness, one on the self, and one on human transformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.466,
    "end": 3109.41,
    "text": "The last with Zach Stein, who's a developmental metapsychologist, educational metapsychologist, expert in transformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.87,
    "end": 3116.695,
    "text": " So anyway, these systems now are affording all sorts of productive interplay in relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3116.735,
    "end": 3118.777,
    "text": "So they now and it's a hand in glove relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3118.977,
    "end": 3122.059,
    "text": "I mean, he comes out of cognitive science and an activism and philosophy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.099,
    "end": 3130.326,
    "text": "I'm coming out of psychotherapy and clinical psychology into the science of psychology and really from a behavioral and evolutionary perspective as I got dropped in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.106,
    "end": 3134.689,
    "text": " Neo-behavioralism really is where my training is in its roots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.629,
    "end": 3140.633,
    "text": "So anyway, and then you get, so you get an activism there, you know, and his stuff connects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.993,
    "end": 3144.255,
    "text": "So there's a real matrix of connection that's actually operating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.717,
    "end": 3146.877,
    "text": "Luke?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.377,
    "end": 3155.159,
    "text": " It's like a perfect flow into the question that I had related to both active inference and an activism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.82,
    "end": 3168.764,
    "text": "So one of the like fundamental things that active inference does it kind of unifies this inactive embodied approach, as well as representationalist approaches like where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.544,
    "end": 3179.331,
    "text": " you know, there's mental representation centered around mental representation through this like action perception loop, which is essentially behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.351,
    "end": 3180.352,
    "text": "I mean, in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.372,
    "end": 3197.323,
    "text": "And so I just was wondering what has active inference been fitted to like this unification of mentalist and structuralist and behaviorist approaches, or do you think that that would be an appropriate way to leverage active inference or how else could it maybe be used in your work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.561,
    "end": 3203.308,
    "text": " Well, yeah, no, that's exactly... So I totally see that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3203.448,
    "end": 3206.993,
    "text": "I totally see it as the representational and an activism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3207.013,
    "end": 3209.237,
    "text": "In fact, John and I, I'm fine with representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.277,
    "end": 3213.223,
    "text": "John likes modeling as a better term rather than representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.243,
    "end": 3213.583,
    "text": "He's a little...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3214.685,
    "end": 3236.048,
    "text": " he wonders a little bit about some of the history of that term you know it's got it's one of the classic terms that means all this different things but at a generic level i'm totally fine with term representation uh and indeed i'm sort of a neo-behaviorist coming off an old cognitive simplistic cybernetic model which is basically all representation you've got a mentalist model of representation and then you're mapping the world cognitive maps from you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3236.668,
    "end": 3238.349,
    "text": " Tolman, all the way back to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.809,
    "end": 3245.291,
    "text": "So for me, that bridging is very clear and necessary and brilliant and beautiful that an active inference does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3246.131,
    "end": 3252.313,
    "text": "And it's just one of the network possibilities of different kinds of schools of thought that are afforded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3252.413,
    "end": 3259.656,
    "text": "And the unified theory, basically, what I focus on essentially is the class of cognitive approaches weakly defined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.156,
    "end": 3262.757,
    "text": "And then really the thorn in my side was Skinner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.777,
    "end": 3263.417,
    "text": "I was like, hello.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3263.737,
    "end": 3264.738,
    "text": " He gets Skinner over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3264.758,
    "end": 3265.378,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3265.738,
    "end": 3267.219,
    "text": "And at first I just asked him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.239,
    "end": 3274.824,
    "text": "I was like, you know, he totally negates the agent and information processing from the within in a totally unacceptable way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3275.104,
    "end": 3277.086,
    "text": "And therefore, his philosophy of Ryan is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3277.346,
    "end": 3278.967,
    "text": "After all, Trump's killed him anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.687,
    "end": 3280.908,
    "text": "So that was my justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3280.948,
    "end": 3282.689,
    "text": "Then I actually learned what Skinner was trying to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3282.769,
    "end": 3284.611,
    "text": "I agree with everything I've just said, by the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3284.951,
    "end": 3287.833,
    "text": "But it was also the case that Skinner was also onto an angle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.756,
    "end": 3294.065,
    "text": " that ultimately sits in psychology as the fundamental mental behavioral kind of schism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3295.208,
    "end": 3297.573,
    "text": "And ultimately the articulation of mental behavior as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.12,
    "end": 3307.026,
    "text": " The ontology of mental behavior is the way in which you conceptually resolve the underlying disputes in that structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.046,
    "end": 3307.666,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.006,
    "end": 3310.608,
    "text": "So my basic point is, yeah, 100 percent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.668,
    "end": 3319.513,
    "text": "We can actually weave all of these schools together now and afford a link, a sinking, a synergistic linking with coherence that was never afforded before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.773,
    "end": 3323.816,
    "text": "And obviously, active inference doing that with representationalism and an activism is great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3324.117,
    "end": 3324.999,
    "text": " It's a piece of the puzzle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3325.059,
    "end": 3325.801,
    "text": "We can now sync that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3326.042,
    "end": 3328.81,
    "text": "Now that I'm synced in with John, this thing all loops back around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.83,
    "end": 3331.176,
    "text": "I'm telling you, this thing's about ready to blow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3333.066,
    "end": 3336.908,
    "text": " We have too many people in the active inference field that are also modelers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.248,
    "end": 3348.495,
    "text": "So representationalism is a useful term as opposed to modeling because modeling is like what I do to make diagrams of representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.515,
    "end": 3350.696,
    "text": "I don't have a problem with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.716,
    "end": 3353.998,
    "text": "I live in my representations and my models and they hang out fine together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3358.559,
    "end": 3382.21,
    "text": " a lot of a lot of things i wrote down just want to give one point of difference between the perceptual control theory and active inference and maybe some of these other approaches because i understand that those are commonly used or at least known so if someone came to the you know department of xyz and said you all know perceptual control theory perhaps so um missing in that loop was the whole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.03,
    "end": 3386.053,
    "text": " machine learning type work of policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.473,
    "end": 3394.02,
    "text": "It just went from basically like this to inference and then emotion, but it's not just about how you felt when you looked in the fridge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.62,
    "end": 3400.085,
    "text": "It's about the multi-joint, mostly sub-personal, sub-experiential components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3400.826,
    "end": 3404.569,
    "text": "And that's what actually provides the kind of broad shoulder that connects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.45,
    "end": 3418.558,
    "text": " cognition across life and maybe even non-life gives a continuity to ground it in reduction of uncertainty conditioned on policy, which is what active formalisms are about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.378,
    "end": 3427.663,
    "text": "And there's a lot of awesome diagrams and prose and theory that's built up in the qualitative fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.264,
    "end": 3430.485,
    "text": "And now we have new tools and new approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.606,
    "end": 3431.866,
    "text": "Love it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.681,
    "end": 3439.756,
    "text": " there's some questions in the chat or you can perhaps present any more slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.084,
    "end": 3448.447,
    "text": " Well, I'll at least just tell the rest of the story in terms of what we're... So now we've gotten to minded animals, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.467,
    "end": 3457.471,
    "text": "Complex active bodies running around after the Cambrian explosion, and they're engaged in the sensory motor looping, battling with each other for territory control, et cetera, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3457.932,
    "end": 3459.752,
    "text": "Then we can... I'll be happy to stack that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3459.872,
    "end": 3465.115,
    "text": "I basically say that we started off in the planaria where these reactive animals, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3465.555,
    "end": 3467.957,
    "text": " And then you get into real learning animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3469.098,
    "end": 3476.703,
    "text": "And I believe that in the Cambrian, which are these dynamic feedback structures that are a lot more sophisticated and they engage in operant shaping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3477.443,
    "end": 3487.731,
    "text": "Good book, which is I think right here, that I recommend, The Evolution of the Sensitive Soul by Ginsberg and Jablanka.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3488.291,
    "end": 3495.076,
    "text": "It basically explores the evolution of that nervous system and what they call basically a flexible learning operant system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3495.356,
    "end": 3496.958,
    "text": " that comes out of the Cambrian explosion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3497.418,
    "end": 3500.481,
    "text": "It's on whether or not consciousness gets a grip in that term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3500.641,
    "end": 3503.124,
    "text": "Meaning when I say consciousness, I mean mine too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3503.504,
    "end": 3508.549,
    "text": "That's the phenomenal, that's the Nagel's experience of what it is like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.47,
    "end": 3511.712,
    "text": "And basically from my vantage point, you get pleasure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3512.212,
    "end": 3518.934,
    "text": " sensory pleasure, pain, you know, jolts as the first kind of what John and I call valence qualia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.314,
    "end": 3519.694,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.774,
    "end": 3521.654,
    "text": "Probably are the first sets of mind too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.075,
    "end": 3525.856,
    "text": "And I'm an early mind tour, which says, yeah, maybe even down to insects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3526.176,
    "end": 3527.256,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3527.536,
    "end": 3528.616,
    "text": "But that's a huge debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3529.216,
    "end": 3531.617,
    "text": "We then climb up the structure of the brain and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.897,
    "end": 3535.219,
    "text": " And then get into a much more extended inner life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3535.859,
    "end": 3543.263,
    "text": "And I certainly think by the time we have crows and other mammals and things like that, you get a rich mind to inner perceptual field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3544.604,
    "end": 3550.167,
    "text": "And then I track that into primates and you get, you know, you can defer, you get real relational dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3550.187,
    "end": 3552.609,
    "text": "This was a question that came about, well, what about relation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3552.749,
    "end": 3553.609,
    "text": "And we'll talk about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3554.149,
    "end": 3556.491,
    "text": "But you get relational dynamics with parenting first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.031,
    "end": 3558.592,
    "text": " And then you get a parent in a mammal system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.632,
    "end": 3564.437,
    "text": "You get a parenting attachment system where you're doing self-other modeling and care around another in a long-term relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3564.777,
    "end": 3566.438,
    "text": "And the attachment system comes online.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3567.239,
    "end": 3568.239,
    "text": "And then you get social animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3568.28,
    "end": 3569.881,
    "text": "You get competition and cooperation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3570.321,
    "end": 3572.583,
    "text": "And you get this really rich social primate field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3573.704,
    "end": 3584.592,
    "text": "And then I do Tomasello's work on the emergence of a real implicit intersubjective we space field where there's actual capacity for massive, flexible modeling of the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3584.972,
    "end": 3587.573,
    "text": " in mind reading, shared attention, intention, space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3587.793,
    "end": 3598.015,
    "text": "This is about 500,000 million years ago when we're, you know, pre fully verbal, you know, prominence running around coordinating to kill mammoths and shit like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3598.236,
    "end": 3599.196,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3599.376,
    "end": 3601.476,
    "text": "And so that it's, and it's qualitative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3601.516,
    "end": 3603.577,
    "text": "We're a unique great ape at that time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3604.117,
    "end": 3625.169,
    "text": " because of our implicit group shared attention all of a sudden we can actually like work together to create a coordinated shared community felt sense of what we're doing together this is pre-linguistic and then but what it does is it creates a shared mind space for symbolic tagging okay that's what happens first and music is probably happening etc although that's a good question about when",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3626.502,
    "end": 3629.844,
    "text": " And so now the unified theory picks this up at this stage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3630.525,
    "end": 3632.686,
    "text": "So those are all the other great work that other theorists are doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3633.067,
    "end": 3638.67,
    "text": "And then it says, well, you get symbolic tagging, okay, antelope there, and you're coordinating the group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3638.89,
    "end": 3645.155,
    "text": "And that's all very intense, requires a lot of definitely high cognitive stuff that's probably pressing the evolution of the brain in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3645.655,
    "end": 3654.077,
    "text": " The argument basically is 200,000 years ago, probably, and we'll see if this gets pushed back, but certainly by 50,000 years ago, and this is the window here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3654.417,
    "end": 3663.419,
    "text": "It's a fundamental shift in symbolic communication from a broken symbolic system into a symbolic syntactical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3663.479,
    "end": 3674.501,
    "text": "Basically, a Chomskyian language acquisition device, at least in the weak version of that, that then affords the capacity to place nouns, verbs, and subjects and objects in a propositional statement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3676.103,
    "end": 3679.966,
    "text": " This is a game changer, a proposition, according to unified theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.546,
    "end": 3680.846,
    "text": "Why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.866,
    "end": 3683.268,
    "text": "Because actually a proposition then is a claim.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.628,
    "end": 3687.011,
    "text": "It's a propositional claim about a truth statement on the one hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3687.191,
    "end": 3689.073,
    "text": "So the antelope are over there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3690.634,
    "end": 3700.181,
    "text": "The antelope are over there then organizes a particular truth claim that opens up the possibility for a counterfactual negative space in a radically different way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3700.942,
    "end": 3701.582,
    "text": "No, they're not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3703.264,
    "end": 3704.785,
    "text": "Those are gazelle, not antelope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3705.798,
    "end": 3710.702,
    "text": " Or, and what it does is it opens up the possibility, no, we should go hunt rabbits, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3711.703,
    "end": 3723.774,
    "text": "So propositional claims and the counterfactual structures that they then, once they take a positive affordance, and then the ease with which you can then jump negative, and how do we jump negative off of a proposition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3723.974,
    "end": 3724.394,
    "text": "Questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.056,
    "end": 3728.157,
    "text": "Why, what, who, where, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3728.398,
    "end": 3732.081,
    "text": "Which are, by the way, look at one word, easy dynamics, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3732.449,
    "end": 3733.549,
    "text": " OK, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3733.569,
    "end": 3734.57,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.77,
    "end": 3737.29,
    "text": "Unbelievably tough to then answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3737.35,
    "end": 3741.232,
    "text": "But it's an unbelievably interesting on a proposition to add questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.772,
    "end": 3748.414,
    "text": "OK, so the argument is this propositions quickly give rise to questions, which then generate what's called a question answer dynamic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3749.354,
    "end": 3751.315,
    "text": "Which is the problem of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3752.335,
    "end": 3758.137,
    "text": "OK, justification is creating networks of legitimizing claims that coordinate the group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3759.162,
    "end": 3760.143,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3760.263,
    "end": 3764.005,
    "text": "And now this gives rise to then the evolution of justification systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3764.465,
    "end": 3770.189,
    "text": "The justification systems are the culture person plane of existence that evolves out of the primate layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3770.949,
    "end": 3774.151,
    "text": "And they're networked together through systems of symbolic justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3774.691,
    "end": 3774.932,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3776.032,
    "end": 3782.315,
    "text": " And it makes a very clear prediction that says, okay, if that's the case, then there's certain kinds of problems that come with propositions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.715,
    "end": 3785.156,
    "text": "There are analytic problems, like is it true or false?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3785.776,
    "end": 3788.197,
    "text": "Alternative, like what should we invest in as a group?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3788.917,
    "end": 3793.459,
    "text": "And personal, like what should I share with the group relative to what I just keep to myself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3794.232,
    "end": 3805.177,
    "text": " OK, because the interesting thing about propositional knowledge is that it affords a clear window directly into the mental operations in the mind, too, in a way that action doesn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3805.637,
    "end": 3807.058,
    "text": "It's like, tell me what the hell you're thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3807.878,
    "end": 3810.78,
    "text": "OK, well, that's a big goddamn problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.06,
    "end": 3811.38,
    "text": "Why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.46,
    "end": 3813.301,
    "text": "Because you don't want everybody to know exactly what you're thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3814.189,
    "end": 3814.549,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.009,
    "end": 3817.951,
    "text": "So this is what's called the evolution in the unified theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.971,
    "end": 3822.714,
    "text": "This is the first key insight happens in 1996 prior to the evolution of the whole tree of knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3823.194,
    "end": 3828.357,
    "text": "It was, oh, my God, the human ego is the mental organ of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3829.509,
    "end": 3837.598,
    "text": " OK, the secondary narrator on top of the felt experiential self is tasked with generating what's justifiable in terms of what you feel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.479,
    "end": 3841.202,
    "text": "How do you give reasons to maintain responsibility on the field?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.422,
    "end": 3847.069,
    "text": "And then how do you navigate your public persona relative to your private self and filter the dynamics and relationship?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3848.424,
    "end": 3849.605,
    "text": " Because we do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3850.045,
    "end": 3850.525,
    "text": "You do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3850.625,
    "end": 3854.427,
    "text": "Anytime you put a little lock on your diary, you're filtering what people can gain access to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3854.447,
    "end": 3855.268,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3855.488,
    "end": 3860.45,
    "text": "We're constantly navigating what it is that people have access to relative to their justified place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3860.75,
    "end": 3862.611,
    "text": "And believe me, I'm a clinician all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3862.911,
    "end": 3863.252,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.432,
    "end": 3867.194,
    "text": "They come with me, their personas out here and their private selves in here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3867.954,
    "end": 3868.174,
    "text": "Why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3868.194,
    "end": 3873.257,
    "text": "Because they can't justify what the hell they actually think and feel to the world because they'll sacrifice social influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3873.277,
    "end": 3873.657,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3873.857,
    "end": 3886.526,
    "text": " OK, so the dynamic of justification goes through the skin and it creates the personal, analytic and social problems, which then actually gives rise to the structure of the ego, which is, hey, you got to regulate your experiential self, which, by the way, is Freud's insight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3886.546,
    "end": 3892.85,
    "text": "You're it, animal it, and your ego and then your public self and then internalized introjection called your superego.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3893.21,
    "end": 3898.774,
    "text": "But then Rogers and other people, you know, your public face out here, Irving Goffman from a micro sociological analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3898.794,
    "end": 3903.257,
    "text": "There are millions of different places that talk about the persona relative to the ego, relative to self.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3904.048,
    "end": 3908.35,
    "text": " And the justification problem then puts that very in clear evolutionary terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3908.77,
    "end": 3920.475,
    "text": "And what it does is by putting that puzzle piece in, you're like, oh, that's how a synchronized primate, which was engaged in symbolic, took off because the question-answer dynamic exploded this new problem of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3920.815,
    "end": 3930.499,
    "text": "And it basically hijacks the language acquisition device into or associates it with a self-conscious egoic justifier that then has to navigate the relationship to the public and the private.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3931.508,
    "end": 3937.51,
    "text": " OK, and then groups get together and they build systems of justification, which are what the belief values of coordinate of population.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.53,
    "end": 3938.79,
    "text": "It's like, what do we believe in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3938.83,
    "end": 3939.53,
    "text": "What do we value in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3939.651,
    "end": 3942.091,
    "text": "How do we legitimize whether this guy's doing the right thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3942.151,
    "end": 3943.152,
    "text": "What is is and ought?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.272,
    "end": 3944.152,
    "text": "And how do we coordinate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3944.172,
    "end": 3948.213,
    "text": "Well, the propositional networks of question answer dynamics build systems of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3948.953,
    "end": 3950.254,
    "text": "And that's actually what we live in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3950.514,
    "end": 3954.055,
    "text": "You know, what we're doing right now is I'm sharing my system of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3954.991,
    "end": 3963.083,
    "text": " So this thing takes off and then creates, whoa, this whole culture person space up here and evolves it right out of the primate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3963.784,
    "end": 3964.866,
    "text": "And then that's what humans are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3964.906,
    "end": 3966.489,
    "text": "They're both primates and persons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3968.277,
    "end": 3973.12,
    "text": " And the person space is this reason giving responsibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3973.82,
    "end": 3977.962,
    "text": "So now what that means is that there's a fundamental division.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3977.982,
    "end": 3980.103,
    "text": "Remember, there's a division between living animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3980.643,
    "end": 3982.504,
    "text": "I mean, living organisms and minded animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3982.544,
    "end": 3983.324,
    "text": "That's a joint point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3983.585,
    "end": 3990.688,
    "text": "Now we have a joint point between the relationship between the primate and the person, which, of course, we all know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3990.708,
    "end": 3993.449,
    "text": "There are no other goddamn primates paying attention to this talk right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.769,
    "end": 3994.79,
    "text": "My dog's wandering around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3994.81,
    "end": 3995.971,
    "text": "He's heard this many different times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3995.991,
    "end": 3996.671,
    "text": "He still doesn't get it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3998.946,
    "end": 4001.529,
    "text": " OK, so persons are able to get this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4001.569,
    "end": 4003.33,
    "text": "You have to live at the level of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4003.35,
    "end": 4004.211,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.671,
    "end": 4006.933,
    "text": "Why is that important to get back to the issue of psychology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4007.113,
    "end": 4008.074,
    "text": "What is psychology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4008.775,
    "end": 4012.398,
    "text": "OK, many people wonder, what do you mean by mental process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4013.179,
    "end": 4017.402,
    "text": "And one of the first things I realized with the subject, are we talking about animals in general?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4018.22,
    "end": 4020.162,
    "text": " which would be virtually all active inference stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4020.903,
    "end": 4027.889,
    "text": "Or are we actually talking about persons with reflective capacities in a social context that justifies and reasons about what they do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4029.511,
    "end": 4031.553,
    "text": "Some psychologists just think in terms of persons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4032.954,
    "end": 4035.236,
    "text": "Other psychologists, the behaviors go all the way down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4035.777,
    "end": 4039.14,
    "text": "Hell, but Watson went all the way down to the goddamn amoebas without a nervous system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4039.96,
    "end": 4045.924,
    "text": " So the line of what you refer to in mental process is very different, and people have different reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4046.184,
    "end": 4051.167,
    "text": "Descartes gives us this reason justifying mind, which I now call mind three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.487,
    "end": 4056.03,
    "text": "So mind three and the culture person plane of existence is what this conversation is about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4056.41,
    "end": 4064.875,
    "text": "Mind two is the felt experience of being, and mind one is the neurocognitive, mind 1A inside the nervous system, mind 1B moving around in the outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4066.336,
    "end": 4067.657,
    "text": "My things just died here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4067.717,
    "end": 4068.538,
    "text": "I got to switch over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4068.658,
    "end": 4068.938,
    "text": "Hold on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4071.121,
    "end": 4077.784,
    "text": " Ooh, once he connects back to the auditory input, then I will continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4078.844,
    "end": 4080.725,
    "text": "Then Blue, do you have anything first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.506,
    "end": 4084.647,
    "text": "Yeah, I have some questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.947,
    "end": 4088.329,
    "text": "So let's just make sure he's back and then go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.849,
    "end": 4089.229,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.269,
    "end": 4089.689,
    "text": "Now back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.709,
    "end": 4090.269,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.469,
    "end": 4090.79,
    "text": "Continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.81,
    "end": 4091.23,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.732,
    "end": 4092.132,
    "text": " Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.913,
    "end": 4099.118,
    "text": "So I don't remember where I pulled a slide away from, but it's kind of relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.158,
    "end": 4110.948,
    "text": "It's one of your slides, but it's relevant to the talk about the distinction between self and other and these kind of complicated dynamics that are layered into human interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.688,
    "end": 4132.184,
    "text": " And in this slide that I found, it talks about the language of science as quantitative, third-person, descriptive, theoretical, and public, and also then the language of the subjective self, which is described as qualitative, first-person, private, specific, and value-laden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.545,
    "end": 4137.148,
    "text": "And so I just was wondering if you have thought about second persons at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.548,
    "end": 4139.83,
    "text": "Maybe you're familiar with the work of Jay Garfield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.85,
    "end": 4140.511,
    "text": "Of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.431,
    "end": 4148.095,
    "text": " Just the relationship between, like, you don't really, and Jay Garfield, like, there's the second person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.955,
    "end": 4153.417,
    "text": "As soon as you realize that there's a you, then you realize that there's a me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.858,
    "end": 4155.839,
    "text": "And so I think that that's quite fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.159,
    "end": 4158.64,
    "text": "And I just explained it for people that maybe haven't heard about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.2,
    "end": 4163.482,
    "text": "But is there a second person role in your framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.323,
    "end": 4164.723,
    "text": "Totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4164.763,
    "end": 4169.305,
    "text": "So the slide I think you're referring to, hold on, I'll get one of these.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4169.385,
    "end": 4169.986,
    "text": "Thanks, Jay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4175.02,
    "end": 4176.683,
    "text": " Let me reach into my exocortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.636,
    "end": 4186.681,
    "text": "Yeah, it's all cognitively offloaded into the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.56,
    "end": 4191.203,
    "text": " So I think the slide you're referring to has this thing on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.523,
    "end": 4192.003,
    "text": "It does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4192.203,
    "end": 4193.384,
    "text": "The iQuad coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4193.824,
    "end": 4195.966,
    "text": "And then it has the tree of knowledge on the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4195.986,
    "end": 4196.867,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4197.367,
    "end": 4202.991,
    "text": "So all that that slide is saying is that science is a particular kind of language system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4203.371,
    "end": 4210.036,
    "text": "The primary thing I want to emphasize just in that slide is that science gives rise to a particular kind of language system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4210.056,
    "end": 4211.657,
    "text": "And then I listed all of its components.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4211.877,
    "end": 4212.497,
    "text": " components.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4213.437,
    "end": 4217.738,
    "text": "And I would basically argue that the language of science, and what do I mean by that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4217.758,
    "end": 4223.119,
    "text": "It's like, how do we build public knowledge systems that describe the generalizable world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4223.42,
    "end": 4233.982,
    "text": "What do we mean by sort of really intersubjective objectivity that then affords a scientific epistemology that then creates things like the periodic table of the elements?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.063,
    "end": 4237.763,
    "text": " And it has a particular set of qualities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4238.163,
    "end": 4262.053,
    "text": "The main thing that I want to emphasize in that slide is if you trace the evolution of science, it basically gets more and more, it evolves so that it eliminates the unique, ideographic, particular, historical, contingent subject, at least the emphasis of that, and overgeneralizes or emphasizes the generalizable, nominthetic, behavioral law vantage point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4262.774,
    "end": 4264.576,
    "text": " And then you can create a dialectic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4265.297,
    "end": 4269.782,
    "text": "And indeed, the unified theory says, hey, there's the tree of knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4269.822,
    "end": 4271.123,
    "text": "That's your language of science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4271.584,
    "end": 4274.447,
    "text": "And then the coin is actually the language of the subject.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4275.99,
    "end": 4289.753,
    "text": " So the coin then, I got a picture of me on it, and it's basically like, oh, this represents, it's actually in the shape of an H, and you actually turn it to an I. There's an I, and it basically stands for what's called the human identity function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4290.873,
    "end": 4301.875,
    "text": "The human identity function refers to the unique, particular, subjective, ideographic, epistemological portal that is each one of us from our particular perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.403,
    "end": 4303.304,
    "text": " That's what it represents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4303.845,
    "end": 4304.225,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.646,
    "end": 4306.127,
    "text": "Which is not a scientific perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.05,
    "end": 4309.071,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4309.111,
    "end": 4312.715,
    "text": "So, so, so it captures science to basically factors that shit out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4312.735,
    "end": 4314.777,
    "text": "It's like, that's error from science fans point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.058,
    "end": 4315.358,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.518,
    "end": 4317.541,
    "text": "It's our lives from our personal damage point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4318.223,
    "end": 4324.871,
    "text": " OK, so now your question then is, well, do I engage in I mean, what do we do about the second person?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4325.131,
    "end": 4326.553,
    "text": "That's a whole I totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4327.354,
    "end": 4331.459,
    "text": "In fact, the garden is basically a second person wisdom collective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4331.719,
    "end": 4334.502,
    "text": "So a second person is actually how do we create a we space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4335.143,
    "end": 4339.245,
    "text": " OK, a fundamental shared sense of being in a collective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.545,
    "end": 4348.79,
    "text": "And what is fundamentally about is actually wisdom is about how do we actually get collective intelligence together around an ethic, around particular values that we can coordinate around and feel fulfilled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4349.25,
    "end": 4351.851,
    "text": "And so totally it's just not positioned there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4351.871,
    "end": 4355.133,
    "text": "But, yeah, we definitely have a second person perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4356.468,
    "end": 4357.069,
    "text": " Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.509,
    "end": 4358.029,
    "text": "Go ahead, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.049,
    "end": 4359.09,
    "text": "I had a comment on science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.35,
    "end": 4366.035,
    "text": "So one distinction that I often think about is like science as an approach, which could have happened anytime, anyplace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.536,
    "end": 4373.061,
    "text": "Then there's the knowledge slash data, the real specific data sets, and then there's the real specific career and infrastructure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.521,
    "end": 4383.829,
    "text": "So that just helps me separate the specific institutions that we know and love or don't from the data sets that are good or not from our approach, which is timeless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.73,
    "end": 4391.858,
    "text": " But then what's interesting about the slide, it says is that the subjective self is the one that's specific and particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.998,
    "end": 4399.405,
    "text": "So I understand the sort of first and second person side, but actually science, as far as it being generalized and lawful,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.086,
    "end": 4403.749,
    "text": " The counter side is, science is the framework by which we say, well, we don't prove anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.829,
    "end": 4405.61,
    "text": "We don't know that we're on the back of this animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.69,
    "end": 4406.931,
    "text": "Actually, we have to go look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4407.311,
    "end": 4421.022,
    "text": "So science does particularize through measurement and observation, and the laws of science are probably a little bit overblown, and that's the whole joke, is that people outside of scientific training don't always have a sense of what scientists do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.402,
    "end": 4423.624,
    "text": "It's not alchemy, usually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.364,
    "end": 4427.365,
    "text": " And then that is a disconnect that is also historical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.766,
    "end": 4428.426,
    "text": "So it's still ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.446,
    "end": 4439.251,
    "text": "That's why we need this historical approach, because we have to understand how does Bacon's early writings play into some lay fallacies about what science is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.531,
    "end": 4443.953,
    "text": "And then won't people just think differently if they change that belief?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.893,
    "end": 4445.253,
    "text": "Beautiful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.774,
    "end": 4451.976,
    "text": "And I'll point out there that, yeah, so another key issue here is the meaning of the word empirical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4451.996,
    "end": 4453.017,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.876,
    "end": 4458.361,
    "text": " So the word empirical means observation, systematic observation, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4459.162,
    "end": 4465.368,
    "text": "But early on, people didn't differentiate between, oh, I empirically am observing this purple can, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.274,
    "end": 4475.722,
    "text": " But when science came along and you got the primary versus secondary quality dimension that emerged with people like Hume and the whole structure, you had the shit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4475.962,
    "end": 4477.503,
    "text": "I experienced this as purple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4478.064,
    "end": 4483.709,
    "text": "OK, which then they were like, well, God, that's a goddamn secondary quality, which become qualia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4484.149,
    "end": 4489.273,
    "text": "OK, and then it's actually what we can really observe is the shit we can measure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4490.194,
    "end": 4494.178,
    "text": " and create an intersubjective objective intersection with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4494.998,
    "end": 4497.16,
    "text": "And that becomes third person empiricism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4497.48,
    "end": 4507.789,
    "text": "So the scientist is you have to get trained in procedures and it becomes a scientific observation if everybody trained in the procedure can see and interpret the data that you gather.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4508.61,
    "end": 4513.692,
    "text": " So science is not dependent upon a unique, individual, ideographic, empirical perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4513.912,
    "end": 4533.138,
    "text": "It's dependent upon a third-person, quantitative, generalizable, empirical perspective, which is that to count as data, you actually have to have transpose observers that are trained in interpreting it and say, oh, yep, we all publicly agree that the way to interpret, you guys look at these goddamn things coming off of the Large Hadron Collider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4533.358,
    "end": 4535.359,
    "text": "Well, we can get together and go, I'll tell you what that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4535.379,
    "end": 4537.96,
    "text": "That's a muon that's wobbling in a weird way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4538.28,
    "end": 4538.78,
    "text": " I'll look at that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4538.88,
    "end": 4542.942,
    "text": "I don't know what goddamn muon is, but actually all the experts together and they'll take the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4542.962,
    "end": 4545.304,
    "text": "We'll say, yep, that's a muon and that's wobbly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4546.304,
    "end": 4547.685,
    "text": "And that becomes an observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.965,
    "end": 4554.368,
    "text": "So it's a third person data driven observation that's available to those that have expertise in the procedures of interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4556.735,
    "end": 4556.995,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.596,
    "end": 4570.524,
    "text": "One way that that plays out, I think it makes me think about how in frequentism, it's sort of like trial, you know, accept or reject kind of and misconceptions beyond that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.385,
    "end": 4582.792,
    "text": "But with Bayesian frameworks, even though the Rev Bayes was back in the day, the Bayesian framework, as it's now understood in a computational era, helps us deal with probabilistic problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4583.786,
    "end": 4587.049,
    "text": " variables and variables that we have uncertainty on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.609,
    "end": 4597.357,
    "text": "And then also allows us, which we use a ton in Act-Inf, is to have like an underlying process that isn't observed and then an emitted process that, or an observable that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.898,
    "end": 4602.101,
    "text": "And having that as the fundamental, that's signal processing, general processing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.154,
    "end": 4605.275,
    "text": " partially observable Bayesian models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.775,
    "end": 4608.136,
    "text": "So that's a very established computational technique.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.536,
    "end": 4616.339,
    "text": "And so we can just take it as our unit, that it's not just the measurements out there in the world, nor is it an unmeasurable object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.659,
    "end": 4619.16,
    "text": "We just say, we're always going to measure the dyad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.84,
    "end": 4624.982,
    "text": "And that is the unit of scientific modeling because that's the tools we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.842,
    "end": 4629.263,
    "text": "In unified theory, it's observer behavior relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4634.266,
    "end": 4634.566,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.886,
    "end": 4635.747,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4636.127,
    "end": 4637.649,
    "text": "Would you like to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.809,
    "end": 4638.709,
    "text": "There's a lot to go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.769,
    "end": 4639.87,
    "text": "We can go somewhere else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4640.15,
    "end": 4645.134,
    "text": "But anyway, there's a foundational, it basically takes science as observer behavior relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4645.654,
    "end": 4652.9,
    "text": "And then it actually drops it into quantum mechanics and general relativity in a particular kind of way that aligns matrix mechanics with Big Bang.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4652.94,
    "end": 4654.721,
    "text": "It's weird, but it basically goes...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4654.921,
    "end": 4656.202,
    "text": " Oh, yeah, the fundamental unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4656.242,
    "end": 4658.483,
    "text": "In fact, this is why this is an I-quad coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4658.723,
    "end": 4661.265,
    "text": "It's I to the fourth, which creates a unit circle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.565,
    "end": 4666.068,
    "text": "And it actually is a frequency of observer behavior relation is entangled in the coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4666.368,
    "end": 4669.87,
    "text": "So anyway, just as I heard you saying, I was like, yep, nope, that's exactly what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.91,
    "end": 4673.513,
    "text": "And really what science fundamentally is, is observer behavior frequency relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4673.713,
    "end": 4674.873,
    "text": "That's what Lisa's argument is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4674.893,
    "end": 4675.734,
    "text": "So I'd love to hear that shit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.247,
    "end": 4690.955,
    "text": " Okay, short thought, I hope it's already an NFT, but second thought is what are the next steps, even though we're not at the end of our conversation, but what are the next steps for an individual or for the field?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.515,
    "end": 4706.003,
    "text": "Like if someone's excited about this potential and maybe they haven't had a university education or they have, like what does an individual do to onboard, to know more, to apply, or what is the broader project",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.697,
    "end": 4708.398,
    "text": " that you're working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.418,
    "end": 4711.52,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4711.6,
    "end": 4712.761,
    "text": "Well, that's, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4712.781,
    "end": 4719.386,
    "text": "So let me see if I can, so I'll shift my frame a little bit here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4719.566,
    "end": 4720.988,
    "text": "So let's see what we're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4723.009,
    "end": 4725.411,
    "text": "So there's the, there's a theoretical angle on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4725.651,
    "end": 4726.612,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4726.632,
    "end": 4734.018,
    "text": "So the theory, there's a theoretical angle, which to me is that we're about ready to drop into a new theoretical enlightenment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4734.938,
    "end": 4735.498,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4735.518,
    "end": 4736.278,
    "text": "It's really exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4736.298,
    "end": 4748.182,
    "text": "I really think that there is an opportunity to address the enlightenment gap and find a way to place the sciences in proper relation to our knowledge and do so with consilience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4748.202,
    "end": 4749.983,
    "text": "That's super exciting from a theory perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4750.303,
    "end": 4750.523,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4751.623,
    "end": 4756.184,
    "text": "But it turns out, and so if that was going on, that's beautiful and wonderful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.204,
    "end": 4756.805,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4757.285,
    "end": 4762.466,
    "text": "But I have to pause because that's not the only thing that's actually happening here, at least from my vantage point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4765.598,
    "end": 4767.166,
    "text": " And that is the world is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4770.421,
    "end": 4770.642,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.664,
    "end": 4772.304,
    "text": " What do I mean by that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4772.544,
    "end": 4776.206,
    "text": "I mean, like the world is like in a very interesting spot right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4776.226,
    "end": 4783.07,
    "text": "OK, and shit is happening at a very, very weird level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4783.83,
    "end": 4785.031,
    "text": "OK, why is this relevant for me?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4785.091,
    "end": 4789.373,
    "text": "Well, I'll just say, OK, so, you know, I've been in the academy my whole life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4789.613,
    "end": 4789.833,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4789.853,
    "end": 4799.138,
    "text": "I've been I got I was at the University of Pennsylvania, worked for Beck, learned all that, you know, published it, special issues, blah, blah, blah, tried to get the architect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4799.778,
    "end": 4804.562,
    "text": " the institutional infrastructure to upgrade itself, at least.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4804.782,
    "end": 4805.743,
    "text": "But I couldn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4806.443,
    "end": 4809.005,
    "text": "I came at it from a too different a position.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4810.326,
    "end": 4815.13,
    "text": "And ultimately, although I was inside the institution, I couldn't get any fucking leverage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4816.13,
    "end": 4824.376,
    "text": "And ultimately, over the last four years, things have happened so that I have jettisoned myself outside the... I'm still a full professor and I do my job, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4825.177,
    "end": 4833.587,
    "text": " But actually, a wave has happened inside the institution that I feel qualitatively more alienated from over the last four years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4834.208,
    "end": 4843.699,
    "text": "And that's for personal reasons and retrospective reasons in relationship to my difficulty trying to get traction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4845.038,
    "end": 4853.526,
    "text": " and global reasons and zeitgeist reasons so that now I hang out with people that are futurists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.626,
    "end": 4861.933,
    "text": "I used to just spend in traditional blah, blah, blah, and I still do, but I actually spend all my time talking with people that are in the midst of a zeitgeist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4862.954,
    "end": 4866.717,
    "text": "For example, I'm involved in metamodernism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4867.418,
    "end": 4870.561,
    "text": "Metamodernism is an emerging sensibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.782,
    "end": 4873.905,
    "text": " That is basically the simplest way to think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4873.925,
    "end": 4885.641,
    "text": "It's the thing that comes after postmodernism that looks back and resolves the modernist versus postmodern thesis, postmodern antithesis, metamodern synthesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.023,
    "end": 4887.223,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4888.183,
    "end": 4893.025,
    "text": " And there's a emerging sensibility in Europe about this, which emerges over the last decade.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.746,
    "end": 4896.426,
    "text": "And weird shit happens with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4896.466,
    "end": 4902.329,
    "text": "So an ethos is sort of like it's seeking a post-postmodern grand metanarrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4902.369,
    "end": 4904.489,
    "text": "So postmodernism says there is no grand metanarrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4904.509,
    "end": 4905.31,
    "text": "They're always dangerous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4905.75,
    "end": 4908.571,
    "text": "And this one comes after and says, I wrote in my book in 2011.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.911,
    "end": 4911.932,
    "text": "And I was like, hey, the unified theory is a post-postmodern grand metanarrative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4914.273,
    "end": 4915.774,
    "text": "And then I turned this into a garden.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4916.621,
    "end": 4917.844,
    "text": " And I don't know why the hell I did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4917.944,
    "end": 4919.186,
    "text": "That's weird.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4919.928,
    "end": 4927.162,
    "text": "But the issue is that when I then saw the artistic sensibility of metamodernism, it's called sincere irony.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4928.285,
    "end": 4933.809,
    "text": " OK, sincere in the sense is authentic and true irony in the sense it's a critique and twisted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4934.249,
    "end": 4935.05,
    "text": "Well, that's what that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4935.09,
    "end": 4936.731,
    "text": "This is unbelievably sincerity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4936.811,
    "end": 4943.436,
    "text": "And it's a cartoon and it's twisted and it's both science and religion and it's a joke and it's serious and it's all that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4943.716,
    "end": 4947.619,
    "text": "I had no idea that the metamodern sensibility had a sincere, ironic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4948.439,
    "end": 4958.121,
    "text": " flavor i was called to do this okay oh i'm connecting to people now the experience that i have is like the the i don't know if you saw the close encounters of the third kind",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4958.763,
    "end": 4959.063,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4959.263,
    "end": 4964.907,
    "text": "Close encounters occurred kind of like 10,000 people in the world sort of wake up and they get this image of devil's mountain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4965.188,
    "end": 4965.448,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4965.468,
    "end": 4968.59,
    "text": "And they get this calling, this crazy calling, like, oh, my God, oh, my God.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4968.93,
    "end": 4970.411,
    "text": "And then everybody migrates to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4970.431,
    "end": 4972.733,
    "text": "And then, lo and behold, that's where the aliens show up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.233,
    "end": 4973.494,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.514,
    "end": 4981.219,
    "text": "Well, I'm telling you, I feel like there's a calling that's happening for in the process of a particular serious evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4981.579,
    "end": 4983.701,
    "text": "We're in a serious evolutionary flux.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4984.421,
    "end": 4984.522,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4985.462,
    "end": 4989.283,
    "text": " And the tree of knowledge actually clarifies exactly why we would be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4989.303,
    "end": 4992.825,
    "text": "Remember, each one of those, life, mind, culture, what does it say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4992.965,
    "end": 5003.088,
    "text": "Each one of those is an information processing and communication network system that yokes stuff together at a higher order.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5005.309,
    "end": 5005.449,
    "text": "Huh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5005.469,
    "end": 5005.529,
    "text": "Huh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5006.878,
    "end": 5011.42,
    "text": " OK, so cells did that and then animals did that and then language did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5012.1,
    "end": 5018.743,
    "text": "Is it any possible that there could be an information processing network communication system that is emerging at a higher order?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5020.323,
    "end": 5023.304,
    "text": "Well, you actually do that and you look back and you're like, oh, my God, it's a goddamn 20th century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5023.724,
    "end": 5030.087,
    "text": "We laid down the Internet and we built artificial intelligence systems that are intersecting with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5032.006,
    "end": 5037.728,
    "text": " So from a tree of knowledge perspective, we're actually in the midst of the fifth joint point on this century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5037.928,
    "end": 5048.233,
    "text": "This century is the fifth joint point where you're traveling through the cultural person plane of existence into the potential digital, which is a whole new potential metaverse of complexification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5049.873,
    "end": 5060.964,
    "text": " If you see the world through that particular ends, then you're like, whoa, now we can actually track the evolution of complexification across all these different frequencies levels with at least intuitive comprehensibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5061.425,
    "end": 5064.908,
    "text": "And you can then see, well, shit, we're actually in the midst of a flux point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5065.689,
    "end": 5073.552,
    "text": " As we have built all of these different technologies, they're transcending the old infrastructures for institutional control and regulation and sensemaking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.072,
    "end": 5081.635,
    "text": "We're all going insane because this is opening up all sorts of possibilities, but it's also threatening the fundamental foundation of how we operate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.175,
    "end": 5090.618,
    "text": "Then the question is, can we upgrade our wisdom to navigate the evolution of technology and the planet and do so in a way that stabilizes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5091.764,
    "end": 5093.806,
    "text": " Or is there going to be too much goddamn chaos and flux?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5093.866,
    "end": 5095.327,
    "text": "The system's going to be thinly stacked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5095.607,
    "end": 5098.189,
    "text": "Everybody gets fucking defensive and insane because of the new thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5098.389,
    "end": 5099.49,
    "text": "And the goddamn thing plummets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5104.574,
    "end": 5105.895,
    "text": "Blue, buy, sell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5110.552,
    "end": 5135.392,
    "text": " Yeah intense I mean I don't know I'm lost in the in the artificial intelligence and cognitive offloading and niche modification I think I wonder about what you feel like the role is since you brought up the internet and artificial intelligence like what do you feel like the role is of niche modification in the transmission of culture or do you feel that culture is something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5135.765,
    "end": 5138.027,
    "text": " has to then be transmitted directly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.107,
    "end": 5143.872,
    "text": "Like, is that a person to person, a learned behavior, or can we modify the niche and transmit it in that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5145.453,
    "end": 5148.576,
    "text": "Well, so let's be clear about some definitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5148.676,
    "end": 5151.538,
    "text": "So in the true knowledge, it's capital C culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5152.539,
    "end": 5153.66,
    "text": "Then there's lower C culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5153.92,
    "end": 5158.764,
    "text": "But capital C culture is the technical term for the systems of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5159.719,
    "end": 5167.625,
    "text": " the propositional networks at various levels that legitimize is and ought in inside groups or outside of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.685,
    "end": 5175.65,
    "text": "So if you're inside a culture, you have a propositional network of legitimizing is and ought that can be coordinated with yourself at the ego level, dyadically,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5176.491,
    "end": 5177.913,
    "text": " or move on up the stack.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5177.933,
    "end": 5187.528,
    "text": "So if you take act inference lab and you create a culture on it, it will be networked around a system of justification that legitimizes what it is that you're doing in a particular niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5187.769,
    "end": 5189.632,
    "text": "And that creates the act inference culture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5190.902,
    "end": 5192.582,
    "text": " Capital C, propositional network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5193.063,
    "end": 5196.984,
    "text": "There's little C culture, which is basically the behavioral investment patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5197.104,
    "end": 5204.125,
    "text": "Other animals have little C culture, okay, that then afford the capacity to adjust into niches and then feed back on them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.425,
    "end": 5208.126,
    "text": "You know, animals learn how to fucking wash potatoes, you know, monkeys will do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5208.627,
    "end": 5208.847,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5209.807,
    "end": 5213.528,
    "text": "And you can then, and of course, we're unbelievably flexible in our behavioral repertoires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5213.988,
    "end": 5214.208,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5215.134,
    "end": 5226.18,
    "text": " So now the fundamental issue is that we are then, from a macroscopic level, what are the large-scale systems of justification that are operating to coordinate is and ought?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5226.821,
    "end": 5230.743,
    "text": "And the answer is not much because of the chaos and the globe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.783,
    "end": 5235.926,
    "text": "The globe has afforded us to get together, but our knowledge systems are not up to the task of coordinating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5235.946,
    "end": 5236.746,
    "text": "We don't know where to learn it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5237.087,
    "end": 5237.867,
    "text": "This is the metaverse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5237.887,
    "end": 5239.128,
    "text": "I mean, what the hell is this thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5239.628,
    "end": 5240.008,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5240.388,
    "end": 5254.671,
    "text": "And so we're trying to, we're groping to build justification systems that can effectively hold and cultivate all the niches that actually then need to grow into that afford individual variation and new growth and blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5255.031,
    "end": 5264.633,
    "text": "And at the same time do so in a way that, you know, well makes this transition or at least affords the emergence of this whole new way of relating the digital.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5264.653,
    "end": 5265.213,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5265.513,
    "end": 5289.447,
    "text": " that can collapse space and time and have us talk to each other at the exact same time which is totally weird right um so i guess my basic point is there's multi-level um uh operations all the time okay uh that are downward trans determinative meaning that everything is sort of happening across the synachar diachronatic stack okay well i'm not a rigid determinist by any stretch",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5291.088,
    "end": 5308.487,
    "text": " But anyway, then I see us as having a moment of conscious evolution, like the issue fundamentally for us at a broad level is to wake up to the situation we find ourselves in and upgrade our operating system to be up to the task, upgrade our system of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5309.485,
    "end": 5313.468,
    "text": " to gain knowledge and socialization so we can be effectively oriented toward wisdom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5313.528,
    "end": 5315.73,
    "text": "That's what the fundamental garden is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5315.99,
    "end": 5327.318,
    "text": "There is a way that we can then, and then if we solve some of the old problems that have prevented this upgrade from happening so that we can then see the path to the upgrade, then a map of cognitive architectural map from the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5327.698,
    "end": 5329.359,
    "text": " Sort of the intellectual stream will happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5329.839,
    "end": 5339.344,
    "text": "If that's in good contact with people that are realizing that the system is sick right now and want a community upgrade, then the intellectual solution can feed the community upgrade.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5339.584,
    "end": 5343.206,
    "text": "They can metabolize it and get it to normal people living their lives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5343.246,
    "end": 5351.631,
    "text": "And we can change the contingency infrastructure, nation state, capital labor relations, resource control structure, and hopefully then evolve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5352.111,
    "end": 5353.852,
    "text": "So to me, the issue is very flexible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5354.767,
    "end": 5356.008,
    "text": " Very bottom up, top down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.589,
    "end": 5358.531,
    "text": "Lots of different things will influence at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5359.331,
    "end": 5362.294,
    "text": "My goal is really there's a meaning in mental health crisis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5362.534,
    "end": 5364.817,
    "text": "That's one aspect of the dynamic we face.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5365.577,
    "end": 5368.62,
    "text": "And that's what the Unified Utah fundamentally then is oriented towards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5368.64,
    "end": 5374.386,
    "text": "So my life mission is we can do a lot better in meaning making and mental health than we currently are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5375.349,
    "end": 5383.632,
    "text": " There are ways to understand knowledge and wisdom that can fundamentally shift and rotate the way we think about ourselves so that we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5383.952,
    "end": 5390.675,
    "text": "In fact, I'm searching for a coherent naturalistic ontology that can revitalize the human soul and spirit in the 21st century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5390.975,
    "end": 5393.056,
    "text": "That's essentially what my mission is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5393.396,
    "end": 5396.657,
    "text": "And you talk affords a particular sense making structure to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5397.117,
    "end": 5407.531,
    "text": " And if everyone's operating in that kind of sense-making structure, from both the bottom and the top, the whole coordinated system of justification would be different, and the consequences of many, many things would be different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5410.984,
    "end": 5412.085,
    "text": " Thanks for sharing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5412.885,
    "end": 5415.927,
    "text": "Just to connect it to two or a few active ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5416.768,
    "end": 5432.598,
    "text": "Policy selection, which is core, is based upon the partitioning, but always the joint consideration of epistemic value, knowledge-oriented value, or intrinsic motivation, and pragmatic value, utility value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.018,
    "end": 5433.939,
    "text": " external motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.339,
    "end": 5436.62,
    "text": "So we need to learn more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.0,
    "end": 5446.125,
    "text": "We got to take a few steps back to go the easier way to the mountaintop, but also we need to clear the clouds to see where we could go and communicate how we could go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.465,
    "end": 5447.366,
    "text": "So that's why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5448.226,
    "end": 5474.872,
    "text": " planning as inference is a useful framework because it's not enough to just have preferences preferences are a core part of our models we want to be like warm and secure at each level of the maslow's hierarchy but the other side that inactivism kind of slapped back into the world we have to have a plan and it has to be pragmatic so just beautiful very similar um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5476.934,
    "end": 5494.351,
    "text": " It's funny because drawing more from the cybernetics and dynamic systems and complex systems modeling side, the experience, that's the part that's, oh, that's unsupported or you'll never be able to make those claims or that's the gangplank.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5496.67,
    "end": 5499.693,
    "text": " versus the kernel, which is seen as to be the math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.273,
    "end": 5506.439,
    "text": "But then the real relational insight shows that it's truly a bi-directional freeway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.459,
    "end": 5518.009,
    "text": "Like everyone's going home or away because you really can wrap a lot of the technical parts within a broader picture that isn't formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.571,
    "end": 5521.052,
    "text": "Amen, brother.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.161,
    "end": 5538.814,
    "text": " So just a quick question related to both the mental health crisis and to culture with a capital C, which I don't know, is in that kind of definition, like something I'm equating to like a moral system or a value system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.914,
    "end": 5540.135,
    "text": "Is that appropriate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.175,
    "end": 5540.375,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.715,
    "end": 5541.096,
    "text": "Oh, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5541.216,
    "end": 5541.596,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5541.736,
    "end": 5549.683,
    "text": "It's a belief value network of propositions that afford a group to be able to state explicitly what is and ought and negotiate from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5550.453,
    "end": 5563.297,
    "text": " So what do you think, or do you think that there is a relationship between like the fact that, you know, in Western society, at least in the States, like many of us are just spiritually bankrupt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.957,
    "end": 5566.198,
    "text": "And so like, do you think that there is a connection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5566.258,
    "end": 5571.799,
    "text": "Is that a possible fundamental reason for the mental health crisis that we're facing now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.98,
    "end": 5573.22,
    "text": "Do you think that those are linked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.5,
    "end": 5574.64,
    "text": "Exactly, directly, 100%.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5574.84,
    "end": 5579.962,
    "text": "Yeah, no, no, we're operating off of a very sick system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5580.856,
    "end": 5581.737,
    "text": " of justification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5581.957,
    "end": 5589.344,
    "text": "And, and it's basically my friend, Zach Stein puts it this way, or at least I'll draw from him and I'll put it in my own basic context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5589.384,
    "end": 5601.495,
    "text": "So what happens with the modernity, which is basically enlightenment, capital labor relations, Democrat, and then the evolution and what modernity does to the traditional knowledge systems and the oral indigenous knowledge systems prior to that is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5602.656,
    "end": 5609.002,
    "text": " Is it basically shifts the structure into a skill development, self-interested control model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5609.983,
    "end": 5623.195,
    "text": "Basically, so now the values of justification that evolve off of the modernity are not spiritual ensoulment, but ultimately reductive physical self-interested control, mechanistic kinds of instrumental control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5623.775,
    "end": 5627.299,
    "text": " ways of being, which is an important way of being, no doubt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5628.2,
    "end": 5633.747,
    "text": "But it's a doing problem, which is different than Eric Fromm would talk about as a being problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5635.269,
    "end": 5639.154,
    "text": "Let me give you an example, which I stumbled into through the unified theory to explain this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5639.815,
    "end": 5642.878,
    "text": "So the fourth branch back there is this thing called the influence matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5644.273,
    "end": 5656.302,
    "text": " And what it does is it basically combines attachment theory and the interpersonal circumflex to give a model of the process dimensions that we track in our dyadic relational world, meaning the self-other world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5656.602,
    "end": 5659.804,
    "text": "And then we wander around with internal working models in relationship to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5660.205,
    "end": 5660.305,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5661.195,
    "end": 5666.542,
    "text": " So the core line in the influence matrix I originally called the social influence line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5666.582,
    "end": 5667.944,
    "text": "That's why it's called the influence matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5668.444,
    "end": 5671.868,
    "text": "And it said that we had high social influence or low social influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5672.77,
    "end": 5676.074,
    "text": "And influence here was defined in pretty instrumental terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5676.834,
    "end": 5682.535,
    "text": " And the instrumental terms were the capacity to influence others in accordance with your interests or the reverse, the absence of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5682.915,
    "end": 5688.156,
    "text": "So there's a resource conception of influence, and that becomes the fundament.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5688.196,
    "end": 5697.338,
    "text": "And from a pure kind of standard evolutionary mechanistic modernist kind of view, this capacity to influence the world is where rubber meets the road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5698.918,
    "end": 5705.179,
    "text": "But over time, that thing evolved, and it became the relational value and social influence line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5706.713,
    "end": 5716.443,
    "text": " OK, whereby what we're actually tracking is both our capacity to move other people instrumentally and the extent to which we're known and valued by important others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5717.965,
    "end": 5719.707,
    "text": "OK, and that is our heart.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5720.047,
    "end": 5723.45,
    "text": "Our heart is both, hey, can we actually move people around?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5724.191,
    "end": 5728.696,
    "text": "And B, am I genuinely known and valued by important others for my essence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5730.814,
    "end": 5743.107,
    "text": " And what this emerges in my clinical work is, A, I work with some people who had no social influence and no relational value, homeless people who are brutalized by all aspects of life, and they're just miserable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5743.647,
    "end": 5751.316,
    "text": "But I then met with a number of people, of course, this will come as no surprise, who actually had high social influence who were completely empty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5753.297,
    "end": 5760.662,
    "text": " They manipulated and controlled other people, but they stacked themselves up with high resumes, but they had nobody like them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5761.002,
    "end": 5764.844,
    "text": "They could be asshole bosses and control people and had money.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5766.845,
    "end": 5768.506,
    "text": "So they had instrumental influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5768.926,
    "end": 5775.911,
    "text": "And of course, then if the instrument just changes, you now have to spend all your time, especially if you're going to do it through control, to gain influence through power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5776.571,
    "end": 5778.232,
    "text": "And now that's a very vulnerable spot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5778.252,
    "end": 5781.534,
    "text": "You lose access to control and you are jettisoned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5782.708,
    "end": 5787.192,
    "text": " And then there are other people even who were actually valued by other people, but they put on a face.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5787.212,
    "end": 5788.974,
    "text": "Their persona is what they felt was valued.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5789.294,
    "end": 5790.055,
    "text": "They weren't known.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5790.075,
    "end": 5791.316,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5791.416,
    "end": 5795.02,
    "text": "And these people also felt very anxious because they could be discovered for who they were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5796.221,
    "end": 5802.587,
    "text": "The core heart placement of security is to have social influence and be known and valued for your essence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5803.869,
    "end": 5804.149,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5804.269,
    "end": 5805.27,
    "text": "Hunter gatherers get this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5807.563,
    "end": 5818.085,
    "text": " We, because of our instrumentality and the way we decided to control and then we create economic labor relations, we basically turn everything into an influence game and we lose relational value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5820.025,
    "end": 5829.567,
    "text": "We don't know that actually that's really what, I mean, John Watson basically decided that the reason kids wanted hugs was because it was paired with food.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5829.607,
    "end": 5832.007,
    "text": "I mean, that's how insane his model of humanity was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5832.207,
    "end": 5834.628,
    "text": "And by the way, two of his three kids killed themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5835.404,
    "end": 5836.505,
    "text": " That's John Watson behaviors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5837.005,
    "end": 5852.113,
    "text": "OK, so our idea of self-interested mechanistic control and applying the clockwork way in which power, force, mass and acceleration actually work as if really that's the underlying causation of our true essence actually kills our soul.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5852.813,
    "end": 5859.197,
    "text": " Because it turns it into instrumentality and fails to attend to the genuine beingness and the value of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5859.537,
    "end": 5861.138,
    "text": "We have to revitalize that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5861.538,
    "end": 5862.699,
    "text": "And we know it when we feel it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5863.739,
    "end": 5873.505,
    "text": "But our justification systems, meaning our academic, hard-nosed, tough-minded thing, is basically, well, when it really comes down to it, you're basically just a bunch of molecules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5874.138,
    "end": 5875.879,
    "text": " I mean, that was the message, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5876.459,
    "end": 5878.2,
    "text": "And we need to change that message.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5878.26,
    "end": 5879.761,
    "text": "People digested that message.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5879.801,
    "end": 5885.204,
    "text": "People lost the clarity about what a human soul and spirit is from a naturalistic perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5885.624,
    "end": 5888.706,
    "text": "We can revitalize that, get clear about it, point them to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5888.966,
    "end": 5900.312,
    "text": "And if we build systems of justification that then organize institutions like education, politics, national relations, et cetera, the whole goddamn equation changes, at least according to this perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5903.168,
    "end": 5903.648,
    "text": " Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.268,
    "end": 5910.171,
    "text": "So it just brings me to another question that I had, unless, Daniel, you have something that you want to pop in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5910.191,
    "end": 5914.032,
    "text": "How about blue with the last question, and then we'll have a closing thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.572,
    "end": 5915.573,
    "text": "Thanks a lot, Greg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5915.593,
    "end": 5917.534,
    "text": "This is really a cool dialogue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.554,
    "end": 5920.855,
    "text": "So blue with the last question, and then we'll each give a last thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.847,
    "end": 5939.75,
    "text": " So just one final question is speaking of, you know, relational interactions and, you know, if the relational nature isn't food and it isn't like we're not billiard balls, we're existing in, you know, a field essentially, like what is the relational language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5939.89,
    "end": 5945.431,
    "text": "Like how can we best relate to one another, relate to ourselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5945.731,
    "end": 5947.552,
    "text": "Like how do we speak that dialogue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5948.052,
    "end": 5948.412,
    "text": "Beautiful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.875,
    "end": 5955.637,
    "text": " Well, so I built this thing called Map of Mind for metaphysics of mental domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5956.177,
    "end": 5958.058,
    "text": "And there are five domains that are very obvious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5959.058,
    "end": 5960.518,
    "text": "So one is Mind 1B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5963.059,
    "end": 5965.06,
    "text": "Mind 1A, that's what my nervous system is doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5966.3,
    "end": 5968.721,
    "text": "Mind 2, that's the shit I can see, but you can't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5969.641,
    "end": 5972.082,
    "text": "Mind 3A is what I talk to myself about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5972.944,
    "end": 5973.764,
    "text": " OK, I was just doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5974.444,
    "end": 5976.485,
    "text": "Mind 3B is now me talking out here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5977.085,
    "end": 5979.605,
    "text": "OK, so and those are all easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5979.805,
    "end": 5986.687,
    "text": "Any behavioral, no matter how empirically are, you can now have a map that says, oh, these are actually the meanings of reference of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5986.787,
    "end": 5988.067,
    "text": "And notice there are five of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5989.027,
    "end": 5990.068,
    "text": "And we use the word mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5990.088,
    "end": 5991.708,
    "text": "And actually there are five different reference here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5991.748,
    "end": 5995.629,
    "text": "We need to get very clear because they're different epistemological and ontological reference points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5995.949,
    "end": 5996.049,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5996.989,
    "end": 6000.733,
    "text": " Well, here's one that gets right to your point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6001.313,
    "end": 6009.481,
    "text": "I think, and I think Michael Tomasello's work, and I think anybody that really falls in love and feels is mine to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6011.598,
    "end": 6022.704,
    "text": " The intersubjective, nonverbal, intersubjective space of tracking one another and participating in the attachment relational dance of being.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6023.204,
    "end": 6034.21,
    "text": "It's seeing the other person through the eyes, tracking where their eyes are and essentially seeing their heart, their felt experience of being and being in part of that and then being in dance with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6034.87,
    "end": 6046.8,
    "text": " And if anybody's ever fallen in love with somebody, okay, and then you fall into that, and then all of a sudden you are that field, that felt experience of being, you know, joins together in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6047.061,
    "end": 6056.189,
    "text": "And I actually think we can develop, you know, genuine metaphysical claims about mind-to-be space, which is an implicit, intersubjective space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6056.229,
    "end": 6062.374,
    "text": "I think Tomasello's work on shared attention and intention, I think many different things domain in relationship to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6062.634,
    "end": 6069.516,
    "text": " And it basically is a pre-verbal primate relational field that we are actually really attuned to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6069.836,
    "end": 6074.698,
    "text": "And I think that that affords us a way to think about how we sync up with each other relationally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6075.218,
    "end": 6078.859,
    "text": "I think we should shine a light on that because I think we're relationally deprived.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6079.219,
    "end": 6086.721,
    "text": "And I think that many things like social media basically break that completely relative to what it is designed to track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6086.941,
    "end": 6089.062,
    "text": "And so you're seeing a mental health crisis in adolescence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6089.622,
    "end": 6091.304,
    "text": " They don't have any mind to be connection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6091.364,
    "end": 6094.927,
    "text": "Everything is fucking texting and likes and, you know, jolting and everything else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6094.967,
    "end": 6097.249,
    "text": "And the whole sense of who I am and who you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6097.269,
    "end": 6102.233,
    "text": "I mean, you go back to hunter gatherers, you lived in a family forever and they saw all of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6102.253,
    "end": 6104.035,
    "text": "It was real world action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6105.356,
    "end": 6106.898,
    "text": "And I think that's what the heart needs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6106.958,
    "end": 6112.262,
    "text": "And some that we got to get, we got to figure out a way to cultivate that or else we're going to be empty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6112.643,
    "end": 6116.126,
    "text": "And so, yeah, let's shine a light on that mind to be relational world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6118.484,
    "end": 6120.525,
    "text": " It's either going to be 2B or not 2B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.587,
    "end": 6123.947,
    "text": "Brilliant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6124.147,
    "end": 6124.488,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6124.988,
    "end": 6125.948,
    "text": "Touche or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6126.048,
    "end": 6126.609,
    "text": "Brilliant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6126.669,
    "end": 6127.83,
    "text": "Love it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6127.95,
    "end": 6129.41,
    "text": "I'll give a last comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6129.47,
    "end": 6130.551,
    "text": "Or Blue, do you want to go first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6131.031,
    "end": 6132.372,
    "text": "And then to Greg for the final.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6133.513,
    "end": 6138.616,
    "text": "I think that this was, you know, especially the last remark was just very beautiful and very poignant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6138.796,
    "end": 6140.677,
    "text": "So thanks, Greg, for coming on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6140.777,
    "end": 6141.598,
    "text": "And it's been a pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6141.618,
    "end": 6143.138,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.218,
    "end": 6164.674,
    "text": " you later but really anytime that first off if anyone wants to get involved in active lab hopefully even in the future if you're watching this we're still going to be there to help scaffold and um yeah greg if you or any colleagues or anyone else ever wants to get involved or do another discussion or anything else this was really a great convo",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6165.947,
    "end": 6166.287,
    "text": " Beautiful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6166.487,
    "end": 6167.408,
    "text": "Well, thank you so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6167.488,
    "end": 6168.708,
    "text": "I did really honor to be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6168.768,
    "end": 6169.549,
    "text": "I really enjoyed it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6170.669,
    "end": 6172.951,
    "text": "I'm interested in us cultivating wisdom energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6173.411,
    "end": 6176.332,
    "text": "That's one way of summarizing what the project is here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6176.352,
    "end": 6179.234,
    "text": "And for folks that you asked, like, what can we do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6180.314,
    "end": 6191.06,
    "text": "Ultimately, yes, look out, have some concern, look around at your local garden and try to cultivate wisdom energy in your local garden with your heart and yourself and the other people that you love in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6191.14,
    "end": 6193.501,
    "text": "And if we do that enough, we might be all right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6195.586,
    "end": 6199.729,
    "text": " And we have the ontology working group in the lab for when that's not all right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6199.769,
    "end": 6199.949,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6200.35,
    "end": 6203.712,
    "text": "And as a theorist, that's absolutely essential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6203.732,
    "end": 6208.355,
    "text": "The ontology, the failure of ontology enlightenment gap is part of why we're in the fucking mess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6208.836,
    "end": 6211.317,
    "text": "If we can get this ontology right, we can get on the right path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6211.337,
    "end": 6211.858,
    "text": "A hundred percent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6212.899,
    "end": 6213.759,
    "text": "Thank you, Greg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6214.34,
    "end": 6215.08,
    "text": "Talk to you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6215.24,
    "end": 6215.701,
    "text": "See you blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6215.741,
    "end": 6216.021,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6216.061,
    "end": 6216.281,
    "text": "Brilliant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6216.521,
    "end": 6216.761,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6216.801,
    "end": 6217.122,
    "text": "Take care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6217.382,
    "end": 6217.582,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  }
]