[
  {
    "start": 1.232,
    "end": 3.274,
    "text": " It's July 10th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.455,
    "end": 6.338,
    "text": "This is Daniel Friedman from the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.959,
    "end": 16.069,
    "text": "I'm just going to give an example usage of a few things that we did today at the Active Inference Journal with the ChatGPT code interpreter functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.81,
    "end": 44.293,
    "text": " so for a little bit of context the active inference journal picks up where the live streams leave off we do speech to text language processing manual automated curation integrating language models always working on publishing pipelines open science and as soon as we saw that we had access to the code interpreter today one thought was to head over to our live stream organizing full data which has a bunch of information on the dates times",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.893,
    "end": 53.456,
    "text": " types of streams, guests, title of the stream, number of the stream, any associated papers, and some other information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.257,
    "end": 62.14,
    "text": "And we wanted to analyze this information and just get some descriptive statistics and also take it in a few different directions and see where we could go with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.4,
    "end": 65.361,
    "text": "So here in coda.io table options,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.181,
    "end": 73.726,
    "text": " three dots on the upper right, downloaded it as a CSV, and then brought it in to ChatGPT for Code Interpreter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.306,
    "end": 86.554,
    "text": "So I began by asking it to be an expert code interpreter, and then asked for some visualizations by uploading this CSV that had been downloaded from our previous Coda page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.995,
    "end": 92.038,
    "text": "Some description along with a code was provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.837,
    "end": 96.338,
    "text": " We started with some word cloud visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.658,
    "end": 101.619,
    "text": "Now maybe not the exact visualization that one would want, but could always fine tune it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.639,
    "end": 103.499,
    "text": "So an incredible first start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.66,
    "end": 113.042,
    "text": "Different guests, little bit of a chart needing some tuning, but again, downloadable, presented with code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.182,
    "end": 117.063,
    "text": "I asked for a principal component analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.317,
    "end": 128.62,
    "text": " And it brought up a suggestion about one hot encoding, but also the caveat that that might not yield meaningful results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.76,
    "end": 132.281,
    "text": "I said, go for it however you see best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.261,
    "end": 134.902,
    "text": "The code was provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.802,
    "end": 139.142,
    "text": " a PCA was downloadable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.303,
    "end": 151.665,
    "text": "I asked for some information about the semantic loading of what those principal components were associated with, and some caveats and opportunities were raised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.885,
    "end": 161.428,
    "text": "I asked for the language model to just proceed with whatever visualization it thought was best, made a heat map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.788,
    "end": 163.088,
    "text": "However,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.039,
    "end": 181.532,
    "text": " unknown has the highest frequency and so i asked for the heat map to be re-visualized without the unknown column and that gave us a lot finer resolution to see which guests were repeatedly in which different live stream series",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.863,
    "end": 190.905,
    "text": " I asked about which guests are most strongly associated with which streams and to ask for a visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.005,
    "end": 201.228,
    "text": "Bar chart was displayed of different guests here with colors across by different types of streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.109,
    "end": 209.47,
    "text": "Asked for a word cloud of the topics of their streams and the code was provided.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.851,
    "end": 215.273,
    "text": " Here, in the initial word clouds, it only used the type of the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.453,
    "end": 219.515,
    "text": "So for Chris Fields, we had his course, Physics as Information Processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.995,
    "end": 224.457,
    "text": "For Avel, we had the ongoing course, Active Inference for the Social Sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.237,
    "end": 227.118,
    "text": "For Ander, who's the course assistant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.499,
    "end": 230.6,
    "text": "For Chris Fields, we saw the same information as Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.9,
    "end": 237.303,
    "text": "And for Maxwell, who had only ever joined for live stream and guest stream, this was most associated word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.547,
    "end": 243.449,
    "text": " These terms were downloaded and I asked for them to be output more directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.889,
    "end": 247.79,
    "text": "Again, this kind of sparse cloud.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.371,
    "end": 250.351,
    "text": "And so I asked for a correction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.811,
    "end": 254.473,
    "text": "The word cloud should be person specific and based upon the titles of streams they are in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.793,
    "end": 258.074,
    "text": "That's what we discussed, not the stream series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.314,
    "end": 264.396,
    "text": "And so this actually did bring in for some fields",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.703,
    "end": 269.085,
    "text": " some of those topics that were discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.648,
    "end": 276.35,
    "text": "I asked for some general statistical comparisons on the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.431,
    "end": 282.774,
    "text": "It brought up that a chi-square might be a better first option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.816,
    "end": 287.818,
    "text": "I said go for doing as many chi-squares as your heart desires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.018,
    "end": 294.422,
    "text": "It shows the code from SciPy for chi-squared tests and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.13,
    "end": 316.471,
    "text": " a p-value that's in the negative 150 second order of magnitude we have an association between series and guests unsurprising then i took things in a little different direction and asked for a comprehensive professional phd dissertation integrating all the information above",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.007,
    "end": 328.71,
    "text": " This PhD dissertation proposal was very focused on using live stream data to approach the research process in quite a general scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.71,
    "end": 338.273,
    "text": "So it was actually a bit too general because I was looking for something a bit more particular, even though this was a great nine chapter proposal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.232,
    "end": 346.959,
    "text": " So I asked for a more technical dissertation that focuses on the theoretical and practical aspects of active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.92,
    "end": 357.509,
    "text": "And so this got a lot closer to where I want to be investigating patterns and dynamics and live stream data through the lens of active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.39,
    "end": 360.271,
    "text": "And so here we begin with some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.334,
    "end": 380.362,
    "text": " situational awareness around live streaming as a rapidly growing phenomena and begin to introduce the topic and the reasons why live stream data are useful or at least give us a useful perspective to swap into about active inference some interesting sections so definitely a lot of areas for future work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.343,
    "end": 387.986,
    "text": " but natural language is not all, and this visualization capacity looked really powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.586,
    "end": 397.229,
    "text": "So I asked for a graphical abstract for that dissertation as a PNG in the browser to make sure that it was going to be visible and not just downloadable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.53,
    "end": 401.751,
    "text": "So here we see a really meta word cloud analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.952,
    "end": 410.735,
    "text": "In fact, this is a simple word cloud, but nice kind of summaries of the chapters would be good for presentations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.993,
    "end": 418.555,
    "text": " I asked to make a Bayesian graph that visualizes the core ideas and claims of the dissertation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.936,
    "end": 423.177,
    "text": "In this graph, blue nodes represent the main inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.437,
    "end": 427.399,
    "text": "Orange nodes represent the analytical methods used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.619,
    "end": 432.621,
    "text": "Word cloud analysis, PCA analysis, co-occurrence analysis, chi-square test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.769,
    "end": 446.775,
    "text": " So here we have these four analytical methods being used in relationship to free energy principle, active inference, and live stream data, all of it combining into the green node with the findings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.476,
    "end": 459.74,
    "text": "I asked for this Bayesian graph to be re-rendered using the motifs of cybernetic systems like input output relationships, semantic information flows, and hierarchical metacognitive nesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.561,
    "end": 463.362,
    "text": "And a slightly rearranged graph was displayed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.69,
    "end": 469.712,
    "text": " In an updated graph, live stream data is positioned at the top as the primary input to the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.593,
    "end": 477.415,
    "text": "Active inference and free energy principle nodes are positioned at the same level, representing parallel foundational concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.356,
    "end": 484.317,
    "text": "The analytical methods are positioned in the middle, representing the processing or transformation layer of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.758,
    "end": 488.179,
    "text": "The findings node is positioned at the bottom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.44,
    "end": 490.441,
    "text": " as the output of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.822,
    "end": 497.507,
    "text": "The arrows represent semantic information flows with the direction of the arrow indicating the flow of information or influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.468,
    "end": 504.593,
    "text": "The graph illustrates the hierarchical nesting of the system and highlights the input-output relationships and flow of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.414,
    "end": 515.762,
    "text": "So I asked, write an agent-based modeling framework of a sophisticated cognitive agent that engages in an epistemic activity sufficient to generate the kinds of patterns discussed all above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.143,
    "end": 538.816,
    "text": " qualitatively an agent-based modeling framework was provided agent definition environment definition active inference in the free energy principle good coarse-grained communication of the active inference ontology generation of patterns",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.393,
    "end": 550.882,
    "text": " And of course, I went next to the visualizations and have so many more directions that are probably really fruitful for you and I to explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.083,
    "end": 556.507,
    "text": "But alas, I reached my current usage cap for GPT-4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.308,
    "end": 561.391,
    "text": "I can continue with the default model now or try again in about an hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.612,
    "end": 566.516,
    "text": "So I thought I'd make this nice summary video because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.486,
    "end": 590.589,
    "text": " even just on a first run this has been highly interesting and i welcome everyone who wants to explore and learn more to get involved at the active inference institute or check out what we're up to in the journal here's some next steps that kind of present themselves following this video",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.587,
    "end": 597.45,
    "text": " to characterize our journal process and improve our visualization, automation, editing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.47,
    "end": 610.757,
    "text": "So we have a multi-step process at the journal that helps us go from a YouTube live stream on through the audio and markdown editing to translation and rendering and publishing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.238,
    "end": 613.699,
    "text": "So how can we improve this and how can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.522,
    "end": 617.323,
    "text": " work better in language translations and subtitles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.903,
    "end": 620.944,
    "text": "How can we integrate language models and transformer models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.344,
    "end": 626.766,
    "text": "How can we input, process, and output markdown files better?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.786,
    "end": 633.528,
    "text": "How can we integrate with DOI, digital object identifier, and DCI publishing affordances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.048,
    "end": 636.269,
    "text": "We already do this through GitHub and Zenodo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.829,
    "end": 640.732,
    "text": " But maybe there's some other ways that we could get some publishing affordances going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.793,
    "end": 647.277,
    "text": "And yeah, we'll look forward to how things develop in this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.197,
    "end": 651.38,
    "text": "And again, there's a lot of ways to get involved at the journal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.42,
    "end": 658.405,
    "text": "If anything that we've discussed, if any of the topics of the live streams are interesting to you and you want to get involved at the journal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.985,
    "end": 666.758,
    "text": " where we archive and curate and improve those transcripts, make them part of the citable discourse, then we're looking forward to hearing from you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.039,
    "end": 668.241,
    "text": "So, bye.",
    "speaker": "SPEAKER_00"
  }
]