[
  {
    "start": 4.283,
    "end": 7.757,
    "text": " Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.178,
    "end": 13.72,
    "text": "As always, I'm your host, Darius Parvizi-Wayne, and today I'm really excited to be speaking with Kate Knave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 14.155,
    "end": 24.746,
    "text": " Kate is an early career research fellow at the University of Edinburgh, and her research focuses on developing a realistic account of autonomy and agency grounded in the uniquely metabolic existence of living systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.347,
    "end": 35.377,
    "text": "She has also just finished writing a book titled A Drive to Survive, The Free Energy Principle and the Meaning of Life, which I know the whole Active Influence community is looking forward to reading and hearing about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.878,
    "end": 37.159,
    "text": "Kate, welcome to the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.199,
    "end": 39.001,
    "text": "Thank you so much for coming on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.121,
    "end": 40.703,
    "text": "It's going to be really fun, I hope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 41.523,
    "end": 42.565,
    "text": "Yeah, thanks for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.585,
    "end": 43.065,
    "text": "Nice to meet you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.349,
    "end": 50.056,
    "text": " So there were a couple of books, as you know, about active inference, but they're all quite textbooky and technical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.236,
    "end": 58.625,
    "text": "So I'm kind of curious about just generally, how did the book idea come about and what was it like writing this book overall?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 59.386,
    "end": 62.689,
    "text": "Sure, yeah, it was quite, I guess, quite a circuitous process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.13,
    "end": 70.858,
    "text": "It kind of began during my PhD when I was looking at, actually began with looking at predictive processing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.362,
    "end": 80.57,
    "text": " And visual phenomenology from like, kind of a perspective in facility of phenomenology, trying to connect that to predictive processing, which is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.75,
    "end": 84.253,
    "text": "But through that, I got more into the frangie principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.694,
    "end": 93.802,
    "text": "And I think I initially began with thinking that the frangie principle was going to be a very useful way to kind of scale up inactive accounts of purpose and intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.183,
    "end": 99.647,
    "text": "And then through the course of kind of investigating that it ended up being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.062,
    "end": 104.026,
    "text": " kind of, I guess, the book came out of this to do two things for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.486,
    "end": 119.185,
    "text": "The first was to try and get through the kind of philosophical ideas of the free energy principle in a way that doesn't sort of shy away from the formalism, but doesn't rely on the formalism, if you see what I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.205,
    "end": 129.278,
    "text": "Because I think it's, at the point in which I was writing, it was pretty well being pretty effectively communicated to people with a mathematical background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.298,
    "end": 130.9,
    "text": "That wasn't perhaps initially the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.217,
    "end": 134.882,
    "text": " But the kind of communication of the mathematics of it, I think, had gotten a lot clearer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.763,
    "end": 142.072,
    "text": "But it was still the case that if you didn't have any kind of grounding in that, there wasn't anything that was accessible to you, I think, in book form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.293,
    "end": 154.228,
    "text": "So the first half of it is really trying to look into what are the formal aspects of the French principle actually saying in a way that's explained non-mathematically and intuitively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.969,
    "end": 160.296,
    "text": "Not to say, you know, to some people mathematics is intuitive, but to some people it's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.411,
    "end": 180.933,
    "text": " Then the second part is, I think through that kind of deconstruction of what is the mathematics actually telling you, it started to become clearer to me that the kind of aspects that were supposed to account for purposiveness and agency weren't really there, which I mean, I think now is becoming, now maybe it doesn't seem that strange as things say, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.553,
    "end": 186.999,
    "text": "I think there's been more papers and more discussion of this aspect at the time, I would say there wasn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.7,
    "end": 188.781,
    "text": "So that was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.048,
    "end": 189.549,
    "text": " part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.609,
    "end": 203.73,
    "text": "And the other part of it was sort of discovering a whole lot of really cool work on the physics of living systems that shows how much more complicated they are than we expect, how difficult they are to pin down, how sort of pretty and unchanging they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.17,
    "end": 205.512,
    "text": "And I think all that stuff is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.633,
    "end": 216.709,
    "text": "And I found that the for energy principle is quite a good launch pad for getting into that work because it sort of pushes how far can we go with this sort of mathematical formulas and how far can we get in our description of living systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.128,
    "end": 226.485,
    "text": " And for me, butting up against those limits introduced me to a whole lot of ideas in organicist philosophy of biology in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.525,
    "end": 232.776,
    "text": "That's where the book ends, I suppose, with a, here's what's beyond the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.796,
    "end": 238.847,
    "text": "Here's all this stuff that isn't, I don't think for me, not something that can be a part of this very nice, very simple principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.109,
    "end": 241.532,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.153,
    "end": 252.262,
    "text": " kind of like a simple explanation, a simple and possible explanation of the constructs involved in the French principle, how far can they take us and what can't they help us with when it comes to living systems in particular?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.703,
    "end": 253.044,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.646,
    "end": 255.792,
    "text": "See, I want, there's, there's loads of things there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.233,
    "end": 256.534,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.784,
    "end": 265.215,
    "text": " I wanted to pick up on this thing of, you mentioned agency and kind of teleology and the changing perception that we have of those notions, at least within active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 265.576,
    "end": 277.412,
    "text": "Active inference might intuitively lend itself to a kind of realist notion of agency, just sort of embedded within the idea of self-evidencing in some way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.472,
    "end": 284.361,
    "text": "And this goes all the way back to kind of an active notions of autopoiesis that the, and maybe even earlier to Heideggerian phenomenology that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.218,
    "end": 290.846,
    "text": " organism is taking a stance on this being, and that is self-evidencing that is it's carving out its own niche in its own world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.049,
    "end": 305.185,
    "text": "When you say that it's sort of not there, do you mean that it's, there are two kinds of ways of interpreting that one is that it's actually not there ontologically speaking, that it's a nice illusion that we, you know, create for ourselves to get by in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.966,
    "end": 307.027,
    "text": "That's one stance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 307.047,
    "end": 310.192,
    "text": "Then the other thing is that it can't really be fleshed out in terms of the formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.292,
    "end": 314.938,
    "text": "And there might be something latent in the ontology, which the epistemology can't get us to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 314.918,
    "end": 316.68,
    "text": " at least the epistemology of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 317.061,
    "end": 317.682,
    "text": "So which one is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 317.742,
    "end": 329.819,
    "text": "Is it the instrumental tool of active inference is insufficient to give us agency in teleology, or is it that it's kind of an illusion, the whole project in the first place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 330.48,
    "end": 343.137,
    "text": "Yeah, I think it's very much the tool that active inference is doesn't allow us to describe the feature of reality that underpins this kind of purposiveness is how I see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.163,
    "end": 360.447,
    "text": " And I think, and I can go into more of like what those features are, but I think that's why you now have this kind of patch move in active inference to a previously self-evidencing, you know, self models, all of this was presented as very purposive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.308,
    "end": 372.685,
    "text": "I'm thinking you're starting to kind of see more papers that are now saying that that purposive gloss on active inference is instrumental, that it's useful to describe certain systems as purposive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.817,
    "end": 377.343,
    "text": " and not so useful in the case of other systems, but in all cases, all that's happening is for energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.363,
    "end": 387.017,
    "text": "And perhaps a sort of Danetian kind of picture where when you get a certain level of complexity, it's helpful to use this kind of intentional gloss, but it's just a gloss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.858,
    "end": 393.486,
    "text": "And it's a gloss that picks up a real difference, but it's a difference of degree, not a difference in kind, I think is the important thing there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.166,
    "end": 399.634,
    "text": "So the question of where we draw the boundary on that difference of degree is relative to our interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.783,
    "end": 416.448,
    "text": " And that's not the view I have, but I think that's the view that you get to if your ontology is limited to what the free energy principle gives you, because it doesn't give you these kinds of differences in kind between what I would think of as agential and purposive systems, living systems and systems that aren't agential and purposive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.468,
    "end": 418.631,
    "text": "For me, there's a difference in kind there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.112,
    "end": 428.946,
    "text": "So does this rest on some kind of axiomatic presupposition that there is agency and purposiveness embedded within living systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.382,
    "end": 432.565,
    "text": " And where is that coming from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 432.605,
    "end": 433.726,
    "text": "Is it just phenomenology?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.766,
    "end": 441.774,
    "text": "How can we ground this kind of starting point that, well, there is a difference really between me and a rock, let's say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.415,
    "end": 444.237,
    "text": "Yeah, I think that's the heart of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.218,
    "end": 448.541,
    "text": "So that's not something I get into as much as I'd like to in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.561,
    "end": 450.203,
    "text": "That's kind of what I'm working on now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.563,
    "end": 457.33,
    "text": "I think I began with that presupposition because I began with this inactive view of purposiveness and agency and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.563,
    "end": 468.797,
    "text": " I suppose because I began with working in visual experience, I think the way that visual experience is characterized in a lot of the phenomenological accounts that I would draw upon is very purposive and intentional, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.817,
    "end": 478.87,
    "text": "It's an attempt to, there's always talk physically, there's a very sort of striving notion of perception where it's about kind of bringing things into alignment and achievement and that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.89,
    "end": 480.853,
    "text": "It's a very purposeful gloss to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.353,
    "end": 484.397,
    "text": "So I definitely began with that very, like, if you can't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.862,
    "end": 490.667,
    "text": " Everything we want to say about cognition for me is grounded in agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.368,
    "end": 497.815,
    "text": "And if we get rid of that, then the kind of whole framework does sort of crumble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.835,
    "end": 502.439,
    "text": "And I think, you know, people do feel that you can keep it going with this instrumentalist stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.86,
    "end": 514.452,
    "text": "I think there's a lot of problems with that because I mean, one of them is when we're talking about talk of agency and purpose as being relative to like our interests, then we're already, we've got interests in the background there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.583,
    "end": 515.064,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.124,
    "end": 516.165,
    "text": "That we need to make sense of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.586,
    "end": 519.45,
    "text": "Is it a good idea to speak if this is purposive or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.47,
    "end": 520.572,
    "text": "It's relative to what I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.873,
    "end": 522.134,
    "text": "How do I explain what I'm interested in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.155,
    "end": 526.641,
    "text": "You get that kind of regressive perspective, which is normally stopped with evolution, I guess, is the standard move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.661,
    "end": 526.862,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.803,
    "end": 529.406,
    "text": "You grant it natural selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.426,
    "end": 533.031,
    "text": "So there's a reason for thinking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.496,
    "end": 563.237,
    "text": " we don't have agency i think we lose a lot more than we realize and there's this gorgeous photo quote actually like i love jerry foda and he's obviously he's he's very known for his defense of intentionality and purposiveness in a very different way from which i'd want to defend it but he's like if that's gone then it's basically just the end of the world he just throws up his hands and cries um and i think i think there's something right about that like i think we lose more by letting go of that it's we don't just lose i'm not even that interested in free will it's not just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.217,
    "end": 589.866,
    "text": " we lose the notions like function we lose the ability to sort of demarcate systems relative to what they do it all just becomes relative to something we don't really understand in terms of that so does the deeper question does the deeper free will question really uh feed into your consideration of agency i mean you said there that you're not too fast about it in some ways it's a worthwhile thing not to be fussed about because it's a it's a philosophical wormhole in and of itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.964,
    "end": 597.494,
    "text": " Does that Fodorian quote and your perspective rest or is it contingent in any way on there being free will?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 597.615,
    "end": 603.062,
    "text": "Or is it just kind of this apparent telos or this apparent function that things have?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.683,
    "end": 608.069,
    "text": "Yeah, so I think it rests very much on the function aspect not being apparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.65,
    "end": 608.83,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.95,
    "end": 614.358,
    "text": "On it being the case that it's not up to you or me what a particular living system is trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.438,
    "end": 619.465,
    "text": "Like if I say any coli is trying to metabolize glucose, that is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.765,
    "end": 626.072,
    "text": " I want to argue something that's true about that E. coli independently of what you or I think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.214,
    "end": 628.495,
    "text": "And I'm quite an anti-realist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.256,
    "end": 633.0,
    "text": "So for me, that's quite a big move to say there are real facts in the world, independent of our perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.462,
    "end": 639.088,
    "text": "And I think that's about the most basic one is these kind of facts about what living systems need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.508,
    "end": 645.014,
    "text": "Those are like going to be, yeah, the most sort of basic realist facts that you get in your ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.016,
    "end": 648.979,
    "text": "But the reason I say I'm not that interested in the free will aspect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.039,
    "end": 658.794,
    "text": " is I want to be able to say that certain systems have needs, that they are trying to do things, that they have, things can be better or worse for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.814,
    "end": 663.242,
    "text": "So it's about that kind of, there is a sense of responsibility there, but we can attribute these things to these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.883,
    "end": 673.279,
    "text": "It's just that the concept of free will, I think is so, it's one of those concepts that's almost like a bit contaminated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.512,
    "end": 677.197,
    "text": " in that it's very hard to agree what different people mean by it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.318,
    "end": 680.082,
    "text": "And it plays very different roles in very different discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.103,
    "end": 687.513,
    "text": "So it's not when I say I'm not interested in it, I think I'm interested in things that some people might consider as being what free will is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.613,
    "end": 691.218,
    "text": "I just don't like to talk about it in terms of free will, because it's just too messy a concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.238,
    "end": 697.968,
    "text": "Yeah, no, I think, I think it's absolutely right that we need to just at least be precise about what we mean by the words we use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.988,
    "end": 701.173,
    "text": "I mean, it ends up becoming a sort of, you know, people, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 701.66,
    "end": 706.746,
    "text": " just spending half of their papers writing the meaning of the concepts they're using.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.246,
    "end": 709.589,
    "text": "But a shared language game would be nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.609,
    "end": 723.625,
    "text": "Because I think when people hear agency, they do think of free will and they don't think of this kind of non... For me, just this notion that agency is function, performative function, it's kind of like... I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.685,
    "end": 725.648,
    "text": "For me, it doesn't really feel like it's enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.709,
    "end": 729.372,
    "text": "But I also wonder whether...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.162,
    "end": 736.067,
    "text": " So we take function and process as real in our ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 736.107,
    "end": 740.251,
    "text": "Do you take thingness to be real as well?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.311,
    "end": 743.954,
    "text": "Because this is a kind of contentious point within active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.974,
    "end": 759.308,
    "text": "Well, maybe not contentious, but at least a point of curiosity, which is active inference rests axiomatically on the fact that there is a thing and you can describe a thing as persisting such that it's the same thing today and tomorrow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.473,
    "end": 769.309,
    "text": " Is that a viable or reasonable axiom, or do you think that that can be sort of demystified, deboned?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.35,
    "end": 770.611,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.252,
    "end": 778.483,
    "text": "Just to come back to the thing you said first off about this not being sufficient for agency, I would also, the kind of thing I'm talking about, I would also agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.503,
    "end": 785.194,
    "text": "I tend to kind of refer to use the term autonomy for that reason, because I think autonomy is like a sort of necessary condition of agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.444,
    "end": 786.946,
    "text": " but maybe not the full-fledged thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.267,
    "end": 794.337,
    "text": "And actually, before we go on to the second point, by autonomy, are you talking here about a sort of traditional and activist account of autonomy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.878,
    "end": 804.953,
    "text": "Well, I think where I would like grant, like originate maybe the notion of autonomy I'm interested in is just this kind of Kantian thing of like being a system that gives a law to itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.895,
    "end": 806.876,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.378,
    "end": 813.426,
    "text": "So that plays out in an active concept of autonomy, but I think it's a sort of more...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.115,
    "end": 817.358,
    "text": " thinner or essential notion that people have developed in these different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.398,
    "end": 820.842,
    "text": "But the basic thing is, how can you be a system that constrains yourself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.322,
    "end": 826.608,
    "text": "Because, you know, if you're the only constraint on yourself, and surely you can just choose to stop constraining yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.248,
    "end": 841.243,
    "text": "And like, it's a really, to me, it's a really, really lovely, philosophical kind of, I guess, an antimony in council, like a paradox where there's something really important about the idea of self constraint, but it seems like a self defeating idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.664,
    "end": 843.565,
    "text": "And that's maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.186,
    "end": 863.384,
    "text": " that's kind of what I mean by autonomy is like this really, all of the confusion about agency and all of the reasons that agency in general, I think is difficult to explain is because it's for me, I think it's central ingredient is this kind of autonomy of being a system who has things that you have to do because of the system that you are, that aren't externally imposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.404,
    "end": 864.846,
    "text": "So it is a very inactive notion as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.186,
    "end": 869.65,
    "text": "They're not internally imposed needs, but they are still needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.67,
    "end": 870.891,
    "text": "You still have to satisfy them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.051,
    "end": 873.754,
    "text": "So what, so what,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.97,
    "end": 875.593,
    "text": " What kind of example could you give there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 875.753,
    "end": 887.636,
    "text": "So for example, I think that obviously that additional clause is necessary because then I can say, well, a rock is autonomous because it has needs, at least from the mathematical, statistical, instrumental standpoint, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.656,
    "end": 890.241,
    "text": "to minimize variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.913,
    "end": 896.001,
    "text": " What needs, could you say, do we impose on ourselves, which are not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.282,
    "end": 902.572,
    "text": "I mean, to lay my cards on the table, I'm personally quite skeptical of the internal-external boundary in any case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.592,
    "end": 912.307,
    "text": "I'm not sure what it means to have internal versus external constraints, because underlying all of that, you need to have some locus of free energy minimization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.347,
    "end": 918.557,
    "text": "So Jacob Harrow would say it's the dorsal horn, or Andy Clark might say it's me and my phone and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.263,
    "end": 925.49,
    "text": " But in any case, I'm quite happy to have a kind of process ontology about where those boundaries lie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.791,
    "end": 927.231,
    "text": "But what is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 927.311,
    "end": 928.633,
    "text": "So what would it mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.673,
    "end": 939.504,
    "text": "I mean, if we can say the rock clearly doesn't have kind of this interiority whereby it's creating its own norms and it's abiding by those norms that I seem to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.086,
    "end": 944.009,
    "text": "Can you give us an example of like one of those?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 944.429,
    "end": 948.814,
    "text": "Because for me, I feel like I can always reduce it back to some kind of exteriority.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.946,
    "end": 949.627,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.51,
    "end": 957.739,
    "text": "So the way I think about this kind of self-law then does become a more inactivist-y notion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.162,
    "end": 977.788,
    "text": "So the kind of framework I particularly like for it is the kind of biological autonomy framework that's been developed by Alvaro Moreno and Matteo Mossio in terms of constraint closure, which is very inactivist-y, but I wouldn't necessarily say they're inactivist, so just in that sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.14,
    "end": 1001.584,
    "text": " But the way that you have a system that has something like an interiority exteriority distinction, but not obviously self standing completely, where you have that kind of constraint closure, which is their development of what would be organizational or operational closure in an activism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.005,
    "end": 1007.05,
    "text": "But you have all these different versions of closure that are all actually really quite different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.654,
    "end": 1010.096,
    "text": " But so I just need to come back to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.338,
    "end": 1019.506,
    "text": "So the idea is the way in which that gives you this kind of need that is your own need doesn't have is, I think, in two ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.546,
    "end": 1030.297,
    "text": "Firstly, there's a sense in which I think when we speak of non living things, those are things, those are carvings out of the world that are relative to our interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.357,
    "end": 1032.579,
    "text": "So something like a rock for me is not a natural kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.26,
    "end": 1035.602,
    "text": "Anything that's not living,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.797,
    "end": 1040.101,
    "text": " Arguably, I would say those are kind of distinctions that we're placing on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.042,
    "end": 1048.13,
    "text": "We're saying to be a rock, you need to not be heated over a certain temperature because then you'll collapse and no longer be a rock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.551,
    "end": 1051.854,
    "text": "But that's not really got anything to do with any sort of self-individuating system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.375,
    "end": 1054.117,
    "text": "That's just my definition of what a rock is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.038,
    "end": 1065.37,
    "text": "So to say that you can have this sort of statistical model of a rock, and then you can say that free energy must be minimized relative to that model if it's to stay as a rock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.957,
    "end": 1068.701,
    "text": " That's still very much like my imposition on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.602,
    "end": 1088.971,
    "text": "When you have something that's, I guess, a metabolic system, I think what you have is a system where there are needs intrinsic to that network, where each part of it depends on other parts in such a way that it's not about how to put this so that there's a stability, but the stability depends upon the activity of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.852,
    "end": 1095.12,
    "text": "So if you just leave it on its own, um, it will, if you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.475,
    "end": 1107.927,
    "text": " I always find this really difficult to talk about if you, it's kind of like the, it's kind of like, I think the exact, the classic example is something like the cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.568,
    "end": 1109.008,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.028,
    "end": 1118.28,
    "text": "And the cell has this, uh, partially permeable membrane and it needs the sort of metabolic resources in which to continue to generate that partially permeable membrane.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.3,
    "end": 1120.603,
    "text": "I mean, I think that's the classic auto poetic notion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.083,
    "end": 1124.187,
    "text": "The thing is, I'm being really annoying, but why not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1124.307,
    "end": 1124.848,
    "text": "It's philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.229,
    "end": 1125.529,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.589,
    "end": 1135.441,
    "text": " I just wonder whether that kind of, that thing of in terms of operational closure, the individual constituent parts rely on one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1135.461,
    "end": 1138.165,
    "text": "So without one, you don't have the functioning of the whole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.466,
    "end": 1141.99,
    "text": "And I think, you know, they term that precariousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.552,
    "end": 1154.807,
    "text": "I just, I wonder whether you could consider the, if there is the interiority of a rock to also be precarious in that way, such that if the central bit of a rock",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.665,
    "end": 1161.331,
    "text": " is heated to a certain degree such that it melts, the whole thing melts, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.431,
    "end": 1168.057,
    "text": "In some sense, the whole thing collapses and become soil or, or at least not the singular rock that we thought it was, it would become a multiplicity of rocks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1169.279,
    "end": 1175.425,
    "text": "It's interesting that you carve out the sort of natural kind and the rock is not necessarily a distinct thing in and of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.445,
    "end": 1182.612,
    "text": "And it's an imposition, I kind of in maybe it's a very exaggerated Buddhist idea that I think we're the same, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.652,
    "end": 1183.613,
    "text": "I think that I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.808,
    "end": 1192.601,
    "text": " it's, it's difficult to say that I am ultimately physically distinct from the chair on which I'm sitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1194.303,
    "end": 1200.553,
    "text": "Now, I think the one I spoken to Carl about this, and I think the way he rests on is the idea of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.896,
    "end": 1205.021,
    "text": "And I guess what in an activism would be adaptivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.161,
    "end": 1209.027,
    "text": "So it's kind of Ezekiel de Paulo idea that by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.293,
    "end": 1212.356,
    "text": " because we can take a stance on our own being, we can change the world in accordance to our priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.376,
    "end": 1214.618,
    "text": "So it's, it's use active inference language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.638,
    "end": 1217.181,
    "text": "How does that solution stand for you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1217.261,
    "end": 1225.249,
    "text": "I mean, I, you know, just to sort of tee you off, is there an issue with the underlying notion of action as well?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.449,
    "end": 1228.172,
    "text": "Is that, is that a troublesome concept?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.973,
    "end": 1229.193,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.694,
    "end": 1237.782,
    "text": "Um, so I think it's funny, like when you have this discussion about whether or not the living system is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.167,
    "end": 1253.291,
    "text": " self-individuating system or not, that you're either often talking to somebody who would just absolutely accept that rocks and chairs and things are just real things in the world independently of us, or you're talking to somebody from your position on the other extreme of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.311,
    "end": 1258.459,
    "text": "And I find, I suppose I find the end of the spectrum that you're on more sympathetic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.499,
    "end": 1262.065,
    "text": "That's where I would have initially gone, lent, before I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.5,
    "end": 1264.882,
    "text": " was more convinced by this idea of self-individuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.902,
    "end": 1277.674,
    "text": "And I think, yeah, so I think action is very pivotal, but I think it's often used in a very weak or general way in which I think we can make a distinction between an action and a mere movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.715,
    "end": 1291.326,
    "text": "And if you just refer to all their movements as actions, then you're not going to get any sort of distinction between a operationally closed system and a rock, because you can say that a rock depends upon all the forces that all of its different particles exert on each other to hold it together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.627,
    "end": 1293.689,
    "text": " You can call those intermolecular forces actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.329,
    "end": 1298.393,
    "text": "You can say there's a network of actions between the various components of a rock keeping that rock going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.114,
    "end": 1310.744,
    "text": "So yeah, this is kind of what I was trying to get to before was that why is an operationally closed network different from a system where the integrity of the whole does depend on interactions between its parts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.924,
    "end": 1312.245,
    "text": "We can think of a rock that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.265,
    "end": 1321.313,
    "text": "And I think it rests on having this notion, a very, I guess, quite unusual, but quite a stringent notion of like what it is for something to be acting on its part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.17,
    "end": 1341.868,
    "text": " where an action, and this is what you get in the kind of constraint closure formulation is an action is when you're constraining a release of energy to perform work in a way, which is general again, like, you know, a channel dug into the mountain channeling water down a hill is constraining the release of energy to perform work of turning a water wheel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.908,
    "end": 1351.097,
    "text": "So the idea of constraining a release of energy to perform work is not sufficient, but it becomes an action when the constraint itself is dependent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.313,
    "end": 1353.796,
    "text": " on the work that it does when you have that kind of circularity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.838,
    "end": 1362.989,
    "text": "So, and that's what you do have in metabolism, of course, because in metabolism, you have these enzymes that are catalyzing reactions that only happen because of the enzymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.55,
    "end": 1366.374,
    "text": "But if the reactions don't happen, the enzymes themselves aren't regenerated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.795,
    "end": 1370.92,
    "text": "And that's a very different relationship between parts than you have in something like a rock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.822,
    "end": 1374.165,
    "text": "And that's where I think you do start to get this more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.331,
    "end": 1375.973,
    "text": " genuinely self-individuating thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.494,
    "end": 1385.728,
    "text": "And it's why I'm not super keen on this kind of way in which precariousness is often talked about in the inactive literature, because precariousness can sound very vague.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.748,
    "end": 1389.233,
    "text": "You know, everything is precarious over time or everything will collapse over some period of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.574,
    "end": 1396.364,
    "text": "It has to be a very particular kind of precariousness that is distinct to living systems, which is I think this very particular kind of closure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.326,
    "end": 1397.566,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.007,
    "end": 1398.968,
    "text": "No, that's, that's really useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.509,
    "end": 1402.694,
    "text": "Um, you mentioned constraints there a couple of times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.355,
    "end": 1403.495,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.515,
    "end": 1403.595,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.335,
    "end": 1408.179,
    "text": " And I feel like there's a, I, I, this is not a literature I'm super familiar with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.239,
    "end": 1421.731,
    "text": "I know the work of someone like Alicia and this notion, this kind of distinction, Aristotelian distinction, I think between causality and constraints in your own words, what, what do you understand as the difference between those?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.951,
    "end": 1430.439,
    "text": "Uh, is there a, again, is this a natural, you know, a natural difference of natural kinds that there is something genuinely ontologically different in the universe between causality and constraints?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.58,
    "end": 1433.262,
    "text": "Uh, are they the same thing with different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.035,
    "end": 1435.697,
    "text": " you know, words attached to them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.639,
    "end": 1437.739,
    "text": "What?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.759,
    "end": 1438.44,
    "text": "How do you understand them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.48,
    "end": 1442.945,
    "text": "And also, what does that distinction give us in terms of our scientific or philosophical outlook?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.445,
    "end": 1451.795,
    "text": "Yeah, so I think one of the caveats here is I'm, I've not done a whole load on the metaphysics of causation, as it's kind of generally understood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.235,
    "end": 1454.978,
    "text": "I love about constraint is constraints make sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.379,
    "end": 1461.105,
    "text": "Yeah, causation is talked about in a lot of the philosophical literature, at least my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.49,
    "end": 1474.43,
    "text": " sort of surface level of awareness of it is it gets very messy and you end up with views on which there's no such thing as causality, because if you have a particular notion of causality, you don't find that at the level of fundamental physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.231,
    "end": 1490.434,
    "text": "And then you have, I think, among sort of philosophers, maybe more like myself, who are in something like cognitive science or not in the kind of philosophy of physics, but in more general philosophy of science areas, you can sometimes have like a very sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.752,
    "end": 1495.257,
    "text": " traditional basic notion of like billiard ball causation, an event happens, it triggers another event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.557,
    "end": 1498.941,
    "text": "And that's just not very useful for a lot of the kind of things you want to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.042,
    "end": 1503.186,
    "text": "Whereas I think constraints are particularly for the kind of causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.226,
    "end": 1505.048,
    "text": "So I think constraints are a type of cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.068,
    "end": 1507.09,
    "text": "And for me, they're the type of cause that makes the most sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.971,
    "end": 1515.78,
    "text": "And they are the type of cause that helps you talk about living systems really well, because they get that element of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.132,
    "end": 1523.083,
    "text": " The way in which it's very difficult to talk about interiority and exteriority in a living system, because there's such a dependence on exteriority.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.764,
    "end": 1525.667,
    "text": "There is also some sort of closure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.969,
    "end": 1536.925,
    "text": "And what can the idea of constraint causation gets across is that dependence on exteriority, because you need the, you know, you need the input of energy to be channeled by the constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.245,
    "end": 1540.15,
    "text": "So it depends on something from the outside to do anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.891,
    "end": 1543.455,
    "text": "But the thing itself is what makes things happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.009,
    "end": 1549.175,
    "text": " And it gives you that, I think also that sense of, sorry, being able to identify a cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.056,
    "end": 1555.543,
    "text": "Because if you just have the billiard ball thing, then you just trace back that chain of events at the beginning of the universe and it's who started it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.625,
    "end": 1567.418,
    "text": "Whereas if you have a constraint plus even just like a random spontaneous reaction, you have two things that you don't need to go back on a causal chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.225,
    "end": 1575.601,
    "text": " event of a reaction happening only happened because this particular constraint was here and this spontaneous release of energy occurred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.503,
    "end": 1579.289,
    "text": "So you have that sense in which it's much easier to identify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.309,
    "end": 1587.246,
    "text": "I think it's much easier to pin down a cause when you think of it in terms of constrained releases of energy rather than events triggering other events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.833,
    "end": 1598.632,
    "text": " Although I can imagine a very pernickety philosophy of, you know, philosopher of science would say that you could also trace the constraint ad infinitum, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1599.033,
    "end": 1600.476,
    "text": "Or ad beginning of the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.077,
    "end": 1609.572,
    "text": "Because presumably, you know, constraints presumably have some kind of like a fractal nature, such that something is constraining",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1609.552,
    "end": 1615.542,
    "text": " only because it was, you know, the result of some other constraint, which in and of itself was a result of some other constraint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.484,
    "end": 1617.886,
    "text": "Uh, I mean, that's just an addendum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.927,
    "end": 1621.693,
    "text": "I think, I think they're both useful ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.294,
    "end": 1622.895,
    "text": "Um, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.915,
    "end": 1631.77,
    "text": "My experience is that we're, as you say, stuck very much still in the kind of human, um, skepticism, which I think is totally reasonable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.931,
    "end": 1634.395,
    "text": "I mean, I have no, I have no problem with you, but, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.1,
    "end": 1635.941,
    "text": " Yeah, I think you're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.981,
    "end": 1637.524,
    "text": "Constraint certainly gives us something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1638.185,
    "end": 1642.291,
    "text": "How does constraint therefore fit into active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.772,
    "end": 1658.596,
    "text": "Because we talk a lot in active inference of hidden causes and latent causes, one or the other, which implies some kind of underlying acceptance or axiom that things cause other things to happen, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1658.616,
    "end": 1661.04,
    "text": "And that's kind of inherent in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.459,
    "end": 1666.825,
    "text": " generative modeling, or Bayesian design, that there's causality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.405,
    "end": 1678.157,
    "text": "Could we just deflate that whole thing just by adopting a kind of Humean skeptical attitude, such that we can kind of keep these words, but we recognize they're just labels for something that we can't necessarily pin down ontologically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.837,
    "end": 1681.34,
    "text": "Or should we actually be discussing constraints?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.38,
    "end": 1687.146,
    "text": "And does that give us anything over and above the latent cause, hidden cause idea?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.582,
    "end": 1687.923,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.943,
    "end": 1688.143,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.203,
    "end": 1706.181,
    "text": "So I think in terms of embracing the Humean skepticism thing, that's what I don't necessarily talk about it completely in those terms, but one of the things I kind of tried to go into in the book, it's just in an appendix because it became kind of a digression was like, what would it mean to kind of accept",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.482,
    "end": 1712.413,
    "text": " Because there is, I think, one of the things that gets criticized for a fair bit is this conflation between statistical and causal concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.736,
    "end": 1723.174,
    "text": "So to take a whole lot of statistical relationships and say, this is a causal graph, and these are causal relationships, and these are real boundaries and all that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.403,
    "end": 1736.374,
    "text": " I feel like sometimes that criticism is actually a bit potentially unfair in the sense that there are plenty of philosophers who, going back to Hume, who have defended that kind of what you could call a statistical reduction of causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.114,
    "end": 1744.521,
    "text": "And there's tons of work in causal inference where people have tried to look at how those are related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.561,
    "end": 1752.148,
    "text": "And there are philosophical worldviews in which the world is just a series of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.955,
    "end": 1757.6,
    "text": " you know, spaceland points that stand in certain statistical relationships to each other and that's all that causality is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.901,
    "end": 1763.646,
    "text": "So I think that would be a, I think that's like an interesting direction to go with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.667,
    "end": 1780.623,
    "text": "It's not the direction I would go, but it is like, there is a whole lot that could be said about like a particular metaphysical sort of causation that would be really compatible with the kind of active inference approach and make that distinction between the model and the territory, if the territory was that way, a lot smaller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.145,
    "end": 1782.625,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.077,
    "end": 1783.878,
    "text": " Yes, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.179,
    "end": 1785.6,
    "text": "No, that's absolutely right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.701,
    "end": 1787.563,
    "text": "It's kind of, it's nice, because I don't agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.583,
    "end": 1789.826,
    "text": "But I think it's like a really interesting position that could be developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.707,
    "end": 1797.597,
    "text": "Yeah, well, as you say, I think, well, it's a life to do metaphysics of causation is a lifetimes project, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.398,
    "end": 1802.143,
    "text": "So we need some philosophers who have done that since they've been sort of 11.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1802.343,
    "end": 1810.214,
    "text": "I feel like it's one of those things where, you know, you devote a whole career to the metaphysics of causation, and then hopefully you apply it to something like active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.234,
    "end": 1812.257,
    "text": "That's a really interesting point, that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.44,
    "end": 1828.022,
    "text": " If we got a concrete handle on what it means for something to be a latent cause and it's not just this, well, perhaps an instrumental conflation of statistical cause and ontological and genuine cause, we could collapse somewhat the map territory distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.684,
    "end": 1835.072,
    "text": "The question comes to mind, is there anything else that you can imagine if we got a sort of proper grip on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.305,
    "end": 1846.978,
    "text": " Or if we said, okay, this is not just instrumental, it's a genuine claim about what there is in the universe, we would get closer to reducing the map territory distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.999,
    "end": 1847.619,
    "text": "Is there anything else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.04,
    "end": 1850.623,
    "text": "I mean, I sense agency is one of those things as well, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.384,
    "end": 1860.454,
    "text": "Because we could claim that it's a kind of more like a map feature rather than the genuine territory feature, if you're thinking about the deep metaphysics of free will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.895,
    "end": 1863.878,
    "text": "Is there anything else that kind of came up that you thought...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.128,
    "end": 1869.919,
    "text": " At least there's a question here of whether it's a, it's a map or whether it belongs to the map or the territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.041,
    "end": 1874.328,
    "text": "Just for me, the agency belongs very much to the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.388,
    "end": 1878.436,
    "text": "I do think it's about the territory that is missing in the frenzy principles map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.456,
    "end": 1878.716,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.816,
    "end": 1879.458,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.52,
    "end": 1881.782,
    "text": "In terms of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.479,
    "end": 1889.025,
    "text": " I think the biggest move would be to argue for a statistical reduction of causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.065,
    "end": 1896.234,
    "text": "That's not another thing, but I think once you've argued for that, then other aspects of the free energy principle become more realist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.285,
    "end": 1914.098,
    "text": "Well, do you think, I mean, one thing that I think about a lot, because it's kind of what I predominantly focus on and write about is the self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.753,
    "end": 1928.779,
    "text": " So some people take the notion of, well, it depends on kind of your underlying ontology, but some people do take the notion of a kind of, I think, I kind of think that Cartesianism is having a bit of a revival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.894,
    "end": 1931.978,
    "text": " I'm not saying that I subscribe to that, but other people might.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.639,
    "end": 1941.712,
    "text": "And I think in some ways it's aided perhaps implicitly by a framework like Active Inference because it very much forefronts the self-evidencing agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.693,
    "end": 1951.746,
    "text": "And it came to mind, and I was going to ask it when we were talking about interiority versus exteriority, but the conversation moved on, but it came to mind that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.367,
    "end": 1962.819,
    "text": " Are we always at risk of implicitly invoking a self when that would be a misplaced addition to the conversation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1963.22,
    "end": 1973.732,
    "text": "Is the distinction between myself and the rock, well, perhaps implicitly and intuitively, I think as well, I have a self and the rock doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.792,
    "end": 1978.397,
    "text": "Now this is relying on very strong dualistic ideas of what a self is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.098,
    "end": 1980.94,
    "text": "I wonder whether getting stronger on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.477,
    "end": 1983.52,
    "text": " what it means for self-evidencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.54,
    "end": 1986.705,
    "text": "Like, is it purely a phenomenological claim that we have a sense of self?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.406,
    "end": 1992.054,
    "text": "Is there something underneath the pure statistical mechanics and the free energy minimization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.975,
    "end": 1996.38,
    "text": "I just feel like that would get us a lot closer to a more realist account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.401,
    "end": 1999.205,
    "text": "Have you been thinking about the self in any regard?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.066,
    "end": 2008.8,
    "text": "So I think the way I'm thinking about the self, the idea of self, a self that distinguishes itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.59,
    "end": 2012.674,
    "text": " is very tied up with me for agency with agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.694,
    "end": 2020.225,
    "text": "So I think there's two things that kind of are part of a package because the way I think about agency is in terms of autonomy, in terms of giving a law to oneself, all of that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.166,
    "end": 2035.947,
    "text": "Um, so, and perhaps this is where I think when you take the friend, your principal is metaphysics and you take it, you take something like self-evidencing as being what gives you the boundaries of the self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.087,
    "end": 2038.45,
    "text": "I think what you end up there, my,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.717,
    "end": 2049.847,
    "text": " impression of it is more like kind of a business that perhaps you would be more sympathetic to your position in which there are no real selves because everything can be kind of not everything, but self-evidencing is kind of everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.887,
    "end": 2063.719,
    "text": "And if, if causation and inference are understood in this very, very minimal way, where all it is, is to have the right kind of statistical relationships of the things around you, then you're going to have Markov blankets all over the place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.739,
    "end": 2068.403,
    "text": "You're going to have the ability to describe one thing as modeling another all over the place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.48,
    "end": 2079.734,
    "text": " If that's all that you take the self to be, then you're either, it seems to me, I'm going to end up with a very panpsychist view of selves or a view in which, well, if selves are everywhere, then there's not really any such thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.776,
    "end": 2081.757,
    "text": "Yeah, I think that's reasonable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2081.817,
    "end": 2087.505,
    "text": "I mean, I, I, maybe I am lending myself towards panpsychism because I do think that, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.789,
    "end": 2092.297,
    "text": " phenomenal experiences, sort of the one indubitable fact about the about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.498,
    "end": 2098.489,
    "text": "So that's just, that's, that's kind of we can, I mean, I want, you know, we will get to consciousness, I'm sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.01,
    "end": 2111.012,
    "text": "But without without going there yet, and perhaps it will come up now is if I adopt, if you don't adopt that kind of deflationary account of selfhood,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.802,
    "end": 2114.849,
    "text": " What is there in your ontology that's over and above that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.069,
    "end": 2120.701,
    "text": "So we spoke about agency and how it was about sort of a law unto oneself and autonomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.262,
    "end": 2128.157,
    "text": "And that, okay, there we kind of staked a claim about ontological, you know, on actually what's, you know, what might distinguish me from a rock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.318,
    "end": 2131.341,
    "text": " Is there anything beyond consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.401,
    "end": 2139.713,
    "text": "It might just be consciousness that in a sense adds to this notion that I might have a self or might be a self, whereas a rock isn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2140.033,
    "end": 2146.723,
    "text": "What is that over and above this very deflationary account that I'm proposing or hypothetically proposing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2147.364,
    "end": 2147.804,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.824,
    "end": 2155.275,
    "text": "I mean, so I think one of the things you mentioned earlier was like the role in which constraints play in the range of principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.2,
    "end": 2172.604,
    "text": " And the role that constraints play in pretty much, like I'm not a mathematician, so I'm sure, but in pretty much every mathematical model, you set up some higher level constraint, which is expressed in the form of an invariant equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.684,
    "end": 2177.511,
    "text": "And then you can have lower order equations and parameters that change relative to that higher order equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.531,
    "end": 2181.437,
    "text": "But at some level, you're always going to have that stable higher order equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.457,
    "end": 2184.722,
    "text": "And that's basically a constraint, like the kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.018,
    "end": 2189.964,
    "text": " in, so I don't know if you've, if you, have you ever come across Robert Rosen at all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.666,
    "end": 2191.146,
    "text": "I don't think so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.607,
    "end": 2192.108,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.188,
    "end": 2202.204,
    "text": "So basically he was a theoretical biologist and had this description of living systems as systems, which generate their own equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.224,
    "end": 2203.126,
    "text": "They generate their own functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.927,
    "end": 2208.735,
    "text": "So you have, you have two things essentially, you've got your variables and your functions and your functions are for him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.222,
    "end": 2210.504,
    "text": " God, I'm terrible at my four causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.885,
    "end": 2214.932,
    "text": "Your functions are your efficient causes and your variables are your material causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.952,
    "end": 2221.303,
    "text": "So your variables are the stuff that goes in and your functions are the thing that does something with that stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.745,
    "end": 2223.727,
    "text": "He calls them efficient causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.747,
    "end": 2233.103,
    "text": "I think there's an argument they might be more like your formal cause, your structure, whether they're formal or efficient is, I think, an interesting discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.505,
    "end": 2241.727,
    "text": " But the idea there is that what you have in the living system is a system where you don't have that higher order independent equation that sort of sits on top and doesn't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.349,
    "end": 2248.425,
    "text": "Instead, you have this cycle where every sort of function making up that system is modified by some other part of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.502,
    "end": 2278.159,
    "text": " so that that's okay that's an interest so well okay so that i feel like in some ways comes to this deflationary account of the self right they were just what varela called selfless selves without some superordinate homunculus that's that's guiding the show um okay that's but do you get what what what is what what's left in the concept of self if that's the case if everything is just precarious if the self is precarious in the sense that there are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.561,
    "end": 2286.87,
    "text": " a multiplicity of selves that rely on one or the rest for that for its own existence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.89,
    "end": 2292.756,
    "text": "Can we be left with any cogent concept of a self at least from what the word we think means?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2293.637,
    "end": 2305.429,
    "text": "Yeah, I mean, so I think you don't, you definitely don't get like a Cartesian self, you don't get a lot of stuff that people pack into the self, I think you get, you get, for example, an ability to be there, a way of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.017,
    "end": 2308.901,
    "text": " deciding if something is a part of me or not a part of me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.025,
    "end": 2312.167,
    "text": "So that's what you get with the cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.227,
    "end": 2315.311,
    "text": "The cell lets things in, it doesn't let other things in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.331,
    "end": 2322.783,
    "text": "And that doesn't mean that something that is not a part of me or not a part of my cell can't be a part of a broader thing that we're both part of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.803,
    "end": 2327.771,
    "text": "So like, you know, a cell in my finger is not a part of a cell in my eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.432,
    "end": 2330.074,
    "text": "They're both part of a bigger self that's me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.356,
    "end": 2332.378,
    "text": "But with the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.198,
    "end": 2340.75,
    "text": " like this kind of recursive, what's it called, MR closure, but this kind of closure of functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.913,
    "end": 2343.676,
    "text": "What you don't get is anything stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.257,
    "end": 2347.002,
    "text": "I think that's the really interesting thing that's different about this notion of self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.042,
    "end": 2352.713,
    "text": "You get that kind of individuating network where everything is defined in relation to something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.098,
    "end": 2358.784,
    "text": " And some things are just not part of it because they don't enter energy into the network of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.265,
    "end": 2365.632,
    "text": "So functions of constraints, functions of your constraints and the variables changing or the input of energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.174,
    "end": 2374.242,
    "text": "That does allow you to demarcate a sort of cycle that other things are clearly not part of because they're not generated by it, nor do they enter into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.922,
    "end": 2378.626,
    "text": "But what it doesn't give you is any particular thing that has to stay the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.107,
    "end": 2379.207,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.895,
    "end": 2380.396,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.416,
    "end": 2383.68,
    "text": "Apart from what does the boundary have to stay the same?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.801,
    "end": 2385.442,
    "text": "Not necessarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.462,
    "end": 2386.623,
    "text": "There has to be a boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.184,
    "end": 2389.406,
    "text": "Um, but there's no reason why the boundary couldn't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.547,
    "end": 2389.687,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.047,
    "end": 2404.885,
    "text": "So do we then say, I mean, this is a very sort of caterpillar butterfly problem or, or, you know, so there are some great work, you know, I spoke to Mike Levin, uh, about a month ago on, on this podcast and I, Andy Clark has got some really nice papers on this kind of process ontology perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.826,
    "end": 2405.886,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.423,
    "end": 2423.924,
    "text": " Are we then invoking, uh, like if we just take the lifespan as our sort of time constraint, our time boundary, are we invoking multiple selves then, or a kind of superordinate system to which this metamorphosizing, um, multiplicity belongs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.084,
    "end": 2435.518,
    "text": "Is it, is it, I mean, this is going to come to this conversation about really like, is that, can we, if we keep recursively building out a level, bigger levels of abstraction and general generality, is there some underpinning rule?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2436.325,
    "end": 2445.837,
    "text": " Is there some underpinning guide to that process ontology such that I can point at something in the universe over the span of a lifetime and say that was Kate or that was Darius?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2446.157,
    "end": 2452.585,
    "text": "Or are we just actually just multiple, are we just multiple multiples?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.327,
    "end": 2457.35,
    "text": "I think sort of both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.871,
    "end": 2463.598,
    "text": "I think one thing that kind of annoys me with process ontology sometimes is I think it's a bit too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.912,
    "end": 2466.334,
    "text": " you know, there's selves all over the place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.354,
    "end": 2469.999,
    "text": "This could be a self relative to some perspective, but this could be a self relative to another perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.019,
    "end": 2478.332,
    "text": "So what I like from the kind of closure view is you do get it if we're looking at this scale, then this is the self and this isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.392,
    "end": 2479.834,
    "text": "Like, that's not relative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.894,
    "end": 2486.804,
    "text": "That's not quite as pluralistic as the more pluralistic ends of the process ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.488,
    "end": 2491.611,
    "text": "But it's always going to be the case that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.844,
    "end": 2494.006,
    "text": " If you take, again, the idea of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.707,
    "end": 2496.269,
    "text": "Sorry, I'm always talking this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.289,
    "end": 2497.65,
    "text": "No, as you should.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.091,
    "end": 2502.235,
    "text": "But what counts as a constraint is always defined relative to some other process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.255,
    "end": 2510.765,
    "text": "So on some time scale, this is going to be an invariant thing that's not changing, but channeling a change, but it's invariant itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.785,
    "end": 2516.451,
    "text": "But on another time scale, that's going to be changing and going to need to be replenished by some other activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.566,
    "end": 2519.81,
    "text": " Um, so those things are always defined in relation to other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.83,
    "end": 2523.674,
    "text": "What they're not defined in relation to is my interests as an observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.677,
    "end": 2542.695,
    "text": "So you do get the sense of, yeah, multiple levels of selfhood, but you also get this sense that once you fixed a particular timescale, what is going to be a self or a particular space, what is going to be a self under that is not relative or variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.516,
    "end": 2543.756,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.457,
    "end": 2544.717,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.249,
    "end": 2572.594,
    "text": " um i'm just wondering whether if so rosen's a biologist i'm wondering whether is there is there a limit to like over that time scale sure it's not uh it's not boundless there are limited forms that it can take the constraints of that it sounds to me i mean the biologists will say this sounds to me like the actual physical body is very much one of those things right um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.367,
    "end": 2580.137,
    "text": " Now, I know people will say, well, the cells in your body change every however, you know, however often in the course of a lifetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2580.778,
    "end": 2584.523,
    "text": "But, you know, you say the boundary can change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2585.084,
    "end": 2596.842,
    "text": "To what degree are we taking the epithelium or wherever you want to carve your boundary to be a significant self-evidencing, if you want to use that term, sort of limit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.564,
    "end": 2598.965,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.045,
    "end": 2602.53,
    "text": "So I think the interesting thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.658,
    "end": 2610.689,
    "text": " I think in all of these things, you have this really interesting tension between there's a sense in which it can change and there's a sense in which it can't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.451,
    "end": 2619.201,
    "text": "But at each moment, I would say the current configuration of the system is pretty constraining on what it can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.822,
    "end": 2625.05,
    "text": "So in each moment, what can happen next in the very next instance is relatively limited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.951,
    "end": 2631.64,
    "text": "But as with evolution, how that can unfold over time is entirely unpredictable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.16,
    "end": 2632.42,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.44,
    "end": 2642.454,
    "text": "Because it can open up because these, these changes aren't just, I suppose, quantitative it's because, sorry, it's quantitative because they're qualitative because it's not just say an increase in size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.474,
    "end": 2648.962,
    "text": "It's not the, it's not just that the size could only go up by this much each time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.022,
    "end": 2653.548,
    "text": "It's that once the size goes up to this much, a whole other range of possibilities becomes available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.568,
    "end": 2657.794,
    "text": "Like, so you get these discontinuous sorts of change point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.275,
    "end": 2659.416,
    "text": "If you follow it through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.835,
    "end": 2661.918,
    "text": " the possibilities will be small over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.958,
    "end": 2665.925,
    "text": "They just expand beyond measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.085,
    "end": 2671.293,
    "text": "So like there's this very nice notion that Stuart Kaufman has is like the adjacent possible point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.313,
    "end": 2682.771,
    "text": "Maybe your possibility space is relatively tractable, but because as you move into one area of it, new areas open up, you can't just constrain yourself to one area of possibility space in that way for a living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.987,
    "end": 2690.636,
    "text": " So I guess the spectrum of time is really very important here in terms of the possibility space of constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2690.697,
    "end": 2696.404,
    "text": "I found it interesting you said it's not predictable because I understand that there are two ways you can kind of frame that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.764,
    "end": 2702.051,
    "text": "One is it's not predictable for me as an energy limited human being scientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.711,
    "end": 2706.396,
    "text": "And that's because I'm energy bound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.713,
    "end": 2717.931,
    "text": " And as you say, once time gets beyond the T plus one, it becomes combinatorially explosive as to the possible state spaces that I can be in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.334,
    "end": 2719.434,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.454,
    "end": 2720.656,
    "text": "That's one way of putting it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.676,
    "end": 2724.582,
    "text": "The other way of saying it's not predictable is that it's not predictable for Laplace's demon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.802,
    "end": 2732.535,
    "text": "It's not predictable in the sense that there are genuinely different options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.819,
    "end": 2749.714,
    "text": " for like there is it's not the the system really could have done otherwise right that's the classic phrase and as you know in the sort of metaphysical free will so which one are you kind of pointing to there is it genuinely the fact that because of the combinatorial explosivity of state spaces um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.285,
    "end": 2752.448,
    "text": " It's unpredictable for me, which is fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.849,
    "end": 2755.172,
    "text": "It's unpredictable for me what you're going to do next anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2755.192,
    "end": 2757.115,
    "text": "So, I mean, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2757.135,
    "end": 2779.228,
    "text": "That just shows my limits or is it genuinely the case that there is not, there is more than one path that a system can go down and therefore even the best, you know, infinitely knowing mathematician would be unable to write down the path integral that describes the, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.626,
    "end": 2783.889,
    "text": " you know, movement over the time, the diachronicity of this being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.97,
    "end": 2785.331,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.351,
    "end": 2798.003,
    "text": "So the second argument is something that I'm starting to think about, but I think you, you just have to be so careful in terms of arguing that there are genuinely random events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.264,
    "end": 2808.574,
    "text": "I think what you have with living systems is certainly the case that you can have events at a level small enough so that they could be genuinely random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.178,
    "end": 2812.263,
    "text": " can have a kind of effect that leads to a combinatorial explosion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.283,
    "end": 2815.247,
    "text": "And that's very distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.628,
    "end": 2823.54,
    "text": "So even with modern, you get macro scale events from micro scale events, even just in computers, which is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.58,
    "end": 2832.052,
    "text": "You can have these single event effects where random particle emissions flip a bit or something and an airplane crashes, which is super cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.413,
    "end": 2837.16,
    "text": "It's super cool that you can have that kind of macro scale causation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.461,
    "end": 2841.047,
    "text": " from something as small as a photon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.067,
    "end": 2845.233,
    "text": "And that's solely because of the incredibly small size of modern computer components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.734,
    "end": 2849.259,
    "text": "But what we don't have is that having ongoing repercussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.662,
    "end": 2864.363,
    "text": "That's what you could have in living systems where something like that scale of event not only causes something to crash or something macro scale to happen, but then opens up a new region of possibility space that opens up a new region and you get a combination of .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.478,
    "end": 2866.6,
    "text": " I guess the question there would be, I mean, there are two questions there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.68,
    "end": 2877.851,
    "text": "One is, is it not the case that something like a human would have an attractor set to which it's almost, again, I'm not invoking any deep telos here, but it's almost responsive to those perturbations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2877.871,
    "end": 2882.916,
    "text": "That's kind of the classic Varelian response is all we have are perturbations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.996,
    "end": 2892.105,
    "text": "And we have these, I mean, he probably wouldn't have, he didn't term it in this way because dynamical systems theory came after the kind of autoparesis, but we have this return to this attractor set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.085,
    "end": 2912.811,
    "text": " such that i have this itinerant as carl would say movement towards the attractive set but that doesn't mean i'm always in that possibility like that high possibility that peak of the gaussian i can i can sort of be pushed away but i'm always returning up the hill in some way that's one question and then added to that a more general level",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.128,
    "end": 2925.969,
    "text": " even if someone might come along and say, sure, you have these random black swan events and they have these trickle effects such that it's impossible to predict where in T plus 10, I'm gonna end up because of combinatorial explosivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.51,
    "end": 2932.74,
    "text": "Someone might come along and say, yeah, but there's actually just an even bigger attractor set, which governs the transition of you moving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.72,
    "end": 2939.227,
    "text": " into this place, which seems random, but actually like the photon affecting the plane, it was always going to happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.607,
    "end": 2944.552,
    "text": "And actually it was in the plane's ontology that it had that attractor set of ending up in the bottom of the ocean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2945.433,
    "end": 2946.354,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.374,
    "end": 2947.355,
    "text": "So I think this comes back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.415,
    "end": 2957.185,
    "text": "So the reason I haven't focused on the randomness aspect so much is precisely for the reasons that you've just been talking about is I think that's the less important component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.205,
    "end": 2959.808,
    "text": "The more important component for me is the sense in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.733,
    "end": 2971.188,
    "text": " I don't think, I think you reach a point where to continue arguing that there has to be some sort of stable attractor that can explain everything that I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.228,
    "end": 2983.766,
    "text": "It becomes so general that the selves, which is the selves kind of disappear under that because this is an attractor, this is a sort of description of invariant behavior that we all share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.267,
    "end": 2988.293,
    "text": "So we all, you know, have to couple things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.678,
    "end": 2991.682,
    "text": " anabolic and catabolic reactions in the right way to keep our metabolism going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.702,
    "end": 2993.845,
    "text": "That's a very general principle that we'll always preserve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.447,
    "end": 2998.051,
    "text": "But that doesn't give you any sort of individuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.091,
    "end": 3002.877,
    "text": "That doesn't give you a sense in which you're different from me and we're all different organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.498,
    "end": 3009.186,
    "text": "So you can have very general invariants, but those general invariants don't allow you to pick out individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.107,
    "end": 3014.213,
    "text": "Or you can have individuals, but those individuals, I think, don't have invariants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.75,
    "end": 3022.145,
    "text": " And the way that that, as I understand it, tends to be handled in the free energy principle is you kind of go to this sort of middle level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.165,
    "end": 3036.353,
    "text": "So if you're looking at what's the invariant, you know, very simple example, if you take something like a E. coli bacterium and it has that ability to switch its metabolic system, you know, from glucose to lactose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.822,
    "end": 3039.525,
    "text": " And you can say, well, you know, what's the stable model for that E. coli?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.545,
    "end": 3041.627,
    "text": "Because up to this point, it's only metabolized glucose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.647,
    "end": 3043.469,
    "text": "And now all of a sudden it's doing something completely different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.489,
    "end": 3045.511,
    "text": "That's a phase transition in its behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.191,
    "end": 3047.733,
    "text": "The strategy principle says it should die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.113,
    "end": 3049.815,
    "text": "You just go, oh, well, no, that's okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.875,
    "end": 3053.859,
    "text": "Because there's a higher level model for E. coli in general, at the level of the species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.919,
    "end": 3056.482,
    "text": "And according to that higher level species model, it's stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.463,
    "end": 3058.223,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.243,
    "end": 3058.444,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.604,
    "end": 3060.666,
    "text": "And I think that doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.726,
    "end": 3066.812,
    "text": "And I think the reason it doesn't work is because individuals can also persist through transformations in their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.113,
    "end": 3069.156,
    "text": " that are novel at the level of the species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.717,
    "end": 3079.691,
    "text": "So you know, you can have, you have these really cool examples of metabolic plasticity, in cases where things like bacteria do like swap their DNA and gain new abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.592,
    "end": 3088.644,
    "text": "And they might gain at the point at which that happens, there's going to be an individual who gains an ability that no individual of that species has ever had before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.664,
    "end": 3091.948,
    "text": "It's still be good for that individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.469,
    "end": 3094.572,
    "text": "And it's still part of that species, presumably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.72,
    "end": 3098.524,
    "text": " Well, we want to say, we want to say it's the same individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.584,
    "end": 3098.864,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3099.104,
    "end": 3104.049,
    "text": "That's part of the same species, but what's occurred has never happened before at any level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.069,
    "end": 3106.792,
    "text": "That's an individual's kind of generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.473,
    "end": 3114.26,
    "text": "So is the, so under this is the butter is the butterfly the same as the caterpillar?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3115.281,
    "end": 3115.521,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.202,
    "end": 3116.502,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.104,
    "end": 3123.729,
    "text": "Mike said this really amazing thing, which is that so butterflies, I'm curious about what you think about butterflies and caterpillars eat different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.25,
    "end": 3124.39,
    "text": "Uh-huh.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.488,
    "end": 3126.912,
    "text": " So caterpillars like leaves and butterflies like nectar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3127.734,
    "end": 3140.758,
    "text": "But if you have, so you can through sort of very low level conditioning, you can sort of make a caterpillar go to a specific leaf of a specific color because you've trained it, there's going to be food there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.008,
    "end": 3156.339,
    "text": " And what he said to me, I haven't actually looked at this, is that when it becomes a butterfly, it statistically goes back to that leaf more than by chance, which implies that despite the, and so the kind of big question there is where's the memory, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.359,
    "end": 3158.022,
    "text": "If you're a neuroscientist, you're saying, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3158.002,
    "end": 3164.09,
    "text": " I don't know what the size of a caterpillar's hippocampus is, but it's clearly, it's completely changed, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3164.11,
    "end": 3165.652,
    "text": "The architecture is completely different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.013,
    "end": 3169.618,
    "text": "And yet the cognitive function or the output of that cognitive function seems to be the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.439,
    "end": 3173.903,
    "text": "I'm not asking you to solve that paradox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.025,
    "end": 3175.726,
    "text": "Don't worry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.588,
    "end": 3180.432,
    "text": "But what I am wondering is, does the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.036,
    "end": 3187.907,
    "text": " free energy principles solution just to say, well, just broaden out the Markov blanket and just say, well, we didn't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.548,
    "end": 3193.856,
    "text": "We didn't know that the E. coli was going to become lactose metabolizing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.876,
    "end": 3196.66,
    "text": "We didn't know that the caterpillar was going to become the butterfly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.642,
    "end": 3201.087,
    "text": "Does that reduce its import?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3201.269,
    "end": 3201.449,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3201.469,
    "end": 3203.073,
    "text": "Like, is there a problem?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.133,
    "end": 3204.816,
    "text": "This is kind of a meta question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3204.836,
    "end": 3208.805,
    "text": "Is there a problem with something that's just an ad hoc or post hoc description?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.787,
    "end": 3219.868,
    "text": "And if it is just that, does it really I mean, what does the free energy principle say if it's just a post hoc or ad hoc description?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.068,
    "end": 3221.069,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.109,
    "end": 3222.431,
    "text": "So, I mean, is there a problem with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.451,
    "end": 3223.292,
    "text": "It depends what you're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.313,
    "end": 3228.918,
    "text": "If you're trying to build an ontology of living systems, I think it is a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.078,
    "end": 3241.251,
    "text": "If you're trying to describe what living systems in your experience have tended to do in a succinct and convenient way, then it's not a problem at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.132,
    "end": 3247.678,
    "text": "And I think this is the thing that comes up when I make these arguments about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.861,
    "end": 3253.726,
    "text": " living systems can change in all of these completely, not necessarily completely unpredictable, but completely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.946,
    "end": 3260.232,
    "text": "So there's kind of like a neologism that is like unprestatable in the sense that we can't write down, which people hate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.252,
    "end": 3262.193,
    "text": "And I, but I, I, it's useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.374,
    "end": 3263.034,
    "text": "It's useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.054,
    "end": 3264.095,
    "text": "We don't want to say predictable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.115,
    "end": 3268.859,
    "text": "Why am I unprestatable is we can't write down their equations in advance for that individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.099,
    "end": 3273.263,
    "text": "So it might be that all of the equations of the entire universe would allow us to predict it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.084,
    "end": 3277.767,
    "text": "But there's not one particular set, one particular mathematical model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.033,
    "end": 3281.483,
    "text": " that individual that we can write down that won't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.345,
    "end": 3286.697,
    "text": "I've completely forgotten where I started.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3287.479,
    "end": 3289.405,
    "text": "What was the question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.726,
    "end": 3293.055,
    "text": "The real question was, what does the free energy principle say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3293.44,
    "end": 3295.984,
    "text": " Like, okay, I know what it says, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.004,
    "end": 3302.934,
    "text": "I know it says that things look as if they are conducting variational Bayesian inference over, you know, their internal states look like they're doing that over external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.954,
    "end": 3322.063,
    "text": "But really, philosophically speaking, what does it say about things as they are in the universe if it's just this post hoc description of not only this, not only, like, even if you have the path integral description of free energy principle, I'll give you both the state space and the path integral formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3322.685,
    "end": 3331.615,
    "text": " If it's only saying, okay, I'm just describing how things, you know, the attractor set that they tend towards and then also the path that they tend towards, what does it actually say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3331.695,
    "end": 3334.237,
    "text": "And I don't mean here in terms of utility, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.257,
    "end": 3334.958,
    "text": "We're being philosophical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.978,
    "end": 3337.861,
    "text": "I don't care about whether it can build robots or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.881,
    "end": 3343.127,
    "text": "I'm asking just philosophically, does it actually tell us anything ontologically about what is going on in the world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.13,
    "end": 3350.835,
    "text": "So, no, I don't think the French principle does, to be honest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.001,
    "end": 3373.633,
    "text": " But I think it does raise like an interesting problem for the fact that I think it's a utility kind of argument, but I think the fact that it does seem to work quite well for allowing us to describe lots of things does raise an interesting problem for this view that if living systems don't have to stay stable, if they can change in all of these, if they can completely change their entire structure and configuration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.322,
    "end": 3376.705,
    "text": " why don't they do it more often, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.765,
    "end": 3378.286,
    "text": "Because they do tend to be stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.827,
    "end": 3385.715,
    "text": "So when I make these arguments about that kind of unprestatability, you can look at me and be like, yes, but we are homeostatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.755,
    "end": 3387.157,
    "text": "We do tend to stay very stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.197,
    "end": 3388.758,
    "text": "Our body temperature is pretty consistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.861,
    "end": 3396.567,
    "text": "And that's where what I've been really concerned with is the fact that that's not necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.827,
    "end": 3400.472,
    "text": "It doesn't have to be the case that we have to be stable in that way to continue existing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.512,
    "end": 3401.713,
    "text": "It's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.963,
    "end": 3405.469,
    "text": " that we can identify something that continues to exist if it isn't stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.81,
    "end": 3408.554,
    "text": "So it's not a necessary principle on an individual system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.015,
    "end": 3414.785,
    "text": "That makes it even more interesting to ask, given that it's not necessary, why is it so common?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.987,
    "end": 3425.203,
    "text": "And I think the position I sort of end up at is you have this kind of system that can change in all these unpredictable ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.5,
    "end": 3430.284,
    "text": " That would make it sound like the free energy principle isn't going to be useful for allowing you to describe that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.304,
    "end": 3430.884,
    "text": "Clearly it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.405,
    "end": 3437.671,
    "text": "And I think it is because there is something right about the free energy principle in the sense that we are trying to keep ourselves stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.751,
    "end": 3442.235,
    "text": "I think it's right that we're trying to do that a lot of the time, that we are trying to resist new disruptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.295,
    "end": 3444.697,
    "text": "Not always, but that is a part of what we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.737,
    "end": 3451.324,
    "text": "And a part of the reason we do that is just this kind of suppose like human gamble in the sense that this has worked for me in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.784,
    "end": 3452.665,
    "text": "Sorry, human, not human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.327,
    "end": 3455.848,
    "text": "It will probably work for me in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.233,
    "end": 3461.786,
    "text": " because that's the best we can do, not because that's a necessary requirement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.826,
    "end": 3467.239,
    "text": "Like it's an approximate strategy to what we're really trying to do, which is to keep this metabolic cycle going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.333,
    "end": 3468.653,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.214,
    "end": 3470.695,
    "text": "Yeah, there are lots of things that come up there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3470.715,
    "end": 3481.085,
    "text": "I mean, one is that I'm probably a little bit more skeptical than you about the kind of imperative aspect of this, that humans are actually trying to do anything at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.886,
    "end": 3485.369,
    "text": "At least they might be, but I don't think the free energy principle gives you that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3485.889,
    "end": 3492.355,
    "text": "I think the free energy principle gives you like, if there is one human at this point and it's the same human the next day, what do they look as if they've done?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3492.796,
    "end": 3496.099,
    "text": "And again, that's like hyper deflationary, but that's genuinely all I think it does give you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.699,
    "end": 3497.26,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3497.999,
    "end": 3509.66,
    "text": " You would need something like evolution by natural selection or some more process theory rather than the principle, I think, to give you what humans are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.881,
    "end": 3513.267,
    "text": "Because as you say, we don't need to do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3516.352,
    "end": 3521.121,
    "text": "There doesn't seem to be a prescribed law of the universe which says that I need to persist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.287,
    "end": 3523.009,
    "text": " which makes it quite remarkable that I do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.049,
    "end": 3532.199,
    "text": "And I think, I haven't really thought about this enough because I'm not a physicist, but I think this is beyond the pay grade of the free energy principle, which is why things abide by.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.339,
    "end": 3532.719,
    "text": "They do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.759,
    "end": 3537.484,
    "text": "They look as if, well, they do in some very deflationary way, but why they do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.504,
    "end": 3539.146,
    "text": "I think there are some arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3539.386,
    "end": 3547.195,
    "text": "I think Carlo Rovelli has some arguments about why there are these neg entropy pockets in an otherwise increasingly entropic universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.877,
    "end": 3550.298,
    "text": "I'll have to speak to him about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3550.683,
    "end": 3553.607,
    "text": " Um, but yeah, it's, it's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3553.627,
    "end": 3563.501,
    "text": "I mean, I mean, again, I won't go back to it because I think we've covered this a lot, but I think the fact that you said that the S the, the self, whatever that is, can persist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3564.762,
    "end": 3578.141,
    "text": "Uh, even if we disrupt this kind of attractive attractor set idea, like even if things don't tend back to equilibrium, that the same thing can persist, I think is a really interesting idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3578.982,
    "end": 3579.222,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3580.113,
    "end": 3593.746,
    "text": " I don't know how much I agree with it only because I don't know what, if we're talking about the same thing, when we talk about the self or the same thing or what equilibrium really is, I completely agree that, uh, there is no such thing as perfect equilibrium, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3593.766,
    "end": 3599.911,
    "text": "I mean, I mean, in and of itself, we need information transfer to act for that to be anything, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.372,
    "end": 3602.394,
    "text": "If not, it's just what there's nothing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3602.934,
    "end": 3603.895,
    "text": "Things need to be changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.796,
    "end": 3608.179,
    "text": "Um, what that means in terms of identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.218,
    "end": 3611.159,
    "text": " I'll need to read the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3612.041,
    "end": 3615.946,
    "text": "I have to preface this by saying I haven't read the book, and I will read the book, but I haven't read the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.367,
    "end": 3626.402,
    "text": "But what I have read and what I want to go on to are your more shorter, although some are quite long, philosophical papers and the articles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.143,
    "end": 3635.635,
    "text": "So I thought they were really cool, really, really insightful and very, very thought-provoking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.307,
    "end": 3652.462,
    "text": " And you, as you say, you focused sort of before the book on perceptual phenomenology or what kind of more specifically visual experience and sort of probing this question of to what degree is perception enslaved by action, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3652.482,
    "end": 3656.326,
    "text": "Like perceptual experience as is, as can be attested in the phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3657.888,
    "end": 3660.83,
    "text": "Why does it appear as it is and how much is that to do with action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3660.991,
    "end": 3663.613,
    "text": "So I guess the first question I'll ask you very generally,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3664.032,
    "end": 3672.223,
    "text": " for the audience, although I kind of have a notion because I read the papers, is to what degree is perception the slave of action and to what degree is it not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3673.605,
    "end": 3682.076,
    "text": "Yeah, so I think my thinking on this is very strongly influenced by this philosopher called Susan Hurley, who is a very early activist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.216,
    "end": 3693.01,
    "text": "Well, she doesn't describe herself as an activist, but she's, I think, meets... I think she absolutely makes sense to be described as an activist in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.698,
    "end": 3695.621,
    "text": " in quite a narrow use of that term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.662,
    "end": 3707.583,
    "text": "So not just anti-representational, but as in being interested in the dependence of perception of action and her kind of big focus is on something that she calls the myth of the giving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.124,
    "end": 3710.088,
    "text": "Well, it's not a big, there's one of her many fixes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.53,
    "end": 3717.04,
    "text": "But so the myth of the given is the, you know, this idea that we just receive conceptual content from the world in perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.066,
    "end": 3729.085,
    "text": " And a way of avoiding that is to go, well, no, you know, our experience is constructed relative to our actions, but then you're presuming that the content of an action is already known, that you have an account of what it is for an action to have a goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.966,
    "end": 3736.518,
    "text": "I think this move to say perception is for action is sort of correct, but it doesn't really solve anything because then what is action for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.541,
    "end": 3743.77,
    "text": "And too often people, too often I feel people sort of stop at this perception is for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.138,
    "end": 3749.206,
    "text": " And look, that allows us to explain a lot of things about perception, but they're already, they're kind of presuming a concept of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.226,
    "end": 3753.734,
    "text": "But what it is for an action to have a purpose isn't already that well understood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.395,
    "end": 3755.477,
    "text": "So yes, perception is for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.517,
    "end": 3757.26,
    "text": "Action is also for perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.3,
    "end": 3760.024,
    "text": "You know, it's a circular dependence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.144,
    "end": 3760.385,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.927,
    "end": 3768.458,
    "text": "But what is this whole circular dependence of action and perception itself in service of is I think the interesting question that kind of lies behind that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.573,
    "end": 3771.036,
    "text": " Well, active inference gives you a nice answer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.617,
    "end": 3772.358,
    "text": "Well, does it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3773.759,
    "end": 3774.921,
    "text": "Maybe predictive processing does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3775.902,
    "end": 3779.726,
    "text": "Actually, let me ask you, does active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.766,
    "end": 3785.413,
    "text": "Predictive processing, I guess, does because it has some underlying teleology that it's about prediction error minimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3786.775,
    "end": 3787.375,
    "text": "Is that the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3787.395,
    "end": 3794.364,
    "text": "I mean, it says how the brain seemingly minimizes prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3794.945,
    "end": 3797.888,
    "text": "When you say, why is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.29,
    "end": 3801.013,
    "text": " Why are perception and action coupled in this interesting way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3801.053,
    "end": 3803.096,
    "text": "And you talk about sensory motor contingencies or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3803.677,
    "end": 3809.604,
    "text": "And the answer from an active inference person would probably be like, well, it's all in the game of reducing variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3810.325,
    "end": 3811.887,
    "text": "Is that a satisfying answer for you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3813.489,
    "end": 3813.689,
    "text": "No.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3813.709,
    "end": 3813.949,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3814.31,
    "end": 3814.79,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.81,
    "end": 3822.019,
    "text": "Because I think you can, you know, you can say all sorts of things are in the service of something else, but for that thing in itself to be a purposive process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.978,
    "end": 3825.02,
    "text": " That's very difficult to make sense of, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.04,
    "end": 3832.246,
    "text": "And there's a really nice paper by, I think it's Tony Chimero and, gosh, I've forgotten his first name, after, Michael Anderson.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.167,
    "end": 3834.448,
    "text": "Yeah, there's a Michael Anderson, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3834.488,
    "end": 3837.27,
    "text": "Do you have, this is the problem with only reading people's papers, yeah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.33,
    "end": 3839.072,
    "text": "No, I know, I know about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3839.672,
    "end": 3845.658,
    "text": "But yeah, and it's like really short, but they just make this distinction between like notions of predicting, like two notions of prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.798,
    "end": 3851.803,
    "text": "So you can have, one thing is predictive of something else, so you can call it a predictive of rain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.577,
    "end": 3863.056,
    "text": " And if you just use prediction in that sense, then you can say everything is in the service of minimizing prediction error, because everything is in the service of being correlated with what it is in fact correlated with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.077,
    "end": 3868.206,
    "text": "So if something happens, the thing that is most likely to happen after it is particularly likely to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.945,
    "end": 3893.046,
    "text": " incredibly deflationary boring incredibly deflationary so you can have that notion of prediction and everything is being predictionary minimizing that does allow you to describe all sorts of things as predictionary minimizing which arguably what the free energy principle just as an addendum arguably the limit of the free energy principle um so i think if all you're trying to describe are predict what you can call predictive relationships",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.583,
    "end": 3896.507,
    "text": " all very well and good, but a predictive relationship is not a prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.108,
    "end": 3897.989,
    "text": "It's not a predictor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.672,
    "end": 3916.215,
    "text": "So to say that everything is in the service of minimizing free energy or minimizing prediction error, there needs to be an account of what makes the minimization of prediction error a purposive process, as opposed to just, I look at these two things as predictive of one another and see that they're correlated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.755,
    "end": 3918.578,
    "text": "What makes it an attempt or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.317,
    "end": 3921.24,
    "text": " you know, what makes it a goal directed prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.921,
    "end": 3923.544,
    "text": "That's what's not in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.584,
    "end": 3935.482,
    "text": "It's not what's it that's what's not in prediction, predictive processing, that we either go deflationary, or we presume that there's an agential and predict predict or a predicting process going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.542,
    "end": 3937.004,
    "text": "It's not really predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.647,
    "end": 3943.354,
    "text": "But what makes it a purposeful prediction is exactly what isn't in this framework, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.474,
    "end": 3943.975,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3943.995,
    "end": 3944.656,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3944.676,
    "end": 3945.337,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3945.357,
    "end": 3947.721,
    "text": "I mean, arguably, I mean, I'm not gonna I've actually have no",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3948.612,
    "end": 3974.687,
    "text": " bone to pick here with any of this i'm happy to leave it all open but arguably it's because there isn't any purposeiveness or agency but anyway you actually took my question way deeper than i was going to what i meant by it which was that um but i like that it's a really it's a nice add-on to the conversation we've actually just been having um i meant more that uh you write and i think a lot of this is influenced also by andy and andy's work and it's almost a response to andy's work which is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3974.836,
    "end": 3982.584,
    "text": " perception, in many ways, is nothing more than the process that kind of puts you in contact with action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3983.504,
    "end": 3988.209,
    "text": "But I mean, that we perceive the world in a certain way, because it licenses us to act on the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.269,
    "end": 3998.199,
    "text": "And I've been kind of thinking this almost in terms of consciousness more generally, maybe all consciousness is this kind of coarse graining filter that permits action upon those phenomenal contents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3999.62,
    "end": 4001.502,
    "text": "And here you talk about the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.667,
    "end": 4005.591,
    "text": " intermediate level representations or intermediate level processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.192,
    "end": 4010.317,
    "text": "So what did you what is intermediate level processing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4010.337,
    "end": 4012.86,
    "text": "What are the kinds of claims of that position?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.98,
    "end": 4013.38,
    "text": "That theory?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.941,
    "end": 4014.561,
    "text": "Yeah, I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.582,
    "end": 4019.988,
    "text": "I think, I think it's Jesse Prince, and Frank Jackendall for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.008,
    "end": 4022.611,
    "text": "Yeah, they're the kind of original intermediate level people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.492,
    "end": 4029.278,
    "text": "And what really nice about predictive processing is obviously anything hierarchical, is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.595,
    "end": 4031.378,
    "text": " You don't have to have just one intermediate level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.859,
    "end": 4033.942,
    "text": "There's layers of levels, so you can move up and down them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.445,
    "end": 4044.439,
    "text": "What the intermediate level idea gets at is this idea that what we as agents act upon are not individual subatomic particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.845,
    "end": 4052.312,
    "text": "We don't act at that level, and we don't act at the level of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.579,
    "end": 4058.345,
    "text": " planet, you know, we act in a level of, you know, glasses and bottles and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.545,
    "end": 4059.286,
    "text": "And I think that's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.366,
    "end": 4071.519,
    "text": "But what I became interested in, in particular, first thing was that, you know, we don't act on one level of reality, of reality, spatio temporal scale, you know, what we're interested in acting on depends on the circumstance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.0,
    "end": 4078.587,
    "text": "And there's lots of nice sort of perceptual psychology experiments that shows the level of detail we perceive also depends on the circumstance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.955,
    "end": 4081.358,
    "text": " Um, of what our actions are relative to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.418,
    "end": 4090.689,
    "text": "So there are these things called Navon figures, which I don't, I'd be nice to be able to get a picture of one up actually, but basically they're just a shape made up of lots of little smaller shapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.769,
    "end": 4093.613,
    "text": "You can have like a H made up of little H's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.674,
    "end": 4097.478,
    "text": "Um, and there's a general global precedence effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.498,
    "end": 4101.382,
    "text": "So people tend to see the bigger letter rather than the letters that make it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.183,
    "end": 4105.367,
    "text": "Unless you present that in the context of asking someone to read a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.888,
    "end": 4106.008,
    "text": "Right."
  },
  {
    "start": 4106.377,
    "end": 4110.826,
    "text": " If they're asked to read a paper, then they're in reading mode and they're perceiving at the level of the individual letters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.367,
    "end": 4114.193,
    "text": "If you ask them to identify a figure, they're perceiving at the level of the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.157,
    "end": 4124.233,
    "text": "And you get nice effects where this doesn't just happen on a sort of immediate situation basis, but based on the kind of actions that you habitually engage in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.315,
    "end": 4128.942,
    "text": "So one of my favorite results, and I cannot remember the citation right now, I think it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.411,
    "end": 4137.904,
    "text": " Lee, the main author's name is Lee, but it's a paper showing that people who play a lot of Call of Duty, Call of Duty one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.045,
    "end": 4139.646,
    "text": "I like that one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.588,
    "end": 4141.669,
    "text": "It dramatically changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.75,
    "end": 4142.671,
    "text": "I really love that result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.773,
    "end": 4151.384,
    "text": "So people's, yes, we're sort of perceiving at the rough medium level of the hierarchy, but that's going to vary a lot with the kind of things that you do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.444,
    "end": 4158.675,
    "text": "And you know, like you can imagine a visual artist's perception is going to be very different for that reason, because they are operating perhaps at a finer grain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.892,
    "end": 4162.738,
    "text": " or even perhaps a more coarse grain with a good degree of regularity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.599,
    "end": 4163.699,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.36,
    "end": 4172.792,
    "text": "So yeah, it was kind of like taking the intermediate level view of consciousness and saying, if we've got more than one middle level, like is it, you know, how does that actually shift with action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.832,
    "end": 4177.539,
    "text": "And it makes nice sense of lots of experiments, like some sort of inattentional blindness type experiments and that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.12,
    "end": 4178.68,
    "text": "Really nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.7,
    "end": 4178.881,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.941,
    "end": 4186.772,
    "text": "So this is, I can just tell people this is Lee and colleagues 2009 enhancing the contrast sensitivity function through action video game training.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4187.242,
    "end": 4187.843,
    "text": " Brilliant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4187.863,
    "end": 4188.924,
    "text": "Nature neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4189.325,
    "end": 4189.545,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.025,
    "end": 4190.426,
    "text": "Really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.766,
    "end": 4197.395,
    "text": "I mean, I, I have to take this opportunity to plug myself, um, funnily enough, because before we even started speaking, it's, it's weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.435,
    "end": 4209.69,
    "text": "I went on this, I just wrote this paper called, um, it's titled currently how preferences in slave attention, uh, calling into doubt the exogenous endogenous distinction from the perspective of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4210.691,
    "end": 4216.118,
    "text": "And it's really funny because I try and give a really formal account of exactly this, which is, I think that, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.79,
    "end": 4220.119,
    "text": " attention is ultimately governed by the priors that we possess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4220.4,
    "end": 4226.135,
    "text": "And there's a really, but I think what's interesting about this is the interplay of the preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4227.579,
    "end": 4232.031,
    "text": "So for example, I talk about this in the paper, I say, why",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.213,
    "end": 4235.938,
    "text": " do I, you know, why am I paying attention to speaking to you right now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.998,
    "end": 4241.105,
    "text": "But then a fluffy dog might walk into the room and suddenly my attention is all geared towards that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4241.125,
    "end": 4245.291,
    "text": "But then I have this sort of countervailing preference to go back to speaking to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4245.411,
    "end": 4253.201,
    "text": "And then suddenly if the building starts burning, I'm going to have absolutely no choice, but to pay attention to the fire and to jump out of the corner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4253.542,
    "end": 4260.211,
    "text": "So it seems like in addition to the hierarchical generative model, that maps quite nicely onto a hierarchy of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4260.832,
    "end": 4260.972,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.205,
    "end": 4268.275,
    "text": " And I've been trying to answer or explain what governs that hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.116,
    "end": 4269.697,
    "text": "I'm just curious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4269.817,
    "end": 4276.947,
    "text": "I mean, I can send you the paper because it really is very, very, I mean, amazingly convergent with your paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4276.967,
    "end": 4277.908,
    "text": "And I should have read it before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4277.968,
    "end": 4278.829,
    "text": "And it's my fault.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4278.849,
    "end": 4279.831,
    "text": "But you are now cited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4281.753,
    "end": 4283.095,
    "text": "Because I've been reading, obviously, your work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4283.598,
    "end": 4298.434,
    "text": " been thinking about so for example why is it that when i'm completely ravenous all i can pay attention to is the fridge and you know the the food around me like the sources of food the potential sources of food and i argue that i think it might be two fold one is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4298.6,
    "end": 4302.965,
    "text": " Uh, those preferences are encoded deeper in the generative hierarchy than other preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4303.746,
    "end": 4305.348,
    "text": "I think that's the reason why that's important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4305.368,
    "end": 4312.537,
    "text": "Cause if you're a predictive processing person, that means that the predictions issuing from that deeper level are modulating all of the more superficial levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4313.598,
    "end": 4315.961,
    "text": "So I think that, I think that stands right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4316.041,
    "end": 4324.651,
    "text": "Because it's like, if there was something above it, that itself, the thing that we're talking about would itself be modulated, but my hunger is never really modulated, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4324.671,
    "end": 4327.695,
    "text": "Like if I'm starving, there's not much more that can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.148,
    "end": 4351.607,
    "text": " a top-down change that that's one thing the depth the other thing was precision waiting i think that these preferences right so why when i'm ravenous uh do i go out and get food um and pay attention to food more than anything is because that preference gets extra precision waiting extra synaptic gain um i'm curious about just generally what you think about that proposal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4352.279,
    "end": 4360.647,
    "text": " And whether there's a, like there are added dimensions to this kind of, um, attentional hierarchy that needs to be countenanced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4360.667,
    "end": 4379.164,
    "text": "I mean, I think what I like about it, what you, how you've just described it in particular is when you think of something like hunger and the kind of significant role it plays, it's just one of those nice cases where you have this view, if you have, if you approach this view of like a hierarchical view of cognition from a very maybe classical cog side perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.971,
    "end": 4384.638,
    "text": " your view of what's going to be at the top, what's going to be the really fundamental thing that's modulating everything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.519,
    "end": 4398.477,
    "text": "It's so different from when you approach it through actually being a human being in the world who gets hungry, who realizes that the things that modulate everything else you do aren't things like the truths of logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.822,
    "end": 4408.071,
    "text": "So yeah, I think I like that idea that I think hunger is a really good example of where you see that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.253,
    "end": 4415.622,
    "text": " you know, your hyper priors or your fundamental priors aren't, is purely rational, pure, like sort of rational, detached truths about how the world works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4415.642,
    "end": 4420.408,
    "text": "They're things about their needs, essentially, you know, that's what's at the root of it all is needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.43,
    "end": 4437.028,
    "text": "And how that relates to all the like attentional switches we actually make in everyday life, you know, when we're distracted by like a cute animal or like how that emerges out of these really fundamental needs is obviously super hard to draw",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.312,
    "end": 4439.094,
    "text": " draw out because it's so so complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.496,
    "end": 4445.5,
    "text": "But yeah, when you have something like you do you see hunger makes it apparent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.921,
    "end": 4449.704,
    "text": "Well, because there seemed to me to be a, there's a dynamic element to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4449.925,
    "end": 4454.609,
    "text": "So I think what I say also very explicitly in the paper is that we're not always paying attention to being hungry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4455.47,
    "end": 4457.132,
    "text": "Because if I did, I would be obese, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.152,
    "end": 4459.454,
    "text": "Like, it would just be really, really bad for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4460.655,
    "end": 4464.139,
    "text": "However, that so that that's one dimension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4464.159,
    "end": 4465.48,
    "text": "The other dimension is the fact that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.185,
    "end": 4469.029,
    "text": " However, when I am hungry, it takes precedence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4469.469,
    "end": 4476.098,
    "text": "It's not a paradox, but there's a kind of tension there, which is that it doesn't always seem to be occupying super high precision weight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4477.08,
    "end": 4488.775,
    "text": "But when I have prediction error or free energy with respect to that preference, there seems to be a prioritization of the fulfilling of that preference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4488.996,
    "end": 4495.264,
    "text": "So I invoke something like a higher order mental action policy, which is something like when...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.649,
    "end": 4500.915,
    "text": " there is free energy at this level, put extra precision, synaptic gain on that preference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4501.916,
    "end": 4517.512,
    "text": "Another interesting idea I could run through with you is the idea that I don't think that, I think these priors, these hyper priors or phenotypic priors, whatever you want to call them, they might have inherently quite high precision weight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4517.873,
    "end": 4520.796,
    "text": "And I'm curious about what you think of this just phenomenologically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4521.232,
    "end": 4530.512,
    "text": " I've been trying to think whether it's the case that in some ways a very phenomenal experience is shaped by these priors in very subtle ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4530.632,
    "end": 4539.932,
    "text": "And I think that comes out in the fact that I may not be aroused or hungry or scared, but if there's a loud noise, I'm immediately aroused.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4540.368,
    "end": 4541.23,
    "text": " paying attention to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4541.891,
    "end": 4561.549,
    "text": "Or I might notice, you know, like, there's a reason why advertising works, right, I might find myself getting drawn to a poster of a burger or whatever, which implies to me that either this, this higher order policy is very sensitive, very contextually sensitive, and at the slightest contextual cue, it will just deploy high precision, or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4562.558,
    "end": 4573.613,
    "text": " There's a kind of standard baseline level of precision weight that these preferences have such that when they reach over, it's very easy for them to reach over a threshold such that they grab attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4573.633,
    "end": 4575.115,
    "text": "I'm not quite sure how to unpick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4575.135,
    "end": 4575.395,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.415,
    "end": 4578.479,
    "text": "Like sort of a low threshold for activation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4578.84,
    "end": 4579.921,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.941,
    "end": 4590.015,
    "text": "So I'm not, I'm just curious about what you think about, I mean, I'm curious really fundamentally about what you think about the phenomenological idea that our experience is permeated by those preferences, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4590.035,
    "end": 4592.278,
    "text": "Our attention in many ways is permeated by those preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4592.495,
    "end": 4593.316,
    "text": " Is that the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4593.796,
    "end": 4606.631,
    "text": "Or can you imagine sort of, is it the case that if I am well sated and so on hunger as a, or, or satiation just basically doesn't affect my cognition whatsoever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4606.851,
    "end": 4612.297,
    "text": "What is there a kind of, what's the kind of blurry level of influence you think those preferences have?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4614.219,
    "end": 4615.54,
    "text": "Yeah, that's a really interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.56,
    "end": 4621.126,
    "text": "Like to what extent is your phenomenology shaped by your needs when your needs are satisfied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.487,
    "end": 4621.607,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.942,
    "end": 4628.969,
    "text": " I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4628.989,
    "end": 4630.13,
    "text": "I'm not sure how to think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.25,
    "end": 4631.191,
    "text": "I think it's an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.251,
    "end": 4634.134,
    "text": "I haven't thought about the visual phenomenology stuff in so long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.874,
    "end": 4640.159,
    "text": "Whenever anyone asks me a question about it, there's that tendency to sort of go and be like, what is my visual phenomenology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.44,
    "end": 4648.067,
    "text": "I mean, if anyone's listening, if anyone knows whether Merleau-Ponty or whoever, but I'm sure someone's spoken about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4649.128,
    "end": 4651.51,
    "text": "Maybe one aspect is I suppose,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.857,
    "end": 4664.55,
    "text": " Maybe what I would say is I think that we, those are like going to be, you know, your basic financial needs, but I think as you become a human being, as you become a person, this is my middle point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.57,
    "end": 4666.192,
    "text": "He's not great, but I know he talks about some stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.913,
    "end": 4673.34,
    "text": "Um, as you become a person, you develop things that take on the same kind of status as these more basic phenotypic needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.741,
    "end": 4679.187,
    "text": "I suppose what I would say is I don't think there's ever a situation where all of your needs are satiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.928,
    "end": 4680.028,
    "text": "Yeah."
  },
  {
    "start": 4680.262,
    "end": 4702.168,
    "text": " Because you all, you develop other needs that, you know, they don't initially take on the level of a need to like, you know, a desire to have your parent, maybe desire to have your parents approval is probably, but you can, you can pick up, you know, new things that are initially aren't need, but they become so integral.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.469,
    "end": 4705.173,
    "text": " to your identity that they become a need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.573,
    "end": 4713.725,
    "text": "And then those needs are shaping your perception in a way that when hunger isn't shaping your perception, that's not to say that no needs are, it's just to say that a different need takes salience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.746,
    "end": 4726.924,
    "text": "And I think this is a really nice, this idea, that's what's so beautiful to me about this idea of need as being fundamental, need unidentified, like constitutive needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.745,
    "end": 4731.43,
    "text": "It's very amenable to being found",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.967,
    "end": 4734.55,
    "text": " both at the biological level and at the social level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.61,
    "end": 4742.058,
    "text": "So there's a philosopher called Christine Korsgaard, who has a lot of work on this idea of self-constitution, that as humans, we constitute our identities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.859,
    "end": 4746.143,
    "text": "And that gives us needs that we have to act upon to constitute ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.203,
    "end": 4749.206,
    "text": "And it's very Kantian, but it's very sort of rationalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.386,
    "end": 4754.352,
    "text": "I mean, she's interested in animals, but it's generally described in quite rationalistic human conscious terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.072,
    "end": 4758.396,
    "text": "But it's the same kind of thing going on there is when you're hungry and you need to eat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.476,
    "end": 4761.94,
    "text": "When I'm not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.05,
    "end": 4767.837,
    "text": " acting in a way that's consistent with my, my view of my identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.897,
    "end": 4772.102,
    "text": "There's like a need that I'm trying to fulfill and failing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.122,
    "end": 4774.866,
    "text": "Same way as when I'm hungry, and I'm not able to get food, there's a need there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.906,
    "end": 4776.148,
    "text": "And I'm trying to fill in failing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.548,
    "end": 4780.634,
    "text": "Yeah, I mean, I guess that too far off base, but no, no, no, I think that's absolutely right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4780.654,
    "end": 4782.797,
    "text": "I think just thinking about it, you know, even now,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4784.009,
    "end": 4791.446,
    "text": " I think there's what I wonder whether there's always a sort of trickle back to some overarching hyper prior, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.507,
    "end": 4797.3,
    "text": "So I want to write a great paper because I want to impress my parents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.32,
    "end": 4799.084,
    "text": "Well, it's kind of Aristotelian in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4799.104,
    "end": 4801.47,
    "text": "Well, why do I want to please my parents?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4801.51,
    "end": 4802.372,
    "text": "Well, because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4803.112,
    "end": 4804.874,
    "text": " I want, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.914,
    "end": 4806.455,
    "text": "I mean, why would one want to be there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4806.475,
    "end": 4808.157,
    "text": "They don't, I don't know, evolutionarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4808.177,
    "end": 4810.439,
    "text": "So they don't throw me in the bin or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4810.459,
    "end": 4812.561,
    "text": "Um, and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4812.582,
    "end": 4815.805,
    "text": "And I was just wondering whether that gets where that gets bottomed out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.265,
    "end": 4829.018,
    "text": "But I think that's also what I mean by this idea that these hyper priors permeate our lived experience, because even if this is actually just an instrumental description, I won't say all of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4829.521,
    "end": 4834.466,
    "text": " all behavior or all perception can be traced back to a limited set of hyper-priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4834.486,
    "end": 4837.909,
    "text": "But I think some, uh, some can, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.929,
    "end": 4849.821,
    "text": "So some very superficial goals or seemingly superficial goals like finishing a paper have the capacity to be really embedded within a deeper preference of being happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4850.121,
    "end": 4850.321,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4850.421,
    "end": 4855.326,
    "text": "Ultimately, I guess the only question there would be hunger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4856.437,
    "end": 4871.93,
    "text": " something like hunger, or more phenotypic needs, they almost seem less like that, because they don't seem to engender this kind of deep hierarchy, where they don't seem to be plenty of things I do, because they indirectly contribute to my society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4874.035,
    "end": 4877.061,
    "text": "They almost seem like a different type of prior such that they",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4877.733,
    "end": 4885.667,
    "text": " need to be fulfilled, but they're almost singular in the fact that fulfillment can only come through like particular action policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4885.707,
    "end": 4887.631,
    "text": "Anyway, this is super off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4888.412,
    "end": 4892.8,
    "text": "I'm just sort of, I guess that they're interesting because they're both very basic and very specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.18,
    "end": 4893.421,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.441,
    "end": 4896.366,
    "text": "Like anger as a need is very fundamental, but also there are very.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.903,
    "end": 4898.326,
    "text": " specific things that can refill it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.346,
    "end": 4899.147,
    "text": "It's not very general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.167,
    "end": 4902.815,
    "text": "Whereas if you take a more basic need, like I need to have a coherent identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.336,
    "end": 4904.758,
    "text": "I need to have a coherent personal identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.778,
    "end": 4905.86,
    "text": "That's everywhere, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4905.881,
    "end": 4906.842,
    "text": "That's just everywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4906.882,
    "end": 4907.163,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.183,
    "end": 4909.608,
    "text": "And there's so many different ways that I could fulfill that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.668,
    "end": 4914.878,
    "text": "So you might be able to trace back my having this conversation with you about my philosophical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4915.195,
    "end": 4917.538,
    "text": " to a need to have a coherent, practical identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.139,
    "end": 4923.686,
    "text": "But you can't get from the need to have a coherent, practical identity to this particular manifestation of it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.766,
    "end": 4925.688,
    "text": "It's very underspecified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4925.748,
    "end": 4935.04,
    "text": "There's a really nice, I think it's the idea of the deductive impotence of this kind of idea of an identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.28,
    "end": 4938.604,
    "text": "So it constrains what you can do, but in such a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.343,
    "end": 4967.916,
    "text": " limited way that there's so many different possibilities that are compatible with it and what's interesting about hunger and these more phenotypic needs i think is that they are really fundamental but also a lot more specific you know you can derive what i must do to fulfill it um so i think that would be a difference yeah no that's interesting ah this is gonna be fun editing um that's all right that's what academic academia is for cool well i think just on that point another thing i think is interesting as well is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.516,
    "end": 4975.364,
    "text": " When you think of, I think you get this view where some of our needs are really manifestations of social needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.844,
    "end": 4982.593,
    "text": "So for society to work, it needs to be constructed, made up, you could argue, it needs to be made out of individuals that have coherent practical identities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.954,
    "end": 4989.482,
    "text": "Like if we don't have coherent identities, if what I'm doing now is completely and utterly unrelated to what I'll do tomorrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.901,
    "end": 4995.027,
    "text": " then you have no ability to interact with me meaningfully because I can't make any commitments to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.567,
    "end": 4997.85,
    "text": "That's really, yeah, that's really interesting actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4997.87,
    "end": 5010.084,
    "text": "There's a sense there in which you can see why my need for a coherent practical identity, by which I mean just being a sort of predictable person over time who's committed to certain projects and follows certain narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.985,
    "end": 5016.451,
    "text": "If I don't have that, then that's not just necessary for me, but that's necessary for us as a whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.791,
    "end": 5019.334,
    "text": "And it becomes a very primitive need of a group of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.702,
    "end": 5020.824,
    "text": " Um, which I think is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.844,
    "end": 5041.518,
    "text": "Do you think that says anything interesting about sort of, um, it comes back to constraints in many ways that, uh, do you feel like there's one or, or, you know, we think perhaps of the kind of more like the, the hype of, you know, Aristotle would afford of a high provider if he had that language as, um, you die Monia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5041.538,
    "end": 5041.698,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5041.939,
    "end": 5045.164,
    "text": "And in the case of humans, it would be, it would be reason excising our reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.685,
    "end": 5045.845,
    "text": "Mm-hmm .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.803,
    "end": 5054.561,
    "text": " And the way that you say, well, having a fixed identity or having a set identity or a stable identity is downstream on me being a functioning member of society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5054.601,
    "end": 5063.822,
    "text": "And then if you ask the Marxist, it would be because that affords you the opportunity to, you know, uh, be a, be a capitalist slave or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5063.862,
    "end": 5064.223,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.145,
    "end": 5065.285,
    "text": "Um.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5066.193,
    "end": 5073.741,
    "text": " But you know, they might say, well, in that ways, you're just a kind of your preferences are just a vehicle for a broader political socio political structures, preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5074.421,
    "end": 5077.645,
    "text": "And that might be ground that and then, you know, what's the authority over that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5078.145,
    "end": 5080.548,
    "text": "Well, is there is there a point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5080.608,
    "end": 5083.15,
    "text": "I mean, I guess my question is there a point where those preferences ground out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5083.991,
    "end": 5089.737,
    "text": "Or is it philosophically vague as to how recursively, you know, recursive that can go?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5090.598,
    "end": 5095.643,
    "text": "Yeah, and I think so for me, I think where those preferences ground out, they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.298,
    "end": 5100.045,
    "text": " In terms of scale, you can have them being instantiated at lots of different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.065,
    "end": 5103.371,
    "text": "They can be the preference of a society and the preference of individuals within that society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.792,
    "end": 5111.146,
    "text": "But what they ground out in is this idea of the ability to coherently constitute yourself over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.386,
    "end": 5114.953,
    "text": "Because in as far as your identity, isn't it something that you can take as a given?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.454,
    "end": 5119.622,
    "text": "It's not just that, you know, like a rock will just continue to exist whether or not you do anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5120.092,
    "end": 5121.895,
    "text": " You have to continuously do something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.376,
    "end": 5124.339,
    "text": "You have to create yourself into the future in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.401,
    "end": 5128.286,
    "text": "Whether I exist in the future depends on my success now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.99,
    "end": 5136.259,
    "text": "The ultimate constraints are going to be, there are things that I can't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.379,
    "end": 5139.284,
    "text": "There are things that if I do them now, I won't continue to exist in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.805,
    "end": 5141.929,
    "text": "And there are things that I have to do to continue to exist in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.53,
    "end": 5145.795,
    "text": "But in the space of things that I have to do to continue existing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.248,
    "end": 5147.65,
    "text": " the possibilities are pretty vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.371,
    "end": 5151.737,
    "text": "There's tons and tons of different ways I could continue my existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5151.777,
    "end": 5161.071,
    "text": "So from the fact that I have to continually construct this continuous self-process, that tells you very little about how I have to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.013,
    "end": 5171.127,
    "text": "It tells you things that I can't do, but it gives you very little traction in pinning down what I will do at each moment in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.247,
    "end": 5173.15,
    "text": "So in as far as there are these kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5173.433,
    "end": 5196.572,
    "text": " ultimate constraints they don't get you super far in pinning and constraining any particular individual yeah yeah yeah yeah well there's always that you know there is always that individual versus collective or that that that that dialectic right like and i guess that is that's imminent in active inference more fundamentally right like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5197.193,
    "end": 5202.962,
    "text": " Unless we, I don't think any of us have this kind of notion of a process ontology where it's totally loose that you could be anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.146,
    "end": 5205.486,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.506,
    "end": 5208.271,
    "text": "I don't want to go back to that because we've, I don't think there's an answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.514,
    "end": 5212.237,
    "text": "Talking about grounding out and bottoming out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5212.798,
    "end": 5216.484,
    "text": "I want to go back if I may, to this notion of intermediate level processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5218.407,
    "end": 5218.948,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5219.232,
    "end": 5234.429,
    "text": " So perception, if I've read these papers correctly, perception in many ways is sort of the guide of action because it allows you in phenomenal space, that which emerges in phenomenal space is that which you can act on, let's say, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5234.449,
    "end": 5236.532,
    "text": "So it kind of very JJ Gibson idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5237.313,
    "end": 5245.662,
    "text": "But the reason why I don't perceive the atoms of my phone is because I can't grasp atoms, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5245.642,
    "end": 5250.269,
    "text": " So there's this nice mutual coupling and that runs down all the way down to the phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5250.85,
    "end": 5261.366,
    "text": "But as you say very nicely in your paper, if I take a brick wall, I think this is a Husserlian idea, if I have a brick wall, there isn't one level at which I can perceive that brick wall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5262.368,
    "end": 5266.975,
    "text": "I can stand away from it such that it becomes a kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5266.955,
    "end": 5271.407,
    "text": " ambiguous mass of brick or something, but I can't see the individual bricks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5272.41,
    "end": 5273.373,
    "text": "Or I can go even closer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.413,
    "end": 5278.306,
    "text": "And you know, there's this illusion of the cigar or whatever, and I can stop, I can notice this guy, and I can then look in his car.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5278.507,
    "end": 5281.234,
    "text": "And there's kind of this fractal nature of perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5281.754,
    "end": 5284.116,
    "text": " So we were talking about grounding out and bottoming out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.617,
    "end": 5287.359,
    "text": "You speak about this a little bit in your paper, but I'm curious about what you think now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.02,
    "end": 5291.263,
    "text": "Is there a point at which perception bottoms out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5293.185,
    "end": 5300.712,
    "text": "And is that, again, just mapable to action such that it grounds out at the point where I can't act, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.732,
    "end": 5301.874,
    "text": "I can always grab the cigar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5301.914,
    "end": 5308.06,
    "text": "I can always, I don't know what I could do with the sort of brick wall, but in principle, I could do something with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5308.14,
    "end": 5311.643,
    "text": "Is there a, yeah, where does that chain stop?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5312.652,
    "end": 5314.074,
    "text": " Yeah, I just need to get some water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5314.094,
    "end": 5314.814,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5314.834,
    "end": 5316.296,
    "text": "Yeah, no worries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5316.316,
    "end": 5317.517,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5318.418,
    "end": 5321.081,
    "text": "So yeah, what is perception ground at what level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.026,
    "end": 5337.5,
    "text": "I mean, I know there's experiments, you know, you can look at all this sort of stuff on what is the actual capability of the senses that we have, in terms of people's ability to kind of discriminate the presence or absence of a single photon and that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5338.721,
    "end": 5340.263,
    "text": "But in terms of phenomenology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.685,
    "end": 5344.246,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.266,
    "end": 5349.996,
    "text": "I don't know whether I'm trying to remember what I said in the paper because it's been... Would you like to know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.036,
    "end": 5352.039,
    "text": "Yes, I would like to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5352.22,
    "end": 5354.624,
    "text": "It was like six years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.868,
    "end": 5360.073,
    "text": "While I'm looking, you can try and remember.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5363.379,
    "end": 5364.721,
    "text": "But no, you do mention it there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5364.741,
    "end": 5366.284,
    "text": "I mean, it's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5366.737,
    "end": 5378.774,
    "text": " I think it's totally reasonable to say, I don't think there's anything intuitively wrong with the notion that it will bottom out at the point of actionable inaccessibility, if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5378.794,
    "end": 5382.398,
    "text": "It just doesn't make sense given the body that I have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5382.419,
    "end": 5392.272,
    "text": "And again, it's very Merleau-Ponty idea that it just doesn't make sense to perceive atoms with a hand that is manipulable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5392.387,
    "end": 5395.251,
    "text": " only kind of quite coarse levels, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5395.271,
    "end": 5403.32,
    "text": "Like, I can't grip, just because of the nature of the hand that I have, I can't grip atoms, which makes me think it's a different question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.583,
    "end": 5421.583,
    "text": "There's a, I think, again, intuitively, we think there's a kind of universality of perception, because we're our sort of folk science or folk philosophy is telling us that we just received the world and we capitulate it perfectly a kind of direct realist way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5421.952,
    "end": 5422.373,
    "text": " viewing things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5424.216,
    "end": 5434.556,
    "text": "To what degree does your argument that perception is kind of affording action in the sense that it gives us this intermediate level perception that's grippable and whatever?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5435.297,
    "end": 5439.525,
    "text": "To what degree is that kind of a Sapir-Whorf account of vision?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5439.866,
    "end": 5440.888,
    "text": "I mean, by that, I mean,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5441.56,
    "end": 5442.361,
    "text": " to what degree?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5442.381,
    "end": 5448.847,
    "text": "I mean, how much does affordance and action, relativize and permeate perception?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5448.947,
    "end": 5450.169,
    "text": "Is there anything beyond it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5451.39,
    "end": 5456.134,
    "text": "That's kind of why I mean, I don't think any, you know, I don't think really, Jay, I don't know, I might get shouted out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5456.155,
    "end": 5458.157,
    "text": "I'm not sure Gibson really tells us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5459.298,
    "end": 5466.445,
    "text": "Yeah, so I think for me, I would say no, in the sense in order in the perception of objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.726,
    "end": 5469.728,
    "text": "The perception of an object, I think, is always",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5470.147,
    "end": 5494.652,
    "text": " cashed out in terms of action possibilities anytime you perceive anything as an object you perceive something that you can pick up that you can rotate that has other sides to it what i'm i think the reason i'm not entirely sure whether that's exhaustive of perception as a whole is in terms of kind of sort of altered states of consciousness type experience where you have perceptions aren't really perceptions of objects anymore um you know so when you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.864,
    "end": 5504.215,
    "text": " I know whether it's some of the extreme states that people apparently get from meditation or from LSD, and you have that kind of very non-ordinary visual phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.295,
    "end": 5510.603,
    "text": "I think there it's very hard to see what the action is behind those kind of experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.623,
    "end": 5517.452,
    "text": "I mean, the closest I've had to one is playing around with, you know, that Lucille-like thing, the dream mission thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5518.333,
    "end": 5521.377,
    "text": "And you get those kind of, you know, swirling mandalas and all that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5521.397,
    "end": 5521.737,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.97,
    "end": 5525.838,
    "text": " Um, and it's not really clear what the, it's not clear what the action is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5526.078,
    "end": 5527.02,
    "text": "That's very nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5527.361,
    "end": 5528.042,
    "text": "That's a good idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5528.563,
    "end": 5531.75,
    "text": "There is also the sense, at least though, with those experiences, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5531.79,
    "end": 5542.712,
    "text": "Like, you know, how they'll change if you move your, your, I think you do in my experience, you have an awareness of how, you know, if I move my eyes this way, the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5542.945,
    "end": 5546.033,
    "text": " So I'm going to get that sense of the colors shifting across my visual field this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5546.053,
    "end": 5548.48,
    "text": "There's still some kind of contingency still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5549.041,
    "end": 5554.315,
    "text": "What there isn't obviously is any sort of sense of any kind of needs of like, why should I act this way or that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5554.937,
    "end": 5556.28,
    "text": "You know, I can actually change it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.07,
    "end": 5563.901,
    "text": " but there's no relevance of that kind of visual phenomenology to anything I might need or want in the same way that there is with like tables, chairs, lamps, and water bottles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.921,
    "end": 5564.121,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.341,
    "end": 5564.802,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.822,
    "end": 5565.042,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5565.283,
    "end": 5565.483,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5565.884,
    "end": 5573.876,
    "text": "That's, that's a really, that's a great paper right there, by the way, for anyone listening, you just got given a great paper idea to what degree, what are the affordances in psychedelics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5574.277,
    "end": 5578.624,
    "text": "I mean, I haven't thought about visual phenomenology in ages and it's, it's fun to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.644,
    "end": 5579.505,
    "text": "Yeah, no, it's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5579.765,
    "end": 5585.254,
    "text": "Um, I mean, it makes me think, you know, we always think of affordances in terms of physical actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5585.757,
    "end": 5597.093,
    "text": " But the nice bit of active inference is people like Lars, Sam Bedsmith and others is the alignment, let's say, of mental actions and physical actions such that they can be described via the same formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5598.134,
    "end": 5614.296,
    "text": "And I wonder whether, I'm just really throwing this, you know, it's in the dark, I haven't thought about it, whether the affordances, there might be mental affordances in psychedelic states, especially at this very deep level of, let's say, like a DMT trip or non-dual awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5614.951,
    "end": 5639.524,
    "text": " again that said it's still that still foregrounds the notion of needs and uh a kind of autonomous being who has needs onto themselves uh because that is only the that's the kind of the only way that affordances make sense so you know i was going to ask you this you you say in one of your this i think this will be my final question because it's a big one oh it's not actually a big one but it's um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5640.652,
    "end": 5642.679,
    "text": " You know, it comes back to the self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5642.8,
    "end": 5648.62,
    "text": "I'm always going to come back to the self in many ways, because again, that's what I've been writing about and that's what I'm most interested in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5649.258,
    "end": 5654.824,
    "text": " You say you don't really go into this idea, but I think it's really important that you say, and I wonder what you talk about in the book as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5655.385,
    "end": 5672.603,
    "text": "You say in your 2022 paper, expecting some action, having a temporally fit counterfactually deep self model seems an obvious prerequisite for the presence of higher order self-consciousness, but it is not immediately clear why it would be necessary for the emergence of more basic phenomenal properties, such as the immediate visual experience of an apple on the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5673.504,
    "end": 5675.907,
    "text": "And then I think you go on to talk about, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5676.241,
    "end": 5683.491,
    "text": " this kind of action-based account of visual perception that does give you the visual experience of an apple on a table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5683.851,
    "end": 5696.168,
    "text": "But when I first read that, I was thinking, yeah, it certainly does give you the visual experience of an apple on a table, but it certainly doesn't also give you everything that we can talk about in terms of selfhood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5697.049,
    "end": 5698.992,
    "text": "So I'd be very interested in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5699.579,
    "end": 5707.354,
    "text": " what the phenomenologist called pre-reflective self-awareness, or what people also refer to as the sense of self as subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5707.774,
    "end": 5715.529,
    "text": "So this is the kind of, you can be very deflationary about it and just say the subjectivity that's imminent in all conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5715.998,
    "end": 5724.888,
    "text": " Or the perspectivalness or the very sort of non-conceptual possessiveness that seems to accompany all, or not even accompany, embedded in all conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5724.908,
    "end": 5728.852,
    "text": "And here I'm thinking about people like Sean Gallagher and Dan Sahavi and all the back to Herschel and Merleau-Ponty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.872,
    "end": 5730.994,
    "text": "And I'm really, really fascinated in them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5731.014,
    "end": 5735.039,
    "text": "But I'm wondering whether you thought about that as well, in terms of what active inference can say about the self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5736.52,
    "end": 5739.964,
    "text": "There's a nice paper by Matthias Wozniak where he talks about the I versus me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5740.45,
    "end": 5759.758,
    "text": " and the fact that active inference in principle can give you very much the uh the me the self as ob do i take as the self the sense of the self as object but it can't really give you the why which is the sense of self as subject um i'm wondering whether you thought about that at all in terms of uh active inference and the phenomenology i know you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5760.008,
    "end": 5770.021,
    "text": " focused more on visual phenomenology, but underlying all visual phenomenology is this kind of subjectivity, this fact that there is a full meanness of visual perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5770.661,
    "end": 5775.868,
    "text": "So I'm just wondering whether you've given that any, any consideration because you did make that comment in that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5777.029,
    "end": 5778.711,
    "text": "I don't know the paper that you just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5778.731,
    "end": 5779.733,
    "text": "I'd be interested to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5780.013,
    "end": 5786.842,
    "text": "So I don't, I'm talking about, so you made the comment about the fact that, so yeah, so Wozniak is, I think it was in frontiers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5787.643,
    "end": 5787.923,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5789.101,
    "end": 5793.125,
    "text": " I can, just for the audience, I and me, oh, it's not, is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5793.766,
    "end": 5797.089,
    "text": "I and me, the self in the context of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5797.209,
    "end": 5798.51,
    "text": "Frontiers in Psychology, 2018.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5798.57,
    "end": 5800.172,
    "text": "I can send that to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5800.192,
    "end": 5806.498,
    "text": "Yeah, it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5806.518,
    "end": 5819.091,
    "text": "So, sorry, the question was on... Well, the question really feeds off this idea that you said that this notion of deep, temporal, counterfactual planning, in many ways, affords a kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5819.341,
    "end": 5835.338,
    "text": " narrative self, a kind of rich self model that's capable of being reflected on by like, I am a thing that causes things in the world, this idea that we are a hidden cause, we are the best guess of multimodal sensory information, so on and all these things that George is writing about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5836.399,
    "end": 5842.246,
    "text": "And my response to George has always been well, yeah, that's very good for the self as object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5842.306,
    "end": 5844.468,
    "text": "And by that, I mean, the self that can be reflected on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5844.668,
    "end": 5845.87,
    "text": "So I am Darius, I'm 25.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5846.03,
    "end": 5847.351,
    "text": "I'm from London, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5847.451,
    "end": 5848.032,
    "text": "Yeah, like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5848.45,
    "end": 5855.719,
    "text": " that implies I'm a rarefied thing, that it can be cast as a latent cause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5856.139,
    "end": 5857.481,
    "text": "And I think active inference gives you that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5857.982,
    "end": 5863.228,
    "text": "What I'm asking is, you said, well, it's not enough to give you this kind of very basal visual perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5863.649,
    "end": 5866.352,
    "text": "Of course, I mean, I think that's kind of clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5866.732,
    "end": 5869.716,
    "text": "What I'm also saying is, it doesn't just not give you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5869.882,
    "end": 5877.615,
    "text": " visual perception per se, it also doesn't give you the subjectivity, or the very non conceptual sense of self imminent in visual perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5877.956,
    "end": 5878.837,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5878.858,
    "end": 5880.34,
    "text": "So I'm just curious about what you think about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5880.801,
    "end": 5895.366,
    "text": "Yeah, I think that's maybe tied to this way in which I think the sense of self, the way I think of a self being very different from the way active inference necessarily does, which is a sense of sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.7,
    "end": 5904.828,
    "text": " kind of intrinsic striving, I suppose, in the sense that it's not just, I have this model, and if something happens, I need to respond to get rid of disruption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.289,
    "end": 5911.494,
    "text": "It's that I am, and also it may be to what we said earlier about this idea that I think that there's never a position when all of your needs are satiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5911.835,
    "end": 5913.136,
    "text": "There's always some sort of need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5913.196,
    "end": 5916.459,
    "text": "It's just which one is being prioritized at which point in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.68,
    "end": 5923.345,
    "text": "So the basic sense of self, I think, is underpinning visual perception is going to be that sense of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.793,
    "end": 5928.677,
    "text": " imbalance or misattitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5928.977,
    "end": 5930.979,
    "text": "Super nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5931.319,
    "end": 5934.161,
    "text": "Yeah, I mean, that, that, again, is kind of quite molly punching, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5934.222,
    "end": 5941.568,
    "text": "But the base, the basic self is like misalignment, misattunement, that we're trying to align.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.648,
    "end": 5948.274,
    "text": "And that's always a futile process, because you can never get rid of all of this misattunement, you can just get rid of one element of it, and something else becomes more salient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5949.075,
    "end": 5954.58,
    "text": "And then the kind of reflective self is what allows you perhaps, to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.168,
    "end": 5959.174,
    "text": " you know, that's when you get into planning about it and all of that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5959.194,
    "end": 5962.659,
    "text": "And perhaps in order to plan, you need to act as though your needs are going to be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.6,
    "end": 5976.358,
    "text": "So even in ways that, you know, you might, there's no necessity behind your needs staying the same, but if you want to make plans in the world, you're going to have to act as if they will in order to project yourself into the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.378,
    "end": 5979.202,
    "text": "Um, Oh, that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5979.362,
    "end": 5981.445,
    "text": "That's a good question as to whether you can fake.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5982.404,
    "end": 5984.206,
    "text": " alternate desires.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5985.248,
    "end": 5986.089,
    "text": "That's a different question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5986.509,
    "end": 5987.471,
    "text": "Yeah, that is really nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5987.491,
    "end": 6002.511,
    "text": "I mean, I'm curious whether you think this kind of this non reflective, precarious self awareness is, what does that manifest as in your idea in this idea?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6002.551,
    "end": 6003.352,
    "text": "Is it conscious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6003.372,
    "end": 6003.872,
    "text": "Is it sorry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6003.893,
    "end": 6004.894,
    "text": "Is it affect?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6005.995,
    "end": 6007.437,
    "text": "Or is it even deeper than affect?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6008.979,
    "end": 6011.803,
    "text": "Yeah, so for me, it's what it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6012.307,
    "end": 6013.389,
    "text": " Is it effect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.409,
    "end": 6024.848,
    "text": "It's, it's probably effect whether, whether it's consciousness, I think I'm undecided on whether you need some sort of reflective capacity for it to be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6024.908,
    "end": 6030.417,
    "text": "So I would say, you know, every living system has this like basic striving and either bacterium has it, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.768,
    "end": 6041.522,
    "text": " Anything that is a metabolically, a metabolic cycle has that, um, which if you say that, that as soon as you have that, you have, you know, something like consciousness, you end up with a very general notion of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.263,
    "end": 6048.692,
    "text": "Um, and I haven't really got to what I think I would be willing to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6048.712,
    "end": 6051.696,
    "text": "I think it's less crazy to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6052.076,
    "end": 6057.383,
    "text": "Um, if you think that that's what it is to be, to have purposiveness and intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6058.038,
    "end": 6064.185,
    "text": " then you might be ascribe, and you think that that's what it is to have consciousness, you might be ascribing it to very, very simple life forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6064.506,
    "end": 6066.608,
    "text": "The main thing for me is that you're not ascribing it to everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6068.09,
    "end": 6072.295,
    "text": "That very minimal notion of striving is very general and weak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6073.416,
    "end": 6077.541,
    "text": "That would be okay for me, for that to be something like some sort of minimal phenomenality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6080.305,
    "end": 6087.994,
    "text": "Just the main thing I think is the most important thing to avoid if we want that concept, if we want there to be realists about the mind, about phenomenality,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6088.97,
    "end": 6094.417,
    "text": " is I feel that once that becomes a property of everything, it becomes a less important or real property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6095.819,
    "end": 6103.23,
    "text": "So even if it's watered down to the extent that we can say that there's something that bacteria have effective states, that's still okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6103.55,
    "end": 6105.272,
    "text": "As long as the tables are turned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.713,
    "end": 6106.855,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.235,
    "end": 6107.515,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6107.836,
    "end": 6109.779,
    "text": "Well, rather you than me to draw that dividing line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6111.361,
    "end": 6112.803,
    "text": "But I'm sure you, I'm sure one can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6112.863,
    "end": 6116.648,
    "text": "I mean, I think just to sort of say where I'm thinking currently, I don't,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6116.932,
    "end": 6146.314,
    "text": " think that this form of consciousness needs to be the product of any meta reflection there are people that think that and this is very sort of these are not phenomenologists per se it's something more like um analytical philosophy is mine so people like armstrong like and rosenfall i've been thinking about this because they argue that sort of for this this intransitive consciousness can only come about because it's the object of a higher order mental state yeah but then i mean this is such a problem because it's obviously leads to an infinite regress which is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6146.868,
    "end": 6148.57,
    "text": " is that mental state conscious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6148.59,
    "end": 6151.834,
    "text": "And if so, how is it conscious without itself being the object and so on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6151.854,
    "end": 6153.716,
    "text": "So I don't know, I'm sympathetic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6153.756,
    "end": 6156.859,
    "text": "Again, I'm not gonna stake any solid claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6156.879,
    "end": 6167.611,
    "text": "I'm sympathetic to the idea that there is just minimal phenomenality that doesn't need that doesn't rest on any higher order cognitive function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6169.733,
    "end": 6171.255,
    "text": "And, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6172.214,
    "end": 6184.405,
    "text": " Is the fact that there is this at least plausible interiority about living things that are autonomous or adaptive things, does that feed into the minimal phenomenality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6184.485,
    "end": 6191.692,
    "text": "Is that the ground of minimal phenomenality such that it's kind of Dasein and it's this kind of imminent anxiety?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6191.892,
    "end": 6197.137,
    "text": "Heidegger might have even said that this future striving, that is consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.157,
    "end": 6200.5,
    "text": "I don't know, but I don't hate it actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6201.239,
    "end": 6230.385,
    "text": " are so many people who are trying to get to the bottom of this what is this minimal phenomenality whether it's affect or uh whether it's salience or whether it's time or whatever um it's hard to say but that that is a lot uh there's a lot to chew on i'm also aware of the time yeah i just want to say just in terms of the reflection thing if that's what you're thinking about and you're not convinced by there's a really lovely book that i just came across recently called on reflection um i promise again first things um but it's cornblith i want to see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6230.568,
    "end": 6257.47,
    "text": " and it's literally going through how philosophers have relied upon reflection the idea of reflection to get themselves out all of these problems with their first order theories we can't explain it in terms of this but if you reflect on it yeah yeah yeah yeah well then you have a self well then you have this and he's like you know if you haven't got the first sort of thing that you're reflecting on sorted then just moving to reflection is just passing the buck yeah of course it's a nice short book but he",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6258.226,
    "end": 6265.215,
    "text": " I think it is a really common move to sort of rely upon some sort of higher order reflection to explain how something you can't explain happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.758,
    "end": 6275.888,
    "text": "So yeah, I think that's maybe why I'm more interested in minimal phenomenality, because I think there's no point talking about everything else until you've figured out what that thing is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6276.429,
    "end": 6279.272,
    "text": "And then you can sort of explain how you can have reflection on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6279.64,
    "end": 6280.962,
    "text": " Yeah, I'd really recommend it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6281.222,
    "end": 6282.383,
    "text": "Yeah, that's, that's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6282.443,
    "end": 6284.185,
    "text": "I think, yeah, that is cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.666,
    "end": 6299.984,
    "text": "I think the idea they would have is that, I mean, just in terms of this very sort of fact, this idea that minimal phenomenality is itself downstream on reflection or minimal from the reality from some other mental state is that that other mental state, that higher order mental state is not conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6301.065,
    "end": 6304.99,
    "text": "But then you just have this issue of how is a non-conscious mental state intending",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6305.493,
    "end": 6307.078,
    "text": " a conscious mental state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6307.219,
    "end": 6308.644,
    "text": "Anyway, it's for another day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6309.346,
    "end": 6311.533,
    "text": "Okay, this was really fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6311.594,
    "end": 6315.587,
    "text": "I mean, a complete mind frazzler and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6315.938,
    "end": 6319.843,
    "text": " brain roller coaster, but really amazing and insightful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6319.983,
    "end": 6321.905,
    "text": "So I'm extremely grateful, genuinely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6323.206,
    "end": 6330.074,
    "text": "I said to everyone, I hope it doesn't end up seeming deflationary or boring, or as long as you get the names right, when you say it, that's the main thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6330.275,
    "end": 6332.097,
    "text": "I do try and get people's names right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6332.117,
    "end": 6333.198,
    "text": "I do try and get to the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6333.218,
    "end": 6336.502,
    "text": "I'm always like scrolling away to make sure I get the paper names right and whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6336.522,
    "end": 6338.805,
    "text": "But genuinely, so much to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6338.845,
    "end": 6341.828,
    "text": "Not only I'm sure in terms of my own case,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6342.23,
    "end": 6346.355,
    "text": " because I have now a lot to think about, but hopefully in terms of the audience as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6347.437,
    "end": 6355.948,
    "text": "I always like to give people just a little bit at the end, just talk about where they can be found on the internet, presumably rather than physical location, because that would be weird.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6357.249,
    "end": 6367.022,
    "text": "But yeah, in terms of Twitter or email or whatever, and also what kind of work they have upcoming that people can look forward to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6367.492,
    "end": 6367.873,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.893,
    "end": 6367.993,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.013,
    "end": 6368.975,
    "text": "And thanks so much for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.995,
    "end": 6371.68,
    "text": "This is the first time I've done any sort of extended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6371.72,
    "end": 6375.447,
    "text": "I used to be a journalist, so I used to be the person interviewing people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6375.808,
    "end": 6378.032,
    "text": "So it's been really interesting being on the other end of the interview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.052,
    "end": 6379.675,
    "text": "Oh, well, you smashed it, honestly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6380.096,
    "end": 6380.517,
    "text": "No, it was nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6380.577,
    "end": 6382.921,
    "text": "It was a nice, like, chill first interview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.021,
    "end": 6384.184,
    "text": "Yeah, so I'm on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6384.244,
    "end": 6390.175,
    "text": "I'm trying not to be as much, but I am on there, just as Catherine Knave, just all word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6390.695,
    "end": 6395.36,
    "text": " In terms of upcoming work, there's the book coming out, hopefully at the end of this year, I'm thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6396.721,
    "end": 6399.684,
    "text": "It should be maybe by October, but it could be February.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6400.525,
    "end": 6401.926,
    "text": "It's been in the works for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6402.947,
    "end": 6404.489,
    "text": "How long is the book, may I ask?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6405.149,
    "end": 6406.631,
    "text": "Oh, I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6406.651,
    "end": 6410.995,
    "text": "I think I want to say, like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.095,
    "end": 6412.296,
    "text": "Just to warn people, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6412.717,
    "end": 6414.558,
    "text": "I think it's... Or not, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6414.578,
    "end": 6416.12,
    "text": "Yeah, maybe like 80,000 words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.741,
    "end": 6418.142,
    "text": "Yeah, I think it's about 70 or 80,000 words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6418.282,
    "end": 6419.183,
    "text": "Sounds like a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6419.315,
    "end": 6421.177,
    "text": " Yeah, but there's an appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6421.197,
    "end": 6422.899,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6423.139,
    "end": 6423.64,
    "text": "That's funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6423.84,
    "end": 6425.802,
    "text": "I've been told it's funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6426.183,
    "end": 6428.425,
    "text": "And this was built off your PhD, you said?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6428.625,
    "end": 6429.867,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6429.887,
    "end": 6430.968,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6431.268,
    "end": 6431.549,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6431.589,
    "end": 6434.112,
    "text": "Yeah, it's supposed to be relatively accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.213,
    "end": 6439.638,
    "text": "I would say like, certainly you can you can dive into and get what you want out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.018,
    "end": 6444.343,
    "text": "So like the first half is probably I think is like, you know, I do think is a relatively decent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6445.403,
    "end": 6448.206,
    "text": " introduction to the kind of basic philosophy of the phrasal principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6448.246,
    "end": 6455.892,
    "text": "And then the second half is more if you're interested in stuff like purposiveness and intentionality and inactive concepts, you know, more oriented towards that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6457.854,
    "end": 6458.855,
    "text": "There's also some blog posts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6458.875,
    "end": 6462.839,
    "text": "So I've got a post on dialectical systems, which kind of summarizes some of the arguments of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.84,
    "end": 6466.662,
    "text": "And I've got a little substack post.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6466.782,
    "end": 6471.427,
    "text": "I don't have a substack, I just have a single post that kind of tries to give an overview of the book's main arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6471.447,
    "end": 6473.048,
    "text": "So those might be worth checking out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6473.568,
    "end": 6476.393,
    "text": " And the next thing I'm working on is a big paper about Hegel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.254,
    "end": 6478.056,
    "text": "So that'll be a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.658,
    "end": 6480.059,
    "text": "But yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6480.84,
    "end": 6482.764,
    "text": "Well, thank you again so much for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.505,
    "end": 6486.61,
    "text": "And yeah, and from the Institute as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6486.63,
    "end": 6487.552,
    "text": "I'm sure everyone's gonna love it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6488.073,
    "end": 6490.176,
    "text": "And everyone should go get the book when it's out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6490.256,
    "end": 6490.577,
    "text": "Of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6491.018,
    "end": 6491.739,
    "text": "Yeah, thanks for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.759,
    "end": 6493.562,
    "text": "I really enjoyed talking to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6493.582,
    "end": 6494.123,
    "text": "Absolute pleasure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.363,
    "end": 6494.924,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.944,
    "end": 6496.186,
    "text": "Thank you everyone for watching as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6496.467,
    "end": 6497.128,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]