[
  {
    "start": 6.167,
    "end": 30.373,
    "text": " July 25th 2023 and we are in the discussion section basics of active inference this is the first discussion section that we've had for this course so thank you all for joining and it's going to be regarding the topics that Ben White introduced in his recent lecture so everyone will be welcome to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 31.209,
    "end": 54.774,
    "text": " pop in and introduce themselves and then i know that ben has some ideas to discuss and many other spontaneous and written questions will come into play so i will uh with that exit for now and pass to perhaps some of our first time live stream guests",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 67.971,
    "end": 71.692,
    "text": " I guess I've already spoken, so I may as well continue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 71.872,
    "end": 72.632,
    "text": "So I'm Darius.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 74.073,
    "end": 75.053,
    "text": "I am a master's student.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 75.153,
    "end": 79.774,
    "text": "I'm just about to finish at UCL in social distributed cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 80.314,
    "end": 93.937,
    "text": "I work in a social cognition lab looking at salience regulation and attentional mechanisms within social contexts, but all within an active inference framework, within the Bayesian brain hypothesis framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 94.558,
    "end": 96.098,
    "text": "And yeah, it's a sort of recent...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 97.284,
    "end": 98.704,
    "text": " discovery and obsession.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 98.985,
    "end": 102.366,
    "text": "And so I'm sort of getting to grips with both the high road and the low road.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 103.626,
    "end": 113.049,
    "text": "And so I've had the opportunity to chat to Mark and some other researchers who have been super informative, but always looking to learn more and get my head around even more of the sort of philosophical and mathematical theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 115.95,
    "end": 116.15,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.691,
    "end": 118.131,
    "text": "Sounds good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.292,
    "end": 124.873,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 124.893,
    "end": 125.394,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 126.594,
    "end": 126.714,
    "text": "Yep.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 127.765,
    "end": 128.946,
    "text": " I'm Francesco Balzani.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 129.226,
    "end": 131.907,
    "text": "I'm a PhD student at the University of Bologna, Italy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 132.688,
    "end": 137.07,
    "text": "Actually working on the intersection between artificial intelligence and education.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 138.171,
    "end": 145.975,
    "text": "I have a background in cognitive anthropology and philosophy of science and I met Axel and Maxelina a few years ago.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 145.995,
    "end": 149.677,
    "text": "So I dive into the rabbit hole.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 150.777,
    "end": 177.747,
    "text": " and active inference and currently pretty much interested in multi-scale active inference models of scientific cognition so pretty interested about the agent level modeling of scientific reasoning assumption that might emerge from the interaction with the scientific environments so we're referring to scientific construction and all this type of top-down and bottom-up interaction so super interested to",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 178.959,
    "end": 180.74,
    "text": " Thank you.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 183.862,
    "end": 184.622,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.964,
    "end": 191.526,
    "text": "Would anybody else like to introduce themselves before we start?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 195.188,
    "end": 196.008,
    "text": "So you go first.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 196.028,
    "end": 197.269,
    "text": "Okay.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 197.509,
    "end": 199.27,
    "text": "Hi, I'm Regina.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 199.71,
    "end": 200.551,
    "text": "I'm from Guatemala.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 203.646,
    "end": 205.307,
    "text": " Well, I'm not from the social sciences.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 205.587,
    "end": 207.649,
    "text": "I come from biology and neuroscience.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 208.109,
    "end": 217.756,
    "text": "And I'm here because I'm working on a project as a technical operator in this big project in the exescape and material mines.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 218.276,
    "end": 224.58,
    "text": "And I do the technical part and experiments, but I want to learn the philosophical part.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 224.72,
    "end": 231.305,
    "text": "That's the background that, you know, makes the theory of everything we're going to, you know, experiment.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 231.625,
    "end": 232.886,
    "text": "So I'm here to learn.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 233.596,
    "end": 253.972,
    "text": " um and also i am like you know when you see the olympics that you you see all the swimmers and you always say i wish there was a normal guy to see how good these people are so you could compare so that's me today right i i understand half of what's going on but i'm happy to be here so yeah hi",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 261.605,
    "end": 286.414,
    "text": " yeah sorry i'm late um sorry my name's lee um i'm a phd student at the uh university of york studying systems transformation um and i'm i'm joining because i'm using uh perceptual control theory at the minute to uh to model examples of effective practice um in organizations and and i've read quite a lot of um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 287.786,
    "end": 303.216,
    "text": " active inference papers and I understand that there's a lot of resonance and overlap between perceptual control theory and active inference, although I understand it's within a predictive framework and also it's a kind of a level of abstraction higher.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 303.703,
    "end": 311.465,
    "text": " So you're able to kind of quantify the difference between sort of the predictive state or the outcome state and the current state.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 311.965,
    "end": 326.609,
    "text": "So what I'm really trying to understand is how might that level of abstraction be useful in what I'm doing, actually, because I understand it's a much more kind of concurrent theory and framework than perceptual control theory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 331.164,
    "end": 349.285,
    "text": " yeah very cool um anybody else i think there's is that everybody okay well um was everybody um present at the has everybody seen the lecture that i gave uh a couple of weeks ago six",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 350.362,
    "end": 362.054,
    "text": " Okay, so I think it might be helpful then if I kind of very, very briefly go over what we covered in that lecture, just to kind of jog people's memories, and then we can maybe pick up some questions from there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 363.355,
    "end": 366.959,
    "text": "So the lecture last week was on the basics of active inference, and it was...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 369.013,
    "end": 373.295,
    "text": " intended to be an introduction to the framework on a very abstract philosophical level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 373.355,
    "end": 377.477,
    "text": "So it left out all of the kind of mathematics and technical aspects of the framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 378.198,
    "end": 383.32,
    "text": "And the objective really was to lay the groundwork for future weeks in this course, because",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 385.765,
    "end": 389.47,
    "text": " This is obviously a course on active inference in the social sciences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 389.71,
    "end": 398.641,
    "text": "And so in the subsequent weeks, we're going to be looking at topics like collective behavior, social cognition, shared norms and niche construction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 399.242,
    "end": 401.345,
    "text": "And so what I wanted to do was to put on the table",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 403.705,
    "end": 410.212,
    "text": " a kind of fully fleshed out picture of what the individual agent looks like in active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 410.813,
    "end": 418.121,
    "text": "And so to do this, we looked at emotion, agency, mind.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 418.321,
    "end": 424.848,
    "text": "So we looked at kind of the role of action and perception, the role of internal representations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 426.009,
    "end": 426.769,
    "text": " in active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 427.37,
    "end": 441.075,
    "text": "And then as a case study, we kind of we looked at a active inference based account of addiction to kind of bring all of these threads together to kind of articulate a lot of the things that I'd said in the previous sections.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 443.835,
    "end": 470.692,
    "text": " so i'm i mean the questions here don't have to be specifically um tethered to that lecture i suppose we can just start with any general questions about active inference and philosophy and how active inference applies to individual agents or if anybody did want to pick up on any threads from the lecture then we can go from there can i ask something just for the basic questions yeah of course",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 472.027,
    "end": 482.332,
    "text": " I don't understand, because I think you explain it later, but how does creativity and science in general enters active inference?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 483.313,
    "end": 491.316,
    "text": "How does trying to be creative and not doing what you predict enters this world?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 492.097,
    "end": 493.557,
    "text": "Yeah, this is a really good question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 494.058,
    "end": 495.718,
    "text": "So were you there?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 495.979,
    "end": 496.759,
    "text": "Did you see the lecture?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 498.9,
    "end": 501.501,
    "text": " Yeah, but I remember half of it.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 501.781,
    "end": 502.241,
    "text": "That's fine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 502.281,
    "end": 506.382,
    "text": "But I think, do you remember the dark room problem?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 507.263,
    "end": 512.344,
    "text": "Yeah, I know that's where the answer is.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 512.644,
    "end": 521.287,
    "text": "I think there are several interesting dark room problems, some of them more interesting than others.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 521.567,
    "end": 525.449,
    "text": "And I tried to cover, I obviously didn't have time to cover all of those in the lecture.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 528.015,
    "end": 548.57,
    "text": " But for those that perhaps aren't familiar, the dark room problem is this kind of canonical philosophical worry about predictive processing and active inference that says, essentially, if all we're trying to do is minimize prediction errors, why don't we just find maximally predictable environments?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 549.471,
    "end": 555.876,
    "text": "And why do we not just lay in a dark room hooked up to an intravenous drip and enjoy an error-free lifestyle?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 556.696,
    "end": 565.413,
    "text": " um so i think that's the kind of that's the question that you're articulating there um i just quickly see a hand from darius darius did you want to jump in or was it a separate question",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 567.785,
    "end": 591.298,
    "text": " it's a separate question so I would just do it in advance but yeah I'll circle back around in a second then but everybody feel free um I should say actually um this is the first time I've kind of chaired a discussion like this so I'll be explicit and say um people should just feel free to jump in whenever they want if you want to take the disco if you want to kind of um add something or or kind of build on a question that we're answering feel free to jump in",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 592.438,
    "end": 600.746,
    "text": " But yeah, with the dark room problem, as I'm aware, the first answer to that question, and this is something that I did cover in the lecture, is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 602.682,
    "end": 609.984,
    "text": " Essentially, a big part of active inference is to recognize that the agents are it's a kind of fundamentally embodied framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 610.244,
    "end": 614.445,
    "text": "OK, so what that that can be kind of cashed out in various ways.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 614.505,
    "end": 629.85,
    "text": "But one of the one of the most important ways is that the expected states of the organism or the agent are necessarily rooted in the phenotype of the organism and the kind of evolutionary biological needs that come with having a particular body.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 630.55,
    "end": 633.453,
    "text": " So there was a paper that I referenced in a lecture by.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 635.195,
    "end": 636.736,
    "text": "There's three authors on this paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 637.056,
    "end": 641.801,
    "text": "It's Andy Clark, Carl Friston, and then I'm forgetting the name of the third author.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 641.821,
    "end": 645.264,
    "text": "If anybody can recall, feel free to drop it in the chat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 645.804,
    "end": 651.57,
    "text": "But this is this is an answer to the dark room where it builds on that notion of embodiment and says, look,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 653.251,
    "end": 670.814,
    "text": " creatures like us humanate and could and sit in the dark room and do nothing and just uh kind of enjoy the very predictable march of hunger thirst Etc but obviously those particular biological sets of the room and so you have this very fundamental level um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 674.096,
    "end": 681.342,
    "text": " we have this very fundamental kind of basis upon which we have these needs that need to be met, and so we need to engage in exploratory behaviors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 682.683,
    "end": 699.435,
    "text": "On the topic of novelty, because that's a kind of base, I take that to be a kind of baseline answer, but there are clearly kinds of activities and behaviors that we do engage in going beyond the dark room, kind of curiosity,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 700.256,
    "end": 716.587,
    "text": " play um creativity engaging in kind of why do we create works of art and it there's not an obvious link between those kinds of behaviors and the kinds of biological needs um that are emphasized in the original answer to the dark room worry",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 717.487,
    "end": 731.804,
    "text": " um so in answer to regina's question about creativity i think that a good starting point for this is the section on aerodynamics that i introduced in the lecture so this was the idea that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 732.765,
    "end": 754.58,
    "text": " it there's this strong connection between affectivity as a kind of emotional embodied feeling state and the changes to the rate in prediction error minimization so i don't know um i am now very much uh articulating mark's work here so i don't know if mark wants to jump in at any point and do a much better job than i can um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 758.711,
    "end": 761.876,
    "text": " I think there's certainly work on the horizon.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 761.896,
    "end": 767.506,
    "text": "I know that there are people who are currently building up theories of artistic creativity that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 768.649,
    "end": 772.41,
    "text": " that are based on this idea of aerodynamics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 773.25,
    "end": 788.355,
    "text": "So Mark's paper on play with Mark Anderton that I mentioned has a really interesting idea where if you explain playful behaviours, which are kind of fundamentally creative and we are",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 790.156,
    "end": 792.399,
    "text": " It's an inherently creative exercise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 792.419,
    "end": 804.956,
    "text": "I think the really interesting idea that comes out of that is one thing that we engage in because it feels good is we create niches of very manageable prediction error that we can then minimize.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 807.664,
    "end": 812.407,
    "text": " So, yeah, that's playful behavior is a kind of the answer to the puzzle of play.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 812.487,
    "end": 823.032,
    "text": "So why do we the puzzle of play is why do we engage in metabolically quite costly and they don't have any obvious benefit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 823.732,
    "end": 833.498,
    "text": " And the idea there is that, well, there's kind of several ideas in there, but one of them is that it just literally feels good because minimizing prediction error feels good to us.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 833.698,
    "end": 837.04,
    "text": "So whenever we do better than expected at minimizing prediction error, it feels good.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 837.8,
    "end": 838.401,
    "text": "And so I think",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 839.686,
    "end": 847.751,
    "text": " So obviously I don't know for sure, but I think that any answer that we give regarding artistic creativity is going to fall within that kind of bulk.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 848.451,
    "end": 858.137,
    "text": "That essentially we engage in the part of the creative process is just constructing those that give us tasks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 863.134,
    "end": 869.376,
    "text": " caves of manageable prediction error that ideally sit at the boundaries of our skill capabilities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 869.396,
    "end": 870.737,
    "text": "Can I add two quick things there, Ben?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.077,
    "end": 872.977,
    "text": "So that was a great explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.078,
    "end": 875.258,
    "text": "But just to hit two points a little bit harder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.698,
    "end": 880.8,
    "text": "One, you might think all that matters is existing error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.421,
    "end": 885.722,
    "text": "That's why it looked a little bit paradoxical that we also create errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.742,
    "end": 891.685,
    "text": " antithetical to our modus operandi, which is to reduce error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.146,
    "end": 898.05,
    "text": "But when you remember that for our kind prediction error minimizing system, we have a really deep temporal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.631,
    "end": 906.237,
    "text": "We're managing uncertainty at a big horizon, maybe even multi-generational, you know, where we're thinking about our kids or our kids.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.397,
    "end": 908.959,
    "text": "I mean, who knows how deep the generative model actually runs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.68,
    "end": 911.601,
    "text": "It turns out that in that kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.134,
    "end": 917.88,
    "text": " Last air is over the run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.881,
    "end": 929.343,
    "text": " that stops developing error-minimizing skills and abilities and just hangs out in one micro-niche, because that micro-niche is going to be upset sooner or later, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.723,
    "end": 938.965,
    "text": "I mean, it's such a great example of where we thought we were in a really set vector state, and then suddenly it gets jostled, and all of us go, oh, my goodness, like, what do we do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.005,
    "end": 939.805,
    "text": "We've been bumped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.086,
    "end": 946.487,
    "text": "And it turns out that the best error-minimizer will be the one we're responsive to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.487,
    "end": 953.591,
    "text": " of errors that are and hates those errors are digestible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.051,
    "end": 956.373,
    "text": "So that means not too complex that you can't do anything with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.393,
    "end": 959.355,
    "text": "You can't learn anything from it, but also not so boring that there's nothing to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.855,
    "end": 963.678,
    "text": "If we hang out, if we're sensitive to, and we hang out at the edge of our capability,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.418,
    "end": 971.68,
    "text": " then we keep developing new error-minimizing abilities, which actually sets us up to be good error-minimizing systems over the long run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.7,
    "end": 982.844,
    "text": "So even though we're investing metabolism now, we're setting ourselves up to be able to manage, especially in the deep end of the pool, black swans, manage uncertainty that we're not going to be able to predict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.124,
    "end": 985.005,
    "text": "They're really unpredictable, unpredictable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.386,
    "end": 987.926,
    "text": " That comes from hanging out at this edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.246,
    "end": 997.831,
    "text": "So part of our curiosity and playfulness and creativity are going to be about us making and digesting novel slopes of volatility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.131,
    "end": 1003.874,
    "text": "I think that's one really great answer for why you get playfulness and curiosity out of this and creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.314,
    "end": 1009.037,
    "text": "I'll just drop one more and we don't have to get into it too deeply here, but here's one other one that we're thinking of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.216,
    "end": 1018.142,
    "text": " There's something really special in the creation of art, especially in a public sphere, that I think is so interesting and that somebody needs to be sort of looking at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.543,
    "end": 1029.369,
    "text": "There's actually a new collection coming out in Philosophical Trends B on art and predictive processing, which I think you should check out if you're interested in these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.61,
    "end": 1034.433,
    "text": "But the idea that we've been thinking about is there are ways that we can bring our generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.073,
    "end": 1037.555,
    "text": " out and put it into a public sphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.235,
    "end": 1041.497,
    "text": "You can take something which is typically on the inside and you can put it outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.257,
    "end": 1049.001,
    "text": "And then you can have other error-minimizing systems look at it and fiddle around with it, and then we can re-imbibe it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.061,
    "end": 1051.403,
    "text": " I mean, we're doing this all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.423,
    "end": 1054.566,
    "text": "I mean, that's what language allows us to do and what writing allows us to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.606,
    "end": 1055.386,
    "text": "Think about maths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.687,
    "end": 1058.93,
    "text": "You're bringing a part of your predictive understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.43,
    "end": 1064.836,
    "text": "You're laying it out, and then other predictive agents can fiddle around with it, and then you can take it back in as part of your updating your own model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.516,
    "end": 1067.578,
    "text": " And I don't know how much more I can say here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.598,
    "end": 1087.673,
    "text": "I just think this is a kind of horizon, but I think there's a really juicy thing to say here about where real art is like Tolstoy, maybe Leo Tolstoy was already on this, where you put something of the creator in the creation and then other people receive that and then they can do something else with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.713,
    "end": 1094.318,
    "text": "And then you're able to sort of take it back in all under the guise of sort of minimizing volatility or understanding volatility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.419,
    "end": 1103.952,
    "text": " maybe that was a bit deep but uh no that was really that was really good yeah yeah and um I just didn't so in the chat I just dropped a link to um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1105.731,
    "end": 1106.011,
    "text": " Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1106.051,
    "end": 1110.496,
    "text": "So somebody just asked about papers related to hanging out at the edge of our capabilities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1110.736,
    "end": 1111.977,
    "text": "I'll do that right now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1111.997,
    "end": 1114.159,
    "text": "There sure are some papers on that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1114.66,
    "end": 1115.561,
    "text": "Mark's got a few.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1115.741,
    "end": 1127.333,
    "text": "I already dropped a link in there to an Aon article by some of the old Expect Project crew, including Mark, Kate Knave, George Deed and Andy Clark on the value of uncertainty, which is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1128.234,
    "end": 1140.626,
    "text": " I think it's a really good start point for some of these questions, just because Aon is a kind of non-academic place where you can, you know, it's a non-technical introduction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1140.686,
    "end": 1145.791,
    "text": "And there's a wonderful example in that paper of a guy named, I think it's Max Hawkins.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1146.111,
    "end": 1147.152,
    "text": "Is that right, Max Hawkins?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1147.632,
    "end": 1153.056,
    "text": " who he's a kind of tech guy and he realized he was getting kind of bored with his life.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1153.076,
    "end": 1161.902,
    "text": "He inadvertently trapped himself in a dark room because his life had become so robed and scheduled and systematic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1161.942,
    "end": 1168.026,
    "text": "He realized that he would be kind of incredibly easy to kidnap because he was in the same place at the same time every single day.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1168.946,
    "end": 1195.591,
    "text": " and to get he took drastic action to break out of that dark room so he he kind of introduced a a randomization algorithm that would it would kind of choose for him where he was going to eat where he was going to go which shows he was going to attend and this example is a really nice centerpiece in this article so and i think yeah i think this is a nice place to start because it's also grounded in discussions about epistemic actions as well because there's also",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1196.311,
    "end": 1216.957,
    "text": " know as cool as play and art and creativity are there's also really really good reasons that uncertainty is valuable as well right because while we might want to exploit all of the opportunities for kind of nourishment and valuable prediction error minimization in our environment there are of course going to be times where",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1217.777,
    "end": 1244.709,
    "text": " um those uh those opportunities are exhausted and we need to go and explore different ones and i think there's some there's it there's some stuff in there as well on epistemic actions within the context of navigation as well so sometimes we're going to have to we're going to have to temporarily move further away from our target in order to minimize our uncertainty about where we're going so there's lots and lots of stuff on the value of uncertainty um and it kind of is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1245.689,
    "end": 1250.71,
    "text": " very much at the forefront of some of the really interesting philosophical applications of the framework, for sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1252.231,
    "end": 1253.411,
    "text": "Okay.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 1253.991,
    "end": 1255.272,
    "text": "By all means, yeah, we've got time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1255.312,
    "end": 1264.354,
    "text": "You just said something, I know you have a question that is, but with the value of uncertainty, it's just that I'm thinking, because I've been working a lot with magicians,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 1265.311,
    "end": 1291.866,
    "text": " and there's a way of using uncertainty as entertainment and it's very difficult to understand as a you know as a concept for entertainment why would you like to be in a place where you cannot you want to predict but you cannot and you still want to participate in this activity so for me magic shows it's kind of breaking a little bit um yeah i think my i spoke to um",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 1293.325,
    "end": 1301.11,
    "text": " I forget the person's name, but there was a Xscape meeting here at Sussex and I spoke to one of the guys on Xscape who had been working on magic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1301.39,
    "end": 1305.213,
    "text": "I don't know if you know who I'm talking about, but I think they have a book on magic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1305.973,
    "end": 1315.519,
    "text": "And I think that's really cool to think about from a predictive processing perspective, the idea that magic is just these wonderful kind of violations of expectations in a certain sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1315.579,
    "end": 1320.843,
    "text": "I think predictive processing provides a nice, really intuitive framework for thinking about those kinds of things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1321.89,
    "end": 1333.659,
    "text": " One little point there, Regina, just about, again, if it feels paradoxical, just to sort of complexify your view, remember that this is always happening in a hierarchical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.36,
    "end": 1342.466,
    "text": "So just because you have errors at one level of the system doesn't mean you're going to have sort of critical, cascading, unbearable errors at higher levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.106,
    "end": 1345.688,
    "text": "So that's why it's fun to go to horror movies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.108,
    "end": 1347.389,
    "text": "So I dropped the paper here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.449,
    "end": 1349.571,
    "text": "Also, we have a new paper coming out on horror movies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.611,
    "end": 1350.452,
    "text": "I'm pretty interested in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.332,
    "end": 1354.333,
    "text": " But it's the same as going to the magic show in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.993,
    "end": 1360.795,
    "text": "Now, the reason why those errors are fun is because we're safe in a theater.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.775,
    "end": 1362.756,
    "text": "We're with our friends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.456,
    "end": 1366.457,
    "text": "We have lots of sugar in our system from eating popcorn and candy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.637,
    "end": 1371.878,
    "text": "We can control the amount of scary by covering our eyes or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.999,
    "end": 1397.39,
    "text": " like there's lots of control here and yet we're getting media that is that's pinging all of our evolutionarily ancient error tracking systems so that we're getting jumps in the physiology as if there's a bunch of volatility that we need to manage and yet we're in a completely safe space which is really fun for our kind of system because we're hierarchically deep predictive systems the high level here isn't jeopardized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.23,
    "end": 1405.194,
    "text": " It knows I'm in a theater, but the low level stuff is still registering all sorts of little volatilities, but of course they get squashed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.854,
    "end": 1408.136,
    "text": "They don't cascade all the way up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.336,
    "end": 1421.563,
    "text": "Or if you're the kind of person where they do tend to cast all the way up, then you're also the kind of person who doesn't like going to horror movies because it kind of scares you go home and think, oh goodness, maybe ghosts are real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.623,
    "end": 1422.604,
    "text": "And maybe I live with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.664,
    "end": 1423.404,
    "text": "You wouldn't be going there then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.784,
    "end": 1425.886,
    "text": "So with magic, it's the same sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.906,
    "end": 1428.909,
    "text": " I don't know if you've ever seen a famous magician.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.929,
    "end": 1431.913,
    "text": "Who does the really extreme magic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.933,
    "end": 1433.054,
    "text": "David Blaine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.107,
    "end": 1463.296,
    "text": " he like was in a block yeah david blaine have you ever seen him he goes to haiti where you have a community that really believes in magic and he does some magic and he gets into trouble like suddenly all the young men are like oh no no no no that's that's no bueno that that you're doing this and then he had to the camera pans back he goes no no hold on i'll show you here i'll show you how it's done it was just a trick i'll just show you outside it's not real magic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.996,
    "end": 1466.198,
    "text": " Because there, they're not having fun with it anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.578,
    "end": 1469.98,
    "text": "They're like, no, that's not a good thing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.801,
    "end": 1477.906,
    "text": "So it just goes to show that our engagement with magic is mostly a sort of scary play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.507,
    "end": 1482.49,
    "text": "I think one thing I just kind of... Sorry about the seagulls.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1482.57,
    "end": 1483.55,
    "text": "I don't know if you can hear those.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1483.59,
    "end": 1486.172,
    "text": "There are seagulls going crazy just outside my window.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1487.773,
    "end": 1488.854,
    "text": "One thing I would add is I think...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1490.498,
    "end": 1516.48,
    "text": " another aspect to this this part of the framework wherein you have this value of prediction error kind of epistemic and affective emotional value of prediction error it's one of the kind of key elements in this notion of uh agency get in active inference that I think is really it's gonna be really important in mind as you go through the further weeks of this course as well so what is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1517.063,
    "end": 1539.819,
    "text": " know like i said in the lecture it's not necessarily speaking to a quite the metaphysical question of free will but it's certainly moving us away from this picture of of the agent as a kind of automaton that's just following rules there's real space here for kind of individuality and creativity as well okay darius has been waiting a little while so um let's go over to him",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1540.615,
    "end": 1542.596,
    "text": " Happily patient, happily patient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1543.276,
    "end": 1551.299,
    "text": "Yeah, I mean, this is, this question, I guess, is deriving from my thoughts about the meeting of the high road and the low road.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1553.159,
    "end": 1560.942,
    "text": "Some of the recent work that's been coming out of Maxwell Ramsey and actually a conversation I had with him, which is the generative model of the state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1562.682,
    "end": 1567.824,
    "text": "So my question, given that, given and taught by",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1570.191,
    "end": 1591.743,
    "text": " regarding the notion of affordances i think it's natural that as cognitive scientists and philosophers we take the perspective intuitively of the agent in the agent arena relationship and how the agent is in the business of reducing prediction error i was just wondering whether as philosophers um you and mark have thought about what it would what is it like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1592.843,
    "end": 1596.305,
    "text": " for the whole system to be in the business of reducing its prediction error.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1596.365,
    "end": 1598.185,
    "text": "So I'm interested in flow states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1598.626,
    "end": 1617.354,
    "text": "And so, for example, my thinking is that in the canonical example of a flow state, let's say a rock climber, the climbing wall is also in the business of reducing its prediction error as to afford the opportunity for it to be exploited itself or themselves are in the business of reducing prediction error.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1617.634,
    "end": 1619.915,
    "text": "So I'm wondering whether this expansion of affordances",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1620.735,
    "end": 1624.197,
    "text": " It is bi-directional, tri-directional, infinitely directional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1629.661,
    "end": 1633.023,
    "text": "That's an amazing request.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.203,
    "end": 1642.289,
    "text": "You mentioned Axel Constant, but is that somebody else?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1642.329,
    "end": 1644.851,
    "text": "Someone else, but I spoke to Maxwell Ramstein last week.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1644.871,
    "end": 1646.011,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1648.333,
    "end": 1657.429,
    "text": " There's a paper on, I'll find it in a second, on Nishka Instruction and affordances.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1657.489,
    "end": 1660.834,
    "text": "I think it's Axel Conti-Farber.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1661.98,
    "end": 1685.116,
    "text": " where they talk about the symmetry between a niche and an agent, very much in the same vein as you were just talking about there, this idea that there's not just this unidirectional kind of fit between the agent and the environment, but the niche is actually modeling generative model of the agent as well, implicitly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1686.437,
    "end": 1697.821,
    "text": " So I think the best I can do that direction of some really interesting work on that, but it's certainly, it's not, it's, it's, it's not something that plays a central role in my thinking recently.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1697.841,
    "end": 1699.041,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1699.121,
    "end": 1702.203,
    "text": "So we have to just chat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1703.643,
    "end": 1703.843,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1704.883,
    "end": 1706.644,
    "text": "A variational approach to niche construction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1707.104,
    "end": 1707.284,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1707.344,
    "end": 1714.927,
    "text": "I don't know if, if Mark has anything to add or anybody else, which we're thinking of.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1715.007,
    "end": 1715.167,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1716.26,
    "end": 1717.723,
    "text": " Darius, can I just check one thing you asked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.943,
    "end": 1725.037,
    "text": "I don't know how much I need to add here, but did you think that the wall was reducing free energy relative to the climber?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.057,
    "end": 1725.678,
    "text": "Did you say that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.219,
    "end": 1726.6,
    "text": "That's right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1727.041,
    "end": 1727.442,
    "text": "So my...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1728.957,
    "end": 1731.018,
    "text": " So I don't know how that, can that be the case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.158,
    "end": 1731.858,
    "text": "Can that be the case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.198,
    "end": 1736.279,
    "text": "The wall, the wall as a thing is maintaining itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.399,
    "end": 1739.4,
    "text": "And I mean, relative self-evidence thing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.44,
    "end": 1739.62,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1739.741,
    "end": 1742.481,
    "text": "But, but it's not really a duet of one here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.521,
    "end": 1747.283,
    "text": "It's not like it has a generative model that's deep where it's modeling the climber modeling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.583,
    "end": 1749.284,
    "text": " Like the same way as tango dancers do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.984,
    "end": 1765.373,
    "text": "A tango duo are having cooperative flow states because each movement opens a vista of possible error-minimizing opportunities for the partner who in turn opens a vista of error-minimizing opportunities for the partner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.733,
    "end": 1771.276,
    "text": "And backwards and forwards into this ever-opening expanse of affordance capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.736,
    "end": 1774.998,
    "text": "But an inanimate object and an agent don't really have that same dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.018,
    "end": 1776.239,
    "text": "So I was wondering what you were thinking there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.943,
    "end": 1786.47,
    "text": " So my thinking is that this kind of bleeds into the notion of fluidity of affordances, in the kind of Gibsonian sense, and the fluidity of concepts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1786.77,
    "end": 1794.676,
    "text": "So I agree in the sense of physical self-evidencing, it needs to model the rain, it needs to model the physical environment, so as to maintain itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1795.076,
    "end": 1795.917,
    "text": "But what about...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1804.324,
    "end": 1807.246,
    "text": " So a sheer rock face is not a climbing wall.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1807.746,
    "end": 1810.028,
    "text": "And that's because it doesn't self-evidence as a climbing wall.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1810.048,
    "end": 1812.129,
    "text": "It doesn't offer the affordances to be climbed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1812.549,
    "end": 1818.613,
    "text": "That's what I was kind of referring to, which is that affordances change based on the age and arena relationship, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1818.653,
    "end": 1820.975,
    "text": "Your car's affordances change whether it's working or broken down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1821.295,
    "end": 1825.738,
    "text": "Similarly, the climbing will change whether it's got footholds, handholds, or whether it's just a sheer rock face.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1825.758,
    "end": 1826.938,
    "text": "That was my thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1827.099,
    "end": 1832.222,
    "text": "It seems slightly spooky to me that we'd think of the wall as self-evidencing in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.702,
    "end": 1844.327,
    "text": " I think the language that we tend to use, because Julian Kivstein, Eric Reitfeld, Eli Brunberg, and folks often use the idea of affordances and fields of affordances in the active inference way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.128,
    "end": 1855.212,
    "text": "The radical end of the pool there is typically that the affordances don't only happen on the agent side, but rather happen from a dynamic of the changing volatile environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.712,
    "end": 1864.917,
    "text": " and the generative model of the agent, and that they're collaborating in dynamic, ongoing ways such that the affordances are emergent between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.377,
    "end": 1867.778,
    "text": "That certainly seems right to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.479,
    "end": 1874.762,
    "text": "The idea to push it a little bit further and think about the wall self-evidencing, I think it's a step too spooky for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.942,
    "end": 1890.869,
    "text": " I think I would feel safer a little bit closer to thinking about, yeah, the affordances are changing relative to the dynamics of the wall, but I don't know what it would mean for the wall to be evidencing the climber or itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.629,
    "end": 1893.27,
    "text": "Ben, do you have something to add there?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1893.31,
    "end": 1896.511,
    "text": "Yeah, just to kind of, that's stirred a couple of thoughts.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1897.212,
    "end": 1897.412,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1900.509,
    "end": 1921.867,
    "text": " a little longer on the work by affordances because there's this really nice distinction in their work between what they call, well, I'm not sure if they, I think the term landscape of affordances is a little bit older, but they make this distinction between a landscape of affordances and a field of affordances.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1922.968,
    "end": 1935.74,
    "text": " And I think the reason this is really important to get on the table is because this distinction is kind of directly targeting the dynamic, shifting, very affective nature of affordances.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1935.84,
    "end": 1940.724,
    "text": "So on the one hand, you have this landscape of affordances that is relatively static.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1941.585,
    "end": 1952.677,
    "text": " So right now, my landscape of affordances is Brighton, and the landscape of affordances in that sense is not really going to change very rapidly unless I kind of jump on a plane and go somewhere else.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1953.398,
    "end": 1959.544,
    "text": "But the field of affordances has this thoroughly kind of normative, affective character to it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1960.285,
    "end": 1970.29,
    "text": " So depending on my internal state at any given time, depending on my expectations or my desires, say my field of affordances is going to shift very, very rapidly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1970.67,
    "end": 1975.812,
    "text": "And it's so not just not just predicated on my internal state, but also kind of contextual cues as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1976.313,
    "end": 1984.276,
    "text": "So if something were to happen in the environment that was afforded very high precision weighting, then that's likely to shift my field of affordances significantly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1986.858,
    "end": 2015.697,
    "text": " think that the reason that i'm kind of emphasizing this to darius's point is and kind of building on what mark said it it doesn't seem like this distinction at least would apply from the perspective of the perspective of the wall say because this kind of affectivity and normativity just isn't a feature of the walls experience of the world and also to kind of run with that the i mean affordances perhaps you could say a bit more about how you would kind of think about this darius because",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2017.099,
    "end": 2019.382,
    "text": " Affordances are kind of opportunities for actions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2023.408,
    "end": 2027.133,
    "text": "There's some debate about this, but I like to think of them as like a relational property.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2028.415,
    "end": 2032.841,
    "text": "You have the skilled capabilities of an embodied agent, and then you have some feature of the environment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2033.502,
    "end": 2043.208,
    "text": " So I think when you're thinking in from the perspective of the wall, you have the features of the environment because you have the embodied characteristics of the agent are kind of playing that role.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2043.868,
    "end": 2048.891,
    "text": "But it's not clear to me what the kind of skilled capabilities of the wall is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2048.911,
    "end": 2050.692,
    "text": "So, yeah, if you could just say a bit more about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2051.553,
    "end": 2060.544,
    "text": " Yeah, I mean, it may be the case, as you pointed out, that actually the technical term affordance as being opportunities for action is misplaced here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2061.405,
    "end": 2070.315,
    "text": "Again, a lot of this I've been formulating having read this very new paper by Ramstein and colleagues on Bayesian mechanics of physics of and by beliefs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2070.956,
    "end": 2080.346,
    "text": " where he really rams home this point that the system, the generative model is the system of the kind of stochastic differential equations across the state space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2080.586,
    "end": 2085.031,
    "text": "So across the Markov blanket, across the particle with its Markov blanket and the external states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2085.711,
    "end": 2089.595,
    "text": "And that is the system which is in, that system itself is in the business.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2090.476,
    "end": 2091.617,
    "text": " of reducing free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2091.837,
    "end": 2098.142,
    "text": "So it's not just the active inference agent, it's the whole system, which is embedded in the whole system of other things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2098.403,
    "end": 2110.372,
    "text": "And so that was my general thinking, is that just on the prerequisite that these systems exist, just on that a priori axiom, there has to be some kind of self-evidencing of that system itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2110.752,
    "end": 2112.274,
    "text": "So maybe affordances is the wrong word here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2113.098,
    "end": 2116.119,
    "text": " Yeah, that might be the trick right there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.159,
    "end": 2120.32,
    "text": "As soon as you provoke affordance, you're provoking phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.801,
    "end": 2123.622,
    "text": "And so now we're not talking just about statistical variations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.642,
    "end": 2125.522,
    "text": "Now we're talking about lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.922,
    "end": 2128.683,
    "text": "That might be the linchpin right there, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.203,
    "end": 2130.064,
    "text": "I think that is right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2130.104,
    "end": 2130.264,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2130.324,
    "end": 2133.205,
    "text": "And I would say, I think, Darius, you're absolutely on the right track.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2133.245,
    "end": 2136.866,
    "text": "And you're in, I mean, there is this ambiguity about affordances.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2136.906,
    "end": 2138.467,
    "text": "But aside from that, I think you're absolutely right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2138.507,
    "end": 2138.787,
    "text": "I mean, it's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2140.567,
    "end": 2147.729,
    "text": " It's just nonsensical to think about an agent absent an environment under active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2147.749,
    "end": 2152.491,
    "text": "It is this agent environment system in its totality that's minimizing free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2152.511,
    "end": 2154.951,
    "text": "They have to be taken together as one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2155.071,
    "end": 2158.432,
    "text": "And I know, Abel, you've had your hand up for a little while there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2158.592,
    "end": 2159.532,
    "text": "Is there something you wanted to add?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2162.213,
    "end": 2162.413,
    "text": "Yep.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2163.213,
    "end": 2164.074,
    "text": "Do you hear me well?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2164.734,
    "end": 2164.914,
    "text": "We do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2165.484,
    "end": 2166.124,
    "text": " I do, anyway.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2166.244,
    "end": 2166.725,
    "text": "OK.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2167.805,
    "end": 2171.708,
    "text": "So about the afferences, wall-having afferences.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2172.488,
    "end": 2178.752,
    "text": "Basically, the symmetry of agents and environment is a property of active inference, well, of the Ferengi principle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2179.452,
    "end": 2192.6,
    "text": "So if you buy the Ferengi principle, and you also buy that it entails that agents have afferences or any proximal notion, then you also buy that walls have afferences.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2193.484,
    "end": 2196.845,
    "text": " So there are basically three positions you can have on that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2198.325,
    "end": 2200.706,
    "text": "One is that active inference is correct.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2201.046,
    "end": 2205.467,
    "text": "All are fucking affordances and they do self-evidencing, which I would not go with.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2206.628,
    "end": 2213.17,
    "text": "Another option is that you have basically devolved in the details.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2213.19,
    "end": 2214.35,
    "text": "So for example, maybe",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2215.33,
    "end": 2217.252,
    "text": " The adjunct environment is not the wall.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2217.592,
    "end": 2221.295,
    "text": "It's something that is broader, like Gaia system, whatever.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2221.916,
    "end": 2226.52,
    "text": "And it just so happens it includes the wall, but it is not the wall.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2226.7,
    "end": 2228.722,
    "text": "And it does do self-referencing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2230.123,
    "end": 2232.365,
    "text": "And the third is that active inference is wrong.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2233.225,
    "end": 2238.65,
    "text": "We don't have affordances based on whatever is the formal presentation of active inference.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2239.771,
    "end": 2243.134,
    "text": "And I would go in that direction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2245.231,
    "end": 2247.392,
    "text": " of this phenomenology stuff.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2247.472,
    "end": 2255.273,
    "text": "So we have, I would say, philosophical evidence in the sense that denying this would lead to nonsense.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2255.333,
    "end": 2257.674,
    "text": "But information is based on observation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2258.814,
    "end": 2262.875,
    "text": "And some systems do observing much more actively than others.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2263.635,
    "end": 2266.556,
    "text": "And maybe it's a good thing to have in your formalism, I'd say.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2267.863,
    "end": 2278.768,
    "text": " So you have maybe a stronger case for the way phenomenology affordances are constructed in the quantum formulation of the FEP.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2279.428,
    "end": 2286.151,
    "text": "If there is such a thing, which like Chris Fields, someone who we should baseline believe claims there is,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2287.111,
    "end": 2298.173,
    "text": " Because then you have formalization, which is not in terms of dynamics per se, so causal constraints, but observation and directly phenomenology.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2298.753,
    "end": 2311.456,
    "text": "Maybe you have something that is stronger there, but right now the link... Oh, sorry, there is actually a bunch of people who have a quite good hold on science, which are the",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2314.675,
    "end": 2328.458,
    "text": " is based on the ecological activity and cognition on one hand, and between cognition and the metabolism, the constitution of the living thing that cognites on the other.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2329.718,
    "end": 2341.081,
    "text": "And that definition of agency, cognition, and PIC1 entails interactional asymmetry, I think is the word.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2346.786,
    "end": 2370.715,
    "text": " that maybe something we would need to translate into active inference well into the fep for active inference to have a strong grip over this affordance thing until then we have a kind of hand waving weight related to more conceptual approaches uh that are related to an active and ecological approach to psychology and um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2372.608,
    "end": 2377.03,
    "text": " Yeah, the formalism lags basically behind the concept for now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2378.491,
    "end": 2379.951,
    "text": "Sorry for the long talk.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2381.952,
    "end": 2382.592,
    "text": "No, that was great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2382.973,
    "end": 2383.713,
    "text": "Much appreciated.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2383.733,
    "end": 2390.756,
    "text": "Does anybody else want to come in on a question of affordances?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2390.896,
    "end": 2396.079,
    "text": "Because I know affordances played a fairly substantial role in the lectures.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2403.544,
    "end": 2411.577,
    "text": " so anybody has any questions related to affordances or you know action perception affordances then now's the time",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2413.345,
    "end": 2417.268,
    "text": " Yeah, I do have one, but it's not well structured yet.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2417.768,
    "end": 2419.129,
    "text": "That could be fine, go ahead.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2420.11,
    "end": 2433.339,
    "text": "It's something that I've been thinking about for the last months because I started to keep an artificial intelligence field coming from a humanities background and philosophical background, so I'm mixing many things in this period.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2434.597,
    "end": 2462.209,
    "text": " mainly following the active influence as a as a crossroad between many disciplines that and this is very beautiful about the framework and i was super curious about the the question proposed by darius and i was then thinking about now we're actually facing a a new environment and a new landscape in which we're like interacting with the um actually generating",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2464.278,
    "end": 2475.137,
    "text": " over evolutionary time and synchronizing over... logical alien agencies operating within our landscape and field of affordances.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2475.658,
    "end": 2476.359,
    "text": "So I think there's...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2478.216,
    "end": 2480.937,
    "text": " A lot of really interesting work to potentially be done there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2480.957,
    "end": 2500.926,
    "text": "I will take the opportunity to shamelessly plug a preprint that Mark and I have released recently where one thing that I'm really interested in that I can kind of speak with some confidence on is the fact that I do think there's a point at which the theory of affordances or the language of affordances starts to break down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2507.662,
    "end": 2514.984,
    "text": " So the preprint that I'll share around is looking at ambient technology specifically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2515.144,
    "end": 2524.366,
    "text": "So this is technology that the whole kind of impetus behind its design and conceptualization is that the user doesn't have to actually do anything.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2525.026,
    "end": 2528.107,
    "text": "So it precedes the user pragmatically and epistemically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2528.167,
    "end": 2532.088,
    "text": "It knows what kinds of things you want it to do, and it just does them in the background.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2532.628,
    "end": 2534.189,
    "text": "And it works by shifting",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2535.109,
    "end": 2541.118,
    "text": " It subtly shifts the material environment such that it impacts your field of affordances in real time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2543.148,
    "end": 2549.911,
    "text": " And the argument that we make in that paper is essentially that the affordances approach doesn't really work for this and that we need to kind of think again.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2550.051,
    "end": 2555.293,
    "text": "So, yeah, I mean, I think that that might be a nice point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2555.513,
    "end": 2566.438,
    "text": "But like how to conceptualize generative AI, for example, under the affordances framework, I don't have anybody that's done any work on that, but it would certainly make a really cool project.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2570.219,
    "end": 2571.96,
    "text": "You are making it right now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2573.803,
    "end": 2588.494,
    "text": " what's that you are making it right now i know because you sent me the paper to review oh yeah thank you thank you so um we were looking at we so we uh",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2590.22,
    "end": 2594.521,
    "text": " early stages of a paper on the role of generative AI in classrooms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2595.162,
    "end": 2613.848,
    "text": "So from the perspective of thinking about what kinds of affordances generative AI represent in a learning environment, particularly we're kind of applying active inference to classroom design and looking at it from the different angles of different educational and pedagogical theories.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2614.868,
    "end": 2617.769,
    "text": "But it's very early days, but that's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2619.079,
    "end": 2623.14,
    "text": " Yeah, I suppose it partly depends on your view of generative AI in general.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2623.18,
    "end": 2628.382,
    "text": "I mean, it depends whether you would consider it a real cognitive agent or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2628.482,
    "end": 2641.207,
    "text": "I think some people are more inclined to think of it as, you know, this is a thing that has agency, it has real understanding, it has like, you know, and other people are maybe less inclined to think of it in those terms.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2641.247,
    "end": 2644.988,
    "text": "And I think that might bear significantly on how you think of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2647.182,
    "end": 2648.102,
    "text": " Yeah, that's super cool.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2648.182,
    "end": 2665.026,
    "text": "Basically, the last project you mentioned is very, very in line with my PhD project right now, because my main PhD project is European farming, so it's about the AI for personalized education, and I'm trying to follow it through the active inference framework from a multilevel perspective.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2666.406,
    "end": 2666.766,
    "text": "So, yeah.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 2667.566,
    "end": 2667.966,
    "text": "Very cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2668.167,
    "end": 2670.087,
    "text": "Yeah, we should probably talk more about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2673.808,
    "end": 2674.888,
    "text": "Okay, Darius.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2678.203,
    "end": 2691.359,
    "text": " Yeah, I wanted to ask, I mean, this may be directed more at Mark, because I know this is kind of his work, in terms of slopes of uncertainty and about doing better than expected at reducing prediction error over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2692.594,
    "end": 2699.898,
    "text": " I was wondering kind of how the architecture of that is built into the particle, into the generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2700.098,
    "end": 2713.784,
    "text": "Because we have the kind of, for me, I don't know if it's an out and out sort of conflict, but we have these kind of implicit priors that we're going to fulfill certain expectations or minimize prediction error regarding certain things, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2713.804,
    "end": 2718.367,
    "text": "So homeostatic priors or happiness, well-being, whatever it is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2719.167,
    "end": 2731.559,
    "text": " But then your claim is that we have the higher order beliefs, the higher order predictions that over and above that, I also need to do well, better than expected at reducing prediction error over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2732.34,
    "end": 2735.463,
    "text": "So it's still quite fuzzy in my mind.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2735.523,
    "end": 2741.548,
    "text": "But is there a kind of potential conflict there between the general priors that the system has",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2742.489,
    "end": 2751.052,
    "text": " and then go actually in a sense, violating those expectations by going over and above them, which itself constitutes an expectation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2751.093,
    "end": 2753.834,
    "text": "How do you kind of resolve that tension?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2755.994,
    "end": 2756.875,
    "text": "Yeah, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.015,
    "end": 2760.056,
    "text": "But this is very much in Ben's wheelhouse, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.656,
    "end": 2766.819,
    "text": "Ben and I have been working on slopey stuff for almost as long as I've been doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.319,
    "end": 2767.699,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.95,
    "end": 2784.933,
    "text": " What was his original paper called?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.334,
    "end": 2786.114,
    "text": "We'll get it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.174,
    "end": 2792.239,
    "text": "They do a really good job of showing technically where this sits within a deep parametric model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.68,
    "end": 2806.106,
    "text": " Lara Senved-Smith's paper on metacognition also does this by showing you have these depths of modeling where models above are modeling models below, and optimizing over those models below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.487,
    "end": 2812.13,
    "text": "So we have some good computational backbone for not only thinking that this is the case, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.13,
    "end": 2834.959,
    "text": " beginning to express how it does the work it does um so let's let's leave that for digging into it though technically on sort of on our own let me say sort of a at a higher more abstract level still hopefully it's useful um it's not weird to think that this kind of anticipatory system is not only making predictions about the world but it's also um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.32,
    "end": 2844.027,
    "text": " Part of what it's predicting is how fast or slow, how efficient it is in particular contexts at resolving certain kinds of errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.608,
    "end": 2849.833,
    "text": "That's a perfectly fine thing to think that we're also predicting slopes of engagement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.854,
    "end": 2857.444,
    "text": " And then all we're saying then is system also pays attention to when those expectations are breached and it's learning from those breaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.925,
    "end": 2860.408,
    "text": "That should just be the bread and butter for what the system does anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.849,
    "end": 2865.776,
    "text": "So precision is a second order process in much the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.457,
    "end": 2882.118,
    "text": " Precision is about how reliable are lower-level predictions, and then using that amount to toggle how impactful either errors or predictions are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.478,
    "end": 2897.542,
    "text": " So we've already got baked into the system right from early days, this idea that the system is not only making predictions but monitoring its own predictive processing regimes and then toggling based on how reliable those substreams are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.502,
    "end": 2907.405,
    "text": "All we're adding here is when we first thought about those mechanisms, one thing that can happen, this is just good for everybody who's interested in active inference because I bump into this with my students all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.525,
    "end": 2910.546,
    "text": "When we say something like precision weighting,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.141,
    "end": 2914.762,
    "text": " a tendency to think it's a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.043,
    "end": 2924.566,
    "text": "So we go to find this precision weight, like where's the biological instead or like this precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.566,
    "end": 2932.449,
    "text": "When we actually get into a bio system and we look for these things, the truth is precision is going to be weighted in lots of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.489,
    "end": 2934.05,
    "text": "I mean, that's the real frontier question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.17,
    "end": 2937.152,
    "text": " of this research is to actually find how these things are instantiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.592,
    "end": 2939.113,
    "text": "And the answer is going to be multifarious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.153,
    "end": 2942.976,
    "text": "I mean, it's going to be, you're going to have precision adjustments happening throughout the system in lots of ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.376,
    "end": 2946.858,
    "text": "It could be synchrony and asynchronous and desynchronies between systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.259,
    "end": 2949.02,
    "text": "It can be neuromodulatory chemicals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.06,
    "end": 2953.843,
    "text": "It can be structural, structural, um, uh, shapes within the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.963,
    "end": 2957.425,
    "text": "I mean, um, precision is going to be set in, in lots of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.066,
    "end": 2959.587,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.884,
    "end": 2983.171,
    "text": " All that we're pointing out here is that one of the ways that the precision is being set, one of the ways that the system is tracking how efficient it is and then upping or lowering the amount of impact error signals or predictions have is that it's happening in an embodied way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.671,
    "end": 2987.953,
    "text": "So we've looked over to the affective search",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.854,
    "end": 2994.301,
    "text": " And lo and behold, there are all these signatures that we were looking for this part of the machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.942,
    "end": 3000.27,
    "text": "So not weird that the system is tracking its own regularities and adjusting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.59,
    "end": 3001.912,
    "text": "That was baked in right from the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.932,
    "end": 3003.574,
    "text": "Now it does that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.673,
    "end": 3005.774,
    "text": " That's one of the frontiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.854,
    "end": 3007.415,
    "text": "It's going to happen in lots of different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.875,
    "end": 3009.576,
    "text": "Lo and behold, affect the dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.416,
    "end": 3011.097,
    "text": "The shoe fits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.617,
    "end": 3013.378,
    "text": "They look like they do that stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.778,
    "end": 3017.361,
    "text": "And then you bring it to the lab and you go back to like reward prediction error research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.981,
    "end": 3027.747,
    "text": "And sure enough, neuromodulatory chemicals, reward systems are tuning affective dynamics relative to better than and worse than slopes of uncertainty management.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.107,
    "end": 3031.649,
    "text": " It's exactly what we would expect given the computational model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.51,
    "end": 3039.514,
    "text": "So then it was an easy next step to start saying, well, look, there's one of the ways that precision is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.714,
    "end": 3041.035,
    "text": "There's one of the ways that affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.733,
    "end": 3071.747,
    "text": " system now just notice there it's the only decision and not the only thing the affective system is doing we never want to say we never sort of we're careful not to be reductionist to say oh affect is always aerodynamics i don't think that's right i think it's that aerodynamics are expressed in part affectively and they have this impact on the system um that we can that we that we've known about for a long time even from just a reward prediction error um literature does that help or was that a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.321,
    "end": 3078.264,
    "text": " Yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3078.284,
    "end": 3078.484,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3078.504,
    "end": 3083.967,
    "text": "Just to add two things really quickly there, because I know time is kind of catching up with us.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3084.047,
    "end": 3097.656,
    "text": "I would emphasize as well, like just as a kind of general point, one of the things I really like about the work on aerodynamics and affect is it has this nice kind of broad capture of the kinds of affectivity that agents can experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3097.716,
    "end": 3100.978,
    "text": "So we're not just when we talk about affectivity, we're not just talking about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3101.618,
    "end": 3103.84,
    "text": " full blooded emotions or even just moods.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3103.96,
    "end": 3107.062,
    "text": "But we're talking about what is it?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3107.122,
    "end": 3121.112,
    "text": "One of the things I kind of drew attention to in the lecture was Matthew Ratcliffe's work on existential feelings, which I think is just such a the connection between active inference and phenomenology that you find in some of this work is just insanely powerful.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3121.252,
    "end": 3123.994,
    "text": "And it's one of the things that really drew me into the framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3125.075,
    "end": 3127.957,
    "text": "The second thing, just build the model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3130.539,
    "end": 3133.541,
    "text": " One thing that I don't think I mentioned in the lecture is active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3133.822,
    "end": 3137.925,
    "text": "It has been described as a quintessentially metacognitive framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3138.505,
    "end": 3144.049,
    "text": "So you have kind of built into the architecture, you have expectations over expectations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3144.089,
    "end": 3146.391,
    "text": "So you have kind of predictions about predictions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3147.091,
    "end": 3154.476,
    "text": "And this has proved to be just, you know, again, just phenomenally useful for thinking about certain aspects of phenomenology as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3154.557,
    "end": 3159.18,
    "text": "So, yeah, I think that these are these are like real strengths of the framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3165.268,
    "end": 3165.649,
    "text": " OK.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3169.953,
    "end": 3171.335,
    "text": "I don't know how we're doing for time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3171.395,
    "end": 3174.498,
    "text": "Are we strictly limited, or can we?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3175.139,
    "end": 3176.72,
    "text": "We are not, as far as I know.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3176.74,
    "end": 3176.86,
    "text": "Daniel?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3181.653,
    "end": 3187.017,
    "text": " Well, I can probably do, definitely do another 15 if anybody has any more questions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3187.898,
    "end": 3193.302,
    "text": "And people, I should say as well, that doesn't mean that we're all held captive to my timeframe.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3193.342,
    "end": 3197.805,
    "text": "So if people do need to leave within the next five or 10 minutes, that's absolutely fine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3197.865,
    "end": 3202.209,
    "text": "But I'm certainly happy to carry on if anybody has any more questions or comments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3207.339,
    "end": 3214.345,
    "text": " If no one else has got any, I would quite like to go back to earlier in the discussion, you were talking about the value of uncertainty.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3216.207,
    "end": 3221.392,
    "text": "Because in organizations in which I'm working with,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3222.633,
    "end": 3229.498,
    "text": " We often have conversations about uncertainty and what we find is over time there tends to be a drift towards risk aversion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3230.098,
    "end": 3237.664,
    "text": "So we're working with a large international construction company at the minute and they used to have a culture in which innovation",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3239.805,
    "end": 3266.334,
    "text": " uh was uh was quite well embedded and and over time it's kind of drifted towards very very risk averse culture where actually rather than learning through the process and being able to tolerate uncertainty you know around opportunities and you know what can be accomplished and that kind of the valence that comes with uh the intrinsic reward i suppose of being able to reduce uncertainty about capabilities to a situation where they're trying to anticipate",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3267.293,
    "end": 3270.974,
    "text": " all of the risks upfront before they even get involved in the project.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3270.994,
    "end": 3274.274,
    "text": "So, you know, there's some kind of valence switch mark.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3274.374,
    "end": 3284.216,
    "text": "And you mentioned David Blaine earlier, you know, and something about the context, you know, there was a switch in valence from, yeah, this is a kind of a play.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3284.256,
    "end": 3288.977,
    "text": "This is a safe thing to do to actually know this is, you know, this has real consequences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3289.477,
    "end": 3296.759,
    "text": "So I'm just kind of, I'd like to explore that a little bit more, actually, if anyone's got kind of any insights or papers or comments.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3300.256,
    "end": 3320.113,
    "text": " yeah so i think that's a really interesting question actually and i i think um so it seems like one of the things one of the things we've been talking about is this connection between uncertainty prediction error minimization and affectivity in individual agents and it sounds like what you're asking is like how does that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3320.967,
    "end": 3346.939,
    "text": " translate to like collectives so one of the things about active inference that we're going to see in subsequent weeks is how it scales up to kind of larger systems like companies or you know groups that are trying to achieve some kind of shared goal how do you how does the value of uncertainty translate onto like how is it scalable in that sense right is that would that be a fair kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3348.849,
    "end": 3350.053,
    "text": " Yeah, I guess so.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3350.073,
    "end": 3351.617,
    "text": "I guess it's... I mean...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3356.008,
    "end": 3366.754,
    "text": " So uncertainty, often when it's talked about, uncertainty is talked about as risk, which is, I suppose, is predictions or anticipation of outcomes that we don't want, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3367.054,
    "end": 3374.438,
    "text": "Whereas there's also positive uncertainty, which is, I suppose, simply stated opportunities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3374.718,
    "end": 3379.141,
    "text": "Through curiosity, what might we be able to achieve?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3379.161,
    "end": 3383.263,
    "text": "This kind of novelty seeking, I guess, that new opportunities that we haven't exploited.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3384.703,
    "end": 3391.645,
    "text": " And they're just, you know, in the kind of organizational systems, you know, I think there are various pressures that cause it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3392.185,
    "end": 3404.109,
    "text": "But over time, you see these cultural shifts towards, you know, a very, very kind of risk averse, you know, where, you know, where the valence is obviously quite negative, you know, you know, quite an unpleasant situation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3404.389,
    "end": 3405.329,
    "text": " feeling for people.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3405.569,
    "end": 3406.13,
    "text": "And yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3406.19,
    "end": 3408.731,
    "text": "Yeah, this is good.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3409.111,
    "end": 3410.671,
    "text": "This is right at the heart of my current work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.792,
    "end": 3412.672,
    "text": "I'm really interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.752,
    "end": 3420.955,
    "text": "So we just had a big stint where active inference models were starting to be used in computational psychiatry, especially for pathological disorders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.375,
    "end": 3425.676,
    "text": "So addiction, depression, dissociative disorders, OCD, PTSD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.597,
    "end": 3433.199,
    "text": "It's quite a sexy framework for thinking about some of the ways that the cognitive system breaks down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.679,
    "end": 3455.825,
    "text": " And the sort of new move right now, I mean, we have a collection coming out right now in neuroscience of consciousness, is to think about these things in terms of, okay, if we are predictive systems and we have a sufficiently rich model of how that system works in a particular niche, what sorts of ways can we intervene on that system in order to have positive outcomes rather than just modeling what the negative outcomes are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.425,
    "end": 3458.226,
    "text": " And I hear that a lot in what you're saying now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.246,
    "end": 3460.788,
    "text": "So I'm just going to drop one link for you there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.188,
    "end": 3467.733,
    "text": "This is Casper Hesp again, wrote a little, a very small paper with a nice little model called sophisticated affective inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.193,
    "end": 3473.417,
    "text": "He has a little bot that tends towards catastrophe, catastrophizing the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.877,
    "end": 3479.722,
    "text": "If it's given, if it's given like fun, medium fun, medium fun, dangerous,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.422,
    "end": 3485.423,
    "text": " over time, it tends to expect the dangerous one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.464,
    "end": 3492.505,
    "text": "After 10,000 iterations, it basically lives in the worst possible scenario, which is a nice little thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.525,
    "end": 3495.425,
    "text": "This is my wife.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.745,
    "end": 3497.206,
    "text": "This is most people today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.586,
    "end": 3502.267,
    "text": "So the question is, I want to know, given the model, why does that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.667,
    "end": 3504.407,
    "text": "And what can we be doing to intervene?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.067,
    "end": 3507.748,
    "text": "And part of the answer is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.808,
    "end": 3511.669,
    "text": " we need to become more tolerant of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.709,
    "end": 3514.129,
    "text": "That's one of the things that the system can be better or worse at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.63,
    "end": 3519.731,
    "text": "So this just takes the computational modeling and then looks to things that we already know about emotional regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.911,
    "end": 3522.131,
    "text": "That's part of the story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.692,
    "end": 3529.333,
    "text": "So we've done a little bit of work on this with our predictive dynamics of happiness and well-being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.373,
    "end": 3532.894,
    "text": "And Ryan Smith is definitely doing work on this with active inference and well-being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.694,
    "end": 3536.315,
    "text": "So definitely check that out if you're interested here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.809,
    "end": 3544.445,
    "text": " I'll just flag one interesting thing here that relates just to what we were just talking about, about layers of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.812,
    "end": 3548.114,
    "text": " One way, let's say two ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.514,
    "end": 3556.56,
    "text": "There's two ways that a system, and it's probably going to be lots, but the two that come to mind that a system can become more tolerant to uncertainty is one, exposure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.321,
    "end": 3561.224,
    "text": "So this is why exposure therapy might be useful for our kind of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.724,
    "end": 3569.25,
    "text": "You want to expose the system to volatility at the lower and middle levels of the hierarchy and have it turn out okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3569.67,
    "end": 3574.034,
    "text": "So that one of the things that the system can come to predict is not only, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.514,
    "end": 3579.316,
    "text": " particular outcomes, but it can also predict how much error is involved in particular outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.777,
    "end": 3584.799,
    "text": "So for instance, when I used to give a pro talk, I was always really nervous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.56,
    "end": 3595.244,
    "text": "And I don't know if that ever really went away, but I've had so much exposure to the anxiety of giving a professional talk that basically I don't notice it anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.284,
    "end": 3599.967,
    "text": "But if you were to ask me at the beginning of my talk, Mark, right now, what's your phenomenology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.987,
    "end": 3604.311,
    "text": " and I sort of meditatively looked, I'd probably say, yeah, I'm nervous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.812,
    "end": 3606.855,
    "text": "But if you hadn't have said that and you were just like, hey, what's up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.875,
    "end": 3608.377,
    "text": "I'd have been like, oh yeah, I'm great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.457,
    "end": 3609.438,
    "text": "Like, it's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.458,
    "end": 3610.299,
    "text": "I don't even notice it anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.8,
    "end": 3612.803,
    "text": "That's because the system knows that I have errors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.462,
    "end": 3638.938,
    "text": " but as soon as i start talking they drop away and because i know the arc that even error in the system it becomes non-newsworthy it's no longer interesting volatility to be tracking that's just from exposure okay so what's happening is you're having errors at a lower middle level that a higher level is now modeling saying when we come here we should expect this arc of error same thing when you work out like real gym rats they can feel good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.572,
    "end": 3662.543,
    "text": " you're having your jet your tiller skeletal system right but at the higher level it's now learned not only that that has a natural arc but that that's a good sign at a higher level so now you're getting a positive you're getting positive prediction error slope high and negative prediction error slope low",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.283,
    "end": 3663.583,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.104,
    "end": 3665.865,
    "text": "So one is exposure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.406,
    "end": 3669.869,
    "text": "Two, you can model your own responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.009,
    "end": 3675.174,
    "text": "This is something Ben and I work on with horror movies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.394,
    "end": 3682.721,
    "text": "You can take an active role in mindfully observing your own reactions to volatility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.322,
    "end": 3686.004,
    "text": "And this comes up in our paper on horror.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.044,
    "end": 3687.866,
    "text": "We've already dropped the link today if you want to check it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.226,
    "end": 3711.436,
    "text": " something really special happens when the system models its own reaction to volatility it starts to learn that um even reactions to volatility uh don't need to be um they don't need to be compounded up into dangers that it's okay it's okay to be uncertain at certain levels of the system so how that translates into business i'm not sure other than i know tolerance to uncertainty is a marker of business success",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.516,
    "end": 3736.974,
    "text": " and um i suspect the framework in a fit like lots of mindfulness mindfulness work about learning to tolerate uncertainty is there anything about um the role of language in kind of modulating those metacognitive oh it's good if i'm there i was uh preparing an answer on that specifically and i was nervously waiting for the opportunity so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.287,
    "end": 3753.734,
    "text": " Like meta, in terms of evolutionary, cognitive archaeology, we don't know when language emerge, but we do know that it's an anchoring semantic system.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3753.774,
    "end": 3760.077,
    "text": "So you can build things in language and you can expect things in the world to correspond to things in language.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3761.138,
    "end": 3770.363,
    "text": "So for example, if you, that's abstract, as I say, it's abstract, but you can, for example, have a self-identity and I'm French, I'm a French.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3771.417,
    "end": 3775.719,
    "text": " And I communicate with the expectations that are embedded in that identity with other people.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3776.24,
    "end": 3777.68,
    "text": "And that means we communicate over norms.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3777.9,
    "end": 3781.242,
    "text": "So we have specific expectations of what we will do.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3782.103,
    "end": 3787.985,
    "text": "And those expectations, they become embedded in specific symbolic markers that are embedded in language.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3789.166,
    "end": 3798.371,
    "text": "And something that, like the thing that it was strongly evoked in my mind when you talked of tolerance to insecurity is that",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3799.773,
    "end": 3819.537,
    "text": " As far as documented history goes, Europeans, well, Indo-Europeans, they are pretty strong on the idea that things have a nature and they act lawfully and their nature and their laws, they somehow correspond to linguistic categories.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3820.117,
    "end": 3828.759,
    "text": "So I can say stuff like chickens quack, and that's a proper explanation of what are chicken and why they quack.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3830.293,
    "end": 3844.598,
    "text": " And if you look in Chinese philosophy, as far as written history goes, you have a much better accent on Wei Wu Wei, so a poor translation would be an effortless action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3846.272,
    "end": 3849.817,
    "text": " A closer translation would be action without action.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3850.658,
    "end": 3864.374,
    "text": "So it's a form, it's something that is quite close to the phenomenology of flow in that you observe yourself doing things and you do not apply a conscious effort to the flow of what you're doing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3865.86,
    "end": 3886.75,
    "text": " And that looks like something that is closer to the phenomenology you'd expect if you apply, you know, recursive predictive cognition with less or less heavy or more effectively integrated symbolic occurring, like use of language as something that you actually expect to be meaningful and to constrain strongly your actions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3888.11,
    "end": 3891.692,
    "text": "And marginally, I'd expect very strongly symbolic",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3894.412,
    "end": 3920.928,
    "text": " expect that linguistic categories will map and what you build with it so i don't know self identities plans whatever uh will map cleanly onto what you observe you will be very very anxious about things because that does not happen usually um and yeah um besides uh grand discourse on the interpreter prefer um traits which are usually not that constructive i'd um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3923.4,
    "end": 3926.682,
    "text": " Sorry, I got lost because I did not have the speech.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3927.102,
    "end": 3929.903,
    "text": "Let me just say one thing before we move off this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.544,
    "end": 3935.345,
    "text": "A simple way that language might help is by invoking cognitive flexibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.486,
    "end": 3942.409,
    "text": "So oftentimes, we think about the management of error being either updating predictions or acting on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.609,
    "end": 3944.43,
    "text": "That's the dyad, usually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.83,
    "end": 3951.433,
    "text": "What it overlooks is the third one, which is we can also manage volatility by redeploying precision in a better way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.233,
    "end": 3963.224,
    "text": " So rather than just updating your model to fit the world or updating the world to fit your model, you can just change the set of what matters so that you're not really updating the model and you're not really changing the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.264,
    "end": 3964.985,
    "text": "You're just changing the problem landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.526,
    "end": 3967.528,
    "text": "And that's something language allows us to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.548,
    "end": 3968.889,
    "text": "It's maybe one of the really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.89,
    "end": 3976.752,
    "text": " Amazing things that language allows us to do is we can use language to bootstrap that kind of precision adjustment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.012,
    "end": 3981.854,
    "text": "So if the train doesn't come on time, we both notice it, okay, and we feel bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.894,
    "end": 3983.214,
    "text": "That's perceptual updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.774,
    "end": 3985.135,
    "text": "We might go and get a taxi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.195,
    "end": 3986.935,
    "text": "That's active updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.336,
    "end": 3996.798,
    "text": "But I might just say to you, wow, look, isn't it lovely that now we get a little bit more time to read our book or to continue our conversation or let's finish our coffee with a little bit of ease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.838,
    "end": 3998.179,
    "text": "I mean, we get an extra 20 minutes now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.639,
    "end": 4002.364,
    "text": " Even just saying that redeploys precision over the problem space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.965,
    "end": 4006.389,
    "text": "Now, the train being late isn't volatility in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.431,
    "end": 4011.316,
    "text": "The train being late is signaling to the system that a better than expected slope has been achieved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.256,
    "end": 4013.097,
    "text": " Isn't that so interesting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.277,
    "end": 4018.0,
    "text": "The exact same occurrence is either undigestible volatility, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.2,
    "end": 4018.881,
    "text": "Like you're going to be late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.921,
    "end": 4019.421,
    "text": "Oh my goodness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.841,
    "end": 4026.466,
    "text": "Or it's an opportunity for an improvement in the system, which is now you get more time with the person that you're taking the train with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.926,
    "end": 4033.07,
    "text": "And that was just a matter of linguistic perturbance of the way that precision is being deployed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.43,
    "end": 4039.995,
    "text": "So if you're looking at, if you wanted to dig into the research here, I would look up cognitive flexibility and language or coaching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.495,
    "end": 4042.236,
    "text": " Cognitive flexibility is such a good point here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.759,
    "end": 4053.285,
    "text": "So you have a paper by Nick Clark on this specific and current role of language, and something it entails is that basically you've got",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4054.201,
    "end": 4064.584,
    "text": " Like, if the active infrastructure is correct, you flexibly predict the flow in the interoceptive, proprioceptive, exteroceptive, is that even a thing, space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4065.364,
    "end": 4069.585,
    "text": "And that is what builds an integrated experience, integrated cognition.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4070.685,
    "end": 4073.086,
    "text": "And language, it adds another layer of complexity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4073.106,
    "end": 4080.508,
    "text": "If you can just talk to yourself in your head, that is another dimension that you can predict and that can be coherent or incoherent with your world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4081.471,
    "end": 4091.103,
    "text": " And so that is an extremely powerful anchoring system because I just have to tell a plan to myself and boom, that pushes me, nudges me nicely for the plan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4091.343,
    "end": 4097.15,
    "text": "But then you can have a different level of meta expectation over how language corresponds to reality.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4097.19,
    "end": 4097.63,
    "text": "And I'd say,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4098.311,
    "end": 4109.456,
    "text": " a very, very strong factor of, you know, aversion to uncertainty is whether you expect your plans or your linguistic structure to nicely map them to reality because it will not happen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4109.957,
    "end": 4114.759,
    "text": "But if you expect strongly that it will be the case, you will have to make it happen somehow.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4115.339,
    "end": 4124.283,
    "text": "And here you will adapt rigid strategies and you will like lose flexibility, but also language and story for flexibility to be the case in the first place.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4124.323,
    "end": 4127.585,
    "text": "So it's about coupling between dimension of cognition.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4130.737,
    "end": 4141.244,
    "text": " Yeah, and I would just kind of, risk and danger are two things that I've been really interested in across a kind of variety of different contexts.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4141.304,
    "end": 4142.285,
    "text": "And I would say,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4145.256,
    "end": 4168.836,
    "text": " some of the things that have been said like the kind of how you can influence the system by externalizing things through language and the different strategies that systems whatever scale they're on have minimizing prediction error um minimizing free energy but also I would just emphasize the importance of like external context here as well so even in the case of like a collective like a business you still have to",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4169.557,
    "end": 4172.501,
    "text": " take into account the environment in which the business is operating.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4172.541,
    "end": 4177.286,
    "text": "And I've been really interested in a particularly extreme example of context.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4177.447,
    "end": 4188.52,
    "text": "I used to still do some work in philosophy of sport, and I've been really interested in dangerous sports and why there seems to be this insane contextual effect where",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4189.441,
    "end": 4217.22,
    "text": " within a very kind of narrow contextual band of sporting practice people seem willing to take on risks that outside of that context would just be completely insane um and i think this is something that's probably going to come up again again in uh you know subsequent weeks as well here when we talk about um the way that expectations on an individual or a collective basis can be set but through other minds uh like",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4219.104,
    "end": 4247.917,
    "text": " patient so what somebody else and expect myself to do and and so on and so on uh darius you've had your hand up a while do you want to jump in yes please i'm not sure this is the sort of grand synthesis of any of this but um flow was mentioned as i said it's a kind of um pet topic of mine and something that we know about flow and this way it's integrated into this idea of language and agency",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4249.286,
    "end": 4261.792,
    "text": " is that at least in its original conception of Success Mahali and the qualitative experience associated with flow, you would find stuff like not only the dilation of time, but also the reduction in self-consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4262.728,
    "end": 4270.75,
    "text": " And now this is sort of picking up a lot of work that happens at UCL and people like Jeremy Skipper, how integrated language is into the sense of self.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4271.59,
    "end": 4290.234,
    "text": "And it seems to me, and I, you know, this is kind of shooting from the hip, that all of these very deep rooted, I guess they're kind of psycho technologies, the self language seem to dissipate at this Goldilocks zone, at this point of, at this edge of criticality, at this flow state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4291.201,
    "end": 4306.691,
    "text": " Which makes me think if the flow state is a phenomenological offshoot of being optimally reducing prediction error, what is the kind of role of the concept of the self or linguistic functions?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4307.491,
    "end": 4312.855,
    "text": "Because it seems to me that that becomes a regulatory function when that optimality is reduced, when stuff starts going wrong.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4313.915,
    "end": 4340.654,
    "text": " um so i think you can also think about this in the kind of heideggerian or dreyfus sense of just opening a door you only start to represent the door in yourself you only give it the linguistic object of a door when you can't open it when you open the door standard there is no representation going there i mean you could even argue there's no qualia there so i'm wondering how deep that runs and what the kind of what we can say about the role of agency selfhood maybe even consciousness",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4342.915,
    "end": 4348.294,
    "text": " because they don't seem to be that prevalent, at least from my understanding, when we are at the edge of criticality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4349.215,
    "end": 4373.437,
    "text": " is the suggestion you're making there is um it sounds like what you're saying that these you call them psycho technologies which i really like uh you know like language and uh and and self like certain aspects of self-modeling they are a kind of scaffolding uh or like a ladder that you then kind of gets kicked away once you reach a certain kind of edge of criticality like where the performance becomes",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4375.339,
    "end": 4381.161,
    "text": " I don't know what you're performing at such a level that you just don't need those, those scaffolding.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4382.201,
    "end": 4382.501,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4382.681,
    "end": 4393.745,
    "text": "Or, or the self regulatory mechanisms that we harness when we're not in flow are linguistic or agentic in essence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4393.985,
    "end": 4402.028,
    "text": "And once, yes, once you sort of, you don't need that when you're the sort of, yes, when you're at this edge of criticality, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4403.072,
    "end": 4410.66,
    "text": " And I only postulate that because I'm only thinking how deep does that go?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4411.341,
    "end": 4416.486,
    "text": "Because I know obviously the active inference framework is trying to tackle in some ways the hard problem as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4417.287,
    "end": 4423.033,
    "text": "And there are some flotations of the idea, at least within the flow community, about the kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4424.955,
    "end": 4439.623,
    "text": " want to say elimination but the moderation the modulation of qualia under flow states so could that could we also consider that to be an a construct um which happens when we're not necessarily",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4441.01,
    "end": 4444.151,
    "text": " are optimally producing prediction error.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4444.771,
    "end": 4445.772,
    "text": "So a couple of things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4445.872,
    "end": 4450.813,
    "text": "So I'm certainly not the person to stop talking about consciousness, so I won't.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4451.733,
    "end": 4459.236,
    "text": "But I would just... Some of the readings that I mentioned in the lecture might be interesting for you on this topic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4459.316,
    "end": 4465.498,
    "text": "So if we're talking about certain structures that seem...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4466.758,
    "end": 4479.726,
    "text": " very, very pervasive in our phenomenology and how those structures can sometimes kind of dissolve away and how that might be accounted for under an active inference framework.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4480.306,
    "end": 4486.47,
    "text": "There's some really interesting work on psychedelics by George Dean and some of George Dean's co-conspirators.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4486.53,
    "end": 4489.612,
    "text": "I know Mark and Sam Wilkinson worked on a paper with George.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4490.213,
    "end": 4499.489,
    "text": " So George Dean's done some work on kind of ego dissolution and certain kinds of experiences related to selfhood kind of, and I, I,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4500.984,
    "end": 4509.008,
    "text": " kind of don't want to overstep the mark, but I think they kind of come, they fall generally under this kind of rebus model of psychedelic efficacy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4509.068,
    "end": 4517.171,
    "text": "So I don't know if people are familiar with this, but this kind of finds natural articulation through predictive processing and hierarchical self-modeling and that kind of stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4517.311,
    "end": 4519.832,
    "text": "I also wanted to really quickly flag on this topic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4520.393,
    "end": 4527.716,
    "text": "I'll find the paper and I'll put it up on the Coda because I don't think I'll be able to find it quickly enough now, but there was a paper that came out very recently",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4528.917,
    "end": 4535.004,
    "text": " that showed the efficacy of internal self-talk on sports performance.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4536.047,
    "end": 4555.981,
    "text": " So they did an experiment with cyclists and they found that when cyclists were allowed to engage in kind of constant self-talk with them, so like an inner monologue in their head, their performance at cycling was like measurably boosted, which I thought was really interesting and kind of relevant here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4556.302,
    "end": 4559.124,
    "text": "But it's interesting because it kind of just kind of,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4560.953,
    "end": 4587.203,
    "text": " uh it sounds like it might prima facie be in tension with what we were saying about flow states as well right so it's if if the real edge of performance is is a place where these structures of phenomenology phenomenology bleed away um it kind of calls into question like to what extent are these psychotechnologies effective and in what way are they effective and yeah there's like yeah just a whole kind of universe of really interesting questions there",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4588.598,
    "end": 4594.282,
    "text": " So if I may, selfhood indirectly will be the central topic of the last two sessions.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4595.704,
    "end": 4602.449,
    "text": "My position about it is that it's selfhood in a sense we use all of the time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4602.469,
    "end": 4610.976,
    "text": "It's a quite high level construct that emerged from the ability we have to compare our activity to a",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4612.094,
    "end": 4628.957,
    "text": " socially embedded model of our activity so that is something that is quite specific to humans because of their linguistic ability and or because of their tendency to um what tomasello calls a shared intentionality so the ability to collectively define and like plants",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4631.579,
    "end": 4641.167,
    "text": " So basically this is something that enables a very deep, very profound and robust transmission of cultural knowledge and transmission of norms.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4641.588,
    "end": 4648.633,
    "text": "This is what enables the construction of norms, but it's quite heavy cognitively and",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4649.734,
    "end": 4670.547,
    "text": " it is predictable that if you're busy comparing what you do to what an idealized version of yourself is doing you're gonna invest less creative energy in actually doing the thing that you would if you just you know did a thing so i'd say you have a pretty direct entitlement of the uh this flow thing uh from this model",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4675.836,
    "end": 4676.036,
    "text": " Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4676.376,
    "end": 4676.537,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4676.897,
    "end": 4677.718,
    "text": "This is my question.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4677.738,
    "end": 4677.978,
    "text": "Sorry.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4679.919,
    "end": 4680.5,
    "text": "I think so.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4680.52,
    "end": 4687.926,
    "text": "We've run almost 30 minutes over time and I know Mark's had to go and I'm going to have to go very, I think I pretty much have to go.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4688.006,
    "end": 4695.152,
    "text": "So I just wondered if anybody has any final kind of quick questions or comments, maybe we can move towards wrapping it up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4698.775,
    "end": 4702.838,
    "text": "I'll make a few comments, but Ben, you're welcome to leave other",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4707.179,
    "end": 4711.069,
    "text": " So, thank you for... Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4712.372,
    "end": 4713.635,
    "text": "Well, first, just on a...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4715.433,
    "end": 4736.032,
    "text": " Logistical note, there was a little bit of lag, so I'll encourage everyone who's listening as well as who's participating that we eventually plan to, as with all of our live streams, develop a transcript, which will be curated and published, and eventually, not so far away in the future, that'll be enabled with speech modeling to generate podcast quality audio.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4740.644,
    "end": 4747.61,
    "text": " But a few really interesting pieces that I picked out while I was embodying and listening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4749.732,
    "end": 4757.899,
    "text": "So Regina, you opened the discussion with surprise and creativity and indeed it sounds like it's going to be a tension.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4757.939,
    "end": 4760.822,
    "text": "How can a framework whose imperative is bounded",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4764.687,
    "end": 4770.711,
    "text": " in a framework whose imperative is surprise, minimization, and bounding be used to generate novelty?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4770.771,
    "end": 4773.893,
    "text": "And I felt like people provided a lot of really cool answers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4774.593,
    "end": 4778.136,
    "text": "And one other thing it reminds me of is Doug Hofstadter's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4785.049,
    "end": 4809.484,
    "text": " s h n e s s and it's the specs wasp and so he says well forget this whole creativity thing because when we talk about creativity it's like some sort of you know pantheon like divine status the muses have to be uh you know called in and so then oh that's not real creativity and this isn't real creativity so instead he says well let's just focus on what would be the opposite and that would be the rote",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4812.932,
    "end": 4815.334,
    "text": " There's an opportunity for what we would call creativity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4816.014,
    "end": 4816.995,
    "text": "And then there's a continuum.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4817.015,
    "end": 4818.816,
    "text": "So why does somebody paint that painting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4819.476,
    "end": 4821.097,
    "text": "Why didn't they invent a new genre?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4821.638,
    "end": 4823.499,
    "text": "Why didn't they invent a new media?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4824.039,
    "end": 4830.784,
    "text": "And so all activity is existing within this continuum of creativeness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4832.958,
    "end": 4839.266,
    "text": " generativity and productivity, but also novelty, but abounded novelty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4839.326,
    "end": 4846.655,
    "text": "It's not creative to knock the chessboard pieces off in a way that there might be an elegant chess move who only",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4852.099,
    "end": 4852.999,
    "text": " I think that was awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4853.82,
    "end": 4862.063,
    "text": "And then the second piece that really was powerful was Mark's train.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4863.103,
    "end": 4869.906,
    "text": "I guess the trains don't run on time where Mark is, but that's okay, because he was able to, rather than treat that,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4875.34,
    "end": 4893.812,
    "text": " metabolized into like an opportunity for friendship through language as a social medium and then he connected that to cognitive flexibility and coaching and I thought about self-talk and our inner monologue inner voice",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4900.543,
    "end": 4925.754,
    "text": " talk potentially not even having a self in the flow manifold experience of the self or the speech self self-talk or again potentially even the total actual self as a technology and so then like healthy self-talk would guide us to the flow and be kind of like a self-limiting technology",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4926.567,
    "end": 4951.899,
    "text": " because it would be like used in order to not be needed to be used, which is kind of how we would hope adaptive technologies would be versus a maladaptive technology would be something that, um, entrenches its own utilization potentially at the expense of the functionality, kind of like doom scrolling status, but that's internal rumination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4951.959,
    "end": 4954.92,
    "text": "And those are the kinds of things that people have simulated in active inference",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4955.933,
    "end": 4958.395,
    "text": " So those were some really cool pieces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4958.475,
    "end": 4959.636,
    "text": "That was a great discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4961.278,
    "end": 4971.127,
    "text": "Could I just add something on the topic of creativity that I should have said earlier as well, because I think it's really relevant to Regina's question and just the topic of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4972.261,
    "end": 4987.73,
    "text": " creative and novel behaviours in general under active inference, I think that whenever we talk about, especially artistic creativity, there's a tendency, even for people who are very well-burrowed into active inference and",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4988.63,
    "end": 5000.635,
    "text": " and activism and these kinds of frameworks from cognitive science, I think there's a tendency to think of creativity as still like it's almost like the last bastion of internal cognitivist thinking.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5000.716,
    "end": 5004.797,
    "text": "Like you think creativity is something that happens in here and bursts outwards.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5004.877,
    "end": 5010.02,
    "text": "And so how does that happen with this kind of whatever cognitive architecture we're positing?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5010.68,
    "end": 5020.003,
    "text": " But there's really very cool work by, I have to give a shout out to Mike Wheeler, who has written some papers on the extended mind and creativity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5020.403,
    "end": 5031.866,
    "text": "And one thing that's not really come up very much that I didn't get time to talk about in the lecture is this really nice natural marriage between the extended mind and active inference, something that Andy Clark has been working on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5031.906,
    "end": 5034.927,
    "text": "And I know he's going to be doing a lot more work on it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5035.007,
    "end": 5037.988,
    "text": "But the claim Wheeler makes and some others",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5039.528,
    "end": 5055.276,
    "text": " I think Joanna Zielinska has written a little bit about this as well, is the fact that creativity itself is just as subject to kind of material, but the sculpting effects of material environments and socio-cultural environments as everything else is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5055.996,
    "end": 5069.222,
    "text": " So creativity is not this kind of romantic with a capital R kind of internal process that kind of bursts forth, but it's creative thinking is just as much extended and embedded as everything else.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5069.282,
    "end": 5073.684,
    "text": "And there's some really great examples in Mike Wheeler's essay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5073.704,
    "end": 5074.845,
    "text": "I don't know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5074.885,
    "end": 5076.906,
    "text": "Is anybody familiar with the band Alt-J?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5077.806,
    "end": 5079.087,
    "text": "They're a British band.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5079.107,
    "end": 5081.048,
    "text": "They were kind of really big a few years ago.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5081.208,
    "end": 5084.77,
    "text": "They won the Mercury Music Award because they have a super original sound.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5086.127,
    "end": 5089.13,
    "text": " So Alt-J have this really quiet tinkling.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5089.15,
    "end": 5090.851,
    "text": "Yeah, they are a great band.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5090.891,
    "end": 5091.852,
    "text": "They're one of my favorites.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5091.932,
    "end": 5100.88,
    "text": "And they have this really quiet tinky sound that everybody kind of assumed was just the result of some kind of internal genius on the part of the band.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5102.27,
    "end": 5131.279,
    "text": " as it turns out alt j originally they they tried to rehearse as a as an indie rock band but they were confined to rehearsing in an apartment block and they kept getting noise complaints and so they ended up developing this quiet tinkly sound because it was the only sounds they could rehearse that wouldn't get them kicked out of their apartment and i think this is a really beautiful example of how like even the most creative processors that seem on the face of it really creative are in fact",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5132.159,
    "end": 5155.388,
    "text": " just a subject these external kind of this kind of agent environment system that underpins the whole framework so it's that's something that's going to apply to absolutely everything awesome and just the last question people are welcome to to drop off um the next section that we're heading into I'll be doing the lecture that's going to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5157.83,
    "end": 5158.891,
    "text": " on collective behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5159.111,
    "end": 5166.897,
    "text": "So what would people like to learn or focus on about collective behavior?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5177.906,
    "end": 5182.33,
    "text": "Anyone who hasn't spoken or it can just be a thought question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5184.051,
    "end": 5186.273,
    "text": "But I haven't prepared the slides at all, so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5187.622,
    "end": 5189.023,
    "text": " I'm happy to take suggestions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5192.884,
    "end": 5194.084,
    "text": "Yeah, Darius, and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5195.225,
    "end": 5208.91,
    "text": "I think what might be interesting is if we're saying that these systems are all in the business of reducing prediction error of self-evidencing, why do we see a diversity of social cultures, of norms, of standards,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5215.666,
    "end": 5232.1,
    "text": " at a global scale, why do we not just see some homogenous way to reduce friction there, which would manifest as a kind of singular culture, which is in the kind of business of self-evidencing?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5232.721,
    "end": 5233.722,
    "text": "That just kind of popped in my mind.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5242.054,
    "end": 5245.898,
    "text": " Anyone else want to give a thought on collective behavior or on any other aspect?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5246.298,
    "end": 5247.219,
    "text": "Otherwise, it's been great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5248.561,
    "end": 5251.304,
    "text": "I'd like to make a comment of creativity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5253.706,
    "end": 5260.953,
    "text": "So, but does anyone, like, at the moment, if you want to make a comment on the next session, I'd want to get that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5263.196,
    "end": 5263.416,
    "text": "Okay.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5263.436,
    "end": 5263.816,
    "text": "Go for it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5265.719,
    "end": 5291.458,
    "text": " I'd say that, to complement what Ben said, that creativity is intrinsically very hard to model because, by definition, creativity is something that brings about something new, let us say, and the mathematics we have to describe physics and life, they are not very good at new things because the most basic tool you have",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5292.409,
    "end": 5313.624,
    "text": " the basic way to represent a system that literally everyone uses is a state space which is uh the least of all possibilities of the system if you say something is creative you're likely to think that it means it can bring about new possibilities and this intuition it conflicts directly",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5314.565,
    "end": 5317.489,
    "text": " with the very basic use of math to describe it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5318.15,
    "end": 5327.982,
    "text": "So it is basically the same issues I was referring to earlier when I talked about the comparison between active inference and an activist, so let's say,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5329.292,
    "end": 5357.045,
    "text": " activity biology inspired model of cognition and a core concept historically in those circles is autopoiesis so the ability of the living to self-create literally this is greek for self-creation and you had a lot of drift and conceptualization and ambiguities that were resolved or not resolved and led to the crisis of framework blah blah but today we talk of autonomy rather than autopoiesis",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5357.825,
    "end": 5367.087,
    "text": " And we define autonomy as the property for a system of constraints over the activity of a system to reproduce themselves.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5367.767,
    "end": 5379.79,
    "text": "And because we're talking constraints, just the ability to influence causality outcomes, there is no really a prior that dynamics in this space would be conservative.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5379.83,
    "end": 5384.771,
    "text": "So we have a possibility for constraints to bring about new things and reconfigure themselves.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5385.649,
    "end": 5388.73,
    "text": " And the notion of agency at use is based on that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5389.85,
    "end": 5393.211,
    "text": "It's the ability to, let's say, reconfigure constraints in your environments.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5394.352,
    "end": 5399.813,
    "text": "And so is the notion of creativity, which would be likely a very close proxy to that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5400.293,
    "end": 5403.914,
    "text": "But it's something that we do not know how to prevent.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5405.555,
    "end": 5409.876,
    "text": "And most of the mathematics that exist are structurally enabled to represent.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5410.816,
    "end": 5412.917,
    "text": "And so, yeah, that's a big one.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5417.645,
    "end": 5418.085,
    "text": " So true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5421.166,
    "end": 5421.447,
    "text": "Michael?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5426.869,
    "end": 5427.409,
    "text": "Good to be here.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5427.429,
    "end": 5429.37,
    "text": "Sorry I was late.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5429.99,
    "end": 5434.312,
    "text": "What comes to mind for me at the collective, you know, I mentioned units of collective life.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5434.472,
    "end": 5435.452,
    "text": "What is it a we?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5435.532,
    "end": 5436.492,
    "text": "Is it a we a pair?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5436.573,
    "end": 5437.653,
    "text": "And, you know, what",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5438.243,
    "end": 5442.445,
    "text": " you know, what are the units of we and any thoughts or insights about that?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5443.726,
    "end": 5458.653,
    "text": "The stages of the emergence of formation into a collective from a me to a we, for example, or I had one that was on the tip of my tongue and it just escaped me.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5459.173,
    "end": 5467.257,
    "text": "Oh, you know, this idea of precision that I think it was Mark Miller was talking about from Matt saying,",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5468.354,
    "end": 5495.395,
    "text": " If there's options in the looking at collectives and what might be some of the most well-understood limiting beliefs about when we use language of collective that keeps us repeating the same blind spots.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5497.811,
    "end": 5504.856,
    "text": " and how might we think differently about collectives so that we escape those predispositions, if you will.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5505.977,
    "end": 5506.398,
    "text": "Make sense?",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5509.9,
    "end": 5518.006,
    "text": "I'll do what I can do in the solo lecture, and I'll look forward to the conversation where we can unpack it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5518.987,
    "end": 5520.468,
    "text": "Yeah.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5520.488,
    "end": 5520.869,
    "text": "Exciting.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5520.909,
    "end": 5521.629,
    "text": "Thank you for doing it.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5521.689,
    "end": 5522.99,
    "text": "I'm looking forward to it.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5523.591,
    "end": 5524.291,
    "text": "Yeah, it's awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5524.611,
    "end": 5526.413,
    "text": "Nathan or David, you want to add anything?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5532.403,
    "end": 5534.064,
    "text": " All right, then thank you all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5534.264,
    "end": 5536.866,
    "text": "Hope everyone is enjoying the course so far.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5536.946,
    "end": 5542.149,
    "text": "Thanks, Aval, again for coordinating it and to Ben for this great section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5542.809,
    "end": 5544.911,
    "text": "Now you can put on your student hat again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5544.931,
    "end": 5547.412,
    "text": "And to you for organizing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5548.813,
    "end": 5549.153,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5549.534,
    "end": 5550.214,
    "text": "See you all next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5550.234,
    "end": 5550.774,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5550.874,
    "end": 5551.115,
    "text": "Bye.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5551.815,
    "end": 5552.716,
    "text": "Bye.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 5553.016,
    "end": 5554.857,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_11"
  }
]