[
  {
    "start": 6.967,
    "end": 29.852,
    "text": " hello and welcome everyone this is active inference math stream 9.1 on march 5th 2024 we're here with jonathan gorard and we'll be discussing a variety of topics yet to be determined or are they so thank you for joining and to you for any introduction and we'll really look forward to everyone's comments and questions so thanks again for joining to you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.52,
    "end": 36.107,
    "text": " Okay, well, yeah, thanks very much, Daniel, for the introduction and for inviting me to be here on Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.367,
    "end": 39.551,
    "text": "I'm looking forward to a very, very fun discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.453,
    "end": 50.727,
    "text": "So I don't have anything especially prepared to talk about, which is probably a good thing because it means we'll be able to extend the unstructured part of this for as long as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.108,
    "end": 54.793,
    "text": "But I think just to give a little bit of context, I want to talk about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.773,
    "end": 67.41,
    "text": " an area where I think some things that I've been working on, some collaborators that might have been working on that might have some kind of intersection of interest with things that, you know, active inference type people might care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.45,
    "end": 67.61,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.231,
    "end": 75.381,
    "text": "So and in particular, that concerns the relationship between kind of computation, observation and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.361,
    "end": 96.492,
    "text": " and specifically using methods that come from category theory and topos theory and some other kind of branches of mathematics and theoretical computer science to understand the relationship between uh system specifically the computational and algorithmic complexity of systems versus the computational algorithmic complexity of observers of those systems and how those things trade off between each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.623,
    "end": 104.933,
    "text": " So just to give a little bit of context to that, I want to show these are just some visuals from a paper that I put out about a year ago now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.433,
    "end": 115.545,
    "text": "And this kind of really defines this research program that I've been working on for the last year and a half in some form or another, which is looking at exactly this tradeoff using category theoretic machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.945,
    "end": 118.368,
    "text": "So here's a specification of a Turing machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.408,
    "end": 120.431,
    "text": "This is just a simple deterministic computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.451,
    "end": 121.652,
    "text": "It's saying, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.632,
    "end": 134.97,
    "text": " you have a Turing machine that has this head state and this tape state, and on the next step, you're going to replace the tape state with something that looks like this, the head state with something that looks like that, and you're going to scroll the Turing machine head left, or in this case, scroll it right, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.99,
    "end": 138.114,
    "text": "So this is just a specification of a very simple computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.775,
    "end": 143.561,
    "text": "I think this is a two-state, two-color Turing machine on a simple one-dimensional tape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.581,
    "end": 145.804,
    "text": "It's about as simple a computation as you could define.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.545,
    "end": 151.251,
    "text": "So if you run that thing for some initial condition, you'll get an evolution that looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.619,
    "end": 155.705,
    "text": " And so right now, this is just a purely deterministic single path evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.586,
    "end": 160.251,
    "text": "But from this, we can construct and we can build a mathematical structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.271,
    "end": 161.933,
    "text": "Namely, we can build a category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.594,
    "end": 166.159,
    "text": "And the rules for how we build that category are very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.219,
    "end": 172.648,
    "text": "So each arrow here is some simple computation, some application of the Turing machine transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.628,
    "end": 180.242,
    "text": " And then what we can do is we can say, well, anytime we have two arrows that are laid end to end like this, we can compose them together to create a third arrow that goes like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.282,
    "end": 181.364,
    "text": "I may even have a picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.925,
    "end": 182.526,
    "text": "Yes, like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.606,
    "end": 194.046,
    "text": "So we have a computation f that takes us from x to y, a computation g that takes us from y to z, and then we obtain a composite computation g compose f that takes us directly from x to z.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.026,
    "end": 205.032,
    "text": " And we also add some additional edges, some additional arrows on each state itself, a sort of identity operation that maps a computational state directly to itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.467,
    "end": 213.041,
    "text": " And so this, combined with some axioms of associativity and identity, forms a category of elementary computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.542,
    "end": 214.964,
    "text": "So this is a very, very simple example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.044,
    "end": 226.986,
    "text": "But what I want to try and build up towards and kind of pump your intuition for is a category which I call comp, which is a category whose objects are essentially the class of all data structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.966,
    "end": 231.632,
    "text": " and whose arrows or morphisms are the class of all elementary computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.932,
    "end": 239.542,
    "text": "So you start by just applying all possible computations, in this case, for the case of Turing machines, all possible Turing machine transition functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.042,
    "end": 249.914,
    "text": "And then you do this closure operation where you essentially do what I'm doing here, but you allow those elementary computations to be composed together in arbitrary ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.295,
    "end": 253.699,
    "text": "And so that gives you effectively a class of all possible programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.932,
    "end": 260.042,
    "text": " So this category contains not only all possible data structures as objects, but all possible programs as morphisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.102,
    "end": 267.835,
    "text": "And this is a very rich category with some very interesting algebraic structure that we'll kind of again, I'm sure we'll allude to in our subsequent discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.057,
    "end": 270.439,
    "text": "But.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.723,
    "end": 288.58,
    "text": " In a sense, when we do this operation of taking what mathematically we call a transitive closure, where we allow two elementary computations to be composed together to produce a third, we are essentially kind of neglecting considerations of computational complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.56,
    "end": 293.026,
    "text": " This arrow here might correspond to one application of the Turing machine transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.266,
    "end": 296.029,
    "text": "This arrow might correspond to another application of the transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.41,
    "end": 300.855,
    "text": "But this composite arrow might correspond to two applications of the transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.516,
    "end": 309.606,
    "text": "And so somehow when we allow arrows or morphisms to be composed in this way, we're neglecting considerations of the complexity of operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.345,
    "end": 317.697,
    "text": " So the question then is, could we imagine constructing a generalization of category theory which takes into account computational complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.038,
    "end": 320.201,
    "text": "So here's an example of how that would look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.241,
    "end": 325.55,
    "text": "So here you can see every edge, every morphism has been tagged with certain computational complexity information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.57,
    "end": 331.68,
    "text": "In particular, it's been tagged with a number specifying what is the minimum number of applications of my transition function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.7,
    "end": 337.129,
    "text": "What's the minimum number of elementary computations that I need in order to evolve from this data structure to this data structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.109,
    "end": 358.29,
    "text": " so here to go from here to here it's just one to go from here to here it's one to go to it from here to here it's one etc uh but to go to hit from here to here directly it would be three uh to go from here to here directly it would be two um and you know just for convention we say that the identity uh the the identity computation the trivial computation always has complexity zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.388,
    "end": 377.988,
    "text": " So this is, again, a fairly simple mathematical structure, and you can construct this, again, using purely category theoretic technology by building a particular functor from the category of data structures and computations to what's called a discrete cobordism category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.008,
    "end": 384.095,
    "text": "And again, we might discuss that later on if people are interested, but let me not get too bogged down into the technical details of how we do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.515,
    "end": 386.337,
    "text": "But once you've got this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.317,
    "end": 391.652,
    "text": " it gives us immediately a very nice way of characterizing phenomena like computational irreducibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.852,
    "end": 401.827,
    "text": " So there is this idea that has existed in some form or another since the very early days of theoretical computer science, since the days of, you know, Gödel and Turing and Post and Church and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.367,
    "end": 417.91,
    "text": "But was given this term computational irreducibility by Stephen Wolfram, where the idea is essentially that you just, you know, intuitively you describe a computation as being irreducible or the result of the computation as being irreducibly complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.89,
    "end": 421.301,
    "text": " if it's not possible to shortcut it in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.602,
    "end": 429.486,
    "text": "So where that computation takes a certain number of steps, and there does not exist a shorter computation that would give you the same answer in less time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.702,
    "end": 437.571,
    "text": " And one of the nice features of thinking about computations and their complexity algebraically like this is that it gives you a purely algebraic characterization of irreducibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.751,
    "end": 447.382,
    "text": "In particular, what it says is that irreducible computations are ones for which the computational complexity acts purely additively under composition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.882,
    "end": 456.452,
    "text": "So if it's the case that if we compose, say, two computations of complexity one together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.432,
    "end": 479.503,
    "text": " uh if the if the resulting composite takes you know has complexity two then it's an irreducible computation if it has complexity less than two like one then that means that we could have we could have jumped directly from the input to the output without having to pass through the two elementary computations that made it up so that would be an example of a reducible computation so reducible computations are ones whose complexities compose sub-additively in this category theoretic sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.614,
    "end": 492.157,
    "text": " Okay, so here's an illustration of showing what intermediate computational states you had to go through in order to get from one data structure to another data structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.197,
    "end": 495.003,
    "text": "So to go from here to here, you had to go through steps one to two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.123,
    "end": 501.255,
    "text": "To go from here to here, you had to go through steps one, two, three, and four, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.235,
    "end": 510.818,
    "text": " So you can build up a kind of complete algebra of complexity this way, which has some nice properties, which again I can talk about, but let me not get too bogged down in mathematical details right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.781,
    "end": 519.7,
    "text": "But here's the thing I really want to talk about, which is what happens when you go to multi-way systems, what happens when you go to non-deterministic computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.068,
    "end": 528.727,
    "text": " So now imagine having, instead of just a Turing machine with a single rule, a single transition function that just evolves deterministically with a single thread of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.088,
    "end": 532.716,
    "text": "Now imagine having a Turing machine that has say two transition functions, like this one and this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.137,
    "end": 535.883,
    "text": "And so at any given point, it can apply one of the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.863,
    "end": 544.002,
    "text": " And so now evolution, instead of just being a single path, becomes this kind of branching structure, which if we didn't have any merging would be a tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.583,
    "end": 549.776,
    "text": "But because we are merging equivalent states, it's actually just a kind of more general directed graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.796,
    "end": 554.226,
    "text": "And so it looks like this and this we call a multiway system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.493,
    "end": 557.86,
    "text": " And so we can build a category out of these multi-way systems as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.041,
    "end": 561.168,
    "text": "We can build a category using exactly the same rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.509,
    "end": 563.653,
    "text": "So again, we do this transitive closure operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.934,
    "end": 572.974,
    "text": "So we add an edge for every possible composition of these elementary computations and an identity edge that maps every data structure to itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.954,
    "end": 591.407,
    "text": " But it turns out this category has even more structure than the single way system that we showed previously, because now it's possible to compose computations not just sequentially in time using ordinary composition, but it's possible to compose them in parallel across what is sometimes referred to as branchial space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.568,
    "end": 595.114,
    "text": "So essentially you're saying instead of, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.094,
    "end": 604.552,
    "text": " The ordinary morphism composition that I showed previously is essentially saying I apply this elementary computation, then this elementary computation sequentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.394,
    "end": 612.107,
    "text": "Whereas this parallel composition is saying I apply this computation and this computation in parallel to the same data structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.087,
    "end": 615.595,
    "text": " And so that parallel operation is what causes these branches, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.655,
    "end": 630.788,
    "text": "Effectively, when you have two threads of time that are branching from the same state, like here, that's arising because we have chosen to apply this elementary computation and this elementary computation together in parallel rather than sequentialized in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.662,
    "end": 644.818,
    "text": " And so here you can see this parallelization indicated using what's referred to as a branchial decomposition, which is just a kind of a visual way of decomposing what's going on between these different threads of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.859,
    "end": 656.472,
    "text": "And again, there's a purely algebraic characterization of what's going on here, which is that what we've done is we've taken our simple category that we started with and we've equipped it with a tensor product structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.452,
    "end": 670.613,
    "text": " and so it's become what we fancy call a monoidal category or actually a symmetric monoidal category so the tensor so we now have these two operations we have sequential sequential composition in time and we have this tensor product operation which is a parallel composition in branchial space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.842,
    "end": 692.042,
    "text": " And just like before, where we equipped our edges, our morphisms, with certain computational complexity information, we can do the same thing, and we described how those complexities composed sequentially in time, we can do the same thing and describe how the complexities compose in parallel as one composes morphisms in branchial space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.603,
    "end": 700.11,
    "text": "And so this allows one, by exactly the same token, to quantify multi-computational irreducibility rather than just computational irreducibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.09,
    "end": 712.463,
    "text": " So now multi-computational irreducibility becomes a measure of how additive or sub-additive your time complexities are when you compose them in parallel through the tensor products rather than just in sequence through standard morphism composition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.337,
    "end": 738.349,
    "text": " um okay but i promise i i am cut and so here's an analogous diagram to the one i showed before showing all the kind of intermediate steps uh that that are being uh uh that that are being applied when one composes uh computation when one constructs computations or indeed multi-computations by composing elementary computations both sequentially in time and in parallel in in branchial space now but i promise i i am the the point that i'm trying to get to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.329,
    "end": 756.27,
    "text": " is that it turns out that in addition to just being a useful way to think about computational complexity theory and to formulate complexity classes like polynomial time or non-deterministic polynomial time, et cetera, it turns out this is also an interesting way to think about the role of observation in computational models of reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.605,
    "end": 765.215,
    "text": " Because so, and here's where I'm going to get a little bit philosophical and I don't immediately have a slide or a graphic that I can show to illustrate this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.275,
    "end": 773.043,
    "text": "But so when we think about modeling a system computationally, one has to bear in mind that there are really two computations going on, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.404,
    "end": 775.746,
    "text": "There's the computation that the system is itself performing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.447,
    "end": 784.536,
    "text": "And then there's the computation that the observer, the person who is measuring that system and concluding things from it, there's the computation that they are performing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.516,
    "end": 790.527,
    "text": " and somehow you know so when we construct models of reality or when we construct models of systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.895,
    "end": 791.416,
    "text": " Simon Borgson, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.396,
    "end": 795.4,
    "text": ": You know, and we want to describe kind of at a metal level what we're doing in computational terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.54,
    "end": 795.961,
    "text": "Simon Borgson, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.941,
    "end": 804.27,
    "text": ": there's our own computation that you know that's going on inside our own internal representation of the world and then there's presumably some external computation that's going on outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.43,
    "end": 804.91,
    "text": "Simon Borgson, Ph.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.89,
    "end": 814.641,
    "text": ": And then, when we make observations and when we make measurements when we construct theoretical models and what we're doing is we're somehow constructing some kind of encoding function that allows us to take a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.621,
    "end": 822.285,
    "text": " a concrete physical state of the system we're observing and encode it as some abstract state of the internal model that we have of what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.721,
    "end": 829.889,
    "text": " And that's all very well, but then now we don't just have one computation to care about, we have three, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.949,
    "end": 842.985,
    "text": "We've got the computation of the system, computation of the observer, and the computation, this encoding function computation that's responsible for the interface between their internal model of the world and the external reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.505,
    "end": 848.391,
    "text": "And the computational complexities of these computations interplay in an extremely interesting way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.371,
    "end": 864.0,
    "text": " And so part of the reason for trying to develop this algebraic semantics for thinking about computational complexity and multi-computational complexity was to try to give one a systematic way to reason about exactly this three-way interplay between systems, observers, and encoding functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.605,
    "end": 878.06,
    "text": " And so in particular, when an observer makes a model of the world, one thing that they're doing is that they are, you know, for any model that isn't just, you know, a complete description of reality, there's a certain amount of coarse graining, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.08,
    "end": 887.71,
    "text": "There's a certain amount of taking a bunch of states that in the system itself are distinguished, but in the internal model are treated as the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.69,
    "end": 889.753,
    "text": " they're cast in the same bucket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.274,
    "end": 895.763,
    "text": "So in some sense, how coarse a model is, is a measure of how much the encoding function fails to be subjective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.685,
    "end": 911.689,
    "text": "And so again, there's a kind of algebraic or category-theoretic characterization of what's going on, that the fewer of your morphisms are epimorphisms, the more coarse your model is, the more abstract or idealized your model of reality is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.648,
    "end": 938.996,
    "text": " And so then the interesting thing is that this characterization of multi-computational irreducibility, this measure of how additive or sub-additive your complexities are as you compose them together in parallel, gives you a measure of the relative complexity of the evolution function, that is the function that evolves your computation forwards in time, versus the equivalence function, that is the function that declares that two computational states, two data structures, are to be treated as equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.256,
    "end": 940.798,
    "text": "And that interplay,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.778,
    "end": 948.27,
    "text": " I claim, is a kind of abstract meta way of thinking about the interplay between the computation of systems versus the computation of observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.33,
    "end": 961.572,
    "text": "Because it says the role of the system is to evolve forwards in time, whereas the role of the observer is to take states in the system that are distinguished in reality and say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.552,
    "end": 964.557,
    "text": " subject to my idealized model, I'm going to treat these as the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.617,
    "end": 970.046,
    "text": "So the system is defining the evolution function, but the observer is defining this equivalence function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.627,
    "end": 987.694,
    "text": "And so then the trade-off in their complexities becomes exactly a trade-off between what are the algebraic rules that describe the complexities as they compose sequentially versus the algebraic rules that describe the complexities as they compose under this tensor product operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.674,
    "end": 1013.057,
    "text": " um and so yeah i've shown this uh in particular for for turing machine systems but this is a very this is a very general kind of algebraic semantics you can apply it to hypergraphs you can apply it to combinators lambda calculus doesn't matter uh in a sense uh there is just one category up to isomorphism of computation of data structures and computations and there are simply many different ways of parameterizing what that category is doing through things like turing machines or hypergraphs or whatever some you know the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.037,
    "end": 1017.81,
    "text": " The algebraic formalism transcends the particular details of the computations that one's dealing with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.411,
    "end": 1027.114,
    "text": "And so, yeah, as I say, what one ends up with is, I think, a fairly general formalism for thinking about the interplay between observers and the systems that they observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.55,
    "end": 1035.568,
    "text": " And that gives one a, I promise I'll stop monologuing in a moment and we'll try and pick apart what I'm really talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.888,
    "end": 1044.968,
    "text": "But so I'll just conclude with, you know, once one has that algebraic semantics, a whole bunch of things which I think previously would have been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.948,
    "end": 1053.577,
    "text": " at least to me, previously seemed like kind of fundamental confusions about, you know, how scientific observation works and how it interplays with computational models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.817,
    "end": 1058.782,
    "text": "Those confusions kind of become much easier to clarify once you think about it in this kind of more compositional way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.862,
    "end": 1069.673,
    "text": "So to give a very simple example or a kind of very degenerate example, you can, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.547,
    "end": 1078.27,
    "text": " Within this algebraic semantics, you can effectively trade off the computational complexity of the system for the computational complexity of the observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.772,
    "end": 1084.81,
    "text": "So you can have, in effect, two degenerate cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.043,
    "end": 1089.671,
    "text": " You could have the case where the system itself has a completely trivial evolution function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.811,
    "end": 1095.44,
    "text": "The system itself is doing something completely elementary in how it evolves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.801,
    "end": 1104.756,
    "text": "But then the observer has some incredibly complicated equivalence function that makes the system look like it's doing something really complicated, even though what it's actually doing is something very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.736,
    "end": 1131.537,
    "text": " um and so then you have the phenomenon where actually kind of all of the complexity is in the eye of the is in the eye of the observer you can also have the other degenerate case where the observer is doing something absolutely trivial where the you know the encoding function or the the observer's own internal representation is just an identity function or something so there's no complexity there but the system is doing something incredibly complex it's doing some some totally some really sophisticated universal computation and so that will also appear very complex to that observer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.517,
    "end": 1139.735,
    "text": " And so and you can also have any kind of any intermediate, you know, there's this vast interstitial space between these two extremes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.797,
    "end": 1150.639,
    "text": "And so one thing that's kind of always one sort of philosophical problem that I've always kind of been interested in ever since I was a kid, which is this this sort of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.581,
    "end": 1155.386,
    "text": " this tension between empiricism versus rationalism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.486,
    "end": 1178.698,
    "text": "You know, the question of, you know, if you look back at the history of, you know, early European philosophy or, you know, certainly Western, you know, Western post-enlightenment philosophy, you had people like, you know, Descartes and Leibniz and so on who were, you know, and in a more sophisticated way, Bishop Berkeley with subjective immaterialism, who were trying to push for this idea that, oh, you know, all the sophistication is what's going on inside the observer's head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.119,
    "end": 1181.402,
    "text": "And, you know, what goes on in reality is somehow secondary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.382,
    "end": 1187.616,
    "text": " And then you had people like Locke and Hume and the empiricists who were saying, no, no, we should try and get the observer as much out of the picture as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.816,
    "end": 1190.883,
    "text": "And we should say all the sophistication is going on kind of in the external world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.184,
    "end": 1199.121,
    "text": "And one nice consequence of this formalism is it gives one actually an algebraic way of kind of parameterizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.101,
    "end": 1202.566,
    "text": " this spectrum from rationalism to empiricism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.786,
    "end": 1217.768,
    "text": "That you can choose the rationalist extreme where you just have some space of all possible computations and the observer is doing all of the work to try to narrow down to a particular one, or you can have the kind of empiricist extreme",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.748,
    "end": 1229.387,
    "text": " where the observer is a completely elementary system and everything they observe is just being built up from a kind of bottom-up construction, or you can have anything in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.427,
    "end": 1238.622,
    "text": "And in a sense, we now have, I think, the beginnings of a mathematical theory that's able to explain how those complexities trade off in a very direct way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.243,
    "end": 1241.106,
    "text": "So I think there's potentially",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.086,
    "end": 1249.995,
    "text": " places of mutual interest there in thinking about, as I say, cognition, observation, measurement, scientific modeling and so on in fundamentally computational terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.255,
    "end": 1254.74,
    "text": "So I think that hopefully that will provide some context for a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.864,
    "end": 1259.265,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.466,
    "end": 1261.567,
    "text": "Great opening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.927,
    "end": 1266.452,
    "text": "There's so many places to spin in and jump through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.276,
    "end": 1295.848,
    "text": " guess i'll start with the two things i wrote down were unity is plural and at minimum two and beauty is in the eye of the beholder and the way that these kinds of pieces of timeless wisdom that describe that fundamentally relational component to observers in systems which are not all kinds of systems per se but those kinds of systems those things are true for and then the way in which along the formalism that you described with the system observer encoding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.132,
    "end": 1320.267,
    "text": " three-way partition and then the way that in free energy principle and the particular physics that interface gets broken out from the agent's perspective into the incoming sensory and the outgoing action so that that results in the fourfold particular partition so maybe just to kind of dwell there how do we partition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.871,
    "end": 1327.824,
    "text": " the from a category theory perspective, or however, the action perception loop or the engagement loop?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.844,
    "end": 1340.989,
    "text": "Like, how do we make a topology or compare and contrast different topologies and flows over this kind of seemingly pervasive or universal interface like concept?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1343.095,
    "end": 1344.096,
    "text": " That's a fascinating question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.357,
    "end": 1345.338,
    "text": "So I don't have the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.358,
    "end": 1357.416,
    "text": "And this is maybe a place where both you, Daniel, and perhaps David may have useful perspectives on this, because I read Carl's work a few years back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.456,
    "end": 1364.707,
    "text": "And so I have some familiarity with the terms, but I'm by no means an expert on free energy principle or active inference and those kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.648,
    "end": 1367.11,
    "text": "But I think it's a very good point that you raise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.331,
    "end": 1371.617,
    "text": "And so I should begin by just being honest and say that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.597,
    "end": 1376.428,
    "text": " All that I just described is, of course, an idealization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.468,
    "end": 1381.519,
    "text": "In particular, it's an idealization which I think you were very right, Daniel, to pick up on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.18,
    "end": 1391.26,
    "text": "It's an idealization in which we say the observer is completely non-interacting with the world somehow, in a sense that there's just input coming in and nothing coming out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.24,
    "end": 1409.147,
    "text": " uh but of course we know that's not really how observation works observation is necessarily a kind of two-way process and so what's needed is not just this kind of very clean algebraic semantics that i've described here which assumes that there's a potentially a one-way function from the world to the observer but actually something more like a kind of second order cybernetics description",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.127,
    "end": 1428.132,
    "text": " of what's really going on, where you have first-order and second-order interactions, where, exactly as you say, you can get these feedback loops from observation to action and back again, which is still an idealization, but probably a more realistic idealization for how real observers and real measurement apparatus work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.112,
    "end": 1451.385,
    "text": " um i just want to begin by saying that i don't know right and you know the question of how this formalism interplays with things like second order cybernetics and other areas where i know these kinds of questions have been explored that's something i i i'm very interested to find out about uh you know going going forward um but i think hmm okay so yeah so at some point maybe you could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.467,
    "end": 1459.895,
    "text": " help me understand potentially where things might fit in with the kind of broader active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.798,
    "end": 1466.762,
    "text": "I'm not sure I necessarily have that much more to comment on than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.105,
    "end": 1477.272,
    "text": "Yeah, other than to say that in a sense... Okay, so maybe one further comment is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.732,
    "end": 1484.838,
    "text": " Because you asked specifically about how the kind of compositional category theoretic perspective might be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.919,
    "end": 1488.882,
    "text": "So I don't think category theory in itself is going to be the complete answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.902,
    "end": 1496.25,
    "text": "I think it will be category theory augmented with some other things, computational complexity, probably second order cybernetics, and some other things that I may not be aware of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.011,
    "end": 1503.158,
    "text": "But one place where I think that viewpoint is useful, at least on a philosophical level, is the idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.138,
    "end": 1518.835,
    "text": " is the idea that comes about, that you really obtain by studying mathematical structures in a categorical way, which is that the identity of something, you can define it both in terms of its intrinsic properties, or you can define it in terms of the stuff that you can do to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.395,
    "end": 1526.563,
    "text": "So this was really the transition that happened in the foundations of mathematics as a result of people like Samuel Eilenberg and Saunders MacLean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.678,
    "end": 1532.043,
    "text": " So, you know, category theory has its origins in this sort of slightly abstruse branch of algebraic topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.584,
    "end": 1541.953,
    "text": "It was initially developed by people like Alexander Grotendieck and Jean-Pierre Serre for doing homological algebra for, you know, for reasoning about sort of the algebraic structure of topological spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.233,
    "end": 1551.943,
    "text": "But then later in the, I think, 1960s, 1970s, these two American mathematicians, Eilenberg and McLean, realized that it was useful not just for thinking about topology, but for thinking about kind of mathematical structure in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.223,
    "end": 1553.344,
    "text": "And then later on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.324,
    "end": 1557.41,
    "text": " applied to category theorists started saying, well, maybe it's useful for just thinking about structure in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.092,
    "end": 1573.476,
    "text": "But, you know, the key kind of conceptual or philosophical shift that it imposes is, you know, historically, thanks to the work of people like Cantor and Frege and Russell and so on, people have thought about mathematical structures in the foundations of mathematics in terms of set theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.456,
    "end": 1588.022,
    "text": " and the idea in set theory is you have this you know things like the axiom of extension that effectively say set is defined by what's inside it right so in other words you know you you a mathematical structure obtains its identity by you know you break it apart and you look at what's inside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.778,
    "end": 1591.403,
    "text": " In category theory, it's a completely different view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.443,
    "end": 1595.39,
    "text": "The view instead is you say, well, no, you can't look inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.45,
    "end": 1598.656,
    "text": "It's a fundamental rule of category theory that you can't look inside an object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.297,
    "end": 1603.304,
    "text": "Its internal structure, if it has any, is sort of out of bounds to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.845,
    "end": 1607.732,
    "text": "And instead, you give that object identity in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.712,
    "end": 1609.775,
    "text": " how it relates to other objects of the same type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.035,
    "end": 1613.299,
    "text": "So in other words, you can ask, what can I do to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.439,
    "end": 1614.921,
    "text": "What functions can I apply to it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.981,
    "end": 1618.405,
    "text": "What functions can I apply to something else that map into this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.986,
    "end": 1632.403,
    "text": "So if I want to define the real numbers or the integers or something, from a set theory perspective, you would say that the essence of the real numbers are all the numbers that are inside that set, all the numbers that are inside R.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.451,
    "end": 1645.311,
    "text": " Whereas the category theory perspective is, no, the essence of the real numbers are all the functions that you can define that take real numbers to some other number system, or real numbers to themselves, or that take some other number system into the real numbers, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.952,
    "end": 1651.641,
    "text": "And some of the deepest results in category theory, like the Oneida Lemma and other things, are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.621,
    "end": 1657.052,
    "text": " telling one in some very precise sense that these two perspectives are really the same at some fundamental level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.132,
    "end": 1672.363,
    "text": "That identifying an object based on its internal structure, based on breaking it apart and asking what's inside, and identifying an object by asking what can I do to it, and what can this object be transformed into, and what things can be transformed into this object,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.343,
    "end": 1693.643,
    "text": " those give you exactly the same information it's far from obvious that that's true you know the united lemma is a very kind of uh it's one of those results where you can never quite work out if it's obvious or if it's incredibly you know mysterious uh but i would i tend to fall on the side that it's incredibly mysterious it's far from evident that that those two perspectives would really be the same and yet the point you're making daniel i think is that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.635,
    "end": 1706.213,
    "text": " is that in a sense, historical ways of thinking about scientific observation have tended towards the set theoretic viewpoint, tended towards the viewpoint that we understand systems based on kind of breaking them apart into constituent components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.375,
    "end": 1716.61,
    "text": "But perhaps a more realistic view is something more like the category theory perspective, where we say, I understand the system by interacting with it, by asking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.59,
    "end": 1721.096,
    "text": " What can I do to it and how does it behave when I perform certain operations to it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.196,
    "end": 1727.924,
    "text": "And that's a fundamentally two-way process that involves not just passive observation, but also kind of active participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.365,
    "end": 1731.769,
    "text": "And somehow we need to develop a formalism that kind of incorporates those two elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.789,
    "end": 1737.857,
    "text": "And maybe it already exists and it exists in this large literature tree of which I'm largely unaware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.897,
    "end": 1742.142,
    "text": "That's partly why I wanted to be here, to try and find out what things I missed, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.607,
    "end": 1745.539,
    "text": " All right, a few points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.263,
    "end": 1748.537,
    "text": "Self-evident is far from evident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.956,
    "end": 1761.093,
    "text": " Also, I tend to the mysterious, which is to say, saying more with less, especially for these frameworks, because they're less opinionated so that their space of internal semantics can be larger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.054,
    "end": 1768.282,
    "text": "And then that description that you provided with the relationship between the set and the category theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.323,
    "end": 1775.993,
    "text": "So I kind of summarized it as set is to essential inclusion as category is to relational function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.973,
    "end": 1785.274,
    "text": " now if our concept of organismality or of action in the niche is constructive compositional material",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.828,
    "end": 1813.54,
    "text": " then we are looking for like what is in or out is the microbiome in is the pheromone in the ant colony in or out of that thing because it's looking for like a static material answer and then in contrast the other side of that coin highlights the the dynamic like whatever it is that's self-organizing of the tornado is the tornado whatever it is that's self-organizing for the ant is the ant",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.52,
    "end": 1838.683,
    "text": " um and then also this like hint slash Mobius strip or something that those two in the moment are indistinguishable and yet systems that we choose to Define one way or another or keeping both open those design decisions do make all the difference even if for real systems as they're observed there's indistinguishability",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.874,
    "end": 1841.816,
    "text": " Right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.076,
    "end": 1857.364,
    "text": "I think that's a very important point and one which, I mean, it's always a kind of concern I have whenever I start thinking about embodied cognition or extended phenotype type ideas, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.968,
    "end": 1871.687,
    "text": " In a sense, you know, if what one is trying to do here is construct a kind of formalistic model of observation or of cognition or something, then as a kind of first order approximation, one has to start by somehow decomposing the world into observers and systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.108,
    "end": 1876.133,
    "text": "But of course, you know, we know that that decomposition is somehow arbitrarily imposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.173,
    "end": 1876.414,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.434,
    "end": 1878.036,
    "text": "And that, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.062,
    "end": 1891.522,
    "text": " If you take these things to their extremes and you allow essentially everything that the agent is interacting with to be considered, not just the microbiome, as you say, but also tools that they construct or environments in which they exist and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.223,
    "end": 1903.18,
    "text": "As you start to consider all of that to be a component of that organism, of that agent's phenotype, which is a completely reasonable thing to do, and you start to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.16,
    "end": 1921.253,
    "text": " you start to say okay well their cognitive processes are not just localized to their brain or their spinal column but are kind of somehow extended to you know the computers they use the paper they write on uh the books they read etc again perfectly reasonable thing to do and sort of somehow more uh more descriptive of what's really going on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.233,
    "end": 1932.679,
    "text": " But my fear is always, if you take that too far, then you end up destroying the whole assumption that the idealization was based on, which is that you can neatly decompose the world into observers and systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.08,
    "end": 1937.47,
    "text": "And so I always get a bit nervous when thinking about that, that it's like, yes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.243,
    "end": 1952.267,
    "text": " In a sense, we know this is an approximation and we know that that approximation is not really true, but how much can you afford to loosen your grip on that approximation before the whole thing just kind of falls apart?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.367,
    "end": 1955.813,
    "text": "I don't really know the answer to that question, but I think it's an interesting one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.793,
    "end": 1967.688,
    "text": " Yeah, how about I'll ask some questions from chat and then give your first thoughts and then we'll see maybe where that kind of lands with further questions or how it connects to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.108,
    "end": 1968.489,
    "text": "That sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.529,
    "end": 1973.495,
    "text": "Oh, by the way, should I keep my screenshot on or should I... Yeah, we might want to go to a figure, so it's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.875,
    "end": 1974.436,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.456,
    "end": 1974.856,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.876,
    "end": 1975.137,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.458,
    "end": 1981.885,
    "text": "Quantum Bell wrote, how does this help us reason about causality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.518,
    "end": 1984.602,
    "text": " That's a fascinating question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.947,
    "end": 1993.174,
    "text": "That's another major aspect of why I think this research program is exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.065,
    "end": 2001.434,
    "text": " And again, this is something where I'm interested to get the kind of active inference perspective, because I know this, again, it's a topic in which much has been written, and I'm largely ignorant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.117,
    "end": 2018.436,
    "text": "But yes, so one question you could ask is, if you have a description of a computation like this, like, let's go back up to the Turing machine case, the single-way Turing machine case that's relatively easy to analyze, although still far from obvious what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.534,
    "end": 2022.863,
    "text": " So suppose you have a computation of this kind, and you want to ask, what is its causal structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.903,
    "end": 2035.969,
    "text": "In other words, for each edge, each time I'm applying this Turing machine transition function, can I construct some kind of graph, some directed graph representation that tells me how these events are linked together?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.949,
    "end": 2043.48,
    "text": " Within the original research program, the so-called Wolfram Model research program that started a lot of these investigations, we were looking at this all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.5,
    "end": 2054.016,
    "text": "We were looking at taking computations and looking at that causal structure and trying to infer things about what was going on, about the semantics of the computation based on causal relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.517,
    "end": 2061.467,
    "text": "And at a certain point, I started to realize, and I think other people had realized this before I did, but I'm often slow to pick these things up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.447,
    "end": 2065.942,
    "text": " I and other people started to realize that the notion of causality we were using was kind of nonsense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.343,
    "end": 2074.309,
    "text": "I mean, it was not completely hopeless, but it wasn't really causality, or it couldn't really be called causality in any definite sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.846,
    "end": 2076.549,
    "text": " So what do I mean by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.609,
    "end": 2078.952,
    "text": "So first of all, it was a very technical problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.333,
    "end": 2100.145,
    "text": "So if you're looking at something like a Turing machine evolution or a hypergraphy writing system as we were, then there's a very tempting and apparently obvious natural definition of causality that you could use, which is to ask, when you split the world up into events that take some part of your data structure as input and output some other part of a data structure as output,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.125,
    "end": 2106.425,
    "text": " then you can very easily ask, does the output of one event intersect with the input of another event?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.689,
    "end": 2110.759,
    "text": "If I show the hypergraph example, it's perhaps easier to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.942,
    "end": 2114.367,
    "text": " So you have a hypergraphy writing rule that looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.387,
    "end": 2119.354,
    "text": "So you say, if I have a piece of hypergraph that looks like that, I replace it with another piece of hypergraph that looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.955,
    "end": 2127.886,
    "text": "So each time you apply an event, you can think of that event as ingesting certain hyperedges and replacing them with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.547,
    "end": 2134.816,
    "text": "So you can divide it up into the input hyperedges that are being ingested versus the output hyperedges that are being produced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.237,
    "end": 2139.463,
    "text": "And so then you can ask, well, did I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.443,
    "end": 2145.656,
    "text": " Did I subsequently ingest in some future event hyperedges that were output in some previous event?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.117,
    "end": 2150.726,
    "text": "Well, if the answer is yes, then pretty obviously that future event couldn't have occurred unless the previous event had already occurred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.307,
    "end": 2154.634,
    "text": "So then you could say, well, then one of those events causes the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.614,
    "end": 2173.339,
    "text": " So in general, you could say that event A causes event B if it's the case that the collection of tokens that was produced in the output of event A has a non-zero intersection with the collection tokens that were ingested as part of the input of event B. And that is a very tempting, very natural definition of kind of causality in these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.24,
    "end": 2175.201,
    "text": "Turns out it doesn't really work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.421,
    "end": 2176.723,
    "text": "I mean, it works...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.703,
    "end": 2180.047,
    "text": " pretty well, but there are cases in which it fails, and it fails pretty spectacularly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.267,
    "end": 2186.274,
    "text": "And so the kind of canonical case where it fails spectacularly is that you can have events that don't actually do anything, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.294,
    "end": 2200.77,
    "text": "You can have events that just kind of touch an edge, touch a token, and output it again unchanged, but maybe, you know, it modifies the name, it modifies the identifier, but it doesn't actually change anything about the structure of the hypergraph or the Turing machine state or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.75,
    "end": 2202.713,
    "text": " So pretty obviously, that event doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.733,
    "end": 2205.176,
    "text": "It shouldn't be causally related to anything in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.557,
    "end": 2219.516,
    "text": "But because it ingested the edge and then did some identity operation but then produced it in the output again, it will register as being causally related to any future event that used that edge, even though it didn't make any difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.736,
    "end": 2221.098,
    "text": "That's just one very obvious example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.118,
    "end": 2227.787,
    "text": "There are other cases where it became clear that whatever this algorithm was detecting, it wasn't really causality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.767,
    "end": 2231.132,
    "text": " So I tried to think about, you know, what's a more sensible definition of causality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.152,
    "end": 2248.677,
    "text": "And I started working on things to do with, you know, a slightly kind of blockchain inspired ideas where you say, OK, well, rather than just arbitrarily assigning, you know, identifiers to these tokens every time they're created, what if I recursively construct the identifier of the token based on its causal history?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.998,
    "end": 2256.188,
    "text": "So in other words, each token, like each hyper edge or each state in each tape square on my Turing machine tape,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.539,
    "end": 2266.797,
    "text": " The identifier is not just some random number that gets generated by my algorithm, but instead its identifier is a directed graph representation of its complete causal history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.398,
    "end": 2272.827,
    "text": "Well then, kind of recursively, its identifier can only change if the causal history was updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.807,
    "end": 2276.255,
    "text": " And so you don't end up with these kind of spurious causal relations that I described before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.516,
    "end": 2280.104,
    "text": "So that seemed like one tempting way of resolving this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.445,
    "end": 2283.212,
    "text": "But then I realized, actually, there's a much more fundamental problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.252,
    "end": 2290.208,
    "text": "There's a there's a philosophical problem with the way that we're thinking about causality, which is that it's not really, you know, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.778,
    "end": 2298.851,
    "text": " Okay, this is a long tangent, which I'll talk about a little bit, but I won't get into the complete details unless people are interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.891,
    "end": 2312.634,
    "text": "But I ended up talking to a bunch of philosophers who worked on causality and people who worked on parallel programming and quantum information theory and other places where causality was studied and asked them kind of basically, what do you mean by causality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.654,
    "end": 2313.475,
    "text": "What is causality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.495,
    "end": 2316.08,
    "text": "What is this thing we're trying to define?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.941,
    "end": 2317.562,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.048,
    "end": 2324.7,
    "text": " In some form or another, all of the definitions boil down to, you know, event A causes event B if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.102,
    "end": 2328.167,
    "text": " had event A not occurred, then event B would not have occurred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.828,
    "end": 2330.25,
    "text": "So in other words, you need a counterfactual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.47,
    "end": 2334.015,
    "text": "You need some possible history, some possible world in which event A didn't happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.636,
    "end": 2339.283,
    "text": "But if you're reasoning about a purely deterministic event system, like a Turing machine, that doesn't make any sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.604,
    "end": 2347.616,
    "text": "Because if you have a single Turing machine transition function, there is no possible world in which that transition function didn't fire in that particular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.636,
    "end": 2351.822,
    "text": "Because if it didn't fire in that particular way, you would not be reasoning about that Turing machine anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.862,
    "end": 2353.945,
    "text": "You'd be reasoning about a different Turing machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.925,
    "end": 2364.683,
    "text": " So suddenly, to make sense of these notions of causality, you need a kind of Leibnizian modalities view of reality that just doesn't exist for these deterministic computational systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.484,
    "end": 2372.035,
    "text": "So either you need to define causality only at the multi-way level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.74,
    "end": 2390.901,
    "text": " at the level where you have many computations or possibly all computations happening in parallel and then you can define causality relative to all of you know relative between them or you were kind of posed right there wasn't really you know that seemed like the only kind of the only get out or you need some fundamentally new philosophical theory of causality that i was not qualified to produce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.881,
    "end": 2415.336,
    "text": " And so that's again part of what motivated this general research program, which is trying to think about this category of not just a single computation with a single sequence of data structures, because it's clear that you can't in a philosophically meaningful way assign causality in that case, but rather looking at the algebraic structure of the category of all possible computations and all possible data structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.316,
    "end": 2418.7,
    "text": " And in that situation, there is a notion of causality you can equip that with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.16,
    "end": 2426.429,
    "text": "And there's a nice mathematical description in terms of weak two categories and so on, which, again, I can talk about if people are interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.95,
    "end": 2440.885,
    "text": "But yeah, so it's clear that these things are very deeply related, that this theory of the category of computations and data structures and the theory of how you assign causality in a meaningful way are very deeply related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.865,
    "end": 2459.363,
    "text": " I'll just mention one other thing on that topic, which is, again, just an area which I find quite exciting because it's an unexpected spin out of this program, which is that so once you have a way of consistently applying causality at a per token level in these systems, it gives you a way of vastly generalizing what computation is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.866,
    "end": 2480.02,
    "text": " Um, and you can, in particular, you can get, you can derive something which I call, uh, uh, well, I'm provisionally calling covariance computation, although it should probably have a better name than that, which is so, you know, in our traditional kind of Turing church type, you know, uh, type models of computation, computation is a purely forwards in time operation, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.08,
    "end": 2486.11,
    "text": "So at every point, you know, you have a complete data structure and computation is about deriving what is the next state of that data structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.09,
    "end": 2488.199,
    "text": " So in a sense, it's only a forwards in time thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.38,
    "end": 2492.115,
    "text": "You might be able to kind of reconstruct the initial conditions based on some subsequent data structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.155,
    "end": 2495.188,
    "text": "You might be able to go backwards in time, but that's essentially what you're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.877,
    "end": 2501.788,
    "text": " But then you could imagine, OK, suppose I don't know the complete state of my data structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.229,
    "end": 2508.281,
    "text": "Instead, I know one part of my data structure, but I know its history throughout all of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.922,
    "end": 2518.881,
    "text": "So you could imagine, say, an elementary cellular automaton or a Turing machine tape where you know nothing about the tape, but you know the state of one cell and you know it throughout all of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.861,
    "end": 2521.243,
    "text": " And then the question is, what can you infer about the rest of the computation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.263,
    "end": 2524.487,
    "text": "And it turns out that for those kind of structured array type systems, you can infer a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.567,
    "end": 2545.408,
    "text": "You can actually evolve the system, not forwards in time, but sideways in space and obtain a kind of causal diamond that, so, okay, the top left, top right, bottom left, bottom right corners are undetermined, but everything inside that diamond can be determined just from that one row or that one column that you know, you know, sort of extended throughout time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.81,
    "end": 2549.615,
    "text": " And that's a fundamentally different notion of computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.655,
    "end": 2553.2,
    "text": "So it's a version of computation which is not forwards in time, but sideways in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.7,
    "end": 2563.213,
    "text": "But you can also have versions of computation that are sideways in branchial space, where you know one complete state, you know one branch of the multi-way system extended throughout time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.453,
    "end": 2568.039,
    "text": "And then the question is, what else can you infer about the rest of the multi-way system just from that one branch?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.059,
    "end": 2572.645,
    "text": "And again, the answer turns out to be you can infer a lot, but not everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.03,
    "end": 2578.119,
    "text": " Just like in the reason I call this covariant computation is because it's very analogous to what happens in relativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.159,
    "end": 2591.483,
    "text": "So in relativity, once you buy into this notion of general covariance and the notion that space and time are kind of fundamentally the same thing, then you have to somehow relax your traditional view of what dynamical systems do, which is, you know, we we typically think of systems as evolving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.804,
    "end": 2596.472,
    "text": "You know, you have a snapshot of your of your data, you know, localized on a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.452,
    "end": 2605.062,
    "text": " you know for a particular state of space you know on a particular space like hypersurface and then your laws of physics tell you how that space like hypersurface evolves forwards or backwards in time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.261,
    "end": 2619.598,
    "text": " But in a covariant picture of physics, then you must also allow for your initial data to be defined on a time-like hypersurface and for you to be able to evolve that time-like hypersurface sideways in space or mixtures of the two and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.018,
    "end": 2632.973,
    "text": "And so it's clear that there's a very general, a vast generalization of ordinary computation theory that you can construct that's kind of physics-inspired in that sense, in which you can have mixing of space-time and kind of multi-way directions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.953,
    "end": 2652.902,
    "text": " um in a completely consistent way but to make those things consistent you need to have a a definite way of assigning causality you need because you know any computation that you do even if it permutes the directions of space and time and branchial space and so on must always somehow preserve the causal structure has to respect the causal structure of what's going on or else it's inconsistent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.882,
    "end": 2665.026,
    "text": " And so this question of how you construct a covariant theory of computation is, it turns out, intimately related to the question of how you take this category of computations and data structures and equip it with a consistent notion of causality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.547,
    "end": 2666.749,
    "text": "So very interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.85,
    "end": 2668.613,
    "text": "We could talk about that a great length.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.593,
    "end": 2688.981,
    "text": " okay to follow with a few pieces it's very related to professor mike levin's notion of polycomputing and about the necessity for a causality concept to be created or deployed when the question arises was that me was that action or change due to me um also connectivities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.961,
    "end": 2701.658,
    "text": " Even just in the neuroimaging setting, which is kind of the cradle from which active inference and free energy principle arise from, it's really important to distinguish the functional, effective and anatomical connectivities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.119,
    "end": 2710.21,
    "text": "And that was one of the points that Toby Sinclair Smith made in his dissertation, which is that a lot of times the Bayesian graphs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.19,
    "end": 2730.78,
    "text": " don't convey all of the necessary and sufficient information to make the reproducible computation which is one of those kind of what's missing from the graph is what motivated a lot of the category theory developments in active inference as well as some of the formal ontological works with sumo and dave here and adam peace because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.76,
    "end": 2746.137,
    "text": " implementing modal and higher order logics is really important if it's a possible situation where a mind can have a perspective on a mind and all these things like that um then the ant turing tape the tape is the pheromone",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.454,
    "end": 2764.969,
    "text": " and then the decision space is the nest mates scrolling so when you had a deterministic touring tape that was like a movie because the nest mate couldn't make any choices except for internal action which is kind of side topic but couldn't make any choices on the tape",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.236,
    "end": 2794.973,
    "text": " Whereas when there's a multi-way, which is basically in active inference, what we talk about in terms of affordances and the policy space and the temporal depth of planning counterfactuals on action and action conditioned world transition states like the B matrix, all of those kinds of topics come into play because if you wanna have a causal buffer or grasp on what is it that something that could do otherwise does, what does it cause to do when it does or doesn't do otherwise?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.953,
    "end": 2823.762,
    "text": " you need something like a deterministic handle around what could be a probabilistic or deterministic but at least multi-way map of some kind of cognitive territory that's a very very interesting perspective i mean so it's again i'm i'm betraying my my ignorance of active inference theory here but you know it sounds almost like so these these um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.125,
    "end": 2838.479,
    "text": " When you have this interplay between epistemic versus pragmatic, there's two aspects of how this speculative part of cognition works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.641,
    "end": 2853.715,
    "text": "This is something which I thought about in a completely different context in relation to things like quantum information theory, but I wonder if there's a potential overlap there between...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.977,
    "end": 2862.851,
    "text": " There are certain situations when thinking about these kinds of systems, purely abstractly, where you kind of need two different notions of causality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.211,
    "end": 2868.621,
    "text": "You need a kind of speculative notion that can be, that's dynamic, that can be rewritten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.242,
    "end": 2872.507,
    "text": "And then you need a kind of definite notion that's immutable, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.768,
    "end": 2877.175,
    "text": "And so, you know, a classic example of this is, you know, say for something like quantum information theory, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.215,
    "end": 2878.217,
    "text": "So you can have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.197,
    "end": 2898.653,
    "text": " superpositions of causal orders you can have quantum switches you can have uh you know you you can have a causal structure that exists in uh in in in superpositions of different kind of directed graph states but then once you apply a mission operator once you apply a measurement the causal structure is definite because then everything is relativistic and you have covariance and you have similar things as i understand with with um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.633,
    "end": 2922.16,
    "text": " with uh with distributed computing with parallel computing where you you potentially allow for speculative execution for a certain number of steps where you're kind of treeing up this multi-way system and you have a superposition or you know at least a collection of possible causal histories but then eventually you have to choose an actual operation to do and then the causal history you know you have this big block that gets laid down and you know and then the causal history is is somehow definite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.14,
    "end": 2942.41,
    "text": " I wonder if there's a way of thinking about speculative execution of agents and the interrelation between that speculative execution and agent actions in terms of, again, this interplay between two different causal structures, between a dynamic one versus an immutable one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.014,
    "end": 2964.111,
    "text": " yeah well one funny way to think about that is like a single agent that has this counterfactual contemplative ability could be in the center place foraging arena and then imagining with discrete um branching paths like a chess algorithm or like a probability distribution could be like imagining where it could go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.091,
    "end": 2970.024,
    "text": " but not all cognitive things are the kind of things that make plans of their own actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.565,
    "end": 2973.853,
    "text": "Whereas like an ant colony has nest mates on the ground.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.254,
    "end": 2982.893,
    "text": "So they're actually realizing in these finite trajectories, the real exoskeleton on the ground that plays out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2983.835,
    "end": 3004.662,
    "text": " ending up with those simulated trajectories could have been simulated or could have been probabilistically blurred but that's kind of the difference between like the embodiment and like the body moving there for a mammal or for an animal and then like the mind simulating it and then just to the um the epistemic and pragmatic trade-off in decision making",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3004.844,
    "end": 3008.57,
    "text": " So let's just say that we're in that multi-way moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3008.951,
    "end": 3013.438,
    "text": "We'll just have two options, two different slices of the B variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.039,
    "end": 3018.105,
    "text": "And the policy selection question is about which way are you going to go?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.185,
    "end": 3019.447,
    "text": "Which affordance in the moment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3020.048,
    "end": 3023.674,
    "text": "Policy is basically the affordances for the time horizon of planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.175,
    "end": 3030.565,
    "text": "But if it's only one time step or just the next one, then the affordance space is just the actions that can be taken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.017,
    "end": 3043.675,
    "text": " One way to make it so that what happens is the likeliest thing, path of least action, which is kind of what opens up the whole physics of cognitive systems angle in contrast to like a reinforcement or reward learning perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.216,
    "end": 3047.6,
    "text": "What makes it the likeliest thing is starting with habit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3048.041,
    "end": 3051.346,
    "text": "So it could just be drawn from a fixed habitual distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3051.867,
    "end": 3059.978,
    "text": "However, for adaptive action, habit gets up-weighted with expected free energy, which is a functional that takes in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.958,
    "end": 3081.814,
    "text": " the policy space which is summing up to one because of the probability over actions and then up weighting policies according to their score on expected free energy which is consisting of epistemic plus pragmatic value so how much is it going to align the observations to be what i like to see that's pragmatic value with a preference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.503,
    "end": 3110.687,
    "text": " what is my expected information gain that's the epistemic value so how those are parameterized make the agent that always seeks out new information or always goes with habit or there's so much policy space because the knobs are not just simple sliders or there are multiple knobs even though they are seemingly quite consilient and minimal like it's hard to imagine less",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.359,
    "end": 3138.328,
    "text": " yet especially when there's richness in the environment even simple systems can have like enormously complex or adaptive behaviors i'll just leave it there no i i i never really thought of the so okay the yeah two things right so first of all the the perspective of you know thinking of an ant colony or a termite colony or something as being you know akin to a mind that's you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.697,
    "end": 3150.875,
    "text": " I was familiar with that perspective from people like Dan Dennett and so on, but the idea that the individual ants in that colony are, in a sense, they're kind of the hardware enacting the speculative execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.636,
    "end": 3152.978,
    "text": "That's a very interesting idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.078,
    "end": 3154.961,
    "text": "It's not speculative for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.161,
    "end": 3155.922,
    "text": "Well, yeah, no, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.023,
    "end": 3165.597,
    "text": "But it's sort of from the mind's perspective, I guess it's almost like speculative execution, but it's speculative execution that's being actuated in the physical world, which is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.717,
    "end": 3167.86,
    "text": "I'd not really thought about that before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.481,
    "end": 3194.708,
    "text": " But then, yeah, okay, so then the point you're making about connection to free energy and sort of habit formation and so on, okay, so I wonder if, so, you know, if we're thinking about a, you know, a model of cognition in which there are these two different, you know, two distinct causality notions, the immutable versus the dynamic one, I wonder if the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.578,
    "end": 3206.93,
    "text": " You gave a very, very nice account of how habit formation sort of works in these kinds of formalisms based on prior experience of expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.01,
    "end": 3217.523,
    "text": "So I wonder if there's a way of describing that abstractly in terms of something like you perform the speculative execution step,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.06,
    "end": 3221.147,
    "text": " where you're, you know, you're treeing out several multi-way possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.187,
    "end": 3225.036,
    "text": "And initially you kind of, you know, you, you, you know, nothing, or you have no habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.076,
    "end": 3227.743,
    "text": "You're just kind of, you're treeing everything out with kind of equal weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.444,
    "end": 3233.997,
    "text": "But then, you know, for each possible part, you're calculating either an actual or an expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.559,
    "end": 3236.423,
    "text": "And then somehow, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.403,
    "end": 3249.577,
    "text": " In future speculative executions, you weight those paths which you previously had found to have higher free energy as higher, and so you're more likely to explore those and less likely to explore ones which have that lower expected value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.519,
    "end": 3258.826,
    "text": "It feels like something like that should fit very, very nicely into an algebraic semantics like this, which would be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.267,
    "end": 3259.447,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.767,
    "end": 3261.169,
    "text": "How about more questions from the chat?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.47,
    "end": 3262.75,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.311,
    "end": 3264.452,
    "text": "Upcycle Club writes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.58,
    "end": 3274.777,
    "text": " Acknowledging the limitations of traditional entropy in multi-computations motivates us to develop context-specific entropy metrics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.178,
    "end": 3277.682,
    "text": "Can you share some insights towards such efforts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.646,
    "end": 3281.65,
    "text": "Yeah, I can certainly try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.331,
    "end": 3283.453,
    "text": "So yes, I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.648,
    "end": 3296.459,
    "text": " The first point is that I think there's that famous conversation between John von Neumann and Claude Shannon, where I think von Neumann famously said that Shannon should call his measure entropy because no one knows what it means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.039,
    "end": 3302.524,
    "text": "And I submit that the reason that no one knows what entropy means is because it's dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.664,
    "end": 3307.789,
    "text": "I mean, one of the reasons no one knows what entropy means is because it's dependent on exactly what we've been talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.809,
    "end": 3310.471,
    "text": "It's dependent on the equivalence function of the observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.392,
    "end": 3314.655,
    "text": "So it's one of these things like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.441,
    "end": 3324.399,
    "text": " I don't know, maybe this is a stupid analogy to use, but it's... Sorry, I'm going to go off on a tangent, but I promise it's sort of relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.619,
    "end": 3334.18,
    "text": "So one thing that always breaks my brain is when I try and think about actuaries and life insurance policies, because it's one of those areas where...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.218,
    "end": 3342.185,
    "text": " Those models only make sense if they're not perfect, in a sense, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.385,
    "end": 3352.838,
    "text": "So if you had an actuary who knew exactly how long everyone was going to live, and somehow that information was openly available, life insurance policies would be pointless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.64,
    "end": 3363.07,
    "text": "Whereas also, if you had a model that was completely hopeless of predicting how long people would live, life insurance policies would also be pointless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.045,
    "end": 3371.84,
    "text": " Somehow, the very existence of actuarial science relies on your model neither being perfect nor being awful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.261,
    "end": 3373.984,
    "text": "It somehow has to exist somewhere in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.926,
    "end": 3381.278,
    "text": "And that's something which I... It's one of those topics where if I think about it for too long, it all just stops making sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.815,
    "end": 3383.859,
    "text": " And entropy has very much that same character, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.899,
    "end": 3391.516,
    "text": "Because if you were Laplace's demon, if you had perfect information about the system that you were observing, there's no notion of entropy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.536,
    "end": 3395.183,
    "text": "It's just you know every micro state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.344,
    "end": 3398.811,
    "text": "So the Boltzmann formula gives you an entropy value of zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.803,
    "end": 3407.476,
    "text": " But the notion of entropy only exists once you take that perfect knowledge of a system and you coarse-grain it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.796,
    "end": 3418.774,
    "text": "As I was describing earlier, you introduce an encoding function that is not 100% subjective, so that now you are mapping certain distinct micro-states onto the same coarse-grained macro-state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.754,
    "end": 3423.488,
    "text": " And then now you can ask, okay, what's the number of micro-states that, you know, exactly how coarse is my coarse graining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.508,
    "end": 3426.035,
    "text": "What's the number of micro-states consistent with this macro-state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.075,
    "end": 3431.471,
    "text": "What's the number of different values of my domain that gets mapped to a single point in my codomain of my encoding function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.692,
    "end": 3433.236,
    "text": "And that's what entropy is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.418,
    "end": 3438.665,
    "text": " And so it's very closely, I mean, it is effectively a measure of how good is my coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.705,
    "end": 3441.148,
    "text": "So if you had perfect knowledge, there's no entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.368,
    "end": 3443.932,
    "text": "If you have no knowledge, there's no entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.952,
    "end": 3454.245,
    "text": "It relies upon you having a not completely trivial, but also not 100%, you know, a slightly subjective, but not 100% subjective encoding function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.225,
    "end": 3457.972,
    "text": " just like with life insurance policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.333,
    "end": 3476.065,
    "text": "The reason I'm stating that is because from that perspective it becomes a little bit clearer why there are all these different notions of entropy and why, as the questioner was alluding to, why entropy as a concept seems to be so domain and system specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.045,
    "end": 3485.575,
    "text": " every different system, every different observer will in principle have a different set of encoding functions, a different set of equivalence functions, and each one will give rise to a different calculation of entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.235,
    "end": 3502.592,
    "text": "And so one way that you can think about this program, this program to try to understand the algebraic interplay between time complexity versus equivalencing complexity or computational irreducibility versus multi-computational irreducibility, in some sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.572,
    "end": 3508.118,
    "text": " That is a program to try to understand how different definitions of entropy relate to each other in these kinds of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.299,
    "end": 3525.655,
    "text": "If I take one idealized observer that has this equivalence function and I ask, okay, suppose now they communicate with this different observer with a different equivalency function, they come to different understandings of what the entropy of the system is, but what is the relationship between their measured entropy values?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.675,
    "end": 3532.242,
    "text": "There clearly is one that depends algebraically on some details of the distinction between their respective equivalence functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.222,
    "end": 3550.45,
    "text": " but there doesn't seem to be any yet any general theory for for you know how those things are related and that there's you know that that's part of the kind of um the raison d'etre of this of of this research program um but yeah i mean okay so uh one thing that i will comment on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.683,
    "end": 3554.711,
    "text": " Although this is a little bit more speculative, it's again a sort of quasi-philosophical comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.393,
    "end": 3565.333,
    "text": "One place where the fact that you have all these different notions of entropy becomes kind of interesting is in fundamental physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.14,
    "end": 3581.618,
    "text": " So when you start to think about, if you try to model physics and the universe in these fundamentally computational terms, then one fairly generic conclusion that you can reach is that gravitation, general relativity, is essentially an entropic phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.598,
    "end": 3606.475,
    "text": " people have kind of talked about this in in in non-computational contexts too but it's very very natural if you start to think about space-like hyper surfaces being sort of hypergraphs then you know in order to obtain a continuum geometry that's compatible with the Einstein equations you need to have certain ergodicity you know you need to be able to make certain ergodicity assumptions on the rewriting which in turn sort of implies certain lower bounds on the entropy of the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.455,
    "end": 3613.301,
    "text": " So somehow gravitation, general relativity, is a coarse grained theory you obtain in the limit as the entropy goes to infinity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.982,
    "end": 3622.089,
    "text": "But something that's interesting is that quantum mechanics, on the other hand, is an idealization that you obtain in the limit as entropy goes to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.59,
    "end": 3630.477,
    "text": "Because in kind of one of these purely computational models of physics, the quantum mechanical state of a system is described in terms of its multi-way structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.497,
    "end": 3636.242,
    "text": "It's described in terms of, you know, when I have a kind of a branching program like this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.218,
    "end": 3643.545,
    "text": " let me find, like this, then I can divide it up into these sort of, into these simultaneity surfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.846,
    "end": 3658.483,
    "text": "And if I associate each state of the program as being like the analog of a quantum eigenstate and the kind of path weightings as being analogous to the amplitudes associated with these eigenstates, I can quickly build up a description of this multi-way system in terms of the evolution of some discrete analog of the Schrodinger equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.463,
    "end": 3664.24,
    "text": " And it turns out you get a theory that is mathematically isomorphic to standard quantum mechanics out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.681,
    "end": 3671.781,
    "text": "So quantum mechanics is sort of inextricably bound up with the phenomenon of the multi-way system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.065,
    "end": 3684.063,
    "text": " But if you take the entropy to infinity here, then you're effectively then the sophistication of your of your equivalence function becomes arbitrarily large, which means that you can describe any essentially any pair of states as being equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.684,
    "end": 3694.478,
    "text": "And so it turns out that the actually the quantum mechanical case corresponds to the zero entropy limit, whereas the kind of generalistic case corresponds to the infinite entropy limit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.498,
    "end": 3696.621,
    "text": "But they're kind of two different two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.601,
    "end": 3701.868,
    "text": " fundamentally different notions of entropy, one of which exists at the single-way level, one of which exists at the multi-way level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.349,
    "end": 3707.636,
    "text": "And again, the question of how these things interplay is partly why we're investigating this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.856,
    "end": 3713.663,
    "text": "And it's clear that that question has links to these quite foundational questions in fundamental physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.683,
    "end": 3721.093,
    "text": "The ideal point mass and the ideal distribution with its center of gravity and all this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3721.854,
    "end": 3724.718,
    "text": "Dave, question for you, from you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3725.795,
    "end": 3726.116,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.938,
    "end": 3730.748,
    "text": "Okay, I was, can you hear?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.209,
    "end": 3731.871,
    "text": "Yep, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.891,
    "end": 3733.195,
    "text": "Okay, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.017,
    "end": 3740.935,
    "text": "Yeah, I'd like to veer down to the low road during this discussion, maybe show business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.218,
    "end": 3752.414,
    "text": " When people are trying to explain what is computational reducibility or irreducibility, often you'll see a graph that says, well, now here's the computation, our target, running along.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.454,
    "end": 3753.656,
    "text": "The fox is running along.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.937,
    "end": 3758.383,
    "text": "And behind it, there's a team of algorithms that would like to catch it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.482,
    "end": 3768.299,
    "text": " And yeah, it either does or it doesn't outrun all of them, but some can seem to come pretty close to catching it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.481,
    "end": 3773.769,
    "text": "Now there's something else people have been looking at for a few years, the Mandelbrot set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.789,
    "end": 3780.14,
    "text": "The Mandelbrot set really is not only a deterministic computation, it's a crisp computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.4,
    "end": 3782.464,
    "text": "Every set, every point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.237,
    "end": 3795.613,
    "text": " either is inside the safe zone, it's gonna sit there and it's happy and quiet and you color it black, or it flies off to infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.633,
    "end": 3804.685,
    "text": "So it could just be a bunch of yes or nos, but that's not the way people trying to calm down after a day of work wanna look at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.725,
    "end": 3810.392,
    "text": "They wanna say, hey, I wanna see the 32 million deep Mandelbrot set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.642,
    "end": 3812.084,
    "text": " And I want to see it in colors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.305,
    "end": 3815.811,
    "text": "So when you get the colors, you ask, how hard did I have to work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.911,
    "end": 3819.297,
    "text": "How long did I have to grind along before I made that decision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.617,
    "end": 3825.588,
    "text": "Oh, this is a point that's going to settle down and be quiet and uninteresting, or it's going to fly off to infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.608,
    "end": 3827.651,
    "text": "So you put colors in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3827.952,
    "end": 3834.523,
    "text": "Now, I just wonder, would it be interesting to anyone to fuzzify these gorgeous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.841,
    "end": 3854.166,
    "text": " causal and multi-causal graphs and just show this is the portion where we had to work really hard rule 35 or what we had to go 15 000 generations before we gave up and said we're not going to follow this anymore the other one oh after 30 steps i i see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3856.171,
    "end": 3857.313,
    "text": " That's a really interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.493,
    "end": 3862.563,
    "text": "A couple comments on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.623,
    "end": 3868.073,
    "text": "One is, you're right in the sense that yes, the Mandelbrot set is a very clean thing to describe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.434,
    "end": 3872.982,
    "text": "I would argue it's actually not a crisp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.485,
    "end": 3877.613,
    "text": " computation in that sense, precisely for reasons of computational irreducibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.653,
    "end": 3885.128,
    "text": "Because as you go arbitrarily close to the boundary of the set, you can have complex numbers that have a kind of indefinite period of transient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.308,
    "end": 3895.729,
    "text": "There's no upper bound on how long the Zn squared plus C orbit can last before it either diverges or converges to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.709,
    "end": 3905.702,
    "text": " And that statement that there will be points that can get tied up in these orbits indefinitely is really a computational irreducibility statement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.273,
    "end": 3930.408,
    "text": " But yeah, I mean, your question about, you know, could you construct, so I mean, that way of coloring points that are on the boundary of the Mandelbrot set in that way, the so-called escape time algorithm, right, where you kind of, where you color them based on how many steps did I need to do before it either converged or escaped off, you know, above some, or, you know, the complex numbers modulus exceeded some value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.988,
    "end": 3934.153,
    "text": "Yeah, it's an interesting idea that you could try and kind of construct",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.133,
    "end": 3940.556,
    "text": " geometrical representations of the space of possible computations based on a kind of escape time algorithm for computational disability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.636,
    "end": 3940.797,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.817,
    "end": 3944.129,
    "text": "So, I mean, there are the possible ways that you could do that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.149,
    "end": 3946.236,
    "text": "That you say, you know, we know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.587,
    "end": 3950.978,
    "text": " We've known since the days of Turing that the halting problem for Turing machines is undecidable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.998,
    "end": 3956.552,
    "text": "There's no finite computation that you can do that will determine whether an arbitrary computer program will terminate in finite time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.013,
    "end": 3964.191,
    "text": "So once you have a way of kind of geometrizing the space of possible computations, which we have now, as you say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.171,
    "end": 3970.199,
    "text": " Yeah, you could easily construct a kind of escape time algorithm where, you know, you have your analog of the Mandelbrot set, which is, you know, here's all the halting computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.42,
    "end": 3972.483,
    "text": "Here are all the definitely non-halting computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.723,
    "end": 3976.368,
    "text": "And then there's some boundary of very fuzzy stuff where we kind of don't really know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.428,
    "end": 3977.53,
    "text": "We have to do a lot of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.55,
    "end": 3982.457,
    "text": "And even then, it's only heuristic, which is which is, you know, I mean, very directly analogous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.078,
    "end": 3983.999,
    "text": "And then, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.019,
    "end": 3985.521,
    "text": "And then the question becomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.737,
    "end": 4006.283,
    "text": " you know, so in the case of the M set, you know, there is some underlying theory, mostly, I think, mostly due to like Dwadi and Hubbard and people that allows you to kind of predict, like, you know, if you have a finite filament, you can, of the Mandelbrot set, you can kind of predict, you know, where that filament is going to be based on some complicated, complex analysis argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.303,
    "end": 4015.575,
    "text": "And, you know, I mean, the question is, once you, if you, once you have a geometrization of the space of possible computations, can you construct some general theory like the theory, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.555,
    "end": 4031.819,
    "text": " developed by Duarte and Hubbard that tells you things about the topology of the computations, whether certain regions of the space are connected, whether they're compact, whether you can do a similar thing where you can make predictions based on the geometry of one part of the set, where you can extrapolate to things about the geometry of another part of the set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.999,
    "end": 4033.08,
    "text": "That's a really interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.401,
    "end": 4042.474,
    "text": "And yeah, again, as with so many of these things, it's one of these, like, I don't know the answer, but it's a good reason for investigating, for pursuing the program, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.163,
    "end": 4054.738,
    "text": " Yeah, from the Wolfram side, as well as from the active inference side, there's both the information topology and the information geometry side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4055.319,
    "end": 4062.268,
    "text": "And not just in the kind of topological deep learning, but rather looking at the topology of information flows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.248,
    "end": 4079.278,
    "text": " which has been heavily developed in the category theory related to quantum information sciences and then the information geometries that allow us to do like machine learning type accelerated optimization and gradients all these kinds of concepts that come into play with geometry",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4079.832,
    "end": 4097.672,
    "text": " And we just don't get them from topology so it's apology kind of sketches the skeleton and then with the computers that we have the information geometry is at least on the data sets and the ways that we have computation today that's kind of like the quantitative numerical versus the formal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.158,
    "end": 4104.67,
    "text": " One question is, are these all discrete state space, discrete time formalisms?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.371,
    "end": 4121.059,
    "text": "Because in active inference, we often deal with hybrid models that have discrete and continuous state spaces and the same generative model or the same system of interest could be modeled with like a discrete time chapter seven or a continuous time chapter eight model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4121.139,
    "end": 4122.782,
    "text": "So how does this deal with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4123.876,
    "end": 4124.657,
    "text": " That's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.837,
    "end": 4137.296,
    "text": "So most of what I've been looking at so far has consisted of discrete time, discrete space models for no particularly principled reason other than they're easier to analyze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.338,
    "end": 4144.507,
    "text": "For the most part, because you can do explicit computations, because they're more amenable to constructive analysis, it's easier to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.547,
    "end": 4146.61,
    "text": "But the beauty of a lot of this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.59,
    "end": 4167.096,
    "text": " one of the beauties of using kind of general mathematical formalism is that once you develop it it's often quite easy to extend even to even to cases that you know to extrapolate to cases that you didn't explicitly analyze so in principle this formalism works for you know for continuum space and continuum time systems as well just with some you know with some slight modifications so rather than having say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.076,
    "end": 4183.735,
    "text": " branching and merging, you instead have, you know, if you think about this thing as now being a dynamical system, you know, described on some symplectic manifold, then these kind of branching, merging operations of the multi-way system become effectively divergence and convergence operate, you know, differential operators defined on the symplectic manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.276,
    "end": 4195.108,
    "text": "And so, you know, one place where we can start to analyze that explicitly, and which I've done a little bit of work on, but it's one of these things which I want to go back to very soon, is looking at Petri nets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.088,
    "end": 4204.643,
    "text": " So Petri Nets are interesting because they are a discrete time, discrete space system, but they admit a continuum, you know, continuum space, continuum time description in terms of ordinary differential equations and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.823,
    "end": 4217.042,
    "text": "So they're a nice example of a hybrid kind of discrete event versus continuum event system where it's clear that this formalism can be used and is somehow agnostic as to whether the, you know, whether the underlying system is discrete or continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.583,
    "end": 4222.21,
    "text": "Again, there's a broader philosophical point to make here, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.586,
    "end": 4239.226,
    "text": " In a way, one of the reasons I don't feel embarrassed to be working primarily with discrete systems is because, you know, again, once you start to think about things in terms of, okay, you have to not just care about nature, you also have to care about the computations the observer can perform and what it's able to infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.266,
    "end": 4245.394,
    "text": "Then you quickly realize that in a sense, just like whatever you were saying earlier, Daniel, you know, beauty is in the eye of the beholder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.414,
    "end": 4250.441,
    "text": "I think discreteness and continuity are also in the eye of the beholder, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.481,
    "end": 4252.804,
    "text": "I mean, so if you have,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.645,
    "end": 4277.02,
    "text": " If you have a universe that is fundamentally continuous, that's described by a continuum Lorentzian manifold or something, but you're constrained so that the only experiments you perform have computable outcomes, have discrete outcomes, where the possible number of observables is always countable, then in a sense it doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.0,
    "end": 4286.159,
    "text": " It's irrelevant to you as an observer whether the system is discrete or continuous, because the only parts of it that you can interface with and interact with are discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.54,
    "end": 4290.688,
    "text": "And so you could have replaced the underlying substrate with a purely discrete mathematical structure and you wouldn't be able to tell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.189,
    "end": 4292.612,
    "text": "So in some sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.571,
    "end": 4314.295,
    "text": " I don't feel too embarrassed dealing with discrete event systems, because even if I don't necessarily believe that nature is discrete, because I'm not even sure how we would be able to answer that, I'm reasonably convinced that the experiments that we can perform and the observations that we're able to perform are ultimately computable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.636,
    "end": 4319.882,
    "text": "And therefore, the underlying substrate might as well be discrete, even if it's not in reality, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.246,
    "end": 4347.726,
    "text": " yeah that's a great comment definitely calls back to your earlier points about like discretization being in the eye of the beholder like in the active inference models observations raw data may already be discretized depending on the situation but even if it weren't like it were a continuous sensory perception or modeled as such analytically still commonly models discretize and categorize as they move up cognitive hierarchies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.706,
    "end": 4371.267,
    "text": " and that was like initially explored to get more of this discrete either or decision making planning all those kinds of properties um well there's many interesting angles like I'm sure also it could be a multiplexed language model prompt but like what are you working on or excited about for 2024",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4372.748,
    "end": 4374.011,
    "text": " Ah, that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.912,
    "end": 4390.183,
    "text": "So I've kind of already given some hints about this general research program of trying to understand computational complexity and algorithmic complexity and interplays between observers and systems through this category-theoretic lens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.163,
    "end": 4395.012,
    "text": " Yeah, that's a major thing which I started on, say, about maybe a couple of years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.032,
    "end": 4400.363,
    "text": "I mean, in some form, I've been working on it for a long time, but this more recent perspective on it is maybe a couple of years old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.823,
    "end": 4405.793,
    "text": "But for various reasons over the last year or so, I've kind of put that to rest and I've been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.773,
    "end": 4418.286,
    "text": " focused on these much more physics oriented questions about discrete space time and understanding things like, you know, how the black holes work and how the secretion work in discrete space, which is also very important and and very exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.326,
    "end": 4422.61,
    "text": "But I've sort of slightly been missing these more abstract directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.65,
    "end": 4428.216,
    "text": "And so I have maybe one or two major, you know, physics related things that I need to finish off in the night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.236,
    "end": 4431.279,
    "text": "And then I really want to go back to this to the greatest extent possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.74,
    "end": 4434.042,
    "text": "And I mean, so one thing is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.325,
    "end": 4443.717,
    "text": " that's quite clear is that there's great interplay between this formalism and existing theories of computational and algorithmic complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.177,
    "end": 4458.055,
    "text": "So one very basic example is, I mentioned before that you have this kind of coherence between these two different algebraic structures, between the operation of time-like composition versus the operation of parallel composition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.035,
    "end": 4464.884,
    "text": " And these two algebraic structures are, in general, related, although the precise conditions that relate them are not clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.904,
    "end": 4467.528,
    "text": "And that's partly what we're trying to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.629,
    "end": 4476.219,
    "text": "But it turns out that degenerate cases of that question corresponds to unsolved problems in computational complexity theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.339,
    "end": 4486.152,
    "text": "So for instance, the P plus NP problem can essentially be recast in these terms, that you can recast the P plus NP problem as the question about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.334,
    "end": 4505.811,
    "text": " coherence between the time-like composition of computational complexity and the parallel composition of computational complexity, which are what P and NP respectively are really about, are those coherence conditions the strictest they can be, which would be the case that P equals NP, or are they somehow more lax, which would be the case that P does not equal NP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.791,
    "end": 4510.597,
    "text": " And so there's, you know, that's that's one thing that we kind of already investigated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.617,
    "end": 4519.087,
    "text": "But it's clear that a whole bunch of questions about, you know, how the time complexity and space complexity trade off or how the Kolmogorov complexity and time complexity trade off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.368,
    "end": 4531.703,
    "text": "These these are questions which can be recast in this kind of more algebraic therapeutic lens and will hopefully give insight into this general program of trying to understand observers and their relationship to the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.183,
    "end": 4534.566,
    "text": "And those are kind of major",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.546,
    "end": 4538.578,
    "text": " Well, with any luck, those are major theorems that I hope we'll be able to prove at some point in 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.604,
    "end": 4547.644,
    "text": "That's awesome, and it makes me think about parallel, more Nest Mates, more CPU threads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4548.147,
    "end": 4554.856,
    "text": " deeper in time, more sequential, more planning and more cognitive single monolithic agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4554.896,
    "end": 4571.758,
    "text": "And then the kind of question is like, can anything that a single agent mega matrix could do, can that be decomposable at space advantage or even at space disadvantage in decomposed it into a single time step operation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4572.43,
    "end": 4581.613,
    "text": " Yeah, that's a super important question and one that, with the possible exception of this community, not many people have asked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.133,
    "end": 4584.296,
    "text": " That's something which comes up in quantum computing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.356,
    "end": 4603.045,
    "text": "So a lot of the hype around quantum computation comes from these theoretical speedups that derive from the fact that you're able to support these superpositions of different, where each state of your data structure corresponds to a different eigenstate, and you're able to evolve some superposition of those eigenstates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.025,
    "end": 4606.429,
    "text": " But then at the end, you have to actually come to a definite conclusion about what the answer is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.489,
    "end": 4608.15,
    "text": "You have to perform some measurement operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.491,
    "end": 4609.972,
    "text": "And that measurement operation is lossy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.992,
    "end": 4611.134,
    "text": "It's often non-deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.754,
    "end": 4613.656,
    "text": "You often have to repeat it multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4614.838,
    "end": 4625.829,
    "text": "And it's becoming increasingly clear that for a large class of operations that were previously thought to have quantum advantage, the additional complexity of the measurement step really kills any quantum advantage that you may have had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.49,
    "end": 4632.897,
    "text": "You get some advantage by doing unitary evolution, but then you lose all of it by having to do the submission projection at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.877,
    "end": 4651.044,
    "text": " And that's really a story of, again, this interplay between the time complexity saving of doing a multi-computation in parallel versus the loss that comes from the complexity of the equivalence function that you need to apply in order to get to some definite conclusion about what happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.545,
    "end": 4659.897,
    "text": "Because ultimately, you need to somehow collapse that directed graph into a single thread of time in order to be able to have some coherent representation of what happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.231,
    "end": 4665.802,
    "text": " And so again, that's a place where understanding these trade-offs will become very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.922,
    "end": 4675.54,
    "text": "And as I say, in some limiting case, that gives some perspective on your question, Daniel, which I agree is a very interesting question about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.52,
    "end": 4684.193,
    "text": " In principle, we know that anything that a deterministic Turing machine can do, a non-deterministic Turing machine can do, and vice versa with some speed up or slow down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.395,
    "end": 4692.305,
    "text": "But that statement, which is a classic result in computability theory, neglects all consideration of the equivalence function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4692.686,
    "end": 4700.177,
    "text": "So there may be cases where the equivalence function is so complex that essentially the to-do state equivalence becomes undecidable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4700.157,
    "end": 4710.907,
    "text": " And so in that case, you have a scenario where actually, you know, you've got a multi computational system, but to to collapse it to one that's equivalent to a single way system requires unbounded amounts of computational effort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.107,
    "end": 4715.391,
    "text": "And so so actually they become an equivalent, even though, you know, computability theory says they should be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.592,
    "end": 4730.164,
    "text": "So it's clear that there's a there's a more rich, more subtle theory that's underlying here that we're just beginning to kind of glimpse and that I hope we'll you know, we'll be able to kind of to prove some new limited results about soon once we understand it a bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.144,
    "end": 4753.84,
    "text": " awesome and i think definitely a special shout out to all of our colleagues on either like the wolfram and or active inference side because we've seen few if any active inference models phrased analytically or computationally with the wolfram technology um from studying complexity in other areas",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.495,
    "end": 4762.791,
    "text": " It's really clear to see how productive and powerful the software and the tools can be and changing and growing every day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4762.892,
    "end": 4764.815,
    "text": "So it's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4764.875,
    "end": 4774.815,
    "text": "Maybe someone can, if they're listening this far in, like go from one side to the other and back or make a Wolfram active inference model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4775.656,
    "end": 4787.209,
    "text": " or do some other kind of combination because it's very fruitful territory and we know that our elders have already spoken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4787.249,
    "end": 4789.872,
    "text": "They've okayed it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4789.892,
    "end": 4805.19,
    "text": "No, but really it's so rich with connections here between the areas that we're all studying and feeling like converging on many common places to scaffold and jump off from together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4807.178,
    "end": 4808.42,
    "text": " Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.343,
    "end": 4822.322,
    "text": "The kinds of things that we were discussing here about speculative execution and behavior formation through free energy principle and so on, those things should be relatively easy to implement in the framework that's already been developed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.903,
    "end": 4833.22,
    "text": "That's a question of just implementing some kind of computation of expected free energy and using that to weight multi-way paths in the speculative execution model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.2,
    "end": 4844.835,
    "text": " So at least the beginnings of that implementation, I think the path is pretty clear, and we will probably end up doing at some point in the future anyway as part of other research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.837,
    "end": 4850.603,
    "text": "So yeah, I agree, it's a very exciting point of interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.143,
    "end": 4857.672,
    "text": "Yeah, well, I hope that we can stay in touch if you ever want to come back for a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.293,
    "end": 4872.318,
    "text": " 009.2 or if we want to even facilitate some kind of working group or some connections to really strengthen and include the participation of more people in this super exciting area, that would be amazing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4873.42,
    "end": 4874.361,
    "text": "Yeah, that sounds fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.421,
    "end": 4876.245,
    "text": "Let's try and set something up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.265,
    "end": 4883.237,
    "text": "Well, Dave, first penultimate comments, then Jonathan, you can have the kind of last comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.521,
    "end": 4893.555,
    "text": " Yes, I hope you do get to continue on the Wolfram physics side to think about a more general notion of what these ultimate things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.356,
    "end": 4910.659,
    "text": "Are they observers or does that already prejudice the case of what you might find if you call them workers or actors or, you know, go back and ask Stuart Kaufman, what must a mind do to earn its way in the world?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4911.601,
    "end": 4930.504,
    "text": " let's make this keep happening thank you thank you dave for suggesting it also it was a great suggestion jonathan no and that's i think that's a fantastic note to end on i mean and and that that in a sense this this idea that we should start to move i mean so it's okay big picture for a moment like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.868,
    "end": 4960.491,
    "text": " where you know this formalism is being developed the the formalism i've described in this in this discussion is being developed you know assuming a kind of purely passive observer idealization and that's already been incredibly difficult right it's clear there's a lot we don't understand at that but of course david is right that that in a sense you know what you know ultimately we want to start transitioning to a to a participatory observer model where where you allow for two-way interactions or you know higher order interactions between observers and systems and things that don't just go in one direction and yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.471,
    "end": 4973.583,
    "text": " In a sense, I view a lot of what we're trying to do with trying to nail down these notions of causality, trying to understand these interplays between different complexity and entropy measures as the necessary groundwork for developing that subsequent theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.683,
    "end": 4976.59,
    "text": "It's clear that if we want to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.57,
    "end": 4999.253,
    "text": " a uh a version of the you know of this kind of compositional multi-way formalism that is also compatible with things like second order cybernetics then uh you know at the very least we need to have a very coherent notion for what causality is and and you know and a robust algebraic description of that that's not going to to break or change and so i think um the the the non-participatory a participatory observer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.233,
    "end": 5007.403,
    "text": " model is a useful starting point because it's one that is just within our grasp of being mathematically tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.883,
    "end": 5020.718,
    "text": "And then the hope is that the technology and the ideas and the conceptual structure that we develop for understanding that will then, as I say, lay the groundwork for developing something that's more like what real active participatory observers do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.474,
    "end": 5033.873,
    "text": " Um, and, uh, and yeah, I mean, I, I think I, I don't on the, on the scientific side, I'm not really sure I have anything, any final comments apart from just, you know, as is obvious, this is a, you know, this is still a story that's being, that's being developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.334,
    "end": 5040.464,
    "text": "And, uh, and yeah, as Daniel alluded to, I hope that we can continue to, uh, to interact and, and, and collaborate where, where, where that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.484,
    "end": 5042.487,
    "text": "And, and yeah, at the very least, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.467,
    "end": 5057.614,
    "text": " incorporation of these active inference models within these discrete time, in the first instance, discrete time computational frameworks, and allowing things like speculative execution and multi-way path weighting based on free energy estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.436,
    "end": 5066.871,
    "text": "I think that's a project that's of obvious mutual interest and something that I hope will happen in the coming months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.475,
    "end": 5067.876,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5068.137,
    "end": 5072.209,
    "text": "We just speculatively executed Act of Wolfram Prince.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5073.633,
    "end": 5074.075,
    "text": "Basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5074.195,
    "end": 5075.82,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5076.181,
    "end": 5076.903,
    "text": "Thank you, Jonathan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5077.144,
    "end": 5077.685,
    "text": "Thank you, Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5077.705,
    "end": 5078.367,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5079.19,
    "end": 5080.253,
    "text": "See y'all next time.",
    "speaker": "SPEAKER_02"
  }
]