[
  {
    "start": 2.125,
    "end": 3.045,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.685,
    "end": 5.306,
    "text": "It's June 7th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5.386,
    "end": 15.048,
    "text": "We're in ACT-INF Livestream 54.1 discussing mathematical foundations for a compositional account of the Bayesian brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.848,
    "end": 18.528,
    "text": "So, welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.168,
    "end": 24.89,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.77,
    "end": 31.091,
    "text": "This is a recorded and an archived livestream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.557,
    "end": 37.679,
    "text": " All backgrounds and perspectives are welcome, and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.4,
    "end": 44.502,
    "text": "To learn more about live streams and other projects, head over to ActiveInference.org.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.963,
    "end": 50.965,
    "text": "And we're here today in ActiveStream 54.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.845,
    "end": 60.709,
    "text": "We are in our first discussion with the author of the work, Mathematical Foundations for a Compositional Account of the Bayesian Brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.059,
    "end": 71.246,
    "text": " Today in 54.1, we're going to say hello, then be on with it and see where it all goes together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.007,
    "end": 73.308,
    "text": "So we'll begin with introductions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.749,
    "end": 75.229,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.529,
    "end": 77.131,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.28,
    "end": 98.346,
    "text": " six months ago was quite unfamiliar with category theory and have had quite a fun journey with ali and dean and i guess toby via stigmatic proxy so really looking forward to this discussion and i'll pass to dean and then ali next time i'm dean i'm here at calgary um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.908,
    "end": 111.055,
    "text": " My goal in joining this group was to take the idea, as we got in one of the previous slides, the idea of practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.796,
    "end": 120.262,
    "text": "I see the potential through category theory of making that even more accessible, more possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.382,
    "end": 126.426,
    "text": "And so I'm really excited to have the author with us today and maybe have a look at what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.766,
    "end": 127.547,
    "text": "And I'll pass it over to Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.742,
    "end": 131.643,
    "text": " Hello, I'm Ali.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.923,
    "end": 135.927,
    "text": "I'm an independent researcher of Premier One.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.349,
    "end": 150.482,
    "text": "And as I said in that zero, I'm quite excited to be here to discuss this magnificent dissertation with its author and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.892,
    "end": 162.064,
    "text": " Well, I mean, in the past several months, we did our best to understand and dissect it as best as we could.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.025,
    "end": 171.075,
    "text": "But obviously, we have many, many questions that I'm looking forward to discussing with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.396,
    "end": 202.324,
    "text": " so toby thanks again for joining please lead us off with just any introduction and background that's gonna set the stage maybe how the the work came to be and that would be great so thanks again for yes great no well thanks dan and and all of you guys for hosting me and and for having the courage to read my thesis which uh as you noticed it's a kind of strange mix of things it's kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 203.124,
    "end": 224.765,
    "text": " both the research work and as i noticed um what are you saying in the in the previous stream it's at this kind of frontier of knowledge and of course it needs to be but i also because this language is so kind of unfamiliar to people and because i think it you know will prove to be very useful across the sciences um i really wanted to make",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 225.345,
    "end": 238.84,
    "text": " it kind of legible to people so you know for people to read the the thesis but also like my research and kind of understand what i was saying effectively how it came about was",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.632,
    "end": 264.072,
    "text": " i was supposed to be studying um interactions between frontal cortex and hippocampal circuits in the brain and at the sort of time of trying to get started with that um obviously i was kind of interested in the free energy principle and active inference and all of that um but i found that there was a lot of kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.215,
    "end": 283.796,
    "text": " As I've said in the thesis and as you talked about in the previous stream and probably in discussions before as well, there's a lot of kind of, each research group has its own language and these different groups, they don't necessarily talk to each other in a way that is kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 284.316,
    "end": 305.898,
    "text": " an efficient kind of communication each you know group of people is interested in their own thing and one of the things I like about the free energy principle and about active inference is that it this nice sort of general framework for adaptive systems and so it is in itself a good place to kind of situate an understanding of systems like the brain and other adaptive systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 307.349,
    "end": 324.492,
    "text": " But of course, it doesn't immediately resolve this problem of, well, the problem that was for me a kind of confusion about what's going on in these circuits and how should I understand what one person says in relationship to what another person says about this bit of the brain or this interaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 325.444,
    "end": 348.398,
    "text": " And so in the process of kind of trying to understand what was going on there and to resolve in part the confusion I had about predictive coding itself and the complexities of all of these models I was encountering, I kind of resolved to replace that confusion with another kind of confusion, which is what is all this crazy category theory stuff?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 349.438,
    "end": 371.543,
    "text": " and you know so you might think okay well that's mad what's the point of that you've just made everybody's life a lot harder it's kind of like that xkcd comic where you've got all of these different standards and you know we decide to like come together and and make a new standard and in fact this is happening i think and like i don't know what it was in in cellular biology maybe i heard john byers talking about this yesterday that you know they",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 372.748,
    "end": 391.802,
    "text": " have lots of different standards for writing down diagrams, but describing like interacting like biological processes and the kind of scientific community in that area has set up a kind of mediating body to kind of try to, you know, form like bring together all of these diagram languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 392.743,
    "end": 409.179,
    "text": " um but they weren't really able to do so so they still they instead of just coming up with one new standard they came up with three new standards to try to unify these things and the trouble you know i had or have with these different languages or different sort of syntaxes for talking about scientific things is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 410.496,
    "end": 435.252,
    "text": " not only are they all different but they're kind of all ad hoc and so the reason why i feel that there's promise in replacing this confusion of this of of so many different ideas i mean of course it's great to have this kind of ecosystem of ideas about how these complicated systems work but it's still very ad hoc and confusing and so instead of just coming up with a new ad hoc and confusing way of understanding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 436.414,
    "end": 451.485,
    "text": " these things, I was kind of hoping to use a language which is maybe kind of universal in some sense, like it's really about or it's really capturing like how we think and maybe also like how the world is actually built up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 452.365,
    "end": 466.742,
    "text": " um but in particular it seems to capture something of how we think and so you know the fundamental theorem of category theory says that you shall know a concept by the company it keeps to adapt the kind of that that sort of motto of i think um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 467.663,
    "end": 473.108,
    "text": " birth from linguistics that you should know a word by the company it keeps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 473.469,
    "end": 478.133,
    "text": "That's really like at the heart of how we come to understand things in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 478.213,
    "end": 485.179,
    "text": "And I think the maths that is category theory captures that very nicely and very precisely and at the same time enforces a kind of discipline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 485.64,
    "end": 492.146,
    "text": "And so I know it is quite like hard going reading this kind of research work, this kind of introduction to all this new stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 493.547,
    "end": 502.632,
    "text": " But in part, that's because when you're being disciplined is hard and doing things very formally, precisely does require a bit of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.088,
    "end": 507.57,
    "text": " well, you know, a lot of dedication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.071,
    "end": 519.636,
    "text": "But that isn't to say that it's not worth it or that these ideas even used a bit informally somewhere down the line might not be useful, at least to sort of frame the way we think about things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 520.756,
    "end": 533.663,
    "text": "So I hope to be, you know, some use in helping not only sort of change the confusions that we have, but also like modulate them in a kind of way that will be sort of useful for people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.351,
    "end": 541.212,
    "text": " awesome, great starting place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.972,
    "end": 546.993,
    "text": "Ali or Dean, where can we begin?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.093,
    "end": 552.875,
    "text": "How can we replace some of our prior confusions with a new and different confusion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.176,
    "end": 557.296,
    "text": "Ali, want to go first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.416,
    "end": 557.836,
    "text": "Or Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.916,
    "end": 560.137,
    "text": "Yeah, can I ask a quick question to Toby?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.177,
    "end": 567.599,
    "text": "Toby, when you were talking about when you actually saw all of these standards, so you know, you were the sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.79,
    "end": 589.295,
    "text": " what you were the you were the hub of all of these standards you saw sort of all around you can you maybe speak to the idea of what you perceived or what you sensed was the stabilizing function of those standards but also the searching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.571,
    "end": 597.194,
    "text": " Because, of course, you had gone out and realized there were all of these different standards at play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.414,
    "end": 606.317,
    "text": "I remember in a previous professional life of mine having to have chief financial officers and their math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.293,
    "end": 614.979,
    "text": " sit at the table with engineers and their math and them talking right past one another and making no sense to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.319,
    "end": 626.727,
    "text": "And I had to be kind of the medium between them so that their math would actually get a little bit sticky and they'd be actually be able to understand and interpret one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.248,
    "end": 634.613,
    "text": "In your experience with this, how did that play out, both the stabilization through the standards and the search?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.095,
    "end": 646.559,
    "text": " Well, I guess I should begin by saying that this is still ongoing, and nor am I an expert in all of these different standards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.56,
    "end": 652.002,
    "text": "But the thing that I kind of at least noticed was that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 654.591,
    "end": 666.606,
    "text": " People use languages like Bayesian inference or reinforcement learning or dynamical systems to talk about certain bits of the brain that I was interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 668.747,
    "end": 672.09,
    "text": " And they kind of just plug all these ideas together, and it's fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 672.63,
    "end": 676.774,
    "text": "So you want to write a paper, and it's about a particular phenomenon, and it's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.814,
    "end": 683.879,
    "text": "You maybe come up with some nice model, and you put people in MRI scanners, and the quantities in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 685.345,
    "end": 688.386,
    "text": " in the sort of bold signal correspond to quantities in your model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 688.446,
    "end": 689.407,
    "text": "And that's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 689.447,
    "end": 691.388,
    "text": "It says that maybe this bit of the brain is doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.428,
    "end": 702.092,
    "text": "I mean, we can argue about MRI at some other time, but it doesn't really tell you about how that little model you've got interacts with the rest of the brain or the rest of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 702.152,
    "end": 707.435,
    "text": "And so if you care about like this whole complicated thing, you want to know how do these parts actually talk to each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.045,
    "end": 715.652,
    "text": " And so I was just fortunate at the beginning of this, in some sense, to be in the right place at the right time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 715.732,
    "end": 722.679,
    "text": "So I knew there were these different ingredients all being put into these different models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 724.551,
    "end": 738.721,
    "text": " only you know i'm only sort of familiar with some of them but i could still see that they had some similar structure and that was in part because i've been going to you know some applied category theory meetings or talks and seen that say um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.217,
    "end": 754.087,
    "text": " economic games which are very closely related to reinforcement learning have this kind of bi-directional structure where an agent tries to sort of effectively in some sense choose they make an observation and they sort of do this kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 755.011,
    "end": 764.835,
    "text": " forwards projecting kind of thing of choosing an action at the same time as saying, okay, well, if supposing I take this action, like what would the payoff be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.475,
    "end": 767.516,
    "text": "And that's this kind of backwards facing thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 768.216,
    "end": 782.102,
    "text": "And then you can sort of chain that process and think, well, if I do this in multiple stages, like how does the utility I get at the end of this, you know, multi-stage process, like feed back to the utility I'm going to get having taken just one step right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 783.388,
    "end": 809.085,
    "text": " And that's a similar sort of bi-directional thing to what happens in predictive coding specifically, where a little circuit is saying, OK, well, given my high-level beliefs about what's causing this sensory data, I need to sort of retrofit the actual sensory data to kind of come up with a new belief about what those causes are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.069,
    "end": 812.716,
    "text": " And so that seemed to me to have the same kind of structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 814.012,
    "end": 828.303,
    "text": " A similar thing also happens in backprop in machine learning, where you have, say, some neural network and it kind of, you know, you feed forward some information through the network and it, say, does a classification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 829.044,
    "end": 838.631,
    "text": "And then you have some training system which says, okay, well, actually you have this error and then you need to sort of backpropagate that to update, you know, say, some part of the model on the basis of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.651,
    "end": 841.053,
    "text": "And so that also has this kind of bidirectional structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.434,
    "end": 848.898,
    "text": " And it just was fortunate that at this time people were talking a lot about these kind of bi-directional processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.958,
    "end": 856.401,
    "text": "And so I was thinking about these things at the same time I was kind of thinking about the application of Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.461,
    "end": 862.244,
    "text": "And I kind of noticed that they had the same structure and I kind of wanted to figure out what was going on there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 863.185,
    "end": 864.746,
    "text": "Like really sort of pinned down",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.867,
    "end": 874.171,
    "text": " what it was that made like this kind of predictive coding circuit have this kind of shape in some sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.049,
    "end": 886.957,
    "text": " Because as I think you've also talked about, and as I kind of mentioned a few minutes ago, that individual predictive coding circuit isn't an isolated system, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 887.017,
    "end": 889.239,
    "text": "It's part of like this hierarchical thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.559,
    "end": 902.108,
    "text": "And so you have one little circuit connected to another circuit, and that whole conglomeration of circuitry is supposed to do something quite grand, but at the same time, it's made of smaller parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.73,
    "end": 928.566,
    "text": " And one of the major confusions I had at the beginning was, okay, so you have this big generative model with lots and lots of factors and you go through it and you try to derive the differential equations that give you the sort of predictive coding dynamics by saying, okay, well, we're going to minimize the free energy and you have this complicated thing with lots of sums in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 929.46,
    "end": 945.704,
    "text": " it seems like very intimidating to try to like come up with that differential equation, even though actually when you sort of look at this, the kind of look at the process that you're doing is quite kind of mechanical because effectively you're doing the same transformation to each factor of this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.82,
    "end": 952.884,
    "text": " And so that also hinted that there was this kind of compositionality thing going on in these systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.424,
    "end": 961.589,
    "text": "Not only do you see that this bit of the brain has this kind of modularity, but you also get a sense of that modularity in that derivation you're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 963.15,
    "end": 965.492,
    "text": "And so what I wanted to do was to capture both of these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 965.692,
    "end": 975.759,
    "text": "One is the kind of shape of the circuitry, and the other is how to somehow save the effort of having to kind of re-derive everything for each different case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 976.676,
    "end": 989.185,
    "text": " And that kind of formalization of this process corresponds to a kind of functoriality you get when effectively the functoriality means you preserve compositional structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 989.205,
    "end": 1001.695,
    "text": "And so what you want to do is you want to say, okay, well, what's the compositional structure of the thing that the functor starts with, like the process starts with, and that's the compositional structure of Bayesian inference itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1002.628,
    "end": 1008.493,
    "text": " And then you want to say, OK, well, what's the compositional structure of the kind of dynamical systems, which is the thing you're trying to get to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.633,
    "end": 1012.016,
    "text": "And how do you map from one to the other in a way that preserves that structure?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.756,
    "end": 1019.362,
    "text": "And so that's kind of what I was doing in this thesis is just saying, OK, well, what are the structures I need and how do I relate them?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1021.437,
    "end": 1023.477,
    "text": " And it turned out that there were a lot of details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1024.018,
    "end": 1025.018,
    "text": "I had to write them all down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1026.158,
    "end": 1029.659,
    "text": "But the kind of basic idea, I hope, is quite simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1029.739,
    "end": 1039.221,
    "text": "It's just trying to say, what are the kind of individual components, like the kind of LEGO blocks, and how do they connect together?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.201,
    "end": 1049.883,
    "text": "And how can I sort of relate the kind of LEGO blocks of one thing with the LEGO blocks of another in a way that kind of preserves the shapes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.202,
    "end": 1059.188,
    "text": " And so, yeah, it's kind of this kind of mammoth thing, but the kind of fundamental idea is quite simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1059.468,
    "end": 1068.435,
    "text": "And I think it's kind of like how when, if you're like programming a computer, you can write in a high level language or you can write in like low level language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.475,
    "end": 1072.058,
    "text": "And if you wanted to, you could write in assembly language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.51,
    "end": 1085.38,
    "text": " And category theory is like a language where you start with the kind of assembly language and you build up a high level language within the language itself in some sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.3,
    "end": 1102.454,
    "text": " And so if you really want to start with that at the very beginning, like I did with the definition of category and then build up to this big thing, you have to make a lot of steps because like assembly language is really simple and it's, you know, it's just like single instructions that your processor does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.494,
    "end": 1107.019,
    "text": "And so getting all the way to something like zoom that can do a video call is quite complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1107.039,
    "end": 1109.14,
    "text": "And so people don't, they start with the high level language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.941,
    "end": 1130.662,
    "text": " but the thing that people strive for in designing high level languages is to set them up in such a way that they're sort of that the abstractions are quite nice or sort of modular and so that's what i'm trying to do with using category theory is to kind of find abstractions that are modular in a similar kind of way and i know um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1132.233,
    "end": 1161.754,
    "text": " the previous call um dan you mentioned um the the kind of analogy between like typing in this category theoretic sense and in the programming sense and they're quite similar the category theory sense is kind of a much sort of more general bigger idea it has a lot it sort of encompasses all kinds of things um but you could imagine somewhere down the line having a programming language and that you know people are trying to build these things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.298,
    "end": 1166.504,
    "text": " but having a programming language where you could express anything you could in category theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.564,
    "end": 1169.908,
    "text": "And I, to be honest, find it quite intense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1170.845,
    "end": 1172.726,
    "text": " And quite sometimes mechanical and tedious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.746,
    "end": 1183.732,
    "text": "I had to prove that certain categorical structure satisfies the coherence conditions that it has to satisfy, like, you know, lax associativity or monoidality or something like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.752,
    "end": 1187.534,
    "text": "There are a lot of like diagrams that you have to check commute or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.594,
    "end": 1192.077,
    "text": "And much of the time that checking is quite tedious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.797,
    "end": 1203.359,
    "text": " And someday I hope that we'll have tools that we can say, OK, well, I'm going to spell out what my structure is and the tool will just check that it satisfies all the axioms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1203.419,
    "end": 1211.54,
    "text": "And so, you know, I know you guys have to wade through a lot of that stuff in the thesis, but it's kind of manually necessary right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.7,
    "end": 1212.841,
    "text": "But in the future, it might not be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.861,
    "end": 1217.141,
    "text": "And then we can use this high level language in a much more kind of liberal way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.501,
    "end": 1218.422,
    "text": "I hope that'll be great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1218.442,
    "end": 1220.342,
    "text": "Sorry, I've been waffling on for ages, so I'll stop there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.301,
    "end": 1223.802,
    "text": " Awesome, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.482,
    "end": 1226.783,
    "text": "I'll go to a question in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.463,
    "end": 1233.046,
    "text": "Mark wrote, applied category theory and active inference have tremendous promise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.666,
    "end": 1235.847,
    "text": "I confess I have not yet read this dissertation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.387,
    "end": 1240.549,
    "text": "It would be helpful to describe a specific engineering application for the work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.41,
    "end": 1248.213,
    "text": "So what do you see as proximate and or distal engineering applications here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.595,
    "end": 1279.24,
    "text": " So one of the things that I hope could be produced soon as an engineering application is a sort of general modeling framework for building kind of complicated active inference systems that might include lots of parts, lots of, you know, agents, um, kind of like, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1281.417,
    "end": 1292.512,
    "text": " Something that my colleague Jules Hedges wants in cybernetics more generally, something like a kind of programming language maybe that incorporates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.017,
    "end": 1306.368,
    "text": " All of these kind of strange cybernetic structures I mentioned earlier, like reinforcement learning and like back prop in machine learning and Bayesian inference, they all have this kind of bidirectionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.408,
    "end": 1314.056,
    "text": "And so you should be able to have this kind of modeling environment which allows you to incorporate all of these things in a kind of nice way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.67,
    "end": 1332.82,
    "text": " But I think before we get something quite as grand as a whole new sort of modeling environment, I think just having tools to help us build approximate and active inference systems that are really nicely compositional is one thing that I hope to come out of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1333.949,
    "end": 1340.174,
    "text": " To be honest, I don't know very well what the general tooling is like for this kind of thing right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.274,
    "end": 1349.121,
    "text": "I know that there's SPM, I know that there's like PyMDP for certain kinds of problem, but I don't know how some general they are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1351.042,
    "end": 1351.583,
    "text": "Another thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.412,
    "end": 1378.496,
    "text": " that you would get if you have this kind of toolkit because of the kind of modularity of category theory is you should be able to plug it into other things that exist already so one of the things that's particularly of interest to me at the moment is kind of multi-agent systems and sort of building trying to understand how we could build something like or simulate things like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1379.932,
    "end": 1394.092,
    "text": " something like a corporation or some kind of society structure where you've got lots of active inference agents coming together to pursue a sort of common shared goal, how can you kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1395.325,
    "end": 1418.608,
    "text": " effectively distribute that goal sharing across systems they could be like little robotic systems say or something like that or agent or like I don't know if it's precisely I'm kind of like an abstract thinker but I think like being able to kind of control or like modulate the performance of these kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.816,
    "end": 1426.361,
    "text": " distributed multi-agent like active imprint systems might be quite a cool thing to be able to build.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.381,
    "end": 1435.348,
    "text": "So that's kind of like a kind of maybe sort of flavor of the kind of thing that this tooling gives you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.049,
    "end": 1440.152,
    "text": "I suppose for me, this particular work was really about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.957,
    "end": 1448.599,
    "text": " trying to encourage people to use this language to understand things more clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1450.959,
    "end": 1455.9,
    "text": "So, yeah, there's a lot of stuff that I hope we can understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1455.94,
    "end": 1457.881,
    "text": "Well, at least I can understand more clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.521,
    "end": 1459.761,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1462.762,
    "end": 1463.082,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.202,
    "end": 1463.562,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.762,
    "end": 1463.982,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1466.943,
    "end": 1467.303,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.983,
    "end": 1468.203,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.403,
    "end": 1471.524,
    "text": "So in this paper by Christoph",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.872,
    "end": 1477.475,
    "text": " Wojtowicz, Are There Category Theoretical Explanations of Physical Phenomena?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.575,
    "end": 1489.26,
    "text": "He argues that category theory by itself does not and cannot provide any mathematical explanations for physical phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.469,
    "end": 1504.574,
    "text": " So the idea here is that category theory is merely a meta theory to kind of do a kind of bookkeeping or house holding of the physical theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.815,
    "end": 1511.077,
    "text": "And it's not a tool to construct the mathematical theory of physical phenomena itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1512.706,
    "end": 1530.531,
    "text": " I'm not sure I agree with this argument entirely because in one sense, some of the most profound aha moments in the history of science obviously results from looking at a pre-existing theory or a model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.138,
    "end": 1544.961,
    "text": " from a novel angle and I believe category theory can provide such novel perspectives even when looking at some established and pre-existing models of theories so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.186,
    "end": 1549.749,
    "text": " I'm curious to know your opinion about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1549.829,
    "end": 1565.864,
    "text": "So do you think category theory can actually provide mathematical explanations for, I mean, either in cognitive science, neuroscience, or even other areas, other scientific disciplines as well?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.819,
    "end": 1570.061,
    "text": " I think it's a it's a subtle question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.781,
    "end": 1577.046,
    "text": "Right now, it's probably largely the case that the role of category theory is kind of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.806,
    "end": 1589.415,
    "text": "I'm not I think it's like like bookkeeping, but like clarification to bookkeeping, if you think of it as a very general way of like trying to account for the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1590.356,
    "end": 1595.123,
    "text": " the things you're thinking about very precisely and not sort of miss details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.183,
    "end": 1599.129,
    "text": "Like if your books don't balance, you kind of miss some payment or some debt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1600.051,
    "end": 1601.473,
    "text": "I think that's quite a nice analogy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1602.755,
    "end": 1604.638,
    "text": "But I think one of the goals of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.95,
    "end": 1623.977,
    "text": " quite a lot of people, or not maybe, I mean, a fair chunk of the community, particularly that which comes from a sort of more abstract mathematical side of category theory, one of their goals is to try to recast",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1625.14,
    "end": 1630.985,
    "text": " a lot of how we think in kind of purely categorical language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.165,
    "end": 1645.878,
    "text": "So one of the things that category theory allows us to do is to kind of formalize, in some sense, patterns that crop up all over the place using the notion of universal construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.939,
    "end": 1652.063,
    "text": "And the thing about universal constructions is that you have like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1653.188,
    "end": 1654.229,
    "text": " some little pattern.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1654.369,
    "end": 1665.297,
    "text": "And if you know that you can instantiate that pattern in your category, that you have like some object which kind of captures the essence of that pattern.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1665.617,
    "end": 1672.623,
    "text": "And you don't need to say, be able to kind of write down all of the specifics of that object",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1673.621,
    "end": 1679.023,
    "text": " sort of a priori because the kind of universality gives you a recipe for constructing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1679.063,
    "end": 1682.385,
    "text": "It gives you it in some sort of unique way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.405,
    "end": 1688.027,
    "text": "And so you know that if you have this universality, you can always like access this object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1688.067,
    "end": 1690.148,
    "text": "And yeah, so I'm talking very generally",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1690.888,
    "end": 1711.301,
    "text": " But because of that, one thing that people try to do is to try to say, OK, well, we've got these things that we're interested in, in, say, physics, like the principle of least action or the nature of space-time or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1712.892,
    "end": 1735.97,
    "text": " can we express those things as kind of universal constructions um or for instance in a completely different realm like we might have some process which is something we're interested in on the computer like um the migration of data and databases can we write that down in a way that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1736.809,
    "end": 1739.21,
    "text": " doesn't have any kind of ad hoc ingredients.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1739.29,
    "end": 1742.971,
    "text": "It only is built from universal constructions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.631,
    "end": 1757.314,
    "text": "These are things that we can just write down kind of abstract sort of axioms in the language of category theory, and that kind of gives us the process or the structure that we want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.434,
    "end": 1765.496,
    "text": "This kind of line of work is often called like synthetic something, like synthetic, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1767.284,
    "end": 1773.126,
    "text": " probability theory or synthetic physics or synthetic topology or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.146,
    "end": 1778.969,
    "text": "And it means you sort of start from these kinds of very high level categorical ideas",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1780.37,
    "end": 1784.514,
    "text": " And then you sort of end up with a characterization of the essence of the thing you're interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1785.014,
    "end": 1801.008,
    "text": "In physics, a kind of a simple example of this, which I supply in a kind of relatively feeble efforts to say that it's not true that category theory doesn't give you a characterization of things in physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.949,
    "end": 1811.175,
    "text": " So there is a category of, say, topological spaces, and the morphisms between them are continuous functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1812.836,
    "end": 1819.561,
    "text": "And there's a category of sets, and the morphisms between the sets are functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1820.821,
    "end": 1824.304,
    "text": "And of course, underlying every continuous function is a plane function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1825.219,
    "end": 1838.805,
    "text": " And so there is a functor from the category of topological spaces to the category of sets, which just forgets the topological structure of the spaces because every topological space has an underlying set of points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.965,
    "end": 1841.326,
    "text": "So you have this forgetful functor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1842.332,
    "end": 1844.673,
    "text": " And this forgetful functor has two adjoints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1845.033,
    "end": 1852.195,
    "text": "And one of the things the category theory teaches you is that adjunctions give you this universality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.315,
    "end": 1861.238,
    "text": "So adjoint functors are characterized uniquely by the satisfaction of this adjunction property.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1862.778,
    "end": 1867.52,
    "text": "So these two adjoints to this forgetful functor, one gives you what are called",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1869.008,
    "end": 1870.05,
    "text": " discrete spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.651,
    "end": 1877.481,
    "text": "So if you take a set, you can turn it into a topological space by thinking of all the points as little islands in this space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1877.521,
    "end": 1879.464,
    "text": "So there's no like connectivity between them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1880.726,
    "end": 1883.531,
    "text": "And that's called a kind of discrete space on that set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1884.775,
    "end": 1896.288,
    "text": " And the other adjoint functor gives you what's called the indiscrete or sometimes co-discrete space, where all of the points are sort of collected into one big island.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1896.808,
    "end": 1899.832,
    "text": "So they're all sort of connected together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1900.012,
    "end": 1901.794,
    "text": "So it's like a sort of fully connected graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1903.601,
    "end": 1905.823,
    "text": " And of course, that's very different from the discrete space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1906.024,
    "end": 1915.093,
    "text": "And it's different from like the space time or the space that you live in, which has a particular kind of connectivity, like you can't walk through walls.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.429,
    "end": 1944.81,
    "text": " um and so you know people try to use these things particularly use adjunctions to characterize things like properties of spaces another thing that comes out of a jointness um and this is something that i um can let you read about uh later because it'll take me the rest of the talk to try to explain um but the you you might be familiar from logic that you have these quantifiers you have existential and universal quantifiers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1946.458,
    "end": 1948.159,
    "text": " And you can do things with these quantifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.199,
    "end": 1951.2,
    "text": "Like you can say, you can sort of compose them together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.36,
    "end": 1955.042,
    "text": "So you get things like for all X there exists a Y such that this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.882,
    "end": 1964.965,
    "text": "And you can think sometimes of these composites or these compositions of quantifiers as like maybe like modal operators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.025,
    "end": 1974.069,
    "text": "Like you can sort of decompose necessity and possibility in terms of the compositions of logical quantifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.401,
    "end": 1980.382,
    "text": " But the kind of weird thing about quantifiers is that they too arise out of an adjunction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1981.822,
    "end": 1986.783,
    "text": "It's kind of like they are left and right adjoints to substitution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1987.023,
    "end": 1991.164,
    "text": "So if you have a proposition, you can substitute a term into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.204,
    "end": 1994.864,
    "text": "And the adjoint functors to substitution give you the quantifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.645,
    "end": 1997.445,
    "text": "And you can sort of take this another step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1997.485,
    "end": 2000.966,
    "text": "And then you can think about composing these adjoint functors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.046,
    "end": 2003.506,
    "text": "And those give you the modal operators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2005.117,
    "end": 2011.0,
    "text": " And so that's something that comes just out of category theory, but is really sort of fundamental in sort of logic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.08,
    "end": 2023.046,
    "text": "And we might think that there's a kind of close relationship between physics and computation or physics and logic or physics and information and information and computation and logic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.246,
    "end": 2029.83,
    "text": "So I think it's not quite true that there's nothing to be gained from thinking about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2031.076,
    "end": 2054.219,
    "text": " of traditional mathematical things uh or traditional physical things using category theory in some sense they you know doing that really clarifies the essence of them um because it tells you what their kind of universal properties are and you can then like instantiate those things in different contexts so one of the things that you could do is start to think about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2055.362,
    "end": 2079.682,
    "text": " these kind of logical structures in different contexts and that's kind of like what type theory is all about and you could use it to think about the logic of like dynamical systems or you could use it to try to characterize um say like the universal property even of the free energy principle and that's something i like to think about sometimes like how can we think about active inference systems as like trying to achieve their goals",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2080.788,
    "end": 2088.671,
    "text": " Is that related to these adjunctions that come up in the foundations of logic when you look at them categorically?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2088.691,
    "end": 2097.035,
    "text": "And if it is, then that's quite profound because it tells you that maybe the FEP does have this kind of universality that people want to claim it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2098.936,
    "end": 2103.277,
    "text": "So I think it is true that right now, because it's quite early days,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2106.257,
    "end": 2119.752,
    "text": " category theory is kind of mostly used for bookkeeping, but I guess that might be because quite a lot of bookkeeping to do before we can make the most of this kind of move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2121.036,
    "end": 2124.217,
    "text": " of make the most of using these kind of universal structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.337,
    "end": 2141.184,
    "text": "And maybe one day further in the future where people are more familiar with this kind of language and we have this big library of categorical tools and our computer modeling environments and programming languages know how to import stuff from this category just really easily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.352,
    "end": 2145.494,
    "text": " And so you don't have to do all this kind of tedious manual stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.554,
    "end": 2158.944,
    "text": "Maybe like in the future, in that future, it'll be much more common just to say, okay, well, we're going to start to model things using these universal properties, you know, off the bat, rather than trying to sort of retrofit them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2163.587,
    "end": 2163.927,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.008,
    "end": 2164.728,
    "text": "Thank you, Toby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.268,
    "end": 2168.05,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.09,
    "end": 2168.311,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.491,
    "end": 2170.973,
    "text": "Thank you so much for your detailed answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.133,
    "end": 2171.493,
    "text": "And, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.345,
    "end": 2174.646,
    "text": " Again, I have a follow-up question to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.106,
    "end": 2196.575,
    "text": "So there's this view in philosophy of science that views scientific theories as not as a kind of monolithic, I mean, phenomena or model, but rather any given scientific theory can be viewed as a population of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2196.635,
    "end": 2200.676,
    "text": "So some of those models are more fundamental than the others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.301,
    "end": 2211.946,
    "text": " or in terms of Manuel de Landa, there are virtual and actual parts of any given scientific model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.307,
    "end": 2219.631,
    "text": "So the idea here is that the actual parts of scientific models try to capture",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2220.371,
    "end": 2236.703,
    "text": " the context-dependent behavior of phenomena or any physical system but on the other hand the virtual or more fundamental part of scientific models or theories try to somehow capture its more abstract and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.604,
    "end": 2245.466,
    "text": " abstract model of the phenomena in terms of its topological invariance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2246.306,
    "end": 2255.869,
    "text": "So do you think category theory can provide a rigorous language to somehow unify this view of science?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.709,
    "end": 2267.092,
    "text": "I mean, and to see how exactly those context-dependent part of scientific theories fit or at least",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.732,
    "end": 2276.799,
    "text": " can be compatible with the context-independent part of scientific theories or the virtual part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.699,
    "end": 2295.272,
    "text": "Because, you see, in the context-dependent or actual models, scientists usually try to refine their models to fit the data as close as possible or at least approximately close enough to be useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.052,
    "end": 2323.431,
    "text": " But for the more fundamental parts comprising of principles, axioms and so on, they only try to capture the topological terrain or the topological invariance of the models and how models can be compared in terms of their singularities and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.517,
    "end": 2325.458,
    "text": " topological shapes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.119,
    "end": 2329.82,
    "text": "Yeah, that does sound very familiar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2329.84,
    "end": 2340.166,
    "text": "I don't know this kind of work or idea in any... I haven't come across this before, but it does sound something that would be quite amenable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2340.306,
    "end": 2350.612,
    "text": "And in fact, there seems to be, at least in my mind, some alignment between this kind of sense of virtual that you're talking about and this kind of universality that I was talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.355,
    "end": 2362.343,
    "text": " So you could think of a category of models of particular kinds as being inhabited by all of those things which satisfy these invariants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2362.383,
    "end": 2371.87,
    "text": "And then you have different individual instances of these things, which would be like the objects of the category and then the differences between them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2372.671,
    "end": 2390.258,
    "text": " other you know the morphisms and the thing about morphisms in the category is that often they are the things which preserve the structure uh in other bits of mathematics they're called homomorphisms and that's where the word morphism comes from and so you could think of those as you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.647,
    "end": 2404.198,
    "text": " ways of comparing the models or translating the models from one to the other um but preserving those invariants yeah and so that that seems to me to capture some of the idea that you were sketching",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.96,
    "end": 2416.666,
    "text": " I guess one thing which may or may not be useful, depending on how you look at it, the category theory gives you is it's obviously kind of a lot more general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.306,
    "end": 2423.349,
    "text": "And so it allows you to talk about invariance of kinds that are more than just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2425.985,
    "end": 2449.365,
    "text": " excuse me um more than just topological um in some sense like functoriality is a kind of um in like it kind of captures the kind of invariance as well and say okay well we preserve this structure um each I mean just one way of like looking at a topological space is to take its um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.876,
    "end": 2452.237,
    "text": " it's what's called its nerve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.517,
    "end": 2459.563,
    "text": "And so that, that takes a topological space, and turns it into a category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2460.885,
    "end": 2473.015,
    "text": "And you can sort of think of the morphisms in that category as like the sort of like the paths in that space, or ways to sort of get from one sort of part of the space to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2473.035,
    "end": 2475.957,
    "text": "And then, you know, morphisms",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2477.074,
    "end": 2501.692,
    "text": " uh functors between topological spaces considered in categories like that they really are just things that preserve those topological structures um and so so you like this this language kind of seems to encompass the kinds of things you're saying um yeah yeah it would be nice yeah I I would love somebody to make that connection",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2503.473,
    "end": 2510.096,
    "text": " I'll just follow up on this and then Dean, it's a related comment from Roman in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.357,
    "end": 2524.384,
    "text": "Roman wrote, quoted you in this fractal quote streaming, thinking about the FEP through category theory and relation to goals maybe allows to prove that FEP has the universality that people claim it has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.848,
    "end": 2539.762,
    "text": " roman asks didn't maxwell ramsted and dalton's activity already kind of proved this in the bayesian mechanics physics of and by belief work so you're talking about the role of generalization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.741,
    "end": 2555.796,
    "text": " What do we gain with the category theorification of FEP beyond, for example, the generalizations that we've seen in Bayesian mechanics and G-theory over the last year?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.816,
    "end": 2561.362,
    "text": "Yeah, that's a great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.382,
    "end": 2562.023,
    "text": "I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.238,
    "end": 2588.527,
    "text": " maxwell and dalton are doing a great job um formalizing the ideas of bayesian mechanics but as far as i'm aware the job isn't done yet um and so i haven't yet seen you know i mean i have a particular aesthetic right and i would like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2589.545,
    "end": 2602.3,
    "text": " I would like to see a really clear recipe of a way to take of like on the one hand, some like or like some machine that takes in that has like a particular shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.7,
    "end": 2608.207,
    "text": "It's like input shape and it takes in like a dynamical system of a particular kind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.487,
    "end": 2609.328,
    "text": "And it gives me back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2611.02,
    "end": 2617.225,
    "text": " like the specification of an inference problem that that dynamical system is solving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.306,
    "end": 2621.489,
    "text": "I think that's what Bayesian mechanics is saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.549,
    "end": 2635.401,
    "text": "It's saying, okay, well, if we have a dynamical system that is somehow kind of, you could sort of look at it and say it has a boundary, it's a Markov blanket,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2637.609,
    "end": 2646.74,
    "text": " that you can write down its dynamics as if it were doing free energy minimization, that is solving some inference problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2650.595,
    "end": 2671.451,
    "text": " but there's a lot of and i so i think that statement is true for certain classes of dynamical systems but it's not i don't think the story has been made like like the questions for me are like what are the classes um and what are their what's the essence of those dynamical systems so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.472,
    "end": 2697.649,
    "text": " it the result might depend on like specific technical criteria which maybe you think okay well like that that's kind of like a distraction from this kind of abstract principle which we're trying to get at and so it would be nice to sort of know what the actual like essence is of the problem that allows us to do this translation and then you know there seem to be to be like questions of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2698.956,
    "end": 2704.22,
    "text": " I mean, other fairly technical questions, but questions about things like, well, what is this boundary thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.7,
    "end": 2706.161,
    "text": "Like, how long does it persist?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.221,
    "end": 2710.905,
    "text": "And what does it mean to separate a thing off and consider it as having a boundary?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.087,
    "end": 2722.013,
    "text": "Most of the treatments I've seen of this idea have not been done, have not been explained or expressed in this compositional way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.393,
    "end": 2728.318,
    "text": "And so they just assume you're given a system and a boundary, and then that's kind of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.642,
    "end": 2754.247,
    "text": " um but you know boundaries come in all kinds of shapes um like the boundaries of the cells in my body are kind of all like glued together in a particular way and they form me and i also have a boundary um and so how do the kind of local inference problems that are being solved by those individual cells",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.546,
    "end": 2761.33,
    "text": " given their gluing, amount to the kind of inference problem that my whole body is solving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.352,
    "end": 2768.255,
    "text": "And I don't think an answer to that is anywhere near given right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2769.196,
    "end": 2781.185,
    "text": "And yet, obviously, we look at systems out in the world, and they all seem to display this property of re-energy minimization, or at least something that looks a lot like it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.072,
    "end": 2791.335,
    "text": " And so it would be nice to be able to relate those kind of inference problems to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.656,
    "end": 2795.637,
    "text": "So I think there's still a lot to be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.897,
    "end": 2801.799,
    "text": "Just because we've kind of made some first steps doesn't mean that we're all of the way there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2802.339,
    "end": 2811.363,
    "text": "Obviously, given my aesthetics, what I would love to see is this kind of abstract characterization of this universality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2812.658,
    "end": 2837.443,
    "text": " um and i think i yeah i think there's a way of stating or at least the structure of that universal property um using this compositional active inference language of which the thesis is apart but effectively it seems to be something like this adjoint thing that i was talking about earlier so you on the one hand you have a like a something like a functor that takes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2838.806,
    "end": 2863.784,
    "text": " um statistical problems and gives you dynamical systems that kind of solve those inference problems and so that's a function from like you know statistical yeah what I call statistical games into dynamical systems of some kind but of course you have lots of dynamical systems and so you know what this um Bayesian mechanics idea seems to be saying is that you can go the other way as well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2865.598,
    "end": 2869.701,
    "text": " And maybe this mapping in the other direction is also functorial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.122,
    "end": 2886.715,
    "text": "And that would be a way of characterizing this kind of gluing together of dynamical systems like I was talking about cells and ending up with maybe dynamical statistical games that also have this kind of gluing property.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2889.257,
    "end": 2892.74,
    "text": "But there's still a fair amount of work to be done",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.119,
    "end": 2899.522,
    "text": " even to get the basic framework to spell out that story precisely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.583,
    "end": 2903.805,
    "text": "It's work that I'm trying to slowly get on with at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.086,
    "end": 2917.693,
    "text": "But I think the ingredients to doing this in the kind of generality that I would like is starting to become clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2918.954,
    "end": 2920.175,
    "text": "And so hopefully we get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.875,
    "end": 2922.016,
    "text": "But I don't think it's sold yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.627,
    "end": 2952.456,
    "text": " awesome yes just so cool to see all these paths weaving together dean i i think it's awesome toby that you in this conversation have kind of anti-captured a jointness and common jointness because i think that's a huge part of of your work here and and reading it so here's my here's my question i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.849,
    "end": 2961.313,
    "text": " I think, and I would like you to maybe comment on this as though you were explaining it to a very curious 15 year old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.113,
    "end": 2976.581,
    "text": "So on the sort of most basic level, when I hear under sort of a common adjointness principle, the word bookkeeping, I immediately wonder, okay, so what is the partner?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.621,
    "end": 2979.062,
    "text": "What's the thing that's being glued to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.243,
    "end": 2982.324,
    "text": "To use your metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.464,
    "end": 2982.764,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.045,
    "end": 2994.008,
    "text": " I would glue it to taking receipts, essentially, where you have a stabilization of a record under bookkeeping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.768,
    "end": 2996.048,
    "text": "So I get that part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.448,
    "end": 3012.873,
    "text": "And then the taking receipts is the stabilization of the change function, right, the exchange, something that we receive, those two things seem to kind of work together, which then allows for compositionality, and all that other stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.893,
    "end": 3013.333,
    "text": "But maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.404,
    "end": 3029.37,
    "text": " I wonder if maybe you could kind of speak to this idea that something is presented to us, and then what the category theory does is allow us to now start working with, so where does this fit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.47,
    "end": 3040.194,
    "text": "Does this fit under this superordinate of being a tool, or does it fit under this column directly adjacent as a rule?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.234,
    "end": 3041.955,
    "text": "Like, that's the part where...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.884,
    "end": 3053.166,
    "text": " I think the adjointness could be really, really helpful in terms of maybe helping people see the applicability and not just the abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.346,
    "end": 3056.627,
    "text": "What's your thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.048,
    "end": 3067.07,
    "text": "So I think David Spivak talks about category theory as being like a kind of accounting system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.497,
    "end": 3073.739,
    "text": " or accounting systems plural for mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3074.479,
    "end": 3076.34,
    "text": "And I think he's kind of quite right there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3076.42,
    "end": 3089.505,
    "text": "So the way I see it is like when you're keeping books, particularly if you're sort of using like this double entry system,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3090.584,
    "end": 3113.781,
    "text": " trying to keep track of the stuff that kind of flows into and out of your account uh your company or whatever it is um without sort of missing some bits you see where everything goes and so that's how i think of this kind of mathematical language you have this stuff",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3115.047,
    "end": 3134.896,
    "text": " um and it's kind of like some like abstract collection of things some like maybe mathematical ideas and well a functor takes that stuff and does something with it and turns it into some stuff of another kind um but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.465,
    "end": 3165.877,
    "text": " it's like this kind of double entry idea that you know when you take something out of here you have to put it in here and so you have to sort of keep track of all the details at least all of the details that are relevant to those two to that float i suppose and so when you have an injunction you have a way of going from one place to another and back again without losing track of some stuff",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.077,
    "end": 3176.639,
    "text": " It's like a little bit kind of like you're allowed to lose track of some stuff, but you know the stuff you've lost track of because you don't care about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3177.279,
    "end": 3189.322,
    "text": "Like, you know, you might allow for some, you know, have some like buffer there, but you know how big your buffer is or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3191.021,
    "end": 3214.536,
    "text": " So more precisely, an adjunction is a way to map from one category to another and back again in such a way that the two mappings are kind of like ideal approximations of the inverse of each other and that you can sort of measure the difference between them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3216.457,
    "end": 3240.699,
    "text": " um they sort of like give you it gives you like an isomorphism of between the two sets of morphisms of some kind and that that kind of gives you this nice kind of structure preservation property this kind of bookkeeping property um i don't i mean so i know that there are people out there um who have used um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3242.813,
    "end": 3266.563,
    "text": " category theory to model stock flow diagrams and so these are used in economics to measure you know flows of stocks and things like that but they also use an epidemiology to model you know the transmission of disease because that's also like um a flow of some stock you have people moving around um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3269.281,
    "end": 3278.21,
    "text": " And so it would be nice to sort of bring this idea full circle and have this mathematical language of bookkeeping actually applied to bookkeeping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.271,
    "end": 3282.234,
    "text": "But I don't know how that would go just yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.736,
    "end": 3291.083,
    "text": "But if we think of economies and corporations as adaptive systems,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.31,
    "end": 3318.02,
    "text": " or if we somehow kind of translate from flows of money to like flows of information that there does seem to be like an analogy between that kind of flow and the kind of flows that we think of in active inference explicitly um and you know another thing yeah one of the things I like about category theory is it allows us to make these analogies in a precise way and so maybe we can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.268,
    "end": 3320.95,
    "text": " relate these two things quite clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.091,
    "end": 3323.714,
    "text": "I mean, it's yet to be done, but I would love to see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3323.734,
    "end": 3327.338,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.181,
    "end": 3333.326,
    "text": "Dean smiles when his keywords are buzzed during a response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.458,
    "end": 3355.028,
    "text": " We'll go to another great question in the chat from Matt N. Matt wrote, can you provide some ideas about the next necessary steps or milestones for categorical theory to be effectively utilized across research and in subsequent engineering applications?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.829,
    "end": 3358.03,
    "text": "And I'll just kind of append to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.59,
    "end": 3363.733,
    "text": "What do you think at the individual team and organizational scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.066,
    "end": 3365.966,
    "text": " What can we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.307,
    "end": 3373.07,
    "text": "What milestones exist to realize some of these engineering applications and implications that you brought up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.331,
    "end": 3375.612,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3375.632,
    "end": 3387.478,
    "text": "So I think the main thing, possibly, unfortunately, for you guys who spent a lot of time reading the details I wrote, is to kind of have this community involved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3388.615,
    "end": 3413.44,
    "text": " develop to a stage where the tools that I mentioned that allow us to kind of use these category theoretic concepts fluently without having to know all of those like boring and complicated details, to develop those to a stage where people are actually able to use them without being kind of like mathematicians or category theory domain experts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3414.702,
    "end": 3436.802,
    "text": " um so this is I think starting to happen I guess you know as a result of the kind of needs of the pandemic people have developed these tools for epidemiology I mentioned this stock flows stuff and I think you know you can probably there's like some I can't remember what it's called unfortunately now um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3438.095,
    "end": 3446.963,
    "text": " So in the Julia programming language, there's this great framework to use for kind of building system using category theory concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.324,
    "end": 3452.608,
    "text": "But of course, this doesn't satisfy the property of not having to be a category theory domain expert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3452.668,
    "end": 3457.473,
    "text": "Yet on top of that, people have built using compositional ideas about dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3458.916,
    "end": 3467.829,
    "text": " frameworks for building compositional dynamical systems and compositional models for things like epidemiology and stuff like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3469.005,
    "end": 3492.299,
    "text": " you know hopefully we'll get there also with um you know statistical modeling and active inference and all that stuff but what you know once once you've got that kind of lower level library people can start to build like user interfaces on top of it and that's the thing that's starting to happen now with the stock flow stuff um and i think the people involved in that project are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3493.814,
    "end": 3507.163,
    "text": " I mean, they know that there's one major proprietary tool for doing this kind of modeling, which is used by lots of different organizations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3507.183,
    "end": 3510.325,
    "text": "For instance, it was used by governments for modeling during the pandemic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3510.365,
    "end": 3513.126,
    "text": "But it's not very collaborative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3513.467,
    "end": 3515.508,
    "text": "It's not compositional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3515.568,
    "end": 3521.192,
    "text": "So if you have this huge model, it's very hard to deal with, to modulate just some small part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.63,
    "end": 3537.48,
    "text": " And so these people, as I say, it's very unfortunate I can't remember all their names or the name of the software, but they're building this tool which allows you to build out these models just using this interface, but it's built out of this compositional stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3538.417,
    "end": 3541.02,
    "text": " And so it has a lot of the nice properties that come out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3541.08,
    "end": 3549.629,
    "text": "And of course, if you want, you can sort of delve under the hood and understand actually how it works and connect it to all this other stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3549.669,
    "end": 3556.376,
    "text": "And maybe down the line, when we've got really advanced tools, that will kind of be able to be done for free in some nice user interface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.042,
    "end": 3579.249,
    "text": " But I think, you know, so if people want to make the most of this, you know, they can sort of get involved with that kind of effort, or at least they can sort of get familiar with the basic ideas of categorical modeling or compositional thinking, as I like to say these days.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.466,
    "end": 3591.034,
    "text": " But I don't, I also don't want to like prescribe to people where they have to know what like a monad is and all that stuff, because you know, there are, it, it, it is technical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3591.134,
    "end": 3603.284,
    "text": "It, it has to be technical because it's about technical stuff, but I mean, it's also trying to be ergonomic and yeah, if, if that's your thing, you can try to help make it more so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3608.089,
    "end": 3608.429,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.45,
    "end": 3609.65,
    "text": "Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.273,
    "end": 3621.382,
    "text": " No, I'm waiting because there's a part of the paper that the belief updating and the fuzzy of distributions and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.462,
    "end": 3625.906,
    "text": "I'm going to want to talk about that later, but I'm done for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.482,
    "end": 3656.096,
    "text": " right i'll go to a question submitted by jr also who created the syllabus so thanks again jr for that amazing work so jr wrote um in compositional active inference from may 17 2021 toby said i'm with valeria on this i think we need to seek ai alignment for the artificial intelligences that we already have things like corporations and social systems and we should be concentrating on those right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.156,
    "end": 3661.339,
    "text": " Could you speak more about how you envision this kind of application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3661.94,
    "end": 3670.826,
    "text": "This is especially interesting in light of what we spoke about in the 54.0 regarding sensor fusion and consensus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.426,
    "end": 3674.188,
    "text": "What might this mean for corporations and social systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3675.309,
    "end": 3685.977,
    "text": "Toby, do you mean that this between humans and things kind of like artificial intelligences or machines and artificial intelligences in the context of companies and societies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.84,
    "end": 3699.639,
    "text": " yeah that's a great question and i think you know jr's done a great job with the syllabus which i also had a look at um yeah yeah i think uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3701.286,
    "end": 3727.809,
    "text": " it's a good it's a good it's a good like list of um material and concepts to sort of get get to grips with um but as for yeah AI alignment it's a very vexed issue of course um I know I mean I've put this to people who are involved in the AI safety community and some of them say oh well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3729.369,
    "end": 3739.395,
    "text": " we concentrate on machine intelligence rather than corporations because there's no hope for making corporations safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3739.455,
    "end": 3739.995,
    "text": "It's too late.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3740.015,
    "end": 3753.263,
    "text": "They're already out there, so we can't fix that, which is obviously a very defeatist attitude, but maybe it's right to concentrate on a matter where they think that they can actually have an influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3755.884,
    "end": 3757.966,
    "text": "But I do nonetheless still think that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3759.875,
    "end": 3762.898,
    "text": " Corporations are like super intelligences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3763.999,
    "end": 3773.047,
    "text": "They've been made out of code, but the code isn't a traditional computer programming language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3773.247,
    "end": 3777.671,
    "text": "It's the legal programming language that makes up their contracts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3778.875,
    "end": 3801.69,
    "text": " those contracts sort of determine how they operate and are executed on a thing which is a bit like a computer like the legal system um you know you go in a court it processes the contract and it explains what the outcome is going to be it's a it's like a computer but it's it's like made up of people um and you know they have you know goals and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.83,
    "end": 3806.773,
    "text": " desires and they take actions and they receive information from the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3806.833,
    "end": 3811.676,
    "text": "And so, yeah, they're a lot like, well, AI systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.796,
    "end": 3816.98,
    "text": "But it's nice because we can pun on AI and have it mean both artificial intelligence and active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3819.932,
    "end": 3821.833,
    "text": " So yeah, so that's like a long preamble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3823.674,
    "end": 3838.8,
    "text": "One of the things that, at least as far as I know right now, the active inference literature doesn't talk an awful lot about, at least not very precisely, is this notion of sense of fusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.84,
    "end": 3839.78,
    "text": "So you can have like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.993,
    "end": 3854.642,
    "text": " So if you think about the brain again, you've got two little neural circuits next to each other, and they're making predictions about two visual receptive fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.143,
    "end": 3858.645,
    "text": "But those visual receptive fields, they kind of often overlap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3862.469,
    "end": 3878.605,
    "text": " what we might want a system like the brain to do is to be able to kind of glue the two inferences that those circuits made together over this overlap so that you get like this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3880.006,
    "end": 3881.507,
    "text": " unitary perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.208,
    "end": 3886.731,
    "text": "We don't just see a bunch of independent patches of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3886.791,
    "end": 3896.778,
    "text": "We see this kind of glued together thing, even though the way it's been inferred is through lots of individual systems next to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3898.579,
    "end": 3898.959,
    "text": "And so it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3900.407,
    "end": 3926.908,
    "text": " quite you know it's quite clear how to put two things next to each other mathematically you just take their sort of product that you do then you just do them side by side but when you need to when you want them to sort of glue together in this way you might encounter some problems like you might have one make one inference and one make another inference and so you get like a disagreement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3929.045,
    "end": 3950.696,
    "text": " then you need to start to say okay well what's what's going on there like what is the nature of this disagreement is it something that can be resolved by like say you know passing some messages between the two systems or do we need to just like ignore some of the data or is there fundamentally some like paradox which means that we can't resolve this disagreement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3952.952,
    "end": 3953.512,
    "text": " Excuse me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3953.572,
    "end": 3975.097,
    "text": "And so in mathematics, there's a lot of theory that's been done about precisely this question in topology in an abstract way related to the field of what's called cohomology, which is all about measuring obstructions to doing this kind of gluing thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3976.218,
    "end": 3979.999,
    "text": "And in this world of applied topology, people talk about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3982.438,
    "end": 4006.993,
    "text": " algorithms for resolving disagreements and and things like that and they often have the flavor of like diffusion you can sort of think of diffusion as like smoothing out disagreements like because you're just sort of like letting stuff propagate um something there maybe could be said about like how these diffusion models work in generative ai but i haven't really thought about that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4009.5,
    "end": 4034.188,
    "text": " And so maybe there's something to be done for political systems or corporations, like maybe we can look at how the mathematics says we can resolve these disagreements and implement better processes in our organizations that are inspired by those algorithms or universal properties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4035.879,
    "end": 4047.629,
    "text": " And, you know, maybe that'll make the world a kind of more harmonious place, or maybe it will just help us build, you know, systems in the future, which resolve disagreements better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4047.649,
    "end": 4055.096,
    "text": "And this is one of the reasons why I was talking about, you know, multi-agent systems before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4056.878,
    "end": 4057.158,
    "text": "I know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4058.459,
    "end": 4067.182,
    "text": " This is a thing that sometimes people think about in the context of blockchain systems and things like that, which are actually actively composed of lots of different participants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.143,
    "end": 4077.405,
    "text": "But I don't know yet how it might all pan out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4077.985,
    "end": 4085.888,
    "text": "I mean, ultimately, the question of alignment is really about do the goals of this other system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4088.154,
    "end": 4112.608,
    "text": " disagree with my goals and you know if the other system has more power than you then ultimately there's probably not much you can do about it regardless of whether there's whether there exists some algorithm that might help you smooth it out so I think I hope at least that by looking at how like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4114.662,
    "end": 4141.179,
    "text": " mathematics says we can optimally resolve disagreements or smooth them out or patch things together or build kind of multi-agent systems that will help us build things in the future in such a way that we don't get to a situation where the systems we're working with are actually aligned against us say um but obviously we can't really guarantee it we actually have to sort of do some work but it's nice that at least",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.828,
    "end": 4148.612,
    "text": " the framework of active inference allows us to talk about that at least, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4148.652,
    "end": 4155.598,
    "text": "So, you know, we can say like, oh, I have these beliefs about the world and this other agent has these beliefs about the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4156.519,
    "end": 4158.5,
    "text": "And then, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4159.403,
    "end": 4172.929,
    "text": " we can express these beliefs in a mathematical framework which is amenable to using these tools from cohomology and applied topology to be able to start to make use of that work that's already being done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4174.67,
    "end": 4184.475,
    "text": "It's, to me, not so clear how you would do that if you're not working in this active inference world and you're working, say, with just reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4184.495,
    "end": 4185.415,
    "text": "I know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4190.578,
    "end": 4197.424,
    "text": " there are similar questions about how to kind of glue together preference functions in economics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4198.645,
    "end": 4215.32,
    "text": "And I think for me, the simplest way to kind of understand those questions is to kind of turn those preference functions into distributions over states and then use this kind of sort of more active inferency language to think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.877,
    "end": 4229.304,
    "text": " So yeah, again, we're just at the start of this process, but it sounds like we should be able to make use of this wealth of tooling, which has been developed in other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.985,
    "end": 4241.191,
    "text": "Because we're putting this into this kind of modular categorical language, we should be able to kind of put these two modules together and make the most of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4243.973,
    "end": 4271.091,
    "text": " thanks i'm gonna go to a different sort of question here i'm gonna uh play dissertation roulette but i kind of know where i'm gonna go and uh i'm gonna skip to a diagram it's a diagram at the end of chapter six and it looks like this so what do we see here what happens",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.23,
    "end": 4279.068,
    "text": " in this graphical arrangement it doesn't have to be ultra specific about defining every variable but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.0,
    "end": 4285.141,
    "text": " Is what matters here the topology or the geometry?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.382,
    "end": 4290.043,
    "text": "Is it an arbitrary visual layout, but you're conveying something about the connectivity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4290.463,
    "end": 4291.983,
    "text": "Or is it read from left to right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.123,
    "end": 4302.406,
    "text": "Or is there a certain way to understand or just approach these diagrams, which in slightly smaller forms or larger forms, we see peppered throughout category theory and your dissertation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.227,
    "end": 4304.487,
    "text": "So, okay, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.727,
    "end": 4307.268,
    "text": "So here, what I'm trying to do",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.613,
    "end": 4334.275,
    "text": " is say that if you have a hierarchical predictive coding system, if you take the formative two parts that are sort of plugged into one another, and this is the G and the H, if you do predictive coding on G,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4336.047,
    "end": 4344.311,
    "text": " And you sort of plug that into H and then you do predictive coding on H with that input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4345.431,
    "end": 4356.016,
    "text": "It's the same thing as doing predictive coding directly on the two parts as if they were one thing at the start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4356.056,
    "end": 4361.538,
    "text": "So what I mean is if you have, so like here, we've got like a hierarchical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4363.624,
    "end": 4369.749,
    "text": " again, the parts of the hierarchy are G and H. And we could do two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4369.85,
    "end": 4377.837,
    "text": "We could either apply predictive coding to the two parts and then glue those predictive coding systems together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4378.897,
    "end": 4388.346,
    "text": "Or we could glue the G and H together and then apply predictive coding to GH, the glued system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4389.949,
    "end": 4396.716,
    "text": " And what this bit of this result is saying is if you do those two processes, you get the same dynamical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4396.876,
    "end": 4406.325,
    "text": "And that's saying that this predictive coding thing, at least with this sort of Laplacian scheme, is functorial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4407.526,
    "end": 4408.567,
    "text": "So in this diagram,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4410.811,
    "end": 4413.612,
    "text": " It is read from left to right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4413.672,
    "end": 4420.275,
    "text": "I mean, in some sense, you can orient these diagrams however you want, as long as you're clear about how the information flows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4422.015,
    "end": 4433.74,
    "text": "And if I remember rightly, what we've got is we've got some like, yes, we've got X and Y. So I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4439.727,
    "end": 4462.91,
    "text": " So we've got one system which is predicting X and one system which is predicting Y. And I'm not totally sure what P and Q are, but I guess they relate to X and Y. And you've got some stuff that's coming into the predictive coding system H of G. And some other stuff which is coming in and going to H of H.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4464.813,
    "end": 4466.774,
    "text": " And these give you updated states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4467.374,
    "end": 4487.72,
    "text": "So in predictive coding with this Laplace algorithm, what happens is that you get this new observation that comes in, and you look at the error between that observation and your prediction, and you update your prediction according to the direction that error points you in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4489.22,
    "end": 4492.101,
    "text": "And so that's what these HG and HH systems are doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4493.66,
    "end": 4507.487,
    "text": " But because it's a hierarchical system, this like second layer, which, yeah, this second layer requires you to take in the prediction of the first layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4507.507,
    "end": 4519.173,
    "text": "So if you sort of follow in the flow of information, HH takes in inputs from gamma.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4520.094,
    "end": 4521.715,
    "text": "Gamma is the kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4523.345,
    "end": 4547.549,
    "text": " the predictive channel, the predictive part of G. And so that feeds into H. And the update of G, which is a sort of layer above H, requires this sort of newly updated belief from H, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.569,
    "end": 4550.67,
    "text": "So that's going sort of up in the causal hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4553.789,
    "end": 4567.636,
    "text": " And so if you sort of follow the flow in as well into this g update function at the top, h of g, you see that it gets an input from this sigma function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4569.457,
    "end": 4579.061,
    "text": "And that's the new belief emitted by the h system in this part of the proof, at least.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4579.101,
    "end": 4580.502,
    "text": "That was the notation I used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4581.724,
    "end": 4599.308,
    "text": " And so this is a saying, if you do predictive coding on these two bits, it has this structure, which is you do the forwards pass down through the system G and then H. And that gives you a prediction at the lowest level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4600.208,
    "end": 4605.209,
    "text": "And then you take your observation, which is, I think, the thing you get in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.894,
    "end": 4626.023,
    "text": " here in Z, yeah, that's what Z is, it goes into H, you get an updated belief that comes out in the form of the sigma and then gets passed to the first level of the hierarchy, which is used to give you the highest level of belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4630.545,
    "end": 4630.805,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.905,
    "end": 4635.227,
    "text": "Well, it's awesome because in so many papers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4636.28,
    "end": 4648.047,
    "text": " we see what I guess people expect and prefer, which is you should be able to make a nested model here and have communicating agents here and do sophisticated affective inference in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.547,
    "end": 4655.791,
    "text": "And it's like we're already playing with the Legos in a sense and talking about it like it's a total play shop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.511,
    "end": 4662.615,
    "text": "So to understand in a way that is worthy of dissertation research,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4664.016,
    "end": 4667.579,
    "text": " some of that substrate, it's basic Lego research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.339,
    "end": 4673.844,
    "text": "And how do you know when you're working, you describe this as a result",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.219,
    "end": 4675.879,
    "text": " How do we know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.899,
    "end": 4678.42,
    "text": "I mean, can I just draw a line from here to here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.921,
    "end": 4684.023,
    "text": "Or can I just make a D and just have D connect to gamma?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.023,
    "end": 4689.745,
    "text": "What rules, do you keep a guidebook or a recipe on the table?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.446,
    "end": 4697.609,
    "text": "What rules help us know what edges and shapes you can even draw?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.649,
    "end": 4702.111,
    "text": "And when you describe the manual checking, are you looking for what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4704.858,
    "end": 4707.9,
    "text": " Right, so yeah, this is a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4709.341,
    "end": 4714.584,
    "text": "So yeah, this is like, it is like a language, so it has a syntax.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4715.624,
    "end": 4720.407,
    "text": "And that syntax is like, I mean, it's like the grammar, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4720.467,
    "end": 4724.549,
    "text": "And it tells you what things make sense to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4731.173,
    "end": 4732.394,
    "text": "And so you only say those things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4734.346,
    "end": 4754.697,
    "text": " don't we all don't we all no but that but it's it's that's what i am laughing because often you want to like play with the grammar right and so sometimes you're like oh well you know i'm it feels like i'm not allowed to like draw this thing like i'm not allowed to connect this box to this other box in this way but like i really want to do that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4755.748,
    "end": 4757.649,
    "text": " And it's actually, that's not a bad thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4758.029,
    "end": 4761.071,
    "text": "You shouldn't do it in that diagram where it doesn't make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4761.511,
    "end": 4770.155,
    "text": "But you should take that feeling and reflect on it and say, oh, but that's saying that maybe this diagram syntax is missing something important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.556,
    "end": 4782.522,
    "text": "And then you should trust your intuitions there and say, okay, well, actually, what do I need to do to this diagram language to make it like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4783.601,
    "end": 4789.446,
    "text": " allow me to do that move that I wanted to do, to draw that thing I wanted to draw.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4791.248,
    "end": 4800.856,
    "text": "And so that suggests that you're walking through a valley, and you can see there's a hill over here, and there's something peeking out over it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.896,
    "end": 4803.659,
    "text": "And you're like, actually, there's something over there I need to be able to see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4803.779,
    "end": 4810.605,
    "text": "And so you have to move over towards a different place to be able to get to that place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.863,
    "end": 4814.084,
    "text": " And so you should do that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.504,
    "end": 4815.364,
    "text": "Then that's fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4815.544,
    "end": 4822.786,
    "text": "But the reason why I said at the beginning, don't just draw it in your diagram is because then that means your diagram doesn't mean anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4822.906,
    "end": 4824.126,
    "text": "And that's worse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4824.386,
    "end": 4835.109,
    "text": "So this is part of the reason that it's actually requires using this kind of mathematical formalism, really using mathematics generally requires this discipline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4837.137,
    "end": 4840.779,
    "text": " Because you don't want to say things that don't make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4841.299,
    "end": 4847.242,
    "text": "If you have an intuition, you should do it justice and treat it seriously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4847.262,
    "end": 4852.285,
    "text": "And you probably get more out of it by figuring out what's missing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.74,
    "end": 4859.664,
    "text": " So like, you know, with this particular kind of string diagram language, you can't just get used to reading them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4859.684,
    "end": 4864.047,
    "text": "So you know that these little black dots mean copy some information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4864.087,
    "end": 4874.655,
    "text": "So if you see the first one or like the second one on Y, you know, you go from Y, you go to this copier and you just send the information to both of those outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.936,
    "end": 4882.1,
    "text": "If you read like Bob Cooker's work or say his book on...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4884.558,
    "end": 4907.555,
    "text": " his book picturing quantum processes which is all about uh quantum theory using this string diagram language um there's a lot of like there are lots of lots of different rules for like stuff you can do with these languages languages like you have colored like spiders he calls them which are like colored versions of these black dots",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.852,
    "end": 4920.738,
    "text": " And, you know, there are things you're allowed to do, like if you have two spiders next to each other that are the same color, you can sort of merge them to be a spider with like, as many legs as the two of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4921.959,
    "end": 4924.701,
    "text": "And if they don't have the same color, then you can sort of split them apart.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4925.701,
    "end": 4930.804,
    "text": "And like that's that those kinds of those kinds of moves are like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4932.668,
    "end": 4936.829,
    "text": " part of the syntax of this language, but it's a human language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4936.889,
    "end": 4943.191,
    "text": "And so people developed it and they realized that they could do some things and they realized that they couldn't do others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4943.291,
    "end": 4949.353,
    "text": "And they tried to make the rules of the game match the things they wanted to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4949.633,
    "end": 4959.956,
    "text": "And they ended up with this language, which is now used a lot in quantum computing because it's a very sort of like natural language for that problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4964.278,
    "end": 4990.654,
    "text": " so as to like how do you know what kinds of things to draw well here like I was trying to prove functoriality which is the sort of general property and it says the thing you know it says in an abstract way the thing that I started by saying which is like there I was I wanted like h of gh to be the same as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4992.678,
    "end": 4993.419,
    "text": " Yes, see here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4993.559,
    "end": 5001.182,
    "text": "If you see this line, the update map of the composite system, you see I've got HH after HG.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5001.722,
    "end": 5011.207,
    "text": "Well, I want that to be the same as H just applied to H after G. And so that says, okay, well, I want these two things to be equal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5011.287,
    "end": 5016.329,
    "text": "And so what I do is I draw the two diagrams for the two parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5017.509,
    "end": 5021.794,
    "text": " And they, okay, you draw them out and they, first of all, they don't look equally like, oh, that's annoying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5021.895,
    "end": 5027.362,
    "text": "But then you stare at it for a bit and you reflect on the kind of moves that you're allowed to make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5028.652,
    "end": 5036.215,
    "text": " You think, well, OK, maybe I can apply this move, and it makes the diagrams look a bit more similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5036.255,
    "end": 5038.556,
    "text": "And eventually, you make the diagrams look the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5039.057,
    "end": 5042.438,
    "text": "You've only used rules that you're allowed to use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5043.959,
    "end": 5049.001,
    "text": "I can see you skimming through to see if it looks like that directly in the thesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5049.101,
    "end": 5052.422,
    "text": "But effectively, that's what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5053.523,
    "end": 5056.124,
    "text": "It's just that the rules are a little bit abstract.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5056.304,
    "end": 5057.545,
    "text": "Though, that being said,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5058.485,
    "end": 5080.594,
    "text": " I know that Pavel Sobochinsky, who's a researcher in category theory at Tallinn, he's got a project with a colleague of his to build a mobile game, which is all about making string diagrams equal in this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.975,
    "end": 5091.454,
    "text": " And so the idea is that in this game, you have like, pictures like this, and you've got certain moves you can do to manipulate the pictures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5093.897,
    "end": 5118.276,
    "text": " and that you know and the sort of aim of the game is to like transform one the sort of starting picture into like the sort of gold picture just by applying these moves and as you go through the game the kind of moves you can do become more complicated um but it's i mean it's the same kind of process i'm not sure the game is at the stage now where you're allowed to like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5119.395,
    "end": 5131.158,
    "text": " do this human creative thing and think, actually, I want to make that be a new kind of move or change the diagrams or add in a color here or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5131.839,
    "end": 5133.039,
    "text": "That's a really human thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5133.099,
    "end": 5136.3,
    "text": "And there's nothing to say you shouldn't do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5136.4,
    "end": 5139.801,
    "text": "But I'm just trying to advocate for doing that in a way which is also rigorous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5143.302,
    "end": 5143.702,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5144.542,
    "end": 5144.942,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.963,
    "end": 5146.203,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.574,
    "end": 5172.37,
    "text": " to speak fluently the syntax and the grammar whether we're talking about natural human language or we're talking about the active inference ontology we want the syntax to be unobtrusive if not compressient so that we can actually convey the semantics because that's the real information flow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.444,
    "end": 5177.988,
    "text": " the syntax is within the Shannon signal entropy space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.889,
    "end": 5199.327,
    "text": "And then in Livestream 17 and 4D and the Physics as Information Processing with Chris Fields, where we've been exploring these semantic Bayesian information flows that must out of necessity to be enriched beyond the syntax have to include an individual or shared context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.743,
    "end": 5204.848,
    "text": " that flow necessitates the proper syntax.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5206.029,
    "end": 5210.234,
    "text": "And so it's just part of the learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.855,
    "end": 5217.723,
    "text": "And so it's exciting to see that there's games and work like yours and others to help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5218.689,
    "end": 5233.532,
    "text": " Because if we could play with those Legos and get the instantaneous feedback, just like learning with a language tutor of like, no, these two pieces, they don't fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.852,
    "end": 5247.734,
    "text": "And then it just, we kind of would actively infer patterns, make our own rules and understandings, but there would be certain compositionality of the system itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5248.877,
    "end": 5252.478,
    "text": " And so it's interesting to think of, like, you described it as a natural language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.718,
    "end": 5254.958,
    "text": "It is technical and naturally arising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.658,
    "end": 5268.001,
    "text": "And our natural language, without going too much into the Sapir-Whorf and everything like that, it reflects the kind of subject-object-verb structure that we often want to convey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.381,
    "end": 5273.222,
    "text": "This is a natural language for science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.19,
    "end": 5276.332,
    "text": " it conveys what we want to convey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.273,
    "end": 5282.898,
    "text": "And so being able to do that in a way that is both disciplined and rigorous,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5284.258,
    "end": 5303.766,
    "text": " also enabling low cognitive overhead fluency for some individuals today but for more tomorrow that's just extremely powerful and the fact that it has like such a beautiful and intuitive way to graphically represent it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.91,
    "end": 5332.017,
    "text": " is very promising because that may tap us into a more holistic understanding and a visual field or a felt sense understanding that just looking at this and someone says wait this is what we learn in active inference it's like well no that's not even the tip of the iceberg there's so much more to it and it's not only this and all of that but it's one of the pieces that at this moment in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.3,
    "end": 5345.29,
    "text": " in our sort of early calculator phase, or abacus phase almost, it's one of those things that we're tackling, but it's the wave that we're riding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.191,
    "end": 5355.058,
    "text": "And I just can't wait until there's more accessibility and the learning pathways and the playgrounds to use all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5355.72,
    "end": 5379.747,
    "text": " yeah i mean i i totally agree with with all of that and i i think um it was it was nice to see the gr in this syllabus that included um references to eugenia cheng's work because she's done a lot of great work to kind of make mathematics more accessible in this way um she had an article in the guardian like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5380.387,
    "end": 5401.598,
    "text": " in the last week or so even talking about mathematics education and how it's often it often like scares people because they're taught to like you just apply algorithms in this kind of blind way to do like multiplication or calculus or whatever and not really like play with the concepts",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5402.561,
    "end": 5425.428,
    "text": " the way that i was trying to say okay well you know you're drawing these diagrams and you know you want to like play with them and it's it would be nice to see mathematics education take this kind of more playful route to start with one of the things that um eugenia says in this article is that unfortunately that would make things kind of slower because like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5426.849,
    "end": 5429.633,
    "text": " you just want people to muck around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5429.673,
    "end": 5434.62,
    "text": "You don't want people just to be able to churn out this kind of computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.7,
    "end": 5439.447,
    "text": "But in this future where computational tools are so powerful,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5440.607,
    "end": 5449.692,
    "text": " maybe we don't all need to be perfect integrators or derivators and be able to multiply numbers quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5450.412,
    "end": 5453.994,
    "text": "Some people like doing long division, but I don't even remember how to do long division.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5454.034,
    "end": 5454.474,
    "text": "Why would I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5455.055,
    "end": 5458.837,
    "text": "It's silly to kind of drill that into children.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5459.517,
    "end": 5460.858,
    "text": "So there have been projects",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5462.265,
    "end": 5484.432,
    "text": " um to teach like kindergarten children um like like a couple of projects not many some of the kind of rules of this string diagrammatic stuff um in in this quantum um information processing world this um of book bob cooker and his colleagues",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5485.797,
    "end": 5506.084,
    "text": " think there was one um project by dan geeka in birmingham and maybe one by bob himself or at least he was trying to get it off the ground i don't remember um but at least where it has been tried i think they found that children very easily learn to use these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5507.264,
    "end": 5512.047,
    "text": " these kinds of languages because it's just playing with pictures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5512.687,
    "end": 5531.718,
    "text": "They're kind of much more approachable than this kind of scary symbolic language, which is, you know, I mean, it's a kind of fine language if you're used to, like, typing on a typewriter or like writing by hand where you write in this linear way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5532.793,
    "end": 5545.201,
    "text": " But if you go to a mathematics department and look at the whiteboards or the chalkboards there, most of the time you see lots of pictures, diagrams and things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5545.301,
    "end": 5547.663,
    "text": "And that's how people reason typically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5549.084,
    "end": 5561.152,
    "text": "And so a lot of what's been happening with applied category theory is trying to take using diagrams seriously as mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.174,
    "end": 5568.559,
    "text": " and trying to say, OK, well, here's what we can do if we do take it seriously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5568.599,
    "end": 5585.213,
    "text": "We can recapitulate some of these things which people have found abstract or abstruse or difficult in mathematics before and make them seem a bit more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5586.252,
    "end": 5610.425,
    "text": " easy to reason with now and so I mean that applies to like abstract things like stuff I've mentioned already like adjunctions like the laws of adjunctions you can draw them with string diagrams I mean you know I haven't shown it in my thesis but like you can if you sort of Google around you can see you know adjunctions in a two category and they end up being some kind of snaky picture",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5612.003,
    "end": 5618.467,
    "text": " And so you get a sense of what's going on there from these pictures, like the flow of information in some sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5619.528,
    "end": 5621.849,
    "text": "And there's a similar thing with monads.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5622.55,
    "end": 5628.333,
    "text": "The joke for functional programmers about monads is like, oh, you don't know what a monad is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5628.393,
    "end": 5631.115,
    "text": "Well, it's just a monoid in the category of endofunctors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5631.916,
    "end": 5633.136,
    "text": "And I mean, that's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5633.156,
    "end": 5633.977,
    "text": "It's not just a joke.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5634.037,
    "end": 5634.497,
    "text": "It's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5635.218,
    "end": 5636.479,
    "text": "But the thing is, if you draw",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5637.259,
    "end": 5653.929,
    "text": " what a monoid is it's like a thing which like like one of these like you see on that picture you've got this Gauss thing and then it's got a black dot and you got you got one wire and then it it has a black dot and then two wires come out of it and I said this is like copying",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5655.543,
    "end": 5658.344,
    "text": " Well, like a monoid is like that in the other direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5658.404,
    "end": 5662.925,
    "text": "Like you've got two things that go into a dot and that come out with one thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5663.085,
    "end": 5667.306,
    "text": "So like when people say monoid, they mean something like they often mean something like addition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5667.566,
    "end": 5671.227,
    "text": "You've got two numbers that come together and they produce one number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5671.687,
    "end": 5672.968,
    "text": "We've got like multiplication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5673.168,
    "end": 5674.468,
    "text": "You've got two numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5674.608,
    "end": 5676.889,
    "text": "Again, they come together and produce one number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5677.816,
    "end": 5683.279,
    "text": " So it's like the opposite of copying in some abstract sense, which takes one thing and gives you two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5683.719,
    "end": 5686.84,
    "text": "This is something that takes two things and gives you one thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5688.421,
    "end": 5696.485,
    "text": "And so you can just draw the diagrams that define a monoid and say, OK, well, what does this mean for endofunctors?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5696.605,
    "end": 5699.987,
    "text": "And you can sort of start to reason about it a bit more approachably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5700.007,
    "end": 5706.41,
    "text": "I mean, it's still quite abstract because it is quite abstract, but it makes it kind of less scary to use this kind of language, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5712.054,
    "end": 5736.275,
    "text": " awesome yeah there's so much psychology and sociology and mathematics and just hearing about yeah on real chalkboards people branch and they flow and they circle things and they put an x through something it's like there's all these operations that can't be copied with a typewriter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5737.424,
    "end": 5760.983,
    "text": " And as our cyber-physical and social niches develop, and we have different affordances, different metaphors, different quantum reference frames for working and being, it starts to make more sense for having a natural language that can express that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.003,
    "end": 5762.685,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5763.986,
    "end": 5764.166,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.618,
    "end": 5767.099,
    "text": " No, no, go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5767.14,
    "end": 5768.523,
    "text": "I've said loads of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5769.566,
    "end": 5771.09,
    "text": "It just makes me think of a Turing tape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5771.906,
    "end": 5785.311,
    "text": " where even if there is a linear representation, it can still in some other way, characterize like a Lisp program with nesting or hierarchical model, even though yes, there's like a linearity, but also there's a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5785.631,
    "end": 5790.073,
    "text": "So it's not that we can't represent certain things with a bit streams or anything like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5790.853,
    "end": 5794.214,
    "text": "It's just that that may be more like the assembly language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5794.915,
    "end": 5797.636,
    "text": "And that when we actually wanna do certain kinds of work,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.436,
    "end": 5806.378,
    "text": " we may want to just move lightly and semantically with a high-level way to think about math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5808.378,
    "end": 5809.439,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5809.519,
    "end": 5824.862,
    "text": "It's notable to me that recently, I've been giving talks for a while using a computer, whether or not over Zoom, but it could be in person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5824.982,
    "end": 5827.263,
    "text": "I have my PowerPoint slides or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5828.832,
    "end": 5850.745,
    "text": " these days if i give a talk i just use my like tab like digital tablet and i do everything like all the slides by hand and i draw pictures and it's nice now that we've got like technology that is starting to you know be a bit more human in that sense and i think this is like a kind of mathematical technology which is like that although i think it's also notable that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5851.525,
    "end": 5880.075,
    "text": " um it's still in substance quite niche and i think i mean i don't i don't know but the impression i've got from talking to people is that it's still the case that some mathematicians sort of think of this kind of like mathematics of diagrams are somehow like not quite like real mathematics because it's like it's too much like play in some sense um but i think that i think that perspective is changing and people are taking it seriously i mean it is real work and there's a lot of hard problems um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5881.992,
    "end": 5907.283,
    "text": " and you know stuff actually gets done but i think it's it doesn't to me it doesn't really matter what like a handful of mathematicians think it's just what's useful to people that matters um and so i mean i i hope that you know these tools continue to develop and like you know we can use them in all sorts of different domains um i don't know you know i've never really",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5909.102,
    "end": 5915.145,
    "text": " It's like notable to me as well that like human vision is kind of like two and a bit dimensional, really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5915.205,
    "end": 5918.146,
    "text": "It's not really like three-dimensional, but you've got a bit of three-dimensionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5918.186,
    "end": 5927.891,
    "text": "And I've never really played much with like three-dimensional diagrams, but maybe I will one day have some tools with my like, you know, vision pro or less not pro thing or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5928.371,
    "end": 5935.915,
    "text": "It'll allow me to do things even more like naturally, like actually like plug together some stuff in some abstract space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5937.376,
    "end": 5937.756,
    "text": "Who knows?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5937.836,
    "end": 5938.156,
    "text": "Who knows?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5940.08,
    "end": 5959.276,
    "text": " yeah the diagram being two-dimensional or planar gives us this kind of classical screen holographic screen that information can be written on that then quantum cognitive agents can unfold into the imaginary plane with the wick rotation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.742,
    "end": 5966.426,
    "text": " But also the boundary, just like you said earlier, can come in many shapes, many dimensionalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5966.466,
    "end": 5974.451,
    "text": "So we could have a four-dimensional boundary artifact that still becomes rotated into a higher dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5975.872,
    "end": 5984.779,
    "text": "And that's not the framing or the mathematics that most of us have learned up to this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5985.479,
    "end": 5986.4,
    "text": "There's a really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5988.26,
    "end": 6012.914,
    "text": " Crystallized would be a complimentary way to say it, but codified or fossilized sedimentary understanding of math education, its role in broader thinking and what we learn along the way and the progressions get reified with who makes it through the pipeline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.815,
    "end": 6015.256,
    "text": "So I think that's like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6016.223,
    "end": 6043.126,
    "text": " that's like the the unknown unknowns here the known unknowns like we all know that we struggle to understand this but then what but but then that's the real jumping off when it when it's not just us adapting into a new regime um of learning and doing but when there's um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6044.147,
    "end": 6067.986,
    "text": " composition and construction within that regime in our last um sections here um dean or ali another question or um what what are you looking to bridge or gap into the dot too dean okay ali please",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6069.845,
    "end": 6078.251,
    "text": " Well, yeah, I actually, I've written down a number of questions, but they may be quite specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6078.511,
    "end": 6086.556,
    "text": "And I think they're perhaps best suited for the .2 discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6087.256,
    "end": 6093.581,
    "text": "But I wanted to thank Toby for, I mean, I literally had goosebumps the entire time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6094.804,
    "end": 6100.886,
    "text": " So it was really fascinating and quite enjoyable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6101.066,
    "end": 6104.327,
    "text": "And I learned a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6104.547,
    "end": 6110.308,
    "text": "And I hope to, I also have some additional questions in my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6110.368,
    "end": 6114.689,
    "text": "I hope to get to some of them in the second discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6115.569,
    "end": 6117.83,
    "text": "So yes, thank you again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6117.85,
    "end": 6119.11,
    "text": "It was really, really great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6120.951,
    "end": 6121.211,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.168,
    "end": 6129.63,
    "text": " Dean, with the penultimate thoughts, what do you see us heading into?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6129.65,
    "end": 6142.894,
    "text": "Yeah, well, if it's OK, I'd like just to read a really brief piece of the paper because I don't want to launch on Toby in the dot too without giving him a chance to think about this a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6143.554,
    "end": 6149.816,
    "text": "Under 7.4, you've got fundamental theory and you say future work connected to this thesis need not only be in applications",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6150.578,
    "end": 6153.6,
    "text": " A number of purely theoretical questions raised themselves too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6154.28,
    "end": 6155.761,
    "text": "And I love 741.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6155.901,
    "end": 6163.166,
    "text": "This one paragraph, it's not, it's for me, I call it a really have to slow down and enjoy the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6163.366,
    "end": 6170.611,
    "text": "Today, Toby, I don't know if you're a distance runner, an endurance athlete of some kind, but your stamina has been phenomenal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6170.631,
    "end": 6175.694,
    "text": "But this one paragraph to me would be like a refreshment station where they offer you a milkshake",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.38,
    "end": 6177.781,
    "text": " and a piece of battered fish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6177.841,
    "end": 6182.142,
    "text": "Like it's yummy, but you need to wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.202,
    "end": 6185.044,
    "text": "You have to pause and kind of go, I don't know if I want to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6185.464,
    "end": 6188.845,
    "text": "But it really ties in nicely with the syntax stuff that Danny was talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6188.865,
    "end": 6190.886,
    "text": "And I have a question at the end of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6191.126,
    "end": 6192.727,
    "text": "So I just want to read it though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.747,
    "end": 6194.187,
    "text": "The mathematics of belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6195.248,
    "end": 6198.529,
    "text": "So you basically said belief is theoretical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.729,
    "end": 6199.67,
    "text": "That's fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6200.67,
    "end": 6205.412,
    "text": "Is in large part about replacing definite points with fuzzier distributions over them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.027,
    "end": 6208.868,
    "text": " Independent type theory, we've replaced points with terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.309,
    "end": 6216.271,
    "text": "Non-dependent terms are exactly points, so a type of theory with belief should somehow encompass fuzzy terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6217.111,
    "end": 6221.993,
    "text": "Just as we can replace points with distributions, we can replace dependent points with dependent distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6222.033,
    "end": 6230.596,
    "text": "However, the standard replacement, moving from a category of functions to a category of stochastic channels, obscures some of the universal categorical structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.383,
    "end": 6236.246,
    "text": " and underpins the rules of type theory, this standard replacement also misses something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6236.786,
    "end": 6241.409,
    "text": "While it does allow for fuzzy terms, it omits a model of fuzzy types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6243.41,
    "end": 6247.912,
    "text": "We might well want to express beliefs about things whose identity we are not quite sure.\"",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.932,
    "end": 6253.555,
    "text": "And then you say in the next sentence, there seems to be a couple of related resolutions to this puzzle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6254.036,
    "end": 6259.258,
    "text": "My question for you is this, and it's not for today, it's maybe for next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6262.233,
    "end": 6270.736,
    "text": " It seems to me we have to grapple with this idea of making fuzzy clear and making fuzzy precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6270.997,
    "end": 6272.917,
    "text": "And you started speaking to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6273.498,
    "end": 6286.463,
    "text": "And my wonder coming now with a much stronger active inference set of priors is there has to be something more to this than just a gradient descent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6287.168,
    "end": 6291.789,
    "text": " And I think you started to speak to that in this section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6291.949,
    "end": 6297.49,
    "text": "And so I'm kind of curious, do you think that this is a feature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6298.631,
    "end": 6314.274,
    "text": "The fact that we can do this, we can do fuzzy clear and fuzzy precise and not necessarily see that as a contradiction, but actually the way category theory kind of gives us permission to examine that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6314.374,
    "end": 6316.355,
    "text": "So again, it doesn't have to be answered today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.276,
    "end": 6323.859,
    "text": " And maybe I'm misinterpreting what you were trying to say there, so I'm open to being redirected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6324.339,
    "end": 6327.441,
    "text": "But I just think that this opens up a world of possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6328.041,
    "end": 6338.206,
    "text": "And when I first read it, I don't know what Ali's goosebumps looked like, but I was just like, oh, man, I really want to ask you about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6339.269,
    "end": 6339.609,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6339.709,
    "end": 6342.451,
    "text": "I mean, yeah, I, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6342.511,
    "end": 6346.414,
    "text": "So the thing about fuzzy type, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6346.434,
    "end": 6361.145,
    "text": "So I do, I got to start by saying, I agree that the kind of, that what some of this is seeking is something like thinking clearly about thinking fuzzily in some way is kind of weird.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6361.945,
    "end": 6362.946,
    "text": "Um, it's like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6364.699,
    "end": 6367.1,
    "text": " having some certainty about uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6368.721,
    "end": 6386.689,
    "text": "But it's definitely the case that still now I think a notion of fuzzy type theory is not well developed, though I am aware of various people having thought about this and people thinking about it at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6387.509,
    "end": 6389.35,
    "text": "And of course, I've got my own ideas about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6391.434,
    "end": 6419.68,
    "text": " it seems natural right like we often you know think we know what i think like we can recognize a thing but like um maybe you're not quite sure and so like you know you're not sure if it's this or that or you see somebody coming down the street towards you and you kind of recognize them as somebody you know or you used to know and then like as they approach that their identity becomes a bit clearer but you're not you know you weren't sure for a while um and i think you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6420.799,
    "end": 6432.204,
    "text": " there's nothing to say that, you know, we shouldn't be able to, you know, in some sense, like types are a kind of element of some bigger space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6432.224,
    "end": 6434.184,
    "text": "And so we should be able to play all this maths to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6434.204,
    "end": 6449.25,
    "text": "And it's kind of really about figuring out what the rules are that makes the kind of language of type theory kind of align nicely with the language of probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6451.025,
    "end": 6455.607,
    "text": " And it's a research effort, but I'm happy to talk about it more next time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6455.847,
    "end": 6469.032,
    "text": "I'm also happy to talk in any detail about any of the actual specifics of the stuff in the material in the thesis or whatever else in category theory you might be interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6469.052,
    "end": 6473.173,
    "text": "I can't promise to be expert in everything, of course, but I'm happy to try my best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6473.773,
    "end": 6477.415,
    "text": "Particularly, Ali, it sounded like your questions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6478.075,
    "end": 6480.876,
    "text": " Well, maybe of a more technical nature, maybe not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6480.936,
    "end": 6486.818,
    "text": "I don't know if I got the right sense of what you're saying, but if they are, I'm happy to talk about the details of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6487.098,
    "end": 6487.698,
    "text": "Thank you, Simon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6487.798,
    "end": 6506.564,
    "text": "And also to review any of the stuff, to try to say, because you're right that there's a lot of detail in the thesis, because you make a claim, and you're supposed to substantiate it, and that means you have to give a proof, and sometimes the proof is quite complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6509.022,
    "end": 6516.673,
    "text": " But structurally, I want this to be simple or at least to have a simple framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6516.734,
    "end": 6524.045,
    "text": "And so I would like to be able to clarify some of that if there's time for that or if it comes to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6526.223,
    "end": 6545.081,
    "text": " yeah that sounds amazing in dot two we will uh return perhaps any questions that people submit as a comment on the video or as a message in the category theory channel on our discord we'll curate those questions we'll",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6545.919,
    "end": 6548.1,
    "text": " rewatch and digest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6548.9,
    "end": 6556.663,
    "text": "And then we can begin with Ali asking some, taking us on a little bit of a technical journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6557.484,
    "end": 6560.885,
    "text": "And Toby, thanks again for the incredible work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.025,
    "end": 6565.247,
    "text": "It's defined our 2023 in many ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6565.347,
    "end": 6569.408,
    "text": "So it's been a joy and we look forward to next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6569.508,
    "end": 6571.809,
    "text": "Thanks for plowing through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6572.37,
    "end": 6572.65,
    "text": "I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6573.53,
    "end": 6599.54,
    "text": " yeah there's also the stuff i i think we talked about before that that we haven't really touched on this time and obviously i didn't really touch on much in the pieces about like how do you actually fit in like action into this framework and like how do you like start to talk about this like multi-agent stuff we can you know if there's time we can talk about all of that two of the pieces just to share that that gave us some of the most laughs were um first",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6601.089,
    "end": 6602.191,
    "text": " We didn't get action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6602.952,
    "end": 6610.783,
    "text": "And we're like... It's... I mean... Just... The... It wasn't an anti-climax.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6611.143,
    "end": 6612.525,
    "text": "It was a climax of its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6613.764,
    "end": 6639.444,
    "text": " and uh and then also we had had so many discussions over the months of time and the treatment of time backwards and forwards ringing the bell unringing the bell um all of these different concepts and then in your limitations you said we we really have to work on getting a dynamical treatment oh yeah but i actually think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6640.66,
    "end": 6663.656,
    "text": " depending on like what you care about it may not be too hard so that's fine but even that you would say it that way just having dealt with time oh yeah yeah and then to be like well i mean it's like i thought that's what dynamical modeling was involving time no no no so that that you're right you're totally right that so all i meant at that point was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6664.719,
    "end": 6682.056,
    "text": " so the the kind of like statistical framework that i've been working with until then it just seems you have like a prior and like a way of make generating predictions but like the pretty there's no like nothing to say that the prior has any like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6683.134,
    "end": 6708.103,
    "text": " data about how stuff actually evolves in time or the predictions have any data about how like the sense data evolves in time it's just like I believe that there's this on the screen and that makes there be this like stuff coming to my eye and that's it it's just like a snapshot and so like when you want to include time evolution in those beliefs it things become a bit more complicated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6712.919,
    "end": 6713.3,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6713.52,
    "end": 6717.806,
    "text": "Well, thank you again, Toby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6717.966,
    "end": 6720.45,
    "text": "We'll see you in a week and a day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6722.713,
    "end": 6723.233,
    "text": "It's been a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6723.273,
    "end": 6724.055,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6725.717,
    "end": 6726.438,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  }
]