[
  {
    "start": 6.96,
    "end": 21.757,
    "text": " hello and welcome everyone it's september 30th 2023 and we are in physics as information processing discussion five should be a fun discussion on a great fifth lecture so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 22.87,
    "end": 40.343,
    "text": " Ander, if you'd like to give some opening remarks, and then also anyone else, whether it's your first time joining a discussion or not, it would be great to hear your remarks on Lecture 5 or just where you're coming at it today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 40.644,
    "end": 41.784,
    "text": "So first, though, Ander.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 44.086,
    "end": 44.286,
    "text": "Sure.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 44.346,
    "end": 44.867,
    "text": "Hello, Daniel.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 45.787,
    "end": 51.131,
    "text": "So I may as well start off by sharing the slides, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 51.372,
    "end": 51.772,
    "text": "What do you think?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 53.621,
    "end": 54.982,
    "text": " Sure.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 55.022,
    "end": 62.087,
    "text": "So just before, as a warm up, let's review some of the things that Chris mentioned last time.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 63.948,
    "end": 71.834,
    "text": "So near the beginning, the main thing was this distinction between reductionist and scale-free theories.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 75.031,
    "end": 84.398,
    "text": " Obviously, one very salient feature of the free energy literature is that it falls under scale-free theories.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 85.098,
    "end": 92.143,
    "text": "These are theories where there is no preferred scale of energy or distance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 95.134,
    "end": 100.115,
    "text": " Reductionist theories are based on such a scale existing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 100.175,
    "end": 104.617,
    "text": "You want to break the pieces into the fundamental building blocks of the legos.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 105.097,
    "end": 110.719,
    "text": "People think of usually high energy or particle physics as the archetype of this thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 112.878,
    "end": 117.54,
    "text": " Whereas in scale-free theories, there is no such thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 117.821,
    "end": 126.025,
    "text": "And we should have the same skeletons or the same framework at different scales",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 128.036,
    "end": 143.646,
    "text": " um this is going to be very important i i chris correct me if i'm wrong but especially for the coming lecture where we talk about biology chris himself made a few remarks on how the renormalization group flow",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 145.066,
    "end": 170.661,
    "text": " aka the process of going from from smaller to higher scale may be trivial in biology that is to say that um there is a self-similarity okay so so some features of biology should remain invariant at different scales that is um what cells are to a body different individuals of a species might be to a to an ecosystem that that sort of idea",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 172.887,
    "end": 187.371,
    "text": " So after talking about scale, and perhaps when we get to the question part, I guess this is the one thing that I would like Chris to explain a little more, more precisely what these diagrams mean.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 187.752,
    "end": 191.192,
    "text": "I have a rough idea, but it would be nice to hear him talk about that again.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 192.193,
    "end": 195.754,
    "text": "Anyways, in the second half, basically,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 198.178,
    "end": 204.762,
    "text": " We started asking, as is the theme in this course so far, from first principles.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 205.871,
    "end": 234.111,
    "text": " what do you need to talk about um space space and time and um there were some theorizing that time might be um more fundamental that is the things that you need for to implement the clock we're thinking about what are the most basic constituents to implement the clock and those may be even more basic than the things you need to implement qrfs or perception of space after all",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 235.469,
    "end": 241.774,
    "text": " It seems like you need some spatial extension to perceive the space in the first place.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 242.314,
    "end": 248.64,
    "text": "I can't remember if it was somebody who was tuning in for the lecture or a question afterwards or something like that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 249.78,
    "end": 253.844,
    "text": "But I think this remark gets to a very deep point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 254.544,
    "end": 256.286,
    "text": "Somebody, I recall, mentioned",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 257.532,
    "end": 283.582,
    "text": " that some organisms it might have increased himself i can't remember really that there are organisms you may know the name daniel that are so tiny that if they if they try to implement a gradient to try to chase you know their food or whatever they're they're so small that they can't even perceive the gradient you know like in any any attempt at implementing such perception they're gonna feel",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 285.073,
    "end": 302.621,
    "text": " uh they're gonna feel the same amount of concentration in all directions so they're basically not large enough to perceive space however uh interestingly so they can they can perceive time i don't know how this ties to the remarks that chris made about space being more fundamental i suppose",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 305.097,
    "end": 309.159,
    "text": " Chris was getting at the point that you need fewer parts to perceive space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 309.779,
    "end": 318.882,
    "text": "And the fact that such small organisms can perceive time but not space, I guess, is further empirical evidence for this thesis.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 320.023,
    "end": 325.105,
    "text": "And... Actually, Andrew, if I can... Yes, please.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 325.365,
    "end": 326.865,
    "text": "I may have botched the explanation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 327.806,
    "end": 333.668,
    "text": "Yeah, I proposed earlier that time is actually more fundamental than space, that one has to have time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 335.823,
    "end": 337.063,
    "text": " to be able to see space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 337.744,
    "end": 342.264,
    "text": "So that's further on in these slides that issue is discussed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 342.844,
    "end": 343.125,
    "text": "Yeah.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 343.425,
    "end": 346.645,
    "text": "So do you want to say something about that, Chris?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 350.806,
    "end": 352.686,
    "text": "Well, this is the right slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 356.587,
    "end": 360.708,
    "text": "Yeah, one just needs a memory, really, to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 363.99,
    "end": 366.651,
    "text": " to have a clock, an external clock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.492,
    "end": 373.335,
    "text": "I mean, to have an internal clock, one also has to have a memory to have an internal clock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 373.375,
    "end": 386.623,
    "text": "But if you have a memory and there's some kind of activity that's periodic in the environment, then you have a clock, an external clock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 388.124,
    "end": 391.546,
    "text": "But you don't need object identity to have a clock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 393.007,
    "end": 398.631,
    "text": " And that's what distinguishes it from space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 398.671,
    "end": 400.252,
    "text": "You have to have object identity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 402.034,
    "end": 406.637,
    "text": "Or in other words, motion, the ability to perceive motion to perceive space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 407.878,
    "end": 408.118,
    "text": "Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 412.521,
    "end": 414.843,
    "text": "Yeah, any periodic behavior is effectively a clock.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 416.544,
    "end": 418.526,
    "text": "Whereas for space, we need",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 420.931,
    "end": 433.7,
    "text": " object persistence, which two comments that we've made were that object persistence is the, or rather Chris made, is the defining feature of classicality.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 434.241,
    "end": 435.702,
    "text": "You said that last time, is that right, Chris?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 436.522,
    "end": 445.769,
    "text": "And also that object persistence is precisely the notion of thickness, the way Friston would put it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 448.157,
    "end": 452.4,
    "text": " Yeah, object persistence is definitely a classical notion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 453.301,
    "end": 467.672,
    "text": "And it does seem to be the place where classicality enters quantum theory, as far as I can tell, is with this notion of object persistence, that that's the most fundamental place that it enters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 468.773,
    "end": 474.817,
    "text": "So how does that definition of, or rather, relationship between classicality and quantumness",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 477.051,
    "end": 503.231,
    "text": " being object object persistence how does it compare with other accounts coming from from qdar and decoherence and all of that um well say quantum darwinism is is a good example uh quantum darwinism assumes object persistence but it assumes that there is some persistent thing that interacts over time with the environment",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 504.949,
    "end": 508.051,
    "text": " according to some interaction that has fixed eigenvalues.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 509.692,
    "end": 531.342,
    "text": "So quantum Darwinism already assumes object persistence, and it also assumes classical communication, as we discussed a couple of times ago, in that it's a theory that is about the ability of multiple observers to agree about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 532.239,
    "end": 553.877,
    "text": " the state of some other object, which for them to agree about that object, not only does the object need to persist, the various observers need to have the same description of that object, or the same name for that object, or the same way of identifying that object.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 555.778,
    "end": 559.982,
    "text": "So yeah, quantum Darwinism actually assumes a lot of classical features.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 564.516,
    "end": 579.704,
    "text": " The basic theory of environmental decoherence is, in effect, a single observer theory, so it doesn't have to assume classical communication, but it does assume object persistence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 580.925,
    "end": 584.967,
    "text": "Which, obviously, if we're going to talk about empirical science, you have to, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 585.047,
    "end": 591.711,
    "text": "You have to assume that your detector is a thing that persists through time, or you can't do any experiments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 592.458,
    "end": 596.34,
    "text": " And more importantly than that, you have to assume that you're a thing that persists through time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 598.56,
    "end": 604.383,
    "text": "So we need these classical notions to talk about doing science.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 608.944,
    "end": 610.985,
    "text": "I'm not the first person to point that out, of course.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 611.065,
    "end": 618.108,
    "text": "I mean, Bohr pointed that out in 1928 in his paper in Science, where he summarizes quantum theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 619.688,
    "end": 621.049,
    "text": "So it's a very, very old idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 622.506,
    "end": 622.726,
    "text": " Right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 624.488,
    "end": 639.319,
    "text": "And I guess right away I have a question that I suspect I may have asked before, but maybe we can revisit it from the perspective of today's discussion, which is, and maybe I should pull the slide.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 639.359,
    "end": 641.14,
    "text": "This is actually from session four.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 642.682,
    "end": 651.608,
    "text": "So if we're talking about differences between what the defining feature of classicality is,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 653.118,
    "end": 657.059,
    "text": " To me, that bears the question of here, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 657.36,
    "end": 664.522,
    "text": "This TQFT diagrammatic notation for the classical and the quantum channels.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 664.862,
    "end": 673.825,
    "text": "So if we're talking about object persistence as the defining feature of classicality, and this is the cartoon picture of what goes on an EPR experiment.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 674.925,
    "end": 677.826,
    "text": "Chris, could you say maybe a few words about how",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 679.065,
    "end": 705.991,
    "text": " that classical like how how the symmetry is broken between the quantum and classical channels i suspect it might have been mentioned that these are symmetrical but yet one of the two has to be a quantum and the other one is a classical channel the quantum channel um mediates some sort of unitary evolution is that correct whereas the classical channel is is like an information redundant redundancy reservoir um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 707.168,
    "end": 710.389,
    "text": " which maybe has to do something with object persistence.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 710.409,
    "end": 712.81,
    "text": "But I'm very much speculating at this point.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 712.83,
    "end": 715.652,
    "text": "So I'm not sure if, Chris, you have any comments.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 717.532,
    "end": 728.417,
    "text": "Yeah, well, an easy way to think about this, I think, is to actually think about a Bell EPR experiment where you have two observers that are separated in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 729.017,
    "end": 734.64,
    "text": "So you have to assume here, though, to talk about Bell EPR, you have to assume the notion of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 735.745,
    "end": 742.809,
    "text": " to have a laboratory reference frame in which the two observers are spatially separated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 745.771,
    "end": 760.841,
    "text": "And in that situation, then the two observers both independently collect data for some amount of time on multiple replicates of some quantum state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 763.42,
    "end": 765.041,
    "text": " that's produced by a source.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 765.141,
    "end": 769.565,
    "text": "So you have pairs of photons or pairs of electrons or pairs of whatever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 771.386,
    "end": 776.03,
    "text": "And at some point, the data collection stops.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 777.711,
    "end": 781.935,
    "text": "And at that point, the observers have to compare their results.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 783.916,
    "end": 789.541,
    "text": "So it's the comparison step that requires a classical channel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 792.02,
    "end": 815.399,
    "text": " And if you think about how this happens in practice, it happens via a file sent over the internet or a piece of paper on which the data are written that's handed by one of the experimenters to the other experimenter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 816.7,
    "end": 818.401,
    "text": "Or it happens by",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 819.284,
    "end": 821.346,
    "text": " the experimenters talking to each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 821.526,
    "end": 830.353,
    "text": "So one experimenter encodes a bunch of information in the ambient air and the other experimenter hears it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 833.436,
    "end": 836.959,
    "text": "Or it could be communicated by light signals, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 837.439,
    "end": 839.961,
    "text": "But it's always communicated by some medium.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 841.643,
    "end": 845.106,
    "text": "And that's what defines",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 846.192,
    "end": 847.553,
    "text": " classical communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 847.633,
    "end": 856.617,
    "text": "It's communication via a medium that persists through time in the observer's reference frame.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 859.418,
    "end": 868.162,
    "text": "And the minimum time of the persistence of that medium is given by the speed of light.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 869.326,
    "end": 897.433,
    "text": " so if the observers are a foot apart and they're communicating by a light signal then it may only last a nanosecond but if they're talking to each other you know it lasts several seconds and if they're if they exchange a piece of paper then that piece of paper may last for years in a lab notebook someplace so i'll",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 900.057,
    "end": 916.342,
    "text": " There's always the question of persistence over time that is deeply bound up with this notion of classicality as a process that takes time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 919.882,
    "end": 928.925,
    "text": "Information has to flow, has to be encoded in a medium and then read from that medium in some finite amount of time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 931.582,
    "end": 939.548,
    "text": " And in a sense, we're assuming something like that in the quantum description.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 940.728,
    "end": 959.802,
    "text": "When we think of this boundary via which the A and B, the physical components interact, if we think of that boundary as a qubit array, then each of those qubits persists through time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 960.939,
    "end": 970.545,
    "text": " And that's what allows them to encode classical information, so encode observational outcomes that are repeated in time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 972.646,
    "end": 981.711,
    "text": "That's what allows them to serve as a memory, to encode information in a way that's thermodynamically irreversible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 983.853,
    "end": 987.615,
    "text": "And if you think of the boundary in that way, as a qubit array,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 988.499,
    "end": 991.28,
    "text": " then it has a certain thickness in time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 994.342,
    "end": 996.623,
    "text": "It's two Planck times thick.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 998.504,
    "end": 1005.607,
    "text": "The Planck time is 10 to the minus 43 seconds, so it's unmeasurably small.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1006.648,
    "end": 1016.453,
    "text": "But the operation of interacting with a qubit is a physical interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1017.327,
    "end": 1022.811,
    "text": " that, from a relativistic point of view, has to take this minimal time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1024.992,
    "end": 1040.962,
    "text": "So it's, in a sense, persistence for times that are significantly longer than the Planck time that is the marker of classicality here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1043.944,
    "end": 1045.645,
    "text": "But even these Planck time,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1047.505,
    "end": 1059.412,
    "text": " Even persistence over the Planck time is a necessary ingredient for talking about communication, even quantum communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1061.873,
    "end": 1070.358,
    "text": "So it's a very, very deep concept with a very long philosophical history going back to the ship of Theseus and all that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1070.918,
    "end": 1075.261,
    "text": "People have been wondering about what does it mean to say that something persists through time?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1078.71,
    "end": 1085.254,
    "text": " Does anyone want to make a comment on that or bring in a new question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1087.696,
    "end": 1090.117,
    "text": "Please feel free to if you haven't brought up anything yet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1092.138,
    "end": 1097.641,
    "text": "Sure, I can speak more if you don't mind.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1097.661,
    "end": 1105.146,
    "text": "I also recall, and Chris, correct me if I'm wrong, we said that related to what you just said,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1107.318,
    "end": 1114.484,
    "text": " that a clock tick is always tantamount to one of these classical channels.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1114.845,
    "end": 1116.226,
    "text": "Is that correct?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1116.246,
    "end": 1117.787,
    "text": "Did I remember that correctly?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1117.807,
    "end": 1131.459,
    "text": "CHRISTOS PAPADIMITRIOUX- Chris?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1135.342,
    "end": 1141.506,
    "text": " Yeah, an internal clock tick corresponds to an irreversible right on the boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1144.268,
    "end": 1148.391,
    "text": "So one can then ask, what does it mean to say that that's irreversible?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1151.753,
    "end": 1154.135,
    "text": "What it means is it took some energy to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1155.556,
    "end": 1160.619,
    "text": "And if you go back to read that bit again,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1162.053,
    "end": 1168.855,
    "text": " there's at least a reasonably high probability that it still is in the same state that you wrote it in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1170.195,
    "end": 1177.377,
    "text": "And clearly that probability is going to degrade through time because that action is on the boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1178.017,
    "end": 1187.42,
    "text": "So whatever you've written, whatever bits that you've written are now exposed to the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1187.9,
    "end": 1190.441,
    "text": "So if Alice writes that they're now exposed to Bob,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1191.346,
    "end": 1216.994,
    "text": " to bob's dynamics so i'll as as time goes on by your internal clock or any external clock the probability of that memory being the same when you go back to read it slowly decreases or maybe it decreases fast and you know we know that from our own case our own memories degrade through time uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1218.433,
    "end": 1223.218,
    "text": " because the physical world's interacting with our brains in ways that we don't control.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1228.163,
    "end": 1231.906,
    "text": "Killing neurons or changing their activity or whatever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1233.868,
    "end": 1240.335,
    "text": "So whenever we talk about memory, it's always with this caveat that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1241.491,
    "end": 1247.675,
    "text": " The memory is exposed to the environment, and it's not guaranteed to be the same.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1248.776,
    "end": 1263.285,
    "text": "It's only kind of grace of the environment being reasonably benign that any of us have memories at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1263.966,
    "end": 1264.186,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1266.89,
    "end": 1293.702,
    "text": " And so this thermodynamic cost to classical information sharing or writing, is in a sense, would it be fair to say that in a sense, the price you have to pay to protect against decoherence or entangling this sector with the rest of the environment just to preserve its identity, would that be fair to say?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1295.634,
    "end": 1301.177,
    "text": " Yeah, I mean, you can think of decoherence as a good thing, or you can think of decoherence as a bad thing, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1301.717,
    "end": 1305.739,
    "text": "If you're trying to preserve a quantum state, then it's a bad thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1305.839,
    "end": 1313.583,
    "text": "You have to spend energy to prevent decoherence by cooling everything down to millikelvins.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1316.344,
    "end": 1321.507,
    "text": "But if you're interested in preserving classical data, then decoherence is a good thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1322.724,
    "end": 1330.907,
    "text": " because it prevents your classical data from being completely rearranged by becoming entangled with the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1332.027,
    "end": 1344.352,
    "text": "So, I mean, think about trying to write classical memories using the states of atoms in the middle of the sun and the temperature so high that...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1347.701,
    "end": 1348.703,
    "text": " You can't do anything.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1348.883,
    "end": 1353.17,
    "text": "You can't rearrange the atoms in any way and expect them to stay put.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1354.432,
    "end": 1361.502,
    "text": "So there you're in effectively a completely quantum environment just because of the high temperature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1361.823,
    "end": 1363.025,
    "text": "So it's a plasma.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1368.274,
    "end": 1376.119,
    "text": " Yeah, and then just one final question that popped to my mind as you say this, and I can certainly leave it here for everyone else.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1379.199,
    "end": 1398.735,
    "text": " So if we're trying to protect against random loss, against the loss of information, I suppose it really begs the question of what is the source of this noise that can perturb the bits in the boundary?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1400.497,
    "end": 1402.138,
    "text": "There's obviously this...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1403.539,
    "end": 1412.289,
    "text": " distinction between thermal and quantum noise you know again it's a stretch to see if we can think back about the weak rotation about that but um",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1413.726,
    "end": 1425.834,
    "text": " Again, I recall earlier sessions where we talk how the noise here in this quantum theoretic picture of information processing is coming from the QRS failing to be aligned.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1427.615,
    "end": 1434.479,
    "text": "Then, you know, you hear about notions of quantum noise versus thermal noise.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1435.64,
    "end": 1437.842,
    "text": "Chris, do you have any comments on all of that?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1440.343,
    "end": 1442.985,
    "text": "Yeah, I think an important point",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1449.956,
    "end": 1450.637,
    "text": " Let me back up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1453.42,
    "end": 1463.91,
    "text": "The notion of noise, like so many other notions, is very often treated as objective, as observer-independent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1465.723,
    "end": 1474.77,
    "text": " And so when we're doing classical physics, we think of noise as just, you know, there's some objective randomness in the universe, and we call that noise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1476.191,
    "end": 1483.135,
    "text": "So in this picture, because we're working with just a bipartite decomposition, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1483.175,
    "end": 1485.117,
    "text": "We just have Alice and Bob, and that's it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1485.237,
    "end": 1489.42,
    "text": "That's the entire universe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1489.94,
    "end": 1495.144,
    "text": "There's no external environment here to impose any sort of noise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1496.237,
    "end": 1518.688,
    "text": " But since we only have two systems, Alice and Bob equals everything else, not Alice, then if we talk about Bob being a noisy environment, that's clearly relative to this boundary we've drawn between Alice and Bob.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1518.768,
    "end": 1521.59,
    "text": "So noise isn't observer-independent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1521.65,
    "end": 1525.972,
    "text": "What's noise for Alice is just Bob's dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1527.836,
    "end": 1528.697,
    "text": " Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1529.637,
    "end": 1546.687,
    "text": "So if you think about where these systems come from, you've got some universe that is in some pure state because it's an isolated system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1548.308,
    "end": 1556.953,
    "text": "And that state is evolving through time, which means it's just undergoing phase rotation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1558.729,
    "end": 1561.55,
    "text": " So there's no noise in that system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1562.83,
    "end": 1565.191,
    "text": "It's perfectly unitary, et cetera, et cetera.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1565.211,
    "end": 1577.134,
    "text": "And as soon as you draw a boundary, then there's information that the system on one side of the boundary doesn't have about the system on the other side.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1578.554,
    "end": 1584.836,
    "text": "So the individual systems are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1591.756,
    "end": 1595.078,
    "text": " their states can now be considered conditionally independent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1595.219,
    "end": 1600.062,
    "text": "I mean, you can come up with a description in which their states are conditionally independent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1601.283,
    "end": 1620.236,
    "text": "And that just means that what the other side is doing looks like noise unless Alice, say, can come up with a way of analyzing the data that she sees on her boundary",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1621.728,
    "end": 1623.069,
    "text": " in a way that makes it make sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1624.709,
    "end": 1629.991,
    "text": "And then we say it's information for Alice, but what does that mean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1630.571,
    "end": 1637.833,
    "text": "It just means it's behavior on her boundary that she's smart enough to assign some kind of semantics to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1641.334,
    "end": 1645.235,
    "text": "And if she's not smart enough to do that, then it's just noise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1646.796,
    "end": 1646.916,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1650.307,
    "end": 1658.931,
    "text": " So as soon as you make the notion of noise observer dependent, it turns into something that makes a lot more sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1665.094,
    "end": 1675.479,
    "text": "And just to really finish this, I guess it's been a couple of months at least, but I think it was back in July that we talked about",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1677.728,
    "end": 1697.102,
    "text": " the distinction between what you're saying, which is things having the appearance of noise just because you have finite resources, so you cannot make sense of Bob's internal dynamics, as opposed to in that cartoon of the four possibilities for QRF alignments, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1697.202,
    "end": 1705.588,
    "text": "Some of them were thermal in the sense that one side was acting on a boundary qubit while the other one was not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1705.668,
    "end": 1707.169,
    "text": "So then it truly looks like",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1708.686,
    "end": 1709.947,
    "text": " like noise to the other side.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1709.967,
    "end": 1718.173,
    "text": "Does that get to the bottom of the distinction between quantum and thermal noise at all, Chris, or am I misunderstanding things here?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1718.994,
    "end": 1726.82,
    "text": "Yeah, it turns the distinction into essentially a relative, a QRF relative distinction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1727.801,
    "end": 1727.981,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1732.952,
    "end": 1734.733,
    "text": " I mean, languages provide a good example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1734.953,
    "end": 1741.616,
    "text": "I mean, think of going to someplace where you don't understand the language at all, you know, Papua New Guinea or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1743.136,
    "end": 1747.238,
    "text": "I certainly wouldn't understand the language.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1747.738,
    "end": 1759.103,
    "text": "That language, the behavior of speaking that language encodes lots of information for those people, and it encodes no information at all for me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1760.18,
    "end": 1762.301,
    "text": " So it looks like noise to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1762.421,
    "end": 1763.442,
    "text": "I can't make sense of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1764.522,
    "end": 1766.804,
    "text": "But it's not noise from their point of view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1769.845,
    "end": 1789.616,
    "text": "And now let's think about this need to have a thermodynamic sector if you're an organism that has to burn energy or any system that has to burn energy to act irreversibly on your environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1792.028,
    "end": 1794.91,
    "text": " That thermodynamic sector looks to you like noise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1796.35,
    "end": 1798.411,
    "text": "It's just temperature, heat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1801.013,
    "end": 1806.155,
    "text": "And you use that heat to drive your processing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1806.635,
    "end": 1816.42,
    "text": "And if you're a really good heat engine, then you can use it pretty efficiently and get a lot of bang for the buck in terms of information processing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1817.193,
    "end": 1828.522,
    "text": " If you're a really inefficient heat engine, then maybe you have to use almost your entire environment as heat to do any little bit of information processing at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.164,
    "end": 1835.188,
    "text": "So that's not a statement about the universe as a whole.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1835.288,
    "end": 1843.235,
    "text": "That's a statement about you and your information processing capabilities and your thermal capabilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1844.147,
    "end": 1846.228,
    "text": " your heat processing capabilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1847.529,
    "end": 1855.032,
    "text": "How good is your Carnot cycle determines the amount of information processing you can do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1857.653,
    "end": 1858.474,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1858.754,
    "end": 1858.834,
    "text": "Ian?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1867.291,
    "end": 1867.331,
    "text": " Hi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.392,
    "end": 1870.954,
    "text": "Yeah, thank you everyone for putting on this series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.974,
    "end": 1873.957,
    "text": "It's the first time I've joined the discussion sessions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.737,
    "end": 1884.205,
    "text": "And yeah, so it's a question about in one of the slides, there was a green rectangle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.626,
    "end": 1891.892,
    "text": "And we were talking about that being a, or Chris was talking about that being a kind of thinking of that as a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.049,
    "end": 1893.65,
    "text": " bacterium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.27,
    "end": 1903.779,
    "text": "And it got me wondering whether I think how else I could get an intuitive grasp of this kind of space time emerging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.221,
    "end": 1913.968,
    "text": "And so what I was thinking is, you know, it appears like to us humans, it appears like the universe is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.865,
    "end": 1927.45,
    "text": " expanding um through time and i was just trying to think you know a bacterium sing if you placed a single bacterium on a petri dish um at time zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.136,
    "end": 1955.125,
    "text": " and or even something more simple you know let's say deep sea hydrothermal vent where life was supposed to are you know these um agents were supposed to have maybe begun existing as um phospholipid type molecules so i was just wondering you know if i was if i was a phospholipid within that bacterial membrane um just a single one single phospholipid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.428,
    "end": 1983.407,
    "text": " and all I can measure is the existence of phospholipidness or not phospholipidness and selfness and not selfness, then, you know, I was just trying to imagine as this bacteria divides after 20 minutes, let's say the average sort of bacterial division time, then before that happened, all I could tell was I was surrounded by phospholipidness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.587,
    "end": 1985.248,
    "text": "So there was no real distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.383,
    "end": 2002.691,
    "text": " my environment but once um the bacteria is divided into two then i'm sitting then i'm observing some phospholipidness which isn't in my sort of what i call my own boundary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.989,
    "end": 2009.574,
    "text": " Um, so then I've kind of created space, space and time is starting to appear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.594,
    "end": 2019.462,
    "text": "Um, even though the Petri dish hasn't changed in size or my, you know, the universe hasn't really changed, but it's the, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.878,
    "end": 2025.959,
    "text": " phospholipids, the orientation of the phospholipids.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.339,
    "end": 2029.04,
    "text": "So yeah, I kind of, I was just trying to liken it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.28,
    "end": 2040.764,
    "text": "If this is a scale invariant principle, how can we liken it to how other things might experience space and time emerging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.144,
    "end": 2041.984,
    "text": "That's where I was coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.084,
    "end": 2045.225,
    "text": "Am I kind of totally barking up the wrong tree with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.645,
    "end": 2046.926,
    "text": "Or is there, is that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.238,
    "end": 2051.301,
    "text": " No, I think that's a really good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2051.561,
    "end": 2059.028,
    "text": "And I think you're constructing a very good kind of thought experiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2060.749,
    "end": 2072.82,
    "text": "And it's this sort of question that I'm really going to try to address in October of how can we think about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2074.232,
    "end": 2085.697,
    "text": " DfEP is a scale theory in practice as applying at the level of macromolecules, as you were just describing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2085.717,
    "end": 2093.781,
    "text": "How do we come up with a description of what a phospholipid, say, can actually measure?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2095.322,
    "end": 2097.323,
    "text": "What actually affects its state?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2099.156,
    "end": 2104.158,
    "text": " And to what extent does it have a self-representation?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2106.659,
    "end": 2109.16,
    "text": "My guess is that a phospholipid probably doesn't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2110.58,
    "end": 2115.442,
    "text": "But a bacterium seems to have at least some degree of self-representation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2115.502,
    "end": 2119.663,
    "text": "I mean, it has an immune system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2120.264,
    "end": 2121.164,
    "text": "It can feel stress.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2122.981,
    "end": 2129.824,
    "text": " So it's starting to seem like an organism that's not that different from us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2133.646,
    "end": 2150.353,
    "text": "But even something like E. coli, it certainly behaves in what we call space, but it's at least not clear to me that it has a representation of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2154.744,
    "end": 2165.368,
    "text": " Although there are processes in the E. coli that do distinguish, say, the two ends of the E. coli.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2165.408,
    "end": 2172.791,
    "text": "I mean, even if you think of the chemotaxis pathway, the two ends of that pathway are quite distinct functionally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2174.172,
    "end": 2179.174,
    "text": "So perhaps E. coli has a one-dimensional representation of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2179.254,
    "end": 2182.315,
    "text": "It can tell its anterior end from its posterior end.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2183.476,
    "end": 2190.919,
    "text": " but perhaps it doesn't have any representation of what we would call left and right or up and down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2195.541,
    "end": 2203.825,
    "text": "But if you look at multicellular organisms, even something like, say, hydra,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2207.691,
    "end": 2212.015,
    "text": " is a spatially quite sophisticated kind of thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2212.155,
    "end": 2213.436,
    "text": "I mean, it's not bilateral.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2214.097,
    "end": 2215.578,
    "text": "It's cylindrically symmetrical.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2218.32,
    "end": 2234.974,
    "text": "But it's got a very large distinction between anterior and posterior, and it seems to know quite a bit, at least I understand from people who work on Hydra, about its own body, the state of its own body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2237.089,
    "end": 2244.554,
    "text": " And so I think these are exactly the same kinds of questions that we should be asking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2244.694,
    "end": 2248.896,
    "text": "And they also apply at the scale that's much larger than us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2249.317,
    "end": 2259.763,
    "text": "So if we think about a human society, for example, as an agent, what can that agent measure?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2260.583,
    "end": 2263.005,
    "text": "And what can that agent represent?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2267.853,
    "end": 2270.414,
    "text": " How complex can that agent's cognition be?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2271.814,
    "end": 2278.155,
    "text": "And I think those questions are all essentially open.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2280.396,
    "end": 2282.276,
    "text": "So yeah, it's a great thought experiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2283.076,
    "end": 2286.577,
    "text": "I think it addresses exactly the questions that we're interested in addressing here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2288.597,
    "end": 2289.457,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2289.957,
    "end": 2292.498,
    "text": "Harris, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2295.179,
    "end": 2297.239,
    "text": "Yes, thank you once again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.335,
    "end": 2300.637,
    "text": " for allowing me to be here with all of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.238,
    "end": 2303.299,
    "text": "Interesting as always.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.019,
    "end": 2320.731,
    "text": "So I have a question that is related to this notion of the dual aspect of information, basically, that the meaning of information is not just a matter of interpretation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.633,
    "end": 2327.977,
    "text": " but rather it is rooted in the physical properties of the system under investigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.838,
    "end": 2345.369,
    "text": "So basically that, as I understand it, means, translates that the meaning of information is not separate from the physical properties of the system under investigation, but it is rather an intrinsic part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.337,
    "end": 2373.372,
    "text": " So, I am also familiar with this notion from the theory of computation called the Embraer-Mans limit, that is a limit on the maximum rate of computation that can be achieved, let's say, in a self-contained system within the material universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.152,
    "end": 2375.333,
    "text": "So my question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.092,
    "end": 2391.249,
    "text": " How can we parse, let's say, that sort of computational limit in terms of information processing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.274,
    "end": 2395.554,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.533,
    "end": 2431.264,
    "text": " I am not sure that we can talk about a... I think it's very difficult to talk about the classical information processing capability of the universe as a whole.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2436.277,
    "end": 2439.819,
    "text": " I mean, one has to impose some sort of classical description.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2440.959,
    "end": 2444.821,
    "text": "And the question is then, where does that description come from?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2445.762,
    "end": 2452.705,
    "text": "And from kind of whose point of view is that a description?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2454.146,
    "end": 2464.811,
    "text": "But certainly, as soon as you partition the universe as a whole into some system and some other system,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2467.791,
    "end": 2474.133,
    "text": " one can immediately talk about their information processing capabilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2477.234,
    "end": 2489.357,
    "text": "And then the question becomes quantum information processing capabilities versus classical information processing capabilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2491.818,
    "end": 2491.978,
    "text": "And",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2495.979,
    "end": 2515.665,
    "text": " If you're looking at classical information processing, to the extent that it's not reversible, it requires energy, and so one can immediately derive limits based on the free energy access of that system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2520.635,
    "end": 2538.348,
    "text": " If you're talking about reversible information processing, which purely quantum information processing is, then you don't have that energetic requirement, but you also don't have a well-defined answer in any classical terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2540.67,
    "end": 2547.235,
    "text": "And it's only if Alice is your system of interest,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2548.063,
    "end": 2560.095,
    "text": " that's able to do quantum information processing, then it's only her interaction partner, Bob, who can use her as a quantum computer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2561.337,
    "end": 2570.266,
    "text": "And then his ability to employ Alice as a quantum computer",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2571.69,
    "end": 2583.361,
    "text": " is limited by his classical information processing capabilities, because he has to define a classical input and a classical output.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2583.381,
    "end": 2594.891,
    "text": "I think this question becomes very complicated as soon as it is cast in these observer-relative terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2600.114,
    "end": 2600.895,
    "text": " Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2601.155,
    "end": 2604.197,
    "text": "But such limits clearly exist, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2604.978,
    "end": 2607.459,
    "text": "They just require certain assumptions to define them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2611.382,
    "end": 2619.288,
    "text": "So quantum information can indeed be understood as a kind of dual to the classical information, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.308,
    "end": 2621.51,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.579,
    "end": 2637.262,
    "text": " And it's essentially one of these bulk boundary type dualities that seem now to be ubiquitous in physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2638.403,
    "end": 2653.828,
    "text": "If we just think in terms of the holographic principle, you can have quantum processing going on in the bulk in the system that has a boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2655.271,
    "end": 2662.516,
    "text": " And that can encode, that can read classical information from the boundary and encode classical information on the boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2663.977,
    "end": 2671.943,
    "text": "And the quantitatively, the holographic principle tells you how much, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2672.023,
    "end": 2675.586,
    "text": "What can the maximum entropy, classical entropy of the boundary be?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2675.606,
    "end": 2675.666,
    "text": "But",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2681.212,
    "end": 2693.875,
    "text": " What it doesn't tell you is anything about the semantics that either the system inside assigns to the information or any observer outside assigns to the information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2695.375,
    "end": 2696.955,
    "text": "It's just a quantitative statement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2699.316,
    "end": 2704.577,
    "text": "So in any setting that's characterized by that principle,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2707.775,
    "end": 2720.918,
    "text": " the classical information on the boundary is dual in an interesting sense to the quantum processing that's going on inside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2723.558,
    "end": 2732.4,
    "text": "That classical information on the boundary encodes everything that an external observer can know about what's going on in the inside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2736.772,
    "end": 2737.172,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2737.192,
    "end": 2741.396,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2742.277,
    "end": 2749.502,
    "text": "Ana, and then Dean after.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2749.523,
    "end": 2750.583,
    "text": "Hi, thank you very much.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2751.064,
    "end": 2757.949,
    "text": "I'm also new to your active inference and your course.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2759.17,
    "end": 2763.594,
    "text": "I just want to say that unfortunately I work with humans and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2767.01,
    "end": 2794.455,
    "text": " but and I say unfortunately because the complexities are horrific so having said that maybe my question will make sense so as I'm learning about quantum information theory and I'm what I'm trying to do is assess",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2796.343,
    "end": 2823.844,
    "text": " how can this help me answer questions that I have in the systems that I work with my question is in order to have a time arrow irreversible process don't you need to have a goal and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2825.09,
    "end": 2831.095,
    "text": " And so my question is, does it matter to even worry about goals?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2832.076,
    "end": 2849.051,
    "text": "Because as I listen to all the descriptions and I think about Alice and Bob and systems, I immediately think about, well, so much of what we're talking about depends upon the goal of the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2850.742,
    "end": 2863.69,
    "text": " And in some very abstract way, it seems to me that there is a goal that's driving the need for the boundary, the need for the communication.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2866.451,
    "end": 2877.778,
    "text": "And so I'm so obsessed with this question that I wanted to ask it early on before I proceed with my learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2881.557,
    "end": 2883.218,
    "text": " Yeah, that's a very good question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2885.12,
    "end": 2907.519,
    "text": "You can think of the whole free energy principle as a way of describing physical systems in a way that makes their behavior as agents obvious.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2909.583,
    "end": 2926.066,
    "text": " And so you could state the FEP by saying that every system has a goal, and its goal is minimizing prediction error.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2926.086,
    "end": 2938.889,
    "text": "Or to put it positively, its goal is to predict and therefore respond to its environment's actions,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2940.347,
    "end": 2943.228,
    "text": " in a way that preserves its own identity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2944.329,
    "end": 2951.891,
    "text": "And I don't know whether you've read much of Carl Fristen's work, but he uses the word self-evidencing a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2952.712,
    "end": 2961.755,
    "text": "It says the goal of any system is to generate evidence of its own existence, which sounds very psychological.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2962.375,
    "end": 2969.618,
    "text": "And Carl, interestingly enough, studied first as a psychiatrist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2970.905,
    "end": 2978.893,
    "text": " So I expect that his point of view is actually very consonant with your question and where you're coming from here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2982.157,
    "end": 2986.101,
    "text": "Yeah, actually, I started... Oh, I'm sorry, I didn't mean to interrupt.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2987.182,
    "end": 2987.923,
    "text": "No, no, go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2988.944,
    "end": 2993.048,
    "text": "No, I started... I spent some time reading...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2995.834,
    "end": 3009.193,
    "text": " Chris Lyson's ideas and work on the free energy principle and self-evidencing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3009.894,
    "end": 3012.457,
    "text": "And yes, I will continue to dig deep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3014.141,
    "end": 3027.728,
    "text": " The problem is, so I'm an anthropologist, and I've worked with Indigenous peoples and spent 20 years of my life living in these small-scale societies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3029.889,
    "end": 3036.052,
    "text": "And so one of my observations is that, and that I find really fascinating, is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3038.424,
    "end": 3041.545,
    "text": " but we don't have a good understanding of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3041.625,
    "end": 3054.387,
    "text": "And that's why I decided to dig into physics as information processing, which is that goals are constantly being negotiated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3055.908,
    "end": 3066.87,
    "text": "And it's more along the lines of, so Michael Levine's work actually was what led me to explore quantum information",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3068.058,
    "end": 3089.114,
    "text": " theory which is you know like this collective intelligences that are exist within systems and so at each level of collective intelligence it's not just that you have a collective intelligence",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3090.296,
    "end": 3109.761,
    "text": " dictating a goal but that those goals are being negotiated uh as different as the environments change and as relationships between the systems change so i know these these are uh very big questions but if you could just like help me uh",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3113.846,
    "end": 3120.31,
    "text": " give me some thoughts on what your thoughts have been about these kinds of questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3123.852,
    "end": 3139.041,
    "text": "Yeah, I think you're pointing to something very important here, and this is a question that this kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3140.126,
    "end": 3153.793,
    "text": " free energy principle-based work motivates immediately when you consider a system that comprises a bunch of subsystems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3156.554,
    "end": 3162.217,
    "text": "You know, I work with Michael Levin at Tufts in developmental biology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3163.638,
    "end": 3169.561,
    "text": "And one of his slogans is, all intelligence is collective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3171.403,
    "end": 3183.853,
    "text": " And that immediately brings up this issue of how do these components, as you put it, negotiate their goals?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3183.933,
    "end": 3187.196,
    "text": "How do they collaborate?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3187.296,
    "end": 3188.116,
    "text": "How do they compete?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3188.717,
    "end": 3194.341,
    "text": "To what extent are they trying to deceive each other or coerce each other or all of this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3195.702,
    "end": 3200.166,
    "text": "And we're trying to apply this in a cell biology context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3202.265,
    "end": 3206.046,
    "text": " as a description of development and morphogenesis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3206.446,
    "end": 3211.408,
    "text": "If you think about cells in a developing organism, they're constantly facing new environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3212.888,
    "end": 3215.008,
    "text": "Their capabilities are constantly changing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3216.429,
    "end": 3219.55,
    "text": "And how they interact with each other is constantly changing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3220.51,
    "end": 3223.831,
    "text": "And this all seems very psychological or sociological.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3224.791,
    "end": 3224.991,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3225.866,
    "end": 3243.841,
    "text": " So I think what you're pointing to is the ubiquitous need for this kind of language in areas other than the human sciences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3244.021,
    "end": 3247.004,
    "text": "I mean, it's language that's developed within the human sciences",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3247.961,
    "end": 3254.946,
    "text": " that it's language that seems to be important at much smaller scales.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3255.827,
    "end": 3264.734,
    "text": "And clearly, one would anticipate it being important in much larger scales, the scales of countries or civilizations or whatever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3270.476,
    "end": 3294.817,
    "text": " guess my answer is yes this is an extremely important point of view with very broad implications for how we think about biology at least thank you thank you definitely looking forward to your continued learnings and journey thank you dean",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3297.659,
    "end": 3303.003,
    "text": " Yeah, my question has changed three times because just the other questions that have come up in the meantime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.226,
    "end": 3311.71,
    "text": "So some context here, Chris, you've kind of answered this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3311.77,
    "end": 3314.092,
    "text": "You mentioned dual as in D-U-A-L.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3314.901,
    "end": 3320.766,
    "text": " And then Anna brought up, like, is there some kind of competition, a dual, a D-U-E-L going on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3320.786,
    "end": 3322.508,
    "text": "And how do we put those two things together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3322.528,
    "end": 3325.871,
    "text": "And me always thumping the table about minimum two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.011,
    "end": 3331.996,
    "text": "We have to keep at least two truisms up at once if we're going to gain some sense around things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.016,
    "end": 3338.182,
    "text": "I want to go back to that LOCC slide if we can for a second, because, Chris, you mentioned",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.571,
    "end": 3341.492,
    "text": " Your statement was you draw a boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3341.673,
    "end": 3345.035,
    "text": "To me, there's a lot of information packed in those four words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.757,
    "end": 3350.659,
    "text": "You can draw and you can undraw, you can bound, you can unbound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3351.44,
    "end": 3359.525,
    "text": "Those are perfectly context-less subject matter information carrying frames.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.346,
    "end": 3368.432,
    "text": "But you also have in that packet you and at, which are imperfect orientations, an indefinite article and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3369.119,
    "end": 3373.5,
    "text": " All of us occupying a slide here, none of us claiming to be anything other than a contradiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.421,
    "end": 3385.684,
    "text": "So one aspect of that packet, two words of it, literally half of it is perfectly contextless and is information carrying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3385.724,
    "end": 3392.006,
    "text": "And the other literally half of that is prediction matter or information graphing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.526,
    "end": 3398.768,
    "text": "It's literally the byproduct or the space time construct that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.252,
    "end": 3400.052,
    "text": " is included.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3400.872,
    "end": 3408.274,
    "text": "So I guess what I'm wondering is, is how do we make these different matters, the subject matter and the prediction matter tango?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3408.334,
    "end": 3410.315,
    "text": "How do we get them to relate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.395,
    "end": 3415.856,
    "text": "Because in the session five, you went on a detour.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.876,
    "end": 3422.357,
    "text": "You said, we'll take a detour, which is, it holds this exact same structure as you draw a boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.898,
    "end": 3428.859,
    "text": "So there's perfect information and there's imperfect information in that they're dancing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.383,
    "end": 3430.604,
    "text": " We do this all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.624,
    "end": 3434.966,
    "text": "This seems to me at a minimum what information theory is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.746,
    "end": 3447.911,
    "text": "And that's why I want to kind of go back to this slide because this slide was in a much earlier session, but it got to session five where the context could be recapitulated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3448.572,
    "end": 3455.975,
    "text": "And so I'm wondering whether or not we can really talk about quantum information without the classical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3457.494,
    "end": 3462.176,
    "text": " Or if that's even possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.856,
    "end": 3468.298,
    "text": "Well, I'll go back to Bohr's statement in his 1928 paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3469.858,
    "end": 3472.019,
    "text": "He basically said the answer to that question is no.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3474.959,
    "end": 3484.803,
    "text": " that we are humans, we have to communicate with each other, we have to do it in language, and that's classical communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3486.084,
    "end": 3499.049,
    "text": "And while we are doing that, while we're having this conversation, we can't be worried about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3500.134,
    "end": 3503.576,
    "text": " the question of, do I still exist?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3504.496,
    "end": 3506.437,
    "text": "Or do you still exist?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3507.878,
    "end": 3521.486,
    "text": "We can worry about that question, but we can't do it at the same time that we're having this conversation about the theory of lot protocols or exchanging data from a Bell EPR experiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3523.287,
    "end": 3527.109,
    "text": "And that's, of course, deeply paradoxical.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3529.76,
    "end": 3533.562,
    "text": " And I think that's just the situation we're in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3533.582,
    "end": 3538.305,
    "text": "You said none of us are claiming to be anything other than a contradiction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3539.706,
    "end": 3549.071,
    "text": "It's a good thing that we are self-conscious about the fact that we're doing something contradictory here or potentially contradictory here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3551.592,
    "end": 3558.716,
    "text": "A colleague and I wrote a paper several years ago called Science Generates Limit Paradoxes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3560.738,
    "end": 3570.323,
    "text": " And we basically rehearsed a version of this very discussion that we're having right now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3572.885,
    "end": 3589.154,
    "text": "And the upshot of that paper is that in any situation in which a science can turn its theoretical apparatus onto its own practice,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3590.678,
    "end": 3607.569,
    "text": " So, for example, when physics can turn this analysis of boundaries onto the practice of physics, then it generates paradoxes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3609.15,
    "end": 3619.798,
    "text": "And those paradoxes have a particular structure, which is the structure that Priest, I can't remember his first name,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3621.196,
    "end": 3629.883,
    "text": " a logician who works in non-dialethic logic, calls a limit paradox.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3631.204,
    "end": 3642.932,
    "text": "And all of this is coupled to Gödel's theorem and these other paradoxes of self-reference or aspects of self-reference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3645.794,
    "end": 3650.178,
    "text": "But I think this situation really is ubiquitous and inescapable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3651.349,
    "end": 3677.983,
    "text": " that as soon as we apply the tools of science to the practice of science, we generate these paradoxical situations in which we have to acknowledge that we are entities of a certain sort and that we are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3680.669,
    "end": 3695.275,
    "text": " constructing our theories using a faculty of imagination that lets us act as if we don't have a point of view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3699.036,
    "end": 3703.518,
    "text": "So it lets us act as if what we're talking about is point of view independent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3705.953,
    "end": 3711.959,
    "text": " But our theories themselves tell us that we have points of view and that they're important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3713.301,
    "end": 3716.344,
    "text": "So we're stuck in this paradoxical situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3716.905,
    "end": 3727.656,
    "text": "I don't know whether that's what you're trying to point to here, but it's what I immediately leap to hearing what you said.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3739.571,
    "end": 3741.093,
    "text": " Yeah, a lot there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3741.333,
    "end": 3743.316,
    "text": "Anyone else want to add a piece?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3750.504,
    "end": 3751.646,
    "text": "No, I'm going to have to go away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3752.367,
    "end": 3752.988,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3753.408,
    "end": 3754.77,
    "text": "We'll stay for a few minutes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3754.99,
    "end": 3755.491,
    "text": "Thank you, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3755.511,
    "end": 3756.292,
    "text": "This was awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3756.452,
    "end": 3757.733,
    "text": "We're really looking forward to Lecture 6.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3759.986,
    "end": 3760.746,
    "text": " Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3760.866,
    "end": 3761.427,
    "text": "Thank you all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3761.507,
    "end": 3763.848,
    "text": "And thank you all for attending this discussion session.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3763.928,
    "end": 3773.291,
    "text": "It's nice to have this kind of real-time discussion, which is missing during the actual lecture sessions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3773.611,
    "end": 3774.452,
    "text": "So I appreciate it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3775.232,
    "end": 3775.692,
    "text": "Thanks again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3776.532,
    "end": 3776.852,
    "text": "See you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3776.872,
    "end": 3777.233,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3777.953,
    "end": 3778.573,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3780.494,
    "end": 3782.355,
    "text": "Ciao.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3783.515,
    "end": 3785.276,
    "text": "Kate, do you want to ask anything?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3785.356,
    "end": 3788.617,
    "text": "Or anyone can just bring up anything they're thinking right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3790.95,
    "end": 3792.211,
    "text": " Nothing in particular.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3792.251,
    "end": 3797.592,
    "text": "I'm just really looking forward to the last lecture on the biology of it all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3801.913,
    "end": 3802.273,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3805.814,
    "end": 3808.795,
    "text": "Well, any other thoughts or questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3808.915,
    "end": 3814.837,
    "text": "Or if anyone in the live chat has a thought or a question, they can write it and we'll read it in the coming minutes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3818.476,
    "end": 3821.739,
    "text": " Well, I just wanted to thank you for creating the space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3823.26,
    "end": 3841.838,
    "text": "It's been absolutely amazing that I was able to find this situation where people are talking about enormous questions and very difficult questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3845.857,
    "end": 3869.604,
    "text": " And I just want, I just thought I'd share that I, um, find in academia, there's, I don't know why we're not having these conversations and I've been, um, it's been like a 10 year journey and I have finally found this group.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3870.904,
    "end": 3873.745,
    "text": "I just wanted to express my gratitude.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3876.087,
    "end": 3876.507,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3878.408,
    "end": 3882.129,
    "text": "I'll read a question from the live chat and anyone can give their thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3883.549,
    "end": 3892.131,
    "text": "So Mills8102 wrote, it seems that consilience would aim to ameliorate the problems of self-reference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3892.852,
    "end": 3896.373,
    "text": "Is this a category of solution that seems valuable or fraught?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3900.754,
    "end": 3904.475,
    "text": "Could consilience ameliorate the problems of self-reference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3911.192,
    "end": 3911.772,
    "text": " Yes, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3912.653,
    "end": 3914.793,
    "text": "Can I just ask a different question built on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.113,
    "end": 3922.096,
    "text": "Which is, what if the contradiction is a feature as opposed to a fraughtness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3928.498,
    "end": 3929.598,
    "text": "Do I contradict myself?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3929.678,
    "end": 3930.339,
    "text": "Very well, then.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3930.479,
    "end": 3931.519,
    "text": "I contain multitudes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3931.559,
    "end": 3932.679,
    "text": "There's the Whitman angle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3933.28,
    "end": 3935.72,
    "text": "Then there's the William Blake.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3937.001,
    "end": 3939.622,
    "text": "Life is a fiction and is made up of contradiction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3940.683,
    "end": 3944.486,
    "text": " So what is the problem of self-reference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3949.969,
    "end": 3951.13,
    "text": "Whose problem is it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3951.55,
    "end": 3951.891,
    "text": "Harris?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3953.272,
    "end": 3965.48,
    "text": "Yeah, I will try to answer a bit, to tackle a bit both questions by offering my views from the cognitive science perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.479,
    "end": 3979.448,
    "text": " Basically, I think it has to do with consilience, has to do with the numerous co-creative bias that we all are, let's say, subjected to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.888,
    "end": 3985.732,
    "text": "So there is a very long list of co-creative biases, and there are more than 100 listed, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.707,
    "end": 4001.592,
    "text": " This is one of the challenges in terms of achieving, let's say, good levels of consilience across various domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.572,
    "end": 4005.093,
    "text": "So this is what I wanted to add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.955,
    "end": 4016.017,
    "text": "Another thought on that is consilience, though it can mean many things, synthesis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4018.018,
    "end": 4018.678,
    "text": "Sorry, you did.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4019.019,
    "end": 4019.819,
    "text": "Oh, yeah, please, Ana, go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4020.495,
    "end": 4032.146,
    "text": " Oh yeah, I just, so I don't really have insights into the self-referencing problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4032.306,
    "end": 4036.07,
    "text": "I need to do a lot of thinking about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4036.61,
    "end": 4045.719,
    "text": "But coming from training in evolutionary biology and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4047.395,
    "end": 4073.497,
    "text": " spending you know graduate school postgraduate school working on explanations where we thought of many hypotheses models etc based on a goal which is organisms are designed to maximize their fitness and of course there are lots of you know that there are lots of problems with that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4074.864,
    "end": 4082.968,
    "text": " And it turns out with our data, what we found is that was not the case in the populations that we're working with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4083.428,
    "end": 4086.829,
    "text": "Too often, the goal did not seem to be fitness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4090.201,
    "end": 4108.109,
    "text": " But what that experience gave me is that there was something we could hang on to in order to allow ourselves to propose models for why humans behave the way they do and the decisions that they make.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4110.571,
    "end": 4113.652,
    "text": "So that's why I go back to goals because if...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4118.698,
    "end": 4133.288,
    "text": " if whatever level of collective intelligence we're talking about, there is a goal, then even, and Harris, please let me know if this will be correct, that even cognitive biases exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4134.129,
    "end": 4142.915,
    "text": "They exist because there is some goal, and therefore we can talk about cognitive biases with respect to some goals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4146.314,
    "end": 4164.387,
    "text": " yes there is some sort of teleonomy in conscious agents or personal systems as i call them and it has to do with with course yes and cognitive biases and and the limitations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.857,
    "end": 4190.69,
    "text": " the knowledge let's say maybe it's limitations on parts of the knowledge representation that each of us has and maybe there are limitations in terms of access to to knowing and there are various forms of knowing so it depends it depends on many things and uh for example one of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.03,
    "end": 4207.807,
    "text": " Cognitive bias that I believe can have a negative impact on consilience, let's say, in addressing this self-referentiality will be the halo effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.304,
    "end": 4230.271,
    "text": " So where you seem to prioritize, let's say, or give some advantage to some types of individuals, ideas, or even theories, because of that, hell, or whatever reason that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4230.531,
    "end": 4237.654,
    "text": "It is based on maybe on many different things, maybe on your past history or other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.375,
    "end": 4242.756,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4242.976,
    "end": 4247.398,
    "text": "Anna, and if I may add something rather briefly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4247.758,
    "end": 4260.923,
    "text": "Your question reminded me of Levin's, and I think it was written with Phil, the proposal about reduction of stress as a goal that guides the emergence of collective structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4260.943,
    "end": 4265.505,
    "text": "One of the papers formulated that that seems to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4266.687,
    "end": 4273.736,
    "text": " the goal that drives things as they grow in complexity, reduction of collective stress or reduction of stress at any level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4274.817,
    "end": 4279.864,
    "text": "Yeah, I don't remember the title of the paper, but that was the gist of it if I understood it correctly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4282.227,
    "end": 4282.667,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4282.687,
    "end": 4283.709,
    "text": "I'll look that up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4284.33,
    "end": 4284.49,
    "text": "Great.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4286.354,
    "end": 4296.276,
    "text": " Another piece of the Levinson-Fields collaboration that Chris alluded to earlier is that the notion of computation is observer dependent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4296.496,
    "end": 4297.737,
    "text": "That's polycomputation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4298.217,
    "end": 4306.379,
    "text": "If there was a fully encrypted computation, an observer without the key would only be seeing noise to them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4307.23,
    "end": 4313.992,
    "text": " Whereas if they were to have the decryption key, then they could fully understand and go into more detail about the computation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4314.532,
    "end": 4329.137,
    "text": "So then let's say that we're in relation or observing or investigating some life phenomena at some scale, but we're speaking in the scale-free setting, but we're observing a thing that's there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4331.178,
    "end": 4335.96,
    "text": "People have ascribed different goals to describe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4336.96,
    "end": 4362.472,
    "text": " what we call goal-oriented behavior like seemingly to survive or seemingly to have evolutionary fitness however one an observer could also project different proximate goals like the goal to minimize stress the goal to minimize free energy the goal to minimize surprise those proximate observer proposed goals as if goals",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4363.88,
    "end": 4384.301,
    "text": " may be exactly isomorphic or aligned with fitness maximization so that could just be multiple perspectives of projective goals and whatever the observer projects that doesn't mean it describes the the actual",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4385.382,
    "end": 4409.74,
    "text": " process of the phenomena at all there's just nothing alice can make any story about bob and it it may or may not have anything to do or even be possible to be of the kind that bob tells about themselves dean this is i want to just piggyback on that dan this is really hugely important the moment you use the word goals",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4410.479,
    "end": 4438.779,
    "text": " the moment you use the word fitness you are assuming context whereas a lot of this stuff that's happening on this holographic screen is completely abstract less abstracted and completely context less there's no no context required so if you're going to focus on that part of it as long as you can juggle both at the same time and keep the two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4439.568,
    "end": 4464.405,
    "text": " things apart because one does not require context the other completely assumes that context is given and now you're taking that into your calculus right but they're not the same thing so I'm just I want to reinforce what Daniel just said thank you Dean Ian oh I'll mute then continue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.94,
    "end": 4467.301,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.321,
    "end": 4470.832,
    "text": "Yeah, I was just maybe reinforcing what you were saying or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.182,
    "end": 4482.346,
    "text": " reflecting on it, I was thinking about the behaviours we see in other animals and even ourselves that we might not think are related to fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.286,
    "end": 4496.831,
    "text": "Like, I don't know, there's those kind of gazelle type creatures that just jump into the air and like, but they seem to do that at a time which might make them be predated upon by a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.671,
    "end": 4503.524,
    "text": " some tiger or lion which you know it's you have to then all the sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.554,
    "end": 4507.475,
    "text": " biologists try and figure out how is this related to fitness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.055,
    "end": 4516.038,
    "text": "Um, and we may do the same, you know, if I go and mow my lawn, waste half a Sunday afternoon mowing my lawn, what's that got to do with my fitness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.078,
    "end": 4521.2,
    "text": "Well, actually it's to do with keeping up with the Joneses and, um, my social status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.92,
    "end": 4526.682,
    "text": "So, um, it's really hard to actually know what my behavior is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.503,
    "end": 4531.484,
    "text": "I can create a story to say that it's to do with, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.998,
    "end": 4536.662,
    "text": " minimizing free energy or fitness, but really is it or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.722,
    "end": 4537.142,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.623,
    "end": 4541.587,
    "text": "Is that kind of what you were getting at or something different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.592,
    "end": 4544.793,
    "text": " Yeah, that's great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4544.813,
    "end": 4548.397,
    "text": "Also, it's come up several times about goals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4549.278,
    "end": 4554.763,
    "text": "The term goal is not to be found within the active inference ontology, strictly speaking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4555.344,
    "end": 4558.928,
    "text": "That's why we have so much fun with what we expect and what we prefer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4559.428,
    "end": 4563.953,
    "text": "How can it be what we expect and be the positive thing that we pursue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4563.973,
    "end": 4566.555,
    "text": "Well, that's how paths of least action work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4567.336,
    "end": 4589.911,
    "text": " then if somebody else wants to look at that path of least action and say well here was a mile point and this is where it looked like they were heading north and this is where it looked like the goal was to evade this those are all stories that an observer could tell about a path or that the path might tell itself about its own path but those goal narratives",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4590.931,
    "end": 4602.975,
    "text": " don't need to be implemented proximally or primally with goals as a kind of core player in the active inference ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4604.335,
    "end": 4610.497,
    "text": "I'll read some of these great comments and questions just if anybody has a thought on them from the live chat, just feel free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4612.318,
    "end": 4616.639,
    "text": "John Reed wrote, what does the active inference group, I think that's us,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4618.172,
    "end": 4638.949,
    "text": " includes everyone think about the equation of pilot wave with many worlds recently expounded upon by chris o'dowd at pbs i found it to be mixing terms and frustrating personally any thoughts on pilot wave and many worlds and or i would also just be curious on like the physics or technical side",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4639.935,
    "end": 4667.527,
    "text": " where does what chris is sharing connect to these kinds of discussions that people have about many worlds and different interpretations of quantum uh yeah that's a great question so i i don't know that i can answer it um i know that uh when it comes to interpretations of quantum mechanics",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4671.388,
    "end": 4696.998,
    "text": " whether you know the collapse or the many worlds or whatever i i think what they're hinting at is is and chris would probably answer something along those lines that quantum theory is fundamentally about information and until until we make sense of that um fully and and and fully spell out all the details",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4698.686,
    "end": 4703.467,
    "text": " I think these philosophical issues or the interpretations of quantum mechanics are going to linger.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4703.947,
    "end": 4715.75,
    "text": "I don't have any strong thoughts on interpretations, and I would say I'm an agnostic about interpretations of quantum mechanics.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4715.81,
    "end": 4718.371,
    "text": "I don't know that I subscribe to any of them.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4721.012,
    "end": 4725.633,
    "text": "And especially pilot wave, I don't have the slightest idea about it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4727.298,
    "end": 4727.818,
    "text": " Cool.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4728.198,
    "end": 4728.518,
    "text": "Harris?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4729.639,
    "end": 4734.32,
    "text": "Yes, if you allow me, I have a small story regarding PilotWave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.941,
    "end": 4747.305,
    "text": "I was conversing with Chad GPT and I actually asked what he thought about PilotWave after watching a lecture on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.965,
    "end": 4750.006,
    "text": "And then I got intrigued and I wanted to ask",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.806,
    "end": 4777.854,
    "text": " and this actually happened the the model started replying and i got the chance to read a bit the the reply the reply was like it is very interesting but most probably is not wrong it is not correct it is wrong and then it must have reached some sort of information goal it retracted the the reply and it replied to me can you ask me a different question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.033,
    "end": 4784.518,
    "text": " So this is my short experience with pilot wave theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.339,
    "end": 4787.221,
    "text": "Can I ask a question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4787.261,
    "end": 4790.064,
    "text": "Is a pilot wave more or less than 100 feet in height?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4793.587,
    "end": 4794.548,
    "text": "I think it's exactly 100.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4795.209,
    "end": 4799.493,
    "text": "Any other thoughts or questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4805.29,
    "end": 4831.995,
    "text": " it's a fun and lively live chat too which is always fun yeah well we are um coming right along in the year and now 5 6 completed with this course so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4834.036,
    "end": 4838.279,
    "text": " Any comments that anyone here just wants to make in a closing route?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4838.659,
    "end": 4843.323,
    "text": "Anybody who wants to can go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4843.483,
    "end": 4844.724,
    "text": "Yeah, I have a question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4844.924,
    "end": 4854.991,
    "text": "If questions come up, have come up during the session, who could I send them to and how?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4858.939,
    "end": 4886.193,
    "text": " great question in the video description you can get to the syllabus of the course and one of the pages on the course website course syllabus is a question and answer form so you'll see several dozen questions that people have already written and chris gives answers and then it's publicly posted all of the lectures discussions and questions and answers will be published after the course",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4887.438,
    "end": 4894.601,
    "text": " So every question, no matter from where or where to, all of these questions are encouraged.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4894.801,
    "end": 4898.822,
    "text": "It only makes it a richer and more relevant publication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4898.842,
    "end": 4900.543,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4905.665,
    "end": 4907.646,
    "text": "Okay, Ian, Harris, or Dean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4912.628,
    "end": 4914.769,
    "text": "Yes, Susan also says post in Discord.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4915.069,
    "end": 4915.489,
    "text": "Great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4918.45,
    "end": 4922.673,
    "text": " Yeah, I just wanted to add a small point as a conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.414,
    "end": 4940.225,
    "text": "From my personal perspective, I really find that the ideas of Chris Fields, they can be revolutionary, let's say, in a variety of different fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4940.966,
    "end": 4947.53,
    "text": "And I can see it in quantum cryptography and also about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.579,
    "end": 4953.923,
    "text": " what I've mentioned before in terms of quantum knowledge representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4954.664,
    "end": 4958.587,
    "text": "So these are the two fields that I can clearly see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.927,
    "end": 4964.371,
    "text": "So it is great to be able to participate in this conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.012,
    "end": 4966.513,
    "text": "So once again, thanks to everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.155,
    "end": 4975.46,
    "text": "Great to participate in this conversation or quantum knowledge representation, whichever you prefer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4978.334,
    "end": 4980.055,
    "text": " Andrew, any last comments?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4984.199,
    "end": 4984.659,
    "text": "Not really.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4984.819,
    "end": 4986.721,
    "text": "Just looking forward to the next one, I guess.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4988.222,
    "end": 4989.843,
    "text": "And next year, I should say.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4990.604,
    "end": 4991.024,
    "text": "And what?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4991.925,
    "end": 4994.066,
    "text": "Next year, this is going to be an ongoing thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4995.047,
    "end": 4995.387,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4996.568,
    "end": 4998.39,
    "text": "We'll come back stronger next year, for sure.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 5001.833,
    "end": 5002.173,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5002.913,
    "end": 5003.514,
    "text": "What a ride.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5004.114,
    "end": 5004.715,
    "text": "Thank you all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5005.215,
    "end": 5006.416,
    "text": "See you next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5007.337,
    "end": 5007.477,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5010.067,
    "end": 5010.563,
    "text": " Bye everyone.",
    "speaker": "SPEAKER_07"
  }
]