[
  {
    "start": 6.342,
    "end": 13.432,
    "text": " So hello everyone and welcome to this session of Intelligent Soft Matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 13.792,
    "end": 23.405,
    "text": "What we try to organize is a workshop on a very unusual workshop and the structure of this workshop is also very unusual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 23.425,
    "end": 26.73,
    "text": "The topic is unusual and the structure is unusual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 26.71,
    "end": 48.668,
    "text": " So this is the website, what you see on the screen, and this is about intelligent soft matter, and it is an emerging field, so it is not yet well developed, and it will be maybe in the future one of the directions of the soft matter, and since not much was done in this field, what we are planning",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 48.648,
    "end": 73.727,
    "text": " in this field and what we see what can be done from different perspectives so we have people working with materials and soft matter and experimental site and we have people from sensors and nanoparticles and how to to to sense the environment and we have also people from decision making",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 73.707,
    "end": 79.218,
    "text": " artificial intelligence, which is also a different field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 79.238,
    "end": 83.187,
    "text": "So there is a mixture of different profiles.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 83.207,
    "end": 94.45,
    "text": "And today what we wanted to do, because the topic is very unusual and new, here is a description and also we have a program,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 94.43,
    "end": 98.436,
    "text": " And we have also profiles of the people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 98.456,
    "end": 108.389,
    "text": "So today what we wanted to do in this meeting should be also an unusual format.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 108.469,
    "end": 120.606,
    "text": "It will have unusual formats that it is not only presentation of the talks, but also collaboration and initiation of the collaboration and discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 121.531,
    "end": 140.35,
    "text": " And to initiate this discussion and to make it meaningful, what we did is we wanted to analyze the contributions and also the people who will join.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 140.33,
    "end": 164.953,
    "text": " that they may know each other before the meeting and also to have some ideas of other people and also of other directions and also other ideas of people what they can bring to this meeting and with whom they can meet and what they already if we start writing a paper for example we have in the plan the paper on",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 165.794,
    "end": 170.822,
    "text": " Though in those sessions, we have a plan to write a perspective paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 171.623,
    "end": 189.912,
    "text": "And when we write this perspective paper, we should already be prepared and to prepare some part of this text and to be ready to collaborate with people because still we have very short time during the meeting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 189.892,
    "end": 219.898,
    "text": " that's why i suggest so we have this session and additionally we have a session on grant writing session and this is uh will be um organized by akili uh and also with uh this will be a session traditional grant writing and the addition and last day we will have idea generation session which is more open and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 219.878,
    "end": 248.991,
    "text": " be prepared which is what we are doing now we will be prepared in collaboration with uh two guests one is uh daniel uh friedman from uh california and he is a director of the active influence institute and today we have another guest is uh a the tobias from netherlands and he is uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 249.207,
    "end": 259.909,
    "text": " uh as a sale of the component knowledge pixels who is behind of nano publications so why this is uh important so we have a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.108,
    "end": 270.445,
    "text": " Here what we want to do is to generate some ideas before the meeting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 270.726,
    "end": 273.31,
    "text": "This is the goal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 273.991,
    "end": 283.247,
    "text": "On one side we will use artificial intelligence and the modern tools which allow not only",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 283.227,
    "end": 294.006,
    "text": " to present your directions, but also to get insights from other fields through this automatic process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 294.347,
    "end": 301.54,
    "text": "And this is this idea generation process through field shift, and this will be presented by Daniel Friedman.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 301.52,
    "end": 314.5,
    "text": " And on the other side, if we have those ideas, we can register those ideas as small pieces of information with the name and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 315.307,
    "end": 328.098,
    "text": " And this can be a nano publication, which can be in a machine readable format, and that can also allow to build on top of this piece of knowledge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 328.619,
    "end": 337.626,
    "text": "So then what we'll see how we can merge all those new technologies and to see how it is possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 338.027,
    "end": 345.313,
    "text": "So first of all, I would like maybe to, maybe our guests will,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 345.293,
    "end": 365.597,
    "text": " know a little bit about themselves and also about these tools so first of all we start with uh tobias and then with daniel we'll leave maybe like this so tobias do you want to present your tool uh sure yeah so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.062,
    "end": 370.468,
    "text": " Well, I can just very quickly introduce myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.768,
    "end": 371.449,
    "text": "I'm Tobias Kuhn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 371.469,
    "end": 373.433,
    "text": "I'm actually no longer based in the Netherlands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.453,
    "end": 381.887,
    "text": "I'm still affiliated with university there, but I'm now in Zurich, Switzerland, and we have now our small startup called KnowledgePixels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.788,
    "end": 391.483,
    "text": "And yeah, as Vladimir already said, we are focusing on this concept and the technology of nano-publications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 392.257,
    "end": 415.8,
    "text": " um yeah i know do you want me to now already give a if you give uh maybe one or two minutes that's the concept of this nano publication and then we go through further because then we will discuss how to include it and after this how to merge it later but if you just tell what is the concept how it works and that's will be enough",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 415.78,
    "end": 417.484,
    "text": " Okay, yes, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.125,
    "end": 424.139,
    "text": "So as the name says, an NNF publication is like a publication, but tiny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 424.179,
    "end": 431.275,
    "text": "And on top of that, it's a publication, it's not just written in English or any natural language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.255,
    "end": 435.341,
    "text": " But it's written in, you could say, a logic language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.362,
    "end": 451.407,
    "text": "If you're a bit familiar with semantic web or linked data technologies, it's written in the RDF language, which means it's made of sentences where you have subject, predicate, object, and all the three of them are globally unique identifiers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.387,
    "end": 457.195,
    "text": " So people around the globe can say things and when they talk about the same thing it will automatically connect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.676,
    "end": 461.381,
    "text": "If I may kind of simplify it a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.723,
    "end": 466.168,
    "text": "So nanoproductions are kind of these tiny snippets of such statements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.609,
    "end": 473.419,
    "text": "In the simplest case it's just a single such sentence with something is related with that thing to that thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.019,
    "end": 475.842,
    "text": "Like I know in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.822,
    "end": 481.755,
    "text": " In medicine, it could be this gene has this kind of effect on this disease.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 482.698,
    "end": 491.738,
    "text": "Often, it's more than one such triple, as they're called, because often statements are a bit more complex than just a simple triple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.887,
    "end": 500.565,
    "text": " And that together, so these couple of statements then consist the main content of nanopublication, which is called the assertion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.087,
    "end": 506.959,
    "text": "But then it always has some provenance to it, meaning you can state with another such triple,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.939,
    "end": 532.17,
    "text": " where this came from for example because you had a study that delivered it or because it was extracted from an existing paper or data set or whatever and then it has some metadata where you can say who created it with which tool with a timestamp with a license and these things and all that together then is a nano publication it gets a stable persistent identifier of its own",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.15,
    "end": 559.626,
    "text": " and the the thing that we are now working with the thing that we are providing is that you're building a decentralized ecosystem for dealing with such nano publications so you can push them to the world basically to the nano application network and it can then live at different places so when you're later uh you or somebody else want to retrieve it again you can and because it has this formal structure you can also ask very specific queries that can then precisely be answered",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.606,
    "end": 583.335,
    "text": " uh for humans to consume but also for machines and for applications to build upon um so we can also on the flight create new classes and relations so we can create new vocabulary and then talk about it and make now publications you have a tool for that that's called nano dash that is supposed to be user friendly so it's still kind of cutting edge so we still have work ahead of us",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 583.315,
    "end": 595.738,
    "text": " um but anyway so it's kind of a low threshold to publish these and then you and others can query it again and um yeah we're now in the first steps to kind of apply this more broadly um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 595.938,
    "end": 599.723,
    "text": " across different domains and with connections to journals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.743,
    "end": 603.448,
    "text": "And yeah, there's a lot I could talk about more, but I think I've already used up my three minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.868,
    "end": 604.149,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 604.169,
    "end": 610.077,
    "text": "So that's exactly the purpose of this tool, how to use this tool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 610.097,
    "end": 614.923,
    "text": "So it is machine readable format, and this is very short and easy to publish.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 615.103,
    "end": 621.912,
    "text": "And this goes in the direction of the new trends of this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 621.892,
    "end": 643.613,
    "text": " language models, then they come and the process of publications, the dissertation writing, projects writing, and those public large review writing, that becomes obsolete and already doesn't have much sense to have all this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 643.593,
    "end": 648.622,
    "text": " all this traditional legacy publishing system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 648.963,
    "end": 667.356,
    "text": "So instead of this, it goes in the direction of very specific and personalized tools and also the artificial intelligence now becomes more and more, it goes in the more and more in the direction of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 667.336,
    "end": 669.119,
    "text": " agent-based.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 669.139,
    "end": 684.263,
    "text": "So instead of general tools for everything, you will have an agent which will be doing some work or task very personalized for you and for other people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 684.283,
    "end": 686.627,
    "text": "So you will communicate through the agent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 686.607,
    "end": 692.516,
    "text": " And this is how we see how these nanopublications can enter into this domain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 692.676,
    "end": 710.083,
    "text": "And this is how we connect with Daniel from Active Inference Institute, because the whole Institute is focusing on the development of those artificial intelligence tools that will be",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 710.063,
    "end": 717.171,
    "text": " making those agents which will be making interaction between humans and machine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 717.792,
    "end": 727.866,
    "text": " And this is one of these examples of how we can apply these two intelligence soft metrics to this workshop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 728.186,
    "end": 734.655,
    "text": "And we can just show how this, again, this is a very early stage, but how this can be approached.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 735.215,
    "end": 743.507,
    "text": "Maybe now, Daniel, you can come up and show this tool and explain it in a few words.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 743.527,
    "end": 743.867,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.087,
    "end": 748.55,
    "text": " I'm going to share my screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.273,
    "end": 759.21,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.23,
    "end": 763.679,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.699,
    "end": 764.019,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.344,
    "end": 766.564,
    "text": "Well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.911,
    "end": 770.435,
    "text": " Thank you, Vladimir, for inviting me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.836,
    "end": 774.903,
    "text": "And it's been really fun to collaborate on these directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.785,
    "end": 779.631,
    "text": "Also, Tobias, that's very exciting about the nanopubs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.493,
    "end": 787.405,
    "text": "I think broadly, this is going to be the unstructured text",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.617,
    "end": 812.059,
    "text": " getting into where the structured information of nanopubs is going to supercharge it but even today i think there's some pretty fun and exciting at least provocative directions to explore um it's i'm gonna push this all to the github link that's in the video description and in the side chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.917,
    "end": 826.015,
    "text": " um okay so to kind of back up and then we'll look at this on the open source github last week we had an applied active inference symposium at the institute and in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.783,
    "end": 835.095,
    "text": " Those sessions, we kind of analogously had participant information, presenter abstracts, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.616,
    "end": 845.252,
    "text": "And so working with Vladimir, we had some discussions and we built some tools around like, what can we do to add value and context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.232,
    "end": 861.267,
    "text": " Before the event, how can we start to think about templates and transferable tools and practices across different related or overlapping or even totally separate open science and participation initiatives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.247,
    "end": 864.012,
    "text": " So we made this repo called symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.473,
    "end": 877.054,
    "text": "So Vladimir made a bunch of edits and commits to this before last week and recently, including adding in some open source language model methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.076,
    "end": 882.343,
    "text": "What I'm going to show is just a few more researcher side",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.994,
    "end": 888.441,
    "text": " process accelerations perhaps using Perplexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.183,
    "end": 894.712,
    "text": "That's available through the browser at Perplexity AI, and here is using the API.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.832,
    "end": 909.597,
    "text": "So what I did here is I took the Perplexity folder that I had applied to the Active Inference Symposium participants, and then adapted this in this folder called ISM stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.948,
    "end": 932.935,
    "text": " for intelligent soft matter so that's where everything that we're gonna talk about today is in here so this is it just as the folder is named it just meant different pieces for people to pull out um and explore and then also i'll note that this is all done in cursor especially as there was already a folder of this working for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.269,
    "end": 956.323,
    "text": " a different structure but analogous tasks getting to this ism stream content was was like 10 to 20 total prompts and cursor updates okay so in the inputs folder vladimir provided the information on the participants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.063,
    "end": 958.044,
    "text": " And also there's a cat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.084,
    "end": 965.473,
    "text": "So here's Intelligent Soft Matter and then there's speakers and participants and they each have this open Alex and this works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.154,
    "end": 974.083,
    "text": "So the works are some citations and bibliography and the topics are topics of the person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.486,
    "end": 976.586,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.606,
    "end": 982.593,
    "text": "So what the first script does is it researches the presenters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.673,
    "end": 984.875,
    "text": "So everything goes into the outputs folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.895,
    "end": 986.277,
    "text": "Here's the presenter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.13,
    "end": 989.293,
    "text": " folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.313,
    "end": 999.861,
    "text": "So in a JSON and a markdown, here are internet based research apps, all",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.972,
    "end": 1024.279,
    "text": " experimental research tooling so it's hard to even estimate sometimes it's totally accurate if it's little information in a common name this isn't going to be very useful if there's a ton of information and and links provided it's super useful so this this outputs a summary on the presenters um but i i kind of wanted to explore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.833,
    "end": 1048.545,
    "text": " the uh working with the participant information more so that's what most of the following scripts are so the second script two and all these are run with just pi from the ism stream folder just python3 and then the name of the script so for the participants started off with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.719,
    "end": 1071.765,
    "text": " also writing a research report i don't know if we can look up someone who's here now to see see how accurate it is but yeah yeah it's here okay it looks quite accurate okay so again sometimes it's super accurate sometimes double check okay so wrote the wrote this research report",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.218,
    "end": 1075.764,
    "text": " Then this is where field shift comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.784,
    "end": 1081.293,
    "text": "So these are just sort of playing around with different combinatorics of what is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.894,
    "end": 1085.74,
    "text": "And also this is just using all by all folder iterating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.86,
    "end": 1087.103,
    "text": "So it's not using a database.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.243,
    "end": 1096.538,
    "text": "It's hardly agentic in the sense that we could call any part of the computer pipeline agentic, like is a database search a search agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.518,
    "end": 1099.243,
    "text": " I guess if we do think about it that way, then it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.784,
    "end": 1108.058,
    "text": "But this is just using all by all iterating on these folders, which keeps it plain text and really available also for nano pubs and GitHub and all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.579,
    "end": 1112.706,
    "text": "So what field shift does, there's a folder called domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.726,
    "end": 1114.729,
    "text": "So in this folder called domain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.958,
    "end": 1123.327,
    "text": " This is copying a folder out from a previous repo and live stream called field shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.427,
    "end": 1125.65,
    "text": "That was based upon some work by Mike Levin's lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.17,
    "end": 1131.797,
    "text": "So what domain has is it has these synthetic knowledge files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.038,
    "end": 1136.903,
    "text": "So they're just specific questions, examples,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.165,
    "end": 1167.615,
    "text": " factual statements within a domain so just some of them are they're just meant to load up the context and just provide information on a synthetic domain but you could imagine that could be like a person's record or an organization's record or a different kind of document but here just being used just to say these are just statements and open questions and problems and this happened this year all those kinds of things for different domains so what three field shift does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.967,
    "end": 1178.817,
    "text": " is it takes each participant's background and it will find, I didn't run this for every single participant, but we'll just run it in cursor now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.837,
    "end": 1197.855,
    "text": "So this takes each participant's background and then basically uses perplexity to juxtapose a researcher's background and the synthetic domain, and then asks, what could they learn from the field and how could they contribute to the field?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.578,
    "end": 1201.141,
    "text": " So this is danielacraft and rx infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.701,
    "end": 1210.251,
    "text": "And then the way that, again, there's more sophisticated ways to do prompt engineering, but what's happening here is it just sending to perplexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.032,
    "end": 1217.319,
    "text": "Here's the participant, analyze the bi-directional knowledge exchange between name and participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.32,
    "end": 1219.661,
    "text": "Here's the profile of the participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.982,
    "end": 1222.965,
    "text": "Here's the knowledge domain, just copy paste.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.11,
    "end": 1229.518,
    "text": " Each of these take like, so here, let's just look at this one that just was made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.445,
    "end": 1237.13,
    "text": "Here's what this person could learn from RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.39,
    "end": 1241.276,
    "text": "These are accurate parts of what they could learn from that field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.417,
    "end": 1244.16,
    "text": "How could they contribute to the domain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.625,
    "end": 1264.917,
    "text": " don't know but that that's prominent so that's that's field shift and then that just iterates over whichever domains are in the domain folder so it's like here's statements about william blake um that's uh three so that's the the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.997,
    "end": 1269.538,
    "text": " field shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.878,
    "end": 1274.945,
    "text": "Okay, then Vladimir provided a folder of catechisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.526,
    "end": 1277.208,
    "text": "So catechism can mean different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.249,
    "end": 1290.006,
    "text": "But in the project management setting, it's a set of question and answers that are aligned with project management, being a grant officer, program manager, these kinds of questions that are important to be addressing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.828,
    "end": 1293.351,
    "text": "So took this for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.571,
    "end": 1318.174,
    "text": " shifted catechisms here this was like one prompt from three copied three and said okay now with the catechism in that catechism folder write a that structure for each of these shifted fields",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.406,
    "end": 1353.983,
    "text": " so now with the danielacraft blockchain bi-directional relationship now it's going to write a catechism with that structure so it'll it'll take a few seconds then just while this one's processing the other way to use a catechism here is for all pairwise participants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.688,
    "end": 1373.625,
    "text": " write a catechism that would reflect a complementary project using the karma gap I don't know what it is but that catechism format so we'll look at okay here's five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.432,
    "end": 1404.068,
    "text": " so here's daniela craft x dong shi and then that is just saying okay now for these two participants there's other ways that you could fill up the context window and everything but just saying here's how you write the document here's here's what here's what we're looking for with the document styles here's the template of the catechism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.723,
    "end": 1431.338,
    "text": " here's the participant information here's their other proposals that we know from them here's their own here's their field shifted um to and from and then make a collaborative project okay first let's look at the just the field shift um blockchain i i don't know this person but we'll see you know they can see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.107,
    "end": 1434.192,
    "text": " to and from blockchain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.237,
    "end": 1438.634,
    "text": "And then just last piece is the collaborative proposals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.478,
    "end": 1441.648,
    "text": "We'll look at it in GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.518,
    "end": 1455.593,
    "text": " Maybe I can also show the results when we were shifting the profiles of the people because they are coming from different domains to the context of the workshop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1455.874,
    "end": 1457.536,
    "text": "It's intelligence of matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1458.057,
    "end": 1460.92,
    "text": "And what was the outcome?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1461.661,
    "end": 1464.986,
    "text": "So it was done with three steps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1465.426,
    "end": 1472.395,
    "text": "First step is to generate profiles of each person and also the questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1472.375,
    "end": 1487.768,
    "text": " uh maybe if i i switch to online now this i will i will show the outcome of this result yes danielle yes uh okay",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1489.57,
    "end": 1491.615,
    "text": " Now, this is here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1491.715,
    "end": 1497.006,
    "text": "So this is also in the same GitHub folder.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1497.087,
    "end": 1505.385,
    "text": "So if you go here, so there is an inputs and inputs are basically they are taken from this is Intelligent Software.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1505.365,
    "end": 1515.667,
    "text": " matter and the participants speakers and we have outcome is the publication taken from open Alex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1515.687,
    "end": 1522.902,
    "text": "So there is a publication directions, research directions, topics and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1522.882,
    "end": 1552.332,
    "text": " also citations so it's it this is uh provided in in this format so we have uh this as a basis so we don't use any other information and we can do it for any researcher and after this uh the question was uh after we write we have a free uh uh generated profile of the researcher with respect to the field of uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1552.312,
    "end": 1580.243,
    "text": " uh intelligence of matter then we have a researcher methods we it can extract the methods and also description of the methods from each profile and additionally we can do collaborative projects and the project depending on the uh cathartism what daniel explained so what for example we have european projects they have a certain structure if we have uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1580.223,
    "end": 1601.758,
    "text": " uh a american project or some other funding then it will be completely different questions and different structure and it will be different so the catechism is here so this is just a text file and for example we if we have european grants this is a certain structure if we have and here we we have just another one this is a catechism",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1601.738,
    "end": 1625.755,
    "text": " for karma projects and this is just the questions what need to be addressed and this is a strong structure first is a vision and scope project statement proposal solution collaboration knowledge integration plan yes so we use this to construct projects uh with and also connections between people",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1626.308,
    "end": 1627.791,
    "text": " So then and how it works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1627.811,
    "end": 1631.8,
    "text": "So we have it is in this folder synthetic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1632.462,
    "end": 1636.009,
    "text": "And here this is the also generated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1636.491,
    "end": 1641.662,
    "text": "So first of all, we have all merged research profiles of all participants in this file.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1641.682,
    "end": 1645.33,
    "text": "So this is a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1645.31,
    "end": 1666.39,
    "text": " automatically generated file and the same we have automatically generated description of the intelligence of matter and that and this is current understanding future direction changes so this is done in this format and this is what is known in general so this is basically generated contracts",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1666.37,
    "end": 1669.013,
    "text": " But you can also have a look.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1669.033,
    "end": 1672.718,
    "text": "So this is also maybe interesting to see if you agree or not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1672.858,
    "end": 1680.609,
    "text": "And this is basically general knowledge available in the Internet about this field and future direction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1680.649,
    "end": 1686.216,
    "text": "So this is again, it is rapidly evolving with several excited future directions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1686.516,
    "end": 1688.399,
    "text": "And those are seven directions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1689.4,
    "end": 1693.245,
    "text": "What basically it is discussed in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1693.265,
    "end": 1695.448,
    "text": "So it is not coming from",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1695.428,
    "end": 1696.009,
    "text": " anywhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1697.471,
    "end": 1700.375,
    "text": "And we have also open questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1700.715,
    "end": 1709.127,
    "text": "This is for fundamental science, for computational science, material design applications, ethicals, and emerging questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1709.167,
    "end": 1712.071,
    "text": "So there are the questions and future innovation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1712.111,
    "end": 1714.635,
    "text": "So this is, again,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1714.615,
    "end": 1723.464,
    "text": " because if we talk in the workshop about intelligence of matter, we need to talk what do we consider it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1723.484,
    "end": 1725.646,
    "text": "And this is our actual state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1725.946,
    "end": 1732.453,
    "text": "Maybe after the meeting it will be completely rewritten and we have new ideas and we will be doing this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1732.853,
    "end": 1742.243,
    "text": "And here is the beauty of this method, so we can be based, everything is based on agents and then we can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1742.223,
    "end": 1766.695,
    "text": " regenerate all the structure again this is not a problem because it takes maybe 10 minutes after this we go to participants and then again we can pick up the participant there is first of all so we have a research profile so the research profile that you already saw there is a research focus of the person",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1766.675,
    "end": 1773.603,
    "text": " Then we have impact analysis, so these high citations focus on fundamental coordinates.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1773.623,
    "end": 1779.089,
    "text": "We have research evolution from where it started and where this researcher goes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1779.289,
    "end": 1788.48,
    "text": "And then there is key contributions and also future directions with respect to this field, intelligence of matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1788.46,
    "end": 1805.254,
    "text": " so where this profile can fit in this structure what we proposed and this and it will if intelligent soft matter will be redefined this is fine then this all those profiles will be again regenerated",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1805.234,
    "end": 1808.979,
    "text": " And then another one is the collaboration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1809.019,
    "end": 1812.244,
    "text": "So we know this field, we know where this researcher comes from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1812.264,
    "end": 1821.617,
    "text": "And then the question is what collaboration, what is the matching contribution he may search.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1821.898,
    "end": 1828.848,
    "text": "And here what we see that there are several suggestions to whom he may collaborate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1829.108,
    "end": 1831.191,
    "text": "So it will be complementary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1832.183,
    "end": 1836.47,
    "text": " And so this is totally automatic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1837.231,
    "end": 1839.174,
    "text": "And you can also have a look.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.795,
    "end": 1849.51,
    "text": "And after this, a third part, so we have a second one is the approach we have methods.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1849.951,
    "end": 1852.875,
    "text": "So we can extract methods.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1852.855,
    "end": 1854.817,
    "text": " also from publications.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1855.478,
    "end": 1870.515,
    "text": "And then analyzing those publications, we can see that there is a list of methods with a description, with Monte Carlo simulations, and then with the description and the result outcomes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1870.915,
    "end": 1873.298,
    "text": "Then we have also several models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1873.318,
    "end": 1875.42,
    "text": "So this is, we see all this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1875.4,
    "end": 1883.133,
    "text": " theoretical models, and we see also emerging trends, how this field evolves, and limitations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1883.193,
    "end": 1889.243,
    "text": "For example, if you use scaling models, scaling theory, renumeration group, what will be the limitations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1890.185,
    "end": 1895.995,
    "text": "And this is very useful when we talk about collaboration and projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1896.936,
    "end": 1901.003,
    "text": "After this, we go to project generation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1902.029,
    "end": 1907.055,
    "text": " And for example, this is a project generated for this particular researcher.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1907.836,
    "end": 1914.484,
    "text": "And here, what we see is the emerging computation and convert biofibrous materials networks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1914.504,
    "end": 1917.047,
    "text": "So here we see all descriptions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1917.067,
    "end": 1924.416,
    "text": "So then starting from the title, they have project rationale and objectives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1924.677,
    "end": 1928.121,
    "text": "So this we have according to this catechism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1928.101,
    "end": 1957.045,
    "text": " what we set up, for example, if we want to structure it in the form of European project, there is a special setup for European project, if this was done for Karmagap, and here we see the structure for this particular project, and here what we see, all those topics, like alignment with EU calls, project vision objectives,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1957.025,
    "end": 1972.524,
    "text": " and contribution to properties, expected KPIs, then they have state of the art, gaps and limitations, novelty, and then we see also alignment with Europeans.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1972.544,
    "end": 1984.399,
    "text": "This is, by the way, this is a European structure, methodology, what can be done in this methodology, expected impact, and you added value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1984.379,
    "end": 2005.257,
    "text": " and the long-term risk management and this all these resources and work plan and deliverables so this is already uh that we have this dissemination exploitation so ethics and all these things those so this is uh european structure so we we have another project",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2006.502,
    "end": 2010.707,
    "text": " which was done here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2010.787,
    "end": 2019.357,
    "text": "So this is another project which is called a different type of project with a completely different structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2019.758,
    "end": 2020.879,
    "text": "And this is simplified.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2020.939,
    "end": 2023.682,
    "text": "This is Karmagap projects are simplified.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2024.043,
    "end": 2026.285,
    "text": "And here we have a vision and scope.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2026.325,
    "end": 2027.667,
    "text": "We don't have any",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2027.647,
    "end": 2037.682,
    "text": " Europe dimension, gender balance and all these things which will be very particularity of the European project.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2037.722,
    "end": 2047.056,
    "text": "Here it is a vision and scope, why this project needed now, societal need, problem statement,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2047.036,
    "end": 2070.613,
    "text": " and uh proposed solution and k innovation and what is also important that here we also see uh with this project which is uh another type of project it's neuromorphic soft matter by inspired immersive network of catalytic nanoparticles it just suggests that person from the workshop",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2070.796,
    "end": 2091.015,
    "text": " who will be the best contact with respect to this project for example here what is this idea so we have a neuromorphic integration so this is what is this so this is mem resistors and how to make them from soft matter materials using",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2090.995,
    "end": 2111.772,
    "text": " photocatalytic nanoparticles embedded in polymer matrix so this is the topic and uh it was generated so we have a connection with other participant and uh we have a structure already for the grand proposal and it was generated in 100 seconds",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2111.853,
    "end": 2118.741,
    "text": " So it's basically two minutes and you have a project like this, then with the full details.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2119.522,
    "end": 2124.167,
    "text": "And here also what is also included, network and collaboration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2124.508,
    "end": 2130.775,
    "text": "So who else from the meeting can contribute to this idea?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2131.236,
    "end": 2137.523,
    "text": "And here, because we know all the profiles, so they just list those people from the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2137.503,
    "end": 2143.547,
    "text": " workshop and how these people can contribute to this particular project.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2144.624,
    "end": 2148.671,
    "text": " And again, we have these methods.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2148.691,
    "end": 2152.518,
    "text": "So this is, again, what methods need to be taken into account.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2152.538,
    "end": 2160.031,
    "text": "They have the STEM, SAM, spectroscopy, so computational data, biological data, machine learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2160.051,
    "end": 2165.059,
    "text": "So then it will be also the structure of the implementation plan.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2165.14,
    "end": 2167.343,
    "text": "So this is structure of the project.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2167.484,
    "end": 2168.826,
    "text": "It can be",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2169.278,
    "end": 2172.341,
    "text": " several-year project and how to structure it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2173.162,
    "end": 2180.169,
    "text": "And we have a methodology, what else is necessary and what is missing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2180.429,
    "end": 2197.125,
    "text": "And you see that it says also that not all people from the workshop is enough, that will be again some extra people, this material scientist engineer, it's missing and we don't have it in the workshop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2197.105,
    "end": 2205.44,
    "text": " But if you just limit people from the workshop, it just gives you those names which are more suitable for this project.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2205.941,
    "end": 2210.129,
    "text": "So this is the way to operate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2210.469,
    "end": 2212.733,
    "text": "So this will be just an example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2212.754,
    "end": 2217.983,
    "text": "Of course, we can delete this all and it may not...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2217.963,
    "end": 2225.874,
    "text": " It will be just an example, so you can use it as an example of future collaboration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2226.195,
    "end": 2244.46,
    "text": "So for us, it is important that if you can just log in and have a look of researcher profiles, it is also possible to generate for each person to whom to talk and to which subject.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2244.44,
    "end": 2257.178,
    "text": " For example, with your profile, then you can talk to another person and also present something that maybe you don't even realize that you can work together on something on this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2257.198,
    "end": 2265.79,
    "text": "And that's maybe we can have a list of people and two topics where you can address those people because they are experts in this field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2266.985,
    "end": 2270.09,
    "text": " So this is more or less what we are doing now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2270.27,
    "end": 2276.519,
    "text": "And this is how this field is developing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2276.96,
    "end": 2280.285,
    "text": "And I know that Daniel want to show something else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2281.307,
    "end": 2282.068,
    "text": "Thank you, Vladimir.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2282.088,
    "end": 2282.809,
    "text": "That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.012,
    "end": 2285.573,
    "text": "That's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.314,
    "end": 2289.519,
    "text": "OK, I'm going to show the last piece of the script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.539,
    "end": 2291.642,
    "text": "And I mean, I hope this is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.061,
    "end": 2303.317,
    "text": " giving some fun ways in each symposia that you all or anyone organizes or we organize, we can keep on iterating and making it more interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.758,
    "end": 2304.359,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.379,
    "end": 2305.16,
    "text": "Let me just share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.922,
    "end": 2313.612,
    "text": "Take a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.632,
    "end": 2313.993,
    "text": "Do you see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.395,
    "end": 2316.696,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.716,
    "end": 2317.798,
    "text": "Let me try screen sharing again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.284,
    "end": 2336.68,
    "text": " I'll just show this for a minute, then any thoughts or questions on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.7,
    "end": 2336.98,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.981,
    "end": 2339.603,
    "text": "It says I can't share my screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.187,
    "end": 2344.028,
    "text": "I'll try one more time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.87,
    "end": 2352.137,
    "text": "Or I'll just share a window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.157,
    "end": 2352.257,
    "text": "Okay."
  },
  {
    "start": 2356.203,
    "end": 2359.188,
    "text": " So meanwhile, if you have any questions, you can ask.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2362.333,
    "end": 2363.514,
    "text": "Let me just reload.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.195,
    "end": 2374.131,
    "text": "I'll be back in one second.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2375.473,
    "end": 2384.387,
    "text": "Interaction, and this is why we also see a very big",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2384.857,
    "end": 2413.817,
    "text": " potential in nano publications because this is the way to structure the pieces of information which is relevant and which you can say this because if you build a project what you if everything can be generated but what is important is what is really a verifiable data and what is a statement which is a is a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2413.797,
    "end": 2437.003,
    "text": " you can trust, and this is where this nanopublication comes, because you don't need the whole paper, you don't need to write, to read reviews, but what you need is to have those pieces that you can construct your own project, you can construct your own paper or something like this, and this can be also done automatically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2437.135,
    "end": 2449.677,
    "text": " Yes, and this is where we see this interaction between AI, humans and the system of the blockchain, which is basically what the token shows.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2449.994,
    "end": 2463.319,
    "text": " Okay, it's a funny thing, but just navigate over to the ISM stream and I'll show it on the stream, but just for those in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.68,
    "end": 2470.433,
    "text": "In the ISM stream, there's a folder six called visualize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.172,
    "end": 2478.821,
    "text": " And what Visualize does, again, it'll be visible on the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.203,
    "end": 2481.244,
    "text": "I'll run it in Coda 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.886,
    "end": 2487.051,
    "text": "Okay, first thing it does is it iterates over each kind of the output document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.811,
    "end": 2494.279,
    "text": "So the researcher profile, I know you don't see it in the Google chat, but it's visible on the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.581,
    "end": 2497.703,
    "text": "But just a funny thing is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.408,
    "end": 2511.413,
    "text": " but then it iterates over each kind of document, like the research profiles and the other, and then it uses standard set of linguistic analysis methods, like topic modeling and principal component analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.015,
    "end": 2516.383,
    "text": "All of these will be in the visualizations folder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.701,
    "end": 2534.625,
    "text": " And so it makes, for example, principal component plots and what those principal components are loaded on for different researchers and looks at different topic modeling and statistical aspects of the semantics of the event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.858,
    "end": 2549.883,
    "text": " So that opens up a lot of really interesting possibilities for like designing unlikely connections and setting up projects that are in certain regions and especially combined with the methods that Vladimir just mentioned, nano pubs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.524,
    "end": 2561.642,
    "text": "I mean, having a nano CV with available methods, this is really changing the game because of the semantics being openly accessible and the rate limiting step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.483,
    "end": 2566.853,
    "text": " to a large extent being like what projects are really going to happen with who and how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.986,
    "end": 2579.26,
    "text": "Yes, we see Achille first.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2579.999,
    "end": 2597.653,
    "text": " okay thanks thanks a lot for this is i got the general pictures very clear and what i don't have clear is so how can we refine the the results because all these results were obtained by automatic information that you know we're in the web but uh how do you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.19,
    "end": 2603.061,
    "text": " How do you iterate in such a way that this can be refined?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.522,
    "end": 2606.589,
    "text": "Because this could be all junk, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.609,
    "end": 2607.43,
    "text": "Of course, yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2607.471,
    "end": 2617.212,
    "text": "This is just to give an idea before the meeting of other participants and then to see what can be done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2617.192,
    "end": 2638.407,
    "text": " uh to uh refine it is basically on the the field what you want to to achieve then uh the structure of of the questions what you need to to answer and uh also the profile methods profile so this the basic information then it because what it does is just the shifting so example if you have",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2638.387,
    "end": 2654.607,
    "text": " uh method in in polymer physics so and you want to apply it in a some maybe some elements of quantum uh quantum theory into polymer physics so and you know that this is how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2654.587,
    "end": 2663.435,
    "text": " Duchenne got a Nobel Prize and he just go from one field to another field and bring the tools with him.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2663.495,
    "end": 2665.476,
    "text": "So this is how it does.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2665.697,
    "end": 2673.804,
    "text": "So this is just merging different approaches, which is already common in one direction, in one field and applying to another field.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2674.144,
    "end": 2679.048,
    "text": "And then this is done with the prompts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2679.068,
    "end": 2684.593,
    "text": "This is prompts and there are maybe 20 prompts which to generate",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2684.573,
    "end": 2695.79,
    "text": " document, but you see that adjusting it, then you can improve a lot and put more details it will put a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2696.071,
    "end": 2698.214,
    "text": "So this is short answer there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.254,
    "end": 2699.656,
    "text": "It's in GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.676,
    "end": 2709.592,
    "text": "So get people to have editor access on the repo for the event and then have it just as a starting point and make edits in collaborative fashion and get just like anything else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.555,
    "end": 2712.116,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.436,
    "end": 2712.977,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.695,
    "end": 2715.436,
    "text": " And Rudolf?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2717.699,
    "end": 2721.704,
    "text": "Yeah, thank you very much for this very interesting presentation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2721.784,
    "end": 2725.169,
    "text": "I think that could be sort of a game changer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2725.269,
    "end": 2728.153,
    "text": "I will be very open.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2728.173,
    "end": 2734.882,
    "text": "I do not yet really see how that actually works in practice, but I like, I'd love to try it out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2734.902,
    "end": 2740.99,
    "text": "I'm a little bit, most of the questions have already been answered because I had more or less",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2740.97,
    "end": 2744.035,
    "text": " My question is headed into the same direction as Achilles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2744.936,
    "end": 2757.055,
    "text": "But I haven't got, and that may be my fault, I apologize, because I had to go to the door briefly, but how do we operationalize this during our meeting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2757.794,
    "end": 2776.613,
    "text": " right then we have to you have to prepare something and we have to okay yes and this is why i i prepared uh the koda uh link so this is a yeah where you already some people already uh joined uh the uh joint publication because okay",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2776.593,
    "end": 2803.798,
    "text": " publication so it is already assigned topics because they are writing what they want to contribute and more important that you come already with the idea what other people are doing what is their contribution and you can already have ideas of what do you want to write in and what do you want to say about this field or maybe this and then order is the way",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2803.778,
    "end": 2831.018,
    "text": " uh to to to do it because then here it just is like a google document and then you can modify it and whatever you want to just put their text and after this we will discuss already this draft because draft is there we have uh also the definition of the field is also there and it is coming from me it's just it's maybe wrong so let's say but it can be also",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2830.998,
    "end": 2857.174,
    "text": " then you can modify it and also you can change this direction because what we will also ask a question, what is the minimal version of those AI or this intelligence in the materials and what are the limitations of experimental limitations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2857.154,
    "end": 2861.581,
    "text": " So this kind of things, I invite you to join ODA.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2861.601,
    "end": 2865.827,
    "text": "If necessary, we can open more documents there and then you can contribute.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2866.809,
    "end": 2867.59,
    "text": "Okay, very good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2867.791,
    "end": 2868.291,
    "text": "I do so.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2869.053,
    "end": 2869.613,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2870.815,
    "end": 2871.697,
    "text": "That's amazing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2872.558,
    "end": 2875.763,
    "text": "To me, it sounds as an experiment and I apologize, Manasi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2876.124,
    "end": 2880.831,
    "text": "I'm an old guy, so learning new technologies is always hard for me, but let's try it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2881.352,
    "end": 2882.233,
    "text": "It will be fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2882.77,
    "end": 2889.186,
    "text": " Hello, I have a quick question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2890.689,
    "end": 2897.185,
    "text": "These profiles that are automatically generated for all, can we modify them?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.823,
    "end": 2925.872,
    "text": " if we think that something is not yeah of course yeah a text file you can modify it it will be better because if you modify your profile that will be much better because yeah and and and and we can and get and we can access them in the website somewhere or yeah yeah yeah and it can be done like uh it's in an open uh it can be um done with access yes okay thank you",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2927.017,
    "end": 2939.295,
    "text": " Yeah, just to share like a funny thing from the previous symposium, a presenter with a name that was shared with another researcher, the perplexity internet search on their profile was 100% incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.775,
    "end": 2945.143,
    "text": "So then this person looked at it, sent in an updated manually written version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.123,
    "end": 2968.903,
    "text": " but that's a short-term type thing as we're just experimenting on these early iterations planning more weeks and months out and then at a deeper time scale having more updated information and clarity around what's open and what's shared with organizers and organizations and so on about who's available for what and what's updated information on their nano publications",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.883,
    "end": 2996.832,
    "text": " and on their preferences on their capacity the more and the more relevant and accurate that information is enables this kind of decentralized knowledge collaboration using synthetic methods better so wherever accurate information can be shared it's like it'll be leveraged if the information is not in the research profile then it's not going to come into play in the later catechism-based grant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.74,
    "end": 3004.31,
    "text": " Yeah, so we have now a few minutes before the end.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3004.33,
    "end": 3008.957,
    "text": "And yes, Vasil.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3008.997,
    "end": 3010.099,
    "text": "Just another quick one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3011.301,
    "end": 3024.861,
    "text": "Okay, so what is the best time frame until we can update our profile so the engine will have enough time to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.955,
    "end": 3035.248,
    "text": " Yeah, until the meeting, we have roughly 8-9 days, you can modify it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3035.729,
    "end": 3045.363,
    "text": "This is just a toy model, we will see how it works, and after this we will see during the meeting, maybe for sure we will have much better ideas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3045.583,
    "end": 3050.41,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3050.643,
    "end": 3074.878,
    "text": " yeah that sounds really exciting to have months in advance clear streamlined non-overloading communications have accurate information connect people and then enjoy the possibilities for having connections at events and symposia given that they're only several hours long and use the before and the during and the after",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.858,
    "end": 3080.087,
    "text": " to recognize and build on all of this amazing work and people who are at different career stages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.889,
    "end": 3092.85,
    "text": "There's so many connections with how prior publishing methods, existing grant opportunities, new publishing methods, like Nanopub, new grant opportunities,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.923,
    "end": 3108.278,
    "text": " Yeah, this we will explore a lot, because a European grant is not the only option, but now it becomes more and more the decentralized funding that comes also from this blockchain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3108.298,
    "end": 3119.63,
    "text": "And decentralized science is the same, so you don't need even a university to be a researcher, and then you can collaborate through such tools.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3119.81,
    "end": 3124.255,
    "text": "And this is how also Daniel operates this institute,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3124.235,
    "end": 3153.567,
    "text": " multidisciplinary and distributed this is uh the future i think yes okay so if no more questions then uh we we meet each other very soon almost in a week and uh we we will start uh with uh with this discussion in in life yes",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3155.032,
    "end": 3155.736,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.917,
    "end": 3156.4,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.621,
    "end": 3159.056,
    "text": "Thanks a lot, Vladimir.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.72,
    "end": 3160.344,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.686,
    "end": 3161.43,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]