[
  {
    "start": 0.123,
    "end": 0.325,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2.919,
    "end": 3.663,
    "text": "Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.895,
    "end": 7.217,
    "text": " This is Active Inference Livestream 63.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.577,
    "end": 10.139,
    "text": "It's November 7th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.239,
    "end": 25.152,
    "text": "We're here with Michal Piekarski, and we'll be hearing a presentation followed by a discussion on incorporating variational free energy models into mechanisms, the case of predictive processing under the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.973,
    "end": 29.255,
    "text": "So looking forward to this lecture and discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.495,
    "end": 31.197,
    "text": "Thank you for joining and off to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.544,
    "end": 34.385,
    "text": " Thank you very much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.805,
    "end": 35.886,
    "text": "Thank you for the invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.746,
    "end": 39.689,
    "text": "This is a great honor for me and very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.709,
    "end": 42.29,
    "text": "I'm a little stressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.411,
    "end": 59.283,
    "text": "I hope my presentation will be interesting for you and give a chance to take some new ideas concerning the Bayesian models, especially predictive processing under the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.781,
    "end": 89.607,
    "text": " So my talk is based on my recent papers, which I published after many, many months of revisions in Synthes, and I will sketch the view which I try to develop here, which I think has some interesting implications also for the discussion in the field of Bayesian modeling, like in the wider context of philosophy of neuroscience, of philosophy of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.89,
    "end": 91.711,
    "text": " cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.191,
    "end": 97.835,
    "text": "So I will try to justify the three hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.295,
    "end": 107.6,
    "text": "One general and two more specific concerning the predictive processing and free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.021,
    "end": 118.407,
    "text": "So the first one idea which I found in recent paper of some philosophers of mechanistic explanations is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.806,
    "end": 143.083,
    "text": " is the idea that there are phenomena, I think that there are neurocognitive phenomena, which should be explained not only in the terms of decomposing the mechanism which is related to these phenomena, but also should incorporate the constraints from the environmental constraints and the flows",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.604,
    "end": 144.444,
    "text": " of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.586,
    "end": 157.309,
    "text": "I will defend the view according to which, if you want to explain those mechanisms, those phenomena, we have to take an account of flows of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.829,
    "end": 165.472,
    "text": "And the notion of free energy, of course, in the work of those mechanisms is related to the thermodynamic free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.996,
    "end": 194.172,
    "text": " but i will try to show that in the free energy we can understand also in the terms of informational or version of energy this is the first hypothesis the second hypothesis is this is not my idea because we found in many papers of jacob howie or pavel guajeski the idea that predictive processing provides a sketch of mechanism in other words predictive processing is computational framework which has mechanistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.941,
    "end": 201.782,
    "text": " or which can offer a mechanistic explanation of its target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.863,
    "end": 217.666,
    "text": "And I will try to connect the two in my hypothesis and show that mechanistic predictive processing takes informational constraints from the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.206,
    "end": 224.687,
    "text": "In other words, we can integrate the free energy principle as normative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.711,
    "end": 235.878,
    "text": " theory, normative principle with process theory, predictive processing using the mechanistic picture, mechanistic idea of explanations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.419,
    "end": 238.941,
    "text": "So let's start from the first hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.082,
    "end": 253.031,
    "text": "I think that there is a general and common agree in the field, in the works of some authors from cognitive science, from philosophy of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.641,
    "end": 271.794,
    "text": " the view which is schematically called New Mechanical Philosophy, according to which the explanation of phenomena is a matter of decomposing these phenomena into underlying mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.355,
    "end": 281.282,
    "text": "So, when we want to explain phenomena, for example, this is the view defended by Carl Kraver or William Bechtel and the others,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.803,
    "end": 295.788,
    "text": " When we want to explain phenomena, not only cognitive, but also biological, social phenomena, we have to decompose the mechanism which is responsible for the realization of this phenomenon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.309,
    "end": 308.153,
    "text": "And this mechanism can be treated as a mechanism which casual product the phenomena or a mechanism which is responsible in the terms of constitutive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.629,
    "end": 312.931,
    "text": " responsibility for the realization of the phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.652,
    "end": 338.193,
    "text": "And those authors and those traditions which Craver in his book Explaining the Brain calls the system traditions, claims that explanation is a matter of finding the systems, the mechanism which should be described, should be identified by scientists and should be decomposed into parts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.226,
    "end": 353.156,
    "text": " into components, we should recognize the relation between those components, and we should recognize and describe the organization which rules of the relations between the components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.837,
    "end": 366.806,
    "text": "And it means that we can think about the mechanism in terms of hierarchical organization, because if we look on this figure from the book of the Craver, phenomena are based hierarchically on the underlying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.228,
    "end": 371.149,
    "text": " hierarchical structure of mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.949,
    "end": 373.65,
    "text": "There are lower and higher level mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.19,
    "end": 396.297,
    "text": "And according to our scientific aims, according to our strategy, we can look for the more deeper mechanisms concerning, for example, the level of biological organization to the level of the physiological organization and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.071,
    "end": 416.798,
    "text": " And one of the most important authors in the field of mechanistic explanation, the field of new mechanism, William Bechtel, in recent latest paper, he little changed the standard view on decomposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.658,
    "end": 424.381,
    "text": "He claims that heuristic of decomposition or normative strategy of decomposition in mechanical explanation should be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.909,
    "end": 429.709,
    "text": " we should rethink this strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.749,
    "end": 430.03,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.55,
    "end": 453.399,
    "text": "Because there are high-level cognitive mechanisms which cannot be described solely in the terms of hierarchical organization or in the terms of casual relations, because there are some kind of mechanisms which are, as Bechtel and colleagues claim, which are active control mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.871,
    "end": 458.254,
    "text": " There are mechanisms which are responsible for production of the phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.874,
    "end": 459.855,
    "text": "What kind of phenomena?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.895,
    "end": 468.961,
    "text": "There are active phenomena, active structures like bodily movements responsible for body movements and physiological processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.161,
    "end": 483.151,
    "text": "And Bechtel claims that those mechanisms, of course, they play a central casual role in the hierarchical organization, but they also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.786,
    "end": 511.08,
    "text": " components of complex network of heterohecar web of control systems and they play its casual role they casual role because they perform a given function in this heterohecar web why it is possible because in this sense though those phenomena are the are mutually constrained by the other elements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.008,
    "end": 522.597,
    "text": " we can call them constraints, and they are active or they derive their casual efficiency because they are constraint systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.318,
    "end": 535.508,
    "text": "And in the opinion of Bechtel and the other authors who co-work with him, it is important to rethink",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.435,
    "end": 560.866,
    "text": " our old image of decomposition because in standard view on the decomposition we don't take an account on two elements, on constraints which make given mechanism active in the sense of being part of a heterological web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.582,
    "end": 576.711,
    "text": " The second point is the energy, because biological mechanisms, cognitive mechanisms, are always related to the flows of the free energy which they transform, which they process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.952,
    "end": 579.392,
    "text": "And why this is important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.432,
    "end": 590.279,
    "text": "Because according to Bechtel, he claims, what is characteristic for biological mechanisms, in the contrast to the other mechanisms, is that the biological mechanisms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.022,
    "end": 592.563,
    "text": " are dissipative structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.803,
    "end": 599.427,
    "text": "It means that they occur and maintained in the context in which free energy is being dissipated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.208,
    "end": 620.5,
    "text": "And if we don't incorporate this element of transforming, of processing the flows of free energy, in the fact that we don't really explain why given mechanisms, why given systems have behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.34,
    "end": 626.203,
    "text": " as Bechtel and Bich claims, completely unconstrained system will have no behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.523,
    "end": 644.713,
    "text": "And I will think that if we want to explain neurocognitive mechanism, we have to adopt the view which I described in my paper as a constraint-based mechanism approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.273,
    "end": 650.096,
    "text": "And according to view, it's heuristic, mechanistic explanation of at least some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.049,
    "end": 664.334,
    "text": " cognitive phenomena should be based or should incorporate dimensions of constraints, element of the environment which makes mechanism active, and the flows of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.594,
    "end": 669.075,
    "text": "And this is the first piece of my idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.535,
    "end": 676.198,
    "text": "And second is that I think that we can try to demonstrate this idea in one...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.125,
    "end": 689.931,
    "text": " example from contemporary cognitive science and I will try to adopt this idea into the frame of predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.971,
    "end": 707.903,
    "text": "So now I will sketch a short view about predictive processing framework and why this is important for me to try to test this framework into the context of the constraint-based mechanism approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.06,
    "end": 725.772,
    "text": " So predictive coders develop the Kantian, the Helmholtzian idea that our cognitive systems, our brains, don't have direct access to the causes of information we receive by the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.433,
    "end": 734.519,
    "text": "And they claim that the central, the main function of the brain on the surgical nervous system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.208,
    "end": 742.912,
    "text": " is to minimize uncertainty, which is described in the terms of minimizing long-term minimization of average prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.693,
    "end": 745.533,
    "text": "How it is possible?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.613,
    "end": 747.934,
    "text": "How brain can do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.535,
    "end": 761.161,
    "text": "It is possible because the brain inhabit or embedded the virtual informational structure, which predictive models by agents describe as generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.601,
    "end": 763.902,
    "text": "And the generative model is hierarchical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.228,
    "end": 794.854,
    "text": " and multi-level structures which transform process the information coming from the interest why because in this way the brain can minimize the so-called prediction error the discrepancies the differences between the state of the model state of the organism and the information coming from the from the environment because successful minimization of prediction error has many",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.675,
    "end": 821.12,
    "text": " adaptive benefits so this is general picture now we should look more closer to this image and try to develop a more formal technical language so we can use this the idea which develops a lot like to think about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.344,
    "end": 850.949,
    "text": " relation between the events in the world in the term of relation between cause and effect but what we receive is the observation we receive by the sensory input observations and if the idea developed by predictive coders coming from Helmholtz is that we don't have an access to the straight true states as understood as a causes of the observation so we have to infer the true states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.29,
    "end": 861.972,
    "text": " to act successfully in the environment and how it is possible to infer, to guess the true states responsible for the observation we receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.372,
    "end": 877.355,
    "text": "So there is a development of the Helmholtzian idea of unconscious inference and Bayerians claims that this idea can be translated into the thinking about the statistical inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.395,
    "end": 878.796,
    "text": "What kind of statistical inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.376,
    "end": 880.796,
    "text": "As we know, this is the Bayerian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.698,
    "end": 882.578,
    "text": " Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.658,
    "end": 892.241,
    "text": "But what does it mean that generative model minimize prediction error or infer the true states using the Bayesian inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.081,
    "end": 905.664,
    "text": "Talking about Bayesian inference raises a small problem because Bayesian inference, exact Bayesian inference is intractably hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.304,
    "end": 909.505,
    "text": "You cannot compute exact Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.025,
    "end": 911.425,
    "text": "And the idea which developed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.09,
    "end": 925.359,
    "text": " for example, Carl Freestone, is that our models, our brains using models, generative model, don't compute exact Bayesian inference, but it uses the simpler version of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.479,
    "end": 930.242,
    "text": "They use approximation of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.383,
    "end": 938.168,
    "text": "So in other words, if the story is correct, then continuous minimization of prediction error",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.431,
    "end": 944.214,
    "text": " can be described or understood or explained in the terms of approximation of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.674,
    "end": 962.886,
    "text": "And this approximation is possible because model minimizing prediction error simultaneously minimize a certain quantity, which Friston calls variation of energy, the quantity which is always greater than or equal to suppressor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.006,
    "end": 966.188,
    "text": "And using this quantity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.579,
    "end": 984.572,
    "text": " model iteratively update the internal parameters, update the internal states, and in that way can infer the most probable true states, which is responsible for the observation which model refers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.932,
    "end": 996.321,
    "text": "So, according to predictive co-processing, as I read it correctly, what is characteristic for the brain is that the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.961,
    "end": 1004.525,
    "text": " main function is to processing information in the terms of Bayesian approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.625,
    "end": 1013.35,
    "text": "And I tried to unpack this idea and try to read this in the context of new mechanical philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.371,
    "end": 1015.731,
    "text": "So this is the first step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.751,
    "end": 1022.995,
    "text": "The second one is to justify that predictive processing can be connected with mechanical philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.696,
    "end": 1027.138,
    "text": "And in many papers of Paweł Gładziecki,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.056,
    "end": 1042.585,
    "text": " we see good arguments according to which predictive processing as computational architecture provides the scientist so-called sketch of mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.005,
    "end": 1044.006,
    "text": "What is sketch of mechanisms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.046,
    "end": 1052.792,
    "text": "This is the idea developed by Piccinini and Kaplan, and they claim that sketch of the mechanism is the incomplete",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.357,
    "end": 1054.898,
    "text": " representation of mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.159,
    "end": 1064.686,
    "text": "It means there's some kind of representation of mechanism when the scientist omitted some components, some parts of the mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.786,
    "end": 1074.733,
    "text": "And good sketch of the mechanism should lead us to the schema of mechanism, which is the complete representation of constitutive element of given mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.773,
    "end": 1082.039,
    "text": "So if predictive processing gives us a chance to write a sketch of the mechanism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.17,
    "end": 1106.759,
    "text": " And if predictive processing is about the neural function of the brain, then if the view which I developed after the ideas of Bechtel and colleagues, if this view of the constraint-based mechanism of approach is correct, then I will claim that if predictive processing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.614,
    "end": 1118.34,
    "text": " if predictive coders want to build a mechanistic explanation of cognitive phenomena, they should include into the explanation flows of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.821,
    "end": 1135.791,
    "text": "Because without these flows, without the constraint of information, or in general, free energy, we cannot explain how it is possible that the mechanism operates and is active as long as this energy is available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.6,
    "end": 1148.884,
    "text": " And the thesis which I defend in this paper in sentence is that predictive processing models should include informational constraints if they are to be mechanistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.264,
    "end": 1155.227,
    "text": "Of course, if we think about predictive processing as the way to explain the function of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.387,
    "end": 1166.091,
    "text": "And of course, there is one natural question, because many authors will claim that the good theoretical normative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.103,
    "end": 1172.265,
    "text": " for building models in predictive processing offer the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.025,
    "end": 1180.529,
    "text": "So the question arises, does the free energy principle can offer these constraints for predictive architecture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.909,
    "end": 1196.337,
    "text": "And I will claim that yes, the FEP offers these constraints, but of course, we should try to justify this test more specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.143,
    "end": 1207.225,
    "text": " But we find one big problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.305,
    "end": 1226.97,
    "text": "When we look into the 2018 paper of William Bechtel, when he introduced the idea of necessity of including the free energy flows into explanations, he directly writes that the notion of free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.733,
    "end": 1239.757,
    "text": " which he developed in his papers, in his view, is distinct from the free energy principle or free energy articulated by Carl Friston and the others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.277,
    "end": 1247.76,
    "text": "In other words, he said that, okay, we should include in the explanations flows of the free energy, but this is the thermodynamic free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.84,
    "end": 1253.882,
    "text": "We cannot use the other kind of the energy because this is distinct notions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.818,
    "end": 1269.866,
    "text": " In the same year, in 2018, Friston published a draft, a preprint of his book, A Free Energy Principle for Particular Freezing, and he said something that contradicts with the view of the Bechdel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.466,
    "end": 1280.451,
    "text": "He said that, heuristically, free energy, thermodynamic free energy is consistent with the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.412,
    "end": 1282.813,
    "text": "It means that Friston claims",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.681,
    "end": 1287.544,
    "text": " something what contradicts the thesis of the Bechtel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.584,
    "end": 1297.676,
    "text": "And I think that it is possible to justify the thesis of Friston, but possibly I try to do this in a different way than Friston does this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1305.282,
    "end": 1322.393,
    "text": " For me, as a person without good formal preparation to reading the paper of Carl Friston, it was hard to find a good way of reading his paper or his cooperators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.434,
    "end": 1330.018,
    "text": "But I think that we can try to reconstruct the idea which supporters of the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.431,
    "end": 1339.774,
    "text": " develop and these ideas can be commonly described as something what I call the Bayesian mechanics argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.335,
    "end": 1351.899,
    "text": "The first site I wrote here is coming from the paper of Max Ramstedt and he claims that a decor of Bayesian mechanics is the variational free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.599,
    "end": 1360.142,
    "text": "So that Freestone in his latest paper proposed the idea of the loping of the Bayesian mechanics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.928,
    "end": 1373.658,
    "text": " the Bayesian mechanics which can investigate, describe and offer the theoretical background for explanation what is free energy principle, what is rational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.279,
    "end": 1379.283,
    "text": "And why this idea is important for me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.323,
    "end": 1389.331,
    "text": "Because Fristel will claim that every kind of mechanism, each mechanism can be treated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.874,
    "end": 1393.516,
    "text": " as an expression of some kind of mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.357,
    "end": 1402.364,
    "text": "We've got classical mechanics, we've got quantum mechanics, thermodynamics, statistical, also Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.725,
    "end": 1406.648,
    "text": "And every kind of mechanics has its own reified constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.069,
    "end": 1414.235,
    "text": "Those constructs can be understood as thermodynamic energy, temperature, or variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.241,
    "end": 1427.407,
    "text": " And what is important is that those constructs, those reified constructs, those notions are justified and can be used only in the realm of the given type of mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.887,
    "end": 1440.013,
    "text": "It means that it is possible that we've got some reified constructs which we can use on the base in the realm of the one kind of the mechanics, but we cannot use this in the other type of mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.153,
    "end": 1442.574,
    "text": "For example, when we talk about the notion of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.405,
    "end": 1472.656,
    "text": " temperature it can be and it will be used in different way in the realm of quantum and within the realm of statistical mechanics and it means that if we take the construct like variational free energy on thermodynamic free energy from the point of the view of this argument it means that all of these constructs are relativized or related to the description and method of measurement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.279,
    "end": 1478.22,
    "text": " which we use in the specific type of mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.701,
    "end": 1480.321,
    "text": "What does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.361,
    "end": 1497.885,
    "text": "It means that there is no ontological... We don't have a good ontological argument to claim something like that, that, for example, statistical mechanics is more primary than, for example, classical or Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.925,
    "end": 1498.145,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.185,
    "end": 1502.226,
    "text": "Because every kind of mechanism, each type of mechanics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.691,
    "end": 1507.873,
    "text": " can be treated as a complementary description of the behavior of a dynamic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.594,
    "end": 1524.041,
    "text": "It means that the most primary, the most basic structure, we try to explain, describe in terms of mechanics, dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.742,
    "end": 1531.805,
    "text": "According to Freestone, it means that Bayesian mechanics can be treated as all others",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.759,
    "end": 1536.12,
    "text": " kind of mechanics which we find in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.8,
    "end": 1546.844,
    "text": "But what is specific for this mechanic, as I said, is the assumption of variational free energy, which is strictly related to the assumption of Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.184,
    "end": 1561.829,
    "text": "Tristan will claim that this additional constraints, the constraints of Markov blankets, makes possible to speak of states of something as relative as something different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.324,
    "end": 1563.405,
    "text": " of something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.706,
    "end": 1571.951,
    "text": "And why this is important to make a possibility to talk about, for example, internal and external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.571,
    "end": 1586.861,
    "text": "Because this possibility of talking about different states is directly applicable and directly important to the living organism and, for example, neural structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1588.262,
    "end": 1590.284,
    "text": "Friston, in his book, claimed that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.434,
    "end": 1613.19,
    "text": " every type of mechanics, you can ignore assumption of a marker blanket and the assumption of rational free energy and in some implicit sense will claim that the state outside blanket and the state outside blanket, this difference between those kind of states can be ignored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.611,
    "end": 1613.891,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.991,
    "end": 1619.135,
    "text": "Because if this way of thinking is correct,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.234,
    "end": 1645.187,
    "text": " uh every kind of mechanics give us a chance give us a possibility to talk about the systems we try to describe in terms of heat bed or thermal reservoir it means that every kind of mechanics except quantum mechanics give us a possibility to talk about the states as in equilibrium steady state so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.533,
    "end": 1657.66,
    "text": " And according to this argument, we should say that variational free energy can be applied and justified only in the realm of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.361,
    "end": 1671.37,
    "text": "And this application helps us to describe, explain why some things are autonomous or active, why some things can be as Bechtel says, dissipative structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.132,
    "end": 1677.335,
    "text": "But it means that variational free energy gives us a chance to describe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.01,
    "end": 1697.615,
    "text": " some kind of phenomena, some kind of system as autonomous or active, and simultaneously thermodynamical free energy can be implied in the realm of the object which we want to explain in the terms of statistics, as a statistical ensemble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.876,
    "end": 1706.657,
    "text": "And this is why Friston will claim that both",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.421,
    "end": 1736.939,
    "text": " variational free energy and thermodynamical free energy are consistent because they are two consequences or expression we can say the same more elemental thing the thing which can more elemental more basic mechanistic or maybe quantum nature and it means that thermodynamical free energy and variational free energy are the notion or constructs which we can trade as the as a two side of the one coin and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.521,
    "end": 1754.507,
    "text": " And using them is dependent of our method of measurements, of our scientific interest, from our strategy to investigate phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.527,
    "end": 1761.55,
    "text": "But they are complementary in the sense that they offer the scientists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.72,
    "end": 1770.324,
    "text": " the possibility of described dynamical systems from the two other sides, but those sides are complementary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.746,
    "end": 1778.749,
    "text": "And how we should understand and interpret the Bayesian mechanics argument?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.151,
    "end": 1788.515,
    "text": "Because I think this argument should be interpreted in a more philosophical, more specific way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.033,
    "end": 1814.184,
    "text": " that thermodynamical free energy and variational free energy are two sides or are related to us, two aspects of more primal dynamics, there is still open the questions about what we talk when we talk about systems which minimize variational free energy and when we talk about the flows of the thermodynamical free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.006,
    "end": 1838.537,
    "text": " And I think that this ultra-realistic or super-realistic interpretation, literal interpretation of this argument is not correct, because it seems that we should interpret construct like thermodynamical and variational free energy as useful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.344,
    "end": 1850.613,
    "text": " useful function which uses, which justification are related to our scientific models and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.634,
    "end": 1863.783,
    "text": "In other ways, there will be the problem to defend the thesis of wisdoms that the Bayesian and stochastic mechanics are equivalent formulation of the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.903,
    "end": 1865.284,
    "text": "I think that the same thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.164,
    "end": 1869.926,
    "text": " about which Friston talked, is the dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.947,
    "end": 1883.553,
    "text": "And we try to find good tools to describe the systems, but it means that we don't have good tools which represent or map the real structure of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.734,
    "end": 1892.838,
    "text": "And it means that the notion we use, like rational free energy and thermodynamic free energy, should be understood as the constructs which are related",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.746,
    "end": 1901.39,
    "text": " and ultimately reduced to the method of measurement, descriptions, the method we use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.291,
    "end": 1923.14,
    "text": "So it means that when we talk about the consistency or complementarity of variational free energy and thermodynamical free energy, we don't make any ontological commitments, any ontological assumption about the representational architecture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.09,
    "end": 1925.531,
    "text": " of the target systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.173,
    "end": 1937.22,
    "text": "It means that the models which are based on the free energy principle address the casual structure of the world in the sense that they are epistemically useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.68,
    "end": 1952.15,
    "text": "We can use them in the practice of model building, but they are not epistemically useful in the sense that we describe the real properties which we can literally describe as generative models, as variational free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.625,
    "end": 1953.565,
    "text": " and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.386,
    "end": 1963.728,
    "text": "And I think when we talk about the free energy principle, the instrumental and realistic interpretation is correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.828,
    "end": 1971.711,
    "text": "The free energy principle doesn't imply any ontological solution about the target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.311,
    "end": 1980.173,
    "text": "But from the point of view of my argument, there is one problem because this instrumental interpretation of Freestonean argument",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.896,
    "end": 1988.459,
    "text": " doesn't have any specific mechanistic implication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.099,
    "end": 1992.88,
    "text": "We don't anything talk about mechanistic character of the phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.041,
    "end": 1995.061,
    "text": "Why this is important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.101,
    "end": 2009.547,
    "text": "Because when we come back to the field of new mechanical philosophy, we will see that I think there is, in very general, there is a common view that we should",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.26,
    "end": 2015.202,
    "text": " think about mechanism in a realistic manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.682,
    "end": 2017.843,
    "text": "What does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.923,
    "end": 2037.732,
    "text": "The view which I try to describe here is so-called mechanistic realism, according to which we should think about the structures, the entities in the world as the structure which are in some sense richer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.205,
    "end": 2067.141,
    "text": " than mere aggregation of causes why this is important because um mechanism which we try to identify the compose should be should be produced by some kind of structures and this structure should be more richer than a simple aggregation of the causes and this is the first part first part of this argument and the second connect connected to the idea i try to develop is that that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.537,
    "end": 2094.866,
    "text": " There are some of those structures whose, at first, organization cannot be reduced to an aggregation of causes, and second, this organization should be explained in terms of mechanisms which are constrained by flows of information, flows of thermodynamic free energy, and described maybe in terms of minimizing rational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.529,
    "end": 2115.056,
    "text": " In other words, I will reclaim that if we adopt the mechanistic realism, we should try to say that there are such phenomena, such structures, the explanation of which should take into account the energetic constraint, which we can try to describe in terms of variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.657,
    "end": 2121.058,
    "text": "And if we try to adopt the image of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.878,
    "end": 2135.508,
    "text": " coming from the mechanistic realism will defend the view which I describe as moderate realism about Bayesian modeling or moderate realism about processing and the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.369,
    "end": 2151.561,
    "text": "In this moderate realistic interpretations, we can say that system minimizes prediction error or minimizes variational free energy because it implements in some way some casual mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.165,
    "end": 2163.715,
    "text": " than can be described approximately in terms of minimizing variational free energy or simultaneously maximizing mutual information between internal states and sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.376,
    "end": 2180.028,
    "text": "And it means that we can identify, describe and decompose some kind of mechanism which we should trade as a system of mutual constraints",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.558,
    "end": 2208.779,
    "text": " that restrict the flow of information, the flows also, the thermodynamic free energy to perform work in such a way that those mechanism minimize or should minimize discrepancy between internal state, between the parameter of the model, between the prediction of the model and the information coming from the environment in which given systems act and live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.471,
    "end": 2209.711,
    "text": " Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.971,
    "end": 2228.035,
    "text": "Because without taking those constraints, flows of information, we cannot describe and explain why this kind of organisms are at non-equilibrium steady states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.493,
    "end": 2252.696,
    "text": " So, and I think that we can find in the field of thermodynamics of information and also in the work of Krafft-Risdom argument, which I call the argument from neurocomputation, a good argument for the moderate realistic interpretation of CP and free and net principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.836,
    "end": 2262.758,
    "text": "And according to this argument, we can say that there is always trade-off between neural information processing and thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.649,
    "end": 2265.771,
    "text": " thermodynamic energy cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.451,
    "end": 2287.784,
    "text": "It means that every time when biological sensor detect a change in the environment, every time when biological organ process the informations, this processing confirmation or detection a change in environment is proportional to the amount of information, is proportional to some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.262,
    "end": 2293.644,
    "text": " minimum energy in terms of thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.684,
    "end": 2305.332,
    "text": "So every time when a system processes information, every time there is a minimum cost of thermodynamic energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.492,
    "end": 2317.819,
    "text": "And this argument from neural computation could be related to the formal investigations coming from the Fristow monograph about the Yerzynski equality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.195,
    "end": 2324.219,
    "text": " piece of this book about the Yezinski equality is really hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.201,
    "end": 2342.554,
    "text": "But one and a half years ago I was talking with Carl Friston about this argument about the Yezinski equality and I think we can try to reformulate it in a more non-formal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.404,
    "end": 2372.599,
    "text": " according to the yashinski equality if we interpretate this in the realm of the free energy principle this equality allows us to connect variational free energy with thermodynamical free energy in this sense that when we want to describe a moving one system from one state to another and this moving in the system we can understood as creating or destroying the information there is a certain amount of thermodynamic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.747,
    "end": 2378.39,
    "text": " work cost and thermodynamic action, which should be entailed by this moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.571,
    "end": 2400.185,
    "text": "In other words, when we look into the generative model in our brains, we will say that every time when the model update belief, in the sense that every time when model change information in the internal state of the model, every time there is a thermodynamical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.598,
    "end": 2428.721,
    "text": " work costs so the belief updating in the bayesian generative model is strictly related to the thermodynamic cost of this belief updating and i think that moderate realistic interpretation should explain us how it's possible because because when we talk about the belief updating generative model when we talk about the minimization of error literally we we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.794,
    "end": 2436.016,
    "text": " literally we don't map the formal structures we use onto the target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.276,
    "end": 2441.898,
    "text": "I don't claim that there are real generative model in our brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.978,
    "end": 2459.283,
    "text": "I don't think that our brains optimize base and so on, but I will claim that there are some structures in our head, there are some structures in the world that are richer than simple aggregation of codes, and those structures implement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.631,
    "end": 2472.077,
    "text": " some casual mechanism that scientists can approximately describe in terms of models which minimize operational energy or prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.738,
    "end": 2487.125,
    "text": "And I agree with the thesis of Kirchhoff and colleagues that our models fit the data without literal mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.265,
    "end": 2489.066,
    "text": "Yes, our models are true,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.927,
    "end": 2492.169,
    "text": " because they are approximation of the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.15,
    "end": 2511.427,
    "text": "And I think that we can think about the predictive processing model integrated with the free energy principle as some kind of approximation of the data which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.404,
    "end": 2519.229,
    "text": " we want to investigate a specific type of the data, like our neural organs and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.709,
    "end": 2524.612,
    "text": "And I think that we should distinguish and remember about three distinct elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.153,
    "end": 2540.523,
    "text": "The free energy principle as formal principle, the formal principle which doesn't assume any ontological assumption and doesn't imply any ontological commitments about the target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.554,
    "end": 2568.063,
    "text": " the predictive processing framework as mechanistic computational models, which are grounded from the one side in this formal principle, when the formal principle offers the variational methods, variational notions, and from the other side on the heuristic of mechanistic explanations, and the biological systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.164,
    "end": 2596.303,
    "text": " the target systems that predictive processing and Bayesians employed to model, which are based, which are independent of the implication or on the language of the free energy principle and also which are independent from the language and ontological implication of process theory like predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.81,
    "end": 2600.691,
    "text": " And going to conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.751,
    "end": 2621.658,
    "text": "So, I would claim that the reference to the informational constraints allows the scientists to explain the neural organs, the brains, not only as a kind of physical material, physical mechanism, but also as systems which have future homoesthetic nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.587,
    "end": 2646.164,
    "text": " And I will claim that it means that a full, a satisfactory explanation of how the brain works, not only how the brain can be treated in terms of statistical or classical mechanics, but also with the terms of thinking about the brain as active as the part of living body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.184,
    "end": 2649.226,
    "text": "A full explanation of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.229,
    "end": 2666.013,
    "text": " brain as part of the living body requires taking into account informational constraints, which I believe can be characterized and described in terms of Bayesian operational free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.733,
    "end": 2679.317,
    "text": "And the last one conclusion is the observation that from the point of view of the argument I tried to develop is that the free energy principle is also normative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.986,
    "end": 2695.317,
    "text": " in the sense that it sets a norm that should be met by mechanistically non-trivial process theory or predictive processing models, assuming the correctness of the constraint-based mechanism approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.798,
    "end": 2697.439,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.459,
    "end": 2698.76,
    "text": "That's all what I have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.946,
    "end": 2707.306,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.858,
    "end": 2725.216,
    "text": " great presentation I'll make a first comment meanwhile anyone who's watching live is welcome to ask a question okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.867,
    "end": 2753.008,
    "text": " well i would like to applaud this great talk you connected the scholarship and the framings that are used in the philosophy of mechanistic accounts with free energy principle active inference predictive processing and i think you articulated several",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.585,
    "end": 2778.823,
    "text": " lines of arguments that were in the literature including where there was change or even partial um incoherence or just partial ambiguity certainly ambiguity related to um justifications or understandings of the relationship between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.046,
    "end": 2809.214,
    "text": " thermodynamic free energy and mechanics and Bayesian free energy and mechanics and that is a very wide space with everyone saying things like it's a purely formal resemblance and it's just a convenient computational heuristic used in science and physics and engineering and there's just no need to worry about more than that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.114,
    "end": 2838.257,
    "text": " ranging to arguments that that they are co-extant or that they have different kinds of statuses so i very much appreciate in your paper and in this presentation that according to the way that different discussions about mechanism have been carried out in the biological sciences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.569,
    "end": 2869.208,
    "text": " using that setup to clarify some of these discussions in this field that are all great to approach with kind of a first principles view and it's helpful to see how it connects with the arguments of like craver and bechdel hey thanks um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.43,
    "end": 2896.01,
    "text": " I agree that I try to develop some arguments which exist in the current literature, but, for example, when I read the paper of Bechtel, I think that this idea doesn't be directly or explicitly articulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.03,
    "end": 2896.09,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.261,
    "end": 2911.467,
    "text": " And I think that Bechtel doesn't agree with my argument, my interpretation of his view, because of the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.107,
    "end": 2917.37,
    "text": "But I still believe that this is very basic intuition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.39,
    "end": 2925.914,
    "text": "But this intuition said that if we think about the part of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.906,
    "end": 2927.766,
    "text": " human organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.807,
    "end": 2934.41,
    "text": "If we think about the brains, what is more specific for the brains is that the brain processes information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.231,
    "end": 2950.619,
    "text": "Not brain processes the thermodynamic energy, not brain processes or produces some kind of hormones, but the brain processes the information and this information is very important for a living organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.0,
    "end": 2955.142,
    "text": "And I think that this intuition should be tasted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.794,
    "end": 2964.198,
    "text": " in the field of science or maybe in the field of philosophy of neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.498,
    "end": 2983.088,
    "text": "And I'm not so sure that this is possible to test it, but I think that this is important to description or explanation of those mechanisms, that those mechanisms are the mechanisms of processing information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.008,
    "end": 2984.749,
    "text": "And possibly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.471,
    "end": 2996.136,
    "text": " Possibly, maybe it's enough to say that, okay, those mechanisms of information which the brain processes, it's not important to explanation of how it is possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.678,
    "end": 3014.288,
    "text": "I think that predictive coders, the supporters of the free energy principle, said something important, and they claimed that what is specific for the brain is not only that the process information, but also is the process in some specific way using",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.201,
    "end": 3022.486,
    "text": " something what we can describe in terms of Bayesian proclamation or more wider as a statistical inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.566,
    "end": 3043.663,
    "text": "And I think if predictive coders, predictive processing is a fruitful strategy of explanation in the field of neuroscience, if the model builds by predictive coders are scientifically useful,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.398,
    "end": 3074.164,
    "text": " then we should take and we should use this heuristic coming from the free energy principle that take it seriously because i don't want to i try to say that uh talking about the brightness which use it which uses which use the generated model which approximates by asian inference this is not the way of talking way of speaking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.938,
    "end": 3092.19,
    "text": " I think that we not only describe, but the word we use, the notion we use, as I said, in some way corresponds to some kind of structures, casual structures which we have in our head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.93,
    "end": 3103.097,
    "text": "And maybe we investigate, we invite more specific, better words, better concepts, better tools,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.507,
    "end": 3130.204,
    "text": " to describe those structures, but I believe that for now, predictive processing under the free energy principle gives us a good chance to explain why our brains are not only the matter, but also the important part of the living bodies, and what is the difference between the brain as an active control mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.308,
    "end": 3139.134,
    "text": " and why this brain shouldn't be treated as a heat bath or a thermal reservoir and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.515,
    "end": 3159.55,
    "text": "And I think this is the reason why Bechtel tried to reformulate the classical image of decomposition because he observes that some mechanism cannot be described or treated as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.499,
    "end": 3190.472,
    "text": " non-living, non-active, and if they should be treated as active and living, then I think we have to try to incorporate into our understanding, into our explanation, the fact that the information which the brains, those mechanisms process is really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.834,
    "end": 3201.197,
    "text": " really important to understand why and how they act, how they are the part of dissipative structures like our organ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.618,
    "end": 3204.998,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.318,
    "end": 3207.919,
    "text": "I'll ask a question next from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.579,
    "end": 3217.402,
    "text": "John Athos wrote, what are you defining as information when you say the brain is processing information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.45,
    "end": 3222.171,
    "text": " Good questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.414,
    "end": 3231.878,
    "text": "I think when I talk about information, I think about some kind of semantic information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.52,
    "end": 3244.787,
    "text": "Of course, if we try to use in practice this idea which I tried to develop, the question about information should be more specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.342,
    "end": 3271.071,
    "text": " I find the argument which developed Rosa Kao, as I remember, when she claims that when we talk about the information which is processed by single neuron, of course, this is some kind of synthetic information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.111,
    "end": 3272.372,
    "text": "There is no any semantic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.892,
    "end": 3280.096,
    "text": "But when we want to try to understand how it is possible that the brain as full organ",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.052,
    "end": 3288.736,
    "text": " the cortex process information, this is always strictly related to some kind of semantic information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.156,
    "end": 3307.986,
    "text": "And I think we can think about this semantic information, try to, but this is, I don't know for now how it is possible in the realm of my argument, but we think to try about this, what we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.831,
    "end": 3329.222,
    "text": " traditionally described as semantic information in terms of variational information, because I think that if brains minimize prediction error, if brains approximate Bayesian inference, it means that brain operates, uses the information in semantic sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.331,
    "end": 3342.699,
    "text": " In my paper, I wrote about the mutual information between the internal and sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.2,
    "end": 3357.77,
    "text": "But I think, I see this as lack of my view, because I don't precise what kind of information precisely I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.729,
    "end": 3380.487,
    "text": " But I think that if we take this view as some kind of proposition of heuristic of building the models, the empirical investigations lead us to the possibility of describing this information in more specific terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.812,
    "end": 3413.045,
    "text": " awesome very interesting so a few lines that i'd love to ask uh questions about so in your paper and presentation you center the variational free energy as kind of the analytical construct doing the work in the mechanistic account and i wondered what leads to one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.518,
    "end": 3444.571,
    "text": " analytical constructs doing that kind of work for example why not center surprise and see variational free energy as a computational heuristic or just an approximator so what would be the relevance in a mechanistic account that centers the concept of surprise or the concept of prediction error",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.862,
    "end": 3462.874,
    "text": " versus the concept of variational free energy, which are related concepts in that an organism minimizing one does minimize across all, but they are different in terms of their formal basis and what we could say about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3466.796,
    "end": 3471.5,
    "text": "Okay, I think that... I think that if...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.892,
    "end": 3478.094,
    "text": " The answer to your question can have two parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.334,
    "end": 3484.457,
    "text": "The first one is related to the view which I defend as moderate realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.397,
    "end": 3501.965,
    "text": "And I will claim that the notion we use, the concept we use, are related, are corresponds to the structures which we try to develop and describe using these notions, but it's not the sense that we literally map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.779,
    "end": 3506.16,
    "text": " the content of these notions onto those target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.2,
    "end": 3522.306,
    "text": "So probably variational free energy for now looks a good fit to those phenomena from my point of view, but it doesn't mean that we can't use the other notions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.366,
    "end": 3528.268,
    "text": "But you ask why we don't talk about surprise or predictive errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.308,
    "end": 3530.209,
    "text": "I think that we don't explain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.531,
    "end": 3548.355,
    "text": " in a satisfactory way, this idea when we talk about the surprise, maybe our prediction error, because we don't understand why the brain approximates Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.195,
    "end": 3560.858,
    "text": "If we don't introduce the notion of the variational free energy, or maybe it's equivalent to the upper bound of surprise, but if we don't introduce this notion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.764,
    "end": 3575.57,
    "text": " then we don't find the computational formulation or computational foundation to description of the brain working in terms of minimization of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.59,
    "end": 3584.793,
    "text": "Because I've got some problems with it, but maybe try to explain how I understand this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.153,
    "end": 3586.054,
    "text": "If we take the few...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.741,
    "end": 3602.01,
    "text": " your level of description of David Maher, I think that talking about the minimization of prediction error or minimization of uncertainty are related to the computational level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.81,
    "end": 3611.297,
    "text": "And I think that talking about minimization of rational affinity or approximation Bayesian inference are related to the algorithmic level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.597,
    "end": 3618.782,
    "text": "And the idea which I try to develop is to using the connection between those levels to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.321,
    "end": 3626.166,
    "text": " investigates what's happened on the mechanistic level, the third level of Mar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.226,
    "end": 3640.957,
    "text": "And I think that the notion of prediction error or supra so when we talk about this, we omit something important what describe and explain freestone his his paper concerning the version of energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.72,
    "end": 3646.141,
    "text": "Yeah, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.381,
    "end": 3647.242,
    "text": "Also, there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.605,
    "end": 3676.048,
    "text": " different ways to view this but in the vfe centrism there's also the possibility of relationality as a core principle because if the mechanism surrounded surprisal of the system that would be closer to an account where there was like a surprise module or something that was a about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.313,
    "end": 3703.215,
    "text": " what the systems what representations were internal for the system but with vfe we have something that's explicitly implementational relative to a constructed model so then it it naturally um connects to discussions about how modeling is done as a practice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.709,
    "end": 3717.452,
    "text": " because it is a constructed variable, whereas like temperature, ostensibly, it is important for a chemical reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.212,
    "end": 3720.693,
    "text": "Or temperature is a coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.733,
    "end": 3728.215,
    "text": "I'm sure there's a lot of ways to say it more formally, but the kinetics do matter for the chemical reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.475,
    "end": 3733.536,
    "text": "And then we have tools that are able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.899,
    "end": 3764.395,
    "text": " measured temperature in different settings cognitive modeling seems to have a relational step that's a lot more multifaceted because VFE is only calculated relative to the modeler's construct so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.052,
    "end": 3786.799,
    "text": " one person might make a model that shows the vfe doing this and a different model would show something different and that seems to be a bit different than like we have two thermometers but we both agree that temperature really does matter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.276,
    "end": 3799.361,
    "text": " Yes, I agree, but I think the information, the dimension of information is more subtle than the dimension of temperature of mass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.941,
    "end": 3812.947,
    "text": "And of course, VFE is related to the modelers and model which they develop, but... I tried to say something more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.048,
    "end": 3819.091,
    "text": "Of course, VFE is related to the modelers, but there is something in the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.373,
    "end": 3824.615,
    "text": " target phenomena which motivate modelers to use the VFE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.835,
    "end": 3849.764,
    "text": "And of course, if I look on the piece of the paper, the paper doesn't look like, for example, processed information and doesn't motivate me to think about this paper as something what I can model and using the variational free energy or variational principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.435,
    "end": 3866.905,
    "text": " But when I talk about a living organism or the human brain, something like that, there is something in the structure, in the phenomena, which motivates me to build a model using this principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3867.526,
    "end": 3877.672,
    "text": "And of course, the truth of the method of measurement, the truth of the method of model building is arbitrary in the sense that the target phenomena",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.817,
    "end": 3884.622,
    "text": " doesn't directly give us an information which method is better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.782,
    "end": 3899.213,
    "text": "But it's not arbitrary in the sense that I think that we can, in the same fruitful way, use the statistical mechanics, for example, to explain the brain and, for example, Bayesian modeling to explain the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.673,
    "end": 3905.358,
    "text": "It's not arbitrary in the sense that I can use the piece of paper to eat something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.102,
    "end": 3913.948,
    "text": " I can take a glass of the water if I want to drink, but I cannot take a piece of paper if I wanted to drink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.509,
    "end": 3934.464,
    "text": "But in this sense, when we distinct the formal principle, the normative principle, we distinct the model which are built on the normative principle, and the target phenomena which we want to explain using this model based on the formal principle, then it means that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3936.098,
    "end": 3945.02,
    "text": " the relation between the target phenomena and the relation between the model is not arbitrary in the sense that we can use every kind of the model to every kind of phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.76,
    "end": 3957.542,
    "text": "And I think that when we try to look into our brains, this kind of the structures in some way motivate us to build the computational models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.722,
    "end": 3963.524,
    "text": "And those computational models, I think, is in some sense different than the computational model, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.896,
    "end": 3970.84,
    "text": " behavior of, I don't know, pigeons or moving of my hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.86,
    "end": 3992.279,
    "text": "And so, generally I would say that truth of... And coming back to your questions, as I said, the dimension of information, the informational constraints are more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.108,
    "end": 4022.399,
    "text": " more subtle than the constraint like mass or temperature because probably we don't have as a same good method of measurement of the information like we have the good method of measurement of temperature of the mask and probably maybe the free energy principle or variational principles are not the the best",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.885,
    "end": 4032.09,
    "text": " possible way of describing and explaining the brains, but probably I think this is the most optimal for this moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.111,
    "end": 4046.419,
    "text": "When we take the whole knowledge, our knowledge about the brains, it's the most optimal models and methods to try to explain this phenomenon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.437,
    "end": 4070.466,
    "text": " But as I said, using of the variational principles, using of the Bayesian modeling doesn't lead us to say something very specific, ontologically independent from these models about the nature of the phenomena we described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.233,
    "end": 4102.42,
    "text": " thank you yeah that makes me think about a sufficient account a mechanistic account if you have a system that entirely is described by hot and cold flows through a pipe you may have a sufficient and even a total account with only thermodynamics now maybe the hot and the cold exactly signify like a signal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.479,
    "end": 4114.041,
    "text": " So then there would need to be some kind of information processing model or layering to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.361,
    "end": 4131.725,
    "text": "And then we move into a space where looking at just the information measures on the syntax, like the amount of data transmitted in bytes or something over a digital connection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.44,
    "end": 4155.596,
    "text": " you've already highlighted the relevance of the semantic information flows which is um a topic that Chris Fields and others have started to look into and then there's a further uncoupling between the material basis of the information transfer and the semantic information flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.632,
    "end": 4160.694,
    "text": " I'll ask another question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.414,
    "end": 4172.982,
    "text": "So Upcycle Club wrote, are there any limitations or challenges associated with incorporating variational free energy models into mechanisms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.684,
    "end": 4177.165,
    "text": "Yes, very good questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4179.647,
    "end": 4185.952,
    "text": "I think we can look for the limitation related to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.483,
    "end": 4192.305,
    "text": " questions which scientist gives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.225,
    "end": 4207.25,
    "text": "It means that we can looking for a limitation concerning the methods and of course the more important limitation concerning the border of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.87,
    "end": 4209.591,
    "text": "And it is hard to give",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.592,
    "end": 4221.997,
    "text": " one good answer, because in the field of the new mechanical philosophy there is a big discussion about the border of the mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.917,
    "end": 4238.904,
    "text": "And if we take the constraint-based mechanism approach, the situation looks more complicated, because system traditions of decomposing mechanisms will claim that the border of the mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4239.716,
    "end": 4244.761,
    "text": " are related to the components of the mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.841,
    "end": 4260.615,
    "text": "When I say that the components of the mechanism, it means that something what we decompose is not enough because we have to also look into the elements which are not literally the part of the mechanism but which makes the mechanism active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.356,
    "end": 4263.958,
    "text": "It means that the border of the mechanism is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.175,
    "end": 4276.662,
    "text": " And I think the main limitation concerning my idea is to say when we have to stop to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.482,
    "end": 4292.552,
    "text": "For example, when we take an example of the pipe and the water moving in the pipe, this is the part of the mechanism, but the material from which the pipe is built",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.464,
    "end": 4313.374,
    "text": " the environmental constraints, which is not the part of the mechanism, but which is important, which is relevant for the functioning of mechanism, because the plastic pipe makes, for example, better working of the mechanism than the wooden pipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.034,
    "end": 4319.217,
    "text": "And I think the main limitation is related to the questions of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.515,
    "end": 4344.444,
    "text": " which constraints for example when we talk about the constraints as environmental cons environmental factors which of the constraints are how many constraints we need to to say that okay this is enough we we understand how this mechanism is corrective um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.604,
    "end": 4368.099,
    "text": " And I don't know for now where this border is, because opening the mechanism on the constraints, opening the mechanism on the information coming or processing it by the, for example, narrow mechanism, make these questions about the border mechanics more specific or more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4370.04,
    "end": 4377.346,
    "text": "But I think this is similar discussion or similar problem like we find in the field of the free energy principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.103,
    "end": 4386.025,
    "text": " when we talk about the border of the mark of blankets or when we talk about the mark of the cognitive or mark of the living organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.045,
    "end": 4400.588,
    "text": "I think that if we integrate mechanically the free energy principle with, for example, mechanical predictive processing, then this discussion about the border of mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.336,
    "end": 4425.069,
    "text": " can be a part of the discussion of the border of marco blanca's of the border of informational systems something like that thank you that's uh that's a huge point it made me think about having a physical object could be digital or analog",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.337,
    "end": 4453.754,
    "text": " that's going to implement some procedure or program that is going to be bound apparently by the halting problem like the inability to know for some kinds of systems how the program is going to turn out by the incompleteness type pattern so there's certain informational constraints that kind of come out of nowhere seemingly to constrain the action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.075,
    "end": 4478.246,
    "text": " or to provide some thing that limits the action or the knowability of the action so then you highlighted that it is actually this stopping time question or the halting question as a question of scientific strategy in building accounts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.426,
    "end": 4482.267,
    "text": " knowing how much to include.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.547,
    "end": 4492.309,
    "text": "And that's very related to identifying or selecting a system of interest, because you could say, well, the pipe comes from here, and so we're going to go back up the supply chain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.369,
    "end": 4508.172,
    "text": "And pretty soon, if you include the flow of air or the movement of digital information or something like that in the system, that can unfold to include untenable models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.228,
    "end": 4529.541,
    "text": " so then there's a core screening and all already um people make informational core screenings like with causal influence diagrams like just the the the relevance of one variable on another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.297,
    "end": 4559.721,
    "text": " so it's just very interesting that by having the material thermo mechanism and a legitimated role or status for informational mechanisms which are the natural kind of explanation for perhaps algorithms or information processing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.67,
    "end": 4585.649,
    "text": " still there's the the boundedness of what is being accounted for but a clearer way to know how far out informationally just like you could go out physically in the thermal account with layers of rooms outside of the heat bath also you could go out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.747,
    "end": 4616.007,
    "text": " informationally more into the past for example or you can just say we're just drawing a line around this so maybe yeah sorry sorry no i think that i think that the the the for maybe the best way is to um question about on the of the borders of the mechanism or borders of the system relativized to the our scientific interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.281,
    "end": 4630.125,
    "text": " For example, when we talk about the pipe, when we talk about the digital system, they are some kind of artefacts and they are related to the architecture who made them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.845,
    "end": 4643.588,
    "text": "When we talk about the brain, it is hard to think about the brain in the same or analogous sense when we talk about the pipe or the glass or the paper, because there are artefacts, we can say, but natural artefacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.648,
    "end": 4644.248,
    "text": "And I think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.418,
    "end": 4657.347,
    "text": " our thinking about the borders of the system we want to describe, maybe primary should be related to our questions concerning the borders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.028,
    "end": 4672.8,
    "text": "And maybe the story was that, that mechanists in the system tradition, the traditional viable mechanism will say something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.441,
    "end": 4680.324,
    "text": " we think about the brain as a mechanism like the other one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4681.785,
    "end": 4694.632,
    "text": "We can develop the structure of the social web, the structure of the brain, the structure of the bones, and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.193,
    "end": 4700.696,
    "text": "And this way of thinking about the brain as the kind of the mechanics like the other one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.232,
    "end": 4705.974,
    "text": " in some sense direct the investigation to brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.134,
    "end": 4720.439,
    "text": "And this is why, for example, decomposition as the whole strategy in new mechanical philosophy, many authors think about this as relevant and we don't need anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.3,
    "end": 4728.782,
    "text": "But when Bechtel, for example, claims that, okay, but there is a mistake because our brains",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.276,
    "end": 4733.618,
    "text": " are based on the web of active mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.758,
    "end": 4754.411,
    "text": "And those active mechanisms are more specific because what makes them active is not only what makes them a mechanism in traditional, normal sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.198,
    "end": 4764.641,
    "text": " And when we look into the paper of Bechtel, he doesn't develop the idea of talking about the whole brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.761,
    "end": 4773.523,
    "text": "They developed the investigation into the small pieces of how some kinds of cells transform molecules and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.583,
    "end": 4785.187,
    "text": "But they still claim that if we show the bound in two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4788.536,
    "end": 4800.661,
    "text": " too fast, then we don't explain correctly how the given mechanism, the given cells do actively what it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.361,
    "end": 4813.906,
    "text": "And I don't know, probably if I want to defend the idea of moderate realism about Bayesian modeling, I would like to say something like that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.813,
    "end": 4820.934,
    "text": " There are some kind of borders in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.255,
    "end": 4825.355,
    "text": "We try to look for those borders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4827.316,
    "end": 4843.8,
    "text": "Maybe the systems and the difference between different systems motivate us to try to describe these borders, but there is no possibility to say that de facto here there are borders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.18,
    "end": 4845.941,
    "text": "But always when we talk about the borders,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.083,
    "end": 4853.626,
    "text": " talking about the borders is related to our measurement tools and the methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.706,
    "end": 4876.018,
    "text": "So I think that the small move in mechanical philosophy, which I describe as the constraint-based mechanics approach, we can interpret it as an example of the situation when the phenomena motivate us to change our scientific practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.338,
    "end": 4894.031,
    "text": " Because Bechtel, 20 or 30 years, developed the new mechanical philosophy, but in the last five or six years, he claims, okay, but this old view was not perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.251,
    "end": 4895.312,
    "text": "We have to change something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.392,
    "end": 4900.976,
    "text": "And I think this is the argument for the moderate interpretation of the scientific practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.777,
    "end": 4906.14,
    "text": "Phenomena, in some sense, because we developed a good method to investigate phenomena,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.547,
    "end": 4920.052,
    "text": " phenomena in some sense motivate us to change, to develop the new methods, change our scientific heuristic and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.393,
    "end": 4924.854,
    "text": "Wow, that's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4925.994,
    "end": 4929.496,
    "text": "One other thing that made me think about was the differences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4930.979,
    "end": 4951.766,
    "text": " the relevance or the difference between the thermodynamic and the informational accounts become very clear when studying decentralized systems that are spatially disaggregated because when there's something that's physically enclosed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.958,
    "end": 4979.478,
    "text": " and it has like a unitary physical component and a unitary informational component like a desktop computer or a single tissue then there is an undeniable overlap between those two systems which kind of host and relate to each other but then when there's a system that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.38,
    "end": 5005.306,
    "text": " has other things amidst it then just thinking here about nest mates and the ant colony well then spatial enclosure and just inclusion of all the material components seems to clearly capture too much and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.89,
    "end": 5031.589,
    "text": " that seems to suggest a more informational role which takes on many rich areas from semiotics and all these other semantic questions not just again a reduction of the informational to the syntactic informational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.328,
    "end": 5060.883,
    "text": " like how much um energy or material was transferred because again that will just conflate that'll make me it's it's um it's a approach that won't lead to the best research agenda on mechanistic accounts interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5065.512,
    "end": 5072.356,
    "text": " So I think that the question about semantic information is really important here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.057,
    "end": 5086.325,
    "text": "But if we take Bayesian ideas about the brain which inferred information coming from the environment, this information is something more than the syntactic relation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.345,
    "end": 5087.286,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.228,
    "end": 5117.494,
    "text": " I think what is important here is what Tristan's really important claims, that I think that information changes everything, in that sense that when you try to literally think about Bayesian approximation and so on, then it means that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5118.573,
    "end": 5124.795,
    "text": " everything we want to describe and explain as scientists is strictly related to the information we receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5125.496,
    "end": 5147.224,
    "text": "Of course, this is very simple, but every object we observe, every object we want to describe is always related to the information we have about this object, and it means that there is no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.86,
    "end": 5151.581,
    "text": " something like we've got a naked fact, naked state of affairs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.022,
    "end": 5174.288,
    "text": "Maybe ontologically there are, but from the point of view of the finite entities like us, every time when we receive some information, every time when we observe something and we try to develop a model of some kind of phenomena, it's always related to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.751,
    "end": 5178.592,
    "text": " some kind of information what we have about this phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.672,
    "end": 5187.697,
    "text": "And I try to say something very metaphysical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.7,
    "end": 5201.563,
    "text": "I think that the variational point of the view",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.102,
    "end": 5203.443,
    "text": " as we can say, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.004,
    "end": 5229.266,
    "text": "The Bayesian point of view shows us that there is no distinct border between the object we try to map, between the language we try to use to map this object, because I think there is something that Maxwell Ramstad has right when they claim that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.747,
    "end": 5241.432,
    "text": " which still we try to describe the objects who behave like the... We try to describe the territory which behaves like a map, which describes this territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5242.692,
    "end": 5245.033,
    "text": "And of course, this is not only the metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.053,
    "end": 5257.638,
    "text": "I think that everything what scientists try to do is to reconfigure, is to identify",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.604,
    "end": 5270.271,
    "text": " the structures which are extended now to the structure of thinking, structure of information which we use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.291,
    "end": 5272.132,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5278.095,
    "end": 5286.04,
    "text": "I think that Bayesian view about human brains, about the world,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.107,
    "end": 5299.956,
    "text": " lead us to the one very important question about the informational nature of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5301.617,
    "end": 5310.403,
    "text": "I don't know, because I speak right now, but when we think, when we take seriously",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.971,
    "end": 5340.185,
    "text": " this kind of thinking about the science about about the entities the most basic the most fundamental future of the world is not a mass it's not a temperature it's not an energy but an information and i think the information is something could change a difference and literally it means that if we want to develop a science we cannot ignore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.731,
    "end": 5346.335,
    "text": " this very basic, fundamental features of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.076,
    "end": 5347.256,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.316,
    "end": 5358.704,
    "text": "Because the information, of course, I don't want to say it's something like panpsychism, or something like that, but I will say that information is always for someone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5359.765,
    "end": 5364.448,
    "text": "And I would like to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.166,
    "end": 5381.769,
    "text": " When I was reading the papers of Ristam and so on, I still think about why we should or why we shouldn't ignore the information in our investigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.829,
    "end": 5395.632,
    "text": "And I think that Bayesian modelling gives us a good tool, maybe it's a plea for the place of information in the science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5398.072,
    "end": 5423.393,
    "text": " because but not only literally talking about information okay we know it's it's obvious that brains process information but information as an entity which making possible many many of the phenomena and i think that our brains in short we say our brains are the entities which are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.475,
    "end": 5432.182,
    "text": " which are possible because there are information which makes this kind of mechanism, but not the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.763,
    "end": 5443.793,
    "text": "Sorry, I think this is really speculative, metaphysical, but it's hard to catch this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5448.274,
    "end": 5472.048,
    "text": " yeah there's there's a lot there um certainly the unity of the scientific and the broader informational endeavor is very interesting and so thinking about that explicitly in terms of epistemic foraging seeking out which measurements or observations to accrue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.489,
    "end": 5497.956,
    "text": " and that being kind of on a continuum of agency of experimental selection and there's other like a fixed camera does not have control over the sensory observations it's making it could have internal cognitive control but but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5499.204,
    "end": 5528.314,
    "text": " having a unified way to talk about what it is that science or just different ways of knowing even outside of what we might call professional science today that those different manifestations are are part of a ecosystem of shared intelligence part of a shared fabric with other information processing as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5529.912,
    "end": 5534.097,
    "text": " chemical elements are in circulation in a chemical ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5536.219,
    "end": 5546.071,
    "text": "What is the status of the semantic informational connections in semantic ecosystems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5547.694,
    "end": 5553.057,
    "text": " And people could have viewpoints like, well, there are no semantic ecosystems, there's just syntactic ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.937,
    "end": 5556.058,
    "text": "And there's no syntactic ones, there's just material ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.078,
    "end": 5560.84,
    "text": "I mean, people can always go that reductionist path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.642,
    "end": 5576.728,
    "text": "But to the point where any given person says, okay, I've kind of bottomed out on reductionism here, or I'm looking for another perspective, there is going to be the question of what the semantic account is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.2,
    "end": 5601.887,
    "text": " and what its status is and does it articulate with the thermodynamic account do they have a a zone of indistinguishability do they have um a broadly overlapping region maybe it could be one way in one system in a different way in a different system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.322,
    "end": 5620.625,
    "text": " But these will constitute some of the fundamental philosophy questions that you identified in terms of real mechanistic accounts for intelligent systems and using active inference to develop any kind of account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.626,
    "end": 5629.387,
    "text": "I think we cannot ignore the semantic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5632.765,
    "end": 5650.677,
    "text": " Maybe one of the most important things that Friston says is that semantic is important in that sense that it is not only the medium which we use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.837,
    "end": 5662.204,
    "text": "For example, if I correctly understand the origins of the Fristonian free energy principle, it comes from the method of measurement of the brain activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5664.036,
    "end": 5669.56,
    "text": " And someone can say, okay, this is only the method and there is no any implication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5670.561,
    "end": 5675.405,
    "text": "Of course, but I think that Freestone will say something more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.465,
    "end": 5684.692,
    "text": "It says that there are phenomena in which semantics play an important role, but we cannot ignore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.722,
    "end": 5700.045,
    "text": " the semantic dimension in our practice of science building or model building.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.125,
    "end": 5706.047,
    "text": "It means that semantic is not something like the piece of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.087,
    "end": 5717.571,
    "text": "I can use the piece of the paper when I wrote a paper, or I can use a word or office and something like that, and it's not important what material I use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.14,
    "end": 5725.605,
    "text": " I think that many authors or maybe many papers think about the semantic as some kind of the medium like the kind of the paper I use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.786,
    "end": 5745.678,
    "text": "I think that the free energy relative inference framework shows us that the information or semantic is something what makes possible, for example, to do a science or maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.074,
    "end": 5754.056,
    "text": " The information semantics is something what makes possible for us a human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.956,
    "end": 5759.397,
    "text": "And maybe like a thermodynamic free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5760.077,
    "end": 5765.018,
    "text": "If we don't transform the molecules from the environment, we don't live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.058,
    "end": 5775.961,
    "text": "But the question is why science talk many things about the thermodynamic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5776.755,
    "end": 5804.857,
    "text": " processes and talk enough not enough about the informational processes i think that the bayesian smothering freestone approach lead us to the conclusion that there are systems for which the transfer of information is a same important like to transform process the thermodynamic energy in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5805.6,
    "end": 5821.531,
    "text": " The argument which I tried to develop from the neural computation shows us that always there is a trade-off, there is a relation between information processing and thermodynamic work cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5822.191,
    "end": 5827.875,
    "text": "If there is some kind of trade-off, why we don't take and use it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5828.536,
    "end": 5835.04,
    "text": "But probably, as I said, information is something what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.552,
    "end": 5842.454,
    "text": " is hard to be measured, like temperature, like mass, and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.614,
    "end": 5850.356,
    "text": "And I believe that version principles give us a chance to try to develop this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5850.936,
    "end": 5864.38,
    "text": "Of course, remembering about this, that those principles lead us to the tools which are only the more or minor the approximation of the real",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5865.037,
    "end": 5885.244,
    "text": " real phenomena um okay well wow do you have any closing thoughts or where is your research in this area going to go uh i think that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5887.273,
    "end": 5900.425,
    "text": " I wrote a grant proposal about this idea, and a few days ago I received a reject in the Polish center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5900.545,
    "end": 5914.477,
    "text": "And the only reason why they rejected my proposal is that I don't propose using or applying this idea into the real modeling framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5915.435,
    "end": 5919.616,
    "text": " So the next steps, and I think I agree, because this is very speculative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.476,
    "end": 5928.899,
    "text": "I propose some kind of heuristics, and I believe that this heuristic can be applied in a real model building strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.019,
    "end": 5944.763,
    "text": "And the next step now I'm thinking is that to mid-person or to make a competence concerning that and finding the way to how to taste",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5945.455,
    "end": 5948.056,
    "text": " this idea in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5950.936,
    "end": 5954.237,
    "text": "And still, there are two options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.897,
    "end": 5968.0,
    "text": "The first one is that, okay, this is the speculative idea and we don't need to think about the mechanism in terms of information constraints and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.76,
    "end": 5972.221,
    "text": "And the second is that, okay, this is a correct idea, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5973.129,
    "end": 5987.179,
    "text": " But maybe variational principle, Bayesian modeling is useless here because everything what we need is coming from the thermodynamic of information or the classical theory of information and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5987.88,
    "end": 5991.202,
    "text": "So I think there are many open doors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5993.144,
    "end": 5998.848,
    "text": "I hope I will take away to find some of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.489,
    "end": 6002.909,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6003.53,
    "end": 6007.072,
    "text": "Well, it was a great presentation and discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6007.292,
    "end": 6012.735,
    "text": "You're welcome back anytime to share what that next step looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.795,
    "end": 6014.816,
    "text": "I really appreciate this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6015.056,
    "end": 6031.285,
    "text": "I think it certainly is a great benefit to the literature to connect the kinds of things that people want to say and do to now how we are saying and doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.229,
    "end": 6035.25,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6035.27,
    "end": 6035.811,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6035.831,
    "end": 6037.532,
    "text": "Thanks for questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6039.134,
    "end": 6040.916,
    "text": "That was a very nice experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6040.936,
    "end": 6041.797,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6042.277,
    "end": 6042.638,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.798,
    "end": 6043.038,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6043.198,
    "end": 6043.759,
    "text": "Till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6044.74,
    "end": 6045.06,
    "text": "Good night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6045.16,
    "end": 6045.36,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6045.841,
    "end": 6045.981,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]