[
  {
    "start": 6.072,
    "end": 9.094,
    "text": " Hello and welcome everyone to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.734,
    "end": 15.477,
    "text": "This is session one of the course Physics as Information Processing with Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.338,
    "end": 23.862,
    "text": "First we'll have Ander Aguirre and Chris Fields introduce themselves and then we'll carry on with the first lecture here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.482,
    "end": 33.988,
    "text": "Check out the video description for a link to the course overview website where you can ask questions that will be answered asynchronously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.648,
    "end": 43.952,
    "text": " register to participate in the discussions, which happen about two weeks after each of the six lecture sessions, and just learn more about this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.313,
    "end": 50.856,
    "text": "So thank you both so much for joining into this adventure we are starting now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.536,
    "end": 57.039,
    "text": "And first, please, André Guiré, introduce yourself, and then Chris, introduction and lecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.259,
    "end": 57.539,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.007,
    "end": 83.534,
    "text": " hello so i'll be the course assistant and um so i'm a post-optimist specialized in improbability and um i have a deep interest in the physics of information and i've been uh familiar with chris's papers for a while and so yeah just here to learn myself uh thank you andrew and thank you daniel um i'm chris fields",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.359,
    "end": 92.004,
    "text": " And I'll be presenting this course in six sessions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.505,
    "end": 98.95,
    "text": "And Andrew will be organizing discussion sessions after each of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.991,
    "end": 103.334,
    "text": "And all of this is explained on the course website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.916,
    "end": 106.077,
    "text": "So let's start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.359,
    "end": 126.358,
    "text": " This is a course on physics as information processing, and this first session will be a historical perspective on the idea that physics is or is about information processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.62,
    "end": 143.007,
    "text": " And I'll just start with a few quotations that span the middle of the 20th century from Wittgenstein in 1920 saying, the world is all that is the case, so defining the world in terms of facts, not objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.648,
    "end": 149.01,
    "text": "Landauer in the early 60s proclaiming that information is physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.76,
    "end": 161.866,
    "text": " And then John Archibald Wheeler, who in many ways is the grandfather of this era recently, stating it is it from bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.306,
    "end": 166.728,
    "text": "So things come from information, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.768,
    "end": 167.308,
    "text": "bit strings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.169,
    "end": 176.813,
    "text": "And if nothing else, this shows that formulations of this idea get pithier as the 20th century rolls on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.72,
    "end": 185.026,
    "text": " But the history goes back further, clearly, than the 20th century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.926,
    "end": 189.65,
    "text": "But I'm only going to really talk about a piece of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.371,
    "end": 195.115,
    "text": "And the timeline that I'll actually discuss",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.987,
    "end": 202.736,
    "text": " Today, the most relevant history of this idea goes back to the mid-19th century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.756,
    "end": 211.267,
    "text": "And the first specific thing I'll talk about is Clausius' definition of entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.069,
    "end": 230.435,
    "text": " But with the beginning of the understanding of thermodynamics and the role of information in thermodynamics, you get this very interesting multidisciplinary progression of ideas that incorporates the beginning of quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.216,
    "end": 239.758,
    "text": "And the beginning of quantum theory can kind of be dated to the first Solvay conference in 1928.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.499,
    "end": 252.666,
    "text": " the famous debate between Bohr and Einstein over whether quantum theory is about knowledge, information, or objects, things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.867,
    "end": 260.931,
    "text": "But it incorporates a lot of work in computer science and logic and mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.411,
    "end": 270.477,
    "text": "So interestingly, computer science was born effectively in the mid-30s with the work of Church and Turing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.308,
    "end": 274.811,
    "text": " which very rapidly converged with the work in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.351,
    "end": 279.154,
    "text": "So today we'll be talking about both computer science and physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.136,
    "end": 286.8,
    "text": "And then in the second half of the 20th century, this just exploded into a huge area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.361,
    "end": 298.289,
    "text": "And in consequence of that mid 20th century development, we're beginning to see a new idea about physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.346,
    "end": 302.588,
    "text": " which is roughly encapsulated in quantum information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.628,
    "end": 305.029,
    "text": "And the new idea is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.95,
    "end": 312.734,
    "text": "It's that what physics is actually about is information transfer across boundaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.935,
    "end": 323.04,
    "text": "And the information, we can represent the information transfer like this, and this is a convention I'll use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.28,
    "end": 326.442,
    "text": "A boundary is always a blue ellipse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.334,
    "end": 349.607,
    "text": " And the agents that are exchanging information across this boundary are conventionally called Alice and Bob, which is just a more polite way of saying A and B. And when you think about this picture, it becomes clear that what physics is really about is communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.237,
    "end": 365.281,
    "text": " And this is a wild re-description of the idea of what physics is compared to the ideas of Newton or Laplace or even the 19th century ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.501,
    "end": 378.725,
    "text": "And it's very different from the idea that's been preserved in 20th century physics in the lineage of Einstein.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.738,
    "end": 393.409,
    "text": " and others who viewed classical physics as, in a sense, a fundamental, either as completely fundamental or as a fundamental adjunct to quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.75,
    "end": 402.677,
    "text": "So this way of thinking about physics is a very deeply quantum theoretic way of thinking about physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.058,
    "end": 408.261,
    "text": "And where we're going in this course today is really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.386,
    "end": 411.787,
    "text": " of how did this all happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.847,
    "end": 413.227,
    "text": "It's the origin story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.947,
    "end": 435.212,
    "text": "And then in the next session, I want to discuss quantum information theory explicitly, and in particular, how quantum theory makes this conclusion that physics is about communication very simple and obvious, much more obvious than it is in classical physics, where it takes work to formulate this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.85,
    "end": 450.577,
    "text": " Then in the next session, we're going to talk about semantics and how observations become meaningful to the agents who make them, and hence how actions become meaningful to the agents who make them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.432,
    "end": 465.48,
    "text": " Then in August, we'll talk about communication theory a little bit more explicitly and talk about how agents employ multiple communication channels when they're communicating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.681,
    "end": 471.183,
    "text": "And this is obvious when you think of people communicating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.223,
    "end": 475.966,
    "text": "They not only talk to each other, they look at the same things, they point to things, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.026,
    "end": 479.328,
    "text": "So this is what I mean by multiple communication channels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.629,
    "end": 489.233,
    "text": " Then in September, we'll leverage that discussion to talk about how spacetime actually emerges from communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.353,
    "end": 493.534,
    "text": "And this is one of the most important aspects, I think, of quantum information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.175,
    "end": 504.459,
    "text": "It provides us with a way of viewing spacetime as an emergent phenomenon, that communication is what is fundamental in some ontological sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.639,
    "end": 509.621,
    "text": "And the box in which it happens, spacetime, is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.334,
    "end": 523.178,
    "text": " So the final session in October, we'll talk about applications to biology via the free energy principle and future directions, both in physics and biology and elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.419,
    "end": 526.08,
    "text": "So it's going to be an interesting ride.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.56,
    "end": 540.785,
    "text": "I'm keeping formalism to a minimum because we're directing this toward the broad array of people who are interested in active inference and who are involved with the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.151,
    "end": 562.232,
    "text": " and i would ask you to hold questions because we have a lot to get through in an hour for the interactive discussion and for the discussion forum so i hope i explained things well enough that all of the concepts will be understandable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.666,
    "end": 570.611,
    "text": " If not, Wikipedia is actually a wonderful resource in this area for just definitions of terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.472,
    "end": 577.876,
    "text": "So if there's anything that just a term that is a trip up, try Wikipedia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.896,
    "end": 580.518,
    "text": "It's probably a very good source for what these terms mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.438,
    "end": 582.339,
    "text": "So let's start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.22,
    "end": 586.562,
    "text": "Our story, as I said, begins in the 19th century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.582,
    "end": 588.543,
    "text": "And in the mid-19th century,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.856,
    "end": 595.64,
    "text": " lots of physicists were devoting their efforts to figuring out how to make better steam engines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.202,
    "end": 611.293,
    "text": "And one question that arises when you're trying to design a steam engine is what happens physically when you add heat to a system at constant temperature?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.393,
    "end": 614.976,
    "text": "So if you're building a steam engine, you've got a boiler because you need to make steam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.997,
    "end": 618.239,
    "text": "And as you turn up the heat to your boiler,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.082,
    "end": 622.005,
    "text": " you get more steam, but the temperature doesn't change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.625,
    "end": 623.806,
    "text": "So this is a mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.248,
    "end": 634.376,
    "text": "What is the heat actually adding to the boiler that is not increasing the temperature?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.073,
    "end": 644.178,
    "text": " And Clausius responded to this question in a way that's sort of typical for a physicist or a mathematician.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.618,
    "end": 652.162,
    "text": "Since he didn't know what the answer was, he just invented a new name for whatever it was and gave it a formal definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.902,
    "end": 664.789,
    "text": "So he called it entropy, which is a made-up word that, if it was translated from the Greek, would roughly mean transformation content in tropy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.537,
    "end": 691.065,
    "text": " And he represented it by a simple equation that the change in this new concept, entropy, which is always called S, is just equal to the change in heat, Q, at constant temperature, T. So obviously this equation just reformulates the question in declarative form, saying whatever this stuff is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.333,
    "end": 699.88,
    "text": " Its changes in this stuff are just changes in heat at constant temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.041,
    "end": 706.748,
    "text": "Well, heat is energy, and this wasn't completely recognized in the mid-19th century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.878,
    "end": 715.66,
    "text": " But the way you'll see this equation in a current textbook is ds is the energy, change in energy at constant temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.5,
    "end": 723.641,
    "text": "So even more commonly, you would see it written as the change in energy is equal to the temperature times the change in entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.702,
    "end": 728.503,
    "text": "It's the most common textbook way of seeing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.263,
    "end": 731.943,
    "text": "But the question, of course, is what is this quantity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.043,
    "end": 733.284,
    "text": "What is this entropy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.724,
    "end": 735.044,
    "text": "What does this concept mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.727,
    "end": 752.981,
    "text": " And about 15 years after Clausius proposed it, Altman had the key insight, which is that entropy is a measurement of our uncertainty about the state the system is in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.762,
    "end": 761.949,
    "text": "And in particular, he again, of course, went to formalism and said the entropy, S, is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.146,
    "end": 773.474,
    "text": " is equal to some constant times the number of states that the system can be in that look the same to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.095,
    "end": 782.441,
    "text": "And since that number of states is enormous, the way to make that manageable is to take the log of the number of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.822,
    "end": 785.003,
    "text": "The natural log is ln.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.344,
    "end": 789.847,
    "text": "And this constant k is called Boltzmann's constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.51,
    "end": 811.083,
    "text": " Boltzmann was able to do this because he subscribed to a radical, very unpopular theory that material things, including gases like air, were made of atoms, and heat made the atoms move around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.077,
    "end": 816.36,
    "text": " And as you increase the amount of heat, the atoms can move in many different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.041,
    "end": 821.805,
    "text": "So the number of states that they can be in that look the same to us increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.625,
    "end": 823.866,
    "text": "And that's what entropy is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.966,
    "end": 832.633,
    "text": "It's this increase in the number of states that the system can be in that all look the same to us with the measurements that we can make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.773,
    "end": 837.357,
    "text": "And since they look the same to us, we're uncertain about exactly what state they're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.539,
    "end": 841.5,
    "text": " So entropy is a measure of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.321,
    "end": 854.747,
    "text": "This was really the beginning of modern physics, because what it says now is that decreasing uncertainty requires energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.367,
    "end": 859.209,
    "text": "It links a measurement of uncertainty to a measurement of energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.834,
    "end": 871.096,
    "text": " And if you think about the uncertainty principle in quantum theory, the core idea of the uncertainty principle is you can't measure a system without disturbing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.416,
    "end": 880.458,
    "text": "So to actually act on a system requires energy, and that's what you have to do to get information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.578,
    "end": 885.299,
    "text": "So here's Boltzmann basically inventing quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.737,
    "end": 891.803,
    "text": " So we're going to fast forward by another 15 years to 1900.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.843,
    "end": 903.159,
    "text": "And in 1900, Planck solved this problem called the blackbody radiation problem, which was basically how much heat does your hot boiler give off into the air?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.858,
    "end": 919.877,
    "text": " And all of the measurements of the heat that hot boilers gave off to the air ran into problems in classical physics and caused contradictions and quantities that went to infinity and all of that was bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.718,
    "end": 926.879,
    "text": " So many people were trying to solve this problem, and Planck solved it by making a simple postulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.299,
    "end": 935.221,
    "text": "He said the energy of the radiation is proportional to its frequency, so its color, in the case of light.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.301,
    "end": 942.142,
    "text": "And if you go higher frequency, you end up in ultraviolet and X-rays and gamma rays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.282,
    "end": 946.283,
    "text": "If you go to lower frequency, you go into microwaves and radio and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.883,
    "end": 950.925,
    "text": " So this is a nice way of talking about radiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.585,
    "end": 953.246,
    "text": "And it turned out that this solved the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.506,
    "end": 963.21,
    "text": "I mean, just assuming this simple proportionality relationship produced spectra for blackbody radiation that worked, that matched what you saw experimentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.514,
    "end": 966.094,
    "text": " Well, this means something very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.114,
    "end": 983.88,
    "text": "It means because this number H, the proportionality constant called Planck's constant, is a number, it's finite, it means that energy comes in discrete units of H. You can have one H or two H or 10 million H, but you can't have half an H of energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.201,
    "end": 987.041,
    "text": "So it's quantized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.721,
    "end": 990.742,
    "text": "And this is widely recognized as the birth of quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.022,
    "end": 997.924,
    "text": " But of course, we should have known this already if we just thought a little bit, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.024,
    "end": 1006.767,
    "text": "We know that changes of energy are proportional to changes in entropy by temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.927,
    "end": 1012.749,
    "text": "And we know that entropy is a measure of the number of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.789,
    "end": 1015.909,
    "text": "And numbers of states are just numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.99,
    "end": 1020.571,
    "text": "You can have one state, two states, three states, 10 million states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.443,
    "end": 1029.325,
    "text": " 100 billion states, but they're all just a number, one up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.525,
    "end": 1030.426,
    "text": "And it's not infinite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.546,
    "end": 1034.967,
    "text": "There's not an infinite number of states unless you have an infinite amount of energy, which we don't have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.227,
    "end": 1040.489,
    "text": "So we knew already that entropy could only take discrete values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.669,
    "end": 1047.991,
    "text": "And since energy and entropy are basically the same thing, we knew already that energy could only take discrete values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.306,
    "end": 1056.812,
    "text": " So we could have realized in 1900 that energy is quantized because the number of states is quantized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.634,
    "end": 1063.678,
    "text": "So it shouldn't have really been a mystery why energy was quantized, but it was a mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.458,
    "end": 1065.539,
    "text": "And it stayed a mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.619,
    "end": 1067.401,
    "text": "I mean, it's still a mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.441,
    "end": 1069.803,
    "text": "People still debate the meaning of quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.365,
    "end": 1075.207,
    "text": "But another thing we could have known in 1900 was something very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.294,
    "end": 1091.437,
    "text": " And it's that this quantum of action, Planck's constant, which has units of action, which is energy times time, is intimately related to Boltzmann's constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.798,
    "end": 1099.599,
    "text": "And Boltzmann's constant has units of energy over temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.16,
    "end": 1104.401,
    "text": "But this wasn't actually understood until the 1950s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.043,
    "end": 1109.124,
    "text": " No one really figured this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.144,
    "end": 1111.566,
    "text": "There was this relation until the 1950s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.727,
    "end": 1116.891,
    "text": "And when it was figured out, it was figured out by a guy named Giancarlo Wick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.032,
    "end": 1125.559,
    "text": "And he introduced this notion of the Wick rotation by realizing that if you have an equation in classical physics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.864,
    "end": 1129.806,
    "text": " And in it, there's the term 1 over kt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1131.046,
    "end": 1137.13,
    "text": "You can always replace that 1 over kt with this other expression, it over h-bar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.45,
    "end": 1139.471,
    "text": "h-bar is just h divided by 2 pi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.372,
    "end": 1142.753,
    "text": "And you'll get an equation that's valid in quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.214,
    "end": 1147.316,
    "text": "And this is typically described in textbooks as a trick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.656,
    "end": 1154.72,
    "text": "And whenever something in physics is described as a trick, what that really means is it's something we don't understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.943,
    "end": 1160.645,
    "text": " And lots of papers have been written about the meaning of the wick rotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.127,
    "end": 1169.61,
    "text": "But to start to understand the wick rotation, I want to look at this equation a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.63,
    "end": 1175.693,
    "text": "1 over kT is 1 over an energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.785,
    "end": 1186.548,
    "text": " And IT over H-bar is 1 over an energy, since H-bar is units of energy times time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.129,
    "end": 1189.809,
    "text": "We have time in this equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.29,
    "end": 1197.012,
    "text": "And then we have this factor I, which is typically thought of as just an imaginary number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.612,
    "end": 1199.193,
    "text": "So it's the square root of minus 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.859,
    "end": 1203.24,
    "text": " And what's this I doing in this equation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.601,
    "end": 1211.205,
    "text": "And in fact, you see factors of IT over H bar, if you're familiar with quantum theory, everywhere in quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.085,
    "end": 1215.747,
    "text": "So what's the meaning of this imaginary number?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.488,
    "end": 1227.294,
    "text": "And if you just think of IT or of I as this arbitrary imaginary number that somehow renders the equation mysterious,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.277,
    "end": 1234.302,
    "text": " then the whole of quantum theory is mysterious, but the wick rotation is very mysterious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.463,
    "end": 1238.686,
    "text": "But what I is actually is an operator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.327,
    "end": 1247.973,
    "text": "And if you think of the real numbers as an axis, which is always drawn horizontally, so here it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.373,
    "end": 1252.497,
    "text": "Here's zero, and the axis is pointing that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.557,
    "end": 1255.719,
    "text": "I'm sorry, I can't get the camera really far enough away to see my arm here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.67,
    "end": 1257.931,
    "text": " So what is I?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.411,
    "end": 1264.774,
    "text": "I is actually an operator that rotates the whole real axis by 90 degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.955,
    "end": 1272.919,
    "text": "So if you see a plot of complex numbers, then the real numbers go this way and the, quote, imaginary numbers go that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.979,
    "end": 1277.181,
    "text": "So what multiplying by I has done is rotate by 90 degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.122,
    "end": 1281.724,
    "text": "And of course, if you do I squared, you rotate twice by 90 degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.804,
    "end": 1283.925,
    "text": "My arm won't do this, but you end up pointing that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.765,
    "end": 1286.006,
    "text": "And those are the negative numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.139,
    "end": 1291.901,
    "text": " So I is an operator that rotates something by 90 degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.581,
    "end": 1297.003,
    "text": "And if you rotate four times by 90 degrees, you're back to the identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.744,
    "end": 1299.464,
    "text": "So I to the fourth is one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.185,
    "end": 1308.689,
    "text": "So this tells us something very interesting, which is that what the wick rotation is really talking about is a rotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.069,
    "end": 1311.93,
    "text": "It's a geometrical equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1313.599,
    "end": 1322.244,
    "text": " And in July, we'll come back to this and really probe what this wick rotation means physically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.166,
    "end": 1329.189,
    "text": "But as I said, this wasn't understood until the 1950s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.449,
    "end": 1332.45,
    "text": "And by the 1950s, a lot had happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.291,
    "end": 1334.892,
    "text": "So quantum theory had been developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.092,
    "end": 1336.853,
    "text": "Bohr and Einstein had had their debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.053,
    "end": 1338.854,
    "text": "Particle accelerators had been built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.894,
    "end": 1340.375,
    "text": "The atomic bomb had been built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.856,
    "end": 1342.757,
    "text": "Nuclear physics was well in its way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.549,
    "end": 1349.591,
    "text": " So an enormous amount of practical physics had been done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.011,
    "end": 1351.952,
    "text": "Quantum theory was highly developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.992,
    "end": 1359.875,
    "text": "People were starting to think about quantum field theory before they made this simple realization that's formulated in the wick rotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.896,
    "end": 1362.957,
    "text": "So this is a harbinger of things to come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.877,
    "end": 1371.72,
    "text": "But before we continue in physics, we need to backtrack in time a little bit and look at what the mathematicians were doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.407,
    "end": 1384.594,
    "text": " So across the hall in the math department, one year after the Solvay Conference in 1929, Kurt Gödel proved his famous first incompleteness theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.635,
    "end": 1391.138,
    "text": "And the theorem states that no formal system that contains arithmetic can be both consistent and complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.899,
    "end": 1399.243,
    "text": "And that means that either there are true statements that aren't provable in the formal system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.57,
    "end": 1405.513,
    "text": " or there are false statements that are provable, or, of course, both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.114,
    "end": 1411.837,
    "text": "And Gödel's proof is actually extremely simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.017,
    "end": 1427.627,
    "text": "Almost all of the work in the proof is setting up all of the notation and procedures and so forth to formulate within arithmetic the sentence, this sentence is not provable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.281,
    "end": 1436.707,
    "text": " And once you have that sentence formulated within arithmetic, then the conclusion of the proof is obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.528,
    "end": 1443.373,
    "text": "If you can prove the sentence, this sentence is not provable, then you've proved something that's false.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.534,
    "end": 1450.158,
    "text": "And if you can't prove it, then there are sentences that you can't prove in arithmetic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.119,
    "end": 1453.861,
    "text": "So this was incredibly bad news for mathematicians.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.875,
    "end": 1464.279,
    "text": " who thought that finite discrete operations, which is what proofs are and also what computations are, can exhaustively enumerate the facts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.739,
    "end": 1471.422,
    "text": "And this was the assumption behind Wittgenstein's claim that the world is all that is the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.502,
    "end": 1473.143,
    "text": "The world is a collection of facts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.203,
    "end": 1480.306,
    "text": "And optimistically, he thought that first-order logic would allow us to enumerate all those facts and we'd be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.486,
    "end": 1483.327,
    "text": "Dreams of a final theory again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.248,
    "end": 1496.341,
    "text": " So, Gödel's theorem means that no system with finite capabilities, no system that can just do finite discrete operations, can fully describe its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.402,
    "end": 1503.43,
    "text": "It will always be in an environment where there are true things that aren't provable or false things that are provable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.134,
    "end": 1511.878,
    "text": " But I think more relevant to a discussion of agents is that it means that no agent can describe itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.179,
    "end": 1528.348,
    "text": "Any agent's theory of itself will either contain true statements that it can't derive, or false statements, or it will either miss true statements that it can't derive, or it will end up deriving things that are false about itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.629,
    "end": 1531.93,
    "text": "Of course, we see this in psychology all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.655,
    "end": 1543.942,
    "text": " So an immediate consequence of Gödel's theorem was an intense investigation of what computation actually is, what it meant to talk about finite discrete operations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.183,
    "end": 1548.885,
    "text": "And two leaders of this were, of course, Church and Turing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.945,
    "end": 1560.093,
    "text": "And here's a picture of a Turing machine, which is just a little device with a couple of tapes and a tape reader and a simple logic unit that either writes a one or a zero if it sees a one or a zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.736,
    "end": 1577.087,
    "text": " And they defined a computation as a process that can be implemented in finite time by such a machine, or by Church's lambda calculus, or by any of the now hundreds of other methods that are provably equivalent to a Turing machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.308,
    "end": 1579.488,
    "text": "So what does this mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.529,
    "end": 1588.815,
    "text": "It means that computation is a physical process that can be mechanized, and it turns out mechanized in any one of a huge array of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.276,
    "end": 1594.94,
    "text": " It means that many different implementations of any computation are possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.04,
    "end": 1600.125,
    "text": "So I can do it on a turning machine, I can do it on my laptop, I can do it in my head, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.566,
    "end": 1605.369,
    "text": "The most important things it means is that there are questions with no computable answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.75,
    "end": 1607.691,
    "text": "This is the revenge of Gödel's theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.872,
    "end": 1614.617,
    "text": "And two of the most famous questions of this kind are, given some arbitrary program, will it halt?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.698,
    "end": 1617.22,
    "text": "Will it get to an answer in finite time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.038,
    "end": 1622.08,
    "text": " And the answer to that question is, this is undecidable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.941,
    "end": 1624.822,
    "text": "No procedure can figure this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.563,
    "end": 1634.207,
    "text": "And the other undecidable question is, given some arbitrary program, what function does it compute?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.407,
    "end": 1640.37,
    "text": "And you'd think that would be simple, that you can read a program and figure out what function it computes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.13,
    "end": 1643.192,
    "text": "But it turns out that is undecidable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.792,
    "end": 1647.474,
    "text": "That cannot be done by any finite process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.474,
    "end": 1659.619,
    "text": " So this was another body blow to the goal of understanding everything with finite discrete processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.579,
    "end": 1663.08,
    "text": "But it also set the stage for something new.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.1,
    "end": 1676.086,
    "text": "It set the stage for thinking about an agent who interacts with a computational process by giving it an input and then looking at its output some time later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.374,
    "end": 1686.241,
    "text": " And this, of course, will look familiar because I've included the blue ellipse, which is the boundary, which these days we call a user interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.862,
    "end": 1697.39,
    "text": "And the user interface just allows some finite action on the system and then the ability to observe some finite response by the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.447,
    "end": 1713.424,
    "text": " So we can now ask, what can Alice determine by acting in some finite way and then making some finite number of observations, i.e., receiving some finite number of outputs from the system that she's acting on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.118,
    "end": 1722.001,
    "text": " And the first 20 years of this produced a large number of answers, all of them negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.681,
    "end": 1730.645,
    "text": "So to go back to Turing, he proved that Alice can't tell what's implementing the function that she sees being implemented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.126,
    "end": 1736.948,
    "text": "She can't tell whether a given input will lead to an output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.108,
    "end": 1738.309,
    "text": "That's the halting problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.35,
    "end": 1745.192,
    "text": "Shannon showed that Alice can't tell what the inputs mean to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.543,
    "end": 1751.004,
    "text": " His whole theory of communication is completely independent of semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.224,
    "end": 1758.006,
    "text": "And his theory of communication actually accurately describes what Alice can observe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.146,
    "end": 1768.628,
    "text": "Rice is the one who proved that you can't determine what program is generating the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.208,
    "end": 1780.152,
    "text": " And then Moore proved a very similar result in a completely different formal setting of general cybernetics that you can't tell what process is generating the outputs by finite observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.792,
    "end": 1793.437,
    "text": "But what Alice can do is build a predictive model of what generates the output she sees in response to her inputs and test it by designing new inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.674,
    "end": 1800.54,
    "text": " And this is, of course, as Karl Popper told us, the process that we call science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.661,
    "end": 1806.906,
    "text": "So Alice can do science even though she can't answer any of these fundamental questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.249,
    "end": 1813.512,
    "text": "Now this, of course, has a huge technological consequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.926,
    "end": 1832.55,
    "text": " Since this theory of computation tells us that processes are effectively virtual, we don't know what they are and we can't determine what they are except in theory, by making a theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.331,
    "end": 1841.493,
    "text": "Technologically, it means we're free to use virtualization everywhere because we have to deal with it anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.728,
    "end": 1845.67,
    "text": " And this allows us to build multi-level architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.951,
    "end": 1855.598,
    "text": "It means that we can architect computers where no layer of the computation has any idea what's going on below or above it and doesn't need to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.2,
    "end": 1860.342,
    "text": "And that's what makes practical programming possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.323,
    "end": 1871.171,
    "text": "So from these no-go theorems that tell you what you can't do, you actually get an enormous boost into it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.805,
    "end": 1878.306,
    "text": " and use to probe the world and develop theories and on and on and on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.467,
    "end": 1891.45,
    "text": "So in a sense, Gödel birthed not only computer science but practical computing by showing us that virtualization is just the way the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.43,
    "end": 1901.052,
    "text": "So now let's go back to physics, where these ideas were replicated, basically reintroduced, reinvented,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.823,
    "end": 1907.784,
    "text": " by Feynman in developing his path-integral formulation of quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.844,
    "end": 1921.847,
    "text": "And basically what Feynman realized was that in any physical process, the observer, Alice, prepares some state that she's interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.967,
    "end": 1924.327,
    "text": "She prepares some input to an experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.388,
    "end": 1927.388,
    "text": "Then she lets something happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.587,
    "end": 1931.728,
    "text": " And then she sees what the result of the experiment is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.728,
    "end": 1935.689,
    "text": "And the canonical experiment in physics is scattering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.05,
    "end": 1943.992,
    "text": "You fire two protons at each other and they intersect someplace and stuff comes out and you measure the stuff that comes out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.193,
    "end": 1952.455,
    "text": "And what you can measure is momentum and spin, energy, things like that, position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.736,
    "end": 1957.157,
    "text": "So these processes...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.297,
    "end": 1961.758,
    "text": " conserve the total values of the things you can measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.938,
    "end": 1974.562,
    "text": "So in particular, they preserve momentum and angular momentum, and they preserve other things that are harder to measure and are only approximately conserved anyway, like lepton number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.022,
    "end": 1983.905,
    "text": "But Feynman's contribution to this way of thinking about experiments was to say, look, if you want to understand the output,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.724,
    "end": 1995.636,
    "text": " you have to sum over all of the possible processes that could have produced the output from the input, no matter how improbable they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.018,
    "end": 2001.643,
    "text": "So the famous idea from Feynman diagrams is if you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.338,
    "end": 2004.699,
    "text": " an electron that's scattering off an atom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.179,
    "end": 2011.421,
    "text": "You measure the initial state of the electron that you've generated with an accelerator or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.122,
    "end": 2015.943,
    "text": "And you measure the final state, which involves momentum and spin and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.763,
    "end": 2018.104,
    "text": "And for all you knew,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.637,
    "end": 2034.609,
    "text": " partway through the process, the electron disappeared and an entire universe appeared and then annihilated with a copy of an entire anti-universe and the electron came back out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.85,
    "end": 2043.176,
    "text": "And you have to include processes like that if you really want to understand and correctly predict the outcomes of your measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.568,
    "end": 2051.092,
    "text": " And Murray Gelman lifted the bumper sticker slogan from T.H.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.132,
    "end": 2056.275,
    "text": "White in The Once and Future King, Everything Not Explicitly Forbidden is Mandatory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.335,
    "end": 2058.317,
    "text": "That sums up Feynman's idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.378,
    "end": 2065.281,
    "text": "And this is called the totalitarian principle, since it's what's written in T.H.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.321,
    "end": 2072.045,
    "text": "White's book on the kingdom of the ants, for which everything not explicitly forbidden is mandatory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.769,
    "end": 2080.013,
    "text": " So let's think about a real example that's a bit, actually, it's the same as scattering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.073,
    "end": 2085.016,
    "text": "The ultimate scattering experiment in physics is a black hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.817,
    "end": 2091.6,
    "text": "Stuff goes into the horizon, stars, whole galaxies, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.841,
    "end": 2096.303,
    "text": "Something happens and stuff comes out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.584,
    "end": 2098.685,
    "text": "And what comes out is Hawking radiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.046,
    "end": 2100.186,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.144,
    "end": 2110.408,
    "text": " Information is conserved if the information in the Hawking radiation is actually the same as the information in the stuff that went in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.089,
    "end": 2116.971,
    "text": "And conservation is not qualitative, it's quantitative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.071,
    "end": 2120.673,
    "text": "It's only the quantity of information that's supposed to be preserved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.073,
    "end": 2129.897,
    "text": "And you can ask, how much is the information that's being emitted by a black hole that's emitting Hawking radiation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.261,
    "end": 2137.249,
    "text": " And Bekenstein was the one who figured this out using an incredibly simple argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.03,
    "end": 2139.793,
    "text": "But I'll just give the answer here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.754,
    "end": 2147.604,
    "text": "The answer is that the total entropy of the black hole is its area divided by four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.128,
    "end": 2162.517,
    "text": " And the area in this equation has to be computed in Planck units, which are units where Planck's constant and the speed of light and Boltzmann's constant and other interesting things are all set equal to one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.419,
    "end": 2172.344,
    "text": "So one Planck area is the Planck length squared, which turns out to be about 10 to the minus 70th meter squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.745,
    "end": 2178.008,
    "text": "So this says that black holes are the most entropic entities we know of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.093,
    "end": 2192.205,
    "text": " So a black hole about this big, with a radius of about a meter, has an entropy of about 10 to the 70th, which is, of course, an astonishingly big number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.446,
    "end": 2203.114,
    "text": "And a black hole with the area of the Sun, so a moderate-sized cosmological black hole,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.914,
    "end": 2211.982,
    "text": " a real thing that we can observe with a gravity wave telescope or something, has an entropy of about 10 to the 79th.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.063,
    "end": 2225.154,
    "text": "And really big black holes, which are bigger than the entire solar system, have entropies into the 10 to the 80th, 10 to the 85th or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.294,
    "end": 2228.417,
    "text": "So these are enormously entropic entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.274,
    "end": 2233.996,
    "text": " But Bekenstein didn't just tell us that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.136,
    "end": 2240.38,
    "text": "He told us something about the structure of the interface, the horizon of a black hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.741,
    "end": 2243.202,
    "text": "And this is what he told us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.024,
    "end": 2250.506,
    "text": "You can compute entropy in bits just by using...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.958,
    "end": 2256.521,
    "text": " log space two instead of log space E, natural logs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.621,
    "end": 2262.805,
    "text": "And that's just multiplying the natural log by about 1.4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.067,
    "end": 2272.412,
    "text": "So we can write the entropy of black hole in units of bits, and it's about A over six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.933,
    "end": 2279.717,
    "text": "So what does this mean to say that we can think of the entropy in terms of bits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.879,
    "end": 2285.862,
    "text": " What it says is that we can think of the interface in terms of a bit array.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.724,
    "end": 2296.21,
    "text": "And we can think of all of these bits as encoded on this interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.208,
    "end": 2308.196,
    "text": " at a density of one bit every roughly six Planck lengths squared, six Planck areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.097,
    "end": 2311.959,
    "text": "So this is an incredibly dense encoding in a black hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.37,
    "end": 2321.214,
    "text": " And it's an interesting idea about black holes, but what gets really interesting is what happens when you generalize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.794,
    "end": 2327.037,
    "text": "And of course, physicists are prone to generalization, and that's what happened next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.399,
    "end": 2336.882,
    "text": "Gerard de Hooft, almost immediately thereafter, on the basis of Bekenstein's work, formulated the holographic principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.043,
    "end": 2342.065,
    "text": "And what the holographic principle says is we can think of any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.095,
    "end": 2345.596,
    "text": " system as approximately a black hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.137,
    "end": 2349.838,
    "text": "And the only approximation is the encoding density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.158,
    "end": 2361.042,
    "text": "The boundary of any system encodes the information that we can get about the system at some density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.222,
    "end": 2365.704,
    "text": "And the density is less than the density for a black hole because we're not black holes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.656,
    "end": 2378.838,
    "text": " And this rules out a lot by limiting the amount of information that you can extract from a system to the amount of information that you can actually write on its boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.138,
    "end": 2385.119,
    "text": "And one of the things that it rules out is knowing the geometry on the inside of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.899,
    "end": 2389.3,
    "text": "And Tuff put it this way, which I think is a brilliant thought experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.32,
    "end": 2394.121,
    "text": "He says, look, the metric inside this system can be so curved that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.671,
    "end": 2409.377,
    "text": " effectively the space-time inside the system can be so curved that you could stick an entire universe inside, and we'd never know, because it wouldn't change the amount of entropy, the number of bits that are encountered on the boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.898,
    "end": 2417.461,
    "text": "So the inside geometry can be anything, and you can't find out by looking at the outside of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.261,
    "end": 2420.462,
    "text": "Now, the holographic principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.661,
    "end": 2424.624,
    "text": " almost follows from classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.805,
    "end": 2440.42,
    "text": "There's Euler's theorem, which tells you about 1 over r-squared forces, and you can think of the force as penetrating the boundary at some density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.561,
    "end": 2442.943,
    "text": "And the difference between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.463,
    "end": 2445.263,
    "text": " Euler's theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.643,
    "end": 2450.986,
    "text": "And the holographic principle is just that the density in classical physics can go to infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.286,
    "end": 2459.829,
    "text": "And in the holographic principle, it can only go to this maximal density that's achieved by a black hole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.834,
    "end": 2461.154,
    "text": " Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.254,
    "end": 2468.656,
    "text": "Because if you try to get any higher, more information, the information gets sucked into the black hole and you can't get it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.677,
    "end": 2484.3,
    "text": "So the holographic principle becomes a guiding principle for thinking about any physical system and what it means to extract information from a physical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.592,
    "end": 2494.657,
    "text": " And in fact, and we'll talk about this next time, you can say exactly what the information encoded on the boundary of any system is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.089,
    "end": 2513.099,
    "text": " And what I'll go through next time is seeing that the information that's encoded on the boundary is a specification of the energy that's being exchanged by the interaction, which of course is linear in the number of bits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.219,
    "end": 2515.32,
    "text": "It's just counting the number of bits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.327,
    "end": 2539.284,
    "text": " Okay, so with the holographic principle, we now have a complete new science about systems that are exchanging finite discrete information across a boundary by encoding that information on the boundary and then reading the information off the boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.605,
    "end": 2545.209,
    "text": "So here's a new way of thinking about physical interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.258,
    "end": 2558.186,
    "text": " Alice writes a message on her boundary with Bob, and Bob reads the message off the boundary and then writes his own new message, which Alice then reads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.087,
    "end": 2562.069,
    "text": "And, of course, that's what's happening right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.25,
    "end": 2570.455,
    "text": "I'm writing information by speaking on an interface, which is effectively the Internet,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.397,
    "end": 2575.798,
    "text": " And you're reading that information off the internet by listening to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.659,
    "end": 2583.641,
    "text": "And when we get time for questions, you'll be writing information on the internet, which I'll be reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.502,
    "end": 2589.623,
    "text": "Now, the key thing about this new science is that it's topological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.843,
    "end": 2596.625,
    "text": "It's about connectivity across some communication channel, which we represent as a boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.205,
    "end": 2598.606,
    "text": "It's not geometric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.793,
    "end": 2602.674,
    "text": " So it doesn't assume anything about space-time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.295,
    "end": 2612.579,
    "text": "So it allows us to build a model of space in particular as an emergent phenomenon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.599,
    "end": 2627.365,
    "text": "And it allows us to see time as not some absolute external abstraction, but something that the communicating agents measure for themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.749,
    "end": 2631.79,
    "text": " And so they each act in their own time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.371,
    "end": 2640.954,
    "text": "And we get a very natural measure of time in terms of how many bits I see coming across my boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.974,
    "end": 2643.835,
    "text": "And again, we'll talk about that in the next couple of sessions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.715,
    "end": 2650.937,
    "text": "And then talk about it more thoroughly in September when we talk about emergent space time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.498,
    "end": 2657.64,
    "text": "So quantum information theory looks very different from the physics that came before",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.496,
    "end": 2664.599,
    "text": " not because it's adopted a new formalism, the tools of quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.22,
    "end": 2681.632,
    "text": "It's because it's entirely changed the thinking about what physics is and what it's about, and replaced this idea of forces and balls banging into each other and all of that with the idea of communication between agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.813,
    "end": 2686.916,
    "text": "And, of course, that's familiar from an active inference perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.081,
    "end": 2695.625,
    "text": " So we can now back up a little bit to see what they were doing in classical physics during this period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.846,
    "end": 2701.789,
    "text": "Well, let me go on a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.889,
    "end": 2702.069,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.229,
    "end": 2713.676,
    "text": "This is just a slide quoting Wheeler, who, of course, is the most radical and pithiest in terms of formulating these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.619,
    "end": 2717.922,
    "text": " But here's his characterization of this new physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.023,
    "end": 2720.104,
    "text": "It's not reductive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.906,
    "end": 2723.607,
    "text": "All of the reasoning is circular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.429,
    "end": 2731.294,
    "text": "You don't have smaller things and then yet smaller things and then yet smaller things forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.316,
    "end": 2734.057,
    "text": "There are no laws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.919,
    "end": 2740.921,
    "text": " So what you see on the interface is a message.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.361,
    "end": 2746.563,
    "text": "It's not something that's governed by laws since the beginning of the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.064,
    "end": 2749.184,
    "text": "There's no continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.665,
    "end": 2752.066,
    "text": "So there's nothing described by real numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.186,
    "end": 2753.686,
    "text": "It's all described by integers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.007,
    "end": 2756.288,
    "text": "Everything's done in finite dimensional spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.388,
    "end": 2761.99,
    "text": "And finally, and most importantly, there's no space-time box in which things happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.091,
    "end": 2765.112,
    "text": "So think of how radical this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.067,
    "end": 2767.588,
    "text": " It means there's no big bang.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.169,
    "end": 2770.329,
    "text": "There's no big rip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.27,
    "end": 2772.811,
    "text": "There's no bouncing universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.072,
    "end": 2778.954,
    "text": "All of those ideas are out the window because they're classical and they're about space-time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.255,
    "end": 2786.979,
    "text": "And what the new physics wants to do is derive space-time out of basically users' experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.085,
    "end": 2796.13,
    "text": " So the agents here are all observer participants in Wheeler's language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.21,
    "end": 2801.374,
    "text": "But what that just means is agents that want to communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.474,
    "end": 2803.996,
    "text": "And it's their communication that gives rise to physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.158,
    "end": 2808.039,
    "text": "So now we'll go back to classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.14,
    "end": 2818.287,
    "text": "And what was happening, or one thing that was happening in classical physics at that time, was a lot of thinking about stochastic causal networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.918,
    "end": 2834.689,
    "text": " And Pearl realized that if you have any stochastic causal network that's unidirectional, then around any node, you can draw what he called a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.61,
    "end": 2848.56,
    "text": "And a Markov blanket is just the set of nodes in the network that absorb all outside causation and then transmit that causation into whatever node you're interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.608,
    "end": 2856.712,
    "text": " and that absorb all causation coming from the node you're interested in and transmit it to the rest of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.992,
    "end": 2864.756,
    "text": "And so we can redraw that in part B here, and it should look very familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.876,
    "end": 2869.658,
    "text": "Markov blanket is just a classical physics way of talking about a holographic screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.959,
    "end": 2872.9,
    "text": "And the number of nodes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.655,
    "end": 2884.76,
    "text": " in the Markov blanket, or in particular the number of degrees of freedom times the number of nodes, is just the number of bits that flow across that Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.9,
    "end": 2889.282,
    "text": "So it's the number of, it's the entropy of the effective holographic screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.003,
    "end": 2897.846,
    "text": "So all these ideas were reinvented more or less independently within classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.272,
    "end": 2909.319,
    "text": " And it was from this classical physics background that Carl Fristen came up with the idea that a Markov blanket defines a persistent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.762,
    "end": 2921.488,
    "text": "At least from an active inference institute point of view everyone is familiar with because it's the foundation of the idea of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.89,
    "end": 2925.611,
    "text": "Any system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.202,
    "end": 2935.764,
    "text": " is that persists through time does so by making sure that it doesn't dissolve into its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.764,
    "end": 2938.025,
    "text": "Well, what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.685,
    "end": 2946.727,
    "text": "It means that it persists through time by maintaining the integrity of its Markov blanket or the integrity of its boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.827,
    "end": 2955.749,
    "text": "So this, of course, is just a tautology, but it's a very interesting and very productive tautology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.889,
    "end": 2966.919,
    "text": " Because it says that any system is using the information it gets on its boundary from its environment to build a model of how its environment behaves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.24,
    "end": 2975.427,
    "text": "And then it uses that model to act back on its environment to test and refine its model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.688,
    "end": 2980.072,
    "text": "And again, as Popper told us, this is just what science is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.252,
    "end": 2989.198,
    "text": " So what the free energy principle really tells us is that all systems are agents that are doing science all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.599,
    "end": 3010.574,
    "text": "So physics is effectively not just the study of communication, but it's the study of agents doing science with each other, pairs of agents who are trying to figure each other out by their communication, communicative exchanges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.446,
    "end": 3023.436,
    "text": " So that's the history of how we got from 1850s thermodynamics to the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.659,
    "end": 3036.569,
    "text": "And how the free energy principle connects to these very deep and extremely radical, especially within context,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.552,
    "end": 3062.552,
    "text": " ideas in quantum theory and quantum cosmology and computer science, all of which tell us that the world we see is a projection that's being written on our boundaries by a process that we have no access to except",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.884,
    "end": 3079.151,
    "text": " the procedure of active inference or the procedure of science, which is to formulate predictive models and test them by doing things in the world and seeing how the world responds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.592,
    "end": 3084.833,
    "text": "So that's it for this session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.423,
    "end": 3095.586,
    "text": " The first discussion session, which Andrew's going to lead, will be the 3rd of June at this same time, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.606,
    "end": 3096.866,
    "text": "5 o'clock European time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.447,
    "end": 3102.588,
    "text": "And then my session number two will be in mid-June.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.029,
    "end": 3111.032,
    "text": "And if you look at the course website, there's this subsidiary website for interactive Q&A.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.692,
    "end": 3122.97,
    "text": " And I invite everyone to post questions and discuss them and hope that we'll have an interesting exchange and that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.024,
    "end": 3131.645,
    "text": " Everyone will come to sort of an understanding of what was talked about today through discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.906,
    "end": 3140.688,
    "text": "And we'll be interested in being back in June to see how to formulate this in quantum theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.088,
    "end": 3142.108,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.268,
    "end": 3150.97,
    "text": "And thank you again, Daniel, for organizing this and hosting it and putting together all the technical things necessary to pull this off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.951,
    "end": 3153.011,
    "text": "I could never do that on my own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.333,
    "end": 3184.49,
    "text": " thank you we're really um excited here any closing thoughts or or Andrew I'd love to hear your reflection just briefly what how would you have told that history or how does that history reflect on the areas that you're familiar with well I I don't think I have much to add I um I've been you know mainly interested in the weak rotation part I I'm excited to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.997,
    "end": 3208.137,
    "text": " hear more about that chris uh but no i mean i i found this to be a very very nice summary i don't think i i'm less familiar with the with the staff on on computation formal computation despite being a mathematician by training um and and it was a little more familiar with with all the physics stuff but yeah i thought it was great",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.585,
    "end": 3209.945,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.165,
    "end": 3211.026,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.867,
    "end": 3212.187,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.327,
    "end": 3213.348,
    "text": "I will close it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.428,
    "end": 3216.311,
    "text": "So in about two weeks, we'll have the first discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.411,
    "end": 3217.912,
    "text": "Everyone's welcome to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.932,
    "end": 3227.24,
    "text": "I will share with Ander and Chris the questions and we can develop that and we'll have that on the course front end before the coming discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.86,
    "end": 3229.241,
    "text": "So thanks again, fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.501,
    "end": 3230.042,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  }
]