[
  {
    "start": 7.726,
    "end": 36.4,
    "text": " hello welcome it is june 11th 2025 it is active inference guest stream lucky number 111.1 uh very nice and we are with georgie georgiev who will be presenting and then we'll have a discussion on modeling and predicting self-organization in dynamic systems out of thermodynamic equilibrium part one attractor mechanism and power law scaling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.527,
    "end": 52.633,
    "text": " will look forward to a presentation and some q a so if you're watching live feel free to ask a question thank you for joining gergi to you all right thank you daniel for inviting me it's my great pleasure to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.322,
    "end": 57.687,
    "text": " talk to the Active Inference Institute audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.488,
    "end": 70.901,
    "text": "And hopefully we have a lot of interests in common so we could have a good discussion or continue to explore those questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.242,
    "end": 79.971,
    "text": "I personally know some of the people in your group, so I hope we'll find a lot of commonalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.238,
    "end": 104.119,
    "text": " Yes, as you said, I'll be talking about some of our recent work on computer simulations with modeling and predicting self-organization in dynamical systems and what we think is driving the self-organization, what is the basic mechanism that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.504,
    "end": 129.465,
    "text": " leads to increase of order in those systems and how the different characteristics relate during the process of the self-organization how they grow together and i'll show a lot of examples from other areas to connect to like why is this important why is it interesting and in this title slide i put the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.323,
    "end": 135.231,
    "text": " the big picture, the arrow of time as presented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.351,
    "end": 143.424,
    "text": "This was a poster made by Eric Chaison when he was at Tufts University at the right center of science education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.045,
    "end": 148.753,
    "text": "We were like next, his office was next door to mine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.813,
    "end": 154.923,
    "text": "So we had a lot of great conversations and we found that we're interested in the same questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.983,
    "end": 156.786,
    "text": "And actually I had the exact same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.525,
    "end": 187.532,
    "text": " like chronical view of the expanding future and the arrow of time as leading to more interesting things more organized systems more intelligent systems and uh needless to say i was very pleasantly surprised when he made this uh poster so this represents the arrow of time from the big bang pretty much capturing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.052,
    "end": 209.318,
    "text": " everything from the pure energy to formation of structure in particles, in formation of atoms, of galaxies, of stars, planets, chemistry, biology, cultural evolution, and whatever comes in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.361,
    "end": 230.665,
    "text": " In many people's minds, it has been ingrained that the second law of thermodynamics is predicting that everything is going to a state of thermodynamic equilibrium, to entropy, and that's why a lot of people are very pessimistic about the heat death of the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.007,
    "end": 237.373,
    "text": "But meanwhile, a lot of interesting things are happening which go in the opposite direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.414,
    "end": 240.317,
    "text": "They are becoming less and less",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.905,
    "end": 246.173,
    "text": " those systems are becoming in less and less of equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.193,
    "end": 248.717,
    "text": "They're moving further away from equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.959,
    "end": 254.345,
    "text": "And the interesting question is, why does this happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.527,
    "end": 258.592,
    "text": "Why they don't just disintegrate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.652,
    "end": 259.994,
    "text": "Why they don't fall apart?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.174,
    "end": 268.026,
    "text": "Why this process of increasing of complexity and structure and everything that we see around us has not stopped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.951,
    "end": 273.017,
    "text": " let's say, a random number of billion years ago, if it ever started?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.48,
    "end": 278.926,
    "text": "And why do we observe everything around us right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.287,
    "end": 280.349,
    "text": "How did it come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.689,
    "end": 289.643,
    "text": "Well, I guess that's a question that a lot of people are thinking from different angles and have different answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.142,
    "end": 313.536,
    "text": " I want to point also to another aspect, not only that the process of self-organization in the universe in all kinds of different systems is moving in an arrow of time of increasing structure, increasing complexity further away from equilibrium, but it happens at an accelerated rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.556,
    "end": 317.402,
    "text": "It has been happening since the Big Bang and it doesn't seem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.382,
    "end": 319.344,
    "text": " to be slowing down, if anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.506,
    "end": 327.253,
    "text": "I know that some of your audience have told me from machine learning and AI, boy, that's an acceleration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.395,
    "end": 330.737,
    "text": "Every day there are new things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.138,
    "end": 341.109,
    "text": "And that's a great example of self-organization when you put tons of information in a neural network and it finds a pattern and you don't know what happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.329,
    "end": 345.214,
    "text": "It happened by itself, I guess, as far as I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.274,
    "end": 347.136,
    "text": "Maybe there are other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.352,
    "end": 356.426,
    "text": " It's not my area of expertise, but what I have heard is there is a kind of structure formation in that information space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.988,
    "end": 365.86,
    "text": "So this is another, this is called the Cosmic Calendar, and it's also well known since probably the 70s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.0,
    "end": 375.655,
    "text": "It was made by Carl Sagan, and I was fascinated by these topics when I was watching it in the 80s in Bulgaria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.124,
    "end": 402.368,
    "text": " where i was born and i couldn't wait for the next episode where he was explaining exactly these interdisciplinary connections between different areas of life of science of culture of history of physics of astronomy and putting it all together and his cosmic calendar represents that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.77,
    "end": 403.651,
    "text": " Let's look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.711,
    "end": 407.474,
    "text": "So the universe is roughly 15 billion years old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.514,
    "end": 410.357,
    "text": "He mapped it on a year, which is 12 months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.878,
    "end": 414.141,
    "text": "Every month is about a billion years, a little more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.161,
    "end": 423.77,
    "text": "And from the Big Bang, which is January, the first billion years, February, March, not much is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.03,
    "end": 427.894,
    "text": "Now we think with the new observations, there could be some more interesting things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.974,
    "end": 431.477,
    "text": "But in general, when we look back, we see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.858,
    "end": 456.03,
    "text": " majority like very small galaxies more small clusters the Milky Way our own Galaxy forms about in May which is five billion years later not much interesting things happen at least from our point of view until the solar system forms which is in September of that year and then weekly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.753,
    "end": 462.679,
    "text": " Photosynthesis emerges in October and November, the eukaryotic cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.699,
    "end": 469.305,
    "text": "And now for December, we need this whole panel because things start to accelerate enormously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.345,
    "end": 481.136,
    "text": "We have the fish on the 70th of December, land plants, insects, reptiles, dinosaurs, mammals on the 26th, and Pangea splits on 27th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.196,
    "end": 485.14,
    "text": "So you see that on this cosmic calendar,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.643,
    "end": 513.422,
    "text": " pretty much the human history the first ape divergence is on december 31st on the last day in the humans the homo erectus the anatomically modern humans like 11 neanderthals out 11 59 pm and in the very last minute of this enormous span of time the last few seconds we have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.718,
    "end": 538.954,
    "text": " agriculture like 22 seconds before midnight and third cities and china and christ was born like four and a half seconds before midnight and columbus came to america like one second ago so it seems like there is some driving force that's not only pushing the universe towards creating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.795,
    "end": 551.914,
    "text": " order and more interesting and more sophisticated systems but it's doing it in exponentially or super exponential acceleration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.046,
    "end": 561.22,
    "text": " rate, which, as you can see here, the difference in increase of complexity in this last few seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.921,
    "end": 568.831,
    "text": "I mean, since Columbus came here, we are now at AI and super intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.151,
    "end": 580.348,
    "text": "The acceleration is fascinatingly robust and not only robust, but it's getting faster and better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.717,
    "end": 606.741,
    "text": " so why is that why first question is why order is created and increases at all and not only that why does it happen faster and faster why doesn't it go at constant rate and there is uh just to confirm this um cosmic calendar acceleration there is this is from ray kurzweil he compiled data from carl sagan and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.143,
    "end": 635.85,
    "text": " uh all these other sources here the american museum of natural history encyclopedia britannica about major transitions in kind of cosmic complexity new structures like plants animals why like civilization and before that more chemistry and atoms emerging and how long before the present they happened",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.725,
    "end": 643.334,
    "text": " So on the y-axis, you see the time to the next event, how many years you have to wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.374,
    "end": 648.402,
    "text": "So pretty much at the beginning, you have to wait like 10 billion years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.383,
    "end": 662.682,
    "text": "And when you approach the present, this is 10 here on the x-axis, time before the present, this is like 10 years before now, pretty much you see that those events are happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.218,
    "end": 681.936,
    "text": " closer and closer together and all these sources pretty much line up on the same kind of trend and you may people have objected they say oh how did you choose this events but there are there are like transitions in complexity there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.118,
    "end": 708.143,
    "text": " like major milestones and that's what people are looking at and that's why he compiled all these sources to minimize the error so again tremendous acceleration and complexity transitions as we are approaching the present and um going back to eric shason he defined a metric which is called free energy rate density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.468,
    "end": 735.244,
    "text": " it has some caveats but in general his idea is the amount of energy flowing through this complex self-organized systems per unit mass so that's why it's in units of energy ergs per second per gram so it's like the flow the energy rate density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.376,
    "end": 763.172,
    "text": " through the systems and again on the x-axis you have the time before present and you could see the enormous acceleration in the you could say that the free energy rate through the system is a measure of distance from thermodynamic equilibrium right like a jar of gas if you leave it in the kitchen or or the temperature in your room is pretty much at equilibrium every point has the same temperature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.625,
    "end": 771.415,
    "text": " But in those systems, you have great differences inside them in all kinds of measures, not just temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.357,
    "end": 786.055,
    "text": "And that distance from equilibrium is correlated with the structure of those systems, like stars, planets, animals, brains, society, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.22,
    "end": 804.516,
    "text": " Ray Kurzweil looked at calculations per second, that's why he was able to do all these accurate predictions in computing technology and AI, where he actually mapped that on a super exponential, like his points",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.682,
    "end": 828.951,
    "text": " for compute calculations per second per thousand dollars versus time and this is only until 2000 but i've seen his most recent plots until 2025 they are all on this white kind of dashed line and that's also accelerating so whatever we look we see gigantic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.775,
    "end": 859.225,
    "text": " rise in complexity and structure and information and we see super exponential acceleration or at least like Moore's law is strictly exponential but it's only a fraction of this paradigm here for the CPUs obviously Ray Kurzweil looked further back but even if you took a small portion of this data set",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.829,
    "end": 867.258,
    "text": " Even exponential acceleration is a very big deal on long time scales, as we know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.558,
    "end": 881.354,
    "text": "All right, so now the question about this huge variety of structures and this huge kind of diversity between systems is very, very complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.317,
    "end": 888.823,
    "text": "And to answer it, we need to go to something simple,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.732,
    "end": 894.958,
    "text": " and try to understand that first and then try to build on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.839,
    "end": 910.157,
    "text": "And here I'm showing an example of a system that people have studied a lot, which is self-organization, spontaneous organization happening by itself, just when you pass energy through a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.177,
    "end": 918.827,
    "text": "And in this case on the left you have, so imagine you're sitting at your kitchen and you have a pan with water and you turn on the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.33,
    "end": 926.691,
    "text": " the heat and now you have a hot bottom plate and cold top surface in the room, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.84,
    "end": 952.864,
    "text": " and honestly by eye you don't see much but if you people put like different particles inside to see the motion of the fluid or we use an infrared camera we could see the the structure formation and what happens is a small difference in temperature between the bottom and the top obviously now the according to the second law of thermodynamics the heat that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.198,
    "end": 959.329,
    "text": " It has to be transferred from the hot to the cold, from the bottom to the top, but very small differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.231,
    "end": 970.31,
    "text": "It's enough to just the thermal diffusion, the collisions between the molecules are enough and the fluid stays kind of still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.672,
    "end": 974.397,
    "text": "The heat is transferred slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.322,
    "end": 980.793,
    "text": " But if you increase the temperature on the bottom plate, then something interesting happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.973,
    "end": 984.38,
    "text": "That mechanism of energy transfer is not enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.482,
    "end": 990.913,
    "text": "And the fluid itself organizes in what's called convection rolls.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.933,
    "end": 992.436,
    "text": "So if you look from the top,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.99,
    "end": 1018.71,
    "text": " there'll be these long lines which are basically the this is looking from the side to show the the convection pattern of this of the water or oil whatever fluid you have and not only that but if you increase this temperature difference even more then you could go through a whole set of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.247,
    "end": 1037.577,
    "text": " very intricate patterns this is a kind of a computational study but in the lab you could observe this is a very simple image here like this will break into sometimes a honeycomb structure they look like a beehive kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.13,
    "end": 1067.445,
    "text": " like where the bees put the honey six kind of angled shapes and then if you increase the temperature even further you get different shapes so basically this is what people mean when they say self-organization i think it's more appropriate appropriately to say energy induced organization because the flow of energy it seems is the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.539,
    "end": 1072.873,
    "text": " driving force that creates structure in those systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.536,
    "end": 1080.017,
    "text": "And again, this is the very, very simplest system that I could think of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.233,
    "end": 1085.44,
    "text": " which just has the fluid and the temperature difference, and yet it could create this variety of structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.58,
    "end": 1101.581,
    "text": "Imagine now all other kinds of a lot more complicated systems and systems that are alive and that you pass energy through them and then you have metabolic cycles and all other kinds of patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.601,
    "end": 1103.423,
    "text": "It's just mind-boggling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.314,
    "end": 1125.816,
    "text": " it's at this level of science it's almost impossible now it's so complicated it's almost impossible to understand everything but can we still say something meaningful okay so we looked also at well known to biologists scaling laws",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.948,
    "end": 1138.412,
    "text": " which are that if you increase the size of animals, let's say if you go from a mouse to an elephant, the metabolic rate changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.492,
    "end": 1145.565,
    "text": "In other words, they use less energy per unit mass and they become more efficient in their metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.626,
    "end": 1147.99,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.522,
    "end": 1155.789,
    "text": " we looked at CPUs and also the energy passing through the CPUs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.809,
    "end": 1174.751,
    "text": "We hear that x-axis is total number of quanta, which means, quanta means we are using units of physical action, but if you normalize it per unit time, it's just the energy that the CPU uses and the number of transistors inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.831,
    "end": 1178.736,
    "text": "So as you increase",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.969,
    "end": 1181.515,
    "text": " the number of transistors in the CPUs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.059,
    "end": 1189.254,
    "text": "Well, you could say obviously they'll use more energy, but we shouldn't forget that they're getting smaller and smaller and smaller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.294,
    "end": 1195.189,
    "text": "So it's not that obvious how much more energy they should use and what will be the pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.253,
    "end": 1217.818,
    "text": " so now these two scales are logarithmic the x and the y and a straight line we could pass a straight line to the data point is a power law relationship right so one is the other time to the power of some number and just to compare we looked um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.71,
    "end": 1234.506,
    "text": " at brains and the energy consumption of brains, again, in terms of total number of quanta, that will be the power used by brains of animals of different size, and the neuronal count in the brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.647,
    "end": 1248.16,
    "text": "And I was amazed to see that they are much more lined up, but they form the same powerful relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.612,
    "end": 1263.507,
    "text": " And if, I mean, the brain is not a computer, but still there are units in the brain and there is energy passing through the brain and they are scaling in a proportional relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.527,
    "end": 1269.413,
    "text": "So there is something that gives us some hint about underlying dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.454,
    "end": 1277.421,
    "text": "All right, so our approach, so I'm coming from physics, is to go to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.633,
    "end": 1293.913,
    "text": " basic principles of physics and ask the question why and how those systems self-organize and can we measure or how can we measure this degree of organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.953,
    "end": 1305.788,
    "text": "If we put two systems next to each other, both are complex, both are performing some amazing things, but do we have a basis to say which one is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.51,
    "end": 1315.96,
    "text": " more organized, better organized, which will be, if you have a biological system, like which one will outcompete the other, which is more fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.301,
    "end": 1324.329,
    "text": "And there is a basic principle in physics called the principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.85,
    "end": 1334.88,
    "text": "In other words, it was said by Mapertui in the 1600s that nature is most economical in all of its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.215,
    "end": 1344.466,
    "text": " And before him, even the ancient Greeks and many other, the Taoist philosophy is also based on this efficiency principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.427,
    "end": 1356.56,
    "text": "So it seems like, I mean, in science, it's not usually accepted to talk in terms of final goal of kind of teleology of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.201,
    "end": 1364.209,
    "text": "But if a system tries to become most economical in everything that happens in it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.999,
    "end": 1373.411,
    "text": " it will restructure itself, reorganize to get to even more economical state or more efficient state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.713,
    "end": 1378.759,
    "text": "And in our society, we have economies of scale, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.779,
    "end": 1386.249,
    "text": "So if you have a bigger plant or a bigger company, the more units you produce of the same thing, the cheaper they get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.329,
    "end": 1393.099,
    "text": "So you have this size and efficiency relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.653,
    "end": 1398.041,
    "text": " Okay, so what is this principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.342,
    "end": 1416.437,
    "text": "So now, based on this principle, I'll show you the mathematical definition of it, but just to tell you beforehand that for those of you who are not physicists, those of you who are physicists, you all know that all branches of physics everywhere in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.788,
    "end": 1427.144,
    "text": " Relativity in quantum mechanics, in classical mechanics, in electromagnetism, in fluid dynamics, in optics, everything is derived on this principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.244,
    "end": 1433.153,
    "text": "String theory, that every textbook starts with this principle and derives equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.333,
    "end": 1436.117,
    "text": "So mathematically, it looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.878,
    "end": 1443.268,
    "text": "So if you take two points, the starting point and the ending point,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.025,
    "end": 1451.082,
    "text": " Uh, for travel of some in physics, it will be a atom or like molecule, some particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.057,
    "end": 1467.519,
    "text": " And in more complex systems, I would like to think it should be applicable to any motion, even in biology and in social systems, because if this principle is valid and governs all the motion in physics, why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.979,
    "end": 1475.55,
    "text": "Why should it stop working all of a sudden in those systems which are composed by the same atoms and molecules?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.817,
    "end": 1492.217,
    "text": " And it says the following, that out of the all possible trajectories or paths that an object could take from the starting to the ending point, you could see some of them here are presented with like wiggly lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.178,
    "end": 1495.261,
    "text": "It always takes the shortest paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.302,
    "end": 1502.77,
    "text": "And this symbol delta here means if we vary this path, we increase the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.442,
    "end": 1510.589,
    "text": " What this is called the action, I'll define it in a second, but basically it becomes less efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.17,
    "end": 1513.953,
    "text": "The motion becomes less efficient in terms of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.533,
    "end": 1519.358,
    "text": "And that's what means that nature is most economical in all of its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.378,
    "end": 1522.201,
    "text": "Basically, it's most action efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.221,
    "end": 1523.382,
    "text": "It does everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.822,
    "end": 1528.487,
    "text": "All of the motions are happening with the least amount of this quantity action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.26,
    "end": 1531.565,
    "text": " And here is how it looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.585,
    "end": 1533.489,
    "text": "So I here stands for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.113,
    "end": 1537.498,
    "text": "And delta is this variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.578,
    "end": 1540.705,
    "text": "If you vary it, make it a little bit smaller or greater.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.355,
    "end": 1568.076,
    "text": " and this integral here here means that we just take the whole path from the beginning to end from t1 to t2 when we start the motion when we end and this l here is in physics it's simply the difference between kinetic and potential energy so to give you another very obvious example if you take your pencil now and you drop it in the room well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.647,
    "end": 1571.21,
    "text": " From experience, you can predict which way it's going to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.23,
    "end": 1572.732,
    "text": "It's going to fall on a straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.593,
    "end": 1585.629,
    "text": "And if you calculate the action for it to move on a straight line and to move on a curved path to the left, to the right, to wiggle, all of those other paths will have higher action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.649,
    "end": 1589.013,
    "text": "So if you vary the action, you always get higher values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.574,
    "end": 1596.763,
    "text": "But if you drop it a million times, it will fall with the lowest action on a straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.783,
    "end": 1598.265,
    "text": "And the same is true for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.532,
    "end": 1600.254,
    "text": " much more complicated systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.275,
    "end": 1607.582,
    "text": "Again, even for fields, not just for objects, that's how we do physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.423,
    "end": 1608.704,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.307,
    "end": 1620.677,
    "text": "Now, when we consider a complex system, obviously it doesn't involve a single object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.697,
    "end": 1626.604,
    "text": "And by definition, it's a collection of, it's a system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.065,
    "end": 1628.286,
    "text": "By definition, it has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.722,
    "end": 1648.009,
    "text": " a multitude of objects, or you could call them agents, that interact with each other, that travel along paths, that have to, if you represent a complex system as a network, in biology you could have a metabolic network, in computer science you could have a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.711,
    "end": 1656.681,
    "text": "Now, how does this minimization could help us there if we want to apply it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.983,
    "end": 1658.323,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.21,
    "end": 1673.915,
    "text": " In expanding the definition that we saw on the previous slide for a single object, here i is the same amount, the same quantity action, and the integral of the Lagrange and it is the kinetic minus potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.415,
    "end": 1684.193,
    "text": "But now we say this is each of the objects in the system, let's say i is the number of the object, let's say you have 10",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.877,
    "end": 1692.304,
    "text": " agents, 10 atoms or whatever it is, they are moving and they do J crossings between the nodes of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.125,
    "end": 1714.669,
    "text": "And we sum all of this, the action for all of these crossings or all of these events that they perform to get from A to B. And we say, all right, if each of them obeys physics laws, there is no argument to say that they don't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.695,
    "end": 1723.285,
    "text": " then the minimization of the sum of all these actions should be zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.246,
    "end": 1726.188,
    "text": "So what does it mean, the sum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.389,
    "end": 1728.551,
    "text": "Why don't we say each of them individually?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.012,
    "end": 1740.066,
    "text": "Well, if we have a system that has many crossing paths, obstacles inside, neither of them could move",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.822,
    "end": 1742.804,
    "text": " on their own least action path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.824,
    "end": 1744.807,
    "text": "Neither of them could move on a straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.887,
    "end": 1754.519,
    "text": "They have to find curve paths to get from one node to the other, from one starting point to an ending point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.88,
    "end": 1768.095,
    "text": "But everything that's happening there, we're saying, to obey the laws of physics, it should be minimizing the sum of all of these actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.868,
    "end": 1776.762,
    "text": " And not only that, as we'll see later, to minimize it, it will be like a temporary state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.883,
    "end": 1785.458,
    "text": "But in this cosmic evolution, as you go through different levels of structure formation, it should continue to decrease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.558,
    "end": 1793.172,
    "text": "So this is called a stationary action principle, where every variation is greater and you find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.337,
    "end": 1804.429,
    "text": " some stationary value, but we want to think in terms of evolutionary systems of dynamical action principles and I'll show you in a second how it looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.47,
    "end": 1816.902,
    "text": "So this is our starting point that we take all of the actions for all of the agents in the system and minimize that sum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.443,
    "end": 1823.108,
    "text": "And we could express this as a ratio",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.78,
    "end": 1831.671,
    "text": " It could be derived from stochastic dissipative action principles, but for now I'm not going to show that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.834,
    "end": 1835.196,
    "text": "So the ratio is the following.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.216,
    "end": 1837.82,
    "text": "So here we have the same thing, n objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.501,
    "end": 1841.685,
    "text": "They do m events, m crossing between the nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.725,
    "end": 1845.751,
    "text": "Here is the sum of all of the actions for all of those crossings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.272,
    "end": 1850.297,
    "text": "And here we'll multiply some constant h, which is called the Planck's constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.317,
    "end": 1853.061,
    "text": "It's the smallest unit of action in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.395,
    "end": 1857.523,
    "text": " And we say that this ratio, we call it action efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.563,
    "end": 1864.797,
    "text": "In other words, how efficiently the agents in the system are moving to perform their functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.761,
    "end": 1870.628,
    "text": "And we say that the more action efficient the system is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.262,
    "end": 1880.289,
    "text": " or the larger, the smaller the denominator, the less energy and time they need to use to perform their functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.369,
    "end": 1887.255,
    "text": "That's a signature of better structures, the structure in the system, shorter paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.395,
    "end": 1892.3,
    "text": "If it's biology, it could be enzymes that are speeding up reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.86,
    "end": 1901.728,
    "text": "If it's neural networks, I think I've seen people apply similar principle optimization principles even",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.046,
    "end": 1931.918,
    "text": " neural networks and economics there is optimal control principles so they use not the same but similar approaches so basically we say that the organization in our language the organization of the system will be reflected in this efficiency in other words if a system is more poorly organized if the agents have to travel longer distances to get from here to there they'll perform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.421,
    "end": 1955.965,
    "text": " slower their functions they will consume more energy and if you put two systems next to each other if they're biological one will out compete the other even if they're in economics one will be more efficient people will buy the more efficient one so for us the measure of how well organized the system is is this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.923,
    "end": 1957.884,
    "text": " action efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.465,
    "end": 1961.168,
    "text": "And here we just compress the notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.228,
    "end": 1984.433,
    "text": "We say this total amount of action, the sum of everything that happens in the system over the Planck's constant, we label it with the symbol Q, which means this sum of all of the actions and the flow of events or the number of events, all agents times all the crossings that they do is phi, which is flow of events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.51,
    "end": 1999.825,
    "text": " And this same equation here becomes the number of things that happened, the number of events, functions in the system divided by the total amount of action expended for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.967,
    "end": 2013.559,
    "text": "But if this was the only thing that happened, then I would expect if the least action principle was the only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.096,
    "end": 2024.068,
    "text": " Factor that determines how systems should self-organize and how they should form a structure Because it acts everywhere in all particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.088,
    "end": 2039.766,
    "text": "There'll be life on Mars and there'll be life on Venus and everything will be getting more more complex, but In our understanding, that's not the case Because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.488,
    "end": 2068.2,
    "text": " level of structure in the system, that's why I showed this previous slide, that as the size of the system is increasing, the number of components is increasing in a proportional manner, depends also on, we talked a little bit before that about cybernetics, on these positive feedback loops between all of the characteristics in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.872,
    "end": 2078.536,
    "text": " I'll give you a short example before I go on, but let's say if we do a simulation of ants forming a path between the food and the nest, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.937,
    "end": 2081.143,
    "text": "It could be any, we could call it other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.045,
    "end": 2084.451,
    "text": "But if we put very few ants,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.005,
    "end": 2086.147,
    "text": " they don't form a path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.167,
    "end": 2093.617,
    "text": "Even if you go in the forest, you look at the ants, if you have one ant and it goes to the foot, it will never form a trail, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.038,
    "end": 2096.261,
    "text": "So you need some critical number of agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.281,
    "end": 2102.891,
    "text": "So that already tells you that, yes, you will minimize the action, but it's conditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.031,
    "end": 2114.067,
    "text": "In order to minimize it, you need some number of agents, you need some amount of energy flow through the system, you need all these other prerequisites for that to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.194,
    "end": 2139.75,
    "text": " okay so um as the lab so lab stands for least action principle and as this stands for stochastic and dissipative um least action principle because it has been extended for i would say already close to a hundred years by onzager and prigogine and many others to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.422,
    "end": 2150.516,
    "text": " include in this equation for action not just kinetic and potential energy, but also dissipation, also random effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.597,
    "end": 2162.312,
    "text": "But even with all those effects, systems or objects still tend to minimize this quantity of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.895,
    "end": 2193.818,
    "text": " All right, so our basic model, it could include any number of characteristics, I just put several here, is that we understand, so the action efficiency will be the measure of how structured is the system, how organized, how efficient, how closely it obeys the physics laws, but it does so in conjunction with all these other characteristics in the system, and I'll name them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.338,
    "end": 2202.049,
    "text": " But before I say that, I purposely labeled alpha, the action efficiency, as the quality of the system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.089,
    "end": 2204.953,
    "text": "How efficient, how well it's performing its functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.934,
    "end": 2212.523,
    "text": "And Q, like the total amount of action in the system as the quantity or proportional to the size of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.885,
    "end": 2221.155,
    "text": "And in philosophy, in dialectical, like in Hegel's dialectics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.523,
    "end": 2233.377,
    "text": " the quantity-quality transition was one of the three main mechanisms of pretty much progressive evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.397,
    "end": 2241.828,
    "text": "And I think that's absolutely true and working in this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.189,
    "end": 2250.518,
    "text": "So here we have the efficiency of the system, the quality, the quantity, the total amount of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.65,
    "end": 2253.293,
    "text": " N is the number of agents in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.414,
    "end": 2257.457,
    "text": "We saw before the number of transistors, the number of neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.038,
    "end": 2259.58,
    "text": "Phi is the flow of events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.7,
    "end": 2270.231,
    "text": "Let's say if it's a brain, how many, I don't know, information, computational events, or if it's a computer, how many calculations per second it will do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.272,
    "end": 2275.397,
    "text": "And we say that each of those reinforces each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.597,
    "end": 2280.522,
    "text": "So in other words, if I increase the size of the system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.261,
    "end": 2292.175,
    "text": " I'm creating more opportunities for it to restructure itself, to reorganize, to perform its functions more efficiently, that will increase the quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.357,
    "end": 2310.66,
    "text": "But as it increases the quality, it creates shorter paths, it consumes less energy, then it will allow for the system to grow so it could attract more agents and it could perform more events, the flow of events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.163,
    "end": 2326.466,
    "text": " I was always giving to my students when they start a very simple example, and I'll give it here because I know the audience is broad, but I'm based in the Boston area and we had a big project here, which was called the Big Dick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.486,
    "end": 2332.716,
    "text": "Basically, the Boston Highway was the most congested in the country until the 90s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.607,
    "end": 2344.478,
    "text": " and for about 10 years they had to destroy the highway 93 and put another highway underground and new branches but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.42,
    "end": 2357.163,
    "text": " The efficiency of the transportation, getting from one point to the other in the city, was getting so low that the population growth of Boston stopped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.183,
    "end": 2358.786,
    "text": "Nobody was building anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.806,
    "end": 2360.43,
    "text": "And even it started decreasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.47,
    "end": 2362.193,
    "text": "People were exiting the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.213,
    "end": 2364.137,
    "text": "And as soon as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.826,
    "end": 2370.476,
    "text": " So basically, you have that if you fix one of these quantities, you arrest the other, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.318,
    "end": 2380.995,
    "text": "And as soon as people build the infrastructure, they put the new highway, then it became action efficient, like fast and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.33,
    "end": 2398.653,
    "text": " with less expenditure of energy to get from point A to B. And people started moving into the city and building and the population continued to grow until it exceeds the limits, disproportionality values between quality and quantity, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.715,
    "end": 2402.899,
    "text": "And it will stop again and then it will...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.217,
    "end": 2407.122,
    "text": " People will find the need to build a new infrastructure to increase the efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.722,
    "end": 2413.629,
    "text": "So I see those as inducing each other, helping each other in this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.29,
    "end": 2431.35,
    "text": "All right, so in general, let's say if you open a textbook on general systems theory, let's say Bertalanffy, if you have several quantities that are in a positive feedback loop, they reinforce each other, you could model them with...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.415,
    "end": 2455.988,
    "text": " just simple differential linear differential equations where the dot here means the time derivative the rate of growth of alpha the action efficiency the rate of growth of q the total action the rate of growth number of events the rate of growth the number of agents in the system uh and they depend on all of the others right i could increase",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.778,
    "end": 2483.646,
    "text": " alpha or q or phi or n and that will reflect the the growth of of this quantity and this linear system of differential equations it's a very simple system it could be made a lot more complicated with non-linear effects with others but it's complicated as it is so let's start simple the solutions are exponential growth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.959,
    "end": 2506.36,
    "text": " so just if you suppose this positive feedback loop between all of them and you plug them into these equations and you solve the equations each of them alpha q phi n in time it grows strictly exponentially so i'm like aha is there something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.846,
    "end": 2510.09,
    "text": " to do with the acceleration of order in the Universe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.11,
    "end": 2531.233,
    "text": "Are there positive feedback loops acting in all of these different types of systems that make them self-organize faster and faster, like in the cosmic calendar of Carl Sagan, and in the graphs of Ray Kurzweil and Eric Shea's film?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.467,
    "end": 2536.273,
    "text": " Here I put some mathematical details, but if you ask me, I'll go through them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.293,
    "end": 2537.855,
    "text": "But at the moment, I'll skip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.915,
    "end": 2540.738,
    "text": "So basically, these are the exponential solutions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.858,
    "end": 2546.645,
    "text": "Each of them is its initial value time exponent to some number times the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.705,
    "end": 2547.907,
    "text": "So they grow exponentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.968,
    "end": 2559.921,
    "text": "But when you take any of those exponential equations and you combine them, if you ask me, I could go through that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.492,
    "end": 2561.994,
    "text": " And I have them in my papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.074,
    "end": 2568.362,
    "text": "But if you combine them algebraically, you get power-law relationships between those quantities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.283,
    "end": 2569.603,
    "text": "Always.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.484,
    "end": 2576.352,
    "text": "Between alpha and n, phi and n, n and q. And I didn't show the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.472,
    "end": 2577.894,
    "text": "Alpha and q. All of them, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.514,
    "end": 2583.48,
    "text": "So they grow proportional to each other with some power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.562,
    "end": 2586.364,
    "text": "And now I'm going back to the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.85,
    "end": 2614.798,
    "text": " graph with the number of transistors in cpus as their power consumption grows that's a power law the number of neurons in the brain as the power consumption of the brain goes power law i'm like is there any connection here is this signature of this underlying dynamics of this reinforcement between the different characteristics of the system this interdependent mathematical functions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.162,
    "end": 2627.619,
    "text": " And here, just to show something that everybody knows, we plotted the transistor count versus time for CPUs, which is on a log-linear scale, a straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.639,
    "end": 2632.446,
    "text": "That's the same like this graph here, log-linear, straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.466,
    "end": 2634.128,
    "text": "That's an exponential growth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.148,
    "end": 2642.52,
    "text": "So is there something in the growth of computing that is obeying this dynamics, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.54,
    "end": 2643.722,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.474,
    "end": 2645.895,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.876,
    "end": 2673.235,
    "text": "So we think that at least on the first approximation, again, this model could be made with fluctuations, with noise, with other terms, but it seems to be following this predictable mathematical pattern where you could say if those characteristics reinforce each other, they're predicted to grow exponentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.395,
    "end": 2675.278,
    "text": "Then I look at different systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.541,
    "end": 2683.249,
    "text": " and I plot them on log-linear curve, they are straight lines, they grow exponentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.07,
    "end": 2685.873,
    "text": "It predicts power-law scaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.893,
    "end": 2691.179,
    "text": "I look at brains, I look at CPUs, I look at animals, they have power-law scaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.219,
    "end": 2699.99,
    "text": "Jeffrey West had a book in 2017 called Scale, where he has probably thousands of those scaling relationships between different characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.831,
    "end": 2705.637,
    "text": "So is this a signature of some underlying dynamic that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.819,
    "end": 2733.244,
    "text": " drives the systems forward not just describes but pushes them to become more organized and more sophisticated and more evolved right cosmic evolution is the term uh that people uh use like eric shayson and carl sagan and others and um i know the big history community also has contacted me because they're also interested in the same questions like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.629,
    "end": 2737.795,
    "text": " this big history from the big bank until now, why are these events happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.876,
    "end": 2742.32,
    "text": "So could this principle help with that explanation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.183,
    "end": 2748.068,
    "text": "And AIE stands for this average action efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.088,
    "end": 2762.387,
    "text": "Basically, we say that we can use it to measure how close the agents of the system, obeying these physics laws,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.312,
    "end": 2777.491,
    "text": " and also to predict or to determine which will be, if the system continues to evolve, what will be the most efficient state or the most organized state of that system that it will eventually reach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.253,
    "end": 2785.683,
    "text": "So we think that this shows some promise of predictive power of emergent structures, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.703,
    "end": 2790.99,
    "text": "In our simulation, we could predict that if the agents obey",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.207,
    "end": 2800.217,
    "text": " the least action principle that they will start with random state and form a path that is a straight line and there are no obstacles, and they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.639,
    "end": 2813.153,
    "text": "And also explanatory power to obey this principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.575,
    "end": 2818.379,
    "text": "That's why they are self-organizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.699,
    "end": 2819.56,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.974,
    "end": 2848.99,
    "text": " some examples very few examples of size complexity rules it was named in 2002 paper i think by bonner well he has also from 1930 some data but has a lot of data and he compiled from different papers so these are mean techno units per tool in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.695,
    "end": 2857.35,
    "text": " populations in Oceania, predicting technological complexity and the population size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.172,
    "end": 2864.143,
    "text": "I mean, he would look at Oceania because he wants to look at kind of isolated islands, isolated societies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.223,
    "end": 2867.67,
    "text": "Otherwise, you have to consider them as a part of the bigger system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.055,
    "end": 2871.159,
    "text": " And this is a logarithmic scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.179,
    "end": 2873.903,
    "text": "This is also logarithmic scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.484,
    "end": 2879.892,
    "text": "He fits the data with a straight line, which is one of those power law equations that we show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.753,
    "end": 2888.143,
    "text": "Then a different system, number of cell types in biological systems and the total number of cells in those organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.864,
    "end": 2891.548,
    "text": "Very noisy, very dispersed, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.866,
    "end": 2896.132,
    "text": " people have fitted with a power-law relationship, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.172,
    "end": 2900.217,
    "text": "So you have the number of cell types is some measure of complexity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.257,
    "end": 2906.605,
    "text": "You could create different organs, different structures, and the total number of cells is the size of the system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.625,
    "end": 2910.37,
    "text": "The Hegel's quantity-quality transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.39,
    "end": 2915.697,
    "text": "As you increase the quantity of the system, its quality, its structure also is increasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.065,
    "end": 2929.319,
    "text": " About ants, here is number of ants in ant colony on the x-axis, log scale, and the log number of casts in the ant colony increasing with a power-law relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.08,
    "end": 2944.435,
    "text": "Here is from Turchin, the evolution of complex hierarchical society, different countries, population of countries as it grows through time, and hierarchical level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.005,
    "end": 2951.411,
    "text": " in those countries, like different institutions, lock-lock scale, power-law relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.934,
    "end": 2968.067,
    "text": "Here, the lock-up number of occupations in different states of India and the population of the states of India, the bigger the state, the more different, the larger number of different occupations, there are some measure of complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.688,
    "end": 2972.852,
    "text": "And I just even put, because this is interesting, to put together the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.389,
    "end": 3000.544,
    "text": " joint growth of population in the world and GDP per capita and as the size of the world increases in terms of population in blue the GDP growth is increasing in parallel which suggests this coupling this power relationship one is some number times the other and also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.811,
    "end": 3025.232,
    "text": " it shows this exponential or rather super exponential growth our model this simple model predicts exponential which is kind of a similar curve but whatever we look it's it's it's amazing it's everywhere so we looked also at some more kind of simple physical systems with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.271,
    "end": 3047.875,
    "text": " We looked at different stars with one of my previous students, and he measured the progress of nucleosynthesis in those stars in terms of the size of the stars, in terms of the mass as a measure of the size of the stars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.955,
    "end": 3055.624,
    "text": "So the bigger a star gets, the larger fraction of its initial hydrogen it converts to heavier nuclei.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.84,
    "end": 3065.294,
    "text": " And not only it does, it's on a Loc-Loc scale, all of those are straight lines, but it does so in this proportionality relationship, in power-wall scaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.115,
    "end": 3071.784,
    "text": "And the different lines here are just different starting initial fractions of heavier elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.864,
    "end": 3073.967,
    "text": "It's called metallicity in astronomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.28,
    "end": 3101.153,
    "text": " And not only that, but the rate of nucleosynthesis, in other words, the acceleration, how fast they are producing those heavy elements, as you increase the number of solar masses or the size of the star, not only they produce larger fraction of their mass, turn it into heavy elements, but they do it way faster than the slow ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.234,
    "end": 3102.475,
    "text": " produce the small one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.116,
    "end": 3115.629,
    "text": "So we see the power of scaling of the progress of nucleus synthesis as a measure of the complexity of the star in terms of its mass and the acceleration, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.77,
    "end": 3117.612,
    "text": "The bigger they are, the faster they do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.613,
    "end": 3125.46,
    "text": "So it's very exciting that no matter where we look, we see those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.56,
    "end": 3128.203,
    "text": "Probably one could look for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.145,
    "end": 3131.628,
    "text": " exceptions and try to falsify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.708,
    "end": 3139.197,
    "text": "But, um, again, there in Jeffrey West and other books, uh, a lot, a lot of examples of scaling laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.217,
    "end": 3139.558,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.618,
    "end": 3144.524,
    "text": "So let me show you one at, uh, what one of my students did last summer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.544,
    "end": 3156.418,
    "text": "So he did in agent, uh, agent based simulations in net logo, um, with on colony where you have like, um, the foot and the nest and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.652,
    "end": 3159.255,
    "text": " Here I'm showing the 3D version of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.315,
    "end": 3169.346,
    "text": "You could put different obstacles, you could put friction, you could create a maze, you could make it as complicated as you want and ask them to find the shortest path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.187,
    "end": 3176.134,
    "text": "But in the simplest case, this is just the 2D view of the simulation or the version of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.035,
    "end": 3182.181,
    "text": "And here is the world, X and Y, and they would start in green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.341,
    "end": 3186.085,
    "text": "The green answer, the initial state there, we start them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.723,
    "end": 3189.271,
    "text": " totally random, like the gas molecules in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.291,
    "end": 3190.595,
    "text": "There is no structure, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.635,
    "end": 3193.945,
    "text": "And then they randomly pass through the foot and the nest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.965,
    "end": 3195.149,
    "text": "They pick up a pheromone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.911,
    "end": 3198.218,
    "text": "As they move, they drop a little bit of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.025,
    "end": 3208.997,
    "text": " and it evaporates, it diffuses, but if another ant senses that pheromone, it crosses the path, it starts moving along the gradient of the pheromone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.658,
    "end": 3215.144,
    "text": "And in the red here is some intermediate state where they probe several different paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.765,
    "end": 3221.151,
    "text": "So it already looks like with the least action principle where you have several longer paths,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.468,
    "end": 3225.953,
    "text": " And now the ants are exploring them, trying to figure out which one they like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.934,
    "end": 3231.379,
    "text": "And finally, they settle on the one that's closest to the shortest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.439,
    "end": 3232.821,
    "text": "Neither of the long paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.841,
    "end": 3235.845,
    "text": "They don't like the long action paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.965,
    "end": 3241.191,
    "text": "Of course, you have some wiggles here because you have some memory effects which aren't passed where.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.311,
    "end": 3245.856,
    "text": "But in general, if you leave them long enough, they all",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.46,
    "end": 3250.906,
    "text": " like create shorter and shorter path, they will make this line straighter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.467,
    "end": 3255.372,
    "text": "So basically, they'll minimize their action to cross.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.792,
    "end": 3262.361,
    "text": "If you think of a big network with millions of nodes, this will be just two nodes of the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.082,
    "end": 3270.913,
    "text": "And agents in that system, when they're crossing these two nodes out of all possible paths, they'll choose always the shortest one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.953,
    "end": 3274.898,
    "text": "In network theory, you have like geodesic distance, like the shortest distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.878,
    "end": 3304.513,
    "text": " as a measure and here's just how the simulation would run right they'll start randomly and now they totally start again where they are dispersed randomly and then they will explore different paths find the pheromones here is the intermediate stage and finally they'll settle on the poles the closest part to the straight line to the shortest so basically here i'm describing like what happens at each of those steps but i already",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.084,
    "end": 3331.851,
    "text": " went over this but yeah random to forming the final trail and the least action efficiency in the first state when they are moving everywhere and not achieving anything and the highest action efficiency at the end where they're crossing for the shortest time and with the least energy expenditure and this is for those of you that are curious how the simulation window looks like it could change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.029,
    "end": 3335.292,
    "text": " You could put as many parameters as you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.312,
    "end": 3336.013,
    "text": "You could change them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.033,
    "end": 3339.838,
    "text": "You could ask all kinds of questions from this simulation, even though it's very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.019,
    "end": 3344.283,
    "text": "And now what is the action in this case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.343,
    "end": 3348.028,
    "text": "I told you Li is the action integral of the Lagrangian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.048,
    "end": 3356.559,
    "text": "And here in our simulation, we define, all right, so the motion, the velocity of the ants will determine their kinetic energy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.599,
    "end": 3359.262,
    "text": "The mass of the ants times the velocity squared over two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.302,
    "end": 3360.083,
    "text": "That's simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.092,
    "end": 3364.496,
    "text": " And then the potential energy is a little bit more tricky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.616,
    "end": 3372.164,
    "text": "So here we model the potential as effective potential coming from the concentration of the pheromone that they deposit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.184,
    "end": 3377.089,
    "text": "So that's equivalent of information in any other system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.129,
    "end": 3383.376,
    "text": "So the more information there is, the larger this potential and the faster they will form the root.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.157,
    "end": 3390.964,
    "text": "And here, like this exponent is just describing the evaporation rate, or if it's a brain, it will be the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.552,
    "end": 3417.981,
    "text": " forgetting right the memory loss or if it's some other system where the information will deteriorate then there is a diffusion term and this is a random term they they move with a wiggle angle of they don't move always on a straight line because they want to explore the neighboring paths to see if there is a shorter one so in our run they had plus minus 25 degrees at each step they don't just move along the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.961,
    "end": 3446.77,
    "text": " the information the steepest information gradient the steepest concentration gradient but they wiggle a little bit to see well if there is a king here can i find a shortcut can i make it even shorter right so this helps them find the lowest action path but obviously if if there is this random noise this makes this analytically not solvable so the simulation does solve it numerically pretty much right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.509,
    "end": 3470.884,
    "text": " and here is the output from this simulation so we have the average action efficiency at the end when they form the final trail not in the intermediate stages we have other curves for that but this this will be just the final state and here we change the number of hands similar to the number of cells in organisms or number of people in society",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.556,
    "end": 3488.054,
    "text": " And as you increase the size of the system, again, quantity-quality transition, the more ants you put in the simulation, the larger you make that system and that society, the shorter path they find, the more efficient path they find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.094,
    "end": 3491.738,
    "text": "So in other words, in our language, it's better organized, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.798,
    "end": 3494.961,
    "text": "It obeys more closely the physics principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.102,
    "end": 3501.428,
    "text": "And again, like we saw a bunch of other examples,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.319,
    "end": 3506.69,
    "text": " We also found something very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.431,
    "end": 3512.804,
    "text": "So not only, we call that unit total dualism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.845,
    "end": 3516.654,
    "text": "So not, oops, let me go back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.28,
    "end": 3520.463,
    "text": "I will go forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.455,
    "end": 3545.387,
    "text": " right so if we if we look at the entropy the randomness of those ants in the simulation obviously at the beginning they're the most random at the end they have the least randomness the least entropy but let's say the entropy per and the unit entropy and the final entropy for the same quantity entropy we also find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.447,
    "end": 3552.213,
    "text": " power-law relationships on a lock-lock scale, they fall on a straight line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.955,
    "end": 3560.501,
    "text": "And we looked also at the information, the unit information, total information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.182,
    "end": 3572.353,
    "text": "So we think there is something even more important, again, as the size of the system, the total quantity of the system is increasing, the total",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.076,
    "end": 3578.684,
    "text": " macroscopic measures, the microscopic measures change proportionally as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.805,
    "end": 3591.321,
    "text": "And here is the average action efficiency, which will be like the microscopic measure, how efficiently each ant is moving, and the total amount of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.401,
    "end": 3597.209,
    "text": "Again, a power law similar to the CPU or the stellar evolution or any other of the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.411,
    "end": 3601.615,
    "text": "But again, what I mentioned earlier was that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.928,
    "end": 3615.052,
    "text": " We don't want the variation of this average action to be stationary to reach some final minimum, but we want cosmic evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.092,
    "end": 3621.325,
    "text": "We want those systems to keep getting better and better and to transition to more complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.507,
    "end": 3627.418,
    "text": " So a dynamical principle will be that this will not be an equality anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.458,
    "end": 3640.984,
    "text": "The variation will not settle around some minimum value, but it will keep finding ways to shorten this, to decrease the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.69,
    "end": 3650.263,
    "text": " For the broader audience, I'm kind of reminded now, I'm just tempted to say that you probably know of Buckminster Fuller, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.303,
    "end": 3658.957,
    "text": "He built this geodesic dome in Canada, in Montreal for the Olympic Games, and Fuller is the, the Buckyballs are named after him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.997,
    "end": 3669.874,
    "text": "But he also came up with ephemeralization, which the definition is we'll do more with less, more with less, until we could do everything with nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.327,
    "end": 3673.576,
    "text": " So I think this is exactly this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.596,
    "end": 3684.167,
    "text": "We'll do more events with less action, more events with less action until we could pretty much do everything with almost no expenditure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.451,
    "end": 3690.597,
    "text": " I don't know whether that will happen and when it will happen, but I think it's a tractor state, at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.617,
    "end": 3700.766,
    "text": "Even if we don't reach it, I think that's kind of the teleological goal of those systems, to get to this maximum efficiency until they could do everything with nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.147,
    "end": 3711.876,
    "text": "And also here, when I say about unit and total quantities, this dualism, I want to give this example with Javon's paradox, for those of you that are not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3712.548,
    "end": 3716.573,
    "text": " physicists, but let's say this is an economics paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.613,
    "end": 3725.784,
    "text": "Probably all of you have heard that it came from, I think, a long time ago, maybe the 60s, the 70s, when there was the oil shock, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.844,
    "end": 3731.13,
    "text": "And people tried to make more efficient cars because the fuel was very expensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.691,
    "end": 3739.72,
    "text": "And they said, well, we'll save fuel if we increase the efficiency of cars per mile by a factor of two miles per gallon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.392,
    "end": 3748.361,
    "text": " expenditure of fuel or the run of the cars, then we'll use half of the oil in the world and everything will be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.383,
    "end": 3755.81,
    "text": "And when they built those more efficient cars, what they found is that the total amount of fuel expenditure actually increased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.491,
    "end": 3759.655,
    "text": "And they were like, what just happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.235,
    "end": 3766.703,
    "text": "We doubled the efficiency of the cars, we expected to halve the spending for fuel,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.155,
    "end": 3794.631,
    "text": " and the fuel expenditure increased even more and that's why he called that paradox because they couldn't explain it obviously the logical explanation is as people pay less for per mile they'll drive more miles and they'll do more things right but in our languages as you increase the efficiency of the system the system could grow so you'll increase the total action so this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.813,
    "end": 3797.355,
    "text": " I think a feature, not a bug.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.876,
    "end": 3800.719,
    "text": "That's how complex systems work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.48,
    "end": 3803.001,
    "text": "That's how they self-organize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.081,
    "end": 3805.283,
    "text": "It's not a paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.363,
    "end": 3815.013,
    "text": "In our understanding, we think it's a necessary prerequisite for self-organization because they are in this positive feedback loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.213,
    "end": 3817.115,
    "text": "So each of them increases the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.175,
    "end": 3821.479,
    "text": "The efficiency increases the total expenditure, the total expenditure increases the efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.86,
    "end": 3825.763,
    "text": " And here, I'm not going to spend much time on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.783,
    "end": 3844.804,
    "text": "These are just sample runs of the phase transition from disorder to order of different quantities, like entropy, action efficiency, information in terms of pheromone and density and average path time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.645,
    "end": 3852.192,
    "text": "And they show this typical phase transition behavior observed everywhere in physics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.847,
    "end": 3876.964,
    "text": " other systems this graph i showed you earlier just to compare to remind you again of real world systems displaying this unit total dualism or size complexity rule so the stars become more complex as they get bigger but also this is from one of the jeffrey west's paper from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.142,
    "end": 3895.103,
    "text": " like many, like more than 15 years ago, I think 2006, probably is the paper itself, where he looked at the look of the gross metropolitan product of cities as a look of the population of cities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.304,
    "end": 3897.846,
    "text": "And it's on a log-log scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.866,
    "end": 3898.667,
    "text": "It's a power law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.707,
    "end": 3906.917,
    "text": "It's hard to see here, but if you look at the paper in the caption, it's like going at 1.15, the power in that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.454,
    "end": 3909.676,
    "text": " power law relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.697,
    "end": 3915.143,
    "text": "So as cities get bigger, they are producing more per person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.223,
    "end": 3921.53,
    "text": "So the unit productivity is increasing because the total population of the cities is increasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.371,
    "end": 3924.253,
    "text": "So basically there is no paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.833,
    "end": 3925.154,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.174,
    "end": 3932.582,
    "text": "So I tried to bunch here everything together to kind of summarize what I talked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3932.602,
    "end": 3936.887,
    "text": "I hope it's not overwhelming, but a lot of these things we already talked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.289,
    "end": 3938.53,
    "text": " It's kind of a review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.231,
    "end": 3942.594,
    "text": "So here I'm repeating this least action principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.654,
    "end": 3958.689,
    "text": "It's also called Hamilton's principle because he defined it in its modern version where any particle or field in physics will choose the least action path, the red line, which is the straight line if there are no other obstacles, versus all these other possibilities for longer paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.45,
    "end": 3963.373,
    "text": "And when we look at the ANT simulation, they explore these longer paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.433,
    "end": 3965.355,
    "text": "They start with total randomness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.875,
    "end": 3993.469,
    "text": " but finally they choose the one that is shortest with some because they have this wiggle angle this random parameter it's a wider path it's not a straight line but still it's like the shortest possible path that they would take the most action efficient and here i'm repeating this feedback loop between the action efficiency and the size or the quantity and the quality of the system which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.601,
    "end": 3999.226,
    "text": " which predicts this transition from randomness to order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.286,
    "end": 4013.259,
    "text": "And I didn't even show here the exponential transition and the power-law scaling, the quantity-quality transition or the size-complexity rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.279,
    "end": 4015.621,
    "text": "Quantity-quality is the language of Hegel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.302,
    "end": 4018.644,
    "text": "Size-complexity is the language of Bonner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.664,
    "end": 4022.848,
    "text": "Power-law scaling of many people, including Jeffrey West.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.115,
    "end": 4025.458,
    "text": " But they all point to the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4025.518,
    "end": 4030.145,
    "text": "As you increase the size of the system, its complexity or quality is increasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.826,
    "end": 4041.661,
    "text": "And also this unit total dualism, that the unit quantity is proportional by a power law to the total of the same quantity in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.863,
    "end": 4051.755,
    "text": "And we want to think of this principle to minimize action and participating in the positive feedback",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.14,
    "end": 4074.84,
    "text": " loop as the cause of the self-organization and these power law scalings and the structure as the effect and we could make a prediction beforehand solve these equations and we looked at the outcome in the data and we see correspondence so this is kind of a summary of all this thanks and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.36,
    "end": 4087.034,
    "text": " If I have a minute, I could... This kind of the same thing expanded a little bit more, but again, the Hamilton's principle, the shortest path is the physically realized path in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.094,
    "end": 4094.963,
    "text": "The mechanism is this feedback loops between here, a lot more quantities that were measured in our simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.484,
    "end": 4104.675,
    "text": "And this is the entropy change, the phase transition corresponding to the different stages of distribution, finding the structure, which is the shortest path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.364,
    "end": 4105.905,
    "text": " at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.469,
    "end": 4114.078,
    "text": "I don't want to repeat many of the graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4114.358,
    "end": 4121.009,
    "text": "I already mentioned some of them earlier, but here is one by Carneiro.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.029,
    "end": 4126.798,
    "text": "He was an anthropologist, and in 1967 he published a paper where he went to look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.555,
    "end": 4130.981,
    "text": " at indigenous tribes in the Amazon rainforest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.321,
    "end": 4139.074,
    "text": "And he went there because he wanted them, again, like those islands, to be separated, to form like a separate society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.114,
    "end": 4149.811,
    "text": "And he looked at the number of organizational traits that they have, a chieftain, a priest, a tradesman, how many structures they have in the society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.672,
    "end": 4153.056,
    "text": "And on the x-axis is the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.745,
    "end": 4160.819,
    "text": " And he observed that all these villages, autonomous villages as he called them, lay on this power law line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.801,
    "end": 4175.567,
    "text": "And he even wrote that if one of them increased in population and deviated, let's say went in this blank area here, this law is so strong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.172,
    "end": 4187.209,
    "text": " that they either have to form structures to get back to the same power-low line, or if they don't, they will split in two and move back to the line here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.269,
    "end": 4195.522,
    "text": "So they either will go up in complexity or they will go down in size, but they cannot stay away from this power-low proportionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.944,
    "end": 4204.356,
    "text": "So here are some other relationships between action efficiency and entropy difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.994,
    "end": 4207.738,
    "text": " Also power of total action and entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.758,
    "end": 4214.307,
    "text": "We have huge amounts of graphs in the paper from last year with the same title as the talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4215.169,
    "end": 4218.894,
    "text": "And here is with different populations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.974,
    "end": 4223.781,
    "text": "The entropy starts with high entropy randomness and scales down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.943,
    "end": 4230.09,
    "text": "And obviously, even the final state has more entropy for more ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.745,
    "end": 4245.566,
    "text": " but we look at the entropy change, basically the randomness at the beginning and at the end, and with larger population, they decrease, larger decrease in entropy, which is, the reverse is increasing in order as measured by entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.828,
    "end": 4255.34,
    "text": "We could say entropy is a measure of loss of information, right, of uncertainty, so you could convert it to information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.38,
    "end": 4258.845,
    "text": "And to go back to the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.382,
    "end": 4277.205,
    "text": " I told you I was always thinking in terms of this cone where, starting from the beginning of self-organization until today, the systems are growing in size and they are growing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.303,
    "end": 4306.382,
    "text": " in complexity and in quality and that's what is forming this cone this recipro this proportionality between the size of the systems and and their complexity going uh up in this is an arrow of time of increase of complexity and um yeah in our model they grow exponentially so to finish i would say to repeat that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4306.784,
    "end": 4334.614,
    "text": " understand at least action principles predicting the increase of action efficiency because the agents in any system should obey as closely as they can the physics law the physics principles move in the same way as in any other system and that will correspond to increase of structure forming a more efficient organization in terms of action efficiency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.353,
    "end": 4338.096,
    "text": " but it's the average action efficiency for all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.537,
    "end": 4352.831,
    "text": "And then the system of this interconnected characteristics with positive feedback loops predicts the exponential growth and power-law scalings, which we saw in several systems, several examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.872,
    "end": 4360.399,
    "text": "And this complexity size rule, which is a scaling relationship for power-law holds at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.987,
    "end": 4368.697,
    "text": " different levels of organization, physical, like stellar, biological, societal in many systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.919,
    "end": 4384.298,
    "text": "And this unit total dualism of these characteristics also speaks about this connection between kind of microscopic for a single agent and macroscopic for the whole system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.979,
    "end": 4389.525,
    "text": "That system needs to get bigger for its agents to get more efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4389.877,
    "end": 4393.121,
    "text": " and the agents need to get more efficient for the system to grow bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.141,
    "end": 4416.392,
    "text": "And also dynamical action principles, because we have open-ended evolution and it has to go, in the words of Buckminster Fuller, all the way to ephemeralization or to, in the physics language, maybe to zero action or close asymptotically to very, very small action per one event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.693,
    "end": 4418.955,
    "text": "And that we could predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.492,
    "end": 4425.002,
    "text": " that the most action efficiency based on LAP will be the structures that are formed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.406,
    "end": 4434.919,
    "text": "And yeah, so we think that average action efficiency provides this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.186,
    "end": 4461.75,
    "text": " number this measure we could take two systems and we say this system has organization which corresponds to this number of action average action efficiency and this has a lower or higher number so it's less organized or more organized so we could quantify it and we think that this potential may have implications across disciplines as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4462.473,
    "end": 4466.379,
    "text": " As people say, if you cannot measure something, you cannot improve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.459,
    "end": 4474.591,
    "text": "So we need a number, a measure for how organized is the system, instead of just saying this looks more complex than the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.773,
    "end": 4486.77,
    "text": "And in future work, we think that this model could be extended to different types of complex systems, let's say with modeling, with friction, with dissipation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.411,
    "end": 4489.594,
    "text": "We could look at other quantities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.198,
    "end": 4516.51,
    "text": " and also we could test it for more specific like either biological or social systems let's say can you model a photosynthetic or crap cycle in biology or metabolic cycles and also in technology if nature uses those optimization principles how can we use them to build more efficient cities more efficient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.608,
    "end": 4524.16,
    "text": " internet structures, communication technologies, robotics, and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.18,
    "end": 4525.402,
    "text": "So I'll stop here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.442,
    "end": 4527.024,
    "text": "Thanks for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.026,
    "end": 4532.533,
    "text": "And if you have any questions, I'll be happy to talk more about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.735,
    "end": 4537.1,
    "text": "Sorry if I took too much time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.28,
    "end": 4537.701,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.721,
    "end": 4539.784,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.085,
    "end": 4540.185,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.228,
    "end": 4541.588,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.829,
    "end": 4546.654,
    "text": "Anyone watching live can add a question in live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.674,
    "end": 4557.907,
    "text": "I guess just while I'm recropping everything, how did you come to this question and what does research in your lab look like for yourself and for students?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.59,
    "end": 4562.612,
    "text": "Well, how did I come to this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.712,
    "end": 4564.194,
    "text": "It's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.095,
    "end": 4570.341,
    "text": "I could just tell you, if you really want to know, I was in high school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.81,
    "end": 4579.051,
    "text": " And I'm walking in my hometown, it's a city, but small city, 200,000 people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.091,
    "end": 4587.773,
    "text": "And I'm looking, I'm kind of imagining it historically having this small population, dispersed houses, and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.225,
    "end": 4614.79,
    "text": " bigger buildings and bigger buildings and i'm like all right if you go to new york city you'll see this hundred story skyscrapers so you have this increase of density and decree that means decrease of distance between the points in the system right to so not only you get more efficient paths but the end points are getting closer and closer so that even",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.192,
    "end": 4620.559,
    "text": " We didn't even talk about that, to increase the efficiency by shortening the paths, by getting the points closer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.639,
    "end": 4630.593,
    "text": "Like in CPUs, we make the kind of transistor smaller and you decrease the distance between them for the computation, that increases even more the action efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.354,
    "end": 4633.697,
    "text": "And I'm like, what is going on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.777,
    "end": 4635.279,
    "text": "Where, how does it go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.299,
    "end": 4639.545,
    "text": "I was imagining maybe in the future, the whole city will fit in one building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.065,
    "end": 4642.33,
    "text": " which will be the ultimate efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.43,
    "end": 4644.514,
    "text": "Everything will be as close as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.534,
    "end": 4658.682,
    "text": "It will take the least time to get from here to there, which now if you look at the Dubai buildings or some others, they host pretty much whole cities, I think may have already happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.758,
    "end": 4663.945,
    "text": " And that could explain why in the world people will build such buildings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.085,
    "end": 4675.382,
    "text": "In my language, that will be to increase the interaction or to decrease the time and energy that it takes for people to communicate or to get in touch with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.402,
    "end": 4681.632,
    "text": "Obviously, now we have internet, we can talk to anybody, but we still use physical kind of presence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.966,
    "end": 4690.395,
    "text": " And then I started, like, I was reading then at that time, like, dialectical kind of philosophy and Hegel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.455,
    "end": 4696.622,
    "text": "And I'm like, oh, if the city is getting bigger, there is a quantity-quality transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.742,
    "end": 4698.444,
    "text": "It's getting more efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.524,
    "end": 4699.845,
    "text": "People are closer together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.865,
    "end": 4701.507,
    "text": "They exchange more information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.248,
    "end": 4704.13,
    "text": "They create more inventions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.31,
    "end": 4707.113,
    "text": "They build better structures, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.937,
    "end": 4734.568,
    "text": " and then i but there wasn't that was i'm talking about the 80s obviously there was the santa fe institute but it was here and i was in bulgaria and that was behind the iron curtain so i couldn't do anything in complexity or in this kind of line of research so i went to study physics because i thought okay if i if i want to explain why these systems are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4735.088,
    "end": 4763.138,
    "text": " self-organizing how they are self-organizing probably i need to know all these basic principles then i came to the us to study and i did my phd at tufts university in physics i did a postdoc at northeastern physics and then i went teaching and and even for my phd and postdoc i couldn't do anything in complex systems so i had to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4764.029,
    "end": 4770.98,
    "text": " any other kind of physics that will give me a PhD and a postdoc and a faculty position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.12,
    "end": 4783.338,
    "text": "And now after I got those and I got tenure and promotion, I could kind of work full-time or think full-time about those issues, which gives me a great pleasure now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4784.32,
    "end": 4788.586,
    "text": "So yeah, my question always has been about why is this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.087,
    "end": 4790.509,
    "text": "What's going on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.232,
    "end": 4806.996,
    "text": " what's this magic that's happening that gives us this world instead of a universe filled with hydrogen atoms randomly dispersed everywhere or empty space why in the world they built us how yeah so that's my motivation pretty much",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.444,
    "end": 4811.329,
    "text": " Yeah, very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.529,
    "end": 4815.075,
    "text": "I really appreciated the Buckminster Fuller connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4816.057,
    "end": 4825.693,
    "text": "And it's very intriguing that the path of least action follows a geodesic in arbitrary state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.808,
    "end": 4853.065,
    "text": " on kind of like a curved trajectory for example the ant example it wasn't a straight straight line it still had a little wiggle that would be in tension between the attractive uh character of the pheromone and how much variability and movement like all those different features and so but yet across many replicates of the simulation you would get a straight line",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.787,
    "end": 4874.04,
    "text": " yet every single line in practice is gonna it's or it's like it's like jumping rope it's like the average is flat but that's something that arises not necessarily even at every collective behavioral level more like a across scenario",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.286,
    "end": 4903.69,
    "text": " mean fields or or central limit theorem type results that gives an orderly straight line through all the curves and so that for that to be manifested in geodesic architecture with tensegrity and then also to it's very provocative fuller talked about people traveling more and he said well people were in the horse and cart and then now there's the car the car and then the plane",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.906,
    "end": 4929.238,
    "text": " then what's interesting is it goes up and up and up but then it can't always and now average travel for example might be i don't know maybe it's dropping so how do we reconcile these smoothly fitting curves with balancing knowing that like not everything can curve in that regime forever",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.67,
    "end": 4935.338,
    "text": " So what is it that switches regimes of coherent scaling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4937.282,
    "end": 4939.286,
    "text": "Well, thank you for that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.366,
    "end": 4949.163,
    "text": "Yes, I want to go back to my example that I gave with the Boston Highway, the big dick, as we call it here, because it was a big mess while they were doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.344,
    "end": 4951.227,
    "text": "But I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.763,
    "end": 4968.355,
    "text": " that's why i kept repeating that this is the first approximation of this model so this smooth exponential and power law curves uh if we look more carefully at data um actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.427,
    "end": 4978.939,
    "text": " I think they have a sinusoidal kind of looking like oscillation around the exponential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.66,
    "end": 4980.801,
    "text": "And I'll say what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.582,
    "end": 4992.037,
    "text": "When I said, let's say, what caused people to build the new highway, the big, the new infrastructure that will increase the action efficiency?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.057,
    "end": 4993.779,
    "text": "Well, that was the population pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.799,
    "end": 4995.962,
    "text": "You got more people, you got more congestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.364,
    "end": 5018.052,
    "text": " but that has a time delay they can't build it in real time right you get five more people you build another five miles of highway or something right so you have to wait to some threshold and i think um yeah the infrastructure reaches some level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.69,
    "end": 5043.685,
    "text": " and then it waits until the pressure is large enough to push it to the next level so it it has to almost in in this case with the congestion it's almost like a a crisis like you have for this impossible way to live and you have to do something but i think there is this lack between all those uh characteristics they don't just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.968,
    "end": 5064.897,
    "text": " smoothly as you said correctly and you observed correctly they don't smoothly incrementally increase each other and grow proportional all the time but i think they go in this multiple logistics transitions right so they have a transition to a new level and stop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5065.467,
    "end": 5071.112,
    "text": " and then wait until the rest of the system grows to that level, the rest of the characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.673,
    "end": 5074.255,
    "text": "And then there is another transition and it stops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.276,
    "end": 5077.778,
    "text": "And this way they build this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.139,
    "end": 5092.291,
    "text": "And even Ray Kurzweil in his book, The Singularity is Near has exactly that figure or similar figure at the beginning where he has this sequential transitions between different computational platforms, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.372,
    "end": 5092.892,
    "text": "Let's say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5093.429,
    "end": 5105.851,
    "text": " At the beginning, people will do calculations with abacus for hundreds of years, and then they'll do with mechanical calculators, then with relay tubes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.871,
    "end": 5113.905,
    "text": "But between them, there is kind of a very fast jump, and then they plateau for a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.566,
    "end": 5117.631,
    "text": "So I think this is the real picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.134,
    "end": 5145.272,
    "text": " and we're working how to put that in the equation how exactly to reflect this in the model but that's you're very correct yeah so i guess sort of in closing as we look at on one hand the decades of systems theory and multi-scale complex systems analysis agent-based modeling etc that brought us here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.252,
    "end": 5152.522,
    "text": " And we look forward, like over the coming few years, what are you going to be looking for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5152.582,
    "end": 5156.829,
    "text": "What do you feel like your own research may yield?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.57,
    "end": 5163.498,
    "text": "Are there events that you anticipate that you feel would provide important validation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.079,
    "end": 5171.85,
    "text": "Are there tool developments or what will those advances in tooling or development provide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.838,
    "end": 5175.7,
    "text": " Yes, thanks for the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.801,
    "end": 5180.166,
    "text": "It's very, very, probably the most important question that is spot on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5180.947,
    "end": 5195.206,
    "text": "So I'm asking myself that every day, why the problem of self-organization and order increase in the universe hasn't been solved so far, or a hundred years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.167,
    "end": 5203.356,
    "text": "And I think the main obstacle is that non-equilibrium thermodynamics hasn't been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.264,
    "end": 5232.533,
    "text": " fully developed and we need it in order to understand what's happening in systems away from thermodynamic equilibrium we know what happens in thermodynamic equilibrium nothing everything's the same but the interesting things happen away from thermodynamic equilibrium we don't have a good theory for that there are many attempts but what is giving me a great hope is the following that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5232.833,
    "end": 5253.103,
    "text": " And I think the reason that non-equilibrium thermodynamics has not been developed, I'll sound now very particular to my interest, but I have hope that there is something true to that, is that the least action principle itself, which describes how all objects move,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5254.315,
    "end": 5259.302,
    "text": " has not also been used and extended to its full power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.203,
    "end": 5276.225,
    "text": "And what I mean by that is that most areas of physics, people are interested in just the conservative least action principle, which is kinetic minus potential energy, no dissipation, no randomness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5277.066,
    "end": 5281.572,
    "text": "Obviously, there are areas like plasma physics, fluid dynamics, where you have those effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5282.362,
    "end": 5299.662,
    "text": " but recently there have been enormous there has been enormous progress in including all the dissipation and in randomness terms in least action principle and um andres um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.671,
    "end": 5328.205,
    "text": " in 2017 provided a derivation of the maximum entropy production principle from the stochastic dissipative list action principle, which is a major, that's the maximum entropy production is one of the major debates, because there are a lot of people that point to different exceptions, but for many people, it's the main driver for self-organization of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5328.966,
    "end": 5330.087,
    "text": "But I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.337,
    "end": 5342.695,
    "text": " Actually, we're working on that too, that maximum entropy production is a consequence of this increased efficiency and transport of energy through the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.256,
    "end": 5347.161,
    "text": "And as the system becomes more efficient, it could absorb more energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5348.083,
    "end": 5350.506,
    "text": "Jeremy England talked a lot about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.925,
    "end": 5377.776,
    "text": " and it could dissipate dissipate that energy faster and on top of that the system grows as we saw in our model with this interconnected characteristics so i think that the maximum entropy production yes it correlates with increased uh structure and complexity and efficiency but i think it's the byproduct kind of the exhaust of this underlying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5378.633,
    "end": 5388.415,
    "text": " The driving force is not... In other words, what I want to argue is the system expels the entropy in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.435,
    "end": 5393.707,
    "text": "So you could ask the question, what benefit does the system have of this expelled entropy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.727,
    "end": 5396.753,
    "text": "If anything, it raises the temperature of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.814,
    "end": 5398.397,
    "text": "It's detrimental, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.85,
    "end": 5407.085,
    "text": " But what the system benefits from is absorbing more energy so it could use it to create better and more efficient structures inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.666,
    "end": 5414.698,
    "text": "And it also benefits from minimizing the length of the trajectories and the friction along them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.678,
    "end": 5420.467,
    "text": " to perform its functions more efficiently with less energy expenditure and faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.188,
    "end": 5432.586,
    "text": "And I think these connections between the expanded dissipative and stochastic least action principle and its application to non-equilibrium thermodynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.241,
    "end": 5457.325,
    "text": " and from there its application to biological and social systems and hopefully the brain it's not there yet but i see a lot of papers recently defining and working i've seen least action principles defined for neural networks for for ai for all kinds of systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.305,
    "end": 5485.725,
    "text": " and i think people are converging on this opinion that we need to look at at something objective that is the systems are having a goal to to get to this most efficient state they're not just randomly exploring the space they're moving in a direction so so my hope is that by developing this theory collectively many people from many different areas surely to have a coherent theory of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.532,
    "end": 5510.869,
    "text": " self-organization in all of the systems and also to add that i think a lot of things have been rediscovered in a lot of areas i mentioned optimal control theory yeah it's based on the least action principle it's used in economics and in social systems it's optimizing for different characteristics that i mentioned in the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5511.895,
    "end": 5524.978,
    "text": " But very few people in physics are interested in it because they say, oh, we're interested in atoms, molecules, like fields and all these other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5525.619,
    "end": 5527.643,
    "text": "Somebody else should deal with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5527.623,
    "end": 5553.107,
    "text": " and at the same time a lot of the biologists and people they're extremely smart people but but we are limited in our brain capacity we can be experts in every field i i'm not an expert in chemistry and in biology so somebody in other field will may not be expert in physics so it's hard to make this interdisciplinary connections we talked a little bit earlier about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.475,
    "end": 5569.212,
    "text": " this empty area between the disciplines, because we are so specialized in our own areas and we have very limited brain capacity to become absolute experts in that next area and make that connection, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.893,
    "end": 5575.218,
    "text": "And that's why there is so much in between that we haven't explored yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5575.398,
    "end": 5577.16,
    "text": "And I think that's where the answers are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.121,
    "end": 5580.324,
    "text": "That's why I'm interested in this field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5581.125,
    "end": 5581.525,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.078,
    "end": 5603.783,
    "text": " a lot a lot of interesting pieces there what does the environment as we see order emerge you know as we see a crystal precipitate out of the solution it's easy to say how the crystal changes and grows and scales but what does the surrounding get is it getting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5605.163,
    "end": 5612.622,
    "text": " Is it taking the loss and it is getting disordered or does it become more ordered as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.126,
    "end": 5616.692,
    "text": "Because it's topological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5617.162,
    "end": 5631.831,
    "text": " more dynamic properties also become richer through re-entry of interactions with increasingly sophisticated systems like ants modifying the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5631.871,
    "end": 5632.893,
    "text": "That's a key piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5633.414,
    "end": 5639.406,
    "text": "You get certain mean field behavior and central limit their behavior from flocks of birds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5640.5,
    "end": 5662.305,
    "text": " However, you get another broader category with pheromone and niche modification, because the special case of niche modification is just not doing it, at which point it's more like a transient process, rather than something that has this historical element, and so certainly the dynamics of life on Earth have been shaped",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5662.285,
    "end": 5690.824,
    "text": " by oxygenation events and by changes and all these different things as well so the question of whether the environment is sort of like soaking up or possibly even it's like a double downhill and they're both coming to game i think yeah this is your spot on yeah that's the most important question this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.108,
    "end": 5694.452,
    "text": " I guess, at the heart of the active inference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.533,
    "end": 5707.409,
    "text": "How the system reflects and how closely reflects its surroundings and how the internal structure kind of corresponds to that environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.73,
    "end": 5711.455,
    "text": "And I think, yes, they grow in tandem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5712.716,
    "end": 5719.225,
    "text": "They become more complex because even in an ecosystem,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5719.677,
    "end": 5742.445,
    "text": " right every time let's let's imagine one species has a mutation that makes its metabolic cycle twice as efficient to produce atp than another species obviously they allowed compete them because they need half of the food to do the same things right and if there is drought they will survive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5743.133,
    "end": 5769.04,
    "text": " but that will change the whole ecosystem so now all the other species will see a different environment obviously that will create this entropy mismatch between the prediction what they know the system is but it changed meanwhile so they need to adapt to the changes and in this adapt adaptivity to adapt they have to change their own internal structure right so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.577,
    "end": 5791.863,
    "text": " I talked only about the internal structure in this simulation and what's happening inside the system to function, but it's paramount to not forget that all that happens in the system is based on what's happening in the environment outside of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5793.004,
    "end": 5795.247,
    "text": "If you stop the energy inflow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5795.429,
    "end": 5816.863,
    "text": " uh the system the interior will disintegrate right so it has to find the energy from somewhere and um information plays absolutely crucial role in fact action in living systems at least cannot be minimized without information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.248,
    "end": 5821.975,
    "text": " Let's say if you think about the simplest of the simple, let's say a simple bacterium, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5822.055,
    "end": 5822.876,
    "text": "So it will move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5823.377,
    "end": 5827.843,
    "text": "It will have sensors for lights or for a chemical, which is food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5829.005,
    "end": 5831.548,
    "text": "But what is the sensing of light mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.689,
    "end": 5834.973,
    "text": "Well, it means it has information where the sun is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5836.015,
    "end": 5838.278,
    "text": "So it needs to, let's say, photosynthesize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.22,
    "end": 5867.725,
    "text": " and then it has so if it did not have that sensor and it has to find where there is more sunlight it pretty much has to move randomly like the ants at the beginning of the simulation but that's the maximum action path so it will spend all of its energy before it finds his food so it will die but knowing where the food is the the end point it could move more or less on a straight line maybe like the ants with a little wiggle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.16,
    "end": 5871.985,
    "text": " but it will get to the food the fastest way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5872.025,
    "end": 5883.28,
    "text": "And maybe if you have two different bacteria and one is more sensitive to light and it moves on a shorter line, it will get there first and it will out-compete the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5883.3,
    "end": 5891.09,
    "text": "So I think the information is the mechanism through which organisms could find the shortest action path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5891.11,
    "end": 5893.233,
    "text": "Yeah, there's a lot I could add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.914,
    "end": 5895.636,
    "text": "I think part of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5897.253,
    "end": 5922.754,
    "text": " mystery there is let's just say the first bacteria to get there died or it modifies it so that a second bacteria can come something like that yeah so then there's some fitness function geodesic path of least action that may or may not have a sort of monotonic relationship with any given phenotype",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5924.084,
    "end": 5936.681,
    "text": " So how to understand the phenotype distribution as taking a path, but not necessarily doing what it first, at first glance, appears to be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.502,
    "end": 5940.226,
    "text": "Like, for example, you mentioned enzymes, efficiencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.847,
    "end": 5942.529,
    "text": "So that's like the futile cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.85,
    "end": 5947.696,
    "text": "It's like, why are there enzymes that are both phosphorylating and dephosphorylating something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5947.837,
    "end": 5948.658,
    "text": "Isn't that a waste?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.178,
    "end": 5953.264,
    "text": "And it's like, well, yes, if you never had to switch gears, it would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.784,
    "end": 5966.055,
    "text": " wasteful but if you need to have some agility then you want to have both lanes going even if you pay a small cost to keep both of the directions open",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5966.812,
    "end": 5979.503,
    "text": " So then it's like, again, there's some fitness maximizing strategy that doesn't necessarily involve what appears to be maximum efficiency on enzyme synthesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5980.284,
    "end": 5989.592,
    "text": "But it's like, yet we know what's here must reflect some draw from that space of paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.014,
    "end": 5995.958,
    "text": "But it might be a very curvy line itself relative to that imaginary straight line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.102,
    "end": 6024.426,
    "text": " and that line might not be doing what we think it's doing but we can hypothesize that it is there and that discovering it or inferring it would give us deeper insight than merely describing using descriptive statistics i agree with you that uh well i would go to the ashby's law of uh requisite variety right that uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6024.608,
    "end": 6042.128,
    "text": " The way I understand it is the internal structure of the system has to reflect the variety of the environment to have a chance to survive or to match that complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.665,
    "end": 6050.397,
    "text": " But in your question, the way I understand your question is, it sounds like a redundancy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6050.458,
    "end": 6062.898,
    "text": "You have two processes that in some situation one could be turned on, in another situation a different could be turned on, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6064.801,
    "end": 6068.166,
    "text": "And I see that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6068.382,
    "end": 6097.545,
    "text": " so that's that's the next level of theory right you could say well i mean yes you're right this system is not doing just one thing but today it could be in one environment tomorrow it could be in another environment right so um let's say in the summer it's hot here you need one kind of clothes in the winter it's cold so you can't have one optimization function for all of them so you have to match but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.116,
    "end": 6127.971,
    "text": " in all of these cases let's say the environment changed and now you have to switch gears to this other mechanism i don't know if it corresponds i'm not a biologist but i know that gene expression like the uh is the the way that like you have all the information in the dna but at any given moment you need small part of it and you turn only this gene only that gene depending on what the organism needs at that time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.44,
    "end": 6151.0,
    "text": " So I think this provides this flexibility when the environment changes for that organism to be able to do, I hope, the best or the most efficient thing for that new situation, keeping the other mechanism just in case when it goes back to the previous one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.3,
    "end": 6152.982,
    "text": "So there is some memory effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6153.262,
    "end": 6156.945,
    "text": "It knows that things will change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6157.297,
    "end": 6166.969,
    "text": " Yeah, I guess to sort of close with another Buckminster Fuller quote, he said, all known cases of extinction are due to specialization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6167.641,
    "end": 6191.438,
    "text": " and it's sort of like yeah even if the bacteria is at 97 degrees and it's adapted there forever and then the niche changes to 92 well either it has the plasticity at the individual or the population level to adapt or it was specialized to 97 and then it went extinct so it's kind of like right there is that trade-off because you do better and better more efficiently",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6191.418,
    "end": 6205.748,
    "text": " but then you become a specialist you become tenure track 97 degree thermal bacteria and it becomes hard to pivot and then fitness is decreased in the system becomes fragile again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6206.909,
    "end": 6224.31,
    "text": " Yeah, I think the next level you asked me the first question about the extension of this theory or many other approach will be to, let's say here, I always say this is very simple, like two nodes, very simple case, very first order approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6225.337,
    "end": 6238.818,
    "text": " I'm looking, because we haven't described it so far, and I'm trying to see how this principle could apply to the simplest case of minimization of one process for action, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6238.838,
    "end": 6249.755,
    "text": "But when the system, let's say, over the year, there may be, or over the day, a hundred changes in the environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.775,
    "end": 6251.918,
    "text": "Let's say a bacterium could sit in a pond,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.573,
    "end": 6260.784,
    "text": " and there could be sunlight, then there could be some chemical coming, then there could be another chemical, then there could be some perturbation, then there could be heat wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6261.465,
    "end": 6267.213,
    "text": "And if it, you said just a second ago, if it cannot respond to any of those, it will die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6268.175,
    "end": 6271.519,
    "text": "So what will be the overall efficiency?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6272.02,
    "end": 6278.889,
    "text": "This will be another super kind of efficiency for all of these different processes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6279.75,
    "end": 6280.892,
    "text": "So in other words,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.256,
    "end": 6306.829,
    "text": " if the system cannot respond to one of these let's say some chemical change it means that when the input comes it it cannot efficiently process it or turn it into something useful i don't know how to describe it because it's like in biological terms but uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6307.028,
    "end": 6325.516,
    "text": " That will be an inefficiency in my understanding that it will kill the system because it will spend huge amounts of time and energy to defend itself, but it cannot find the shortest way and it moves around and around and around and it exhausts all of its energy and dies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6326.558,
    "end": 6328.641,
    "text": "But it has to be able to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6328.701,
    "end": 6333.829,
    "text": "It has to be able to do this in all these different situations and instances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6335.26,
    "end": 6337.443,
    "text": " And obviously organisms die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.563,
    "end": 6342.509,
    "text": "They can't always adapt to... They are not always prepared for all situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6343.37,
    "end": 6345.673,
    "text": "There have been millions of extinction events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.833,
    "end": 6353.763,
    "text": "Many species are not adapted to the human activity today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6354.705,
    "end": 6356.627,
    "text": "One inefficiency in one aspect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6357.316,
    "end": 6365.025,
    "text": " Maybe it's a good way to put it, it's enough to kill the organism for that time frame that it happens, and that's very unfortunate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6365.926,
    "end": 6368.909,
    "text": "Yes, most ant species are extinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6369.85,
    "end": 6373.434,
    "text": "The ones that are here, they're awesome, but most of them are extinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6374.355,
    "end": 6383.345,
    "text": "Yeah, they have probably learned to respond to a huge variety of changes in the environment and survive, be robust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6383.365,
    "end": 6386.749,
    "text": "That's the question about robustness, resilience, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6387.539,
    "end": 6417.512,
    "text": " yeah redundancy in the system to ensure that yeah a lot more layers on top of this theory that i talked about cool well thank you again for the presentation hope to hear updates on the research and and from your group so thank you very much well thanks daniel and hopefully i would have a chance to talk again in the future and i'll update you if i have something new awesome bye bye",
    "speaker": "SPEAKER_00"
  }
]