[
  {
    "start": 1.414,
    "end": 1.994,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2.214,
    "end": 4.055,
    "text": "Thanks for joining or listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.775,
    "end": 19.42,
    "text": "It's November 11th, 11-11-22, and we're in cohort two of the Active Textbook Group, having a discussion of chapter five, exploring some topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.301,
    "end": 26.323,
    "text": "There are some questions that have been written in comments as well, and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.396,
    "end": 33.503,
    "text": " taking it wherever we want as we review the first half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.364,
    "end": 35.766,
    "text": "That'll be today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.828,
    "end": 44.018,
    "text": "And then next week, we'll be taking an even further step back into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.648,
    "end": 55.91,
    "text": " and more of a focus on like feedback, completing the feedback form, how can we improve and structure future textbook group cohorts, project ideas, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.67,
    "end": 58.43,
    "text": "But for today, we're in chapter five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.191,
    "end": 72.573,
    "text": "So does anyone want to give any thoughts or comments or just initial questions to raise about chapter five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.369,
    "end": 103.817,
    "text": " all right then let's go into the written questions okay how does the simple hierarchy with one-to-one mapping between levels as shown in the left-hand side of figures four four or six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.951,
    "end": 143.557,
    "text": " and 5.2 okay four four four six five two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.369,
    "end": 171.322,
    "text": " relate to actual brain hierarchies such as the classic fellerman and van essen diagram from retinal ganglion cells up to hippocampus with many to many mapping between regional units ah i guess this is the famous diagram",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.892,
    "end": 206.532,
    "text": " well what do people think how do these seemingly skyscraper-like hierarchical models this one is laid out side to side but we can see ascending and descending so this could have been graphically laid out like this and then another one and then a third one on top of course top down bottom up are just spatial metaphors so um how do we reconcile",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.178,
    "end": 232.977,
    "text": " computational hierarchical models with the empirical structural connectivity of the brain, which has a wiring structure looking like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.997,
    "end": 236.58,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.526,
    "end": 256.268,
    "text": " between these two kinds of icons or kinds of maps, because on one hand, we have a kind of relational map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.148,
    "end": 262.669,
    "text": "And on the other hand, there is a kind of architectural slash functional mapping of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 263.269,
    "end": 275.312,
    "text": "So for example, if we look at a circuit map of the of an electric circuit, there's, we have a relational map there, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 275.772,
    "end": 275.972,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.66,
    "end": 289.367,
    "text": " when we want to implement that circuit, I mean, in terms of wiring and so on, we need to have another kind of map, which is architectural one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.688,
    "end": 305.156,
    "text": "So, of course, in some cases, there's a possibility of translating one map perfectly onto the other, but there isn't necessarily an isomorphism between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.692,
    "end": 331.721,
    "text": " those two kinds of map and i think in this case we don't necessarily see that isomorphism here as well excellent great answer totally agreed these kinds of diagrams are often described as hierarchical or heterarchical or people use different um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.779,
    "end": 338.483,
    "text": " words to describe it, but it's describing the anatomical connectivity of different brain regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.125,
    "end": 348.931,
    "text": "Whereas the diagrams that are shown in these figures that were mentioned in the question are not anatomical regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.332,
    "end": 352.014,
    "text": "They're statistical variables connected by edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.356,
    "end": 358.078,
    "text": " This is the difference between structural and effective and functional connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.779,
    "end": 365.702,
    "text": "Structural connectivity is what pieces are actually put together and through direct contact intermediating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.542,
    "end": 372.305,
    "text": "Whereas functional connectivity has to do with the statistical relationships in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.265,
    "end": 379.969,
    "text": "And those are not necessarily for a given set of measurements or spatial or temporal scale or experimental stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.509,
    "end": 382.47,
    "text": "Those are not exactly the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.407,
    "end": 388.849,
    "text": " There are cases where there are, but that doesn't mean that in general, they're the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.55,
    "end": 393.911,
    "text": "So how do they relate to quote actual brain hierarchies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.932,
    "end": 406.276,
    "text": "They relate to each other in the way that Ali just described, similarly between architectural diagram and a functional diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.538,
    "end": 412.359,
    "text": "Does anyone have any other thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.386,
    "end": 418.006,
    "text": " Yeah, Giuseppe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.308,
    "end": 423.75,
    "text": "Yeah, I think that is a very good explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.83,
    "end": 438.538,
    "text": "On the other hand, I think that at that stage of the description, the idea was to see how active inference could also provide a process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.598,
    "end": 445.122,
    "text": "So basically to see how this inferential mechanism may be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 446.044,
    "end": 474.946,
    "text": " implemented in the neural circuits so yes the two are not completely the two descriptions are not isomorphic but i think there should be some degree of of agreement and in this case i think that what may be masking the the the similarities or the the potential overlap is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.506,
    "end": 505.207,
    "text": " you know, there's a big difference in the degree of complexity of the, so one is a very simple, the active inference diagram is a very simple sketch of a very simple microcircuit while this one is a big architecture with a lot of complexity and it's difficult to go in and say, you know, to map exactly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 506.294,
    "end": 526.37,
    "text": " those kind of microcircuits within this large circuit scheme, probably there is going to be various microcircuits in there with the various degrees of hierarchical structure within that large scheme, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.433,
    "end": 540.689,
    "text": " yeah um all great points the figures that were pointed to reflect like just simple illustrative examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.84,
    "end": 553.943,
    "text": " Whereas the whole brain or many of the regions of the brain, if one were to even just describe this with an active inference model, it wouldn't look as simple and narrow as these previous figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.103,
    "end": 555.684,
    "text": "So it's a different type of diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.284,
    "end": 557.044,
    "text": "It's a different scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.084,
    "end": 568.107,
    "text": "Yet through visual and prose-based argumentation, as well as the hopes and dreams of a field,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.5,
    "end": 581.082,
    "text": " is that there is a relationship between the messages that are passed between different variables statistically, which as we discussed last time, you could arrange these in a hexagon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.402,
    "end": 586.203,
    "text": "It wouldn't change the topology and thus the function of the base graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.023,
    "end": 597.505,
    "text": "However, it is being laid out in a specific way to demonstrate resonance with given cellular populations in a cortical column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.894,
    "end": 612.958,
    "text": " So it's kind of situational to what extent the structural neuroanatomy aligns with the Bayes graph as specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.238,
    "end": 620.8,
    "text": "But we can definitely say that they're not the same thing, that they don't have to be the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.061,
    "end": 626.322,
    "text": "But there's also situations where by graphical design,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.671,
    "end": 639.521,
    "text": " Using that in multiple ways, meaning you could constrain your construction of the base graph such that it has some structural patterns with the anatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.201,
    "end": 642.844,
    "text": "And then also just in terms of like visual graphical design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.993,
    "end": 654.201,
    "text": " Like you can just lay it out visually because this is not, these aren't, it's not exactly like there's five and then three, like there's other things that are here that aren't shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.362,
    "end": 659.685,
    "text": "So like this is a course mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.092,
    "end": 671.134,
    "text": "Any other thoughts on this question asked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.674,
    "end": 700.99,
    "text": " just really briefly, I feel like the 30 millionth of view of the like structural constraints is that in the general case of a Bayes graph, you're well in active inference, we're talking about like a Markov chain or some blanket that is kind of ultimately the state space kind of, which is included in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.771,
    "end": 701.851,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.144,
    "end": 727.617,
    "text": " If you're trying to map that to a brain or any kind of system with discrete units that are close sometimes and not so close, then the arrangement of those will constrain necessarily the Bayes graph to some degree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.978,
    "end": 732.72,
    "text": "If they're right next to each other, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.459,
    "end": 757.96,
    "text": " there's going to be a greater chance that they are independence, some sort of dependency relationship, even if we like disparate, you know, far away neurons are actually more strongly correlated, they will have to travel through those in some sense, the network there, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.442,
    "end": 760.622,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.592,
    "end": 779.604,
    "text": " I'm not sure if that's clear, but what I'm saying is that the physical proximity and adjacencies in a physical system kind of partially correlate to something like a Markov blanket, like the constraints, the possible operation in the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.581,
    "end": 809.947,
    "text": " yes it can and also this was a major topic in the recent 51 live streams like we talked about how different by like the pomdp structure partially observable markov decision process structure or just generally the active bayesian graph representation of a generative model that's not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.283,
    "end": 833.15,
    "text": " the anatomy that would carry out that model you would need to make a neural network with a totally different connectivity to implement that model and so we discussed how do you get from a stated base graph to a neural network architecture that carries out that computation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.017,
    "end": 845.325,
    "text": " which helps integrate it more closely with experimental results and also software packages and different kinds of computational heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.185,
    "end": 851.809,
    "text": "And then how do you get from a neural network to a POMDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.431,
    "end": 858.915,
    "text": "And so this paper 51 establishes this relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.444,
    "end": 862.526,
    "text": " formally as well as empirically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.706,
    "end": 885.422,
    "text": "So it's extremely important reading slash listening in the space of beyond the more foundational points that have been made in the last several minutes, which is just simply these kinds of graphs are not these kinds of graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.028,
    "end": 894.133,
    "text": " That's just two different categories of visual representations that both use nodes and edges, but they're describing different things with nodes and edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.494,
    "end": 914.388,
    "text": "And then to go deeper and to understand exactly how biological and artificial neural architectures implement the kinds of generative models specified by a Bayesian graph, then the paper discussed in 51 is the most recent and advanced discussion on it in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.355,
    "end": 919.595,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.478,
    "end": 924.483,
    "text": "How are categories actually encoded in the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.685,
    "end": 928.549,
    "text": "Sorry, Daniel, can you add that reference there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 928.569,
    "end": 929.23,
    "text": "Oh, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.492,
    "end": 930.753,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 961.502,
    "end": 983.824,
    "text": " yeah and they've done work in in silico in vitro neurons and in vivo animals it seems like so funny there's fef free energy functional but it's definitely not that and there's been other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.507,
    "end": 995.752,
    "text": " discussions of just structural versus effective and functional connectivity in the brain all right so how are categories actually encoded in the brain and neil added a comment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.297,
    "end": 1002.059,
    "text": " I understand that prediction errors are thought to be encoded as pulse density, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.119,
    "end": 1005.781,
    "text": "frequency modulated spike trains, as measured on single neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.762,
    "end": 1023.612,
    "text": "This might lead us to think that categories are encoded in single neurons like the notorious grandmother and Jennifer Aniston neurons, which are neurons that have been reported in different studies to have an increased and sometimes like specific firing rate increase for a specific stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.813,
    "end": 1043.461,
    "text": " So they'll be measuring the thousands of neurons and some neurons fire when some image is brighter or darker and some neurons don't have any clear relationship with visual input, but then they'll find some neuron that fires for Jennifer Aniston, but not for other closely related stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.242,
    "end": 1047.983,
    "text": "And so hence the fame of the Jennifer Aniston neuron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.424,
    "end": 1051.145,
    "text": "In this schema, are we really saying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.121,
    "end": 1058.924,
    "text": " One, as far as ACT-INF is concerned, it doesn't matter how categories are stored within a cortical column component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.784,
    "end": 1063.386,
    "text": "We just need to model that they are with associate precisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.906,
    "end": 1070.889,
    "text": "Two, we suppose categories are stored statistically somehow collectively within a local population of neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.322,
    "end": 1079.667,
    "text": " Would we not expect prediction errors to be represented in spike trains on many neurons coming into or going out of a cortical column?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.328,
    "end": 1084.011,
    "text": "All right, there's many ways to explore this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.731,
    "end": 1085.732,
    "text": "Who wants to give a first thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.762,
    "end": 1098.563,
    "text": "Waiting on you, Allie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.503,
    "end": 1100.344,
    "text": "Yeah, go for it, Allie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.52,
    "end": 1109.945,
    "text": " Actually, it's a very big question in the philosophy of mind and the philosophy of cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1110.445,
    "end": 1118.951,
    "text": "I mean, the question of how brain represents the signs and the external object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.132,
    "end": 1126.737,
    "text": "One theory is basically based on the taxonomy of signs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.537,
    "end": 1130.779,
    "text": "I mean, as many are aware, a person",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.849,
    "end": 1139.714,
    "text": " classifies the signs into three types of symbols, icons, and indices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1140.775,
    "end": 1162.872,
    "text": "But when we apply this taxonomy in the representation mechanism of brain, basically what we need as a very first step is to understand how the brain represents indices",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1163.385,
    "end": 1189.869,
    "text": " and icons as a kind of representation processes that would need minimal amount of consciousness right so uh for um indices and uh icons uh i mean the difference between indices and icons are that icons are a kind of structural structure preserving maps and indices",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1192.938,
    "end": 1197.401,
    "text": " In indices, we have a kind of causal relationship between the signs and their reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.462,
    "end": 1216.115,
    "text": "So before representing the tokens of an object as an index of an external object, we need to have a kind of map or an icon in order to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1217.476,
    "end": 1223.179,
    "text": " map that token of index to our icon, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.18,
    "end": 1240.728,
    "text": "So one theory for doing that is so-called homuncular theory proposed by Daniel Dennett in which he proposes a hierarchy of subjects with decreasing levels of consciousness and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1241.829,
    "end": 1248.026,
    "text": " And on the bottom most level, we have basically non-conscious subjects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.827,
    "end": 1270.199,
    "text": " who somehow grasps the icon in a kind of just representational map without interpreting it as a specific index, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1271.099,
    "end": 1277.963,
    "text": "But then again, it passes that representation into its higher levels of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.604,
    "end": 1298.438,
    "text": " homunculus with increasing their increasing consciousness until it reaches the subject quote-unquote subject which is basically our whole mind so yeah it's a very big subject and of course",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.188,
    "end": 1312.878,
    "text": " It's impossible to summarize it in just a couple of minutes, but I would recommend a very interesting book on that subject if anyone wants to further explore that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.678,
    "end": 1327.209,
    "text": "The first chapter of Materialist Phenomenology by Manuel de Landa explains it with a crystal clear prose what that kind of representation or how that mechanism would work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.649,
    "end": 1330.949,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.991,
    "end": 1333.072,
    "text": "Great answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.352,
    "end": 1336.616,
    "text": "So a few more angles on this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.758,
    "end": 1345.205,
    "text": "First, the question of representation in ACT-INF and in neuroscience is a large area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.225,
    "end": 1345.265,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.158,
    "end": 1366.302,
    "text": " for something to be represented in the brain, it doesn't need to be what it is in the outside world, clearly, but that leads to like a lot of, of course, discussion about how representations actually do occur in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.062,
    "end": 1374.904,
    "text": "So the question was prediction errors are encoded as pulse density as measured on single neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.084,
    "end": 1378.225,
    "text": "Well, the simple answer is it just simply does not have to be that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.144,
    "end": 1393.147,
    "text": " Prediction errors in a different cognitive system or region could be encoded as the autocorrelation function of the spike train, or there are neurons that are non-spiking, or it could be a brain region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.387,
    "end": 1408.091,
    "text": "There's just no reason to uniquely associate the conveyance of prediction errors to the extent that statistical parameters are even conveyed in neuroanatomy at all, which one doesn't even have to agree with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.646,
    "end": 1422.429,
    "text": " But to the extent we're even going to talk about neural phenomena as being related to statistical phenomena, it doesn't have to be the spiking density, nor does it have to be on single neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.109,
    "end": 1428.591,
    "text": "Now, that being said, in the neural network discussion in 51,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.184,
    "end": 1444.567,
    "text": " there was a relationship that they are showing between the fast perceptual-like dynamics and spike firing rates and the slower dynamics and the neural plasticity at the synapses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.187,
    "end": 1456.25,
    "text": "So as kind of before, like it could be, but just because it could be in some senses maybe doesn't mean that those are an identical mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.531,
    "end": 1459.671,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.297,
    "end": 1463.618,
    "text": " Categories are encoded in single neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.118,
    "end": 1480.644,
    "text": "Well, if by that it is meant encoded by firing sensitivities in networks of neurons, then there is already more being taken into account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.744,
    "end": 1482.184,
    "text": "It's kind of like figure and ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.264,
    "end": 1487.946,
    "text": "It's not like that neuron taken out of that network would still signal Jennifer Aniston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.726,
    "end": 1490.927,
    "text": "The semantics of a given category",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.208,
    "end": 1509.342,
    "text": " are associated with the inputs and outputs, even in cases where there is a statistically tight relationship between the firing activity of some neuron and some other category being identified, then are we really saying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.944,
    "end": 1514.286,
    "text": "It doesn't matter how categories are stored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.966,
    "end": 1516.327,
    "text": "We just need to model that they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.848,
    "end": 1520.091,
    "text": "So that is an instrumentalist perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.209,
    "end": 1545.991,
    "text": " which is just saying whatever the neurological substrate is of how categories are enacted and represented in the brain, we're going to use a specific type of model that is super tractable, super composable, translates across systems and so on, hashtag act-inf, and we're not saying that's the architecture of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.116,
    "end": 1551.698,
    "text": " So that's an easy instrumentalist position that can always be taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.859,
    "end": 1559.241,
    "text": "And we suppose that categories are stored statistically somehow collectively within a local population of neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.902,
    "end": 1561.302,
    "text": "That's an empirical hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.103,
    "end": 1575.969,
    "text": "One could test whether a population rate code or a area of activity or other aspects of neural function that aren't even as commonly discussed depending on the specific question come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.728,
    "end": 1583.391,
    "text": " Would we not expect prediction errors to be represented on spike trains on many neurons coming into and going out of?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.832,
    "end": 1588.373,
    "text": "If you expect it, if that's your prior, then you expect it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.413,
    "end": 1590.014,
    "text": "If it's not your prior, you don't expect it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.856,
    "end": 1601.32,
    "text": "There might be anatomical or statistical reasons to scaffold the belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.702,
    "end": 1632.294,
    "text": " that there would be a many input many output system or not but it can't be answered in the general those are just the examples of empirical neuro anatomical research to actually pursue um brock how do you see it related to for veiki um i mean relevance realization is uh i mean very roughly like opponent processing it's i mean it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.257,
    "end": 1642.52,
    "text": " I don't really understand the fundamentals of precisely how that would work in a neurological, physiological sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.601,
    "end": 1646.801,
    "text": "But it's kind of GAN-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.862,
    "end": 1653.404,
    "text": "I guess you could anthropomorphize there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1653.424,
    "end": 1656.325,
    "text": "Yeah, just that you're contrasting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.072,
    "end": 1676.238,
    "text": " like different fittedness, I guess, of in the live stream, he gave this, I guess, example of like a dog versus a four-legged animal versus a mammal or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.278,
    "end": 1678.499,
    "text": "Why did we say the dog ran by sort of thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.24,
    "end": 1689.324,
    "text": "Is that that has a good fit and that realized relevance is somehow related to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.771,
    "end": 1691.752,
    "text": " opponent processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.293,
    "end": 1702.621,
    "text": "So that's, I guess, a way in which it's related to categories or very crudely like general differentiation or something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.222,
    "end": 1708.907,
    "text": "It's tangentially related, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.927,
    "end": 1710.148,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.308,
    "end": 1712.33,
    "text": "It's like a conceptual approach too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.67,
    "end": 1718.395,
    "text": "Yeah, there's always different coarse grainings of categories that can be appealed to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.001,
    "end": 1722.062,
    "text": " in speech or in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.103,
    "end": 1745.454,
    "text": "And so, um, outside of contrived, you know, sorting tasks in the more open-endedness of the niche that the systems have to engage with, um, the categorization is, has different characteristics than like a binary sorting task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.458,
    "end": 1749.901,
    "text": " So that's what Vervaeke ties to relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.565,
    "end": 1753.825,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.709,
    "end": 1761.114,
    "text": "Does anyone want to add another question or thought on Vive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.459,
    "end": 1788.883,
    "text": " What other neural systems or behaviors are people interested in modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.969,
    "end": 1807.815,
    "text": "There's always planning, but also in that diagram behind the window there, there's goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.776,
    "end": 1810.957,
    "text": "Goals, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.437,
    "end": 1812.298,
    "text": "Where did those come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.526,
    "end": 1839.673,
    "text": " Seems like, I guess you could do planning without goals, but it seems like a goal there would be kind of a reason to plan, a biological goal of homeostasis, allostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.513,
    "end": 1842.294,
    "text": "There was a live stream you guys did recently on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.514,
    "end": 1847.456,
    "text": "And then some more subjective cultural thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1847.676,
    "end": 1848.276,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.986,
    "end": 1868.798,
    "text": " Yeah, well, here with a more narrow goal interpretation, the difference is between the direct and the indirect policy selection pathways in the stratum, which is mediated by gamma, the dopamine signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.918,
    "end": 1877.343,
    "text": "And so here on this left side, the habits dominate policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.177,
    "end": 1888.279,
    "text": " So E represents the affordances, but it's not just like, affordances are not just like yes, no in the E vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.379,
    "end": 1894.1,
    "text": "They represent the prior probabilities of given actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.2,
    "end": 1902.021,
    "text": "So where an affordance is impossible, it is given a prior probability of zero, and therefore it's never selected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.002,
    "end": 1909.163,
    "text": "Where the prior probability on some action or affordance being engaged in is high,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.424,
    "end": 1911.865,
    "text": " it's more likely to be undertaken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.225,
    "end": 1916.829,
    "text": "So E is not just like a list of what you can choose from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.889,
    "end": 1917.81,
    "text": "It's not like a menu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.31,
    "end": 1924.975,
    "text": "It's like a menu of actions that's weighted by habit in this construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.536,
    "end": 1937.525,
    "text": "And so in the absence of any kind of pragmatic or epistemic value, which is to say free energy minimization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.071,
    "end": 1942.392,
    "text": " behavior recapitulates the habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.754,
    "end": 1956.28,
    "text": "So there's a mode of policy selection, pi, where the entity is merely recapitulating probabilistically their history and habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.661,
    "end": 1960.402,
    "text": "That's shown on the left side of the stratum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.943,
    "end": 1968.247,
    "text": "Then the right side of the stratum shows the cortical engagement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.033,
    "end": 1995.571,
    "text": " of seemingly more goal-directed, whether pragmatic goal-directed and or epistemic goal-directed, or as we think about it in active inference, the pragmatic and epistemic integration into a single imperative G. Like, let's just say I usually walk up and down, but I rarely go left and right, and I'm in a maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.872,
    "end": 1998.213,
    "text": "This left mode...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.622,
    "end": 2005.304,
    "text": " of policy selection is just going to be recapitulating the decisions previously made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.365,
    "end": 2028.514,
    "text": "The right mode is going to ideally strike a balance between pragmatic and epistemic value, but any discussion of pragmatic and epistemic value, so pragmatic value, bringing alignment, reducing the divergence between your preferences and observations, getting what you want, getting what you expect,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.591,
    "end": 2033.612,
    "text": " and epistemic value, reducing your uncertainty, gaining information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.052,
    "end": 2056.938,
    "text": "Any discussion of the relative merits of different policies in terms of their expected free energy, which again is to say their relative or relative pragmatic and epistemic value, any evaluation of policy is a different cognitive and computational process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.644,
    "end": 2081.479,
    "text": " than merely the recapitulation of habits which doesn't require any consideration of policies at all so this is kind of like walking forward walking into the future looking backwards i mean in some deeper sense aren't we always but this e mediated mode of decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.796,
    "end": 2105.149,
    "text": " does not require any evaluation of counterfactuals or comparison of alternative outcomes now where do habits and preferences come from because if under g the pragmatic value is going to be associated with prior probabilities on preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.404,
    "end": 2115.106,
    "text": " And epistemic information as well is going to be mediated by priors, which here are being shown as kind of cortically embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.026,
    "end": 2118.507,
    "text": "Where do those parameters come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.388,
    "end": 2124.929,
    "text": "Evolution, ecology, development, and behavior over different timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.03,
    "end": 2136.212,
    "text": "So the coarse-grained priors are inherited through the process of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.475,
    "end": 2153.148,
    "text": " and then finer and finer scale adjustments can occur via ecological and developmental processes, culminating in learning and at the very fastest scale, perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.423,
    "end": 2176.896,
    "text": " That's the deflationary approach, which would be evolution has put all those nested processes, evolution, ecology, development, behavior, learning, and then perception, put that entity's generative model in the context of a generative process into an adaptive position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.457,
    "end": 2182.9,
    "text": "If it's not adaptive, that far from equilibrium system is going to quickly dissipate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.261,
    "end": 2184.862,
    "text": "You just saw something in its last day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.292,
    "end": 2190.153,
    "text": " or it's not its last day, and then the inference is going to continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.654,
    "end": 2191.034,
    "text": "Giuseppe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.315,
    "end": 2195.015,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.276,
    "end": 2199.597,
    "text": "Something that is not too clear to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.737,
    "end": 2215.222,
    "text": "Habits are supposedly, they do refer to things that are learned during the lifetime of the agent, as opposed to being...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2216.73,
    "end": 2245.892,
    "text": " deposited through evolution for instance because one could say also that the the the policies with high pragmatic values that that are the one that preserve the phenotype of the agent are kind of habits but they pertain to the longer time scale of uh phylogenesis so to say so so is there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2247.176,
    "end": 2268.586,
    "text": " the distinction here like the specific of habits the characteristic of habits is that they have been learned they there are they come from statistical regularities that have been uh accrued and represented through the lifetime of the agent to the experience of the of the agent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.905,
    "end": 2274.807,
    "text": " I believe that it doesn't have to be only learned during the lifetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.307,
    "end": 2278.588,
    "text": "Like let's just say that there's a species of bird that flies at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.689,
    "end": 2281.23,
    "text": "It habitually flies at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.45,
    "end": 2288.253,
    "text": "And then you can zoom in more and say, now within that bird species, there are the early risers and the late risers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.443,
    "end": 2292.665,
    "text": " And this one is habitually rising early and that one's habitually rising late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.285,
    "end": 2297.967,
    "text": "Now that may be a genetic polymorphism that doesn't even have to be learned at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.908,
    "end": 2308.833,
    "text": "So I think, of course, in humans, we take a very developmental learning-based approach towards the habits and Aristotle, excellence is what we repeatedly do and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.193,
    "end": 2315.536,
    "text": "But when we just think about habit as what is habitually done, then it's a little bit clearer that it's not necessarily learned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.077,
    "end": 2317.878,
    "text": "But then once you...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2319.252,
    "end": 2347.264,
    "text": " couldn't you uh subsume the like the the tendency to fly more at night as a as a preference that is within the within the yeah as a preference like within the same matrix yes and in some um convergent evolution scenario",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2349.386,
    "end": 2368.639,
    "text": " we would see the habit distribution recapitulating the preference distribution increasingly mindlessly, offloading the cognitive work of evaluating policies and reducing divergence through free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.799,
    "end": 2373.702,
    "text": "We might expect some of that to become habitualized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.382,
    "end": 2400.458,
    "text": " and merely reflected through the affordances that can be taken or the probability of different affordances in terms of their prior preferences or prior probabilities on affordances rather than needing to be mediated through preference that's one answer and another kind of corollary answer is on one hand we can talk about preferences over any distribution but in the bird example um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.752,
    "end": 2406.013,
    "text": " the preference for flying at night might not be a category that's accessible to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.074,
    "end": 2416.077,
    "text": "But preferences that have to do with the amount of photons being detected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.761,
    "end": 2426.646,
    "text": " might interact synergistically with habits around like a circadian rhythm or habits around flapping your wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.087,
    "end": 2430.688,
    "text": "Like once the wing is flapped up, it always flaps down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.989,
    "end": 2443.655,
    "text": "That doesn't even need to be computationally modeled as a policy decision because it could be relying on these regions of the brain or these kinds of pathways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.157,
    "end": 2465.048,
    "text": " that don't explicitly consider alternatives in the same way and i think again as we discussed at the beginning this isn't the literal interpretation of the neuroanatomy but it's kind of showing two extreme um ends of a continuum with um the least to the most explicit consideration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.292,
    "end": 2480.154,
    "text": " of future policies with all the pros and cons of turning the volume up, turning the volume down, and the volume is computationally analogous to the role of dopamine signaling in the striatum and in insects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.735,
    "end": 2480.895,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.775,
    "end": 2514.015,
    "text": " Yeah, and another slightly different take on this subject is laid out by J. Scott Kelso in his book, Dynamic Patterns, The Self-Organization of Brain and Behavior, in which he says that because the state of all the possibilities are too complex to be calculated at each time and for each decision,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.006,
    "end": 2538.938,
    "text": " He lays out something like this, that if we look at it, look at the state of the possibilities in terms of its distribution of singularities and the basins and the well of those singularities or the attractors of the basin of attractors,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.499,
    "end": 2553.687,
    "text": " the policy making can be achieved by the effect of adjusting the parameter and the proximity of those wells or basins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.247,
    "end": 2566.695,
    "text": "So for example, manipulating that parameter to make some wells or basins shallow with the result that the associated preferred state becomes less stable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.895,
    "end": 2568.336,
    "text": "So in this condition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.917,
    "end": 2579.061,
    "text": " random fluctuations actually can spontaneously somehow dislodge the system from that state and push it into another state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.582,
    "end": 2596.629,
    "text": "So in this case, the habit can also be explained by the varying degrees of these kinds of parameter adjustments throughout all the state of possibility states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.563,
    "end": 2624.33,
    "text": " awesome yeah yeah this is this is very interesting one one subject which I'm I'm interested in applying the active inference framework is on meditative practice and actually it has been one proposal is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.586,
    "end": 2653.423,
    "text": " it may work exactly like that so that uh the the tractors that are very deep and are firmly consolidated through habits through meditative practice become shallower so that the range of possibilities of behavior and perception becomes larger because you you you are not constrained by this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2654.474,
    "end": 2684.029,
    "text": " deep wells of of of energy that have been established through your habits but the interesting thing here the intriguing part is that through a very uh repetitive practice kind of repetitive practice you are you somehow make your energy landscape more shallow at least at least at least during the practice",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.699,
    "end": 2709.607,
    "text": " it's like it's interesting this paradoxical aspect how you you could somehow train with the very habitual practice to weaken your habits oh just going off of a tangent here but it's totally interesting and one could imagine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.932,
    "end": 2741.526,
    "text": " real practices or simulated computational agents that engage in repetitive actions and that just sharpens it doesn't open their mind a lot of meditation is not about expanding one's mind or changing one's behavior it's actually about converging to a certain regime of attention and sharpening distributions that exist during the practice and after the practice there are other cases where we can modulate our receptivity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.79,
    "end": 2744.091,
    "text": " through repetitive actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.291,
    "end": 2752.915,
    "text": "And being exposed to just merely novelty all the time doesn't necessarily breed novelty in us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.475,
    "end": 2754.515,
    "text": "It might just confuse us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.237,
    "end": 2758.477,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.939,
    "end": 2767.001,
    "text": "Yeah, Brock, some habits are reciprocally narrowing, some are reciprocally opening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.121,
    "end": 2767.321,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.102,
    "end": 2771.723,
    "text": "Yeah, they can look very similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.835,
    "end": 2786.423,
    "text": " And without the ability to see the cognitive states of another, if somebody's just sitting quietly, maybe they're narrowing, maybe they're opening, maybe they're sleeping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.824,
    "end": 2796.21,
    "text": "Well, to your point, I mean, about, you know, like some basic version of meditation of just like focus on your breathing is like sharpening and narrowing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.35,
    "end": 2802.774,
    "text": "But in doing that, over time, you kind of grow this capacity to modulate your attention more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.15,
    "end": 2806.891,
    "text": " on other things, more intentionally, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.372,
    "end": 2810.732,
    "text": "So... Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.792,
    "end": 2826.637,
    "text": "Probably not... Perhaps this idea that by doing that, by deploying attention more on the sensory aspect, you kind of avoid a little bit, or bias the usual",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2827.532,
    "end": 2837.481,
    "text": " drift of precision upwards toward more, like, superior layers of the hierarchy associated with mind-wandering, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.863,
    "end": 2848.731,
    "text": "So this is... Bronwyn, would you like to add anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.836,
    "end": 2868.096,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.217,
    "end": 2869.517,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.597,
    "end": 2871.778,
    "text": "I'm going to copy your comment in so we can read this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.781,
    "end": 2882.105,
    "text": "I would put forward here the practice of Alexander technique where we optimize precision by repetitive action, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.165,
    "end": 2886.027,
    "text": "getting in and out of a chair whilst inhibiting and directing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.591,
    "end": 2896.494,
    "text": "Yeah, it'd be interesting to with this three",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.439,
    "end": 2900.783,
    "text": " region neuroanatomical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.803,
    "end": 2901.904,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.006,
    "end": 2908.634,
    "text": "Cortical, the most cognitive, most semantically accessible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.836,
    "end": 2930.03,
    "text": " the midbrain striatum, most dopaminergically associated with this continuum between habitual and goal-directed policy selection, and then action mediated in the peripheral nervous system through divergence minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.591,
    "end": 2938.196,
    "text": "And then sketch out... I'm just going to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.045,
    "end": 2960.797,
    "text": " And then sketch out, yeah, like in the Parkinson's case where there's a loss of dopaminergic signaling, which can in the extreme lead to like failures of initiating and planning action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.858,
    "end": 2968.722,
    "text": "And then there was a Robin Williams movie",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.33,
    "end": 2970.951,
    "text": " Awakenings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.253,
    "end": 2980.366,
    "text": "This movie is about a early on, Oliver Sacks wrote the book, but then there's a Robin Williams movie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.202,
    "end": 2999.363,
    "text": " And there was a floor of patients in a medical institution who were all suffering from basically these different symptoms that today could be recognized as like hypodopaminergic signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.123,
    "end": 3000.504,
    "text": "And then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.469,
    "end": 3008.331,
    "text": " the doctor goes to a conference, learns about L-DOPA, which is like a metabolic precursor of dopamine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.692,
    "end": 3011.833,
    "text": "So dopamine does not cross the blood brain barrier in mammals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.553,
    "end": 3014.034,
    "text": "However, L-DOPA does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.514,
    "end": 3029.26,
    "text": "And then that like awakens people, but it shows like some of the motor and cognitive consequences of hypo and hyper dopaminergic signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.799,
    "end": 3034.562,
    "text": " One question for me is where does reasoning fit into figure 5.5?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.175,
    "end": 3049.116,
    "text": "The gears of thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.059,
    "end": 3053.921,
    "text": "Where's the transmission in the carburetor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.792,
    "end": 3060.274,
    "text": " Like those are great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.294,
    "end": 3063.777,
    "text": "So there's probably many different angles to take on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.017,
    "end": 3072.182,
    "text": "One angle is like reasoning is a synonym of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.563,
    "end": 3084.65,
    "text": "And so by pointing to reasoning, we are talking about families of inferential structures, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.747,
    "end": 3094.208,
    "text": " And so depending on what that reasoning is about, it could manifest in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.009,
    "end": 3099.569,
    "text": "And so like, yeah, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.09,
    "end": 3109.651,
    "text": "Actually, Helmholtz proposes that reasoning can, as you said, it can be done also unconsciously as inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3110.131,
    "end": 3113.472,
    "text": "So actually one of the starting points of this whole",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3114.216,
    "end": 3143.654,
    "text": " area of Bayesian brain hypothesis and probably its origin is Helmholtz's essay, I forgot its exact name, from 1866 or something, in which he proposes a theory of unconscious inference or unconscious conclusion in which sometimes reasoning, actually most of the time, the majority of our reasoning processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3144.256,
    "end": 3146.957,
    "text": " are not done in our conscious levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.057,
    "end": 3155.518,
    "text": "So yeah, I also agree with you that reasoning can be taken as a synonymous for these kind of inferences as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3159.079,
    "end": 3168.4,
    "text": "Yeah, but like on the experiential side, it is so fascinating and mysterious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.021,
    "end": 3171.281,
    "text": "Stimuli are presented",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.586,
    "end": 3179.855,
    "text": " Certainly there are unconscious inferences that facilitate even the initial understanding of a stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.296,
    "end": 3184.12,
    "text": "Like a visual stimuli, like seeing a letter as a letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.72,
    "end": 3191.403,
    "text": " Seeing a handle for grabbing is kind of the ecological and activist angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.243,
    "end": 3198.866,
    "text": "But seeing a symbol or sign, and that kind of invokes what Ali described earlier with a theory of semiosis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.667,
    "end": 3202.788,
    "text": "But then we wait.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.169,
    "end": 3206.85,
    "text": "And we feel like we reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.771,
    "end": 3211.412,
    "text": "And we make decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.273,
    "end": 3214.134,
    "text": "And so how to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.642,
    "end": 3225.604,
    "text": " how to square the graphical models of inference, which is to say reasoning, with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.744,
    "end": 3226.184,
    "text": "Yeah, Brock?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.204,
    "end": 3239.147,
    "text": "I was just going to ask, I guess, where mental action fits into this on policy selection or habits or goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.207,
    "end": 3244.828,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.121,
    "end": 3254.503,
    "text": " Like, yeah, I think the vast majority of this is, yeah, that you get, like, this base unconscious inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.583,
    "end": 3263.185,
    "text": "But at some point, it feels like there's something conscious there about selecting between two things sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3264.285,
    "end": 3269.106,
    "text": "You're really intentional and thinking real hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.706,
    "end": 3272.447,
    "text": "So I wonder what that is, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.247,
    "end": 3273.507,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.287,
    "end": 3274.687,
    "text": "Giuseppe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.392,
    "end": 3302.603,
    "text": " something about going back to habits something that i just thought about um so usually habitual actions from the point of view from a psychological and phenomenological point of view are they seem to require much less mental energy or psychological energy so we can think about that in terms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3303.353,
    "end": 3307.736,
    "text": " you know, the theory of System 1 and System 2 by the Nicanoman.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.456,
    "end": 3332.77,
    "text": "And I wonder if they seem to have some preferential low levels of free energy also, of expected free energy, the habitual policies compared to other policies that somehow mirrors their relatively",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3333.496,
    "end": 3347.544,
    "text": " low investment of energy psychologically yeah well that's been a hotly debated topic and one of the most mystifying observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.053,
    "end": 3355.155,
    "text": " is that the brain does not change in metabolic activity greatly, depending on the task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.575,
    "end": 3363.978,
    "text": "And so there's all these amazing analogies between Freud and free energy and all these things that Solmes and Fristens and others have worked on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.038,
    "end": 3370.321,
    "text": "And of course, the tantalizing connections between free energy minimization and energetic energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.536,
    "end": 3384.301,
    "text": " balance and the fMRI signal that's being studied is the brain oxygen levels changing bold signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.941,
    "end": 3398.947,
    "text": "And also people can study the glucose metabolism, but these levels of change are very small in brain metabolism and glucose usage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.086,
    "end": 3428.446,
    "text": " they're not simply associated with like quote thinking hard and even necessarily cognitive demands and so it's it's like it's like i don't know if it's a hammer without a nail or nail without a hammer because empirically it doesn't change in energy use that much although although there was a recent paper and i think it's in it's in a big journal i can't remember if it's nature or or actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.52,
    "end": 3445.88,
    "text": " There was, you know, they proposed some kind of approach similar to free energy minimization and that they were showing that actually the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3447.782,
    "end": 3454.163,
    "text": " the energy spent in synaptic communication was minimized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.364,
    "end": 3458.124,
    "text": "And if I may look for it and I may post it here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.805,
    "end": 3473.848,
    "text": "But I wonder more specifically in this idea of that habitual patterns of behavior, or let's say sequences of action gets shifted with practice",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.54,
    "end": 3491.341,
    "text": " being processed from the cortex to the basal ganglia somehow there is uh there is actually well not not only not only like metabolic energy like in terms of glucose or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3492.097,
    "end": 3520.1,
    "text": " advantage but also in terms of really free energy so i don't know if that has been looked at uh specifically like for the basal ganglia or i don't know there must be something because it does seem that uh mental resources at least experientially are become much um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3521.926,
    "end": 3542.766,
    "text": " ma the required mental resources become much less once once you a task is automatized let's say yes just shortly to close this and and to address this uh final question when does passive become active inference and then planning well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.008,
    "end": 3548.711,
    "text": " we could look at from a Bayes graph perspective, is action involved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.552,
    "end": 3554.315,
    "text": "If the task is merely perceptual, we can say that it's passive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.635,
    "end": 3558.556,
    "text": " If ocular motor circadian is required.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.856,
    "end": 3563.817,
    "text": "So even if the person's in a chair, but they're moving their eyeballs, that could still be modeled as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.698,
    "end": 3569.559,
    "text": "And you'd want then a unified imperative for inference and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.639,
    "end": 3572.1,
    "text": "And then when is it planning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.8,
    "end": 3581.122,
    "text": "Well, as we had some controversial discussions on in cohort one about the second half of the book, is it really planning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.382,
    "end": 3583.103,
    "text": "Do we really see planning in this textbook?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.164,
    "end": 3592.808,
    "text": " as if planning would be behavior that looks like it's enacting a plan, like a chess player who's winning a game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.408,
    "end": 3607.274,
    "text": "But the strict and narrow definition of planning might be explicit consideration of sequential actions and their consequences and preparation for those and evaluation of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.136,
    "end": 3625.484,
    "text": " And free energy reduction or minimization could be used in purely passive inference, which is where it's widely used in general as an evidence lower bound and in machine learning without action in the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.945,
    "end": 3640.673,
    "text": "So the innovation of active inference is to bring action into the fold of inference and make a unified free energy functional imperative for perceptual learning and action inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.015,
    "end": 3643.275,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.339,
    "end": 3647.202,
    "text": "Hope it's okay we went a few minutes over, but thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.464,
    "end": 3651.669,
    "text": "Cohort two, next week we return.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.206,
    "end": 3661.068,
    "text": " for some overview and debrief, look at the project ideas, and also look forward to future textbook groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.748,
    "end": 3666.79,
    "text": "So feel free to fill out the feedback form and encourage others to do so as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.39,
    "end": 3672.931,
    "text": "And also take a look through some thoughts and add more thoughts on future groups, which we'll go over next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.212,
    "end": 3673.952,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.212,
    "end": 3674.632,
    "text": "Talk to you soon.",
    "speaker": "SPEAKER_00"
  }
]