[
  {
    "start": 3.338,
    "end": 26.967,
    "text": " hi everyone it's cohort three and august first we're in our second discussion on chapter nine so if either of you would like before we jump into some specific questions are are there any general comments or any other topics that that people want to address",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 27.655,
    "end": 34.083,
    "text": " Otherwise, we will probably look through some answers and curate and improve some discourse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 38.349,
    "end": 39.13,
    "text": "Yeah, nothing for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.234,
    "end": 42.494,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.554,
    "end": 47.48,
    "text": "I added some questions at the end, but we can go through the other stuff first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.5,
    "end": 47.921,
    "text": "Perfect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 48.381,
    "end": 49.823,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 49.843,
    "end": 52.026,
    "text": "And Esmail, thank you for your question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 56.63,
    "end": 81.321,
    "text": " um what does this text mean about epistemic value so so it let me know if it's okay to modify the question to what what is epistemic value if if that's what your question was or let me know okay let us uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 84.372,
    "end": 114.227,
    "text": " you added some of the new questions at the at the bottom here Neil yeah that's right all right it's it's one sort of big question really um which one let's do well um in a non-meta days in so that one and then all right awesome yeah all right let's start here all right so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 116.114,
    "end": 136.013,
    "text": " so so my take on on the chapter is it's it's trying to fit active inference into a a framework of of what science is um the the new thing I think that the big idea for me",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.512,
    "end": 153.86,
    "text": " was the meta Bayesian inference, which I understand this trying to make a, so someone's trying to make inferences about something that has itself got beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.864,
    "end": 158.649,
    "text": "So maybe I don't know if I got that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 158.669,
    "end": 158.949,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 160.612,
    "end": 161.173,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.638,
    "end": 189.692,
    "text": " so so the first part of that question is is what does what does this have chapter have to contribute when that isn't the case if if we're just trying to use it to understand something that can be modeled um and then uh the second part is would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 190.178,
    "end": 213.756,
    "text": " the chapter talks about is thinking about it in the context of brains, so psychiatry, but it presumably can be applied to anything in which the system that's being modelled can in any way be said to be of having beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.238,
    "end": 229.87,
    "text": " And I've mentioned Dennett's intentional stance there, where we're not necessarily believing, we don't think there's any sentience there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.07,
    "end": 235.542,
    "text": "So you could think of, we could talk about a thermostat thinking it's too hot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.522,
    "end": 243.749,
    "text": " without actually saying anything about any sort of mental processes going on there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.811,
    "end": 264.128,
    "text": "So it seems to me that the Metabasian aspect could potentially be saying, could potentially be useful for this, to beyond psychiatry, psychology,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.736,
    "end": 280.975,
    "text": " Ben Whiteman- yeah so so then skipping over the third question was question is, what is this actually being applied in outside of neuroscience and psychology, as it seems, particularly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 281.015,
    "end": 290.187,
    "text": "Ben Whiteman- What would be useful to be, including it in behavioral economics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.449,
    "end": 297.017,
    "text": "Ben Whiteman- and Ben Whiteman- And maybe in systems engineering I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.832,
    "end": 300.873,
    "text": " Great, great questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 300.933,
    "end": 302.695,
    "text": "We'll start with the first one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 307.098,
    "end": 310.221,
    "text": "Okay, I see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.561,
    "end": 311.522,
    "text": "The second one was here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 317.447,
    "end": 318.408,
    "text": "Also welcome, Molly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 320.87,
    "end": 322.732,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.752,
    "end": 328.237,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 328.277,
    "end": 328.337,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 329.6,
    "end": 339.115,
    "text": " I put the link, but this upload of the textbook, it's a good starting point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 340.397,
    "end": 342.46,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 344.202,
    "end": 358.324,
    "text": "So the first thing that... Let's just start by recalling the meta-Bayesian...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 359.587,
    "end": 384.598,
    "text": " approach in nine nine point one so i think you summarized it perfectly neil we're doing bayesian inference about something that has beliefs so it the aboutness of the subjective model is the environment which may be the laboratory or or the niche",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 385.523,
    "end": 407.548,
    "text": " um and and thus the aboutness of the scientific model is the rat in the maze which has an a model that has an aboutness of the maze so that's this kind of like nested or meta bayesian approach we're using bayesian approaches from the outside",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 407.9,
    "end": 416.732,
    "text": " But then when we get to the good stuff, it is also a Bayesian model with an aboutness of an environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 420.216,
    "end": 430.87,
    "text": "So I think this is a great way to put it, trying to make inferences about something that has beliefs or trying to make inference about something that does inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 431.795,
    "end": 437.223,
    "text": " So your first question was, what does the chapter contribute when that is not the case?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 438.785,
    "end": 454.748,
    "text": "Here, I believe we can return to our favorite path integrals paper and point to the continuum where on the sophisticated end of the spectrum, we have a situation like that in this figure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 455.47,
    "end": 463.597,
    "text": " where here's us as scientists, here at the blanket states are the solid line.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 465.799,
    "end": 478.731,
    "text": "And then we're inferring a cognitive model through, for example, structure learning or some other a priori constraints.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 478.751,
    "end": 483.435,
    "text": "We're inferring the cognitive model that's looking back onto the outside.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 483.55,
    "end": 493.364,
    "text": " So the Metabasian stance is required in the cognitive on cognitive setting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 494.806,
    "end": 503.979,
    "text": "Just to be clear that to model another cognitive entity outside of the Metabasian stance, I'm not exactly sure what the alternative approach would be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 504.76,
    "end": 509.507,
    "text": "But you asked, what do we get when this is not the case?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 510.027,
    "end": 517.376,
    "text": " you could model an inert system accordingly here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 518.517,
    "end": 530.01,
    "text": "For example, maybe here it's a light switch or something, and it doesn't have any action selection of its own, or it's a passive inference object.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 530.03,
    "end": 530.751,
    "text": "So what do we gain?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 531.692,
    "end": 539.241,
    "text": "We gain continuity with those cases, thus grounding cognitive sciences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 542.022,
    "end": 567.979,
    "text": " we can discuss this more but but that to me feels like the big home run is continuity along this continuum of of uh sophistication from absolutely inert particles on through arbitrarily complex cognitive entities",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 568.583,
    "end": 574.168,
    "text": " So it's not to say that it's going to be uniquely explanatory or of predictive value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 574.228,
    "end": 588.782,
    "text": "It may be like getting out an extra apparatus that you don't necessarily need, which would be the same thing as saying you could have just started with a simpler model because you're bringing out this big apparatus that's just condensing down to a simpler model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 589.722,
    "end": 596.869,
    "text": "So do any of you think of any other advantages that are gained?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 604.274,
    "end": 606.804,
    "text": " Steve Tombson, As you went to where is that figure from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.27,
    "end": 609.575,
    "text": "Steve Tombson, figure to that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.595,
    "end": 613.39,
    "text": "Steve Tombson, Right okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.818,
    "end": 643.94,
    "text": " So it's creating a scaffolding for the observational encounter that allows us to have system of interest along this continuity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 645.983,
    "end": 647.666,
    "text": "It's absolutely required here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 647.866,
    "end": 653.215,
    "text": "You might be able to get away with a simpler perspective in a simpler setting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 654.427,
    "end": 682.729,
    "text": " but this is the most expressive way that we can dial it up arbitrarily um complicated and also dial it back down like maybe this just is a single node in this computational graph it just observations get passed in there's a single node and then it gets passed out but this frame but but the the scientists lab doesn't have to change whether they're studying the metronome",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 683.013,
    "end": 700.903,
    "text": " um or or the bird and i i i agree that it's important to connect it to these uh like to the standard stages the scientific process ali or anyone else want to just add more",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 705.608,
    "end": 732.139,
    "text": " If I may add some comments about, of course, I didn't hear the question from the beginning, but from what I heard, you see, I believe it's essential to always clarify our concepts and definitions in terms of what we're really talking about when we talk about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.473,
    "end": 735.868,
    "text": " Uh, agency on one hand, um, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 736.135,
    "end": 748.787,
    "text": " cognition or consciousness or whatever, because all of these terms, they have lots of baggage coming along with them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.867,
    "end": 764.742,
    "text": "So we need to be careful what exactly we mean by agency or in this case, I want to emphasize more on agency because this is quite a controversial term because as we know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 764.722,
    "end": 779.756,
    "text": " at least in the mainstream biology, people don't want to bestow agency on inert objects or even some simple, quote-unquote, simple organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.216,
    "end": 792.467,
    "text": "But on the other hand, there are some mechanical and naturalistic definitions of agency, the theory or from FEP and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 794.354,
    "end": 804.765,
    "text": " I don't know if you've seen this nice article by Philip Ball called, from a couple of months ago, Organisms as Agents of Evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.287,
    "end": 821.003,
    "text": "In this pretty much non-technical essay, he overviews some of the conceptions about agencies and he also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 820.983,
    "end": 831.536,
    "text": " I think, yeah, he has mentioned FEP in quite an extensive detail, I mean, comparatively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 831.596,
    "end": 849.437,
    "text": "But the case here, I mean, Ball's case is that we still don't know how to model agency as naturalistically as, I don't know, some physical phenomenon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.417,
    "end": 862.903,
    "text": " of course there are possibilities to model agencies as purely physical trajectories through these or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 865.111,
    "end": 867.574,
    "text": " probably is to think about and see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 867.594,
    "end": 884.298,
    "text": "But the point here I want to make is that this is not exactly what we always think when we try to trace the path of a physical system through a state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.618,
    "end": 893.751,
    "text": "We don't usually think of, I don't know, a simple particle or an inert object as following a path of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.052,
    "end": 896.577,
    "text": " or following a goal-directed motion, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 897.318,
    "end": 911.166,
    "text": "But on the other hand, there was this recent interesting interview in Sean Carroll's Mindscape podcast with David Krakauer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 911.146,
    "end": 928.013,
    "text": " And it was quite an interesting podcast because for the first time I heard a definition of complex systems as something that can be directly applied to FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 928.514,
    "end": 936.647,
    "text": "Namely, he defined complex systems or even the complexity science as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 936.627,
    "end": 961.572,
    "text": " uh the study of teleonomic matter right so obviously what he meant by teleonomic matter uh doesn't have anything to do with uh uh some extra material or the and or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 965.095,
    "end": 994.073,
    "text": " uh these but what uh come along in asians see through from that the draw some we need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.66,
    "end": 1018.187,
    "text": " uh the essential sorry Ali it just it just it's through suspect 80. uh sorry just okay can you hear me now yeah just just back up to um telionomic systems it's not not an extra material cause it's what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1019.618,
    "end": 1020.019,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.82,
    "end": 1043.112,
    "text": "So, yeah, it allows for the definition of agency throughout a whole spectrum that encompasses both inert objects or simple organisms up to the most complex phenomenon we know of in the whole universe, namely the human brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1043.092,
    "end": 1063.581,
    "text": " uh so this defining characteristic of complex systems as a teleonomic matter i believe uh is a is quite an essential move here because uh this is this can be seen as some of the underlying assertions of fep as well because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.561,
    "end": 1080.338,
    "text": " um the same mathematical technology i mean if we take bayesian mechanics as uh something that can be applied both to a simple physical phenomena and to um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.318,
    "end": 1103.608,
    "text": " i don't know consciousness or a cognition or agency or whatever then we need to define some uh some essential parameter that can be um put in put onto and put onto continuous spectrum without um on the one hand limiting too much",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1103.588,
    "end": 1109.676,
    "text": " and on the other without including or limiting too much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.716,
    "end": 1127.74,
    "text": "These recent moves in both complexity science and some of the recent advances in biology seems interestingly convergent with some of the assertions of FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.72,
    "end": 1155.33,
    "text": " And I hope in the future some interesting unifying perspectives can be gleaned from seeing these kinds of interconnectedness and interrelationship between all of these theories, and specifically by looking at how we define agency in the most naturalistically and mechanistic way possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1157.791,
    "end": 1172.188,
    "text": " nice great it's like saying like we can't have a framework that has a continuity of ice and liquid and gaseous water it's like well it's not saying that there's not face differences",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1173.097,
    "end": 1195.813,
    "text": " um but we want to have something that that like you said doesn't over include or under include and doesn't appeal to extra material or extra systemic factors except credibly and then if we if we um create that uh measure",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1197.582,
    "end": 1222.425,
    "text": " then uh we can we can um talk about the agency of um different systems okay so i hope but but you know in your question you wrote other than unifying ideas into a common framework so maybe one response is little other than that but that's the big deal",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1224.447,
    "end": 1228.472,
    "text": " Um, yeah, I mean, it's, it's, so it's a big deal for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.492,
    "end": 1233.879,
    "text": "It's, yeah, it's, it's, it's a beautiful, uh, it fits in, you know, a nice bigger picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.721,
    "end": 1252.564,
    "text": "Um, and I, yeah, I feel as though there's, you know, a lot of, a lot of things that could come out of, of that framework thinking about it, but it's, it's not apparent to me what that is, uh, at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.995,
    "end": 1282.163,
    "text": " Yeah, I mean, even just the concept that some people may walk around feeling and projecting that there's a difference in kind, incommensurability difference between systems that compute or don't, or cognitive systems or not, agentic systems or not, adaptive systems or not, sentient systems or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1282.582,
    "end": 1286.027,
    "text": " And it's like, well, again, we can have ice and liquid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1287.63,
    "end": 1292.677,
    "text": "So it's not like we're neutering our capacity to distinguish systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1294.119,
    "end": 1295.301,
    "text": "Literally the opposite.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1297.184,
    "end": 1310.985,
    "text": "Proponents, I'm not even saying anyone specifically is, but just allegorically, proponents of incommensurability are actually stymieing their own capacity to compare scientifically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1314.087,
    "end": 1319.354,
    "text": " they may be able to perform qualitative comparison, which is totally legitimate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1319.474,
    "end": 1320.335,
    "text": "It is what it is, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1321.376,
    "end": 1324.12,
    "text": "But you cannot have quantitative comparison.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1324.14,
    "end": 1331.469,
    "text": "It may not be as simple, simple, simple as like a scalar number.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1332.31,
    "end": 1338.778,
    "text": "And I think that's kind of the open space with category theory and different kinds of equality and sameness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1340.26,
    "end": 1365.643,
    "text": " but we need to at least have the art articulations and and the framework just to scaffold these kinds of systems otherwise we're just begging for there to be a different framework i mean if this was the periodic table would we want a different framework for different particles or i i i'm sure we can think of other ways of where this brings a lot of unity um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1368.492,
    "end": 1370.454,
    "text": " Okay, next question that you added.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1372.255,
    "end": 1378.961,
    "text": "Metabasian inference maybe can be applied to understanding any system of interest in which the subject can be considered having beliefs and intentions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1379.762,
    "end": 1381.123,
    "text": "Dan, it's intentional stance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1381.143,
    "end": 1388.83,
    "text": "Yeah, including into the even, you have a thermostat, but not just a thermostat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1388.85,
    "end": 1392.573,
    "text": "Here is a thermostat coupled to an actuator unit because you said it can act.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1393.153,
    "end": 1397.217,
    "text": "But you could say that, yeah, yeah, yeah, a heating system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.074,
    "end": 1408.029,
    "text": " But this intentional stance goes even below where most of the intentional stance people would probably feel comfortable and say, like, that rock just wants to be there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1410.753,
    "end": 1412.996,
    "text": "And so it's like, but that's not intention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1413.056,
    "end": 1415.3,
    "text": "It's like, that's what I'm saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1416.622,
    "end": 1419.686,
    "text": "But either you're going to grant there to be a continuum of intentionality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1419.706,
    "end": 1427.558,
    "text": "And then I think then whether that's realism, is there really a continuum of intentionality?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1428.466,
    "end": 1429.047,
    "text": " Take it or leave it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1429.688,
    "end": 1434.415,
    "text": "But can we approach systems with a continuum of intentionality?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1434.455,
    "end": 1436.338,
    "text": "Absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1436.358,
    "end": 1442.127,
    "text": "And that at least topologically has to have a structure like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1443.249,
    "end": 1447.195,
    "text": "You could have a different model architecture inside of here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1448.677,
    "end": 1453.765,
    "text": "But that model architecture doesn't even have to be what we would consider necessarily a cognitive model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1453.88,
    "end": 1458.465,
    "text": " Why couldn't this be biological variables?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.505,
    "end": 1459.826,
    "text": "And here's the health record.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1459.966,
    "end": 1461.308,
    "text": "And then here's the outcomes of health.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1462.669,
    "end": 1481.068,
    "text": "So this is even more general than cognitive modeling per se, because rather it's just describing the informational relationship between the modeler and the models up to and including systems where the models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1482.23,
    "end": 1505.014,
    "text": " has an aboutness of the laboratory or of the communication itself I was interested in what I was saying what's the relationship between agency and belief because you could have that subjective model that has that could be said to have beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.158,
    "end": 1526.074,
    "text": " But it might not have agency, it might just be medical records, for example, but those medical records could be said to embody a belief that the patient has whatever diagnosis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.665,
    "end": 1545.817,
    "text": " I am sure both agency and belief have copious literature and semantics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1547.819,
    "end": 1562.254,
    "text": "Just off-the-cuff belief having more to do with what we would associate with the perceptual sense-making side of active inference and agency having to do more with the...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1562.993,
    "end": 1592.967,
    "text": " policy selection aspects like and policy selection entailing a sentient or adaptive policy selection entailing some belief architecture you could have something that exhibits a lot of agency and has like minimal beliefs like it's just like flailing or babbling or thrashing potentially so it's it's exerting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1594.6,
    "end": 1615.022,
    "text": " efficacy which under some definitions of agency may qualify with limited belief potentially no justified true belief whereas in their kind of highest marriage we're talking about like beliefs about action planning as inference those kinds of areas",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1616.302,
    "end": 1636.566,
    "text": " ACM Conference 29th, John Wilkinson, Agency implies action on the environment, I think, and, as you say, policies it's it's it's performing some action in a way that can then help it learn, as opposed to you can have something that just forms beliefs and that's just something doing passive inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1643.634,
    "end": 1644.435,
    "text": "ACM Conference 29th, John Wilkinson, um.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1650.862,
    "end": 1654.341,
    "text": " Is ACT-INF model-based analysis actually being applied",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1655.705,
    "end": 1665.916,
    "text": " in areas outside of neuropsychopathy or psychopathology, behavioral economics, systems engineering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1665.976,
    "end": 1673.565,
    "text": "So definitely we can bring in some papers by Henriksen on cognitive economics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1673.645,
    "end": 1682.995,
    "text": "Now, not all cognitive economics is utilizing active inference, but some are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1690.703,
    "end": 1717.707,
    "text": " this name it sounds familiar and i believe it may be using active inference little little but some um industrial systems engineering yes uh well robotics another area um industrial systems engineering",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1718.986,
    "end": 1726.037,
    "text": " Ranging from the most logistical and operational like what versus and others are involved in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1727.639,
    "end": 1732.847,
    "text": "On through like what Stephen Fox is involved in with.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.751,
    "end": 1739.717,
    "text": "social organization so here's this then here we have the.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1739.737,
    "end": 1746.968,
    "text": "Stephen Fox john boyk angle with socio technical systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1748.905,
    "end": 1752.088,
    "text": " um, Niagara ecology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1752.789,
    "end": 1764.761,
    "text": "In fact, I, I, I'm gonna, I'm gonna go to another, um, this, this is a little, little peep into our, uh, into our, our open source, uh, ecosystems document.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1766.102,
    "end": 1774.01,
    "text": "Um, which of course, uh, uh, Ali and, and Neil, you're, you're welcome to be authors on just, just, uh, email me if you, if you don't have the information that you feel like you need.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1774.791,
    "end": 1775.031,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1777.694,
    "end": 1778.996,
    "text": " This is our citation train.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1779.016,
    "end": 1783.283,
    "text": "I think we went from we go from Yeah, literally, citation 799.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1783.564,
    "end": 1804.258,
    "text": "So it's kind of a monster, cognitive neuroscience and cognitive philosophy, artificial intelligence and AI explainability, robotics, human health, clinical psychiatry, social developmental psychology, social sciences, mathematical physics, physics of life, consciousness studies, phenomenology, evolutionary ecology and development,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1811.461,
    "end": 1840.928,
    "text": " cyber and cognitive security mapping and modeling of information ecosystems ontology modeling and maintenance rhetorical analysis logistics and business intelligence theoretical and applied biology and ecology project management team science collective behavior military science if there are some other domains um we will literally add them in fact we probably should add um uh economics",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1842.967,
    "end": 1847.051,
    "text": " I know that we cite some, though, but also I'll just write social sciences and economics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1850.514,
    "end": 1853.696,
    "text": "Any thoughts on this list?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1853.836,
    "end": 1857.039,
    "text": "Or like what other domains would be exciting for you to see?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1857.059,
    "end": 1863.885,
    "text": "No, that's pretty good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.045,
    "end": 1865.767,
    "text": "I'm just going to copy it into the chat, too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1865.827,
    "end": 1867.088,
    "text": "That's too long.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1867.108,
    "end": 1867.488,
    "text": "It's too long.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1867.568,
    "end": 1871.792,
    "text": "I mean, but just I'm going to copy the...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1874.354,
    "end": 1899.332,
    "text": " the document there but but yeah of course we're the textbook group so i'm not gonna go down the rabbit hole with the open source ecosystems but um that's that's exactly what we've been thinking about and and also we didn't even like cite digital gaia versus and so on so um or thought forge or any of our other um colleagues in industry um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1900.983,
    "end": 1902.505,
    "text": " And that's kind of the idea with the ecosystem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1902.866,
    "end": 1909.897,
    "text": "We have people who are working more on the theory and then it's not always so visible necessarily where the applications are happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1909.917,
    "end": 1914.545,
    "text": "But I think we can do a lot of work to improve like the discoverability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1915.927,
    "end": 1921.375,
    "text": "And connect, you know, use the ontology to connect across settings and cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1921.436,
    "end": 1922.477,
    "text": "There's just a lot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1922.497,
    "end": 1924.24,
    "text": "But again, another conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1931.78,
    "end": 1932.1,
    "text": " All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1933.001,
    "end": 1933.282,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1936.205,
    "end": 1938.667,
    "text": "Esmail asked, what is epistemic value?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1940.83,
    "end": 1945.395,
    "text": "Let's see where it comes up in chapter nine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1946.276,
    "end": 1950.921,
    "text": "Otherwise, we can look to an earlier chapter as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1954.204,
    "end": 1955.145,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1955.165,
    "end": 1959.61,
    "text": "Epistemic value is primarily discussed in chapter seven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1961.918,
    "end": 1964.722,
    "text": " Ali, what's your take on epistemic value?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1964.762,
    "end": 1971.892,
    "text": "And Niels, let's just get some, looking from chapter nine, looking back to seven, what is epistemic value?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1975.076,
    "end": 1990.558,
    "text": "Okay, so epistemic value is one of the key terminology of active inference, which is also in parallel with, I mean, from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1990.994,
    "end": 2010.572,
    "text": " practical value because you see, sometimes when an agent tries to infer its best course of action within an environment, it's not always a trade-off between, I mean,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.126,
    "end": 2024.72,
    "text": " the thing that, or it's not a necessary trade-off between survival and also the explore-exploit phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.74,
    "end": 2040.897,
    "text": "So for example, in some of the cases, the agent needs to somehow gather information about the environment, and it actually prefers gathering the information about the environment and the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2041.079,
    "end": 2058.692,
    "text": " the situation in which it resides in order to take more suitable actions for it to preserve its persistence through time, or in other words, its survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2059.794,
    "end": 2062.8,
    "text": "So epistemic value is what",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.78,
    "end": 2087.286,
    "text": " gives a kind of numerical value to this kind of exploring the environment and also how we can use this numerical value in a trade-off between what we gain informationally about the environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.266,
    "end": 2115.045,
    "text": " and the course of actions we take through within that environment so sometimes it acts as a central essential goal or purpose for the agent to increase its epistemic value through its information seeking actions rather than just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.43,
    "end": 2137.59,
    "text": " uh changing the environment uh in order to better fit its generative model nice thank you neil what's your take oh you're muted if you're adding anything or or all",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.308,
    "end": 2151.728,
    "text": " Sorry, I was thinking when I was talking, I think of the things like exploration, exploitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.171,
    "end": 2164.81,
    "text": "So in reinforcement learning, it's very much exploration is for direct impact on the policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.06,
    "end": 2178.377,
    "text": " But we as humans go through life collecting information and storing it with likely no future use of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2178.777,
    "end": 2181.16,
    "text": "So you could say we're epistemic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.641,
    "end": 2188.89,
    "text": "We do epistemic gathering of stuff that has no apparent epistemic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.35,
    "end": 2194.577,
    "text": "But circumstances might change and it might become valuable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.958,
    "end": 2216.363,
    "text": " um so I don't know if there's a distinction to be made between well yeah if bringing in this idea of a value of knowledge yeah that that's a very interesting point about like the pure value of information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.148,
    "end": 2233.373,
    "text": " at least with respect to its role in decision-making, like if we were thinking about people using social media applications and so on, or, or, or, or who knows what else, maybe even",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2234.905,
    "end": 2251.885,
    "text": " just the the desire to to flip every rock over see if there's an ant colony underneath there like there are um uh expected free energy being composed of pragmatic and epistemic value",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2252.219,
    "end": 2258.313,
    "text": " gives us extreme flexibility to model a diversity of settings and cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2259.536,
    "end": 2262.142,
    "text": "So this is summarized in figure 2.6.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2263.546,
    "end": 2267.916,
    "text": "On the left of the main equation, we have pragmatic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2267.896,
    "end": 2287.693,
    "text": " which is how surprising observations are with respect to preferences and on the right side we have the larger epistemic value which is a KL divergence hence can be attractive attractably optimized in the variational Bayesian framework and um three",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2289.682,
    "end": 2294.587,
    "text": " and five are identical, whereas two and four differ.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2296.009,
    "end": 2308.662,
    "text": "And specifically four brings in the observations as conditioned upon that specific policy being enumerated or calculated for expected free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2310.103,
    "end": 2318.592,
    "text": "So under a policy where the observations are not expected to add any value,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2319.567,
    "end": 2327.595,
    "text": " in terms of reducing uncertainty, that policy is not assigned a high epistemic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2328.638,
    "end": 2331.147,
    "text": "It may have a high pragmatic value or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2331.92,
    "end": 2345.558,
    "text": " Whereas a sequence of observations that a given policy provides, which do cause a divergence from what is understood other than through that action being taken, that would be informative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2346.279,
    "end": 2351.906,
    "text": "Again, that may have a positive or a detrimental pragmatic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2352.687,
    "end": 2356.392,
    "text": "Like, I wonder what would happen if I did this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2357.182,
    "end": 2358.784,
    "text": " but that may threaten homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2359.666,
    "end": 2384.202,
    "text": "But having epistemic and pragmatic value unified under a singular decision-making imperative allows us to find these previously unappreciated concepts to be under the umbrella of expected free energy, which we utilize for policy selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2384.485,
    "end": 2398.338,
    "text": " But most briefly, epistemic value is the value of incoming information in terms of observations about hidden states, reducing uncertainty about the hidden states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2402.381,
    "end": 2403.823,
    "text": "Chapter seven deals with it more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2406.465,
    "end": 2414.172,
    "text": "One interesting question maybe for the future is like, how is epistemic value treated differently in the discrete and in the continuous case?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2416.345,
    "end": 2431.965,
    "text": " Like, do you need explicit planning, discrete, potentially maybe even symbolized planning in order to truly engage with the counterfactual value of information?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2433.387,
    "end": 2438.233,
    "text": "So how do we think about the epistemic value of continuous activity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2440.035,
    "end": 2444.361,
    "text": "Like groping, I mean, there might be a connection there to optimal grasp.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2444.594,
    "end": 2450.783,
    "text": " and groping around in a sort of continuous reflexive way to gain a grip on an object.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2453.027,
    "end": 2470.753,
    "text": "But with that load on pragmatic value where optimal grip is preferred and or with that load on epistemic value where how to achieve optimal grasp or what it would feel like to have optimal grasp is not known.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2474.547,
    "end": 2501.719,
    "text": " what are the two related reasons for fitting a computational model to observed behavior i believe this is an exact quote yeah let's uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.382,
    "end": 2511.897,
    "text": " Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2511.917,
    "end": 2514.281,
    "text": "Let's see how well perplexity.ai does.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2519.09,
    "end": 2521.054,
    "text": "It's going to have to context switch a little bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2521.074,
    "end": 2522.998,
    "text": "It's going to have to change languages, but we all do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2530.943,
    "end": 2537.938,
    "text": " I think this is also which more and more synthetic intelligences are going to now it's asking us us a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.14,
    "end": 2543.589,
    "text": "Now, how would it evaluate all the questions that it could ask us?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2546.074,
    "end": 2548.239,
    "text": "Which one should ask?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2548.259,
    "end": 2551.686,
    "text": "Well, active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2559.53,
    "end": 2581.251,
    "text": " will it know what question to ask what path of action is going to be most relevant okay here we go here we go first estimate parameters of interest in terms of computational phenotyping the second is to compare alternative hypotheses",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2581.383,
    "end": 2596.823,
    "text": " So like to give an example from botany, the first one would be like, we have a bunch of strains of corn and we want to know which one has a different growth rate, computational phenotyping.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2597.644,
    "end": 2606.496,
    "text": "The second one would be like, does corn growth rate depend on just humidity or humidity and genotype or humidity, genotype and temperature?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2607.725,
    "end": 2609.828,
    "text": " So the first one is parameter estimation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2610.569,
    "end": 2612.973,
    "text": "Computational phenotyping is parameter estimation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2613.874,
    "end": 2620.725,
    "text": "And the second reason, the comparison of alternative hypotheses is model comparison.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2626.012,
    "end": 2636.348,
    "text": "The synthetic intelligence here has provided a different set of answers that aren't terrible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2644.107,
    "end": 2647.35,
    "text": " And it can't necessarily answer perfectly from the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2650.433,
    "end": 2650.833,
    "text": "Anyways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2650.853,
    "end": 2657.039,
    "text": "9.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2657.139,
    "end": 2657.5,
    "text": "Wow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2662.985,
    "end": 2672.494,
    "text": "Ollie, this looks like somewhat of a little side journey.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2674.988,
    "end": 2677.372,
    "text": " I don't remember it, but it seems like it happens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2680.737,
    "end": 2684.763,
    "text": "Foundationalists, coherentists, infinitists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2691.333,
    "end": 2692.154,
    "text": "That's good to have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2694.037,
    "end": 2694.718,
    "text": "Upvote that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2705.093,
    "end": 2711.885,
    "text": " This goes beyond proof of principle simulations we have seen in previous chapters instead exploits active inference and answering scientific questions, what does that mean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2713.327,
    "end": 2717.354,
    "text": "This is a pretty concise answer previous chapters generated the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2717.414,
    "end": 2720.179,
    "text": "and played around with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2721.361,
    "end": 2723.685,
    "text": "EG used it to generate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.27,
    "end": 2727.051,
    "text": "plausible data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2730.524,
    "end": 2754.844,
    "text": " Now we are building the machinery to take in real data and fit that to data and fit that data to a model to slash with a model to uses on page 174.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2775.479,
    "end": 2776.742,
    "text": " Matt Robertson- map territory fallacy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2776.942,
    "end": 2789.708,
    "text": "Matt Robertson- Not a full question, how does this work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2813.903,
    "end": 2819.352,
    "text": " How does the work connect with the map territory fallacy in the context of Chapter 9 being about data analysis?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2820.333,
    "end": 2825.021,
    "text": "Does the work commit the map territory fallacy or rather help us articulate or evade being fallacious?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2832.593,
    "end": 2834.376,
    "text": "So let's think about Figure 9.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2839.402,
    "end": 2844.759,
    "text": " Some have criticized FEP by implying or suggesting it's guilty of making a fallacy that the map is the territory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2846.504,
    "end": 2851.42,
    "text": "I mean, citations needed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2865.642,
    "end": 2873.277,
    "text": " Also regarding generative process and generative model, we actually spoke with Maxwell in a scientific advisory board meeting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2874.359,
    "end": 2875.181,
    "text": "It was really funny.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2876.884,
    "end": 2881.052,
    "text": "And of course, illuminating of high epistemic value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2881.072,
    "end": 2888.106,
    "text": "Here's what he added this morning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2890.297,
    "end": 2899.026,
    "text": " I, of course, pointed to Ali's question during the innerscreen stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2900.908,
    "end": 2904.131,
    "text": "And he said, there's one generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2904.191,
    "end": 2905.452,
    "text": "It's the system level description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2905.512,
    "end": 2907.854,
    "text": "It's our model of the whole environment agent system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2907.875,
    "end": 2910.317,
    "text": "It is the entire causal connective tissue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2910.417,
    "end": 2913.7,
    "text": "It's a joint density of the real model of the dependencies of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2915.382,
    "end": 2919.426,
    "text": "If the generative model contains a Markov blanket via sparsity, and it does,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2919.727,
    "end": 2929.277,
    "text": " Then you get an additional density, the variational density, where internal states parameterize with an aboutness of external states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2929.457,
    "end": 2936.163,
    "text": "And those internal states will look like they are tracking external things in the sense of the generalized synchrony.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2938.025,
    "end": 2943.171,
    "text": "Generative process refers to the dynamics that give rise to observations that are hard coded in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2943.231,
    "end": 2947.675,
    "text": "And so he analogized that to the Newton's laws.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2949.494,
    "end": 2953.518,
    "text": " It is not the case that the generative model is a model of the generative process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2957.321,
    "end": 2965.97,
    "text": "Philosophers are comfortable with approaches like the Helmholtz and the Boltzmann machine, and from there arose the distinction between the recognition and the generative density, the tailored to densities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2966.951,
    "end": 2969.933,
    "text": "But that is not the sense in which generative model is being used here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2973.397,
    "end": 2977.881,
    "text": "So just kind of a fun update to an ongoing discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2994.601,
    "end": 3020.625,
    "text": " and Carl was there and endorsed and approved well time flies time flies like an arrow fruit flies like a banana as the famous quote said we are at the end of chapter nine now",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3022.09,
    "end": 3025.995,
    "text": " In the coming weeks, we will be heading into chapter 10.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3026.035,
    "end": 3038.352,
    "text": "Then after two weeks on the text and concept heavy chapter 10, we will be closing this cohort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3038.372,
    "end": 3039.453,
    "text": "So it's very exciting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3044.42,
    "end": 3048.165,
    "text": "Presumably after this, we will...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3049.765,
    "end": 3057.453,
    "text": " wrap the transcripts of cohort one, two, and three, and publish those three together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3060.897,
    "end": 3062.379,
    "text": "Anyone have any closing thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3070.968,
    "end": 3071.489,
    "text": "Good session.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.029,
    "end": 3075.233,
    "text": "And I suspect next time, chapter 10 looks good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.31,
    "end": 3076.811,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3077.052,
    "end": 3077.293,
    "text": "Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3077.533,
    "end": 3078.556,
    "text": "Totally looking forward to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3079.679,
    "end": 3079.92,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3081.183,
    "end": 3081.845,
    "text": "Thank you, fellas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3081.965,
    "end": 3083.168,
    "text": "Till next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3084.211,
    "end": 3084.933,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3085.936,
    "end": 3086.016,
    "text": "Bye."
  }
]