[
  {
    "start": 3.187,
    "end": 12.321,
    "text": " Hello everyone, it's July 4th, 2023, and we're in our first discussion on Chapter 2.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 13.263,
    "end": 29.869,
    "text": "So, let us head over there, and before we jump into anything specific, does anyone have any general reflections or thoughts on Chapter 2?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 34.49,
    "end": 57.038,
    "text": " just any any pieces that stuck with them from their reading or just overall reflections from chapter two on the low road yes if i could go i'm not sure whether you guys yeah please um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 57.507,
    "end": 66.603,
    "text": " I was curious in terms of the equations that relate to free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 66.783,
    "end": 70.068,
    "text": "So the manifestations of free energy in those three or four equations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 71.311,
    "end": 73.695,
    "text": "Mathematically, how are those derived?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 73.715,
    "end": 75.077,
    "text": "Because in the textbook,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 75.563,
    "end": 80.774,
    "text": " they kind of just seem to be axiomatically placed there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 81.536,
    "end": 87.75,
    "text": "But I was wondering, what is the underlying mathematical root of those equations from which we work?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 92.701,
    "end": 93.302,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.758,
    "end": 105.722,
    "text": " Sylvain Perron, Thank you yeah the derivations is before equations at least 2.5 and 2.6 is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.905,
    "end": 113.073,
    "text": " I mean, we've done basically complete steps for the derivations of each of those equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.273,
    "end": 121.422,
    "text": "And I'll upload a file explaining each step after the meeting if you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 121.442,
    "end": 125.606,
    "text": "But I'm not sure where to put the files, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.027,
    "end": 126.707,
    "text": "Could you please?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.727,
    "end": 133.575,
    "text": "I mean, where do you think would be most helpful to put those files?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.595,
    "end": 135.557,
    "text": "What file format is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 136.651,
    "end": 165.932,
    "text": " uh it's a pdf so what one option is to just at the top of the notes you could always just drag in a pdf all right just drop it here another option is to um in the github repo for the textbook to add it there in some format um but yeah certainly dropping a pdf or taking screenshots in here would be awesome but yeah this is a great question",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 167.819,
    "end": 176.952,
    "text": " And one more thing about derivations of these central equations is they're not necessarily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 177.725,
    "end": 198.062,
    "text": " Roozbeh Gharakhloo, evidence from the textbook or the way they're expressing the textbook how we can get from each line of the equations to the next slide so I agree, we need some intermediary steps and even we need to employ some mathematical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.329,
    "end": 206.725,
    "text": " some mathematical theorems and rules such as James' inequality rule to get to some of those equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.947,
    "end": 219.308,
    "text": "But I hope, I mean, the derivations we've worked out would be helpful if people want to follow the exact details of each derivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.891,
    "end": 233.43,
    "text": " Yeah, that's awesome work with, um, Ali and Jonathan and Jakob also did some of these preliminary, um, connections for a few of the equations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 236.976,
    "end": 237.336,
    "text": "Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 238.738,
    "end": 249.615,
    "text": "Oh, and we're gonna come to, to these equations and we'll talk about them a lot more soon, but any other just overall chapter two thoughts or, or reflections.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 253.223,
    "end": 281.087,
    "text": " um i thought something that was interesting to me is uh there's kind of a however loose identification between an agent in active inference and their priors this is pulling from page 39 that we can say in active inference the identity of an agent is isomorphic with its priors or the relationship between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.708,
    "end": 285.274,
    "text": " I suppose, the agent and their prior preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.189,
    "end": 309.471,
    "text": "Yeah, the priors are what the thing brings through the needle of the present to confront the incoming observation to then be updated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 309.738,
    "end": 338.918,
    "text": " into the posterior but then that just becomes the prior for the next moment so like if it's not coming with you through the priors it's not making it through the bottleneck of the present it has been forgotten so everything has to come through the presence in order for the past to influence the future that's like the Markovian property of like a Markov chain so not Markov blanket necessarily but actually that is a Markov blanket through time",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 339.438,
    "end": 341.961,
    "text": " past only influences the future through the present.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 342.822,
    "end": 346.668,
    "text": "So everything has to flow through the present in order to have influence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 350.192,
    "end": 362.088,
    "text": "But that is a very interesting claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 362.108,
    "end": 367.335,
    "text": "Any other thoughts or ideas on two, just overall?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 373.829,
    "end": 389.213,
    "text": " Cool, we'll look at some questions, but just the big picture for the next month, I guess for all of July, two weeks on chapter two, that's the low road, and then two weeks on chapter three, that's gonna be the high road.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 390.034,
    "end": 402.013,
    "text": "So first we're gonna talk about how, and this is gonna get us from the basic tautologically true Bayesian theorem",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 403.495,
    "end": 416.93,
    "text": " all the way on through heuristics that are used to fit Bayesian models of perception and action, that's gonna get us to active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 417.731,
    "end": 424.659,
    "text": "And then we're gonna kind of like take a breath, reset, start not from the how on the low road, but the why on the high road.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 425.259,
    "end": 427.562,
    "text": "And that's gonna get us to the same place.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 427.795,
    "end": 438.806,
    "text": " And then that will drop us off at chapter four, which is going to be like another level of depth into the generative model that is used at active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 441.189,
    "end": 441.95,
    "text": "First, I'll just check.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 443.051,
    "end": 443.772,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 443.792,
    "end": 447.856,
    "text": "So I'm going to chapter two specific questions for cohort four.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 448.757,
    "end": 452.2,
    "text": "You can just follow the little token if you want.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 453.001,
    "end": 453.221,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 456.385,
    "end": 456.705,
    "text": "All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 462.153,
    "end": 470.045,
    "text": " Why does the minimization of divergence not also lead to the maximization of model evidence?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 470.065,
    "end": 475.333,
    "text": "Are you not generating new accurate priors that are evidenced by the incoming sensorium?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 479.599,
    "end": 486.81,
    "text": "So if the person who asked this is here, they can unpack it a little bit or anyone else can provide a thought or an idea on this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 487.735,
    "end": 512.308,
    "text": " yeah so i wrote this just uh with an eye on the equation um maybe it'd be good to get it up if possible but no worries if not um which has the kind of action perception uh dual aspect so the first bit is for perception with the kl divergence and the second bit is with action",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 512.423,
    "end": 523.757,
    "text": " Gareth J. My question, therefore, is if we are getting closer to optimal Bayesian inference would you lowering the bound on free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 525.339,
    "end": 533.79,
    "text": "Gareth J. Surely optimizing or getting close to optimal Bayesian inferences therefore driving us to update our priors in a way that will be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 534.547,
    "end": 556.2,
    "text": " that in a way that basically perfectly reduces prediction error and therefore minimizes free energy so I wasn't sure whether is it just that in reality action and perception are always coupled or is there um is there something you know is there a limit to optimizing perceptual inference",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 559.623,
    "end": 580.095,
    "text": " yeah great um topics which equation were you referencing just so we can look at it so it's so if you go back on the textbook um it's worth two so it's on 2.5 and but it's the last one I think so keep going oh sorry 2.6 um yeah so it's the divergence evidence one",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 580.953,
    "end": 606.167,
    "text": " okay okay okay great all right equation 2.5 variational free energy okay so first just to just to give a thought again anyone can raise their hand up if they if they want to add more um the minimization of divergence does lead to the maximization of model evidence so the the um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 608.02,
    "end": 617.558,
    "text": " relationship to keep in mind is that the model with the most evidence for it is going to be the one that minimizes surprise",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 618.517,
    "end": 622.201,
    "text": " Minimization of surprise is itself intractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 622.621,
    "end": 627.366,
    "text": "And so we use this bounding approximation, which is the expected free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 627.787,
    "end": 631.19,
    "text": "So let's think about this with the heights of the children in the classroom.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 631.951,
    "end": 640.82,
    "text": "So we wanna have the maximum evidence estimation for the heights of the children in the classroom.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 640.84,
    "end": 643.663,
    "text": "That's like the ultimate statistical problem that we wanna solve.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 644.538,
    "end": 658.313,
    "text": " Now, if we had the model parameterization that minimized our surprise, so as new heights were drawn, we were minimally surprised, that would be equivalent to having the maximum evidence model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 660.956,
    "end": 670.647,
    "text": "And then surprise itself, which is just like the log of P, that is intractable, and that's why we have a bounding function.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 670.897,
    "end": 698.018,
    "text": " So the minimization of divergence is used as an attractable way because this is going to be a constant with respect to Q. So in terms of the distribution that we actually control the knobs on, Q, this is not going to have any gradient to it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 698.707,
    "end": 706.636,
    "text": " And so that's why variational free energy can be incrementally optimized by reducing the KL divergence here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 706.696,
    "end": 722.215,
    "text": "And you are generating priors that are, you're updating priors based upon incoming sensory data.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 723.336,
    "end": 727.701,
    "text": "I'll just note though that action is not included in this equation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 729.014,
    "end": 732.799,
    "text": " This is purely a functional, it's a function of a function.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 734.001,
    "end": 746.397,
    "text": "It's a functional variational free energy of Q, the distribution that we control, variational approximator, and the data Y. But there's no action selection here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 752.045,
    "end": 754.448,
    "text": "Anyone else want to add a thought on this?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 769.177,
    "end": 770.361,
    "text": " Yeah, Ali, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 775.075,
    "end": 779.187,
    "text": "Well, actually, this duality between minimization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.521,
    "end": 798.992,
    "text": " of the free energy on one hand and maximizing the evidence afforded by the generative model on the other is what usually referred to as self-evidencing mechanism after Jacob Howie's well-known paper from 2014 or 16, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.753,
    "end": 807.385,
    "text": "So the idea is that, well, I mean, a particle and by particle, I mean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.652,
    "end": 825.711,
    "text": " the joint set of internal and blanket states of a system will look as if it is gathering evidence for its own generative model and where its generative model also entails the prior belief",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.691,
    "end": 839.248,
    "text": " that it somehow acts upon later by choosing proper sets of, I mean, policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.808,
    "end": 850.922,
    "text": "And by policy, I mean a set of actions selected by the agent or the particle as somehow,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.341,
    "end": 854.552,
    "text": " minimizing the expected free energy at this time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.933,
    "end": 864.203,
    "text": "So variation of free energy provides a kind of upper limit to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.195,
    "end": 886.343,
    "text": " Uh, to, to the way that, uh, the agent tries to minimize, uh, its perceptual, uh, uncertainties, but then later on in order to, uh, effectuate that uncertainties and to, uh, kind of have causal intervention, uh, onto the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.559,
    "end": 892.567,
    "text": " then it needs to select a policy in order to minimize its expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.028,
    "end": 900.799,
    "text": "So in this sense, both variational free energy and expected free energy can be seen as parallel or dual to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.44,
    "end": 912.415,
    "text": "And we can obviously see from the form of the equations of 2.5 and 2.6 that they're actually mathematically and formally are parallel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.432,
    "end": 915.833,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 917.315,
    "end": 930.893,
    "text": "Another way to see this is like, we're going to come back to it multiple times, but variational free energy is like the real-time perceptual, how's it going?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 932.015,
    "end": 934.137,
    "text": "Because it is purely inferential.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 934.798,
    "end": 940.226,
    "text": "It's real-time as a functional of beliefs and incoming data.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 940.867,
    "end": 944.832,
    "text": "So if we're talking about body temperature and homeostasis,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 944.812,
    "end": 949.156,
    "text": " This is just like how the body temperature is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 949.977,
    "end": 956.523,
    "text": "And so we kind of latch our model's performance and the desire to not under or overfit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 957.263,
    "end": 962.288,
    "text": "That is latched to the ultimate observable layer with incoming data.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 963.789,
    "end": 965.791,
    "text": "But this is a passive equation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 966.752,
    "end": 973.418,
    "text": "But this is the same variational free energy that you would see in a variational autoencoder.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 973.516,
    "end": 998.173,
    "text": " if you had a some bayesian statistics problem and you were just trying to um interpolate um pixels in a variational auto encoder you wouldn't want to over under fit this is exactly what you would have and then in order to have causal efficacy and the imperative there just like mentioned this is going to be a constant term with respect to q",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 998.693,
    "end": 1008.587,
    "text": " So we can minimize the divergence, this KL divergence, which is always bigger than zero, and that pushes down F towards surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1008.907,
    "end": 1013.073,
    "text": "If we had the minimally surprising model, we'd have the model with the most evidence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1014.535,
    "end": 1019.422,
    "text": "And then in 2.6, we get into causal efficacy in a sort of prospective way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1019.842,
    "end": 1020.183,
    "text": "Younghoon?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1023.688,
    "end": 1027.553,
    "text": "Yeah, it's just, I think it's a minor issue, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.528,
    "end": 1047.398,
    "text": " Because our objective is to lower the variation of free energy, it seems to me like it's better to explain surprise as the lower bound of variation of free energy rather than saying that the variation of free energy is the upper bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.34,
    "end": 1072.828,
    "text": " Because, well, the our objective is to reduce the KOI versions of Qx with the posterior so that the free energy itself can be minimized to the surprise itself, so I think it's more intuitive to explain as surprise being the lower bound of the variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.251,
    "end": 1079.035,
    "text": " Yeah, that's a good point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1079.055,
    "end": 1103.305,
    "text": "And also, once you start, oh, well, there's negative F. And so the upper and the lower, whichever way you want to approach this divergence from, when the KL divergence is minimized, then the distance between these two distributions is lower.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1104.112,
    "end": 1106.456,
    "text": " Sorry, not the distance, the divergence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1106.476,
    "end": 1120.457,
    "text": "The only difference between a divergence and a distance in this setting is like a distance is the same from A to B as B to A. And it turns out the KL doesn't have that property, which is why it's called a divergence, not a distance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1120.897,
    "end": 1131.874,
    "text": "However, when variational free energy is minimized, then the approximating belief function Q",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1133.221,
    "end": 1139.728,
    "text": " with respect to the incoming data are doing as well as they can at bounding surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1142.511,
    "end": 1144.974,
    "text": "That's the best fitting model with the most evidence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1145.395,
    "end": 1155.946,
    "text": "I mean, if you knew optimally how surprised to be by what was gonna happen next in the movie, you would have the best model of what was about to happen in the movie.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1156.767,
    "end": 1159.33,
    "text": "And so maximum model evidence",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1160.558,
    "end": 1174.787,
    "text": " can be approached by minimizing surprise minimizing surprise is itself intractable compute so we minimize a bound on surprise which is the variational free energy Ali",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1177.433,
    "end": 1189.866,
    "text": " Actually, that's exactly the elbow or evidence lower bound as encountered in the RL literature or in, I don't know, some other resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.467,
    "end": 1200.317,
    "text": "But yeah, I agree that sometimes it can, at times it can be confusing because elbow is basically the negative variation of free energy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.418,
    "end": 1205.483,
    "text": "So yeah, that's exactly, almost exactly the same concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1207.268,
    "end": 1208.1,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.424,
    "end": 1209.702,
    "text": "And then",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1210.947,
    "end": 1214.67,
    "text": " Martin, you asked in the chat, can surprise be lowered through action?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1215.451,
    "end": 1219.795,
    "text": "Well, yes, these are the two ways to minimize free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1220.635,
    "end": 1223.998,
    "text": "Change your mind, perception, learning, change the world through action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1224.559,
    "end": 1231.805,
    "text": "Now, action cannot directly reduce your surprise about sensory outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1232.045,
    "end": 1233.526,
    "text": "So let's just think about body temperature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1234.147,
    "end": 1235.348,
    "text": "We expect and prefer 37.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1237.129,
    "end": 1240.212,
    "text": "We're getting surprised because we're at 40.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1240.597,
    "end": 1259.702,
    "text": " Now, no action is going to pick up the temperature and move it back to 37, but an action may influence the world, turning on the air conditioner or taking off the jacket, so that future sensory observations are minimally surprising.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1259.722,
    "end": 1266.992,
    "text": "And that's exactly what equation 2.6 describes, which is we're going to evaluate",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1267.462,
    "end": 1271.107,
    "text": " Future courses of action, turn on the air conditioner or don't.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1271.708,
    "end": 1273.31,
    "text": "These are our two policy options.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1274.251,
    "end": 1282.662,
    "text": "Evaluate these two alternative policies in terms of two different criteria.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1284.525,
    "end": 1291.374,
    "text": "What we stand to learn here, Y tilde is the only difference between these two.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1291.854,
    "end": 1293.436,
    "text": "Double line is the KL divergence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1293.497,
    "end": 1295.359,
    "text": "That's what you're taking the divergence between.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1296.267,
    "end": 1304.118,
    "text": " So if Y tilde gave you no information, then this KL divergence would be zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1305.359,
    "end": 1311.928,
    "text": "So if the policy doesn't bring you any, if the new observations don't bring you information, the informational gain is zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1312.749,
    "end": 1322.342,
    "text": "Whereas if you stand to learn a lot from the observations that you expect to get under that policy, the informational gain or the epistemic value is high.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1323.79,
    "end": 1350.844,
    "text": " pragmatic value is about the alignment of observations with your preferences and so actions are selected prospectively in order to um balance surprise but that also includes this epistemic component so it's not just like the kind of dark room well then why don't we just close our eyes and you know",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1351.887,
    "end": 1379.835,
    "text": " curl up because things become more surprising while you're not looking so informational gain is still part of the picture but yes absolutely and that's why self-evidencing is this kind of like unifying imperative that helps us understand the real-time flow of belief updating and sensory perception on one hand",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1381.182,
    "end": 1410.413,
    "text": " and extends that prospectively into the action select action selection case with expected free energy so can surprise be lowered through action not directly however actions are selected prospectively based on their causal efficacy in the world with the imperative of bounding surprise about those observations Darius",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1412.705,
    "end": 1442.408,
    "text": " yes i recognize um i may be jumping the gun on this and maybe we will come to it but um in order to select uh prospective action uh policies uh so as to minimize future free energy presumably just to run the sort of causal regression back there has to be some priors um regarding the probability of that policy reducing free energy so my question is according to the active inference framework",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1443.08,
    "end": 1447.27,
    "text": " what are the initial priors that govern action?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1447.631,
    "end": 1449.916,
    "text": "And I'm talking even here at a very sort of developmental level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1449.956,
    "end": 1461.544,
    "text": "I imagine that genetics has a role to play, but is there also just a picking out of good outcomes initially on basically randomness?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1465.321,
    "end": 1477.426,
    "text": " Yes, this is a very good question, and it speaks to some of the challenging aspects of modeling, which is what do you explicitly versus implicitly bake into the model?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1478.187,
    "end": 1480.693,
    "text": "So this is like looking a little bit ahead to figure 7.3.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1481.354,
    "end": 1483.819,
    "text": "It's the same as figure 4.3, basically.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1484.474,
    "end": 1509.537,
    "text": " the um causal efficacies in the world are captured by the b matrix if i do policy one versus policy two how is that going to change hidden states and then hidden states emit observations so how do agents come to know that turning on the air conditioner reduces the temperature or that putting on a jacket increases the temperature",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1509.77,
    "end": 1513.215,
    "text": " So that's the question of the B matrix being fit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1513.816,
    "end": 1518.443,
    "text": "Obviously, if your B matrix were washed out, action would be meaningless.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1519.144,
    "end": 1527.998,
    "text": "Like if you didn't know or if your actions didn't have any consequence, then action selection is kind of for naught.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1528.265,
    "end": 1539.842,
    "text": " And then depending on the situation, you could think about B being inherited, like inherited prior or like the first prior potentially developmentally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1541.404,
    "end": 1543.307,
    "text": "Also B can be learnt.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1543.987,
    "end": 1557.647,
    "text": "So the consequences of action can be learnt from an initially plastic B. Ali?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1560.85,
    "end": 1576.634,
    "text": " Actually, this is a question that's been asked over and over again as a kind of criticism for active inference framework regarding how exactly those prior beliefs emerged from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1576.694,
    "end": 1587.01,
    "text": "So, I mean, talking a bit more theoretically, philosophically, or even more fundamentally, well, FEP",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.597,
    "end": 1605.387,
    "text": " starts from the presupposition that there is an agent or a particle with certain internal states and then attempts to describe the geometry of the information that's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.772,
    "end": 1612.342,
    "text": " been related to the interaction between those internal states and the external states through Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.883,
    "end": 1621.978,
    "text": "So FEP by itself doesn't say anything about how those internal states emerge from at the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.478,
    "end": 1631.813,
    "text": "Of course, it provides an account for the self-organization through, I mean, describing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1632.738,
    "end": 1648.654,
    "text": " Amit Singer- Describing the process that such internal states can increasingly get more complicated becoming higher dimensional and so on, but I mean by itself it doesn't provide any account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1648.634,
    "end": 1655.582,
    "text": " for any explanation for the emergence of those internal states at the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.982,
    "end": 1673.983,
    "text": "So if we take that as the basic premise of the active inference, I mean, as a precondition for the application of FEP, then I think this question or this criticism can be resolved because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.963,
    "end": 1681.957,
    "text": " obviously FEP never attempts to provide anything more than it claims, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.458,
    "end": 1698.486,
    "text": "So, yeah, that's, I think, one of the crucial points that we need to keep in mind regarding what exactly are the claims, are the theoretical and empirical claims of FEP inactive improvement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.972,
    "end": 1703.733,
    "text": " awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1703.753,
    "end": 1711.363,
    "text": "And this this reminds me of the delightful actual constants.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1711.704,
    "end": 1712.084,
    "text": "argument.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1713.306,
    "end": 1715.849,
    "text": "The free energy principle, it's not about what it takes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1716.049,
    "end": 1717.431,
    "text": "It's about what took you there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1717.451,
    "end": 1724.14,
    "text": "If you're ready for some philosophical tongue twisters.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1726.583,
    "end": 1731.73,
    "text": "The free energy principle is not concerned with the conditions of existence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1733.347,
    "end": 1738.134,
    "text": " So not what has to be the case for something to exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1738.154,
    "end": 1740.838,
    "text": "That's an ontological analysis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1741.759,
    "end": 1748.269,
    "text": "But rather with what must have been the case given that a thing exists.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1749.791,
    "end": 1755.46,
    "text": "So the presupposition of there being a thing is what Ali highlighted.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1756.301,
    "end": 1758.584,
    "text": "It's not about figuring out what it takes to be alive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1758.905,
    "end": 1761.649,
    "text": "Again, what conditions lead to life",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1764.262,
    "end": 1789.493,
    "text": " flip it it's about a system of interest and understanding what must have happened for that system of interest to have been that way which is self-evidencing behavior so it's not that self-evidencing behavior begets life necessarily although that also may be true it's that things that are persistent",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1790.165,
    "end": 1810.629,
    "text": " whether they're inert and simple or conservative active systems, or even strange, sophisticated cognitive systems, whatever level of complexity the thing is, we're gonna be able to do this kind of FEP or active inference analysis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1811.591,
    "end": 1817.758,
    "text": "But that doesn't mean that this is a forward-looking analysis about what it takes to be alive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1819.291,
    "end": 1821.214,
    "text": " But this is an excellent work by Axel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1823.898,
    "end": 1824.819,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1825.28,
    "end": 1827.704,
    "text": "Let's continue through these questions, but these are fun.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1837.299,
    "end": 1837.639,
    "text": "Page 22.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1838.3,
    "end": 1842.767,
    "text": "The results of inference are not necessarily accurate in any objective sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1843.355,
    "end": 1869.531,
    "text": " for a number of reasons biological creatures operate on the basis of limited computational and energetic resources ultimately as all computers do too would these limitations influence the strength of priors in addition to confidence and thus minimize Bayesian surprise for example observations might give rise to surprise but the generative model is not updated",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1869.629,
    "end": 1875.014,
    "text": " due to the inferred energetic or cognitive costs of updating.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1875.734,
    "end": 1884.222,
    "text": "Practical examples being not wanting to change an opinion because doing so requires investment of time to think, discern, etc.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1888.426,
    "end": 1890.568,
    "text": "Yeah, I think it's a great insight.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1891.588,
    "end": 1893.931,
    "text": "People can feel free to add.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1895.032,
    "end": 1898.995,
    "text": "However,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1899.734,
    "end": 1911.617,
    "text": " Strategy selection, cognitive strategy selection may or may not have ultimate accuracy as its imperative.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1911.817,
    "end": 1941.503,
    "text": " as the question highlights whether it's a energy ultimately energetic cost or it's some type of like psychological or energy or cognitive cost of updating or even a time cost or an uncertainty cost or a social penalty type cost um there are a whole host of reasons that an update could be considered Bayesian optimal",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1942.968,
    "end": 1954.416,
    "text": " and not fully or only align with the most accurate account.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1954.436,
    "end": 1954.817,
    "text": "Darius?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1957.643,
    "end": 1958.325,
    "text": "Just a question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1959.127,
    "end": 1960.791,
    "text": "What popped to mind was,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1961.362,
    "end": 1987.825,
    "text": " might that not be the minimization of prediction error or free energy at a higher level of the hierarchy so i may not want to change my mind because of social pressures in turn fulfilling my prediction that i will not be socially ostracized so will a bayesian with an optimal bayesian inference engine might this still be optimal it's just that we're getting skewed by looking maybe not holistically at the entire hierarchy",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1989.695,
    "end": 2003.839,
    "text": " yes this is exactly exactly it like how how can um um even pathological or or harmful behavior be understood as base optimal",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2004.663,
    "end": 2020.673,
    "text": " And the answer there is given the setup of the generative model, the priors the way they are, and the state transition inferences the way they are, the attention the way it is, then name your DSM condition.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2021.314,
    "end": 2027.886,
    "text": "It is a base optimal given the totality of the cognitive model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2029.368,
    "end": 2035.353,
    "text": " And so it's not like some behavior is like, let's just say rational or irrational.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2035.413,
    "end": 2038.496,
    "text": "They're all doing optimal Bayesian inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2038.656,
    "end": 2040.197,
    "text": "The ball is rolling downhill.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2041.218,
    "end": 2046.422,
    "text": "You might not like where the ball rolls or society may say that the ball should have gone this way, not that way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2046.462,
    "end": 2055.39,
    "text": "But it's all like water flowing to the bottom of the hill or the ball rolling to the bottom of the hill on the landscape.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2056.811,
    "end": 2058.953,
    "text": "And that's optimal Bayesian inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2062.493,
    "end": 2086.948,
    "text": " so that's a that's a totally great um point and they'll talk more about um like optimalities measured in relation to expected free energy well if you have a distorted perception of how things are happening in the world then that agent's optimal selection again doesn't mean that the payoff is going to be the highest",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2087.857,
    "end": 2094.163,
    "text": " It just means that it's an optimality concept that's agentic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2097.306,
    "end": 2109.177,
    "text": "So optimal Bayesian inference doesn't mean best of all possible worlds, all the agent does is win, fitness is optimized, the game theory is transcended.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2109.197,
    "end": 2116.243,
    "text": "Optimal Bayesian inference just means given the generative model, the ball rolls down the hill.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2117.692,
    "end": 2130.47,
    "text": " And so if you account for, for example, higher order considerations, then you can end up with what might otherwise be seen as like aberrant or pathological behavior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2133.254,
    "end": 2144.83,
    "text": "So for example, being unable to confidently predict the reactions of others in a social setting",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2144.928,
    "end": 2160.425,
    "text": " might lead one to pursue a sort of self-oriented behavior because it has understandable, predictable consequences like self-stimulation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2162.767,
    "end": 2167.893,
    "text": "Again, that's not to say that it's optimal in terms of the social reward received.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2168.814,
    "end": 2174.26,
    "text": "It's just under the optimality criterion that generative models are actually playing out under",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2175.893,
    "end": 2203.572,
    "text": " all neurodiversity beyond humans even just cognitive diversity is being modeled with this optimal Bayesian framework but connecting back to the cybernetics good regulator theorem and requisite diversity while it's true the results of inference are not necessarily accurate over",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2204.969,
    "end": 2214.661,
    "text": " the developmental or evolutionary timescales, at least the results of inference have to be adequate enough to keep you in the game.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2216.063,
    "end": 2218.186,
    "text": "Otherwise, you're very quickly going to be swept off the table.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2219.708,
    "end": 2226.536,
    "text": "So that's kind of this qualified pragmatism, scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2227.918,
    "end": 2233.525,
    "text": "It's not trying to paint...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2233.673,
    "end": 2251.024,
    "text": " how it really is out there but causal um architectures of the external world though they're not directly observable have to be at least understood well enough in order to make adaptive decision making in a dissipative or adversarial Niche",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2255.746,
    "end": 2259.71,
    "text": " Alexi, what you described accounts for pathology without insight.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2259.831,
    "end": 2265.477,
    "text": "When the patient suffers and knows something is off, I am not sure it's described this way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2265.657,
    "end": 2267.88,
    "text": "Pathology with insight present depression.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2269.902,
    "end": 2270.903,
    "text": "Yeah, metacognition.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2273.766,
    "end": 2280.394,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2280.414,
    "end": 2283.137,
    "text": "Prediction, error, surprise, variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2285.26,
    "end": 2290.688,
    "text": " These terms are related to one another, but sometimes the relations are not immediately clear, causing some confusion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2291.809,
    "end": 2296.215,
    "text": "The common objective of perception action can be formalized as a minimization of the discrepancy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2299.42,
    "end": 2303.345,
    "text": "Sometimes this is operationalized in terms of prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2303.365,
    "end": 2307.09,
    "text": "When is the discrepancy not operationalized as a prediction error?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2309.173,
    "end": 2313.259,
    "text": "If we calculate surprise as per page 19,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2313.307,
    "end": 2316.654,
    "text": " Is this a different than the calculation for related terms?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2317.376,
    "end": 2320.602,
    "text": "What is the possible confusion interchangeably using these terms?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2324.31,
    "end": 2328.178,
    "text": "Okay, I'll give a thought, but Ali or anyone else, please feel free.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2331.084,
    "end": 2332.868,
    "text": "Prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2332.966,
    "end": 2350.435,
    "text": " is like the simple differential or the simple discrepancy i thought it was going to be 10 it came in at 11 so the the simple discrepancy was this amount of units of temperature",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2350.955,
    "end": 2352.697,
    "text": " Thought it was going to be 10 degrees, came in at 11.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2353.097,
    "end": 2356.781,
    "text": "The prediction error was plus one unit of temperature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2358.643,
    "end": 2364.49,
    "text": "In contrast, surprise is an information theoretic quantity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2364.81,
    "end": 2366.873,
    "text": "It's measured in nats or in bits.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2367.353,
    "end": 2369.636,
    "text": "But surprise is like looking at the distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2369.696,
    "end": 2374.12,
    "text": "How surprising is that given observation?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2374.441,
    "end": 2376.643,
    "text": "Kind of like a Z-score in statistics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2376.884,
    "end": 2380.067,
    "text": "Like, oh, this was three standard deviations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2380.233,
    "end": 2384.018,
    "text": " Now, it may be the case that one degree temperature is one standard deviation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2384.138,
    "end": 2389.145,
    "text": "And so it was one standard deviation of surprise for that plus one prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2389.185,
    "end": 2397.396,
    "text": "And then variational free energy is shown in equation 2.5.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2399.078,
    "end": 2409.632,
    "text": "They're related to each other because where the prediction error is zero, surprise is minimized, but not necessarily zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2410.54,
    "end": 2438.674,
    "text": " still non-zero surprise associated with picking the exact highest point on the gaussian minimized surprise but not zero surprise and similarly picking that exact midpoint on the gaussian would minimize variational free energy okay i thought that the classroom was four feet plus or minus one i pull a height it's four feet so it's a minimal surprise minimizing free energy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2440.375,
    "end": 2463.936,
    "text": " minimizing prediction error so they're kind of all um colleagues and helping us point to to different aspects of model fit but they're not the exact same quantity Ali and then anyone else",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2466.532,
    "end": 2486.861,
    "text": " Also, it relates to the difference between the exact Bayesian inference and the approximate Bayesian inference, because basically when we talk about free energy, it refers to the exact amount of the surprisal that needs to be minimized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.881,
    "end": 2490.025,
    "text": "But when we talk about variation of free energy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.005,
    "end": 2504.503,
    "text": " we utilize the approximate Bayesian inference techniques in order to come up with a bound or more precisely an upper bound to minimize the surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.224,
    "end": 2518.78,
    "text": "It's not the exact Bayesian inference because it would be intractable in most real-world situations, but rather it provides an alternative",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2518.76,
    "end": 2520.248,
    "text": " way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.852,
    "end": 2533.728,
    "text": " Roozbeh Gharakhloo, Dealing with the complex situations by providing an upper bound for the surprise, though, mainly the variational free energy also I think it might.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.149,
    "end": 2536.512,
    "text": "Roozbeh Gharakhloo, I mean it might be helpful to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.552,
    "end": 2546.945,
    "text": "Roozbeh Gharakhloo, point out the paper by and you're as i'm going to show me Chi which provides 14 different definitions for the surprise, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.625,
    "end": 2549.728,
    "text": "Roozbeh Gharakhloo, In different contexts so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.502,
    "end": 2560.959,
    "text": " Uh, we also had a guest stream, uh, with, uh, which I recommend watching and, um, looking up that paper as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.543,
    "end": 2571.716,
    "text": "Yeah, this was very, um, very rich paper and stream and discussion where they derived, I think.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2572.017,
    "end": 2572.858,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2572.878,
    "end": 2577.606,
    "text": "How many 18 or 14 surprise concepts.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2579.02,
    "end": 2602.918,
    "text": " include it and show you know again just intuitively if your model is fitting as well as possible if the evidence is the highest you'd be right to expect that surprise would be lowest in general but it turns out that there's actually a plethora of ways that surprise is computed and they're they're not exactly equivalent",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2606.678,
    "end": 2617.394,
    "text": " And, and we expect that many other ontology terms, attention, anticipation, all these kinds of terms where we have a, a broad everyday sense of the term.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2618.555,
    "end": 2622.681,
    "text": "And then we also make technical definitions of them in the active inference ontology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2622.762,
    "end": 2628.069,
    "text": "Many other terms may have also, um, just like words in the dictionary have multiple bylines.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2632.716,
    "end": 2635.3,
    "text": "Great question though.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2635.32,
    "end": 2635.42,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2637.087,
    "end": 2637.408,
    "text": " All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2641.778,
    "end": 2642.299,
    "text": "Equation 2.6.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2642.56,
    "end": 2647.772,
    "text": "So the trade-off between information gain, let's copy it in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2653.793,
    "end": 2682.248,
    "text": " trade-off between information gain and pragmatic value is quite understandable so that's referring to this kind of top line classical decomposition of expected free energy this is our unified imperative for action selection which is we should select policies based upon their pragmatic and epistemic value so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2682.65,
    "end": 2692.71,
    "text": " Not to talk about the other guys, but in reward centric learning, you need to coerce epistemic value into pragmatic value.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2694.344,
    "end": 2699.268,
    "text": " because it's like a single currency of pragmatism or reward.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2699.949,
    "end": 2700.95,
    "text": "So you have reward itself.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2701.01,
    "end": 2707.896,
    "text": "And then you say, well, it's worthwhile to go on this little exploration because the expected reward or the expected utility is such and such.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2708.697,
    "end": 2715.643,
    "text": "So would you rather have $1 on the ground now or 10% chance of 100 by going on this exploration?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2716.184,
    "end": 2721.989,
    "text": "And so reward learning would go on that route, depending on some risk discounting, which we'll look at.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2722.629,
    "end": 2724.351,
    "text": "Whereas an expected free energy,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2724.331,
    "end": 2729.92,
    "text": " We're just jointly considering both the epistemic and the pragmatic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2732.003,
    "end": 2743.16,
    "text": "Now we're going to look at some different decompositions of G. How expected ambiguity and risk interact or are counterbalanced is quite hard to be understood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2743.24,
    "end": 2744.842,
    "text": "Can anyone provide a good explanation?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2746.906,
    "end": 2748.188,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2748.208,
    "end": 2752.414,
    "text": "So does anyone want to give a thought on how would they read G?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2753.069,
    "end": 2776.123,
    "text": " um the second line and I think we'll all look forward to um the derivations and also look to improve the the natural language descriptions with just like the verbatim readings um but what does anyone see in this second line",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2780.305,
    "end": 2781.687,
    "text": " I'll just give a thought.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2781.707,
    "end": 2783.61,
    "text": "So H is entropy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2784.211,
    "end": 2789.899,
    "text": "So this is how blurry or sharp a distribution is, is captured by its entropy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2790.98,
    "end": 2794.205,
    "text": "So the first term, expected ambiguity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2795.207,
    "end": 2802.077,
    "text": "Here we have a distribution of observations through time, Y tilde, given hidden states through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2803.338,
    "end": 2810.008,
    "text": "So this is like how entropic, how...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2810.157,
    "end": 2832.638,
    "text": " sharply defined will observations be so you can imagine a super if there's two outcomes it's going to be really ambiguous if both the outcomes have this have um messy observations you know whether we win or lose if we're getting this static on the radio then the ambiguity is high",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2833.748,
    "end": 2848.405,
    "text": " Whereas this term is gonna be favoring policies that lead to unambiguous resolution of the relationship between hidden states and sensory data.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2849.506,
    "end": 2858.777,
    "text": "So here, the kind of sub imperative is pursue policies, big fancy E, expectation,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2858.977,
    "end": 2866.589,
    "text": " pursue policies that have less ambiguous expected entropies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2869.855,
    "end": 2871.357,
    "text": "So this is just sensory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2871.618,
    "end": 2878.549,
    "text": "This is only about the mapping between the hidden states through time and the sensory observations that are happening through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2880.752,
    "end": 2885.44,
    "text": "The second term, we have a KL divergence, double line,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2886.061,
    "end": 2890.226,
    "text": " on the left side of the parentheses are the sensory observations through time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2891.348,
    "end": 2915.038,
    "text": "And so it's the difference between the sensory observations conditioned on what we do and the sensory observations conditioned on what we prefer, C. So this is risk not in the danger sense specifically,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2915.457,
    "end": 2925.024,
    "text": " but rather a risky outcome or a risky policy is one that leads to a range of outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2926.147,
    "end": 2930.901,
    "text": "A non-risky policy is one that maps tightly to a certain outcome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2933.108,
    "end": 2946.027,
    "text": " So this expected ambiguity term helps us pursue policies that give unambiguous sensory data about hidden states of the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2947.188,
    "end": 2958.745,
    "text": "And this risk term helps us pursue policies that our causal intervention has efficacy in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2961.003,
    "end": 2967.333,
    "text": " the being able to shape sensory outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2976.727,
    "end": 2977.348,
    "text": "This next.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2978.77,
    "end": 2979.271,
    "text": "Yeah, Andrew.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2981.013,
    "end": 2984.158,
    "text": "Oh, I just wanted to say the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.662,
    "end": 2990.969,
    "text": " The most help prior to your explanation for understanding these terms were just the simple examples given in textbooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.789,
    "end": 3006.545,
    "text": "So with ambiguity, I give the example of like the probability of heads or tails in the coin flip conditioned on whether it is sunny or raining will be maximally ambiguous as there's no relationship between the weather and the 50-50 chance of heads or tails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.805,
    "end": 3014.213,
    "text": "So that seems to relate to something like independence of events in that case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.378,
    "end": 3025.587,
    "text": " entirely independent, the result of your coin flip is very distinct and doesn't provide you any useful information about the other scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.921,
    "end": 3034.833,
    "text": " And then with risk, similarly to what you were saying, the kind of one-to-many mapping between policies and outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.893,
    "end": 3043.044,
    "text": "For example, a highly risky policy or action is related to playing a slot machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.645,
    "end": 3051.816,
    "text": "Or say you have a slot machine that has three potential outcomes, each with equivalent probabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.056,
    "end": 3053.498,
    "text": "Well, I do this one action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.798,
    "end": 3056.903,
    "text": " There are a variety of outcomes, you know, that could come out of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.023,
    "end": 3065.798,
    "text": "And so there's very high risk to your action as opposed to, you know, pulling a slot machine and having a guaranteed win every time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.823,
    "end": 3069.104,
    "text": "Nice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3069.304,
    "end": 3069.645,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3071.167,
    "end": 3071.588,
    "text": "Junghoon?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3073.188,
    "end": 3097.069,
    "text": " uh i actually wrote down this question because i got a bit confused about um well so policies that seem to be uh reducing the ambiguity also seems to reduce the risks so like it made me kind of confused because well both",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.488,
    "end": 3101.656,
    "text": " both values would be heading towards the same policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.676,
    "end": 3104.28,
    "text": "So it doesn't seem like it's a trade-off at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.402,
    "end": 3119.428,
    "text": "So compared to the information gain and pragmatic value, which seems to be very intuitively a trade-off, I couldn't catch the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.893,
    "end": 3129.331,
    "text": " a good example or a good explanation about how these two values, expected ambiguity and risk, are interacting with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.558,
    "end": 3135.645,
    "text": "That's a very, very good point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3136.047,
    "end": 3151.83,
    "text": " although explore-exploit is kind of like a classical trade-off and it's one that's going to be approached in the book, you could imagine situations where there's two policies and one of them gives more epistemic value and pragmatic value.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3152.371,
    "end": 3158.18,
    "text": "And similarly, you could imagine situations where they are in trade-off or tension.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3159.141,
    "end": 3163.928,
    "text": "And so similarly, it would be helpful to think of examples like real or contrived",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3165.494,
    "end": 3181.208,
    "text": " um where ambiguity and risk are are aligned or not ali what do you think you're you're muted ali or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3185.592,
    "end": 3186.073,
    "text": " I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3186.333,
    "end": 3186.754,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.155,
    "end": 3188.236,
    "text": "Can you hear me now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.256,
    "end": 3190.18,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.2,
    "end": 3190.44,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.54,
    "end": 3207.529,
    "text": "So the expected free energy somehow unifies various accounts of resolving the ambiguity from different disciplines and different, I mean, from several accounts in psychology, machine learning and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.569,
    "end": 3210.013,
    "text": "So for instance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.073,
    "end": 3219.632,
    "text": " accounting for the risk both in terms of outcomes and in terms of states is inspired from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.848,
    "end": 3234.148,
    "text": " Kahneman and Tversky's work on risk-sensitive policies as applied to economics and also the callback Leibler control engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.789,
    "end": 3241.418,
    "text": "So here, actually minimizing the risk somehow",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.398,
    "end": 3247.827,
    "text": " It corresponds to aligning our predictions to our prior preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.828,
    "end": 3263.068,
    "text": "But well, in the absence of the risk, all we have is just the ambiguity that is basically accounted for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.352,
    "end": 3284.382,
    "text": " in the accounts from James and also Lindley, in which they only account for the resolving of the uncertainties through diminishing the ambiguities and not accounting for the risk implied in each situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.362,
    "end": 3310.31,
    "text": " I think we're short on time, but it can be explained in a bit more detail how exactly those three or four lines of equations can be related to each other and how each of them corresponds with some of the other accounts of how we can resolve those ambiguities and uncertainties through different techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3310.61,
    "end": 3312.192,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.172,
    "end": 3338.112,
    "text": " nonetheless expected free energy to the best of my knowledge is I mean provides the most all-encompassing and unified way of accounting for all of these various techniques of reducing the uncertainty but we can talk about that a bit more in the next session I guess yeah thank you Ali figure 2.6",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3338.851,
    "end": 3361.618,
    "text": " summarizes a few of those threads it shows how like in the absence of pragmatic value what you're left with is an information seeking imperative conversely in the absence of epistemic gain you're left with naked epistemic utility Theory",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3362.02,
    "end": 3376.18,
    "text": " And under another restricted subset, kind of special case of G, you end up with risk-sensitive policy, which is part of that Kahneman and Tversky line of work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3378.063,
    "end": 3386.315,
    "text": "Well, glad that we were able to get to the cohort four, chapter two questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3388.138,
    "end": 3391.943,
    "text": "Next week, we will be at a different time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3392.294,
    "end": 3393.956,
    "text": " but we'll continue on chapter two.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3394.036,
    "end": 3404.03,
    "text": "So whether you'll be able to be here or not, please feel free to add more questions in and upvote other questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3404.751,
    "end": 3419.01,
    "text": "I mean, there's almost 50 questions, but please add upvotes and we'll improve the discourse and maybe record some short videos and continue these great topics together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3419.918,
    "end": 3421.705,
    "text": " as we proceed along the low road.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3422.408,
    "end": 3424.296,
    "text": "So thank you everybody.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3426.927,
    "end": 3427.53,
    "text": "See you next time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3427.55,
    "end": 3427.771,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3428.895,
    "end": 3429.036,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.056,
    "end": 3429.458,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3430.221,
    "end": 3430.502,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  }
]