[
  {
    "start": 7.725,
    "end": 10.527,
    "text": " Hello, welcome to the ActInfLab livestream number 28.1.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 10.587,
    "end": 13.889,
    "text": "It's September 7th, 2021.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 14.929,
    "end": 16.33,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 17.01,
    "end": 22.714,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 23.054,
    "end": 25.335,
    "text": "You can find us at the links on this page.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 26.336,
    "end": 31.239,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 32.159,
    "end": 37.224,
    "text": " All backgrounds and perspectives are welcome here and will follow video etiquette for live streams.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 38.285,
    "end": 45.272,
    "text": "Today on September 7th and next Tuesday, we're going to be discussing this paper on computational phenomenology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 45.713,
    "end": 50.858,
    "text": "Then we haven't set the paper for 29 yet, and then we have a few papers set for October.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 52.881,
    "end": 73.502,
    "text": " today the goal is just to learn and discuss this very cool paper towards a computational phenomenology of mental action modeling meta awareness and attentional control with deep parametric active inference and we're really appreciative that lars the first author is here to discuss with us so we're just going to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 75.151,
    "end": 78.254,
    "text": " Start wherever we start and go from there, I guess.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 78.474,
    "end": 85.221,
    "text": "I think each of us here probably brought some questions and anyone who has a question in the live chat can ask it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 86.942,
    "end": 94.029,
    "text": "So let's just introduce ourselves and end with a author and go from there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 94.529,
    "end": 95.771,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 95.991,
    "end": 100.295,
    "text": "I'm a postdoc in California and I'll pass it to Dean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 102.554,
    "end": 103.535,
    "text": " Morning, I'm Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.855,
    "end": 105.137,
    "text": "I'm retired.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.157,
    "end": 106.038,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 106.198,
    "end": 106.939,
    "text": "I'm in Canada.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 107.379,
    "end": 116.109,
    "text": "And the work that I do ties in nicely with this idea of being able to bring some precision to how we learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.129,
    "end": 118.292,
    "text": "So I will",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.128,
    "end": 121.229,
    "text": " Dave, who can I pass it to?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 121.249,
    "end": 125.493,
    "text": "So Dave, Dave may only be on mute.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 125.633,
    "end": 128.176,
    "text": "He might be on text-to-speech mode, which is fine.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 128.956,
    "end": 129.237,
    "text": "Right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 129.537,
    "end": 131.519,
    "text": "But welcome, Dave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 132.099,
    "end": 133.661,
    "text": "And we'll pass to Lars.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 133.921,
    "end": 136.744,
    "text": "So Lars, welcome to this discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 136.884,
    "end": 138.605,
    "text": "And just thanks again for joining.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 138.645,
    "end": 140.847,
    "text": "We're happy to hear any introduction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 141.508,
    "end": 142.349,
    "text": "And then we'll go from there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 143.806,
    "end": 144.326,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.346,
    "end": 144.786,
    "text": "Well, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.286,
    "end": 145.666,
    "text": "Excuse me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.686,
    "end": 146.006,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.487,
    "end": 147.087,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.127,
    "end": 148.147,
    "text": "I'm kind of excited to be here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.167,
    "end": 150.828,
    "text": "Sounds like a fun couple hours ahead of us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.648,
    "end": 155.589,
    "text": "Just sending regards from the other co-authors as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.689,
    "end": 161.65,
    "text": "Obviously, like a lot of these papers, this has emerged in collaboration with other people and they couldn't make it here today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 162.85,
    "end": 163.89,
    "text": "But I'm glad I'm able to be here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.93,
    "end": 164.55,
    "text": "So my name is Lars.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.451,
    "end": 169.412,
    "text": "I'm based at, my affiliation is with the University of Lyon in France.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.272,
    "end": 171.252,
    "text": "I'm doing my PhD there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.572,
    "end": 176.878,
    "text": " And my focus is explicitly on meditation, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 176.898,
    "end": 179.982,
    "text": "And that's what I'm interested in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.002,
    "end": 181.204,
    "text": "It's what brought me into academia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.725,
    "end": 184.388,
    "text": "I had a first stint in academia in physics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.757,
    "end": 202.582,
    "text": " a while ago and kind of left it and went into corporate stuff for a little while and then was drawn back in by um disinterested in in meditation sorry there's a bit of background or i don't know if you can hear it but um yeah i'll i guess i'll leave it at that the the kind of genesis here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.562,
    "end": 216.105,
    "text": " was from that angle through meditation and ending up in Carl's lab and asking questions around attention and meta-awareness through that lens of practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.165,
    "end": 218.966,
    "text": "And that's where this paper emerged from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 219.166,
    "end": 221.427,
    "text": "So we'll get into that in a little bit more detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.66,
    "end": 223.88,
    "text": " Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 224.34,
    "end": 226.922,
    "text": "And where did active inference come into play?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 227.543,
    "end": 237.229,
    "text": "Was it from something you were learning about from that practice perspective, like you mentioned, or a theory driven perspective, or did a collaborator bring it to the table?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 238.283,
    "end": 239.163,
    "text": " It was a collaborator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.223,
    "end": 250.207,
    "text": "So I sort of came into computational neuroscience looking explicitly to contribute to the field of meditation research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.247,
    "end": 257.789,
    "text": "And so I'd reached out to a lab in Lyon, Antoine Lutz's lab, who's one of the co-authors, and joined the lab there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.889,
    "end": 258.349,
    "text": "And they had a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.971,
    "end": 270.179,
    "text": " like an ongoing relationship with Carl Fristen's lab because Jeremy Matu is one of the coauthors here, did his postdoc over at UCL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 270.939,
    "end": 276.783,
    "text": "And so they had a bit of an idea for an attention project using active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.343,
    "end": 280.926,
    "text": "And I kind of came in not really knowing very much about it, but eager to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 280.966,
    "end": 285.129,
    "text": "And then I was sent off to London with a pretty open",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 285.769,
    "end": 293.034,
    "text": " blank check, as it were, of like, see if you can figure out how to apply this to meditation and attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.114,
    "end": 301.979,
    "text": "And we had some directions that we were thinking about, but then what ended up emerging was this hierarchical sort of deep parametric stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.667,
    "end": 304.887,
    "text": " Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 305.327,
    "end": 307.488,
    "text": "Interesting how it kind of came to be.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 307.508,
    "end": 310.81,
    "text": "Yeah, it really was right place, right time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.85,
    "end": 322.456,
    "text": "They were looking for somebody with a physics background with an interest in meditation and computational neuroscience, and I sent them an email, and that was pretty much the extent of the interview process, and off I went.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.058,
    "end": 327.318,
    "text": "Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 327.559,
    "end": 328.799,
    "text": "Well, welcome, Stephen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 329.5,
    "end": 331.661,
    "text": "Dean or Stephen, if you have a question, you can...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 332.642,
    "end": 335.384,
    "text": " Raise your hand or, of course, anyone in the chat.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 337.446,
    "end": 341.27,
    "text": "Maybe, Dean, did you want to talk about a crosswalk or something like that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 343.772,
    "end": 346.354,
    "text": "I want to do that later, but I don't know if I'm asking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.814,
    "end": 350.357,
    "text": "It's fantastic to get the background about the meditation piece because...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 351.226,
    "end": 363.25,
    "text": " When I before I picked up the paper, what I was wondering about was how precision plays a role in learning and especially when you're moving from novel contexts and trying to familiarize yourself with something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.311,
    "end": 371.974,
    "text": "And so for me, my curiosity was around the idea that when you have the simple model and then you move to these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 373.803,
    "end": 402.743,
    "text": " more nested paradigms you're kind of moving from the unplanned because you can't plan your perception to the plan the idea of being able to think about your thinking and so that transition was what really fascinated me so now that you brought up the idea of meditation i wonder how meditation goes from the unplanned to the plan so you've opened up a pandora's box for me because now my original question is kind of now i've been taken down this tangent so i'm curious right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.243,
    "end": 407.406,
    "text": " Well, I mean, I can speak to that a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.628,
    "end": 429.461,
    "text": "The idea for me going in here was to see, I mean, just intuitively, as soon as I got familiar with active inference, there was a resonance there in terms of how the maths seems to echo a lot of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.842,
    "end": 440.821,
    "text": " the kinds of ways that people talk about practice in general, there's this sort of balance between, you know, attention and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.319,
    "end": 466.559,
    "text": " the the the that our perception is this this combination of prior and observation you know that idea and like how these two things are balanced and and getting into um the optimal space there is very very close to you know if you start thinking about mindfulness obviously as a way of paying attention and increasing the impact of the sensory observations but then also things like um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.543,
    "end": 476.693,
    "text": " don't know mind, beginner's mind, this kind of fresh kind of stance that is very common in Zen, but in other areas as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.153,
    "end": 479.616,
    "text": "And so already there was this kind of like, ooh, there's something here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.656,
    "end": 481.178,
    "text": "And so I arrived at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.201,
    "end": 505.807,
    "text": " carl's lab and and what i started out with was just getting familiar with the attention literature uh because that's at least you know the a good way in for meditation because at least in the very beginning that's what it's all about and in some ways it's about that right to the end but um so the question was uh you know how do we uh talk about paying attention um within the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.867,
    "end": 526.98,
    "text": " Already and I was really fortunate because I was kind of coming into the space when all the scaffolding and the maths I needed to start talking about this in a more practice related way or Metacognitive way was already there All it really needed was somebody to come in and ask a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.0,
    "end": 532.464,
    "text": "That was for me phenomenologically driven which was in meditation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.238,
    "end": 536.979,
    "text": " you are paying attention for sure, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.079,
    "end": 550.246,
    "text": "You are deliberately paying attention to some object, you know, traditionally the breath, but really the aim of the game is, or an additional part of that, which is really, really important is being able to monitor where your attention is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 551.546,
    "end": 553.747,
    "text": "So in other words, being able to pay attention to attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.168,
    "end": 557.909,
    "text": "And so that's where that kind of shift happened, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.969,
    "end": 560.43,
    "text": "And you've mentioned like thinking about thinking it's like, well, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 560.451,
    "end": 563.372,
    "text": "So if we know some of the maths about, you know, what it means to pay attention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 565.105,
    "end": 566.926,
    "text": " What would it mean to pay attention to attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.006,
    "end": 569.528,
    "text": "And what would it mean to be able to have control over the attentional states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.108,
    "end": 572.97,
    "text": "And how would this, how would we,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.435,
    "end": 602.457,
    "text": " make that an allowable thing within within the framework um yeah so exactly the deep affective framework kind of set the set the scene for that um and casper casper tell's work sort of gave the gave the hint and that was on a different precision in the model and here we're just talking about likelihood precision and then that kind of created this this um opportunity then right that then becomes almost generalizable across and that's and we can get to it a bit later but really what i'm more excited about in this in this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.798,
    "end": 620.871,
    "text": " whole work and paper really is what we start to hint at in the discussion at the end, pointing to the fact that we could generalize this across precisions throughout the model that could then be interpreted as different forms of mental action and what that might mean for understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.891,
    "end": 624.354,
    "text": "Yeah, I mean, it gets broad at that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.59,
    "end": 648.818,
    "text": " awesome thank you for the summary and welcome blue at all at feline so steven with the raised hand and then any live chat or anyone else with a raised hand yeah welcome um yeah i was i'm really curious i like the what you're saying about the generalizability or the potential for generalizability in your",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 649.557,
    "end": 655.204,
    "text": " So extending beyond neurophenomenology to phenomenology in general, I suppose, is an aim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.224,
    "end": 660.711,
    "text": "I'm curious how you see action potentially coming in with meditations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.584,
    "end": 680.372,
    "text": " because you talk about sort of reflecting on mental states, like breathing is an action, I suppose, but in many cases they use meditation because you're reducing the amount of action that's happening and the amount of visual stimulus, because often the eyes are shut, you know, body's contained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.432,
    "end": 685.994,
    "text": "And now I see that, you know, okay, so how does this then come back into an action state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.034,
    "end": 689.155,
    "text": "And I know that there's a kind of in-between, like I know Vipassana,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.465,
    "end": 709.066,
    "text": " vipassana type meditation on the body's senses or like you mentioned the breath but I'm curious how you see that kind of inactive piece starting to come in through this no thanks for the question and it's a really central one because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.186,
    "end": 725.239,
    "text": " I mean, I guess to give a little bit more history to this paper, this is also building on a little bit of some of the intuitions of previous work by Antoine and Jeremy and another collaborator, Giuseppe Pagoni.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.0,
    "end": 733.867,
    "text": "And they wrote a paper called On the Epistemic Value of Inaction, which speaks to this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.368,
    "end": 735.608,
    "text": "I think...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 736.289,
    "end": 756.962,
    "text": " to in the beginning off from the from the outset we can kind of separate you know mental action and overt action and in meditation you know you're putting yourself in this situation where you you know deliberately don't have that much overt action right you're sitting still and yet you're doing things you're definitely doing things with your mind even sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.769,
    "end": 762.353,
    "text": " Do nothing meditation is still a kind of doing in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.853,
    "end": 764.855,
    "text": "It gets a little bit sticky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 765.456,
    "end": 774.165,
    "text": "But for me, to answer your question, the cessation of overt action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.202,
    "end": 791.287,
    "text": " puts you in this highly epistemic state because now the sort of self-evidencing side of the equation, you're putting yourself in a situation where that is harder to access so that, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.91,
    "end": 807.409,
    "text": " you you no longer can fulfill your expectations through you know action acting in the world right so like um if you were to sit down and start getting um agitated or bored",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.05,
    "end": 828.24,
    "text": " rather than the sort of fulfilling the expectation there that you shouldn't be bored by going and doing something you have to stay stay bored and there's a certain discomfort that can arise from that and then the role of mindful sort of acceptance in that moment it becomes central but then what it allows then for is that that your model has to update right if the model can't be sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.86,
    "end": 831.363,
    "text": " can't find evidence for it, well, then you got to update it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.764,
    "end": 835.769,
    "text": "And there you get to this notion of vipassana, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.789,
    "end": 838.552,
    "text": "Which is like inside, clear, seeing inside, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.572,
    "end": 843.819,
    "text": "Is that you're learning something through that that wasn't available to you the moment before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.06,
    "end": 848.823,
    "text": " And like apologies to everybody out there who's like maybe very into the meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.003,
    "end": 856.028,
    "text": "Like this is very sort of hand wavy way I'm talking about it, especially kind of like matching it over to the active inference, a very sort of loose way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.088,
    "end": 864.814,
    "text": "But that was kind of the gut intuition anyway coming into it and remains the intuition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.054,
    "end": 869.617,
    "text": "And I think there's this really, for me anyway, and where I'm kind of seeing my...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 870.638,
    "end": 888.844,
    "text": " My career with this going just is the very beginning of an exploration of how to articulate meditations, different practices, how they might cash out in terms of precision dynamics, different forms of learning, different forms of optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.384,
    "end": 891.705,
    "text": " and what that might mean for us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.785,
    "end": 906.672,
    "text": "So I think that's why I wanted to start with attention because it's pretty uncontroversial, as it were, and just start building up the building blocks and be able to start making more and more interesting inferences about what it might mean to be doing other kinds of practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.013,
    "end": 909.914,
    "text": "Awesome answer.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 910.294,
    "end": 910.674,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 911.715,
    "end": 916.117,
    "text": "So blue or yes, go for blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 918.749,
    "end": 918.849,
    "text": " Hi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 919.049,
    "end": 930.193,
    "text": "So I don't know if you had a chance to watch the discussion or like the preliminary discussion we did yesterday, but something that came up was in the idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 930.253,
    "end": 934.714,
    "text": "So Daniel, can you flip to the circle about like attention and attention?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.795,
    "end": 936.995,
    "text": "Here?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 937.015,
    "end": 937.455,
    "text": "This one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 937.815,
    "end": 940.416,
    "text": "Yeah, that one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 940.976,
    "end": 945.898,
    "text": "So something that came up there when we were discussing this figure was like the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 946.537,
    "end": 952.601,
    "text": " the discrete steps between like distracted awareness of distraction, redirection of attention and focus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 953.142,
    "end": 970.413,
    "text": "Like, you know, there's kind of like an intuitive feeling that the distracted awareness of distraction and redirection of attention back to focus is like discrete, but like there's a transition that's kind of muddy going from focused to distracted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 970.433,
    "end": 974.936,
    "text": "And something that I thought about was like, so you can become so intensely distracted",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 975.762,
    "end": 977.003,
    "text": " focused on something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 977.323,
    "end": 984.407,
    "text": "And like the example that I'll give you, because you'll relate, it's like going down a scientific rabbit hole, like where you're chasing reference after reference after reference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 984.807,
    "end": 990.47,
    "text": "And so you're still on task and you're still correctly paying attention to what it is you're supposed to be paying attention to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 990.771,
    "end": 993.932,
    "text": "But like, you're so focused that you're finally off task, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 993.952,
    "end": 996.114,
    "text": "Because you just start getting interested in other things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 996.554,
    "end": 999.756,
    "text": "And so it's kind of a gradual transition from focus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 999.796,
    "end": 1003.438,
    "text": "Like you're still focused, but you're, you're like focused on the wrong thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1003.857,
    "end": 1012.404,
    "text": " And so I just was wondering, where in this model do you think that kind of focus, until you're so focused you're not paying attention, where does that come into this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1012.504,
    "end": 1014.585,
    "text": "Or how do you think to model something like that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1015.486,
    "end": 1017.288,
    "text": "Yeah, thanks for the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.348,
    "end": 1022.672,
    "text": "So this model that we're seeing here is, of course,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1024.252,
    "end": 1026.033,
    "text": " a bit of a caricature, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.954,
    "end": 1034.36,
    "text": "It's an intuitive sort of description of what's happening because you're right, there's degrees of distraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1035.22,
    "end": 1038.723,
    "text": "And, you know, in meditation we talk about, you actually can classify these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1038.743,
    "end": 1041.405,
    "text": "You know, there's when you sit down to try and pay attention to the breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.905,
    "end": 1042.746,
    "text": "There are times when you've",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1043.306,
    "end": 1071.356,
    "text": " totally forgotten that you were even meant to be meditating and you were like gone right you're thinking about something completely different and then the timer goes off and you become aware that you were completely gone but then there's other things that are much more subtle right that's like maybe you notice some sound in the room or you know some sensations in the body but still somewhere in your awareness the breath it remains present but maybe less and more in a background foreground kind of situation and so like are you distracted then or not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.176,
    "end": 1075.919,
    "text": " and to what extent, and all these things and everything in between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.44,
    "end": 1087.967,
    "text": "So in terms of how that would cash out here, the first thing to point out to is that the precision parameter that we're talking about is a continuous parameter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.567,
    "end": 1091.71,
    "text": " And so it doesn't have to be relating to discrete states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.79,
    "end": 1099.097,
    "text": "And we could have been free to make more granular the attentional states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.117,
    "end": 1105.844,
    "text": "So it's not just distracted or focused and sort of have grades of focus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.545,
    "end": 1107.365,
    "text": "Would have been possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1107.566,
    "end": 1111.549,
    "text": "But then the other thing that isn't modeled here is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.873,
    "end": 1114.154,
    "text": " what are you distracted by?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1114.174,
    "end": 1119.477,
    "text": "Here, distraction was just not paying attention to the thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.078,
    "end": 1128.803,
    "text": "But in reality, distraction is your attention being grabbed by some other stimulus and for some particular reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.544,
    "end": 1133.766,
    "text": "And that is not shown in this work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.786,
    "end": 1137.188,
    "text": "That's something that we're hoping to start to work on in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.149,
    "end": 1154.086,
    "text": " Part of the reason why we didn't go down that direction here in detail is because there's still, I think, a really central part that is difficult to tease out still at the moment, which is attentional resource.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.879,
    "end": 1172.849,
    "text": " in some ways, you could run this simulation and given the preferences on wanting to be paying attention, if you put that preference on a bunch of different observations, there's nothing stopping the agent just paying attention to all of it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1173.31,
    "end": 1178.533,
    "text": "Maximally, and having really high precision observations across the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.053,
    "end": 1181.915,
    "text": "Now, that doesn't seem to be what we're able to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.955,
    "end": 1182.756,
    "text": "There seems to be like a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1183.576,
    "end": 1209.509,
    "text": " a finite um something finite about it and so when you're paying attention to one thing it's at the exclusion of something else and maybe part of practice and part of you know what you're getting in meditation is that that you know is softening a little bit your ability to sort of pay attention to more than one thing or have more allocation resources there in some way that might be learned over time but that's not um that's not shown shown here which is why you don't get that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.74,
    "end": 1235.18,
    "text": " what you're talking about that kind of intuitive organic uh feeling of what it means to be what it really means to be distracted awesome i have a question and then blue so we've talked a lot about how spatial goals are set and even how some symbolic goals are set like sentence structure but how are cognitive goals set",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1236.401,
    "end": 1254.142,
    "text": " so are they reducible to sensory preferences if so just the preference for you know some salt and sugar that's not going to really reduce your options in the city so how do we set those higher level and these increasingly like abstract and ephemeral cognitive goals",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1256.587,
    "end": 1283.901,
    "text": " yeah no thank you for that daniel um this is the the question i'm working on right now actually on a follow-up paper where i'm trying to take this model and and and specifically model uh focus attention meditation and in that and in practice in general the the question of motivation and goal is really central and where where in the model are you actually putting like how are you driving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.827,
    "end": 1287.962,
    "text": " the attention behavior or meditation behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.551,
    "end": 1311.127,
    "text": " One of the ways, the way that I did it here was to say that in this kind of setup that the agent is given an instruction, hey, I want you to pay attention to this stimuli and that that then translates to them wanting to see themselves in the attentional focused state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.608,
    "end": 1317.592,
    "text": "And so the way that the dynamics here are driven is by having a preference on that attentional state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1319.074,
    "end": 1320.856,
    "text": " and observations of that state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.936,
    "end": 1325.462,
    "text": "So the kind of like metacognitive observations of seeing yourself paying attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1326.323,
    "end": 1327.104,
    "text": "Here, yeah, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.164,
    "end": 1329.627,
    "text": "So O2 there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.448,
    "end": 1333.892,
    "text": "We put a preference on those ones, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1334.913,
    "end": 1361.309,
    "text": " um and uh just as a side note there you might think like uh but do those observations uh exist really are they sensory observations what kinds of observations are these um and i think that's a valid valid question and something we talked about for a while but my intuition here is that you know if i were to ask you the question um what are you paying attention to right now right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.233,
    "end": 1389.029,
    "text": " and you're gonna be able to give me an answer from having observed something um and so there's some kind of an observation there that you're able to make that you can um use to infer uh what attentional state that you're in so anyway that's where the preference is is is uh there you know i prefer to observe myself paying attention exactly so then the question is what is it that drives uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.865,
    "end": 1392.686,
    "text": " you know, like a practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.866,
    "end": 1418.203,
    "text": "And I've been inspired by some of the work by Mirza and colleagues on sort of scene classification or scene perception, where there seems to be this attentional, driving of attentional policies given another kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.363,
    "end": 1424.647,
    "text": " preference, which is to resolve a scene, which is to clearly perceive a scene.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1426.209,
    "end": 1433.935,
    "text": "And that's actually the way that I'm starting to think about, at least in a practice context, in like a meditation context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.436,
    "end": 1443.023,
    "text": "Because in reality, when you're meditating, it's not so much that you're trying to pay attention to the breath, although we talk about it like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.503,
    "end": 1447.287,
    "text": "It's more like you're trying to be continuously aware of the breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1448.671,
    "end": 1459.096,
    "text": " So you have some kind of a preference on perception or being able to resolve a hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.676,
    "end": 1465.499,
    "text": "And that is then what drives the kind of dynamics behind the scenes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1469.12,
    "end": 1470.781,
    "text": "That's pretty interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1471.381,
    "end": 1472.502,
    "text": "Thank you for the response.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1473.002,
    "end": 1473.182,
    "text": "Luke?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1475.723,
    "end": 1479.364,
    "text": " Sure, that kind of slides in nicely to what I was going to ask.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1479.444,
    "end": 1485.825,
    "text": "So as a follow-up to my question earlier and also to Daniel's question, Daniel, can you flip to the mind wandering slide?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1486.305,
    "end": 1486.685,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1487.625,
    "end": 1487.985,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1489.945,
    "end": 1494.806,
    "text": "So I had a question here, and these are two different models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1495.026,
    "end": 1504.508,
    "text": "The one on the left specifically is from the Mind Life Institute by a PhD who works with, you know, meditators, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1505.023,
    "end": 1514.931,
    "text": " And so, and then the one on the right, I'm not sure if that's an explicit meditation task, but I just thought there was an interesting context here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1515.531,
    "end": 1519.455,
    "text": "So this paper on the right, which is the neural model of mind wandering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1520.395,
    "end": 1526.18,
    "text": "So you have like this paradigm where you're on task, which is like in the meditation context, say focused on the breath or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1526.704,
    "end": 1533.467,
    "text": " I mean, maybe it's not focused on the breath, but I just, I think about meditation as, you know, being present in the, in the present, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1533.487,
    "end": 1536.689,
    "text": "Being in your, in your body, aware of your hands, feet, breath, et cetera.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1538.31,
    "end": 1543.432,
    "text": "So there's this model where you're on task, which is like focused on what you should be focused on in present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1543.953,
    "end": 1550.196,
    "text": "And then mind wandering, they talk about as the pursuit of internal goals, which I thought was interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1550.236,
    "end": 1552.437,
    "text": "But I think about that in terms of like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1552.947,
    "end": 1557.429,
    "text": " thinking about your shopping list or all the things that you're not supposed to be thinking about while you're meditating, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1557.449,
    "end": 1561.631,
    "text": "Like just going off and pursuing your own internal goal oriented thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1562.011,
    "end": 1572.436,
    "text": "And then I have a separate category for being actually off task, which is like where you're not thinking about anything you should be thinking about, but just thinking about like random, like whatever nonsense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1573.236,
    "end": 1574.817,
    "text": "And so I just wonder, like, do you,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1575.706,
    "end": 1583.632,
    "text": " or could you think about making those kinds of distinctions in this kind of like, and it goes from, from being focused on the right thing to focus on the wrong thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1583.652,
    "end": 1586.594,
    "text": "Like where does this off task come into play?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1586.654,
    "end": 1588.916,
    "text": "I'm just curious if you have any thoughts on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1590.637,
    "end": 1599.823,
    "text": "Um, I'm not exactly sure how they talk about off task, but what I could talk about here is the distinction between, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.715,
    "end": 1612.542,
    "text": " To me, the distinction here comes down to the meta-awareness piece, where on-task is pretty understandable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.323,
    "end": 1618.828,
    "text": "Off-task, you could imagine just doing something else, but aware of that fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.585,
    "end": 1627.471,
    "text": " You know, like I've just decided to change and start focusing on something else, but there's sort of a metacognitive awareness of the fact that you are doing something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.352,
    "end": 1646.946,
    "text": "Whereas mind-wandering is this slightly, or at least the way that we're talking about it here, different situation where you're distracted or you're paying attention, by when I say distracted, I just mean paying attention to something you hadn't intended to pay attention to, but also not aware of that fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.808,
    "end": 1651.652,
    "text": " You haven't updated the fact that that's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.752,
    "end": 1660.579,
    "text": "And that's the crucial piece here that we're trying to regulate with practice or whatever in an intentional task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.36,
    "end": 1663.502,
    "text": "And for that distinction, I think...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.307,
    "end": 1672.151,
    "text": " active inference kind of, you know, it almost gives you that for free in a sense to kind of show you where, where that phase would be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1672.231,
    "end": 1682.517,
    "text": "And that's what we were kind of showing in the results is that that period of, of updating of where your attentional state is when you sort of think it's one, but it's actually another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.537,
    "end": 1694.604,
    "text": "So you think you're paying attention or you're somewhere, you don't really know where you, what you're doing, but you're, you're distracted is then how we would sort of express that or cash that out computationally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.111,
    "end": 1713.26,
    "text": " In terms of active inference, I just wonder, is off-task or mind-wandering, I had never thought to split those two apart until I saw this paper and maybe check it out if you have time at some time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1714.68,
    "end": 1719.743,
    "text": "Really, I think about this mind-wandering, is this epistemic exploration?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1720.123,
    "end": 1724.906,
    "text": "Is it exploitation when you're on task and you're focused on what you should be and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1725.917,
    "end": 1729.822,
    "text": " We think about active inference in terms of optimizing exploration and exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1729.842,
    "end": 1735.088,
    "text": "Is there room in the model for that, epistemic exploration, or is it always a bad thing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.108,
    "end": 1737.872,
    "text": "Is it always a bad thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.649,
    "end": 1741.27,
    "text": " You know, I don't have a good answer for you to be honest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.29,
    "end": 1746.832,
    "text": "This is what we kind of want to go towards when I was saying, you know, what are you distracted by?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.992,
    "end": 1751.214,
    "text": "And what's the why behind, you know, the default loan network, basically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.274,
    "end": 1752.934,
    "text": "Like, what is the value of that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1752.954,
    "end": 1754.495,
    "text": "On the one hand,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.236,
    "end": 1772.719,
    "text": " I could imagine that, yeah, there's sort of like an epistemic wandering through state space and future possibilities and just sort of monitoring of potential negative outcomes in the future, for which there's obviously value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.159,
    "end": 1775.72,
    "text": "And I don't think it's necessarily a bad thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.74,
    "end": 1781.041,
    "text": "I think when I, you know, in a practice context anyway, it's like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.276,
    "end": 1788.88,
    "text": " that action can also lead to discomfort now and anxiety now because you're sort of simulating future bad events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1789.2,
    "end": 1790.561,
    "text": "And there's actually a great paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.581,
    "end": 1791.981,
    "text": "Casper wrote a good paper on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1793.222,
    "end": 1793.482,
    "text": "Deep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.122,
    "end": 1794.543,
    "text": "I've read it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1794.743,
    "end": 1795.023,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.263,
    "end": 1795.543,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.583,
    "end": 1797.604,
    "text": "The simulated future events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.105,
    "end": 1802.947,
    "text": "Well, and so often meditating like frees up space in your mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1803.067,
    "end": 1811.552,
    "text": "I mean, I don't know if you've had the experience, but like where you're not thinking about some other problem, but like you'll be meditating and like, Whoa, have this like brilliant flash of brilliance or, or,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1811.96,
    "end": 1813.501,
    "text": " like key moments of insight, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.521,
    "end": 1814.261,
    "text": "Like Vipassana.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1814.702,
    "end": 1823.707,
    "text": "So there's just like insight, but it's maybe not insight into like some internal, like deep spiritual discovery, but it might be like insight into some external problem that you're having.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.727,
    "end": 1825.468,
    "text": "So there's that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1825.528,
    "end": 1829.43,
    "text": "And so I wonder, like that might be the difference between off task and mind wandering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1829.77,
    "end": 1836.634,
    "text": "Like if you're off task, it's like maybe a non-beneficial or like there's no excuse for, it's just like doing blah, blah, blah, whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1836.734,
    "end": 1840.156,
    "text": "And then mind wandering might be like exploring your neural space",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1840.666,
    "end": 1843.587,
    "text": " And in like a recombination phase, I think about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.747,
    "end": 1845.967,
    "text": "So anyway, it's just something to think about going forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1847.088,
    "end": 1847.588,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.148,
    "end": 1848.468,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.528,
    "end": 1866.513,
    "text": "No, I think the notion of insight and the kind of why practice leads to that is really exciting place to start thinking about, like, what is it about paying attention in a particular way that leads to these moments of aha, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.4,
    "end": 1869.68,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1869.74,
    "end": 1872.041,
    "text": "I'm going to read a question from Dave.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1872.701,
    "end": 1887.086,
    "text": "Dave wrote, a practice I've been following based in Naropa Institute's shamatha practice, but not much stress there, is to attend only intermittently, say, permit mind wandering during the out-breath, but attend during the in-breath.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1887.767,
    "end": 1888.627,
    "text": "There are two effects.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1889.067,
    "end": 1893.509,
    "text": "Obsessional thoughts are disattended without intending to disattend to any content.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1894.269,
    "end": 1900.513,
    "text": " The motion of the transition from disattentive to attentive occurs many times.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1901.053,
    "end": 1908.157,
    "text": "The usual return gently to resting the attention on the breath happens several times a minute rather than several times per hour.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1908.718,
    "end": 1911.139,
    "text": "Does anyone else do this or discuss it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1911.439,
    "end": 1912.78,
    "text": "Maybe to warn against it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1913.18,
    "end": 1915.482,
    "text": "Close parenthesis hyphen to your knowledge.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1917.174,
    "end": 1917.674,
    "text": " I like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.754,
    "end": 1937.169,
    "text": "I didn't know, I haven't heard of a practice like that before, but in the way that you're describing it, I could see a way that would be really, really powerful and really useful because one of the pitfalls, I can tell how this conversation is going to go more and more into meditation, but I'm up for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.229,
    "end": 1937.569,
    "text": "I'm game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.11,
    "end": 1940.371,
    "text": "But one of the pitfalls, of course, in meditation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1941.332,
    "end": 1964.238,
    "text": " in practice is is all these subtle ways in which resistance can come up towards our own minds and if we are paying attention and we start to see distractions as things that are stopping us from paying attention and that we don't want right then it creates this tension and is actually counter to what we want to be going for and i could see how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.918,
    "end": 1980.869,
    "text": " by deliberately letting mind-wandering happening and coming back, it sort of cuts that tendency to have resistance to thoughts, which actually just ends up perpetuating them or giving them more potency in the mind, whereas really the aim is to pay attention to the breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.469,
    "end": 1986.573,
    "text": "And it's funny because when we say pay attention, we think like it's this, like, focus, you know, thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.253,
    "end": 1992.196,
    "text": "In reality, 90% of it is relaxation and letting go and letting go of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.607,
    "end": 1995.648,
    "text": " the resistance to distractions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.708,
    "end": 2000.589,
    "text": "Distractions come and then we come back to the breath and that's what kind of does the work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.729,
    "end": 2017.235,
    "text": "So I would love to, I'm going to look into that a little bit more detail, that style of practice would be interesting to see when we have a more fleshed out version of this, like how different approaches to practice might lead to different kind of learning outcomes at different rates, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.721,
    "end": 2043.286,
    "text": " that topic of distraction it's like if somebody were a captain and they cited something very subtle that wouldn't be a distraction that'd be on task so then there's this aspect of the multiple levels like there's the eye circading and then there's higher higher and modeled in this paper greeting scott um at slower and slower kind of clicks of the model",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2044.446,
    "end": 2068.563,
    "text": " and uh so it's just interesting yeah what a distraction implicitly says that it's not on task because if it was even something that was unexpected that drew the regime of attention that way if it were relevant for the task then it would still be considered not a distraction part of the relevant stimuli for the task but the exact same stimulus might be off task in a different context like five minutes later",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2070.0,
    "end": 2071.341,
    "text": " Yeah, yeah, completely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2071.361,
    "end": 2080.864,
    "text": "I mean, if somebody is trying to talk to you and, you know, share something with you, you only paying attention to the sensations in your hands is not very helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.485,
    "end": 2091.649,
    "text": "But I think what we're kind of flirting with here as well is this notion of task and goal and on task and off task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2092.369,
    "end": 2098.592,
    "text": "And I think in a meditation context, that's a really...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2100.129,
    "end": 2108.708,
    "text": " you know um difficult difficult thing to define there's a big difference between somebody who comes into practice because they want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.254,
    "end": 2125.383,
    "text": " you know, sleep a little bit better or not be so stressed or have a little bit, you know, more ease in a relationship to somebody who comes in and says, you know, I'm in it for really understanding myself and who I am and what I am.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2125.604,
    "end": 2132.688,
    "text": "And for, you know, questions, deeper questions of like awakening and, you know, expanding awareness and these kinds of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.808,
    "end": 2141.054,
    "text": "And those intentions and motivations are, you know, these task priors that you're setting over this whole thing and are driving the way that you practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.754,
    "end": 2152.378,
    "text": " And, you know, traditionally what is sort of said again and again and again is that defining that is pretty important in terms of what you're going to get out of the practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.458,
    "end": 2162.142,
    "text": "Because to pay attention to the breath, to just pay attention to the breath without really understanding why and where it's leading to, leading is one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2162.963,
    "end": 2170.226,
    "text": "Whereas having it within a context of, you know, a wider program and goal is a completely other situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.11,
    "end": 2174.792,
    "text": " Now, modeling those in active inference is interesting, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.172,
    "end": 2186.541,
    "text": "I would say that the latter, sorry about the background noise here, but the latter example there of thinking a bit more broadly is having some kind of a preference on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.996,
    "end": 2190.498,
    "text": " your own happiness, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.538,
    "end": 2208.579,
    "text": "Like your own model fitness, ultimately, you know, if we kind of go on the affective inference kind of view of, you know, Casper et al that like affect in some ways related to how well you're doing and how well your model is predicting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.5,
    "end": 2226.295,
    "text": " And so to have that as the intention, rather than just paying attention to the breath, but seeing how paying attention to the breath can lead to that ultimately is a different kind of goal statement than the sort of narrow attentional task itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.516,
    "end": 2228.437,
    "text": "Thank you, Lars.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2229.278,
    "end": 2230.619,
    "text": "Dean, and then Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2233.874,
    "end": 2250.75,
    "text": " I think your topic lends itself to wanting to gallop ahead because it gets people so excited about this idea of moving from subliminal to liminal to kind of a liminal, like precision around edges, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.77,
    "end": 2257.095,
    "text": "So that transition gets people excited because now they say, oh, I can think of ways that I can use this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2257.916,
    "end": 2261.178,
    "text": " in whatever it is that I'm trying to figure out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.558,
    "end": 2273.366,
    "text": "Um, so at, at some point that transition, pulling that transition apart, but not breaking it is, is going to have to, we're going to have to sit down and really parse that with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2273.386,
    "end": 2278.189,
    "text": "Cause it feels to me like we're doing a, are we 28 or 29?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.249,
    "end": 2284.973,
    "text": "We're doing the point two right now because everybody wants to really get this thing going because it, because it's, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.914,
    "end": 2308.662,
    "text": " it's kind of exciting stuff right like you've given us this this backpack of stuff and we're like opening it up and it's all this candy and we're but i'm still really kind of interested how that how that goes from subliminal which cannot be planned and cannot be thought out because we're talking about act sensory and activation to thinking about thinking because when i when i see the diagrams themselves",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2309.977,
    "end": 2314.219,
    "text": " they're there, but it doesn't really help me understand that any better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.259,
    "end": 2319.222,
    "text": "Cause I still think that's a really, really tough bridge to build.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2319.242,
    "end": 2320.783,
    "text": "You know what I'm saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2321.343,
    "end": 2323.624,
    "text": "I know it's there, but it's still hard for me to get my head around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2324.965,
    "end": 2326.706,
    "text": "I think, I think I know what,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.304,
    "end": 2333.788,
    "text": " you mean, what you're referring to, which is like, where does the structure come from in the first place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.808,
    "end": 2334.469,
    "text": "Is that what you're saying?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.869,
    "end": 2337.951,
    "text": "Yeah, well, we know where it comes from in the first place, and we know where it ends up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2338.051,
    "end": 2339.592,
    "text": "It's the transition in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2339.692,
    "end": 2342.895,
    "text": "It's those, Casper got us to the third layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2343.555,
    "end": 2346.037,
    "text": "Now we've gone to a deep transitional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2346.157,
    "end": 2347.698,
    "text": "We generated a context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2348.018,
    "end": 2349.459,
    "text": "We're thinking about our thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2349.519,
    "end": 2350.5,
    "text": "It's metacognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2351.781,
    "end": 2352.561,
    "text": "It just appeared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.921,
    "end": 2353.862,
    "text": "It just emerged.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2354.042,
    "end": 2355.703,
    "text": "So how does the math work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.084,
    "end": 2358.684,
    "text": " work on them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.306,
    "end": 2372.211,
    "text": "This, I think, I think what you're getting at there, I mean, there's kind of two ways that you could think about a model like this is like, either you say, well, the structure is in place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.991,
    "end": 2375.373,
    "text": "And what's changing through learning is the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.282,
    "end": 2388.589,
    "text": " the precision on observations, essentially, like you become aware of it, it becomes something that can factor into your perceptual belief updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.07,
    "end": 2401.88,
    "text": "That's one way around, or you can say that there's something about human development and maybe the evolutionary process that sort of leads to this sort of structure growth and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.661,
    "end": 2404.042,
    "text": "And then the question is, well, how does that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.082,
    "end": 2420.847,
    "text": " The first question is a little bit easier to answer than the second question because obviously structured learning with an active inference is still an ongoing area of investigation and research and how exactly that comes about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2421.587,
    "end": 2426.169,
    "text": " questions of neuroplasticity and it's quite difficult to grapple with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.209,
    "end": 2432.853,
    "text": "And then how, why do particular practices and different paths in life lead to certain things and others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.993,
    "end": 2447.12,
    "text": "But then to take the other stance or the other way to talk about this, which is, I think what you were saying, correct me if I'm wrong, but like, it's assumed that the structure is here that we have some kind of a deep hierarchical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.52,
    "end": 2452.082,
    "text": " parametric structure that is giving rise to metacognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.162,
    "end": 2461.986,
    "text": "How do we go from being not aware at all of the contents of our mind to being aware of the contents of our mind, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2462.608,
    "end": 2464.349,
    "text": " Yeah, well, it's kind of a contradiction, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.389,
    "end": 2469.41,
    "text": "Because the way it's set up is it's a bridge to everywhere, not a bridge to somewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2469.43,
    "end": 2477.913,
    "text": "And then somehow in that bridge to everywhere metaphor, we select out a particular and we give it our focus or our attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2478.593,
    "end": 2482.274,
    "text": " And so I'm not saying that the math doesn't work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2482.294,
    "end": 2493.638,
    "text": "I think the anchor piece is that at the basic level, nobody's going to argue that we have a Markov blanket and we're going to statistically move closer to what we think is going to happen next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2493.658,
    "end": 2494.459,
    "text": "We're going to update.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2494.819,
    "end": 2501.041,
    "text": "It's the last piece, which is we're now thinking about our thinking that just seems to pop out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2501.801,
    "end": 2506.443,
    "text": " and make itself available, you know, because we've now built up a set of priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.863,
    "end": 2511.845,
    "text": "But I'd like to see how the math explains that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.005,
    "end": 2517.868,
    "text": "Because it's still a distributed set until it collapses to what we focus or attend on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.508,
    "end": 2521.129,
    "text": "And so it seems like a contradiction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.129,
    "end": 2523.11,
    "text": "Maybe that's what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.15,
    "end": 2526.131,
    "text": "Maybe that's what the math is trying to explain to us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.095,
    "end": 2548.017,
    "text": " still not sure if i've completely uh grasped the the point of interest here what what was your how that how the transition works again i'm sure you'll be able to explain it but what i'm seeing is a transition to first starting out being very open and then the mind is able to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2550.339,
    "end": 2554.702,
    "text": " buckle down, for lack of a better expression, and get its attention on something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2555.002,
    "end": 2558.025,
    "text": "It starts out open, and then it moves to something closer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2558.405,
    "end": 2561.367,
    "text": "What I'd like to see is how the math explains that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.388,
    "end": 2563.188,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.909,
    "end": 2564.389,
    "text": "I think so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.69,
    "end": 2565.03,
    "text": "I think so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.296,
    "end": 2581.385,
    "text": " Dean, maybe one way to saying it would be just looking at figure five, like the lower levels are certainly outside of our control and the higher levels are moving towards phenomenology, whereas the lower level in traditional neuroscience would be seen more as like sensory processing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2581.766,
    "end": 2583.787,
    "text": "And yeah, it's indeed similar kinds of models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2584.307,
    "end": 2593.834,
    "text": "So how do we kind of bridge not just the science humanities gap, but like the parameter experience gap?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2594.354,
    "end": 2595.295,
    "text": "And then what is that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2596.175,
    "end": 2621.842,
    "text": " sort of marsh between them and is it really the case that just by nesting this model that we know and love we ended up getting the or a structure of cognition is that the or a structure does that exist as part of a broader family of related models is it just about finding patterns of nodes that explain variance in multiple components of phenomenology and physiology",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2625.765,
    "end": 2626.506,
    "text": " That's the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2630.909,
    "end": 2635.634,
    "text": "Well, for me, it all comes down to precision within the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.294,
    "end": 2652.488,
    "text": "Then that's kind of how I've been thinking about this is that at the sensory level, that first level, there are multiple places that you can start to identify",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2654.879,
    "end": 2681.129,
    "text": " just patterns you know statistical patterns and then start to layer on top of that a confidence or precision over that which you know we have evidence for you know how that's mediated in the brain for various various places but the precision then itself itself becomes this thing that you can layer on top of your entire sensory experience and gives you this kind of um internal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.949,
    "end": 2685.774,
    "text": " flexibility as to how you're interacting with the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.274,
    "end": 2689.979,
    "text": "And then the modeling of how those precisions are being driven",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.688,
    "end": 2714.049,
    "text": " without your awareness is then what those states, that B matrix at the second level would be encoding as you're starting to learn, ah, okay, so this, you know, my attention gets grabbed by this or that, or like these are the kinds of, and here we're talking explicitly about attention, but there's other precisions around that you can start to understand how they are evolving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.089,
    "end": 2742.142,
    "text": " and then also learning where your where your reach of control is like how much of how much of this can i control and and influence and what does that mean and what are the impacts of that um it's kind of what i find exciting about exciting about this because you can kind of see how different forms of precision control and awareness would lead to different kinds of model optimization and you can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2742.962,
    "end": 2757.601,
    "text": " calculate the free energy you know based on on how different precision profiles are defined and evolving and kind of over time that's something that you would hope to be able to learn and then the question is how do you actually learn that well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.766,
    "end": 2762.047,
    "text": " by paying attention, by paying attention to how it's changing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.647,
    "end": 2763.787,
    "text": "And that's not always easy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.367,
    "end": 2766.868,
    "text": "And sometimes things in life make us pay attention to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.168,
    "end": 2773.869,
    "text": "You start to notice like I'm the kind of person who gets, yeah, thank you, exactly this figure here that gets impacted in these ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.989,
    "end": 2783.231,
    "text": "But I think there's a really important thing to say around the role of a teacher in this as well, somebody who can point these things out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.191,
    "end": 2813.338,
    "text": " and in doing so direct your attention in a way that you wouldn't have thought to previously into noticing like hey there's this pattern in my mind that i hadn't thought of as a pattern i just thought of this well i hadn't even thought of it it's just happening and then as soon as i start to see it as a pattern is something i can start to model and then you get this kind of emergence of a of a higher level structuring or understanding or grasping or modeling expectation over these patterns that were previously unconscious",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.96,
    "end": 2841.572,
    "text": " thanks I'm gonna just read a comment with uh no response needed from the live chat and then go to Scott so Joshua Benjamin wrote all psychic ability seems to be subconsciously driven oneness of the active and subconscious mind would be magical to say the least people that already have their active and subconscious mind working as one also seem to have identical palmistry between their left and right palms interesting observation Scott",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2843.564,
    "end": 2844.004,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.585,
    "end": 2847.126,
    "text": "Sorry I was delayed in coming in, but I'm always thrilled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.146,
    "end": 2851.188,
    "text": "As soon as I drop into the conversation, it's like being with family.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.228,
    "end": 2852.349,
    "text": "So this is so wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.409,
    "end": 2853.329,
    "text": "What a great conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.83,
    "end": 2859.193,
    "text": "I wonder if you could comment a little bit on the attention versus intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.379,
    "end": 2867.606,
    "text": " It feels like part of what we're talking about, and let me comment on that a little bit, and it's following up on Dean's exploration there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.467,
    "end": 2871.13,
    "text": "I was thinking, I always talk to people about the aha moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.19,
    "end": 2877.437,
    "text": "If you know the punchline to a joke and someone tells you a joke, it's just not funny because you know the punchline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.806,
    "end": 2885.014,
    "text": " And so the aha moment is the same as that moment of eureka when you get out of the bathtub and run around yelling eureka.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.294,
    "end": 2886.475,
    "text": "You understand something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.495,
    "end": 2887.416,
    "text": "It's a paradigm shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.456,
    "end": 2893.984,
    "text": "Like Thomas Kuhn in The Structure of Scientific Revolutions talks about that you shift from not knowing something to all of a sudden knowing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.925,
    "end": 2897.126,
    "text": " So I'm an addict for those moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.166,
    "end": 2898.487,
    "text": "I love ignorance as a result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.887,
    "end": 2903.029,
    "text": "So I wonder if you could talk a little bit about going from attention to intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.75,
    "end": 2913.375,
    "text": "I am coming to the belief from working with all you folks and others in similar explorations that the mind actually doesn't exist at all in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.435,
    "end": 2916.597,
    "text": "The mind is always in society and in language, always.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.257,
    "end": 2922.76,
    "text": "The brain gets tuned into a local mind by exposure, by perception,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.752,
    "end": 2926.614,
    "text": " And then the attention turns into intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.654,
    "end": 2931.958,
    "text": "You adopt, like a bower bird, you adopt nascent models from the externality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.038,
    "end": 2935.5,
    "text": "There's no on-board feral consciousness in my assertion here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.361,
    "end": 2939.663,
    "text": "So you develop it and cultivate it based on your exposure to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.323,
    "end": 2947.108,
    "text": "As you build it up, the attentions, your teachers out there in the world, whether they're formal teachers or informal teachers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.461,
    "end": 2957.412,
    "text": " can help you convert attention to intention because the models get developed based on their explanatory power of your environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.472,
    "end": 2962.977,
    "text": "If they get cast aside, if they're not as helpful in closing free energy gaps, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.795,
    "end": 2967.137,
    "text": " So I just wanted to throw those things out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.177,
    "end": 2976.723,
    "text": "And following up with Dean, to me, the paradox of the frizzle between consciousness and unconsciousness is not something that we can resolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.823,
    "end": 2982.267,
    "text": "It's something that we can observe and maybe manage in some ways with these models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.747,
    "end": 2987.59,
    "text": "But the paradox is one thing I always told my kids is the only time you see reality is when you're seeing paradox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.351,
    "end": 2991.032,
    "text": " And anytime you're seeing the absence of paradox, you are seeing a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.872,
    "end": 2995.393,
    "text": "And when people say they want to resolve paradox, it means they want their model to win.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.193,
    "end": 3001.234,
    "text": "Here, it feels like, as Dan was alluding to, that there are multiple models that are in play simultaneously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.875,
    "end": 3007.236,
    "text": "And the multiple models maybe can give us a sense of the shift from attention to intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.736,
    "end": 3009.096,
    "text": "Anyway, your comments are welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.737,
    "end": 3010.817,
    "text": "Thanks, Scott.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.697,
    "end": 3012.437,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3012.477,
    "end": 3013.998,
    "text": "Lots of interesting points there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.599,
    "end": 3030.937,
    "text": " I'll just pick out one of the things you said there around insights and these aha moments from, and this isn't present here again, and it's working kind of falling into a Dean's trap here a little bit of running forward with it, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.225,
    "end": 3049.829,
    "text": " If you imagine here that what's being afforded by paying attention in new ways to dynamics and precisions within our generative model and how all these things are evolving, we're gaining in model structure and complexity, ultimately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.849,
    "end": 3052.19,
    "text": "And one of the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.45,
    "end": 3072.524,
    "text": " bits of work that I find really interesting from Carl and other colleagues is around, you know, insights and they've been talking about it in the context of psychedelics specifically as these moments of model reduction, Bayesian model reduction, whereby you lose a bit of model structure and there's this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.789,
    "end": 3075.371,
    "text": " liberating aspect of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.432,
    "end": 3077.855,
    "text": "And there's this sort of knowing aspect of that too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.915,
    "end": 3081.52,
    "text": "And it's not that you've sort of learned something new, you've kind of unlearned something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.56,
    "end": 3086.607,
    "text": "And in that, um, you, you gain in model fitness as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3087.128,
    "end": 3088.69,
    "text": "You know, there's this kind of, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.611,
    "end": 3092.633,
    "text": " improvement of the state of affairs by doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.014,
    "end": 3112.368,
    "text": "And so you could imagine a scenario whereby in playing this game of paying attention to how things go and how things are in the mind specifically, your model structure is kind of gaining complexity, but you're also identifying places that can be reduced and you get this sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.209,
    "end": 3120.251,
    "text": " cyclical growing of complexity and reduction, which matches on really, really nicely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.271,
    "end": 3130.614,
    "text": "And I have to be really careful sometimes to not try and like recapitulate things that I like from sort of practice theory into science and really be, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.014,
    "end": 3158.342,
    "text": " grounded in in in the act of inference but nevertheless there's you know my heart kind of wants to say that kind of nicely matches to the cycles of practice to these cycles of of insights and growth that does come in this sort of non non-linear and cyclical way thanks lars blue so this doesn't really like a question but it's more of a comment so scott was kind of talking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3158.922,
    "end": 3162.384,
    "text": " Converting attention or intention to attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3162.824,
    "end": 3165.005,
    "text": "But I think that that's also something that's cyclical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3165.025,
    "end": 3169.308,
    "text": "So you can convert attention to intention and intention to attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3169.608,
    "end": 3170.669,
    "text": "You intend to pay attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3170.689,
    "end": 3173.07,
    "text": "Attention gives you an intention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3173.53,
    "end": 3174.01,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3174.05,
    "end": 3180.054,
    "text": "That's like way tongue twister, but, but like, where does imagination come into play there?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3180.434,
    "end": 3180.594,
    "text": "Right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3180.614,
    "end": 3183.796,
    "text": "Like there's attention intention, but what, where's the exploration?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3184.415,
    "end": 3191.799,
    "text": " the creativity and does active inference allow for maybe this component on attention, intention and imagination?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3192.579,
    "end": 3193.239,
    "text": "Cool question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3194.5,
    "end": 3197.681,
    "text": "I think of imagination a lot in terms of generative practices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3198.262,
    "end": 3202.664,
    "text": "So like state generation practices, like loving kindness, gratitude, forgiveness, these kinds of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.404,
    "end": 3209.847,
    "text": "And for me, the way that I think about that is you are using your imagination to generate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3212.088,
    "end": 3216.732,
    "text": " the goal observation, the goal state, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.772,
    "end": 3219.935,
    "text": "Which then allows you then to set a prior over that to aim for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.455,
    "end": 3222.357,
    "text": "So if you evoke in your mind, the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.67,
    "end": 3225.712,
    "text": " a, you know, may you be happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.832,
    "end": 3228.735,
    "text": "So I'm imagining a situation where you are happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.855,
    "end": 3233.179,
    "text": "And now that is a possible future state that I can put a prior over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.739,
    "end": 3242.607,
    "text": "And once I've done that, then the machinery of active inference starts, you know, coming into play to achieve that kind of goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3243.127,
    "end": 3243.207,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.048,
    "end": 3246.669,
    "text": " That's a very, very hand-wavy and very loose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.769,
    "end": 3253.312,
    "text": "And again, I can sense that people out there might be cringing to this kind of way of talking about these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3253.392,
    "end": 3261.495,
    "text": "But in answer to the question, that's kind of how I think about at least that form of imagination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.836,
    "end": 3273.12,
    "text": "That's some point two stuff, thinking about how our cultural environment scaffolds our preferences and our telios, our end directedness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3274.008,
    "end": 3276.089,
    "text": " which is something that came up in navigation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3276.23,
    "end": 3282.474,
    "text": "Now it's coming up in cognitive navigation and setting of these higher order parameters, Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3284.246,
    "end": 3287.908,
    "text": " I just wonder, why is it cringy from the math perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.749,
    "end": 3292.891,
    "text": "Because I'm a humanities guy, and the math always freaks me out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.451,
    "end": 3297.573,
    "text": "So I want to understand, though, what is it about the – you're a math person, steeped in the math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.934,
    "end": 3301.796,
    "text": "What is it about what you just said that makes you uncomfortable with the math?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.376,
    "end": 3307.159,
    "text": "And how might the math be – why is it stretching the math, or how might the math be extended?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.95,
    "end": 3310.431,
    "text": " to accommodate that cringiness problem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.931,
    "end": 3311.932,
    "text": "Yeah, no, thanks, Scott.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.972,
    "end": 3312.632,
    "text": "That's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.553,
    "end": 3320.456,
    "text": "The reason I say that is because these models can pretty much model anything, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3320.536,
    "end": 3325.198,
    "text": "You can adapt them to make almost any point that you want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.339,
    "end": 3335.883,
    "text": "And so if I start saying, oh, this is how it is, and this is what imagination is and does, well, then I can sort of ad hoc",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.304,
    "end": 3339.926,
    "text": " play with the model until it makes that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3340.967,
    "end": 3356.78,
    "text": "And what I've really tried to do here in this paper is be very careful with that and to allow the dynamics to emerge intrinsically from moves in the mathematics that are like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.757,
    "end": 3362.64,
    "text": " allowed and don't make many assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3363.601,
    "end": 3369.164,
    "text": "Because really all we're doing here is having a higher level that is parameterizing precisions on the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3369.324,
    "end": 3372.246,
    "text": "And then we're just running it and seeing what kind of dynamics emerge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.786,
    "end": 3377.629,
    "text": "And interestingly, the dynamics that emerge are aligned with expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.669,
    "end": 3380.891,
    "text": "But if I go too far the other way, which is really easy to do with this, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.911,
    "end": 3386.675,
    "text": "Because you have, especially in a practice meditation context, there's really detailed phenomenological models of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3387.795,
    "end": 3390.377,
    "text": " all kinds of mental dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.637,
    "end": 3397.022,
    "text": "And it'd be very easy to say, you know, just gerrymander active inference to describe all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.202,
    "end": 3400.184,
    "text": "And so that's why I'm trying to just be a little bit careful on how I talk about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3401.245,
    "end": 3411.932,
    "text": "Well, just to follow up, one of the things, so this may be rationalization, but so I'm a lawyer, so I was a rhetorician.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.773,
    "end": 3416.996,
    "text": "And so when we have incommensurables in the law, we use rhetoric to glue them together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.171,
    "end": 3419.452,
    "text": " And it's not crazy glue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.592,
    "end": 3420.973,
    "text": "Crazy glue doesn't fill gaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.213,
    "end": 3423.574,
    "text": "Its rhetoric is epoxy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.694,
    "end": 3426.936,
    "text": "It glues stuff together and fills the gaps, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.976,
    "end": 3428.497,
    "text": "Crazy glue just sticks stuff together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.317,
    "end": 3436.981,
    "text": "And so the reason I'm talking about that is, again, I asserted before that the mind actually exists in language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.041,
    "end": 3439.322,
    "text": "That's very weird and loose language I'm using there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.342,
    "end": 3441.123,
    "text": "The mind exists in language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.163,
    "end": 3442.464,
    "text": "It exists in material culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.844,
    "end": 3444.165,
    "text": "We're born feral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.934,
    "end": 3448.955,
    "text": " and our brain gets tuned to a local mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3448.975,
    "end": 3450.696,
    "text": "Let's go with that for a second as a posit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.756,
    "end": 3454.257,
    "text": "So you have nothing on board when you're born.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.857,
    "end": 3461.1,
    "text": "I guess another way of asking the question, can the math construct consciousness from a feral mind with no social exposure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.162,
    "end": 3463.023,
    "text": " That's my question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.083,
    "end": 3468.949,
    "text": "And I'm beginning to believe that nothing is... Yes, there's imagination, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.969,
    "end": 3470.291,
    "text": "There's a lot of lateral thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.731,
    "end": 3474.335,
    "text": "But all the things are borrowings from the externality, is my assertion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.355,
    "end": 3475.717,
    "text": "Now, that's not the imagination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.737,
    "end": 3477.299,
    "text": "You can mix and match them different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.188,
    "end": 3486.518,
    "text": " But if you're isolated and have no question is, I guess, will the math generate a consciousness without any external input?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.139,
    "end": 3488.54,
    "text": "And I think the answer is no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3489.201,
    "end": 3495.769,
    "text": "And so therefore, it feels to me like the brain is a mind instant instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.318,
    "end": 3501.299,
    "text": " And the mind actually doesn't, it's paradigmatically weird and different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.4,
    "end": 3503.28,
    "text": "I don't, maybe there are people who say this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.6,
    "end": 3504.021,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.041,
    "end": 3506.181,
    "text": "I just don't know enough about the mind studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.942,
    "end": 3516.765,
    "text": "But it feels like we can allow ourselves to not feel cringy about the extension of the math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.785,
    "end": 3518.006,
    "text": "Now, again, I'm not the math guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.066,
    "end": 3519.906,
    "text": "I'm the cringy, I'm on the cringy side of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.367,
    "end": 3526.369,
    "text": "But by, if we recognize that the source of the mind stuff is external,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.455,
    "end": 3530.238,
    "text": " Maybe that's okay, and it's processed in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.478,
    "end": 3538.366,
    "text": "Anyway, I don't know if that's something he needs responding to, but to me, this is very interesting because this is that metaphysics jump, and is it metaphysical or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.547,
    "end": 3538.967,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.228,
    "end": 3545.914,
    "text": "I mean, I don't have much resistance to what you're saying there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.934,
    "end": 3549.879,
    "text": "I don't think these things happen in a vacuum, and I think, you know...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3551.38,
    "end": 3563.773,
    "text": " just intuitively, you know, the that kind of a cognitive structure would not emerge without some kind of, you know, societal or back and forth multiple nodes in the network, you know, working working together on this and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3565.374,
    "end": 3574.401,
    "text": " Anecdotally, a line that always sticks with me and from the Buddha of all people is, there's two things that are required for awakening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.441,
    "end": 3576.643,
    "text": "There's wise attention and the voice of another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3576.663,
    "end": 3581.446,
    "text": "And it kind of speaks to that need for interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.423,
    "end": 3600.735,
    "text": " Now, the reason what I really meant when I was saying cringy is that I think there's actually a huge advantage in just going slowly and systematically through this because what it allows us to do is be very, very precise in what we mean with our words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3601.636,
    "end": 3609.942,
    "text": " Because I can talk about attention, and that might mean several things to different people, but it almost doesn't matter what the definition is of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.022,
    "end": 3615.647,
    "text": "I can just point here and say, well, whatever, this is what I mean by this word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.347,
    "end": 3630.258,
    "text": "And I can keep doing that, building up the complexity of it, and I can start to have very detailed descriptions and articulations of mental dynamics that don't rely on interpretation of the words because they are referring to something quite specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.073,
    "end": 3632.373,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3633.453,
    "end": 3639.756,
    "text": "And it is really important to have that, perhaps Carl Friston would say a deflationary view.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3640.376,
    "end": 3646.078,
    "text": "So the deflationary view of this figure 12, the generalized deep generative model of mental action, it's like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3646.846,
    "end": 3655.251,
    "text": " I mean, big if true, the deflationary view would be that just like a linear model, like a linear regression, Bayesian modeling can be used on any kind of data.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3655.651,
    "end": 3664.457,
    "text": "So just because there's a word that you may or may not have familiarity in front of it, like frequentist statistics, Bayesian statistics, it doesn't get around the fundamental problems of data modeling.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3665.157,
    "end": 3669.34,
    "text": "And it actually has a lot of similarities with hierarchical Gaussian models of control.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3670.0,
    "end": 3683.31,
    "text": " which are common, at least related to this idea of nesting slower levels of policy inference with some, again, tricks that are really interesting, like the free energy calculation, all those other things that we talk about other times.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3683.69,
    "end": 3694.458,
    "text": "But that kind of model never took on a philosophical or metaphysical baggage, even when it did appear to correlate or even have predictive power, for example, predicting what somebody would buy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3695.379,
    "end": 3698.341,
    "text": " And it just, it's a choice that we make.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3698.741,
    "end": 3700.242,
    "text": "What is our cultural priors?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3700.662,
    "end": 3707.046,
    "text": "What are our personal preferences over connecting that metaphysical jump that Scott mentioned?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3707.086,
    "end": 3714.411,
    "text": "Maybe some people, they think it's a six inch jump and they can jump 20 feet and other people, they have a belief that it's a bigger jump.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3714.831,
    "end": 3722.555,
    "text": "So that's why it's such an interesting area to talk about because there is some hyperinflation going on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3723.616,
    "end": 3727.62,
    "text": " And then there's some extreme deflation and there's everything in between as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3728.581,
    "end": 3728.781,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3729.141,
    "end": 3730.963,
    "text": "And if I could just... Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3731.003,
    "end": 3731.824,
    "text": "Lars and then Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3733.405,
    "end": 3736.108,
    "text": "The... I... Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3736.288,
    "end": 3736.528,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3736.648,
    "end": 3738.41,
    "text": "For articulating that so well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3738.81,
    "end": 3747.518,
    "text": "Because... And I'm also guilty of this in my own mind when I'm thinking about this privately of just sort of running this forward and losing track of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3748.559,
    "end": 3755.02,
    "text": " of what these ontological commitments in this whole discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3755.18,
    "end": 3763.862,
    "text": "And I think Maxwell, one of the co-authors, he sometimes refers to hard Fristonians and soft Fristonians.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3763.942,
    "end": 3767.542,
    "text": "And that speaks to this deflationary and inflationary point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3767.902,
    "end": 3775.824,
    "text": "But for me in this work, what I'm most excited about isn't so much an ontological",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3778.956,
    "end": 3802.145,
    "text": " proof or um conclusion of hey this is what it is and this is what the mind is doing this or or anything that's strong what i'm more excited about what i think is more uh relevant to our times is that even if this is a a facsimile or a or a kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3803.648,
    "end": 3817.493,
    "text": " loose description or a you know what am I trying to say approximated framework of something that's going on if it allows us to articulate intelligently like how these mental dynamics are going on it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3818.713,
    "end": 3822.837,
    "text": " really helps, you know, cause I teach meditation as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3823.037,
    "end": 3826.68,
    "text": "And one of the big obstacles that you come up against is like, yeah, but why should I do this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3826.72,
    "end": 3827.66,
    "text": "Like, how does it work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3827.72,
    "end": 3829.482,
    "text": "And what, what, what, what's the point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3829.862,
    "end": 3844.574,
    "text": "And if you have something like this that, um, allows you to articulate, um, why and how and the dynamics and what's going on, then that breaks down that barrier and allows for in a conversation that's at least grounded in something closer to, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3846.135,
    "end": 3854.578,
    "text": " you know, biologically inspired computational neuroscience rather than phenomenological report.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.778,
    "end": 3858.44,
    "text": "Not that there's space for that, but for a lot of people, this is what would get them through the door.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.281,
    "end": 3862.742,
    "text": "Thanks, Lars.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3863.302,
    "end": 3865.063,
    "text": "Scott, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3866.243,
    "end": 3867.183,
    "text": "So I just wanted to go back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3867.223,
    "end": 3868.884,
    "text": "This is fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.944,
    "end": 3873.026,
    "text": "And I wanted to go back to just that rule, the idea of rules of general application, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.2,
    "end": 3883.422,
    "text": " are elements of this that are interesting reducible to formulas, is where I'm going with this query now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.042,
    "end": 3894.924,
    "text": "And it made me think about, you have this society, you have different societies with different standards, so different music scales, different recipes of food, and things that people are familiar with, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3894.944,
    "end": 3896.405,
    "text": "They're raised in that context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.485,
    "end": 3900.345,
    "text": "So Chinese food and music are familiar to a Chinese person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.705,
    "end": 3903.406,
    "text": "If you're born in a different culture, those are unfamiliar to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3903.986,
    "end": 3908.328,
    "text": " So I wanted to talk a little bit about rules of general application because in law – so I come from law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.209,
    "end": 3916.532,
    "text": "In law, we've got technical specs now, and here we've got Friston analysis and trying to find general rules of general application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.012,
    "end": 3917.372,
    "text": "That's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.392,
    "end": 3917.993,
    "text": "That's good stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.493,
    "end": 3922.535,
    "text": "And one of the things that's interesting about rules of general application is how general they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.155,
    "end": 3927.579,
    "text": " So in law, you have this thing called equity, which corrects the rules of general application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.619,
    "end": 3930.522,
    "text": "I just want to read you this Aristotle quote that guides me a lot here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.163,
    "end": 3938.67,
    "text": "Aristotle said the source of the difficulty is that equity, though just, is not legal justice, but a rectification of legal justice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.25,
    "end": 3946.713,
    "text": " The reason for this is that law is always a general statement, yet there are cases which it is not possible to cover in a general statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.173,
    "end": 3956.276,
    "text": "Hence, while the equitable is just and is superior to one sort of justice, it is not superior to absolute justice, but only to the error due to its absolute statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.936,
    "end": 3958.897,
    "text": "This is the essential nature of the equitable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.077,
    "end": 3962.898,
    "text": "It is a rectification of law where law is defective because of its generality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.783,
    "end": 3968.43,
    "text": " The reason I'm raising that here is, you know, we can find general rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.611,
    "end": 3972.277,
    "text": "They don't have to work in every edge case, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.837,
    "end": 3977.425,
    "text": "And if we find edge cases that undermine the general rule, it doesn't mean the general rule is no good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3978.908,
    "end": 3979.088,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3979.128,
    "end": 3982.572,
    "text": "It just means we need some tweaking at the edge cases or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.632,
    "end": 3982.832,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.292,
    "end": 3994.803,
    "text": "And one of the things that's funny in equity, the idea is you have to bring in someone, a judge or someone who can come in and say, what did they mean when they were coming up with the original law?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.184,
    "end": 3999.428,
    "text": "Not what does the original words say, but what do they mean to do the substance of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.468,
    "end": 3999.628,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.169,
    "end": 4003.192,
    "text": "And similarly here, what I guess I'm arguing for is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.832,
    "end": 4023.48,
    "text": " is the social aspects of the mind probably don't need to be divorced from the model entirely, the hand-waving aspects of the mind, the metaphysical aspects of the mind, because they are, I think, are always the foundation of the possibility of a mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.605,
    "end": 4024.785,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.567,
    "end": 4026.669,
    "text": "We come into social.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.91,
    "end": 4034.104,
    "text": "You come into life feral and then you are and then you learn that there's a society and other people and you have self and other you learn that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.989,
    "end": 4035.489,
    "text": " as a child.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.529,
    "end": 4038.37,
    "text": "Now, maybe you would learn it out in the wild, maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4039.11,
    "end": 4057.974,
    "text": "I guess what I'm saying, though, is the model, it feels like, doesn't ultimately have to be mathematically 100% rigorous, because the borrowings in the model that are made from society intrinsically have caused leakage into that model being affected by the externality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.034,
    "end": 4059.855,
    "text": "So I guess both the perception and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.184,
    "end": 4064.089,
    "text": " other model contents feel like they're unavoidable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.73,
    "end": 4071.402,
    "text": "Anyway, just a few ruminations there, and do with what you should with the cud that I just served up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.948,
    "end": 4079.952,
    "text": " I mean, I think this, what you're speaking to here is a pretty big topic in the active inference community in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4080.052,
    "end": 4082.094,
    "text": "And this idea that, you know, the math is not the territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4083.575,
    "end": 4088.879,
    "text": "And depending on who's speaking, we kind of get lost in that a lot of the times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.979,
    "end": 4095.143,
    "text": "Like, are we agents with generative models or are agents generative models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4095.623,
    "end": 4097.625,
    "text": "And to what extent is this a description?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4097.785,
    "end": 4098.886,
    "text": "And to what extent is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4100.367,
    "end": 4100.947,
    "text": "You know, that's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.128,
    "end": 4103.449,
    "text": " I'd rather not wait in there, to be honest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4104.33,
    "end": 4104.85,
    "text": "No, I get it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4104.99,
    "end": 4107.292,
    "text": "And I like your statement, the math is not the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.352,
    "end": 4114.237,
    "text": "It's nice because really that's a nice way of thinking the math is the tool to understand the journey or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.297,
    "end": 4122.403,
    "text": "But that's a nice, I like that statement you just made about the math is not the territory because it often feels like, and that may be something that helps with the invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4122.423,
    "end": 4125.605,
    "text": "You know, the space can be threatening to non-math people, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.049,
    "end": 4127.63,
    "text": " Because it does need a rigor, I get it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.09,
    "end": 4133.652,
    "text": "But there are things that are being said by the math that need to be conveyed to non-math people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.192,
    "end": 4135.053,
    "text": "You know, there are important things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.073,
    "end": 4140.795,
    "text": "When I first dropped into the space, I said, oh my God, all the contracts I ever made are synthetic Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.401,
    "end": 4142.701,
    "text": " They are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.841,
    "end": 4145.624,
    "text": "I'm creating a there there that wasn't there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.684,
    "end": 4148.467,
    "text": "It's not an observation of a biological system that's natural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.867,
    "end": 4156.814,
    "text": "It's an artificial creation of a thing, a place where these rules apply for internal and external operation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.935,
    "end": 4158.516,
    "text": "It's an artifice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.457,
    "end": 4161.018,
    "text": "And we do that a lot in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.699,
    "end": 4163.22,
    "text": "So that was my first kind of impression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.661,
    "end": 4167.164,
    "text": "But I'm never going to understand the math enough to have the rigor to be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.052,
    "end": 4173.94,
    "text": " delve into that and understand the implications of active inference math for the law, it just won't be available to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.561,
    "end": 4182.471,
    "text": "So if and to the extent that without going to metaphysics, we're able to create narratives that are honest to the math,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.723,
    "end": 4206.859,
    "text": " realistic and also available to the non-math people, that's going to be something that will lead to a lot more, both understanding and misunderstanding, I get it, but a lot more awareness and adoption of the models, I think, which will lead to more, I think, better systems, better policy, because there's a lot to be learned from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.486,
    "end": 4215.371,
    "text": " And it's the same thing as an engineer knowing how to make a nuclear power plant work and then other people down the line knowing how to sell power, but they don't know how to make a nuclear power plant work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.971,
    "end": 4222.215,
    "text": "You need all steps of the supply chain of this to be delivered as a social good, I guess is what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.295,
    "end": 4224.597,
    "text": "So that's a big, I'm putting it all on your shoulders, you guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.831,
    "end": 4226.892,
    "text": " But I mean, that's the hope here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4226.932,
    "end": 4246.151,
    "text": "I mean, that's I think what's at stake a lot of the time is that, you know, I think about this stuff in terms of a practice and a practice content sharing and communicating on how how best to, you know, improve our mental well-being, given given what the insights that this might afford and given the structure in terms of communication that it might allow for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4246.471,
    "end": 4247.832,
    "text": " And it's already impacted the way that I teach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.852,
    "end": 4249.753,
    "text": "It's already impacted the way that I practice personally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.554,
    "end": 4255.297,
    "text": "But then there's a whole field of computational psychiatry as well, which is very closely related to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4255.357,
    "end": 4261.581,
    "text": "I mean, the kinds of well-being I'm talking about or the kinds of dysfunctions that the computational psychiatry people are talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4261.621,
    "end": 4263.922,
    "text": "So there's a lot of hope to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.942,
    "end": 4270.827,
    "text": "And it doesn't take somebody to understand how to do a gradient descent on free energy to be able to benefit from that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4273.008,
    "end": 4273.088,
    "text": "Yep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4274.246,
    "end": 4275.206,
    "text": " definitely typo.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4275.306,
    "end": 4278.367,
    "text": "But this is a slide we had from the dot zero.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4279.388,
    "end": 4285.69,
    "text": "Just like, there's so many directions that this area verges towards.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4286.91,
    "end": 4296.033,
    "text": "And just how we even make sense of this field, where is active inference going to connect the pieces?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4296.154,
    "end": 4303.276,
    "text": "Just I don't know any of these elements on the list that was interesting to you and give a thought on or anyone else could just raise their hand.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4306.853,
    "end": 4322.18,
    "text": " The hyperscanning piece is really fascinating because there's obviously a deep tradition of these kinds of things being learned in community and in interaction with other people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4323.38,
    "end": 4326.982,
    "text": "And that is not obvious how that happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4327.042,
    "end": 4333.645,
    "text": "And I'm looking forward to that whole space developing a little bit and being able to model what it'd be like to learn",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4334.943,
    "end": 4337.405,
    "text": " You know, what's the difference between learning through an app and learning from a teacher?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4340.528,
    "end": 4340.849,
    "text": "Cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4341.67,
    "end": 4342.971,
    "text": "Very interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4343.571,
    "end": 4346.634,
    "text": "So I see Scott's hand, and then anyone else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4348.136,
    "end": 4351.579,
    "text": "So the other place is just in the crass world of markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.879,
    "end": 4355.503,
    "text": "You know, you have information differentials are differentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.647,
    "end": 4359.308,
    "text": " And the markets are driven by information differentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.348,
    "end": 4365.429,
    "text": "I've asserted for a number of years that Cardo's equation in thermodynamics, the hot and cold differential is necessary for a heat engine to function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.43,
    "end": 4371.671,
    "text": "That is equivalent to the information differentials in markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.691,
    "end": 4375.232,
    "text": "You don't have market action if everyone has the same information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.332,
    "end": 4379.453,
    "text": "And that's that idea that markets generate information, price information, availability, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.157,
    "end": 4391.903,
    "text": " So the crass part of this, and that tends to make things get swept away in the world of craziness when you get things into markets because anything goes and it's just a big mess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.843,
    "end": 4401.388,
    "text": "Having said that, the impact of this kind of analysis will be very appealing in markets because it does have a scale-independent aspect to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.202,
    "end": 4424.249,
    "text": " And so it allows for insights at different levels of different markets and meta markets and related supply chains that if everyone is doing this analysis, then it leads to a certain kind of interoperability because you have a risk and risk evaluation interoperability, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.781,
    "end": 4440.025,
    "text": " And so the value in markets, if everyone started doing active inference style of risk analysis, you'd be able to make observations about at different scales, because you'd have data coming out of every scale that was generated by models that were similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.766,
    "end": 4441.966,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.246,
    "end": 4446.887,
    "text": "So that kind of aspiration, it's what I'm looking at with the I'm working with banks now, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.907,
    "end": 4449.268,
    "text": "And I'm not talking to them about active inference or Carl Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.046,
    "end": 4456.67,
    "text": " But I'm starting to set that up as best I can in the early stages of it because it feels just like a natural thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4456.71,
    "end": 4458.07,
    "text": "We are biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.171,
    "end": 4463.614,
    "text": "Our markets and our institutions are ultimately doing reproductive and nutritional opportunities at large scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.248,
    "end": 4487.37,
    "text": " you know and so there's a lot of biology that's still bound up in what we do as organisms in our scaled structures and so it's exciting to watch because this thing is going to come out of left field and it's like quantum computing everyone thought that was a thing in the lab for a lot of years and now people are like oh geez here we go that's going to be a big deal in other things like business and governments and da da da",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.431,
    "end": 4498.954,
    "text": " And I mean, you just imagine legislative activity informed by a active inference style of model where you really do probe and we get feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.174,
    "end": 4499.334,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.374,
    "end": 4502.955,
    "text": "What if we had feedback from legislation every year saying this is good or not good?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4503.175,
    "end": 4504.255,
    "text": "More of this, less of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.475,
    "end": 4504.635,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.655,
    "end": 4507.036,
    "text": "I mean, that's the kind of thing there's been aspirations that for years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.708,
    "end": 4515.896,
    "text": " putting lobbying aside, that would lead to a great efficiency in things like legislative activity and enforcement activity, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.976,
    "end": 4518.959,
    "text": "So I'm very excited that these things are going to get",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.881,
    "end": 4522.682,
    "text": " taken in the directions where they weren't intended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.402,
    "end": 4533.066,
    "text": "And I think it behooves the people who really understand it early on to set up some nice, chunky, solid notions and paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.466,
    "end": 4537.888,
    "text": "So when they're adopted, they don't drift too far from where they should be, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.928,
    "end": 4541.729,
    "text": "Because the things get picked up and taken in all sorts of wacky directions out in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.072,
    "end": 4550.374,
    "text": " So it's kind of that's what I'm talking about simplifying in a way that still does justice to the to the what's going on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.774,
    "end": 4556.795,
    "text": "And as a person who's teaching meditation, that's exactly the same kind of mindset you need going into these crazy markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.856,
    "end": 4556.996,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.016,
    "end": 4561.457,
    "text": "It's something of common intention because the markets have different agendas and intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.057,
    "end": 4566.278,
    "text": "If we want the active inference intention to be carried forward, we need to make sure that we have robust intentionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.96,
    "end": 4586.694,
    "text": " presentation of the model so when it's picked up that model can withstand the abuses that happen out there in the rhetorical markets anyway again more just load on your shoulders any thoughts there blue or dean or dave",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.502,
    "end": 4593.244,
    "text": " I didn't mean to bring things to a screaming halt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.264,
    "end": 4594.626,
    "text": "Sorry, I can go in a different direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.246,
    "end": 4596.688,
    "text": "No, all good.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4599.622,
    "end": 4612.291,
    "text": " What's a figure or a word that you might like to go to, Lars, or when you're communicating this to different audiences, like more from the maybe non-active inference side, what is your entry point?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4612.892,
    "end": 4615.393,
    "text": "Is it one of the keywords here or one of the figures here?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4615.914,
    "end": 4616.694,
    "text": "How do you enter?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4616.714,
    "end": 4618.536,
    "text": "Do you show the action perception loop?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4618.956,
    "end": 4622.819,
    "text": "Do you just go straight to the Bayesian graphical model?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4624.755,
    "end": 4625.456,
    "text": " Yeah, good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4625.476,
    "end": 4646.585,
    "text": "I think this crowd is a particular one, but I think when I talk about this paper, I kind of do it in two steps, starting with figure, well, when we look at precision, so early on in just talking about attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4646.605,
    "end": 4647.566,
    "text": "So yeah, exactly here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.767,
    "end": 4664.932,
    "text": " um and just starting here because it's quite straightforward as a model of of perception and attention ultimately and you can kind of see here intuitively what this precision is about and and we can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4665.552,
    "end": 4690.015,
    "text": " yeah let's do this let's kind of build it up and we'll go straight to go up to figure 12 which is where i'm really excited about going in the future which is this kind of generalization of this this across and what it might mean and the game that we have to play here a little bit is a little bit dicey in that in that um we're trying to um make intuitive phenomenological interpretations of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4690.956,
    "end": 4716.453,
    "text": " maths right and that's not not easy and requires a lot of discussion back and forth but that's why we started here with attention because it's the one place where it's less controversial and more widely sort of defined and so we're starting with attention here is just the precision on you know the likelihood matrix and you can kind of see just intuitively i mean maybe this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4717.273,
    "end": 4720.475,
    "text": " depending on who you are listening to this, it's like that's already kind of obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.595,
    "end": 4725.757,
    "text": "Yeah, you know, higher precision on the likelihood matrix means, you know, is related to attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4725.797,
    "end": 4740.685,
    "text": "But just to kind of motivate that a little bit more subjectively, you can tell that at the center of your vision, you know, as opposed to the periphery, you're a bit more confident about what you're seeing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4741.185,
    "end": 4745.528,
    "text": "Like if you see a glass on the table at the periphery of your vision,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4746.721,
    "end": 4750.645,
    "text": " you might not be sure if it's a glass or a mug, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4751.205,
    "end": 4752.066,
    "text": "But you can still see it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.106,
    "end": 4759.733,
    "text": "And then when you look over to it, then you can be more confident in the causes of your sensory observations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4759.833,
    "end": 4760.494,
    "text": "Whereas this case is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4767.082,
    "end": 4793.4,
    "text": " Just lost Lars for a second, but just to sort of, while he's reconnecting, that's one sort of experiential, you're in a generative model type thought experiment or really commands for covert action for attention, which is to realize that the color detection outside of the center of vision, as well as the resolution is very low and that there's a significant blind spot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4793.96,
    "end": 4796.322,
    "text": "So there's three features of your visual field.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4797.142,
    "end": 4807.631,
    "text": " for healthy vision that make it so that the visual field is not just seen homogeneously like a sort of silicone light detector device in a camera.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4808.352,
    "end": 4814.918,
    "text": "So just a starting point for saying, okay, something else is happening such that attention isn't being paid.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4814.998,
    "end": 4823.646,
    "text": "It's being normalized in some way to not just increase the resolution outside of the high resolution detection zone,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4824.346,
    "end": 4835.255,
    "text": " and colorize it in many cases but also to normalize the absence and paste over the blind spot so then that can be extended to other sensory observations so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4835.902,
    "end": 4839.403,
    "text": " What do you mean by normalize the absence and paint over the blind spot, that part?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4839.763,
    "end": 4850.346,
    "text": "Like, it feels normal to what is being perceived under just... Again, this is a whole interesting question about what is perceived as normal, at what scale.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4851.006,
    "end": 4852.347,
    "text": "Oh, it's weird, there's a door here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4852.927,
    "end": 4853.627,
    "text": "How weird?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4854.127,
    "end": 4854.947,
    "text": "What about the door?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4854.967,
    "end": 4855.007,
    "text": "So...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4857.568,
    "end": 4865.732,
    "text": " I don't want to be normative with the way that I'm talking about the mental states, but there's different ways that anomaly can be detected.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4866.312,
    "end": 4875.015,
    "text": "And there's certain sensory illusions that are really illusions because the alternate perception, which turns out to be factually different than the actual sensory O.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4876.616,
    "end": 4892.957,
    "text": " that is different but that difference structurally or inaccuracy or resolution is just seen as part of not salience but not salient part of the organism's experience phenomenologically not to say unimportant at a nested level of analysis",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4895.509,
    "end": 4896.37,
    "text": " Hey, Lars, welcome back.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4896.41,
    "end": 4900.514,
    "text": "We were just talking about generative model, vision.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4900.854,
    "end": 4903.476,
    "text": "So continue on to perfect.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4903.616,
    "end": 4903.876,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4904.036,
    "end": 4904.417,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4904.537,
    "end": 4905.798,
    "text": "No, hopefully it doesn't drop out again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4906.999,
    "end": 4908.6,
    "text": "So that's kind of motivating me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4910.942,
    "end": 4913.403,
    "text": " phenomenological translation, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4913.483,
    "end": 4920.486,
    "text": "And then the next step is to then say, well, OK, we are somehow in control of that precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4920.946,
    "end": 4931.49,
    "text": "And here I leaned on existing work by Jakub Lemnowski and Friston and others, whereby that notion of control and mental action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4933.451,
    "end": 4938.816,
    "text": " then you can talk about that as a deployment of precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4938.937,
    "end": 4945.343,
    "text": "It's some kind of a precision modulation is the word I'm looking for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.923,
    "end": 4951.749,
    "text": "And so then the natural, the kind of next step there is to, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.772,
    "end": 4958.616,
    "text": " make that possible within the active inference framework in the same way the other action is also possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4959.016,
    "end": 4964.12,
    "text": "And that's where the second level comes from in figure four, I think it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4965.463,
    "end": 4969.046,
    "text": " Because then this is what then allows that to be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4969.266,
    "end": 4977.471,
    "text": "And really all that we've done here is to say, okay, attention is this kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4977.511,
    "end": 4978.812,
    "text": "This is this kind of precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4980.013,
    "end": 4985.437,
    "text": "And we can motivate that in all kinds of different ways, both computationally and intuitively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4985.977,
    "end": 4987.598,
    "text": "And we know we can control it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4987.638,
    "end": 4989.339,
    "text": "So what would it mean to be able to control it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4989.419,
    "end": 4992.661,
    "text": "Well, the same thing that it means to control anything within this framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4992.702,
    "end": 4993.662,
    "text": "And then here you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4993.722,
    "end": 4994.723,
    "text": "This is what kind of makes that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4995.288,
    "end": 4995.898,
    "text": " makes that possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4997.256,
    "end": 5003.3,
    "text": " And again, luckily, I'm really standing on the shoulders of giants here and in that, you know, a lot of this stuff was already worked out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5003.801,
    "end": 5007.643,
    "text": "You know, Casper, Etal, and Deep Affective Inference already had this in place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5007.663,
    "end": 5011.746,
    "text": "They just didn't have a policy set over this higher level yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5012.587,
    "end": 5013.547,
    "text": "And so this is cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5014.008,
    "end": 5025.295,
    "text": "But like I said in the beginning, the real aim of the game or what really allows for attentional freedom in the kind of practice context is not so much",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5028.858,
    "end": 5030.86,
    "text": " the attention itself, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.161,
    "end": 5033.443,
    "text": "But it's your awareness of where the attention is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5033.503,
    "end": 5039.429,
    "text": "So then the question for me was, well, how do we pay attention to attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5039.93,
    "end": 5044.114,
    "text": "But once we have this structure, well, then that becomes kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.035,
    "end": 5061.542,
    "text": " straightforward and not straightforward i mean you have to make a little bit of a leap but then you say well we pay attention to it in the same way that we pay attention to sensory states and that's where you get the third level um and where these states now are the degree to which you are aware of your attention um and you know if i just ask you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.506,
    "end": 5064.848,
    "text": " You know, how aware are you of where your attention is right now?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5066.43,
    "end": 5068.252,
    "text": "When I asked you the question, probably not so aware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5068.492,
    "end": 5070.274,
    "text": "Just afterwards, probably a little bit more aware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5070.754,
    "end": 5077.681,
    "text": "And so there was a transition there that happened in that higher level state, which is then modulating the precision on the lower levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5078.302,
    "end": 5083.527,
    "text": "Now, this kind of a move, computationally, mathematically, is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5086.77,
    "end": 5090.931,
    "text": " internally coherent and allowed, but it's also not unique.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5091.391,
    "end": 5098.192,
    "text": "There's no reason why you can't do the same treatment to other precisions in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5098.232,
    "end": 5112.495,
    "text": "The other ones that we're most familiar with from the literature are the precision on G, model precision, and the precision on B, which is usually related to sort of volatility beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5114.455,
    "end": 5119.178,
    "text": " sort of unexpected uncertainty, I think, if I'm saying that right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5120.559,
    "end": 5130.105,
    "text": "And just as a side note, we made the decision to kind of change the notation here just because we're talking about so many different precisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5130.705,
    "end": 5140.071,
    "text": "In the literature up until here, precision on A was zeta, I think, and precision on B was omega.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.452,
    "end": 5147.718,
    "text": " Whereas here now we've just called all precisions gamma and with a subscript based on which parameter they're referring to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5149.079,
    "end": 5155.404,
    "text": " Gamma previously was really just referring to the precision on G. So in case that's causing any confusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5157.365,
    "end": 5165.312,
    "text": "So the idea then, what I think is exciting is to then think about, all right, well, if we do the same treatment, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5165.832,
    "end": 5174.799,
    "text": "What does it mean to have this higher level state now, S1, S2, S superscript two, which parameterizes other precisions within the model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5175.119,
    "end": 5178.682,
    "text": "Because that now goes from an attentional state to something quite different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5180.492,
    "end": 5201.217,
    "text": " So we can talk about these individually and from a practice perspective, this is what, this is what I'm most enthusiastic about because there's a lot more to meditation practice, for instance, and also just sort of cognitive mental act or catalog of mental action than paying attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5201.937,
    "end": 5203.957,
    "text": "You know, there's lots of other things that we're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5204.017,
    "end": 5205.478,
    "text": "So for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5207.438,
    "end": 5213.645,
    "text": " The notion of acceptance or equanimity would be the technical term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5214.646,
    "end": 5215.486,
    "text": "Where does that live?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5215.526,
    "end": 5218.109,
    "text": "What does it mean to be in a state of equanimity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5218.129,
    "end": 5230.482,
    "text": "And here we could define that as a factor of S2 state, which is modulating the precision over our preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5232.23,
    "end": 5233.611,
    "text": " Gamma C, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5234.372,
    "end": 5237.255,
    "text": "To kind of give an idea here of how we could start talking about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5237.295,
    "end": 5250.929,
    "text": "So a state of acceptance would be, or a state of sensitivity would be the opposite, is to what degree are we allowing our preferences to impact our actions effectively?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5252.01,
    "end": 5259.197,
    "text": " And so in the example that you said in the beginning there, Dean, of sitting still, how important is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5259.797,
    "end": 5261.339,
    "text": "Yeah, that came from you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5261.379,
    "end": 5269.486,
    "text": "Then a big part of that is acceptance, is being able to be OK with the discomfort that's arising from whatever is going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5270.407,
    "end": 5272.549,
    "text": "And that's also something that we're explicitly teaching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5272.569,
    "end": 5273.35,
    "text": "That is an instruction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5277.213,
    "end": 5280.534,
    "text": " that is important and a big part of what makes it all work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5280.574,
    "end": 5284.895,
    "text": "And when I say it all work, it's leading to happiness, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.915,
    "end": 5286.215,
    "text": "Like it's leading to wellbeing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5287.675,
    "end": 5300.118,
    "text": "And so you can start to, you can start to do that game with these different, different preferences, you know, if you, sorry, these different precisions and see what it would mean to affect a policy over them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.778,
    "end": 5303.259,
    "text": "And then you have to do this, like I said, kind of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5304.139,
    "end": 5330.231,
    "text": " um delicate work of translating that into you know a phenomenological kind of uh interpretation but i don't think that's impossible and i think a lot of it lends itself quite well intuitively to be able to do that because of this sort of bayesian um space that we're in of beliefs and beliefs of beliefs and different kind of forms and the way that we talk about precisions and sorry preferences and habits and the point there for me is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5331.5,
    "end": 5344.69,
    "text": " you can start to figure out what is causing or what a kind of instruction you would need to alleviate different kind of dysfunction or unpleasantness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5344.79,
    "end": 5352.315,
    "text": "So for example, Ryan Smith put out and colleagues put out a great paper recently on gut inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5353.676,
    "end": 5357.619,
    "text": "And the point there is they're trying to develop a model for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5359.44,
    "end": 5365.003,
    "text": " you know, the ways in which inferences from the gut could go wrong and try to see if that could be related to overeating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5365.603,
    "end": 5372.647,
    "text": "And one of the things that has come out there is that one of the ways in which people's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5374.558,
    "end": 5381.909,
    "text": " well-being is effective comes from this tendency for priors to get frozen or not be updated very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5382.63,
    "end": 5389.06,
    "text": "And in that context, it means that people are effectively",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5390.154,
    "end": 5395.52,
    "text": " I mean, the reason for that is that you're selecting attention away from uncomfortable sensations of hunger, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5396.201,
    "end": 5407.054,
    "text": "So if you are continuously selecting away because you have a preference against hunger sensations, then over time, the priors around hunger and your behavior around hunger gets frozen because you're not updating those with any new observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5408.015,
    "end": 5429.134,
    "text": " so what's the solution there right like how can we actually help somebody in that situation well this this gives us a bit of a hint is that maybe what needs to happen there is a training in mindful acceptance of sensations of hunger because that's where in this sort of precision dynamic and cocktail of interactions things are going wrong and if we can kind of translate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.779,
    "end": 5444.268,
    "text": " practice instructions or internal instructions into, into this, this framework, then it gives, it gives avenues for alleviating different forms of different ways in which things can go wrong here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5445.889,
    "end": 5446.089,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5446.109,
    "end": 5446.85,
    "text": "Just one comment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5446.89,
    "end": 5447.89,
    "text": "Thanks Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5447.991,
    "end": 5449.512,
    "text": "And then could you mute Lars?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5449.612,
    "end": 5452.554,
    "text": "There's a different speaker set up for you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5452.954,
    "end": 5453.074,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5455.407,
    "end": 5479.268,
    "text": " You said about instructions that might alleviate some non-preferable state and that really recalls our discussions on instructionism and interactionism and how active inference lets us think about one extreme with the instructions like the cues and then on the other extreme who knows how many ways it goes with what it looks like to interact and co-develop based upon",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5480.819,
    "end": 5491.861,
    "text": " a total model, or even parts of a total model, rather than to, oh, high level X in blood, that means you need to take the X blocker, or if it's too low, you take the supplement.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5492.301,
    "end": 5493.682,
    "text": "That could be approached here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5494.002,
    "end": 5494.802,
    "text": "Oh, parameter's too high?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5495.082,
    "end": 5495.422,
    "text": "Lower it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5496.302,
    "end": 5508.725,
    "text": "It's that sort of biomarker-driven approach that maybe we can move beyond when we have a rich generative model, and then we can go into underlying factors",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5509.898,
    "end": 5515.279,
    "text": " informed by information rather than just trying to follow up on mathematical parameters and, um, constrain people that way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5516.179,
    "end": 5521.16,
    "text": "So Scott, um, if you want to say anything or Scott, okay, Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5523.261,
    "end": 5527.841,
    "text": "So, um, that last part of the equanimity brought me back to equity, the equity thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.901,
    "end": 5530.422,
    "text": "Again, I was reading from this book, the Aristotle thing before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5530.922,
    "end": 5535.403,
    "text": "And it's, it's interesting because in a way it's a correction to too much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.306,
    "end": 5541.77,
    "text": " sensitivity, I guess, or the correction of the general rules in Aristotle's words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5542.431,
    "end": 5546.635,
    "text": "And it got me thinking, you know, and this is something we may have talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.675,
    "end": 5548.577,
    "text": "I'm just trying to remember the phrasing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.597,
    "end": 5557.966,
    "text": "It feels like what we're talking about there is that the models themselves are engaging in a peer-to-peer discussion with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5558.777,
    "end": 5560.538,
    "text": " to refine each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5560.558,
    "end": 5564.299,
    "text": "So the models, it's never one model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5564.559,
    "end": 5564.879,
    "text": "It's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5564.939,
    "end": 5571.682,
    "text": "I always tell people, if I'm trying to explain active inference, I say, if you're in the woods and you don't have a flashlight and it's dark, you're not going to run full speed ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5571.702,
    "end": 5572.802,
    "text": "You're going to stick your hand out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5572.862,
    "end": 5575.303,
    "text": "That's the active part and feel if there's a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5576.297,
    "end": 5578.838,
    "text": " And if there's a tree, you're not going to run forward straight into the tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.058,
    "end": 5582.039,
    "text": "So now you change your model, there's a tree in front of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5582.359,
    "end": 5584.159,
    "text": "Maybe that's a bad way to explain it, but that's how I explain it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5584.579,
    "end": 5586.7,
    "text": "But the thing is, it's not just a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5586.72,
    "end": 5591.641,
    "text": "There's also a model of the rain, and there's a wolf chasing you, and you're hungry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5591.661,
    "end": 5593.242,
    "text": "There's 17 things going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5593.862,
    "end": 5604.225,
    "text": "So what it feels like is, in intention, we bring our models to bear in a peer-to-peer discussion internally,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5605.524,
    "end": 5612.31,
    "text": " And do we already use active inference to model the internal model discussion among models?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5612.671,
    "end": 5614.973,
    "text": "Has that already been something we've talked about in an earlier session?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5615.033,
    "end": 5621.018,
    "text": "I don't remember, but we know we have a zillion different things going on that are agenda in our heads that motivate behavior, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5621.479,
    "end": 5629.626,
    "text": "And so when we're trying to correct behavior or address behavior or become aware of behavior, we bring the other models to bear to let us do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5629.646,
    "end": 5631.828,
    "text": "And again, they're all borrowed ultimately from the externality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5632.267,
    "end": 5643.416,
    "text": " But once they're on board, can active inference or does active inference already, has it been brought to bear to that internal discussion among the models that then informs the decision-making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5643.436,
    "end": 5643.816,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5645.199,
    "end": 5661.169,
    "text": " I believe the closest that we've seen, one example is this nesting, which we'll get back to when we return, but it was Mark Miller at all with their discussion of happiness with the drives for like low thirst, you know, low overwhelmingness for one stimuli versus another.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5661.609,
    "end": 5664.11,
    "text": "There's like a sort of domain specific optimization.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5664.691,
    "end": 5666.132,
    "text": "And then there's this cross domain",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5667.032,
    "end": 5696.057,
    "text": " optimization that has to do with this like eudaimonia well-being component whereas the sort of hedonic drive is is the domain specific that's the department of thirst department of hunger and then those are being optimized in potentially recursed levels as well so that's one way it's gone was that mapping onto classical philosophical concepts of well-being success and then um another direction has been",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5697.157,
    "end": 5700.341,
    "text": " Also linking it up a little bit more graphically, I think, in this type of work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5700.942,
    "end": 5702.704,
    "text": "But nice insights, Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5703.645,
    "end": 5705.186,
    "text": "Just one on that, just a response to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.287,
    "end": 5715.238,
    "text": "When the imp of the perverse, which is that Edgar Allan Poe notion that people act against their own self-interest to show they have power, it's called the imp of the perverse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.192,
    "end": 5720.239,
    "text": " And the idea is that people don't take vaccines because they want to show that they have efficacy or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5720.279,
    "end": 5729.496,
    "text": "So the it's interesting what you just said explains that nicely, because the state that they're seeking is a state of perceived efficacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5730.43,
    "end": 5734.231,
    "text": " And it's overwhelming perhaps some other things like the health thing or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5734.271,
    "end": 5736.692,
    "text": "So that's kind of an interesting notion we just raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5737.492,
    "end": 5741.373,
    "text": "All I'd say is just that we always got to keep that realism instrumentalism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5741.393,
    "end": 5743.014,
    "text": "So you said there's 17 things going on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5743.194,
    "end": 5744.454,
    "text": "Well, not if you didn't model them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5745.214,
    "end": 5747.455,
    "text": "That's a claim about how it quote is out there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5747.955,
    "end": 5749.515,
    "text": "And that's a second order question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5749.955,
    "end": 5758.658,
    "text": "So if it's an allusion to some causal process inside of some people's head, that's different than saying I fit a model that has this hidden variable and that is...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5760.165,
    "end": 5769.21,
    "text": " this intersection of mathematics and qualitative experience that is so tantalizing and so important to how we think about it and frame it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5769.591,
    "end": 5771.192,
    "text": "So it's nice insights though.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5771.472,
    "end": 5771.652,
    "text": "Lou?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5774.494,
    "end": 5781.858,
    "text": "So what Scott just said made me think of, you know, Scott was talking about how our own models interact with one another, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5781.898,
    "end": 5785.921,
    "text": "Like the desire for thirst or hunger or, you know, to regulate temperature or whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5787.502,
    "end": 5788.202,
    "text": "But really like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5789.11,
    "end": 5792.371,
    "text": " where can we start to model each other's models?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5793.131,
    "end": 5811.817,
    "text": "Because I think that in this like collective kind of dynamic, and that was something that I brought up in the .Zero, like this collective phenomenon, like my model of Daniel updates every time I see Daniel, he is as I expect him to be, but then, you know, suddenly, like if he were to be, you know, purple or something, then I would have like the mismatch, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5812.157,
    "end": 5815.278,
    "text": "So our models of each other are constantly interacting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5816.222,
    "end": 5820.366,
    "text": " And where can we start to maybe look at this or think of this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5821.027,
    "end": 5825.27,
    "text": "In what aspect?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5825.29,
    "end": 5835.439,
    "text": "I love that point because what comes to mind for me is in this context of as you are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5836.813,
    "end": 5842.877,
    "text": " I mean, to respond to both of your points, really, like the, what we're talking about here is a model of our model, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5843.157,
    "end": 5846.319,
    "text": "As you move up in the hierarchy, you are modeling your own model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5846.379,
    "end": 5850.782,
    "text": "You're getting some beliefs over how the precisions and the lower levels are, are, are evolving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5851.243,
    "end": 5863.17,
    "text": "And so you've got a model of your, your model as you go up, but what you're also learning there is the, how your mind works and how, you know, different,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5864.381,
    "end": 5881.948,
    "text": " states lead to different like affect for instance and as you continue to do that right as you continue to learn how your own mind works and you get more and more awareness of how things go in your mind well then naturally that you you are also learning about how other people's minds work as well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5883.198,
    "end": 5893.647,
    "text": " And there's always this kind of tension between sort of compassion in practice and awareness in practice or tension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5893.667,
    "end": 5895.429,
    "text": "There's this kind of duality between the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5895.509,
    "end": 5901.855,
    "text": "And they kind of seem to come together out of a model like this, whereby you're training in awareness of your own mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5901.935,
    "end": 5908.28,
    "text": "And what you end up discovering is how difficult it is actually sometimes for things to go well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5908.4,
    "end": 5908.46,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5909.181,
    "end": 5912.894,
    "text": " fundamentally that the one thing that's driving it all is your own desire to be happy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5914.188,
    "end": 5926.452,
    "text": " As you learn that, as that really becomes part of your own model, then that naturally projects onto everybody else and you kind of get this rebound of, oh, but then everybody else is also trying to be happy and it's hard for them too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5927.012,
    "end": 5938.576,
    "text": "And you get this kind of natural, compassionate response then that comes as a result that I think also is related to this idea that Scott was talking about before, which is that none of these things happen in a vacuum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5938.616,
    "end": 5939.996,
    "text": "Like my own well-being is so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5941.937,
    "end": 5948.278,
    "text": " intertwined with your well-being and so all these things kind of grow then together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5949.574,
    "end": 5949.854,
    "text": " Nice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5950.234,
    "end": 5958.54,
    "text": "It's almost like in Scott's forest, one element is there's other people and maybe non-people entities in the forest.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5958.56,
    "end": 5965.525,
    "text": "And then another aspect would be like, you can modify your niche, you can walk different ways, you can use technology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5966.065,
    "end": 5971.889,
    "text": "And it's sort of that tension between how sort of slam dunk it is for a very constrained case.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5973.14,
    "end": 5998.106,
    "text": " wanting and sort of hinting that it could generalize that more because of the ease at which it can integrate not just within a domain like the mountain car or just thirst but across domains especially in a way where all the benefits of the first level relatively speaking like the computability and the interpretability of parameters if one believes that then it exists also at the second level and higher levels so like figure five you have the three layers",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5999.166,
    "end": 6006.509,
    "text": " or six, but then 12, the generalized model, like you only had two with it, I guess, implicit hint that you just do it again.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6006.529,
    "end": 6010.791,
    "text": "Yeah, it's just so pretty cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6010.831,
    "end": 6015.153,
    "text": "Dean, I mean, just to just to speak to that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6015.193,
    "end": 6022.756,
    "text": "I mean, you can and I have and you can start to think about, you know, the the third",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.398,
    "end": 6036.69,
    "text": " level the sort of third level equivalent of attention was sort of awareness of mental states right so now it's like you're not you're not just aware of where your attention is but you're aware of how much you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6037.861,
    "end": 6039.622,
    "text": " you know, to what extent do I want here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6039.722,
    "end": 6041.702,
    "text": "To what extent am I certain about my environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6041.722,
    "end": 6042.923,
    "text": "To what extent am I happy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6043.023,
    "end": 6046.004,
    "text": "To what extent am I doing things automatically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6046.024,
    "end": 6050.745,
    "text": "To what extent am I being influenced by my memories and priors, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6051.305,
    "end": 6053.266,
    "text": "That to go through the whole gambit there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6053.886,
    "end": 6062.309,
    "text": "But then you could do the same thing with B at the third level, gamma B. And so, okay, so what is that state telling you?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6062.329,
    "end": 6066.43,
    "text": "And so, well, to what extent is my mind volatile?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6067.23,
    "end": 6072.153,
    "text": " So how confident am I about the transitions of my mental states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6073.413,
    "end": 6077.615,
    "text": "And let's say you take a psychedelic or something and all of a sudden your mental states are all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6077.975,
    "end": 6084.419,
    "text": "Well, then maybe that precision at the third level would drop because now you don't have the ability to predict how your mental dynamics are moving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6085.099,
    "end": 6094.204,
    "text": "Or C, to what extent am I wanting or not wanting particular mental states as opposed to sensory observations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6094.96,
    "end": 6102.351,
    "text": " you know, like how much, how much attachment do I have to joy and fear right now is what you'd be inferring at that level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6102.391,
    "end": 6104.594,
    "text": "And you can kind of keep, keep going, keep going through that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6106.957,
    "end": 6108.239,
    "text": "Thanks Dean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6109.881,
    "end": 6135.313,
    "text": " yeah so i know we're getting close to the end here and i just kind of wanted to bring this up so my history just a little bit of context was that i i was a context generating programmer for high school kids and i wanted to take them from a place of subliminal to liminal to understanding what the edges were what the limits were so my my basic job was unnesting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6136.368,
    "end": 6157.91,
    "text": " learners having them transition but having them take a model outline along with them so they weren't kind of going naked into the forest so what one of the things that we used to talk about in this transitioning across basically the deep generational transformation was using a street metaphor starting with perceiving",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6159.266,
    "end": 6166.889,
    "text": " So which kind of is unplanned and moving to thinking about thinking, which is plan and attend and attend and plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6167.73,
    "end": 6173.132,
    "text": "And then this was the critical piece, realizing the inside the lines versus the outside the lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6173.172,
    "end": 6179.455,
    "text": "And with the example that we use is that there's a kind of a crosswalk logic calculation problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6180.515,
    "end": 6186.22,
    "text": " So you use logic to push the button that gets the flasher going before you enter the crosswalk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6186.941,
    "end": 6188.222,
    "text": "You stay inside the lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6188.242,
    "end": 6197.911,
    "text": "You even have perfect gating and balance so that you can look at your phone while you're crossing the street through those lines of immortality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6198.711,
    "end": 6203.596,
    "text": "And now you're dead because there was a driver in a car who was also looking at their phone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6204.491,
    "end": 6205.912,
    "text": " And an accident occurred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6206.233,
    "end": 6210.717,
    "text": "So the question you had then was, did you follow the logic?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6210.757,
    "end": 6211.838,
    "text": "Did you use the rules?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6212.579,
    "end": 6213.62,
    "text": "And the answer was yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6214.561,
    "end": 6216.643,
    "text": "And were you aware of the free energy gap?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6217.063,
    "end": 6218.765,
    "text": "And the answer was, well, not anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6220.066,
    "end": 6224.03,
    "text": "Because logic tends to point at the jaywalker and ask, what are they thinking?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6224.19,
    "end": 6225.872,
    "text": "I mean, come on, they're taking the risk here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6227.434,
    "end": 6235.361,
    "text": " Those jaywalkers are probably thinking about the opportunity that there's no cars coming at me right now or on the street, they're not present.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6235.981,
    "end": 6238.724,
    "text": "So they're thinking about the context and the directionality",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6239.901,
    "end": 6243.182,
    "text": " of the transition, and they're also thinking about the rate of travel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6243.542,
    "end": 6245.342,
    "text": "How fast can I get across the road?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6245.982,
    "end": 6246.943,
    "text": "And will I get a ticket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6246.983,
    "end": 6250.383,
    "text": "Will there be somebody who's going to catch me and pull me over?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6251.444,
    "end": 6256.365,
    "text": "Altogether, who's making a decision based on more information from which to update?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6256.405,
    "end": 6258.725,
    "text": "And I think this is the big question around precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6259.706,
    "end": 6268.208,
    "text": "After all, are parallel lines in the street and in a mathematical operations context supposed to represent logic and precision?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6268.268,
    "end": 6269.028,
    "text": "I think they are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6269.966,
    "end": 6276.008,
    "text": " And in this case, and based on this slide right here, this is why I liked you talking about math is not the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6276.668,
    "end": 6279.629,
    "text": "Math does allow for the sketching out of territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6280.029,
    "end": 6287.831,
    "text": "And sometimes we can get inside the lines and think that we are using the logic when in fact, we're actually going to be more precise",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6288.976,
    "end": 6295.642,
    "text": " and actually use what I would think to be logic based on more information once we get outside those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6296.162,
    "end": 6306.631,
    "text": "So when I think when we get into the point two of this, I think that's going to be a really interesting point because Steven talked about, it was Steven, you were wondering, Lars, who was the person who was talking about being really still?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6307.552,
    "end": 6309.434,
    "text": " That was Steven before he had to take off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6309.914,
    "end": 6322.365,
    "text": "I'm kind of wanting to think about this as being really active and being really contemplative and being really precise and then be able to sort of tie that in with the metacognition piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6322.405,
    "end": 6324.566,
    "text": "Because I think it's the transition here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6325.367,
    "end": 6329.67,
    "text": " that all of us are trying to parallel or trying to sort of piggyback on your paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6330.251,
    "end": 6334.654,
    "text": "And I think that's the real value in this conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6335.234,
    "end": 6340.718,
    "text": "I also think that we can get outside the lines and learn more than we often do while we're inside the lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6340.738,
    "end": 6342.779,
    "text": "Because, you know, I'm immortal now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6342.859,
    "end": 6345.201,
    "text": "I've got these two white lines protecting me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6345.901,
    "end": 6347.763,
    "text": "And that's not always necessarily the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6348.857,
    "end": 6350.517,
    "text": " Yes, yes, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6350.537,
    "end": 6371.363,
    "text": "I mean, what you're talking about there, for me, speaks to this power of suspended belief or uncertainty in our own, maintaining a sense of uncertainty in our own model so that no single belief can become so rigid and enshrined that it's resistant to updating in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6372.702,
    "end": 6396.384,
    "text": " And if you spoke to Ines and Mark Miller recently, it's kind of down the same line that a lot of dysfunction, a lot of low states of well-being comes from that rigidness and that freezing of beliefs that then lead to all kinds of afferent behavior afterwards because you're trying to fulfill the expectations of belief that isn't being updated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6397.443,
    "end": 6409.692,
    "text": " the the what's on offer here is a mechanism to describe how you might remedy that solution by deliberately controlling or inquiring about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6410.253,
    "end": 6416.177,
    "text": " the metacognitive belief, so gamma B in this case, over my priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6416.237,
    "end": 6435.169,
    "text": "And if I can control that state transition, well then it gives me the opportunity to relearn that B matrix at the bottom because I've injected a little bit of uncertainty and now I'm more able to sample information that is counter to what I know and allows for better optimization ultimately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6435.189,
    "end": 6437.35,
    "text": "Yeah, take the bottle along.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6438.809,
    "end": 6454.86,
    "text": " thanks dean and awesome insight there so just in the last couple minutes to dave any textual questions live chat any final questions and then scott and then blue if you'd like to make a last comment so go ahead scott",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6456.633,
    "end": 6464.736,
    "text": " So, Dean, what you were just saying there goes to what I was trying to fuss with on that equity point before, where it's the rules of general application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6465.136,
    "end": 6478.52,
    "text": "And what I realized while you were saying, the reason the equity is so fascinating to me is what they did in law and equity is they said, okay, the rules of general application don't always lead to the right results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6479.594,
    "end": 6486.805,
    "text": " And what they've now done is collected all the remedies for the bad results and can characterize those into groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6488.052,
    "end": 6499.08,
    "text": " So you may have a rule of general application, and then there's something out there in equity called unclean hands, which means if I did something wrong, if I'm a burglar, I can't sue you if I trip over your coffee table, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6499.12,
    "end": 6500.1,
    "text": "That's unclean hands, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.621,
    "end": 6512.149,
    "text": "Or the doctrine of unjust enrichment means if I find some money, or if I get some extra money, you pay me too much, give me an extra $20 bill, I say I keep it because you gave it to me, but it wasn't meant to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6512.73,
    "end": 6513.531,
    "text": " It's unjust enrichment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6513.551,
    "end": 6516.858,
    "text": "So equitably, you should give it back or find someone's wallet, all this stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6516.898,
    "end": 6517.058,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6517.559,
    "end": 6521.808,
    "text": "So the reason I when you were just talking, maybe you realize, you know, it may be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6522.745,
    "end": 6527.631,
    "text": " that we apply the rules of general application, and then we find some exceptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6528.452,
    "end": 6542.288,
    "text": "And then when we start or some ways they don't apply the right way in active inference, and maybe we start to cluster those bad results, let's call them or unintended results or something and start to cluster them and characterize those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6543.382,
    "end": 6544.502,
    "text": " like they did in equity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.542,
    "end": 6557.986,
    "text": "So that's what I was groping for before, is the rules of general application can have great value, and they need those corrections, and those corrections themselves may have clusterings and groupings that themselves can be managed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6558.667,
    "end": 6558.827,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6559.387,
    "end": 6560.407,
    "text": "Great discussion, by the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6560.467,
    "end": 6561.447,
    "text": "Thank you so much, Lars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.487,
    "end": 6562.708,
    "text": "It's fascinating stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6563.468,
    "end": 6563.668,
    "text": "Yep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6564.208,
    "end": 6564.848,
    "text": "Thanks, Scott.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6565.108,
    "end": 6565.309,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6567.708,
    "end": 6571.231,
    "text": " Yeah, I'm looking forward to more next week, hopefully, if you're available.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6571.531,
    "end": 6576.015,
    "text": "And maybe kind of probing the different types of meditation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6576.115,
    "end": 6582.921,
    "text": "And I'm not sure how familiar you are with different kinds of meditation, but I've done a bunch and highly variable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6583.061,
    "end": 6587.385,
    "text": "And maybe whether or not they all fit this model or not is something I've been kind of thinking about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6587.425,
    "end": 6590.648,
    "text": "And I'm going to think a little bit more about that over the next week.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6590.948,
    "end": 6592.229,
    "text": "So thanks for the great discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6593.544,
    "end": 6594.605,
    "text": " Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6595.386,
    "end": 6595.846,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6595.886,
    "end": 6607.477,
    "text": "I think it will be good to see if anybody who's listening in the intervening week wants to join or if they just want to watch along next week so that they can ask questions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6608.337,
    "end": 6611.68,
    "text": "And I think exploring that aspect of group development",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6612.581,
    "end": 6640.534,
    "text": " active inference agents by design or out there in nature that we've been discussing a lot you know when is it is it can we model it that way and then asking well can't we have nested metacognitive models of groups what does that mean is it a different philosophical bridge is it two exits on the same freeway what is going to be the relationship there so great times thanks lars and if you have any final comments otherwise we'll end it",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6642.156,
    "end": 6642.616,
    "text": " No, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6642.636,
    "end": 6644.618,
    "text": "This has been really great and a really fun conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6644.658,
    "end": 6647.299,
    "text": "Thank you for your openness and great questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6647.319,
    "end": 6649.1,
    "text": "I just really enjoy the energy here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6649.14,
    "end": 6654.284,
    "text": "It's not been difficult at all, if you see what I'm saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6654.364,
    "end": 6654.564,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6655.064,
    "end": 6655.344,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6655.744,
    "end": 6657.526,
    "text": "Peace out, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6657.546,
    "end": 6658.046,
    "text": "See you next week.",
    "speaker": "SPEAKER_02"
  }
]