[
  {
    "start": 7.537,
    "end": 10.238,
    "text": " Hello and welcome everyone to the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.418,
    "end": 17.021,
    "text": "This is ACT-INF Lab live stream number 28.2 on September 14th, 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.902,
    "end": 30.988,
    "text": "And we're going to be having our .2 follow-up discussion on the paper, Towards the Computational Phenomenology of Mental Action, Modeling Meta-Awareness and Attentional Control with Deep Parametric Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.588,
    "end": 34.188,
    "text": " Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.009,
    "end": 42.51,
    "text": "We are a participatory online lab, that means you can participate, that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.791,
    "end": 45.551,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.711,
    "end": 52.693,
    "text": "This is recorded in an archived live stream, so please provide us with feedback so that we can be improving our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.833,
    "end": 56.214,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.054,
    "end": 60.835,
    "text": "We'll be following good etiquette for live streams and see who joins in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.867,
    "end": 86.773,
    "text": " this short link you can find the calendar of events for 2021 as well as all the other kinds of streams that we do related to kind of wildcard guest streams and the more technically oriented model streams and math streams and we have some preliminary decisions for what we'll read in 29. today though we're here to continue the discussion on 28",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.069,
    "end": 93.111,
    "text": " paper, which is the towards a computational phenomenology of mental action paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.992,
    "end": 96.813,
    "text": "And again, we'll see who joins and see where we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 96.833,
    "end": 101.955,
    "text": "I wrote down a few comments and questions, but I know that there's many ways it can go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.075,
    "end": 111.199,
    "text": "And of course, everybody who's watching live, definitely, um, leave us questions and comments and we can address them on the stream, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.5,
    "end": 115.841,
    "text": " and everyone's participating who's here at this time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.221,
    "end": 120.102,
    "text": "We can start with just some introductions and warmups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.382,
    "end": 130.884,
    "text": "Since there's only a few of us, we can say hi and reminisce on what brought us to this paper or even where we'd like to go for the DOT 2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.124,
    "end": 137.946,
    "text": "Where are we jumping off from or to as we're in that kind of the middle of the gangplank, the middle of the diving board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.591,
    "end": 142.298,
    "text": " I'm Daniel and I'm a researcher in California.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.381,
    "end": 146.911,
    "text": "And I think today I wrote down the pieces that I wanted to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.587,
    "end": 172.575,
    "text": " if not resolve just at least explore a little bit and it had to do with annotating that generalized model of mental action and seeing if we could find words in a language or scenarios or exercises thought experiments find some tangible ways to interact with these different aspects of uncertainty and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.843,
    "end": 182.186,
    "text": " On a more theoretical note, ask how are those maybe related to neurological function or certain kinds of measurements that are made in the laboratory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.646,
    "end": 192.509,
    "text": "But just at the experiential level, are there cases where we actually can get in touch with some of these different, qualitatively different kinds of uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.41,
    "end": 198.671,
    "text": "So either Dean or Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.051,
    "end": 199.951,
    "text": "Go ahead, Stephen, and then Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.801,
    "end": 206.6,
    "text": " yeah good morning from toronto um yeah i'm interested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.574,
    "end": 210.816,
    "text": " to sort of pursue what we were talking about in the last session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.836,
    "end": 231.885,
    "text": "And I'm very interested in the fact that a bit like, to some extent, process-orientated psychology by the Mindels, which comes out of some work around information theory in the 70s, this idea of really getting into the process from within and the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.965,
    "end": 235.247,
    "text": "So this paper starts to look at giving evidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.391,
    "end": 262.997,
    "text": " actual models or at least a heuristic as well for thinking about how we phenomenologically can be doing stuff from the inside and for me that's exciting because psychology can be kind of limiting because it's always this external modeling of people which then sort of but how can we get and look at some of the structures of how we operate at some level so this this is cool and i think this is the first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.897,
    "end": 272.482,
    "text": " or one of the first papers that really gets into that phenomenology beyond a philosophical point of view and starts to sort of give a few handles on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.782,
    "end": 275.024,
    "text": "And, um, that's where I'm interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.044,
    "end": 277.765,
    "text": "So I'm going to pass this over if it's okay, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.266,
    "end": 279.726,
    "text": "Good morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.746,
    "end": 280.367,
    "text": "My name is Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.427,
    "end": 281.667,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.768,
    "end": 289.992,
    "text": "And a few years back, I read a book by a philosopher by the name of Douglas Hofstadter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 290.012,
    "end": 291.333,
    "text": "It's called, I'm a strange loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 292.514,
    "end": 292.954,
    "text": "And, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.509,
    "end": 303.737,
    "text": " Yeah, sort of trying to put some sort of a context on when I read that book and then this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.738,
    "end": 319.051,
    "text": "Hofstadter doesn't really get into the perception of, I'm aware of planning to make a plan because I can think about my thinking, so what of this plan policy of attention, and then all of the math that supports that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.196,
    "end": 330.324,
    "text": " And then he sort of doesn't really get into, and then what I attend to tells me what I'm losing focus on, which is what this paper also talks to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.885,
    "end": 339.213,
    "text": "So again, I'm just trying to, I'm trying to put these two ideas side by each and without saying either one of them is more correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.253,
    "end": 340.715,
    "text": "I think they're very complimentary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 340.815,
    "end": 342.797,
    "text": "So yeah, that's where I kind of was,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.641,
    "end": 348.104,
    "text": " looking at this and saying, Hmm, this is really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.164,
    "end": 351.126,
    "text": "So yeah, that's where I, I'm kind of coming at this from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.367,
    "end": 362.215,
    "text": "So on the Hofstetter, the strange loop and the GEV, some works that I really love as well as mine's eye with Dennett.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 363.056,
    "end": 363.176,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 363.656,
    "end": 368.74,
    "text": "It does seem like his focus is on how symbols are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.349,
    "end": 386.96,
    "text": " are computed upon which makes sense given his kind of computational focus and so we've talked a lot about how syntax and semantic layers can be seen within active inference and that doesn't have phenomenology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.072,
    "end": 389.053,
    "text": " in the picture at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.733,
    "end": 398.621,
    "text": "And that's why the sort of question about how computers interpret syntax and how that becomes semantics is orthogonal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.022,
    "end": 403.565,
    "text": "It's kind of, you could take one take on another whether computers have experience or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.826,
    "end": 410.952,
    "text": "Like you don't need to think that computers are having an experience or not to ask how a programming language is compiled or interpreted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.492,
    "end": 422.947,
    "text": " So there's sort of that two by two with how meaning is made in a computational sense and then how our meaning is made and experienced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.068,
    "end": 426.091,
    "text": "So that's definitely an interesting piece",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.603,
    "end": 430.224,
    "text": " Stephen, you wrote from the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.324,
    "end": 437.408,
    "text": "What do you think differentiated this approach rather than the theoretical or the philosophical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.949,
    "end": 446.794,
    "text": "And what does it look like for an academic work or for a work of research to not just be theoretical or philosophical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.436,
    "end": 449.656,
    "text": "Yeah, this is a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.806,
    "end": 464.75,
    "text": " Well, I suppose having sort of mechanisms and identifiable relationships between aspects of experience, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.251,
    "end": 466.931,
    "text": "thinking about thinking and our sense of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.293,
    "end": 485.704,
    "text": " accuracy in our predictions and things like that gives a way for stuff to relate to each other otherwise it tends to be one thread of that so be it consciousness be it um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.866,
    "end": 505.289,
    "text": " awareness be it that one thread then can be mused about and we could get quite an interesting philosophical explanation of what it is the thing is though that you can't really process that or try to emulate the process of that on its own there needs to be something else that it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.385,
    "end": 524.521,
    "text": " somehow like you say the body well what's the body you know some sort of sensory feelings some sort of sense of predictions about something else and normally that seems to be where things fall down a bit ends up going off to the neuroscience world and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.775,
    "end": 550.287,
    "text": " which is great but still ends up being a kind of a model of the brain right so you're in this neuro phenomenology world where it's kind of explaining phenomenology but through the brain but again I can't the brain has got no feelings inside it you know so you can't be your brain I think we think we can because we have all these pictures of brains as if they are people but so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.323,
    "end": 573.34,
    "text": " It's an interesting question because I hadn't really quite thought about it this way, but I think there's something about having different aspects of our phenomenological being able to meaningfully relate and not end up being kind of a deep explanation of one strand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.36,
    "end": 575.022,
    "text": "I don't know if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.983,
    "end": 586.429,
    "text": " It also makes me think about in Hofstetter's Gödel-Escherbach, GEB, one of the main strange attractors is the Turing test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.989,
    "end": 593.813,
    "text": "So that's the question about how you can identify on the other side of the blanket some other system in another room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 594.553,
    "end": 601.037,
    "text": "How do you know whether it's a human or whether it's a computer or whether it's aware or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.517,
    "end": 601.638,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.458,
    "end": 604.399,
    "text": " There's been all kinds of thought on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.26,
    "end": 612.065,
    "text": "And it's almost like, what happens when you take that as a fundamental unknowable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.765,
    "end": 618.97,
    "text": "How do we respect what's on the other side of the wall and maybe even give it an affective parameter?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.878,
    "end": 625.982,
    "text": " while recognizing that we have the same and we're experiencing it, but we're never gonna be able to experience what's on the other side of the wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.462,
    "end": 630.705,
    "text": "We're gonna be only able to experience our interactions with what's coming across.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.565,
    "end": 636.008,
    "text": "And I think that's why Hofstetter and Dennett worked well together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.721,
    "end": 640.763,
    "text": " Because Dennett, with the intentional stance, is kind of like saying, it's simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.963,
    "end": 643.725,
    "text": "It doesn't really matter if you're playing chess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.765,
    "end": 648.127,
    "text": "It doesn't matter if you're playing somebody who's human or a supercomputer or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.407,
    "end": 649.568,
    "text": "It's about what's on the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 650.168,
    "end": 653.17,
    "text": "And in a way, that's kind of like the way that we're addressing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.51,
    "end": 657.192,
    "text": "It's about the sensory input coming in and how we're modeling the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.752,
    "end": 660.414,
    "text": "So if it's in the other room, the Turing test is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.454,
    "end": 663.155,
    "text": " on the outside of our blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.335,
    "end": 671.6,
    "text": "We're experiencing what's inside, and that could be an illusion or it could be super real or all that's real, depending on, again, which philosophy you decide to lean towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.04,
    "end": 682.106,
    "text": "But the question about how we interpret and experience our own parameterization of these models is really secondary from the implications of what's on the other side of the veil.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.446,
    "end": 682.686,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.167,
    "end": 687.008,
    "text": "Yeah, that's a really useful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.914,
    "end": 701.642,
    "text": " lens to bring to play actually and actually the game brings this back out maybe so that we're not suddenly focused only on the individual isolated from the world but one thing i think is really interesting with that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.952,
    "end": 710.214,
    "text": " With active inference, there's this, well, an active inference, if we're going to go down that route, is that you know with your body, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.254,
    "end": 713.315,
    "text": "So ultimately, the active agent can check in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.215,
    "end": 732.001,
    "text": "And I think what you're just saying there is one thing that I would know over a period of time if something was alive is if they had to reflect on some aspect of our discourse, okay, and it was something which neither I could know or they could know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.445,
    "end": 739.728,
    "text": " I, but when they checked in with themselves, they came up with an answer, which I could find plausible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.328,
    "end": 740.969,
    "text": "That makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.569,
    "end": 744.39,
    "text": "So there's no way that you, you know, you know, there's those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.631,
    "end": 745.491,
    "text": "What do you feel about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.591,
    "end": 746.712,
    "text": "Well, I fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.752,
    "end": 747.832,
    "text": "And then you come up with something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.912,
    "end": 750.654,
    "text": "He's like, we, there's a knowing that you come up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.694,
    "end": 750.954,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.274,
    "end": 753.055,
    "text": "But that wasn't in your semantic sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.835,
    "end": 772.834,
    "text": " lexicon of pre-programmed stuff you're able to check in somehow and that's the sort of thing an artificial machine can't do unless it can check into some some way of knowing because if it wasn't known before how could it have ever been programmed into the supercomputer so that's kind of interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.184,
    "end": 778.846,
    "text": " It comes up in this paper with a question about transparency and opacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.526,
    "end": 784.107,
    "text": "So again, the kind of what is water transparent states are the ones that you see right through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.247,
    "end": 786.868,
    "text": "So you actually don't perceive them directly like air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.489,
    "end": 792.31,
    "text": "And then the opaque states are the ones kind of like the matte black wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 792.51,
    "end": 793.691,
    "text": "You can see it really well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.291,
    "end": 797.012,
    "text": "And so this question about how a prompt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.018,
    "end": 803.202,
    "text": " can almost like a phase transition move something from being transparent to opaque.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.482,
    "end": 806.044,
    "text": "Like how does your leg feel right now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.164,
    "end": 817.592,
    "text": "And it moves it from being a transparent state, potentially one that attention is not being paid to, to an opaque state, which is something that attention is being paid to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.132,
    "end": 825.857,
    "text": "That's one of the major contributions of this paper, which is to take Metzinger's framework of transparent and opaque states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.778,
    "end": 837.083,
    "text": " as applied to phenomenology and bring that into the affective framework developed by Hess at all for the deep parametric active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.704,
    "end": 851.45,
    "text": "So it is like these multiple threads coming together and then it's just so appropriate that attention is kind of the thread that links it and precision and awareness are kind of coming together in new ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.47,
    "end": 854.612,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.075,
    "end": 867.602,
    "text": " The two things I wrote down, and of course, anyone watching live definitely ask random questions, no off topic questions, no such thing exists, not forbidding such questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.284,
    "end": 881.171,
    "text": "So one thing as kind of addressed earlier was I thought it'd be fun to annotate figure 12 a bit and explore some of these qualitatively different forms of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.231,
    "end": 885.353,
    "text": " And, but maybe a lead in topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.673,
    "end": 889.436,
    "text": "And again, anyone can just feel differently or ask a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.936,
    "end": 894.96,
    "text": "A lead in topic was like, how do we think about uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.14,
    "end": 897.401,
    "text": "Greetings, fellow jitzer, blue jitzer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.125,
    "end": 908.389,
    "text": "Uncertainty in remote work, just how often when you send a message,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.795,
    "end": 938.823,
    "text": " you don't get that instantaneous feedback that you would in a video conversation or in an in-person conversation because the time lag is very different so it's almost like you're left hanging with the uncertainty or you have to come to a new way of understanding your uncertainty because you're not or you're expecting not to hear from them oh i know that they're on the other side of the world so i'm expecting not to hear from them for the next hours just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.912,
    "end": 951.658,
    "text": " I wondered what sorts of these personal level uncertainties applied to the remote case, and then thinking about the remote team as its own active inference entity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.978,
    "end": 964.226,
    "text": " Are there uncertainties that exist for located or remote teams that don't necessarily find themselves simply explained by personal level affect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.007,
    "end": 972.893,
    "text": "Are the things that teams are uncertain about that people are certain about, like a hung jury or a split election or decision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.814,
    "end": 978.557,
    "text": "Are there things that people are uncertain about, but that groups can be quite certain about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.751,
    "end": 1010.565,
    "text": " yeah but that's just things that we can just return to at any time just got my package through from my mum for baby clothes from england so i'm back nice nice um i think blue wants to say something yes blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.354,
    "end": 1024.041,
    "text": " Yeah, so just to that point, I mean, I think that like that's like the kind of like lifeline or ask the audience like in the, you know, when you have uncertainty about a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1024.061,
    "end": 1028.944,
    "text": "I mean, an individual can be uncertain, but the crowd can have some certainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1028.984,
    "end": 1031.926,
    "text": "And wasn't there something about guessing the weight of a bison or something?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1032.506,
    "end": 1040.689,
    "text": " Some story like that, like where, you know, the I think it was the median value was exactly the weight of the bison, like from this entire like divergent crowd.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1041.429,
    "end": 1044.09,
    "text": "I'm not sure the exact I don't remember, like the exact story.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1044.13,
    "end": 1045.47,
    "text": "It's just kind of faint in my memory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1045.53,
    "end": 1050.052,
    "text": "But I mean, I think that definitely the crowd knows what the individual can't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1052.172,
    "end": 1052.873,
    "text": "Maybe there's many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.973,
    "end": 1053.753,
    "text": "Oh, yeah, Stephen, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.767,
    "end": 1059.849,
    "text": " Yeah, I think that's an interesting one that Blue mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.309,
    "end": 1065.67,
    "text": "And also, I suppose there's this question, well, let's say we take Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.69,
    "end": 1076.254,
    "text": "If it's a distributed sense of something, well, so when you've got a very large number, there may be this distributed sense, which people have got a feel for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.059,
    "end": 1085.222,
    "text": " I mean, I suppose it assumes that there's not complete noise, that the people have got some kind of idea out of that group, but there's some knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.282,
    "end": 1101.368,
    "text": "But in a team and stuff, there is this question, and this may be really what types of things we're evaluating, is with a team or a group, because teams tend to have a particular teleology, if we're trying to get a handle on something intersubjective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.185,
    "end": 1106.947,
    "text": " I mean, a classic case with this would be, say, in a marketing agency or something like that, or with a film.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.648,
    "end": 1115.852,
    "text": "You know, you might want to get a sense of... You might get market research, but you also might... The creative team might get a sense of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.398,
    "end": 1121.419,
    "text": " What is, you know, how's this going to land?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.819,
    "end": 1125.36,
    "text": "You know, and that might be an integrated thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.34,
    "end": 1132.602,
    "text": "And it might be the other creative director that is pushing out their one vision because they're trying to be novel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.622,
    "end": 1138.524,
    "text": "They're trying to give something that breaks the group expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.324,
    "end": 1142.345,
    "text": " However, you also then want to stay within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.365,
    "end": 1148.186,
    "text": "I mean, a classic one would be like Ricky Gervais before the when he did his.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.366,
    "end": 1148.807,
    "text": "What is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.287,
    "end": 1152.428,
    "text": "It's not the Oscars, but he did the other one, the Golden Globes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.308,
    "end": 1157.509,
    "text": "At some point, he had to kind of wait what he could get away with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.889,
    "end": 1158.209,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.909,
    "end": 1164.291,
    "text": "So there would have been a whole lot of people sort of seeing how that could get tweaked and nudged so that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.231,
    "end": 1168.372,
    "text": " it basically fits on that very near edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.553,
    "end": 1178.637,
    "text": "And that's, uh, you know, that, that would tie quite well with the fact that you need to have more, you can't, it's not just multi-sensory integration on one person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.657,
    "end": 1179.157,
    "text": "That's enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.217,
    "end": 1187.821,
    "text": "You might need multi into subjective awareness integration to get a better sort of integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.982,
    "end": 1196.172,
    "text": " right you need to know how others thinking through other minds or theory of mind you need to kind of have an estimate of how others will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.639,
    "end": 1201.361,
    "text": " feel about your stimuli from an affective dimension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.982,
    "end": 1210.628,
    "text": "And Blue, I think the example with the ox and guessing the weight, it's Francis Galton, sir, Francis Galton, perhaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.508,
    "end": 1212.749,
    "text": "And I just looked it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.909,
    "end": 1219.193,
    "text": "It was 787 fair goers who predicted the weight of this animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.814,
    "end": 1224.136,
    "text": "And that the average was extremely close, even though of course, many individuals probably",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.077,
    "end": 1227.478,
    "text": " or over or under by vast margins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.118,
    "end": 1234.501,
    "text": "And it ties us back to the strange loop and Aunt Hillary, the ant colony in GEB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.481,
    "end": 1238.222,
    "text": "And when does collective decision-making work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.722,
    "end": 1242.924,
    "text": "Collective decision-making amongst cortical neurons, it seems to work pretty well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.044,
    "end": 1245.505,
    "text": "That's kind of what evolution has shaped.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.465,
    "end": 1262.079,
    "text": " why did it work for predicting the weight of that ox well potentially many people were familiar with how much animals weighed another answer is that it was within an order of magnitude like you could probably say well it's probably not 100 pounds and it's probably not 10 000 pounds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.8,
    "end": 1286.646,
    "text": " so when there's bounds to the estimate rather than it being distributed over like many orders of magnitude there's a case for the average being something that can be taken and that actually has analogy to a lot of these mean seeking distributional techniques that we utilize like the case where the actual distribution might be very rough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.537,
    "end": 1297.265,
    "text": " but we use variational techniques that can pursue, for example, the mean of the distribution and just sit the weight of our distribution that we control Q and sit,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.417,
    "end": 1308.504,
    "text": " with only one or a few parameters right over the bulk of the distribution, rather than getting into the hundred parameters that might describe the actual underlying distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.285,
    "end": 1317.892,
    "text": "And so it's like, under what cases can distributions be well approximated by their mean and by many independent estimates?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.652,
    "end": 1322.716,
    "text": "And under what cases might you be looking, just like Stephen said, with a marketing agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.456,
    "end": 1345.576,
    "text": " trying to be creative or novel under what cases are you actually looking not to estimate the mean but rather to propose a counterfactual or to make something that is going to succeed by virtue of its novelty steven yeah and also it takes you into this world of the of the rural",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.297,
    "end": 1369.597,
    "text": " community i don't know if it's rural america you know they will have their wisdom about those types of things they're fair goers they they probably got quite an insight into animals you know they i bet you could get a fairly good idea of how slippery it would be to try and grab hold of that baby hog you know in a way that the city folks wouldn't have a clue so it's a this kind of contextual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.698,
    "end": 1386.617,
    "text": " social like knowing it's quite you know that I think that's a good thing to bring in as well when we think about participation you know this knowing that can be in different communities outside of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.438,
    "end": 1405.548,
    "text": " the cities and the advertising agencies and these dominating media leaders of thought, I think it shows how we need to be able to bring in these more disparate ways of experiencing the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.475,
    "end": 1432.4,
    "text": " well when it's seen that there's a mean or an average like there was the famous like um like average american survey or something like the dimensions of the average person but then like no single person was within a tolerable limit of that average yet there was an approximation um versus casting it into the experience like how will this be received by different people it includes in the question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.39,
    "end": 1441.717,
    "text": " the need to think through other minds and that no one was thinking through the animal when they had to predict the weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.777,
    "end": 1444.86,
    "text": "That's that external, the third person psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.34,
    "end": 1447.462,
    "text": "And it was estimating a physical attribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.502,
    "end": 1449.344,
    "text": "So it's not like they were trying to do anything different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.744,
    "end": 1455.99,
    "text": "But now if you asked on a scale of one to 10, how do we estimate how happy this animal is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.031,
    "end": 1463.333,
    "text": " the variance around that estimate is going to be of a very different kind and potentially an irreducible kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.353,
    "end": 1465.894,
    "text": "We're not just looking for a point estimate to converge on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.074,
    "end": 1470.775,
    "text": "Maybe there's differences in opinion and that is something that would be revealed through that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.315,
    "end": 1477.177,
    "text": "Whereas if you're wrong about the weight, it's just because maybe you're not used to it or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.677,
    "end": 1478.017,
    "text": "Steven, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.073,
    "end": 1504.69,
    "text": " Yeah, that's a good point to bring in as well, is when looking, and say also we maybe want to bring in this Bayesian inference as well, like if you could have multiple rounds, you know, like when Carl Friston does some of the demonstrations, it would be interesting, A, to be able to have some way of looking at something and using multiple iterative rounds, which they do in a lot of processes like future search and...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.971,
    "end": 1533.685,
    "text": " other kind of group participatory processes and also though to break apart the generative models at play so you and this is this is the challenge is with a lot of things is with normal statistics is you'll get an answer you'll get a graph if you just take all the numbers and divide by x right and then so someone's now got research results but the thing is like you say it makes a difference if you've got three models two models five models one model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.545,
    "end": 1560.351,
    "text": " going on of the reality that they're trying to in theory that that the weight of the cow there's probably one model there might be a couple of different ways of trying to think about how to go to that model but you know it's sort of a fairly clear proposition but if you do have more than one generative model or one contextual engagement that's being used teasing that out and then having a way to iteratively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.957,
    "end": 1570.645,
    "text": " do Bayesian inference and active inference on each of those models so they can be teased apart would look like it'd be a useful thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.665,
    "end": 1572.366,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.607,
    "end": 1572.787,
    "text": "Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.121,
    "end": 1588.047,
    "text": " Yeah, I was just going to say to Stephen's point, there's a book called The End of Average by Todd Rose that speaks to those times when finding the mean doesn't really work and you do have to kind of pull that generative model apart.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1588.847,
    "end": 1592.148,
    "text": "So if you're interested in that, there's a great reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.87,
    "end": 1596.37,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.511,
    "end": 1600.012,
    "text": "And then this idea of updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.127,
    "end": 1607.81,
    "text": " it's almost like we have a vertical updating, which we're gonna look at when we look at the deep parametric model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.371,
    "end": 1623.819,
    "text": "It's an updating within the agent, within the system, passing up and down, top down, bottom up, but it's an updating inside of the agent versus the updating laterally or across the ensemble of similar agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.999,
    "end": 1628.621,
    "text": "Like imagine if the people, instead of putting their weight estimate for the ox into a box,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1630.222,
    "end": 1631.363,
    "text": " they actually talked about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.463,
    "end": 1636.925,
    "text": "There's cases where you could imagine that would actually make a worse estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.325,
    "end": 1641.507,
    "text": "Like a really persuasive person is convinced they have high precision about their estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1642.228,
    "end": 1643.748,
    "text": "They're wrong, but they have high precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.389,
    "end": 1649.171,
    "text": "And then in that case, it's possible for them to shape group outcomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.666,
    "end": 1672.726,
    "text": " like a more stubborn peg whereas there's other cases where when maybe um it's less important to be precise on a point estimate but like to brainstorm maybe sharing ideas early on helps increase that temperature and updates people's models in a way where just having them in separate lanes and then coming together to converge at the end it's it's too late",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.246,
    "end": 1695.621,
    "text": " for those ideas to be meaningfully compared because they're of such different type whereas again if everybody is constrained to we're fitting something about weight only then maybe it's okay to combine them later on in the process blue so i was trying to pull the paper just now but i i think that they've looked at that actually like when you have really strong um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.656,
    "end": 1702.458,
    "text": " conviction about your beliefs or ideas, they look at how information is spread in networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1702.958,
    "end": 1712.1,
    "text": "And really like those people that are, you know, very strong in conviction, they like contaminate their like neighbors in the graph, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1712.52,
    "end": 1721.543,
    "text": "So it's really neat to kind of see this like information propagation, and how it really does start with the people with the strongest convictions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1723.675,
    "end": 1742.907,
    "text": " it's almost like uh yeah yes people are spreading information based upon a few things but up there on the list would be how precise they are about it and also how they want to be seen so both of those are like first and second level estimates of precision about oneself metacognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.587,
    "end": 1757.13,
    "text": " I won't raise my hand if I'm not totally sure, or I'm watching a live stream, but I'm not sure if this is a good question to ask, hint it is, but then you don't know, so you don't make the action, versus how will even other people perceive it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.243,
    "end": 1762.165,
    "text": " That was probably less important in an anonymous guess about weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.586,
    "end": 1767.949,
    "text": "But as we talk about issues that are increasingly social, those become the drivers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.589,
    "end": 1775.753,
    "text": "Maybe 90% of people in a room or in a country feel a certain way, but it still isn't perceived as something that's okay to share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.514,
    "end": 1776.754,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.864,
    "end": 1789.014,
    "text": " Yeah, this also ties into when a lot of context... There's actually a mediator, a chap who's a mediator, he had a really good quote that he actually came up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.054,
    "end": 1800.426,
    "text": "It was saying how process, both conscious and unconscious, implicit and explicit, has a greater impact on outcomes...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.562,
    "end": 1826.079,
    "text": " than substance i.e so if you're going to bring people together like we're saying and they're going to try and work together being able to the process through which people interact can have a bigger impact on the outcome than the substance partly because of exactly what blue was saying and you were saying you know around whether someone becomes a dominant voice whether certain information if it all becomes about the substance it's very easy to get trapped in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.88,
    "end": 1828.021,
    "text": " who's right, who's wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.562,
    "end": 1841.414,
    "text": "Well, if in this instance we're trying to get a different handle on things or to try and get an active influence, we need that process to be given a chance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.655,
    "end": 1845.718,
    "text": "So I think that's quite, and I actually also had a good conversation yesterday with a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.476,
    "end": 1860.089,
    "text": " Gary Kirkham actually does a lot of devised theatre work through sort of interesting processes where they mix different artists and one thing there is when they go into the action space of exploring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.181,
    "end": 1867.428,
    "text": " they would have the director watching or they have like a device theater playwright watching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.149,
    "end": 1872.273,
    "text": "And in some ways, the people who are in it, they just are totally immersed in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.333,
    "end": 1874.015,
    "text": "They can't really reflect on where they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.155,
    "end": 1875.957,
    "text": "At that moment, it's just in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.318,
    "end": 1878.64,
    "text": "And there's all this information and the people on the outside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.221,
    "end": 1887.487,
    "text": " are watching and you could say, I suppose they're actively inferring on what might be easier to say this Bayesian integration and waiting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.787,
    "end": 1891.45,
    "text": "And then afterwards they will be told what works, what didn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.95,
    "end": 1898.315,
    "text": "And then they could bring that to their conscious awareness and maybe bring that in a game with some, but that process is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.777,
    "end": 1909.126,
    "text": " in a way, needed to be just a living process and not too cognitive for the person to give good quality, fuzzy information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.907,
    "end": 1913.029,
    "text": "So two things there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.049,
    "end": 1916.132,
    "text": "The first is, what do we say about active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.252,
    "end": 1917.133,
    "text": "It's a process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.994,
    "end": 1922.999,
    "text": "It's a corollary of free energy principle, and it probably draws on many other domains as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.059,
    "end": 1923.159,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.689,
    "end": 1924.77,
    "text": " It's a process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.25,
    "end": 1927.452,
    "text": "It's not a state theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.532,
    "end": 1931.675,
    "text": "And in the Alias 2018 interview, Friston talks about process versus state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.735,
    "end": 1934.978,
    "text": "So that's a lot like this process versus substance you derived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.458,
    "end": 1939.542,
    "text": "These are a set of patterns for how systems update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.532,
    "end": 1962.882,
    "text": " and so it is about the process of active inferencing which i hear people using sometimes which even differentiates it even more from being just a static substance theory like it's a static theory about active entities it's like kind of but it's actually a dynamic theory about static and dynamic entities because you could have an active inference agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.502,
    "end": 1966.964,
    "text": " that is just a thermometer, so its affordances are nil.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.464,
    "end": 1971.366,
    "text": "So it can't act, but we can still put it within this Bayesian graph framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.807,
    "end": 1973.748,
    "text": "It doesn't need to be far from equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.808,
    "end": 1975.429,
    "text": "It doesn't need to be intelligent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.469,
    "end": 1977.99,
    "text": "It doesn't need to be actively forging for information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.51,
    "end": 1986.695,
    "text": "We know the model can go all those places, but it's almost like with a process theory, you can explain active and passive processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1987.355,
    "end": 1997.759,
    "text": " Whereas with a substance theory, you're able to explain static things pretty well, but then there's always this question about using the static theories to apply to dynamic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.7,
    "end": 2008.984,
    "text": "And then also to connect to the first piece of what you said and to return to maybe some of the threads in this paper, you talked about how that was a mediator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.645,
    "end": 2009.905,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.885,
    "end": 2033.427,
    "text": " mediation can look like so many things from diplomacy negotiation maybe even marketing like you raised earlier but mediator sounds a lot like meditation like the mediation is like we're we're not just going to make a call and then you're going to live with it it's like we're going to mediate now what are we mediating when we meditate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.608,
    "end": 2059.93,
    "text": " Are we mediating our thoughts and these kind of mindfulness cues that Lars was providing last week, like putting the distance between oneself and their thoughts, in a way it's like being a meta mediator or somehow mediating lower level cognitive processes through the process, not the substance that we call meditation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.451,
    "end": 2060.611,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.631,
    "end": 2067.794,
    "text": " So maybe like, what are we mediating in meditation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2067.834,
    "end": 2069.235,
    "text": "That's like a super interesting question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2069.255,
    "end": 2081.804,
    "text": "And I wonder if it's, you know, like the information transmission in the brain or maybe a propagation or like the ongoing, like wandering mental wandering maybe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2082.025,
    "end": 2088.93,
    "text": "So there's, you know, if we're, if essentially meditation cuts that information transmission,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2089.782,
    "end": 2092.743,
    "text": " So when you just are letting go, let go of the thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2093.023,
    "end": 2094.503,
    "text": "The thought arises, just let go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2094.883,
    "end": 2096.663,
    "text": "So the thought doesn't keep wandering around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2096.763,
    "end": 2098.544,
    "text": "And I wonder if a thought spreads.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2098.584,
    "end": 2099.064,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2099.084,
    "end": 2111.786,
    "text": "I mean, I know my background is neuroscience, but I don't know enough about, or maybe no one knows enough about the brain and functionality to know, does a thought propagate from one region of the brain to another region of the brain, stimulate a new thought?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2111.806,
    "end": 2114.906,
    "text": "And is that how mental wandering maybe works?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2114.987,
    "end": 2115.587,
    "text": "I mean, I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2115.627,
    "end": 2117.647,
    "text": "I mean, it's just hypothetical, but...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2118.027,
    "end": 2139.874,
    "text": " but maybe we're cutting that information transmission process off when we're mediating through meditation stephen yeah it's interesting i thought blue about trans it's actually funny because i was just watching this video on process orientated psychology and it was talking about moving between modalities you know like and it you know it could be you know i have a thought",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.172,
    "end": 2163.097,
    "text": " having seen something and then maybe it processes into how I hear it and how I see it and how I color it, you know, like it could be, you know, there's, it could be interesting how the different sensory modalities could, um, you know, could hold a thought for a period of time and then pass it back again because synesthesia obviously is an interesting one on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.597,
    "end": 2168.538,
    "text": "And I've just seen an interesting paper actually that, um, talks about how, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.602,
    "end": 2176.507,
    "text": " And the vowels, I-E-A-O-U, they mapped it out for colors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.027,
    "end": 2180.39,
    "text": "And they find that there's like a color map for how people see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.41,
    "end": 2182.371,
    "text": "And that maps across Swedish and English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.411,
    "end": 2183.692,
    "text": "I think it was Swedish and English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.353,
    "end": 2190.637,
    "text": "So that's interesting as well, that there could be, you know, these subconscious correlates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.258,
    "end": 2192.779,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.059,
    "end": 2193.199,
    "text": "Luke?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.52,
    "end": 2197.622,
    "text": " Yeah, so I mean, I really don't know that we know enough about a thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2197.662,
    "end": 2200.904,
    "text": "And this reminds me of our guest stream with Shanna Dobson.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2201.484,
    "end": 2204.346,
    "text": "What is the fundamental unit of a thought, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2204.746,
    "end": 2210.869,
    "text": "And so I know in a biological sense, the fundamental unit of a thought really kind of has to be the action potential.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2210.929,
    "end": 2213.471,
    "text": "But is it one action potential?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2213.571,
    "end": 2218.193,
    "text": "Is it some critical number of action potentials that instantiate the thought?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2218.253,
    "end": 2219.054,
    "text": "So I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2220.275,
    "end": 2222.356,
    "text": "And definitely, there is that propagation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2223.036,
    "end": 2228.201,
    "text": " or like a spreading some contagion maybe to like other brain regions in synesthesia.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2228.241,
    "end": 2233.026,
    "text": "I think that that's been pretty well established, like that there's like some crossed wires.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.086,
    "end": 2237.01,
    "text": "And so like you get auditory perception, for example, in the visual cortex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2237.15,
    "end": 2239.552,
    "text": "And so I know that there's that relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2239.572,
    "end": 2244.277,
    "text": "So that kind of does like lend itself to this idea of like the thought propagating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2244.657,
    "end": 2248.921,
    "text": " through different areas of the brain, but that's in a very incorrect sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2249.322,
    "end": 2252.365,
    "text": "I just wonder, even in normal people, does a thought, like what is a thought?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2252.505,
    "end": 2254.567,
    "text": "How many action potentials make up a thought?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2255.008,
    "end": 2260.073,
    "text": "And then does that, can that move around like within a region or to different regions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2260.173,
    "end": 2261.374,
    "text": "Is that actually what's happening?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2261.414,
    "end": 2265.098,
    "text": "I mean, I don't know that we can quantify that at all, but it's just, it's interesting to think about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2267.003,
    "end": 2283.886,
    "text": " not to always come back to aunt hillary the ant colony in geb but that's the analogy that hofstetter makes it says if ensembles of neurons are transiently activated even for the same word it's a different ensemble of neurons which is increasingly what molecular neuroscience is showing to be the case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.887,
    "end": 2290.451,
    "text": " And similarly with the ant colony, it's like the task group is assembling and disassembling and reorganizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.911,
    "end": 2305.561,
    "text": "The idea of a thought is still that noun-centric approach, which would lend us to want to find a static representation versus like a thinking unit or something that reminds us that it's a process, that thinking is a process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.622,
    "end": 2324.957,
    "text": " um so one comment and then a nice question in the chat about the mediator and the meditation so let's go to figure five which is again one of the main contributions of the paper so it's this three level nested structure and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.974,
    "end": 2340.005,
    "text": " the outputs of one level influence a lower or an interior nested model so on the bottom in blue is the perceptive states like what am i perceiving is it light or dark",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.598,
    "end": 2344.02,
    "text": " The second level is the attentional layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.44,
    "end": 2356.151,
    "text": "So contrast this with, for example, LSTM or other types of attention-based neural network architectures, which are not based upon first principles per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.851,
    "end": 2362.956,
    "text": "And then what this paper adds in is not just the affective components,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.797,
    "end": 2386.051,
    "text": " but actually this precision of how aware am i of where my attention is so then thinking about the mediation and meditation i thought well one mediation that might be happening in active inference is the mediation between epistemic and pragmatic goals so that's kind of like a seesaw and there's some sort of negotiation happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.992,
    "end": 2405.799,
    "text": " with free energy minimization that is balancing it's mediating these two goals when the two goals are perfectly aligned great then it's like we agree but when they don't perfectly align when the pragmatic goal just wants to run up the mountain and then the epistemic goal wants to ask",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.67,
    "end": 2411.433,
    "text": " Should we look around and see if there's another way that might be better in the long run?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.054,
    "end": 2413.094,
    "text": "Yeah, can we go around?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.194,
    "end": 2414.055,
    "text": "Exactly, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.495,
    "end": 2414.995,
    "text": "Solenoidal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.436,
    "end": 2417.057,
    "text": "Yep, the solenoidal flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.577,
    "end": 2420.159,
    "text": "And so there's sometimes a tension there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.419,
    "end": 2421.98,
    "text": "And so that's one type of mediation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.68,
    "end": 2434.268,
    "text": "But then using the mediator more like the higher level diplomat here, it's almost like the green layer is serving as a mediator of attention by saying,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.543,
    "end": 2436.875,
    "text": " calling awareness to it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.984,
    "end": 2440.085,
    "text": " And this is awareness of awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.125,
    "end": 2441.787,
    "text": "That's why it's metacognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.507,
    "end": 2449.672,
    "text": "But it's mediating the dynamics of the second layer, which end up cascading to influence the perceptive layer as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.352,
    "end": 2455.576,
    "text": "But in a sense, it is mediating the activity of the second layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.996,
    "end": 2461.94,
    "text": "And certainly this is the level that in the paper they're saying is where meditation rests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.56,
    "end": 2467.644,
    "text": "That's why when we just had active inference plus attention, we didn't have papers on meditation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.404,
    "end": 2477.991,
    "text": " But now that we have active inference plus metacognition, awareness of attention, we bring in this whole experiential dimension with meditation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.491,
    "end": 2478.752,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.353,
    "end": 2483.655,
    "text": "One question I might have here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.697,
    "end": 2489.119,
    "text": "At that bottom, you say, what am I perceiving?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.179,
    "end": 2490.7,
    "text": "So that's kind of fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.86,
    "end": 2497.345,
    "text": "There's that kind of what's, you know, I was just thinking about, and then what am I trying to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.922,
    "end": 2513.607,
    "text": " Now there's an interest rather than what am I trying to perceive, which is kind of interesting how they went for the, that, because I mean, I'm just thinking about, there could be that time, for instance, I'm perceiving someone's, I don't know, say I'm perceiving someone's got a bit of food in their teeth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.707,
    "end": 2514.067,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.967,
    "end": 2522.349,
    "text": "And what I'm trying to do is listen to what they're saying, but I'm seeing that bit of food and it's kind of hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.369,
    "end": 2524.53,
    "text": "Um, so then what am I paying attention to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.93,
    "end": 2527.871,
    "text": "But what am I trying to do is an interesting one, because in some ways, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.666,
    "end": 2533.067,
    "text": " You could say, what am I trying to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.087,
    "end": 2537.93,
    "text": "I think implicitly saying, what am I trying to do with my sensorial apparatus?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.07,
    "end": 2538.93,
    "text": "But it's a bit longer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.151,
    "end": 2545.373,
    "text": "Rather than what am I trying to do, which could be a higher policy level thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.854,
    "end": 2546.014,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.113,
    "end": 2572.042,
    "text": " great question i think one possible answer and this relates to potentially the slightly different way that active inference partitions problems than other domains is your preference would be that the other person doesn't have your preference at the first level would be to see no food in the teeth so there's two states in that preference vector um in the in the c vector which the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.742,
    "end": 2594.769,
    "text": " isn't going to be shown here but the preference would be to not see the food and then the policy of the first perceptive layer is ocular motor the policy is what can be controlled at that first level so you could avert your eyes as a policy that's one way of not getting the visual stimuli however",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.936,
    "end": 2620.499,
    "text": " can still hold it in your memory that it is likely to be that case so that's an example of like a hidden state which is the state of the food all you're going to get is photons corresponding to whether there might be food there or not and then you're doing hidden state inference now even though it's a visual so it's like why is it a hidden state if it's visual because it's actually your onboard state estimate of something that's out there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.34,
    "end": 2632.467,
    "text": " You're seeing it through visual mechanisms, but at the first level, the policy is for how you can move your eyes, not some other higher level policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.527,
    "end": 2632.947,
    "text": "Yeah, Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.027,
    "end": 2636.709,
    "text": "Yeah, that's quite a good way of thinking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.729,
    "end": 2637.77,
    "text": "And I think it also shows...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.897,
    "end": 2654.86,
    "text": " like how it is probably more easily tractable when you say you have the visual, you have something fairly clearly on the visual or a particular sensory modality, then you could see how the attention shifts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.38,
    "end": 2664.122,
    "text": "Now, obviously, in much of our life, but maybe not so much in meditation because we are able to attune to certain sensory patterns",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.484,
    "end": 2678.584,
    "text": " roots more clearly but in daily life it's all mashed together so much that it probably is part of the reason why it becomes imperceivable because you know your body might be in the mode of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.841,
    "end": 2681.302,
    "text": " the bigger goal, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.382,
    "end": 2692.809,
    "text": "getting to work on time, and then your visual thing in that real time is trying to listen to the conversation with the ticket collector who's got a bit of food in their mouth, in their tooth or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.409,
    "end": 2702.094,
    "text": "And it would all become hard to make this tractable, because this isn't necessarily set up to think about multi-sensory integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.134,
    "end": 2705.276,
    "text": "Not that it can't, but that would start to distort this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.336,
    "end": 2708.618,
    "text": "It's probably easier to think about this where there's a fairly clear...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.727,
    "end": 2727.152,
    "text": " modality at play another thing to know is we don't necessarily talk about goals in the active inference ontology we have preferences which are over sensory outcomes and policies which are action capacities action sequences that we're choosing so goals are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2728.117,
    "end": 2733.819,
    "text": " they're a word and people know what we're talking about, but in this model, there is no goal for anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.059,
    "end": 2735.599,
    "text": "They're just preferences and policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.239,
    "end": 2743.641,
    "text": "So I want to read this question, which is going to be interleaved with a definition, and then it will be an interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.282,
    "end": 2745.082,
    "text": "So Liberty wrote,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.545,
    "end": 2748.366,
    "text": " still reading through the paper, aren't we all?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.107,
    "end": 2753.69,
    "text": "Which seems deeply complimentary to Metzinger's account of M-autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.991,
    "end": 2758.574,
    "text": "So I just want to read a definition of M-autonomy since it wasn't a term I was very familiar with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.734,
    "end": 2765.96,
    "text": "And this is a paragraph written by Christoph DeLega, who is also in the Active Inference community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.02,
    "end": 2770.403,
    "text": "So kind of thanks for going out in front and helping us be clear about our definitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.923,
    "end": 2772.845,
    "text": "And so what Christoph wrote was,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.506,
    "end": 2781.58,
    "text": " In his recent article, Metzinger argues for a new construal of mental autonomy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.463,
    "end": 2807.141,
    "text": " the m as a functional property which consists in the deployment of a special kind of model one which represents the self as an epistemic agent this epistemic self model is and then here's the quote from metzinger a global model of the cognitive system as an entity that actively constructs sustains and controls knowledge relations to the world and itself metzinger 2015 page 272. so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.274,
    "end": 2812.874,
    "text": " Good call, Liberty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.235,
    "end": 2819.756,
    "text": "Definitely we're hearing words like epistemic and self-modeling and active states that seem to bring us close to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.196,
    "end": 2830.639,
    "text": "And so their question was, how do processes such as intentional inhibition inform a formal account of cognitive control in your opinion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.888,
    "end": 2842.191,
    "text": " So we can look at five while this is up and people are thinking, or just let me know which slide to go to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.291,
    "end": 2844.532,
    "text": "So Stephen first, or Blue, you want to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.672,
    "end": 2846.593,
    "text": "Can you just reread the question one more time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2847.394,
    "end": 2853.417,
    "text": "How do processes such as intentional inhibition inform a formal account of cognitive control in your opinion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.118,
    "end": 2858.239,
    "text": "So Stephen, and then anyone else who wants to go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.868,
    "end": 2875.393,
    "text": " So intentional inhibition or unintentional uninhibited behaviour or inhibited behaviour, I suppose you could have it in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.054,
    "end": 2887.658,
    "text": "I think for me what's interesting with this, when you start getting into how we relate and how we fit into our social...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.387,
    "end": 2905.428,
    "text": " landscape so to speak with that type of thing is when we because inhibition tends to be something you're thinking about in a social context within reason it's like that thing about dancers if you're on your own",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.43,
    "end": 2925.223,
    "text": " I feel that is a really good case for where there'd be an interlocking model such as the type of work used in mental space psychology to mediate this Metzinger knowledge structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.984,
    "end": 2939.712,
    "text": " Because that then gives you a kind of an embodied inactive framework, which the brain can actually use as its kind of meta model in peripersonal space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.133,
    "end": 2953.42,
    "text": "So I think that this is a quite a good point here is at what point do we need to have a mediating embodied sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.067,
    "end": 2983.084,
    "text": " metaphor or structuring to help some of this pass out into the complex domains of a social setting thanks steven dean yeah i just think it's interesting that if you if you think about inhibition and you think what the effects of that are you can actually control the situation if you don't talk because we all hate a void or a vacuum",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.212,
    "end": 2992.715,
    "text": " And so by not expressing, sometimes you pull other people's expression into more than you maybe even anticipate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2992.835,
    "end": 3010.12,
    "text": "And so I actually have found people who are less extroverted, a little bit more introverted, tend to have a lot more power in these kind of co-variational situations that maybe they believe they possess",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3011.636,
    "end": 3021.062,
    "text": " I know that people that are extroverted think that they're controlling the conversation, but just stare blankly back at somebody and really pay attention and listen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.003,
    "end": 3027.186,
    "text": "And you'd be amazed at how much control you actually possess in that relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3029.368,
    "end": 3030.729,
    "text": "I have a thought on that, but blue first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.483,
    "end": 3033.543,
    "text": " Go ahead, mine's unrelated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3034.184,
    "end": 3043.448,
    "text": "It just reminded me of the sort of street hustle dynamic, which is on one hand, that person must be superficially extroverted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.548,
    "end": 3045.409,
    "text": "I mean, they're coming up and speaking to a stranger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.569,
    "end": 3053.933,
    "text": "If it's about a chess game or they're selling something or they want you to go to that club in Las Vegas, that is a very extroverted social activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.713,
    "end": 3071.061,
    "text": " But the art and the science of that street game is actually about what Dean just wrote or said, I guess, like the introversion that brings the other person and elicits them to feel like they should put out their personal information into a void.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.562,
    "end": 3081.447,
    "text": "But if someone's just like chat, chat, chat, chat, chat, there's no space for them to become vulnerable, to feel like they're part of the conversation and ultimately to reveal personal information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.409,
    "end": 3088.011,
    "text": " So it shows that, of course, we're using the introvert and extrovert little loosely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.331,
    "end": 3092.272,
    "text": "People say, oh, it means they draw their rejuvenating energy from being alone or in public.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.292,
    "end": 3099.434,
    "text": "Like there's different definitions, but it just shows that actually it's not just about saying something or being the first to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.955,
    "end": 3110.778,
    "text": "That can also be a superficial mode of control and that there's a deeper mode of control that actually has to do with picking and choosing your words as well as when to use them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.093,
    "end": 3112.954,
    "text": " Blue, anything on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.775,
    "end": 3119.578,
    "text": "So unrelated, but just going back to inhibition, Stephen, do you have something directly related?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3119.598,
    "end": 3126.123,
    "text": "Well, one little thing, just as a comment, is one thing I remember...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.597,
    "end": 3143.988,
    "text": " When they had the press inquiry in London about the Levenson inquiry and Rupert Maxwell had to give evidence about his newspaper empire, one thing that was really noticeable, and they were saying this because he was like, you know, he's a very, obviously he's a high level executive, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.488,
    "end": 3146.249,
    "text": "He always took his time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.65,
    "end": 3156.797,
    "text": "Like when he was asked a question, it was almost like he was always used to having the time to think through his answer, say what he needs to do and be able to reply at his own leisure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.677,
    "end": 3180.861,
    "text": " in a way that other people might not and that that also speaks to that power of when someone who's presumably quite dominant and being able to be forceful also can they know they can hold the space and there's probably some element of knowing how much power you have to be able to get away with that and no one else steps in so that's quite interesting anyway thanks blue then dean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.943,
    "end": 3182.463,
    "text": " Go ahead, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3182.543,
    "end": 3183.684,
    "text": "You've got some retort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3183.744,
    "end": 3186.004,
    "text": "So I'm going to go back to inhibition when you guys are done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3186.485,
    "end": 3199.449,
    "text": "Yeah, no, I think it's just really interesting because I've read some stuff about if you're an FBI interrogator, one of the tactics that's actually trained into FBI interrogators is to be intentionally inhibited.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3203.391,
    "end": 3203.951,
    "text": "Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.031,
    "end": 3207.612,
    "text": "So there's intentional in the social intentionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.612,
    "end": 3209.613,
    "text": "And then I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.643,
    "end": 3223.491,
    "text": " Could be otherwise, but it seems like Metzinger's account and Liberty's question is about the intentional inhibition within the agent as a mechanism of cognitive control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.911,
    "end": 3227.093,
    "text": "But it brings us right back to this idea of the vertical nesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.853,
    "end": 3233.297,
    "text": "And then in that situation, intentional control is kind of cascading from the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.38,
    "end": 3242.163,
    "text": " But then also there's intentionality laterally, like I am intending to control somebody else's cognitive state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.984,
    "end": 3255.809,
    "text": "And so that's actually one reason why it's important to have a model that's kind of like Legos in two dimensions, because these active inference models, they plug in really well nesting internally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.676,
    "end": 3279.763,
    "text": " So we can talk about top-down cognitive control and maybe have intentional inhibition as a phenomena within a broader science of mental action, which we can get to in 12, but also we can just as fluidly use some of the same variables and some of the same code, some of the same formalisms for the kinds of intentional control that happen laterally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.363,
    "end": 3284.945,
    "text": "So it's like when somebody is taking a deliberate pause or somebody asks a really hard question and then they go,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.637,
    "end": 3305.356,
    "text": " and they take their time with the response, that's an intentional cognitive control, which has traditionally been the realm of the sort of psychology perhaps, but then that can be understood to be deployed in a cultural context by which it's being used to intentionally control others' states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.997,
    "end": 3309.04,
    "text": "And so we can have a bunch of different agents, each consisting of nested",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.918,
    "end": 3332.174,
    "text": " models like this and we can stack them up vertically as well as have interactions laterally because intentionality is deployed in both of those directions stephen yeah and following on to what you're saying this this then starts to there's a big gap in basically between psychology and sociology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.444,
    "end": 3339.405,
    "text": " which is this idea, or I suppose you could, in many cases, teams is one area where it gets looked at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.425,
    "end": 3347.887,
    "text": "It's great, you can take an average, and you can take your statistical averages, you get your sociology, in many cases, and you get your individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.987,
    "end": 3360.27,
    "text": "But part of the reason that we end up there is not because they're the most useful places to be, it's because you can measure them, you can get units of analysis which you can do stuff with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.115,
    "end": 3367.26,
    "text": " And the intersubjective stuff around four or five people is a huge challenge, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.3,
    "end": 3373.265,
    "text": "Because you can't ignore the complexities of the individual, yet you've got the complexities of the group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.626,
    "end": 3381.211,
    "text": "And so it speaks to that, you know, that ability to now start to get in and say, okay, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.012,
    "end": 3399.711,
    "text": " let's say we can tease out some generative models or not even generative models, I don't believe, but to be able to tease things out in a way which maybe can make meaning in group context and this participatory sense-making, that's really what is moving things forward, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.822,
    "end": 3404.544,
    "text": " it almost makes me think of someone who can facilitate a group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.904,
    "end": 3417.91,
    "text": "And it's like, I know you intended to just share what you're excited about, but you're unintentionally exerting cognitive control on other people by bringing up this topic or by speaking in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.97,
    "end": 3429.015,
    "text": "So it helps us look at that vertical intentionality and the lateral social intentionality together, maybe even not just with the same model, but on a common footing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.975,
    "end": 3433.921,
    "text": " of precision, precision within the individual and precision of the team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.502,
    "end": 3440.189,
    "text": "So it's like these are the real nuts and bolts of where integrative models matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.75,
    "end": 3446.358,
    "text": "If we had a totally disjoint model for what was happening inside of a head and then across",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.369,
    "end": 3454.932,
    "text": " bodies and brains, we wouldn't have the market to sort of flip back and forth between those currencies per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.952,
    "end": 3456.993,
    "text": "We would need another third level connector theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.674,
    "end": 3462.636,
    "text": "So it's like if you have one theory in theory B, you need to invent theory C in the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.176,
    "end": 3468.159,
    "text": "But if you have just one integrative theory, then it's just a question of how it all works together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.459,
    "end": 3468.699,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.079,
    "end": 3471.7,
    "text": "Yeah, just one last quick comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.74,
    "end": 3473.121,
    "text": "I think it's really interesting that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.619,
    "end": 3483.967,
    "text": " that an inhibition can be seen as a tactical stance and a reveal on those Markov blanket hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3484.728,
    "end": 3493.295,
    "text": "I mean, I'm not sure it's a cipher, because you don't actually know what the other person, if they're going to sort of be drawn into something that they otherwise wouldn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3493.836,
    "end": 3500.542,
    "text": "But I just think it's really interesting that we assume that we have to keep the conversation going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3501.704,
    "end": 3506.466,
    "text": " And we don't assume that maybe one of the ways to do that is to not say very much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3508.867,
    "end": 3525.293,
    "text": "And to give one neurological comment on that, perhaps back in the day, people thought with the higher orders of the brain, the higher thinking processes being the generative and the creative processes, since those are the human specific ones and we're generative and creative and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.793,
    "end": 3530.315,
    "text": "But when you look down to the synapse level, the frontal cortices are actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.394,
    "end": 3532.575,
    "text": " using inhibitory control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3533.615,
    "end": 3542.68,
    "text": "So it's this model where it's like we can actually be creative and we can be generative through the appropriate inhibition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.14,
    "end": 3550.064,
    "text": "We don't need to have this passive midbrain that gets zolted into activity by a really smart forebrain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.644,
    "end": 3554.186,
    "text": "Rather, we can actually have the endogenous wisdom and activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.77,
    "end": 3561.003,
    "text": " that never seizes with targeted inhibition coming from some other parts of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.724,
    "end": 3565.492,
    "text": "I'm sure that was a simplification, Blue, so I know you can say more on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.716,
    "end": 3572.561,
    "text": " So that totally leads into exactly what I was wanting to say earlier about inhibition and cognitive control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3572.921,
    "end": 3581.468,
    "text": "So if we were in this overly neurologically, like neuron to neuron excited state, I mean, that's a seizure, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3581.488,
    "end": 3585.712,
    "text": "So when you've got overexcitation in the brain, it's not always good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3586.213,
    "end": 3591.217,
    "text": "But so, I mean, to what intent, like to what extent does inhibition,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3591.63,
    "end": 3593.611,
    "text": " intentional inhibition, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3593.631,
    "end": 3594.712,
    "text": "This is going back to the question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3594.732,
    "end": 3596.253,
    "text": "That's what they said, intentional inhibition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3596.933,
    "end": 3605.558,
    "text": "So when you have intentional inhibition, I wonder, and this goes back to what I was saying about meditation, like shutting off the fundamental unit of a thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3605.658,
    "end": 3613.603,
    "text": "So I wonder if intentional inhibition, when you refrain from blurting something out or when you practice restraint or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3614.102,
    "end": 3616.264,
    "text": " or refrain from letting your thoughts wander.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3616.304,
    "end": 3631.455,
    "text": "So when you inhibit yourself, this intentional inhibition, I don't know, but it's curious to think about, does this correspond to, there's activity in the brain, excitatory makes more action potentials happen, and inhibitory makes fewer action potentials happen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3631.896,
    "end": 3637.84,
    "text": "So when I do this kind of intentional inhibition, does that inhibit my neurons in a corresponding way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3637.96,
    "end": 3639.682,
    "text": "I'm curious, I mean, I would guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3640.262,
    "end": 3646.946,
    "text": " Because it just, you know, I mean, at least in the meditative sense, I would think inhibition of an action potential propagating forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3647.786,
    "end": 3656.171,
    "text": "So it's a curious thing to to wonder about to what extent is intentional inhibition exert cognitive control at the molecular level?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3657.711,
    "end": 3658.172,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3658.652,
    "end": 3658.932,
    "text": "Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3662.174,
    "end": 3666.596,
    "text": "Yeah, that's actually got me thinking now on something that's quite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.633,
    "end": 3670.94,
    "text": " That.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.543,
    "end": 3700.442,
    "text": " that question about the higher level lower level i think and this this is a really interesting piece oh actually and it ties back to what i was thinking of asking as well about figure five where you put subliminal um processes and maybe conscious processes and i think that's an interesting point on figure five that you've there because maybe it's the middle bit that's more conscious at certain times and the top bit is actually never quite aware of you're only able to effectively feel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.471,
    "end": 3706.433,
    "text": " And so there might be that it's actually the middle layer there on figure five that's conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.754,
    "end": 3717.297,
    "text": "And I like what, that's actually really interesting if it's inhibitory because there's an interesting model I've been trying to work with called Dilt's Logical Levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.357,
    "end": 3722.201,
    "text": " And you've got the kind of the identity level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.602,
    "end": 3731.956,
    "text": "So if I map this onto this, the identity level or the face could be seen as what broadcasts where we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.015,
    "end": 3738.917,
    "text": " And some of that we're conscious of, and some of that we're not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.418,
    "end": 3741.759,
    "text": "And then we've got where our awareness is in the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.799,
    "end": 3752.583,
    "text": "And then we talked about this kind of lower level, which you can only, you're sort of aware of, but it's, again, it's slightly outside of that crystal clear question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.603,
    "end": 3753.944,
    "text": "So I wonder, on figure five,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.804,
    "end": 3758.065,
    "text": " And maybe this is a question for Daniel, because he might be put that I don't know if you put those on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.965,
    "end": 3762.027,
    "text": "You know, where you put we've got subliminal and awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.967,
    "end": 3764.968,
    "text": "And how is this interface mediated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.988,
    "end": 3771.69,
    "text": "And I'm kind of wondering what I'm paying attention to maybe what is actually awareness in a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.945,
    "end": 3776.368,
    "text": " like sort of, I could tell you sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3776.968,
    "end": 3781.614,
    "text": "And the top one is an awareness in a kind of a, a felt almost like a metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.134,
    "end": 3789.863,
    "text": "It feels like this to try and have that meta awareness, but you can never quite get a handle on it, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.584,
    "end": 3807.88,
    "text": " great point and totally open to anyone's uh insights or the authors or otherwise but this first level is again about sensory perception so it is possible that the second level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.741,
    "end": 3836.062,
    "text": " is the reportable opaque state that's one of the innovations of this paper and there would have to be another level to make this state at the very top reportable so it it might be the case that this green topmost layer is the felt awareness of where one's attention is as well as their preferences for where their attention should be which might be scaffold by meditation saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.054,
    "end": 3842.301,
    "text": " it's awesome to focus on this mandala, or it's awesome to focus on compassion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.682,
    "end": 3849.471,
    "text": "So these are shaping preferences over policies for how aware one should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.711,
    "end": 3851.113,
    "text": "It's great to be paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.082,
    "end": 3859.526,
    "text": " And then the what is one paying attention to is where those policies are influencing, yeah, where the attention is being paid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.946,
    "end": 3870.211,
    "text": "But when somebody says like, you know, there was a car crash and I couldn't look away, it's almost like, well, the first layer is that they were perceiving cars on the road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3871.052,
    "end": 3876.895,
    "text": "The attention they're reporting is that they were paying attention to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.075,
    "end": 3898.489,
    "text": " then there's this implicit third state that they were aware of where their attention was otherwise they wouldn't have been able to report i couldn't have looked away so they were extremely aware of where their awareness was that's what metacognition brings in that simply attention doesn't and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.727,
    "end": 3907.621,
    "text": " again another argument for first principles theories that work really well in this sort of composable way because there are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.737,
    "end": 3911.179,
    "text": " neural network models with so-called attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.82,
    "end": 3913.621,
    "text": "But where would you put metacognition in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.122,
    "end": 3922.769,
    "text": "There might be a variety of ways to do that, and maybe some would be practical and some wouldn't, and maybe some would be implementable with the tools you already have, maybe others wouldn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.19,
    "end": 3932.298,
    "text": "But here, when we can just look at the skeleton of the model, we can come to some pretty interesting places just by working with what's composable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3933.362,
    "end": 3953.586,
    "text": " rather than just sort of trying to make it um fit well first and then make it composable and understandable second we're beginning with composability and comprehensibility and then the question about how it will fit empirical data well it's an empirical question stephen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.016,
    "end": 3975.676,
    "text": " this is interesting you can bring in empirical data you've got that advantage of potentially say the subliminal layer it may not be self-reports it could be that you could use other measures you know brain scanning and other things to give a sense of when you know what is coming in there and of course as they mentioned because attention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.53,
    "end": 3980.811,
    "text": " And again, this is where we get caught in our own need to make sure the literature can hold together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.831,
    "end": 3986.232,
    "text": "You know, attention, as was mentioned by Lars, is kind of relatively uncontroversial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.252,
    "end": 3986.952,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.472,
    "end": 3995.434,
    "text": "But of course, you get we know from phenomenal, you know, you you sort of can't help at some level get into the idea of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.534,
    "end": 3995.754,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.234,
    "end": 4001.235,
    "text": "Because conscious awareness of attention is that kind of interesting thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.795,
    "end": 4022.19,
    "text": " thing so when it goes to what am i paying attention to what am i conscious of and then you get into phenomenological phenomenological consciousness or access consciousness coming into play um and it gets a bit fuzzier so um but i think at some level you you you you're gonna start to hit those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.412,
    "end": 4029.416,
    "text": " in between those two, you're sort of hitting that kind of fuzziness of where that sort of goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.476,
    "end": 4043.326,
    "text": "And then the next level up again probably is more, maybe it's actually more clear from the next level up when you go from attention to meta-awareness of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.366,
    "end": 4050.092,
    "text": "But I think the bit that might be a whole shift in ontology even could be that shift from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.257,
    "end": 4056.699,
    "text": " how you're perceiving and how that translates into an attentional state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.84,
    "end": 4058.02,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.58,
    "end": 4068.084,
    "text": "So to kind of bring it to multilevel and multisensory integration, the perception can be of two different kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.445,
    "end": 4075.668,
    "text": "Like what gets passed to the agent at each time point might be a visual measurement and a temperature or appropriate reception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.408,
    "end": 4080.07,
    "text": "And then the policy, what am I paying attention to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.03,
    "end": 4087.674,
    "text": " could be reflected by paying attention to, for example, visual input as opposed to some other type of input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.454,
    "end": 4095.438,
    "text": "And then one could be aware or not of whether they're paying attention to the smell or to the sound or to the light.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.579,
    "end": 4103.563,
    "text": "So how these models get integrated with then non-first personal measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4104.404,
    "end": 4109.827,
    "text": "That's kind of what we explored in this future of phenomenology slide with like, okay, where do we bring in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.283,
    "end": 4139.967,
    "text": " empirical measurements and we kind of align them on the same time series and we can bring in any kind of measurement we don't even need to um limit ourself anything that's measured through time of any uncertainty over that measurement we can kind of cobble it together into this model what are we doing it for what do we want to know with those measurements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.496,
    "end": 4143.857,
    "text": " probably a lot of things that we could address there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4145.498,
    "end": 4158.624,
    "text": "Maybe for the 45 minutes, let's at least go to 12, figure 12, and talk a little bit about just annotating or exploring this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.344,
    "end": 4167.508,
    "text": "So in five, again, main contribution of the paper, one of them was the explicit three-level model with um.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.956,
    "end": 4173.119,
    "text": " what is being perceived, what is attention being paid to, and how aware is one of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.799,
    "end": 4184.606,
    "text": "Here, we're dropping back to two layers with the understanding that we could add another level like a green layer on top of the orange one that then connects back down to the orange one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.308,
    "end": 4190.27,
    "text": "But look at some of these new parameters that are introduced in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.931,
    "end": 4197.115,
    "text": "Namely, all of these gamma subscripts, so gamma are the uncertainty variables,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.996,
    "end": 4210.364,
    "text": " Now there's a gamma with a subscript modulating a lot of the other parameters that previously have been presented just as kind of standing alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.025,
    "end": 4215.168,
    "text": "So like for example, in figure five,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.314,
    "end": 4219.616,
    "text": " you just have like preferences in the second level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.856,
    "end": 4223.118,
    "text": "The preferences just exist and the affordances, E, they just exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.819,
    "end": 4244.151,
    "text": "Now in 12, we're thinking about, well, what does it look like to have an uncertainty or a precision being the inverses of each other over D, the prior, C, the preferences, G, the free energy minimization, E, the affordances,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.779,
    "end": 4263.026,
    "text": " pi is the policy and then we have an uncertainty over b which is the matrix that defines the transition between hidden states so like given that i'm inferring it to be raining outside what is the transition probabilities of it staying rainy versus becoming",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.891,
    "end": 4271.573,
    "text": " not raining, and then we also have A, which is the matrix mapping between hidden states and observed states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.393,
    "end": 4276.655,
    "text": "What's the relationship between the observation of photons and whether it's sunny or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.275,
    "end": 4279.715,
    "text": "Is it a simple matrix, just a clean mapping?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.815,
    "end": 4292.399,
    "text": "You can just sort of simply have 100% of the time map it, or is it the case that you're very uncertain about how hidden states are connected to observable outcomes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.752,
    "end": 4314.436,
    "text": " So those are just to sort of recap what these parameters in a model mean, but maybe if anybody wants to like highlight one of these precision variables, just what's one that they're drawn to, or they're curious about, or what's one that might have applications in different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.396,
    "end": 4319.557,
    "text": "Daniel, I would speak to it, but I,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4320.748,
    "end": 4327.854,
    "text": " in order for me to sort of explain it in a way that I think would make sense, might mean I would have to speak for a while and hijack this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4327.894,
    "end": 4330.517,
    "text": "Would people be comfortable with me talking for a couple of minutes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4331.598,
    "end": 4331.898,
    "text": "Please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.999,
    "end": 4333.279,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4335.301,
    "end": 4344.449,
    "text": "So, I kind of look at this from the perspective of when in doubt, zoom in, zoom out in order to compute something, and this is a computational",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4347.313,
    "end": 4357.816,
    "text": " I kind of take a whole cloth or a whole Markov blanket approach of precise or precision as the paper kind of does a good job of laying out as precise, i.e.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4357.876,
    "end": 4358.576,
    "text": "figure 12.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4360.037,
    "end": 4368.139,
    "text": "So on the topic of meta-awareness, meaning and collective decision-making between the greatest and the smallest distances that we can be aware of, we have information geography.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4369.179,
    "end": 4373.06,
    "text": "If you're searching for meaning and edge precision, things like contrast and proportion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4374.227,
    "end": 4396.321,
    "text": " a fitting process i often think of like the 16th century maps of north america when the explorers first hit the coastlines and then there's information geometry when you're putting a dimensional space together so that's fixing the topology as a precise representation of difference over distances i've already shared in the 21 or 28-1",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4399.005,
    "end": 4417.655,
    "text": " But I've got this generative model, I call it the unholy triad, which is in essence a computational phenomenology context generator that translates prediction error reduction, meaning we try to give people the sense of prediction management expertise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4419.336,
    "end": 4423.298,
    "text": "I want them to be able to turn that ability to predict into a contribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4424.219,
    "end": 4427.721,
    "text": "For me, it was trying to create a professional contribution for high school kids.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4429.104,
    "end": 4430.325,
    "text": " So what does that mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4430.345,
    "end": 4437.409,
    "text": "It means getting to the geo, the geometric and the geographic essences of a situation that you've never been in before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4437.489,
    "end": 4439.07,
    "text": "So it's a pretty big Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4440.11,
    "end": 4444.413,
    "text": "Inactively, it means generalized and transfer regardless of that degree of novelty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.413,
    "end": 4453.498,
    "text": "It means understanding learner availability to phenomena as much as collecting data on learner attention, which is what this paper is kind of focused in on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.158,
    "end": 4457.06,
    "text": "It's not about studying the swallow and regurgitating information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4457.907,
    "end": 4475.725,
    "text": " as a content cycle, which is a standardized form of learning measure, which is also an irony because I had to take these models here and give them to 16 to 18 year olds by using things like when in doubt, zoom in, zoom out, because I could present them with this, but this would be Sanskrit to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4475.745,
    "end": 4476.767,
    "text": "They wouldn't understand it at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4478.208,
    "end": 4486.861,
    "text": " So then what is a precise proposition as creative professional contribution in the to be materialized or propositional sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4487.142,
    "end": 4487.923,
    "text": "And in the paper,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4488.789,
    "end": 4490.609,
    "text": " I think I talked about this in 28.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4490.649,
    "end": 4494.43,
    "text": "There was a passage in the paper that talked about, and I'll just read it out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4494.95,
    "end": 4504.333,
    "text": "It says, in computational terms, the central place of confidence and reliability and effective self-regulation speaks to the key role of precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4505.013,
    "end": 4508.174,
    "text": "And then they say that's the inverse variance of implicit beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4508.994,
    "end": 4513.935,
    "text": "And then they talk about, as an example, probabilistic or posterior Bayesian beliefs,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4514.773,
    "end": 4518.234,
    "text": " that describe a probability distribution over some latent quantity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4518.874,
    "end": 4525.717,
    "text": "And I talked last week about going across the street, so there's a calculable risk in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4526.937,
    "end": 4531.038,
    "text": "And then back to the paper, it says these beliefs are sub-personal, meaning that they're unplannable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4531.259,
    "end": 4538.261,
    "text": "However, the argument pursued in this work is that Bayesian beliefs about Bayesian beliefs can, in certain situations,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4539.124,
    "end": 4543.51,
    "text": " become propositional in the way that those things are estimated, optimized, and controlled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4543.97,
    "end": 4546.213,
    "text": "That's referring to Hesp's, Casper's work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.074,
    "end": 4553.062,
    "text": "Precisions in a nutshell quantify our confidence in our beliefs, say how confident we are about what we know about states,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4554.016,
    "end": 4558.578,
    "text": " of the world about their relation to our sensory observations or about how these states change over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4558.598,
    "end": 4569.202,
    "text": "By analogy, with physical action, a mental or covert action consists in deploying and adjusting these quantities without there necessarily being an explicit behavioral counterpart to these covert actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4570.462,
    "end": 4571.023,
    "text": "So for me,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4572.065,
    "end": 4588.012,
    "text": " If we're computing a transformation of unplannable to metacognitive from perception of, I'm aware of planning to make a plan because I can think about my thinking, so what if this policy of attention, then what I attend to tells me when I'm losing focus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4588.613,
    "end": 4591.354,
    "text": "That's what the paper said and I agree, check.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4591.894,
    "end": 4593.295,
    "text": "That's one way of measuring that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4594.115,
    "end": 4600.078,
    "text": "And in the crosswalk case study, you have two propositions, both are precise in terms of their,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4601.118,
    "end": 4603.359,
    "text": " They're disambiguated paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4604.179,
    "end": 4608.621,
    "text": "And both are examples of a nesting study, in this case, crossing a nest or a roadway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4609.681,
    "end": 4614.963,
    "text": "And then what happens regardless of the awareness level inside or outside of the physical and the hypothetical lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.383,
    "end": 4620.125,
    "text": "This is what I would be asking people that were gonna go into these novel situations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4620.705,
    "end": 4624.567,
    "text": "If we don't select right away, if we keep things open,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4625.635,
    "end": 4642.768,
    "text": " if we keep probability distributed across a propositional horizon of potential street crossings, is precision lost as an openness, as a distribution collection versus a focal point attenuation, which is I think what this paper was examining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4643.648,
    "end": 4647.311,
    "text": "Perhaps a way of probing this might be to say that the concept of scale is fluid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4648.49,
    "end": 4655.756,
    "text": " that it's the potential for scale change, that scale itself overtakes or retreats from as a directional inflation or deflation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4656.477,
    "end": 4659.819,
    "text": "And sometimes we talk about that as a directional gradient descent or descent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.14,
    "end": 4666.625,
    "text": "In this sense, scale either obliterates or gap increases, which Scott talked about having an epoxy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4667.886,
    "end": 4668.707,
    "text": "And I agree with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.627,
    "end": 4676.273,
    "text": "That what we consider to be inside or outside the lines is not static due to our relationship, our betweenness to the focal point of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.401,
    "end": 4681.923,
    "text": " This is a somewhat conventional explanation of scalable behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4682.263,
    "end": 4687.386,
    "text": "But I think there's a second part to this we have to keep with that first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4687.826,
    "end": 4706.215,
    "text": "And that second sense, which together with the first part, generates another type of between, which is a matter of the geography in, as in edge precision, and geometry out, as in of difference over, at once, at the exact same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4707.162,
    "end": 4712.566,
    "text": " that supports the very notion of and as scale, scaling down or scaling up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4713.727,
    "end": 4716.469,
    "text": "So that's that up and down part we were talking about earlier today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4716.95,
    "end": 4722.654,
    "text": "In my experience, it's very much the addition of this second sense as a parallel probing that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4723.034,
    "end": 4728.479,
    "text": "There's no violations in bringing in the statistical and the physical mechanics together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4729.141,
    "end": 4738.012,
    "text": " that active inference parameterizes as an HOV or high occupancy vehicle, lane as a metaphor more than intersectional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4738.632,
    "end": 4744.279,
    "text": "Intersectional is pretty much interventionist and it's kind of an instructionalist only reinforcing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4745.447,
    "end": 4765.89,
    "text": " view or perspective in the in the hov lane metaphor you are in as self-organizing you're non-interventionist because you're a constructor you're an interactor of lines live stream lines and i use the example of a 28 0 or a 28 1 in the way that we set the live streams up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4766.758,
    "end": 4781.705,
    "text": " If you're outside the HOV lines, maybe you're rewatching something that you were a participant in, or perhaps you're using the 0.2 part of this as a way of sort of detaching yourself and being able to appreciate scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4782.725,
    "end": 4787.568,
    "text": "So math is not the territory, but the math is both the diamond shape on and above",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4788.444,
    "end": 4794.487,
    "text": " the parameterized state space, that road that we now say is high occupancy vehicle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4795.348,
    "end": 4804.293,
    "text": "It shows the signals, meaning the geometrics and the restricted fit, the geographics that a two plus in the car mathematical quantity enables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4805.214,
    "end": 4810.236,
    "text": "Again, you have opaque passengers and transparent traffic congestion reduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4810.437,
    "end": 4810.737,
    "text": "Check.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4811.377,
    "end": 4812.818,
    "text": "That's what this paper talked about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.008,
    "end": 4826.892,
    "text": " But I think we also have to consider that the contrast, meaning that the texts in the background are different colors, and the proportion, meaning the depth of field is adjustable, is necessary to dial in the resolution and the resonation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.992,
    "end": 4832.794,
    "text": "Daniel, you spoke about resolution and resonation, mostly about the resolution in the point one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4832.834,
    "end": 4835.095,
    "text": "And so I wanted to really come back to that a bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4836.496,
    "end": 4838.057,
    "text": " This is collective phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.217,
    "end": 4852.85,
    "text": "This is not, I am attending or I realize that I'm not attending, but I think it's a big part of this attenuation versus collective thought piece that we're trying to get some sense of order and relationship around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.937,
    "end": 4864.602,
    "text": " If we want context generation, the in plus the out equaling context to play a formal role in what we define as precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4865.163,
    "end": 4867.964,
    "text": "It's something to think about when looking at logic as a formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4868.804,
    "end": 4879.67,
    "text": "The accessing of data collection sets, which we've talked about again quite a bit today, talks about the definition of a precise bigger picture as a distributed collection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4880.356,
    "end": 4884.478,
    "text": " And then I can say in my work that was coming up with a professional contribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4885.338,
    "end": 4896.984,
    "text": "It also speaks to where there are relationships through lines, like a real physical line and those blankets that we keep talking about as a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4897.944,
    "end": 4905.528,
    "text": "And that also talks about what Scott talked about in the 21.1 is borrowing from the model as both a quantity and a quality determination.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4907.119,
    "end": 4932.635,
    "text": " I think at the end of the day it says instead of just looking at how and why we have to look at the when we're inside and outside the lines the who our relationship to all of the traffic that can be crossing the road and the which which do we look at do we look at the figure 12 or do we zoom out and add a third layer I don't think it really matters as long as we're prepared to look at both",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4934.369,
    "end": 4945.511,
    "text": " So that is, to me, the essence of what a free energy principle as unplannable to metacognitive world looks like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.072,
    "end": 4950.093,
    "text": "And I don't know that it's easy for people to sort of put all of that into a nutshell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4950.113,
    "end": 4954.453,
    "text": "But like I said, it's kind of a whole cloth, whole Markov blanket thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4954.513,
    "end": 4956.554,
    "text": "And as you mentioned, Daniel, in the last",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4957.967,
    "end": 4963.35,
    "text": " In the last live stream, we want the first principles to be able to generalize and scale up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4964.05,
    "end": 4976.576,
    "text": "But I think the only way that that happens is if we don't see it as either always inflating or always deflating, but we see both the geometry and the geography sort of working hand in glove with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4976.716,
    "end": 4978.617,
    "text": "I think that's how we derive a fit here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4980.978,
    "end": 4981.518,
    "text": "Nice, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.179,
    "end": 4982.499,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4985.009,
    "end": 4985.829,
    "text": " Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4987.13,
    "end": 4992.152,
    "text": "I guess Steven or Blue or anyone else, feel free to ask a question, but just a few notes on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4993.152,
    "end": 5004.236,
    "text": "So one is it's a subtle design choice, but notice that the green wraps around the whole box and then the orange wraps around the blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.937,
    "end": 5008.678,
    "text": "So it's not just like three Legos placed one on top of another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.698,
    "end": 5010.919,
    "text": "It actually is a zooming in and out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5011.519,
    "end": 5019.709,
    "text": " And so that moves us towards Bucky Fuller's dream of, you know, I went in stairs and out stairs rather than upstairs and downstairs because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.629,
    "end": 5022.15,
    "text": " It's not up and down for everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5022.23,
    "end": 5025.331,
    "text": "Just say it's in and out because you're on a closed surface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5025.811,
    "end": 5028.232,
    "text": "So that was about zooming in and out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5028.433,
    "end": 5031.394,
    "text": "And it's not that we're even necessarily moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.934,
    "end": 5035.956,
    "text": "Again, we talk about top down and bottom up, and that's vertically how it's arranged here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.536,
    "end": 5046.981,
    "text": "But perhaps inward out and outward in will make a lot more sense when we start to think about what these models are really doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5048.425,
    "end": 5051.868,
    "text": " And you brought up the idea of using the dot too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.509,
    "end": 5057.053,
    "text": "And so that was interesting to think about resources and artifacts that might be considered epistemic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5057.653,
    "end": 5065.16,
    "text": "I mean, it's research, we're talking about papers, but how do we use resources rather than just learn from them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.78,
    "end": 5069.704,
    "text": "So seeing them as action artifacts rather than just epistemic artifacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5071.624,
    "end": 5075.926,
    "text": " And then also just this idea that where will we have precision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.986,
    "end": 5077.927,
    "text": "Can we have precision in our policies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.548,
    "end": 5086.432,
    "text": "How do we instruct a high schooler or younger their world that they're going to be having a career in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.492,
    "end": 5092.735,
    "text": "And that's what it sounded like you were working towards was some sort of helping them get on a trajectory where they could have support and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5093.856,
    "end": 5094.896,
    "text": "It's going to be changing a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.757,
    "end": 5095.897,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5097.182,
    "end": 5104.763,
    "text": " It's like, I'm sorry, I can't give you precision on whether crypto will be important in 15 years or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.823,
    "end": 5108.184,
    "text": "It's like, we could write a million papers on that and just not know the answer today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5108.844,
    "end": 5110.504,
    "text": "What can we have precision on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5111.164,
    "end": 5125.907,
    "text": "And then this really pushes the question, where can we exchange our uncertainty and what should we focus on so that we can have focus on, if not our own policy, like I'm gonna go on a walk every day, but our own attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5126.809,
    "end": 5136.273,
    "text": " And that kind of covert mental action to bring it back to intentionality might be what we will always remain sovereign over is our attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.174,
    "end": 5137.454,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5142.556,
    "end": 5150.78,
    "text": "Yeah, I think this nestedness is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.82,
    "end": 5154.682,
    "text": "And I think, of course, time is part of that as well because these lower levels happen quicker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.792,
    "end": 5174.611,
    "text": " And I wonder, Dean, what your thoughts are on this in terms of when we look at these different variables that can now come into play on figure 12, I mean, they're kind of, okay, you're going to start to have variational potential to vary, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.56,
    "end": 5203.729,
    "text": " how you set because in in theory that every one of these values is sit is is is there implicitly just can't be varied right it's like there's there's there's some sort of precision somehow in the system but theoretically now okay you can access or change the precision on your priors on your generative model on your expected free energy as well as on your transition matrix that gets you the sensory states and of course then this question is okay now it's showing this in one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.692,
    "end": 5231.793,
    "text": " level all these arrows come together somehow it's like that mesh mystery well how does that happen right like is it a case that they're all firing out with like okay well this is what it would be like if um you know my updating of states was to have a different precision this is what it would be like if my generative model was to have a different precision this is and is there almost like a a whole array",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5232.754,
    "end": 5248.424,
    "text": " like imagine going in and out of the screen here of temporal depths or even different sort of combinations of these uh you know precision estimates and maybe the top level has to basically choose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5249.708,
    "end": 5254.389,
    "text": " And maybe at some point, the lower levels, if they don't get chosen very often, they die down, you know, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.289,
    "end": 5260.171,
    "text": "like the seven-legged unicorns running across the street isn't selected very often.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.271,
    "end": 5261.891,
    "text": "So it's like left to one side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.291,
    "end": 5269.833,
    "text": "But maybe with creative people, they tend to keep all those things firing, which may not be healthy if you go too far with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5271.633,
    "end": 5274.174,
    "text": "Because there is a question there, isn't there, is how...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5275.234,
    "end": 5291.506,
    "text": " As we start to bring in these other ideas is, okay, so what's that ability to bring up a precision estimate on an A matrix for looking at observations into states and to integrate these with these others?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.926,
    "end": 5296.249,
    "text": "And is that just integration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.73,
    "end": 5300.172,
    "text": "Are we going to start to have kinds of things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.312,
    "end": 5302.274,
    "text": "Like you were saying, if you have...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5302.967,
    "end": 5324.955,
    "text": " particular change in in how much the priors are changed um and along with the model you know then what does that do yeah i actually have some some thoughts on that steven it's interesting because i think all of these figures and every paper has their figures because they show their model i think that that model is kind of a reflection",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5325.902,
    "end": 5338.367,
    "text": " And I think the other thing that tends to happen is if you do reflect on, so what was I trying to perceive in terms of a sort of a metacognitive, now I'm thinking about a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5339.047,
    "end": 5340.748,
    "text": "I don't think we do that in isolation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5340.788,
    "end": 5343.649,
    "text": "I think the environment kind of acts as a scrutinizer as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5344.289,
    "end": 5346.85,
    "text": " Like you guys are scrutinizing what I'm saying right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5347.45,
    "end": 5357.273,
    "text": "And I'm hoping that I'm not saying something that's so completely obscure that it sort of continues to build on what we're all sharing in terms of what we're taking away from this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5357.513,
    "end": 5360.074,
    "text": "So I think there's an updating of updating and that's when",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5360.914,
    "end": 5370.383,
    "text": " when Lars was talking about that in the 28-1, I was kind of nodding because, yeah, I think that's a vital component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5370.423,
    "end": 5380.912,
    "text": "It's not sort of written out explicitly in this model here, but I think we should assume that when we're zooming in and zooming out, we are reflecting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5382.093,
    "end": 5384.876,
    "text": "So we're taking something and we're stretching that timeframe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5385.512,
    "end": 5394.997,
    "text": " And then I think the second thing that we can't sort of leave out if we're context generalizing is that context, that environment is acting as a scrutinizer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5395.617,
    "end": 5408.864,
    "text": "It's giving us feedback all the time so that we don't get stuck in one place, that time actually and change actually does become something that we're not just aware of, but we're actually utilizing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5410.39,
    "end": 5415.054,
    "text": " So that rate of change piece is, I think, we don't necessarily impose it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5415.094,
    "end": 5416.395,
    "text": "I think it gets imposed on us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5416.995,
    "end": 5417.816,
    "text": "Or maybe I'm wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5417.996,
    "end": 5421.899,
    "text": "But I haven't seen any evidence to the contrary yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5423.981,
    "end": 5426.723,
    "text": "Actually, that's a good point, if I just jumped in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5427.404,
    "end": 5428.685,
    "text": "Yeah, I mean, a lot of this stuff,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5430.702,
    "end": 5433.804,
    "text": " I mean, it actually starts to support the inactive approaches in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.844,
    "end": 5441.808,
    "text": "I suppose you actually start to see now that you're back into the realm of, well, how could you start to blend all of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5441.828,
    "end": 5452.893,
    "text": "It almost needs to be maybe hardwired into an active kind of dynamical biological thing, the technical term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.114,
    "end": 5459.197,
    "text": "So because it's not necessarily tractable,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.171,
    "end": 5475.64,
    "text": " purely however there may be parts of it which need to be more cognitively uh and can only happen at a sort of a more structured cognitive level you know so there's this question about what what can be inferred",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.664,
    "end": 5479.145,
    "text": " through acting in the world in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5479.185,
    "end": 5494.712,
    "text": "And like you say, the, you will find out when you bang into the wall or when you, or you just find out as you drink a cup, you know, you feel that you're feeling, you know, Hamilton's least action obviously becomes one of the options there is that we've come in with a free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.752,
    "end": 5495.012,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.573,
    "end": 5503.957,
    "text": "What seems to be the type of configuration of precision estimates that kind of gives the overall least action, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5505.337,
    "end": 5531.037,
    "text": " um if that's if that information is available and so now you have a way to integrate those um in one context which may provide the general structure which is good enough to to to work with them in other contexts you know maybe that there's some sort of plausible so it sort of moves beyond neuro phenomenology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5531.912,
    "end": 5533.253,
    "text": " and moves a bit beyond the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5533.273,
    "end": 5537.756,
    "text": "And you're now in, you are in the mind body environment dynamic, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.356,
    "end": 5538.556,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.576,
    "end": 5544.12,
    "text": "I think the really interesting part is when in doubt implies you're, you're, you're stuck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5544.761,
    "end": 5546.442,
    "text": "You're not maybe taking action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5547.422,
    "end": 5558.75,
    "text": "So zoom in, zoom out, like don't just do one or the other, be prepared, uh, inactively, but also from an active inference perspective to infer, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5560.27,
    "end": 5562.171,
    "text": " the geometry and the geography.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.612,
    "end": 5565.873,
    "text": "And I mean, make that explicit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5566.813,
    "end": 5569.554,
    "text": "Make that a part of your strategy, your tactics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5570.075,
    "end": 5574.637,
    "text": "It's actually, it's more inhibited than most people think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5575.697,
    "end": 5584.761,
    "text": "But in terms of what you're going to do is you're not going to get stuck on level one or level three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.102,
    "end": 5587.123,
    "text": "You're gonna actually be able to go",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5588.325,
    "end": 5588.945,
    "text": " cross levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5588.985,
    "end": 5592.287,
    "text": "That's why there's an envelopment in a lot of these representations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5592.808,
    "end": 5593.908,
    "text": "You're already in the nest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5594.349,
    "end": 5596.95,
    "text": "You're already deciding whether or not you're going to cross the street.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5597.391,
    "end": 5603.434,
    "text": "Now what you're asking is, is it more beneficial from a thinking perspective to that inside or outside the lines?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5603.935,
    "end": 5609.538,
    "text": "I'm not passing judgment on which is better, but what I am saying is don't restrict yourself to one or the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5611.059,
    "end": 5611.96,
    "text": "Zoom in, zoom out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5614.281,
    "end": 5616.863,
    "text": "The opacity of the second layer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5618.234,
    "end": 5621.96,
    "text": " only arises because there is a higher and a lower level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5622.821,
    "end": 5623.062,
    "text": "Right."
  },
  {
    "start": 5623.863,
    "end": 5625.565,
    "text": "So it's sort of like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.843,
    "end": 5628.625,
    "text": " maybe the series kind of blurs off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5628.925,
    "end": 5633.449,
    "text": "And so we have one type of awareness at our experienced tier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5634.169,
    "end": 5640.335,
    "text": "And then it rests upon the shoulders of the first and the third level, the green and the blue here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.055,
    "end": 5644.358,
    "text": "And then maybe those spiral off in reality, or maybe they don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5645.039,
    "end": 5646.66,
    "text": "We're modeling it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5647.441,
    "end": 5651.004,
    "text": "And then it's the feedback with reality that we'll update our models based upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.665,
    "end": 5651.905,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.62,
    "end": 5674.456,
    "text": " yeah and and this this because we've got levels at play and i know you you mentioned there about zoom in zoom out i mean zoom's quite an ocular kind of so i suppose we've got we there's a there's a kind of a question in terms of how we language some of this because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.562,
    "end": 5686.326,
    "text": " We want to look at different temporal... We've got different levels of abstraction as we see when we then look at things as they map across to our other knowledge epistemic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.906,
    "end": 5691.367,
    "text": "We've got different... We know that the hierarchies have different speeds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.587,
    "end": 5692.448,
    "text": "I mean, in a way, they don't...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.408,
    "end": 5701.092,
    "text": " Nature, in theory, doesn't care about the levels in a sense, but it might care about the speed at which the processing happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.112,
    "end": 5706.735,
    "text": "And if it has to go quicker at the lower levels, it has no choice around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.015,
    "end": 5716.481,
    "text": "But then we've also got this question of zooming out, scale-ups, scale happening, some of which you can't avoid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5716.501,
    "end": 5722.624,
    "text": "I mean, we've got cells inside our body at a scale, and then we've got organs, and then we've got...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5723.869,
    "end": 5735.813,
    "text": " I'm wondering, yeah, when we say zoom in, is that an attentional, no, okay, I'll pass it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.853,
    "end": 5742.276,
    "text": "No, I just, that's a great question because as I said, I don't have any pushback on anything the authors wrote in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5742.296,
    "end": 5743.296,
    "text": "I think it's a great paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5744.307,
    "end": 5751.492,
    "text": " And I'm suggesting we hold up attention and availability, because that's what zoom in, zoom out is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5751.972,
    "end": 5761.978,
    "text": "It's leaving yourself available to what could be considered included in a definition of what attention is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5763.179,
    "end": 5763.82,
    "text": "I'm saying include both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5766.616,
    "end": 5768.257,
    "text": " That's what the zoom in, zoom out does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5768.317,
    "end": 5770.457,
    "text": "It says, what am I available to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5771.378,
    "end": 5778.92,
    "text": "Am I making myself available to outside the lines metaphorically, physically, as well as inside the lines?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5779.361,
    "end": 5786.963,
    "text": "Is that part of my reasoning in terms of not necessarily being afraid of bumping into things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5788.404,
    "end": 5789.304,
    "text": "That's a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5789.344,
    "end": 5793.406,
    "text": "I mean, one other thing that I think is interesting when I think from science to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.452,
    "end": 5799.997,
    "text": " visual art, well, art is in science, you tend to think of zooming in and out, say with a microscope, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5800.017,
    "end": 5801.719,
    "text": "Because you can go in and you see more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5802.339,
    "end": 5804.661,
    "text": "Now in art, you tend to crop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5804.681,
    "end": 5808.505,
    "text": "So you have the same, roughly the same image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.585,
    "end": 5811.628,
    "text": "Maybe you go a little bit more detail, but you're just cropping in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.748,
    "end": 5818.27,
    "text": " Now, cropping in terms of how we kind of think informationally is quite different, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5818.29,
    "end": 5821.01,
    "text": "Because it's what you're taking away to leave focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.631,
    "end": 5835.355,
    "text": "Whereas zooming in, because we get more detail on something small, we maybe don't focus on all the things that, well, you could zoom in and you just expand the, you know, the frame gets bigger, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.895,
    "end": 5838.936,
    "text": "Normally, that's the question, you know, you're zooming in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.796,
    "end": 5845.877,
    "text": " on an object that's like a penny and it gets to a certain size until it fills your frame of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5846.197,
    "end": 5857.239,
    "text": "Because once you go beyond that, you can't help but crop because you can't fit everything in and you then gain more detail on something, but you can't take in other detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.899,
    "end": 5861.92,
    "text": "So there's, I mean, even that's a scale dependent thing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5861.98,
    "end": 5864.1,
    "text": "It's dependent on the organism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.12,
    "end": 5867.081,
    "text": "So for a mouse to zoom in and zoom out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.121,
    "end": 5887.688,
    "text": " um well also can to some extent without using a tool or an instrument can we zoom like it's interesting because we if can i zoom with my eyes in a way i can focus and i can go in i can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5889.198,
    "end": 5908.786,
    "text": " take my most accurate i suppose in some ways i can zoom by having the area of my eye that has the most um cells being given attention to a particular part of the i can take my attentional um fidelity to bear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.878,
    "end": 5917.56,
    "text": " but some of the things also, like I say, we, we, we kind of imagine ourselves as if we've got a binoculars or some other tool in our hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.68,
    "end": 5917.9,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5918.44,
    "end": 5930.684,
    "text": "And we, um, because we sort of, it's such an embodied thing to do, but actually that's not necessarily, that's not necessarily what we could do without that tool, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5930.704,
    "end": 5933.645,
    "text": "So there's a, there's a, there's a question there around, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5936.989,
    "end": 5952.862,
    "text": " Yeah, where do... And maybe we were able to use... Maybe that's the thing that's kind of unique about humans is that ability to pick up a microscope and look through it and extend through the tool usage, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.443,
    "end": 5957.866,
    "text": "And that's not necessarily available to other animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.666,
    "end": 5963.991,
    "text": "I think that the paper speaks to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5965.618,
    "end": 5970.465,
    "text": " I can attend or not attend, and I'll know that I'm attending when I'm not attending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5971.527,
    "end": 5976.634,
    "text": "So that's the sort of inflationary, deflationary,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5977.642,
    "end": 5987.787,
    "text": " part of it, and I'm not saying drop that, I think that that's important, but I think if it's only held up as that, you're missing the other two vertices of the triad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5988.348,
    "end": 5996.192,
    "text": "The other two vertices being, can I also on the open end of the triangle relative to that first part, which is the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5997.032,
    "end": 5998.473,
    "text": " Am I or am I not attending?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5998.553,
    "end": 6000.414,
    "text": "Am I inflating or deflating?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6000.454,
    "end": 6001.595,
    "text": "Am I going up or down?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6002.295,
    "end": 6004.056,
    "text": "Is the geometry and the geography.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6004.076,
    "end": 6018.465,
    "text": "And I think if you put all, I know this sounds very abstract, but after you put it into practice, after you have your checklist or your model that you carry in with saying, have I addressed all three sides of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6019.673,
    "end": 6021.874,
    "text": " you tend to generate a context much sooner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6021.914,
    "end": 6038.182,
    "text": "Your Markov blanket becomes more transparent, more tunneling effect into these novel situations than I'm waiting around for somebody to point to what I need to attend to next, which is more of the instructionalist model again, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6040.313,
    "end": 6051.828,
    "text": " So, I mean, if you want to give a person the ability to make sense sooner, all I'm suggesting is that have three vertices, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6051.868,
    "end": 6055.813,
    "text": "Have three corners to this to dimensionalize the space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6056.493,
    "end": 6058.776,
    "text": "And again, if you put it into practice,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6059.6,
    "end": 6066.084,
    "text": " it's pretty easy to transfer from the abstract into actual physical things that you do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6066.944,
    "end": 6071.507,
    "text": "I mean, you can decide what the focal point is and what the horizon is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6072.087,
    "end": 6077.491,
    "text": "You can decide what the difference is and you can decide what the proportions and the contrast are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6077.691,
    "end": 6084.615,
    "text": "And if somebody says to you, I'm not getting this, you can also explain to them what you're not seeing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6085.796,
    "end": 6090.117,
    "text": " which is really, really helpful to the person who's trying to be the guide or the wayfinder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6092.477,
    "end": 6092.937,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6093.778,
    "end": 6094.018,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6096.158,
    "end": 6102.319,
    "text": "Yeah, I wanted to kind of talk about zooming in and zooming out and using a microscope or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6102.499,
    "end": 6110.481,
    "text": "And so something that I have found in the course of my life is the capacity for mental zooming in and zooming out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6111.383,
    "end": 6115.324,
    "text": " especially with regard to consideration for others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6115.904,
    "end": 6120.445,
    "text": "So like I started life as a kid, like everything was provided for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6120.485,
    "end": 6125.106,
    "text": "And then like as a teenager, I was like the most self-absorbed creature alive, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6125.666,
    "end": 6130.367,
    "text": "And so like, as I've gotten older, like my, so I was so focused on just me, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6130.447,
    "end": 6132.407,
    "text": "Just me, me, me, me, me, I'm the center of my world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6132.767,
    "end": 6135.588,
    "text": "But then like, you know, you really start to expand that,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6137.248,
    "end": 6147.195,
    "text": " you know, to consider more and more people and the planet and like all of the consequences of your actions as I, you know, developed and, you know, probably really set in at like 25, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6147.215,
    "end": 6155.161,
    "text": "With full frontal lobe development and the understanding of consequences and, you know, this kind of ripple effect, the butterfly effect of our actions and so forth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6155.181,
    "end": 6158.984,
    "text": "But also in meditation to kind of bring it back in and tie it back to the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6160.119,
    "end": 6162.162,
    "text": " you do this meditation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6162.202,
    "end": 6172.46,
    "text": "I mean, I've done meditations where you're doing, for example, loving kindness and you focus on loving kindness and it's kindness for yourself and your inner circle and then you expand it to include",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6172.773,
    "end": 6178.594,
    "text": " you know, the people in the room and your extended family and, you know, everyone that's suffering the same ailments as you and so forth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6178.614,
    "end": 6184.055,
    "text": "So you kind of expand your awareness, this mental zooming out through meditation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6184.155,
    "end": 6189.977,
    "text": "And yeah, so I just wanted to kind of say, like, we don't always need a microscope, but it is mental.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6190.597,
    "end": 6193.877,
    "text": "And it may also be something that's uniquely human.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6196.598,
    "end": 6198.338,
    "text": "Can I just respond to that, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6198.378,
    "end": 6199.799,
    "text": "I think you're absolutely right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6199.819,
    "end": 6201.259,
    "text": "And the funny thing is, is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6203.945,
    "end": 6213.29,
    "text": " Again, when you take it off the page, what you're describing and what I'm describing, although I'm probably doing a terrible job of it, is identity and feelings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6214.831,
    "end": 6229.9,
    "text": "When you actually use this approach of being able to hold up three things at once, it's your identity and your feelings that you're really becoming metacognitive of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6230.12,
    "end": 6233.142,
    "text": "So is it metacognitive or is it dissolving?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6233.803,
    "end": 6235.184,
    "text": " the identity, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6235.404,
    "end": 6240.927,
    "text": "And so that's like the question of Mike Levin, you know, expanding the cognitive boundary of the self.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6241.568,
    "end": 6245.79,
    "text": "So in his paper, I don't, I'm not sure if you read the computational boundary of the self or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6246.291,
    "end": 6255.436,
    "text": "But, but, you know, he talked about this, the computational boundary and, you know, not just of a person, but also like a cell and an organ and a tissue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6255.836,
    "end": 6256.777,
    "text": "And so, but also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6257.404,
    "end": 6285.809,
    "text": " human and and when you've dissolved this computational boundary of the self you've expanded it you've dissolved i mean this is eventually the end goal of meditation is this dissolution of identity this ceasing of grasping to the self i mean in many traditions right this is the letting go of self-grasping and letting go of the idea of the self and so you have this very expansive consideration of the self and so it's encompassing all um beings in that in that boundary",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6286.314,
    "end": 6295.377,
    "text": " Yeah, and that's interesting because that's exactly what we used to talk about is what does it mean to go from being a student to being a professional contributor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6295.777,
    "end": 6298.458,
    "text": "Well, all I know is it's not an extension of being a student.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6299.158,
    "end": 6302.619,
    "text": "I have no idea what it means in your particular situation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6302.919,
    "end": 6308.441,
    "text": "So it is a dissolving, if nothing else, it's a forming and a dissolving at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6308.481,
    "end": 6308.881,
    "text": "That's why I said,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6311.079,
    "end": 6317.821,
    "text": " You still have me because it was your influence that got me watching Soul, and that's exactly what they were talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6318.002,
    "end": 6332.566,
    "text": "And so, again, it is ephemeral, and we can reflect on it, and we can have the environment scrutinize on it, and that doesn't destroy everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6332.866,
    "end": 6334.467,
    "text": "That's actually building things up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6337.208,
    "end": 6337.748,
    "text": "Thanks, Steve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6337.808,
    "end": 6338.068,
    "text": "Stephen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6340.956,
    "end": 6345.754,
    "text": " And this, what you're just mentioning there in terms of dissolving the self,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6347.463,
    "end": 6352.686,
    "text": " and meditation and precision estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6353.326,
    "end": 6356.488,
    "text": "Um, I think this, this could speak to this idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.528,
    "end": 6361.53,
    "text": "You know, we talk about the five, the six plus or minus one in terms of how many ideas you can hold in your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6361.99,
    "end": 6367.253,
    "text": "And we have this idea, you know, with higher thinking it's purer, or we have certain things that we hold in our minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.333,
    "end": 6372.756,
    "text": "And I can imagine that it's like with meditation, the idea that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6373.689,
    "end": 6386.998,
    "text": " if it's done well, because it can, you know, you could end up going into some places where you just don't, it's not productive, but in a productive sense, it's like you are able to adjust and integrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6387.398,
    "end": 6393.142,
    "text": "You can imagine why D, why B, why C, why E, why G, why A, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6397.397,
    "end": 6415.84,
    "text": " So you're still accepting that you can go with different precision estimates, but you don't get this kind of attachment or making certain precision estimates as kind of rarefied things, which we often do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.861,
    "end": 6423.762,
    "text": "So we kind of feel like it should be like something or we feel uncomfortable or we get drawn to our kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.402,
    "end": 6453.403,
    "text": " you know our desires or the things that we get kind of obsessive with or things that we are avoiding so that could be interesting and the other thing that then can tie to that because i like to mix as well as meditation which this talks about which is kind of yeah you've got meditation you've got action in the world where we can like you say with the environment walking around and then we've got ritual and ritual tends to be more in the um indigenous approaches but there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6454.622,
    "end": 6457.547,
    "text": " you're not necessarily trying to dissolve anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6457.807,
    "end": 6461.473,
    "text": "It's almost like you're trying to disrupt it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6462.134,
    "end": 6466.742,
    "text": "It's not like you've got a nice, pure drop that you're hoping to, like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6467.782,
    "end": 6489.083,
    "text": " evaporate and allow to become a mist that we're not reifying anymore it's a bit like you know you see that you're going to put on a big mask and a costume and you're going to dance around the fire and until you start to go into another state now that could access another set of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6491.167,
    "end": 6517.323,
    "text": " informational inferences and that that may be doing some other things you know that maybe things which are more useful when we're in a communal integration and social integration or social sense making so it could be like we're trying to regulate as a group and then meditation is helping us regulate as individuals and it's neither one's better than the other but they have different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6518.305,
    "end": 6521.346,
    "text": " you know, niche properties for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6521.366,
    "end": 6524.868,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6526.409,
    "end": 6528.85,
    "text": "Well, interesting discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6529.55,
    "end": 6537.233,
    "text": "Maybe we can each give a closing thought and then I have a short quote to close based upon something Dean said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6540.854,
    "end": 6567.103,
    "text": " it's um it's a really interesting paper i think we all enjoyed reading it it really does point the way towards uh what does a generalized computational phenomenology or at the very least without getting experience into the mix just what is a computational framing of mental action is that a paradox in and of itself is it impossible is mental action just like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6568.884,
    "end": 6569.545,
    "text": " a no-go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6570.465,
    "end": 6578.269,
    "text": "Or is mental action going to be understood to be everything of the iceberg that isn't the tip of the iceberg?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6579.71,
    "end": 6579.97,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6582.411,
    "end": 6592.897,
    "text": "So just a final thought, you know, this metacognitive aspect and, you know, that the idea of identity dissolution, and I do think it was mentioned in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6594.192,
    "end": 6605.314,
    "text": " this paper, but just briefly, what about under the influence of psychedelic drugs, where we know we have this identity dissolution, this ego dissolution, this expansion of the cognitive boundary?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6605.815,
    "end": 6613.536,
    "text": "So when you have psychedelics, how is the metacognitive hierarchy influenced, disrupted?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6613.556,
    "end": 6614.736,
    "text": "Is it obliterated?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6614.756,
    "end": 6615.737,
    "text": "Is it enhanced?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6616.137,
    "end": 6621.158,
    "text": "So I'd be interested to see if the authors go down that road in the future or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6621.878,
    "end": 6645.879,
    "text": " to see someone you know take it to that level exploring the metacognition of um people under the influence of hallucinogenics thanks blue dean i think back in the 28 zeros we were wondering about whether or not this this paper and the stuff that it points to could be used for nefarious purposes and i",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6646.817,
    "end": 6654.548,
    "text": " I think I commented back then that I used to work with a lot of people who were spending a lot of time with focus and attention on task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6655.714,
    "end": 6660.575,
    "text": " And I just like to sort of keep that where that is, because I know that's a thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6661.155,
    "end": 6670.217,
    "text": "And I'd like to just sort of hold it up with the background of what we're available to, that availability piece, because I think that's the more powerful thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6670.917,
    "end": 6673.457,
    "text": "And I'm not sure that that's necessarily threatening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6673.877,
    "end": 6681.799,
    "text": "But I think if we can have conversations with people about how active inference acts as an availability enhancer,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6682.939,
    "end": 6690.102,
    "text": " they might be more attracted to this and not necessarily see it as something that people could use for nasty purposes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6690.202,
    "end": 6705.468,
    "text": "I mean, there's going to be people out there going to do their nasty thing, but I think there's actually a really empathetic and sincere aspect to this that isn't just exploitable, but is really explorable and is really kind of cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6706.923,
    "end": 6714.105,
    "text": " We'll have a quantitative framework for saying that we would prefer if they didn't, even though we expect them to behave the way that they're expecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6714.845,
    "end": 6719.786,
    "text": "But we'll have an interaction sequence that might change the way that that works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6720.186,
    "end": 6720.466,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6722.707,
    "end": 6723.507,
    "text": "Yeah, a couple of points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6723.527,
    "end": 6733.87,
    "text": "Well, one, it might be interesting to see what Adam Saffron makes of some of this with the psychedelics, as he's just started a postdoc now in psychedelics at John Hopkins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6733.93,
    "end": 6734.33,
    "text": "So that'd be...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6735.523,
    "end": 6736.384,
    "text": " That'd be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6736.404,
    "end": 6753.356,
    "text": "And then I suppose the other thing that I've noticed is with some of the nefarious actions, and I think you're right, but I think also what I've noticed is some of the kind of intuitive nefarious actions of politicians who are particularly adept at...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6756.926,
    "end": 6758.588,
    "text": " getting people on their side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6758.608,
    "end": 6766.315,
    "text": "It may actually be that some of that they're doing through kind of like some sort of roundabout intuitive artistic route.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6766.396,
    "end": 6770.38,
    "text": "This might help us reverse engineer how they're doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6770.6,
    "end": 6778.608,
    "text": "So there might also be some benefits to understanding what is it they're doing, even if they don't quite know how to describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6781.172,
    "end": 6781.412,
    "text": " Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6782.253,
    "end": 6784.695,
    "text": "I think you're absolutely right, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6784.735,
    "end": 6793.702,
    "text": "I think if we are able to make this available to more people, their bullshit detectors are going to get really, really improved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6796.647,
    "end": 6808.811,
    "text": " So the closing quote to hopefully bring some of these threads together, we talked a lot about, you know, distributed versus centralized sense-making and what is the role of scrutiny and the scrutinizer like Dean brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6809.311,
    "end": 6812.833,
    "text": "And of course, GEB, Hofstetter's book from 1979.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6813.413,
    "end": 6820.615,
    "text": "But another work of art from 1979 was Frank Zappa's song, Central Scrutinizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6821.276,
    "end": 6824.317,
    "text": "And just closing with some of the first lines of that poem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6825.543,
    "end": 6826.283,
    "text": " Thank you, everybody, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6826.303,
    "end": 6826.644,
    "text": "Fun times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6826.704,
    "end": 6827.524,
    "text": "See you in",
    "speaker": "SPEAKER_01"
  }
]