[
  {
    "start": 7.878,
    "end": 10.521,
    "text": " Hello and welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 10.741,
    "end": 15.166,
    "text": "It's Active Lab live stream number 28.0 on September 6, 2021.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 15.947,
    "end": 25.457,
    "text": "We're going to be talking about the paper Towards a Computational Phenomenology of Mental Action, Modeling Meta-Awareness and Attentional Control with Deep Parametric Active Inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 28.117,
    "end": 55.676,
    "text": " welcome to the active inference lab we are a participatory online lab that is communicating learning and practicing applied active inference you can find us at the links on this page this is a recorded and archived live stream so please provide us with feedback so that we can improve on our work all backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams thanks a ton blue and steven and dean nice fun to have a dot zero crew together",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.87,
    "end": 78.551,
    "text": " here you'll see a slightly updated version of the upcoming streams calendar which you can get at from this short link here uh september 7th and 14th we're going to be discussing this paper we're going to be discussing in this one and then we don't have a paper for 29 and then we have some papers set with authors for all of october",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 79.505,
    "end": 85.487,
    "text": " Also, check out the tabs to see other series other than the Tuesday paper-centric walkthroughs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 85.527,
    "end": 92.589,
    "text": "And of course, anyone's welcome to co-organize an event or to be the guest for one of these types of streams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 94.009,
    "end": 105.233,
    "text": "All right, so today in 28.0, we're going to be just learning and discussing this paper that was already mentioned by Sanvid Smith, Hesp, Mattout, Fristin, Lutz, and Ramstedt.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 106.444,
    "end": 108.906,
    "text": " out only a few weeks ago, which is kind of cool to see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 109.947,
    "end": 111.488,
    "text": "And there's going to be a ton to talk about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 111.588,
    "end": 113.649,
    "text": "It's a super interesting paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 114.55,
    "end": 118.493,
    "text": "And if you want to participate in 28.1 or 2, you should get in touch.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 118.733,
    "end": 124.076,
    "text": "Otherwise, if it's after that time, then check out those videos and maybe find another one to participate in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 124.717,
    "end": 129.34,
    "text": "But I'm just looking forward to hearing what you all were excited about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 130.021,
    "end": 131.381,
    "text": "By way of introduction, just...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 132.335,
    "end": 137.101,
    "text": " Want to hear from everybody and what was exciting to them about this paper or made them want to join for the .Zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 144.097,
    "end": 146.038,
    "text": " If I go first, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.078,
    "end": 146.879,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.559,
    "end": 162.428,
    "text": "I'm really excited or interested to see them moving beyond a computational approach to neurophenomenology, which I've seen before, and into this broader idea of what they're calling computational phenomenology, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.248,
    "end": 173.991,
    "text": " Well, it's a bolder claim and has more relevance potentially to other applications, which I'm interested in and applied active inference context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.151,
    "end": 179.173,
    "text": "So, you know, we'll see how that bold claim can be applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.193,
    "end": 181.874,
    "text": "Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 183.014,
    "end": 183.174,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.234,
    "end": 187.496,
    "text": " So for me, I thought it was like ultra meta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.137,
    "end": 195.502,
    "text": "The paper really got into the hierarchical levels of organization, which I'm always excited to see and talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.285,
    "end": 215.017,
    "text": "For me, it was the fact that I am doing some writing right now and I am interested in the idea that there is a way of putting this into some sort of a geometric relationship as well as the computational relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 217.674,
    "end": 217.894,
    "text": " Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 218.495,
    "end": 219.675,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 221.516,
    "end": 237.487,
    "text": "The paper is, let me just reframe it, is Towards Computational Phenomenology of Mental Action, Modeling Meta-Awareness and Attentional Control with Deep Parametric Active Inference in Neuroscience of Consciousness, published about two weeks ago, 27th of August.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 239.348,
    "end": 242.47,
    "text": "Does someone want to read the three aims of the paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 246.092,
    "end": 246.633,
    "text": "Sure, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.583,
    "end": 262.29,
    "text": " The three aims are to explicitly model meta-awareness, to account for the computational consequences of meta-awareness on cognitive control, and lastly, to provide a computational account of mental covert action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.291,
    "end": 264.572,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 265.432,
    "end": 266.873,
    "text": "And then maybe the second part?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 272.436,
    "end": 272.636,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.783,
    "end": 279.987,
    "text": " Formally speaking, the crucial thing to note about these cognitive processes is that they are about other such processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.588,
    "end": 286.912,
    "text": "The deployment and control of attentional states and processes, for instance, are quintessentially a higher level ability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.512,
    "end": 294.938,
    "text": "Such states and processes monitor and modulate other, typically lower level perceptual states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.518,
    "end": 299.741,
    "text": "Third order, higher level processes in turn oversee these attentional processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.285,
    "end": 305.37,
    "text": " we can be aware of our attention being grabbed and make a deliberate decision to focus our attention elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.971,
    "end": 322.667,
    "text": "It would seem then that effective self-regulation of attention depends on the ability to access, evaluate, and control the quality of these attentional processes themselves, in the same way that attentional processes are necessary to consciously access, assess, and control lower-level perceptual states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.543,
    "end": 328.944,
    "text": " interesting areas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 329.864,
    "end": 345.41,
    "text": "It's just interesting to see that the kind of framework that helps a robot navigate, now it's being used in a little bit of a different way, like nesting within ourself and coming closer to our experience and other things which often are said to be unable to be directly observed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 346.871,
    "end": 348.331,
    "text": "So it's quite a cool topic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 351.693,
    "end": 354.834,
    "text": "Dean or Steven, any thoughts or do either of you want to read the first abstract?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 356.414,
    "end": 358.475,
    "text": " I got a quick thought before we get to the abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.836,
    "end": 364.58,
    "text": "In the introduction of the paper, I want to just read this really quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.78,
    "end": 373.186,
    "text": "It's in the paper, but computational terms, the central place of confidence and reliability and effective self-regulation speaks to the key role of precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.212,
    "end": 376.074,
    "text": " or inverse variance of implicit beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.734,
    "end": 383.82,
    "text": "And then they talk about probabilistic and posterior Bayesian beliefs that describe a probability distribution over some latent quality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.72,
    "end": 386.862,
    "text": "But this was the thing that I found really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.902,
    "end": 392.207,
    "text": "Bayesian beliefs about Bayesian beliefs can, in certain situations, become propositional",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 392.987,
    "end": 395.909,
    "text": " and the way that they are estimated, optimized, and controlled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 396.549,
    "end": 410.977,
    "text": "Precisions, in a nutshell, quantify our confidence in our beliefs, say how confident we are about what we know about states of the world, about their relationship to our observations, or about how these states change over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.415,
    "end": 427.28,
    "text": " Being able to place numbers around that, as soon as I read that and saw it in relationship to a proposition, I found that really interesting and was really curious to see now, so how is that thread going to play out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.901,
    "end": 441.305,
    "text": "Now, it wasn't part of the three things that were in the previous slide, but I think it was really important and something that was, it has to be a name or a claim of the paper because it's pretty fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.117,
    "end": 468.728,
    "text": " good call it's almost like a background assumption whether uh post hoc justified by empirical appeal or not that precision is what matters which is kind of the other side of the coin from uncertainty like high precision means low uncertainty and vice versa and sometimes they're framed as so I think totally agree that is a claim of the paper okay Stephen want to go for abstract one yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 472.734,
    "end": 473.034,
    "text": " OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.415,
    "end": 489.229,
    "text": "Meta-awareness refers to the capacity to explicitly notice the current content of consciousness and has been identified as a key component for the successful control of cognitive states, such as the deliberative direction of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.85,
    "end": 499.538,
    "text": "This paper proposes a formal model of meta-awareness and attentional control using hierarchical active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.618,
    "end": 527.712,
    "text": " To do so, we cast mental action as policy selection over higher level cognitive states and add a further hierarchical level to model meta-awareness states that modulate the expected confidence or precision in the mapping between observations and hidden cognitive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.355,
    "end": 543.719,
    "text": " nice yeah there's a lot of uh terms some of which we're going to go into in the keyword section but pretty distilled down description of their contribution and we're going to unpack it more okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 544.835,
    "end": 554.339,
    "text": " Abstract 2, we simulate the example of mind wandering and its regulation during a task involving sustained selective attention on a perceptual object.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 555.019,
    "end": 567.344,
    "text": "This provides a computational case study for an inferential architecture that is apt to enable the emergence of these central components of human phenomenology, namely the ability to access and control cognitive states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 568.53,
    "end": 583.481,
    "text": " We propose that this approach can be generalized to other cognitive states, and hence, this paper provides the first steps towards the development of a computational phenomenology of mental action, and more broadly of our ability to monitor and control our own cognitive states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 584.922,
    "end": 589.645,
    "text": "Future steps of this work will focus on fitting the model with qualitative behavioral and neural data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 590.626,
    "end": 593.407,
    "text": "Okay, cool topics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 593.828,
    "end": 595.469,
    "text": "Any thoughts, or we can move on?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 596.547,
    "end": 600.509,
    "text": " First steps, that's the emphasis here, just first steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 601.99,
    "end": 607.373,
    "text": "Yep, I'm pretty excited to get to this, the generalized model of mental action because it's like...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 609.198,
    "end": 613.482,
    "text": " almost like the new tool enables asking about phenomena that we already know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.982,
    "end": 625.693,
    "text": "And then it reveals a whole new state space of kind of then the model feeding back to the kinds of regimes of attention that we designed for ourself or niche modifications or information inputs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 626.994,
    "end": 651.158,
    "text": " okay roadmap so this paper has an interesting layout it is just an introduction that brings up the non-active inference sections related to the scientific study of mental action and about how it's been computationally modeled outside of active inference then there's a methodology paper that first has more of a model building",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 653.523,
    "end": 660.921,
    "text": " narrative and then the empirical results from a simulation that has a few different layers of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 663.12,
    "end": 664.361,
    "text": " detail layered on it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 664.401,
    "end": 666.282,
    "text": "It's not just one single model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 666.302,
    "end": 672.805,
    "text": "There's a few little variants that help get at which parts of the model are contributing which behavior and why.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 673.825,
    "end": 678.908,
    "text": "Then they have a more general discussion and give some directions for future research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 679.368,
    "end": 683.77,
    "text": "And that's where some of these big claims about computational phenomenology go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 683.79,
    "end": 685.651,
    "text": "And then there's a conclusion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 686.071,
    "end": 687.852,
    "text": "So any thoughts on the roadmap?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 691.152,
    "end": 712.028,
    "text": " Yeah, I think that this gives a good sense of the way that they're trying to enter into this space, looking at the opacity and transparency of phenomenology and trying to sort of bring back that neuro-phenomenology into this wider phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.048,
    "end": 715.41,
    "text": "So by sort of looking at the experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.47,
    "end": 718.633,
    "text": "Now, the question that sort of comes up with this is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.265,
    "end": 728.749,
    "text": " Because obviously a lot of the work here with Rampstead and others has been around embodied cognition and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.769,
    "end": 738.733,
    "text": "So they're sort of going into this idea of trying to set it up so that they can target phenomenology while still keeping it around mental states and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.213,
    "end": 747.437,
    "text": "So there's an interesting, I don't know, ontological dance they're trying to find a way through here, which I think is kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.512,
    "end": 751.692,
    "text": " Any other comments on the roadmap?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 753.553,
    "end": 753.773,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 755.053,
    "end": 767.777,
    "text": "So the keywords were free energy principle, active inference, neuro phenomenology, metacognition, opacity, transparency, focused attention, mind wandering, and mindfulness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 768.657,
    "end": 770.718,
    "text": "So perhaps blue with FEP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 773.377,
    "end": 792.862,
    "text": " sure this slide i pulled out of the live stream 15.0 so the free energy principle is based on three aspects the observation of self-organization which brings us to the second aspect which is that living organisms can be described as stochastic dynamical systems possessing attractors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.715,
    "end": 804.64,
    "text": " And then lastly, the states in which the self-organizing system is at a point in time can be identified by the interactive role they play within the multi-level self-organization scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.781,
    "end": 817.587,
    "text": "And then this is related to, in the slide from 14.0, multi-scale systems, ensembles, info thermodynamics, and variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.749,
    "end": 823.53,
    "text": " which I thought was applicable here as we're going through this hierarchical awareness, meta-awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.471,
    "end": 825.751,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 826.831,
    "end": 828.591,
    "text": "Yeah, Stephen, and then I'll go up there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 828.911,
    "end": 829.071,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.532,
    "end": 832.692,
    "text": "Well, yeah, I think this is good to characterize this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.732,
    "end": 843.455,
    "text": "And also, I know that Maxwell mentioned how that multilevel graph, he's kind of gone back on it a bit, but it does show that whole question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.475,
    "end": 847.816,
    "text": "It's a really good diagram to show both that there is this multilevel nested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.616,
    "end": 864.771,
    "text": " sort of multi-scale thing going on and also it's kind of a contested it's a contested or kind of evolving part of the whole field because it's uh people are sort of putting out things and then they're maybe backtracking a little bit and so i think um yeah i think it's quite a good thing to bring up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.701,
    "end": 869.142,
    "text": " Definitely not a settled area.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 869.182,
    "end": 875.986,
    "text": "That's why it's so fun to just have these discussions on the topic because even the paper is not the end result.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 876.066,
    "end": 877.067,
    "text": "It was first steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 878.688,
    "end": 887.853,
    "text": "And we're gonna see in this discussion, the multi-scale system is almost like psychologically nested or mentally nested",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 888.433,
    "end": 912.547,
    "text": " within one agent whereas previously we've been talking a lot about multi-scale systems in the context of you know a bunch of ants making the colony a bunch of communicating individuals making the community so it's like that's like multi-scale systems out and getting spatially bigger and this is kind of getting more ephemeral but also having this very interesting influence on the lower level models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 914.983,
    "end": 920.001,
    "text": " So for active inference, the keyword, we can look at what the authors wrote because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 921.107,
    "end": 949.127,
    "text": " always cool to see just how did they define this how did they frame what active inference is for this paper and they wrote that at the root of these advances is a biologically plausible neurocognitive and behavioral modeling framework called active inference active inference provides us with a bayesian mechanics that is the mechanics of knowledge driven action and active perception which explains from first principles how autonomous agents can thrive within their ever-changing environments",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 950.362,
    "end": 956.068,
    "text": " Active inference descends from and is closely related to Bayesian brain theory and predictive coding.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 957.049,
    "end": 971.163,
    "text": "And then this green one I thought was very interesting in how they said it was active inference casts perception, learning, and action as essentially being in the same game, that of gathering evidence for the model that underwrites the existence of the agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 972.304,
    "end": 992.419,
    "text": " So just on the diagram that we've seen with the four different kinds of nodes, with the blanket states of in and outgoing, and the internal and external states, to say that the three that constitute the organism, let's say, are all in the same game, just brings sort of a unity of action and inference to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 994.201,
    "end": 1021.763,
    "text": " we think about the very least other systems that already have this structure like input output systems which some people speculate describe all classes of systems or computational systems so it's just like the way that they made that clear of active inference without tying it to a specific model implementation i thought was very well set steven and also this does give a flexibility as knowledge evolves um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1022.998,
    "end": 1032.311,
    "text": " Because as Mark Soames has been talking about, the way attention may be moved around more at the base of the brain, using more kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.314,
    "end": 1057.993,
    "text": " attentional biological you know inactive questions that wouldn't necessarily be a problem for this because this this modeling isn't completely tied to some sort of frontal cortex model of thought it's kind of it's broader so i think that's that's quite interesting and to say how they're using the term behavioral modeling the framework and they've sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.144,
    "end": 1066.769,
    "text": " Yeah, the way they positioned it, because they haven't gone the whole way and talked about biological and gone down the full multi-scale biology route.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.809,
    "end": 1074.915,
    "text": "They've kept it kind of in the brain, but they've brought in that behavioral element, which I think neurophenomenology maybe doesn't do as much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.276,
    "end": 1077.417,
    "text": "Good segue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.237,
    "end": 1079.758,
    "text": "Blue, want to describe this one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1081.499,
    "end": 1081.98,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.04,
    "end": 1085.042,
    "text": "So neurophenomenology, in the words of the authors...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.914,
    "end": 1105.751,
    "text": " Neurophenomenology has been described as the search for generative passages between the neurobiological, phenomenological, and mathematical levels of description, going beyond the description of mere isomorphisms between these levels toward mutual epistemological and methodological accountability and cross-fertilization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.553,
    "end": 1116.178,
    "text": " Neurophenomenology aims to bridge the gap between these kinds of data via the formal metaphysically neutral levels of the description provided by mathematics and computational work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.818,
    "end": 1122.981,
    "text": "And I pulled this cartoon out of this paper because I thought it was kind of a neat perspective and visual on neurophenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.001,
    "end": 1135.087,
    "text": "So it talks about the biological structures as predetermining the world of the organism and then neurophenomenology as a praxis between the first person account that the organism has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.629,
    "end": 1138.37,
    "text": " and the neural descriptions of these structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.93,
    "end": 1141.151,
    "text": "So that was kind of the point of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.352,
    "end": 1143.252,
    "text": "Nice find.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1143.932,
    "end": 1145.253,
    "text": "Very interesting figure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1145.733,
    "end": 1150.755,
    "text": "Looks kind of like a sci-fi human novel, but it's kind of cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1152.715,
    "end": 1152.976,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1155.236,
    "end": 1164.64,
    "text": "To talk about one specific kind of neurophenomenology, like a first-person experience that is desired to be modeled, potentially even in a computational direction,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1165.902,
    "end": 1170.003,
    "text": " Here, they're focusing on this metacognition aspect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1170.783,
    "end": 1180.545,
    "text": "So just the yellow parts, they wrote, we define meta-awareness in this context as the ability to explicitly notice the current content of a conscious episode.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1181.205,
    "end": 1193.728,
    "text": "For our purposes, as discussed in the text, we define states of meta-awareness as those third order, which we'll get to, states of the system that are about and enable the opacity of second order attentional states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1195.305,
    "end": 1201.709,
    "text": " Metacognitive states thus function analogously to attentional states, which enable the opacity of first order perceptual states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1202.429,
    "end": 1205.491,
    "text": "So it's going to be a three layer nesting doll.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1206.251,
    "end": 1211.615,
    "text": "The role that the second model plays over the first is going to be analogous to the role that the third model plays over the second.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1212.195,
    "end": 1214.736,
    "text": "But that doesn't mean its dynamics are going to play out in the exact same way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1215.839,
    "end": 1219.063,
    "text": " And then this last part was very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1219.083,
    "end": 1228.494,
    "text": "Like mental action refers to goal-directed internal behavior without necessarily having a direct consequence on the external environment, e.g.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1228.634,
    "end": 1230.096,
    "text": "as though muscular action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1230.837,
    "end": 1233.92,
    "text": "A paradigmatic example of mental action is covert attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1235.021,
    "end": 1247.324,
    "text": " So what an interesting topic, you know, the whole think of X or don't think of X. I won't play any language games on the live stream, but many of those exist and they have to do with inducing mental action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1247.844,
    "end": 1252.145,
    "text": "So that's just so interesting that that's what this framework is going to be exploring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1252.165,
    "end": 1254.506,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1255.686,
    "end": 1256.366,
    "text": "Stephen, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1258.007,
    "end": 1258.247,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.267,
    "end": 1263.508,
    "text": "And without, you know, putting too much pressure on the paper to go further, but is it that question of, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.382,
    "end": 1288.393,
    "text": " skill performance and the phenomenology of being in the flow or being in a state of sense making, it'd be interesting how that neurobiological phenomenology, phenomenological passages can extend out into some of that kind of work, which is obviously highly complex, but then, you know, these might give us clues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.413,
    "end": 1289.914,
    "text": "So that's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.819,
    "end": 1291.459,
    "text": " Yep, cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1291.479,
    "end": 1293.84,
    "text": "And then this is just, I found this link.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1294.48,
    "end": 1297.741,
    "text": "Trailblazing ants show hints of metacognition when seeking food.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1298.741,
    "end": 1309.244,
    "text": "And recent research has shown that bees, when faced with a difficult task, simply opt out of doing it, a behavior that may be interpreted as a form of metacognition, at least computationally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1310.239,
    "end": 1315.801,
    "text": " Now it seems that ants might be capable of a similar mental feat despite their tiny, simple brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1316.362,
    "end": 1331.548,
    "text": "So it's like, what computational attributes are we going to assign to, oh, but that's just how bark is, or that's just how ants are versus this variable is the one that we're experiencing because of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1332.779,
    "end": 1361.278,
    "text": " that's just kind of a topic that's going to come up probably multiple times okay how about transparency and opacity what does it mean in someone's words or reading here can i can i bring out a little different angle to this i mean i understand that how the contrast of transparency and opacity works but when i was bringing when i was trying to figure this out to help somebody who was walking into a situation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.29,
    "end": 1367.395,
    "text": " oriented to a lot of the data around them that they would otherwise be overwhelmed with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.475,
    "end": 1383.81,
    "text": "One of the things we talked about was the difference between liminality and just getting a generalized sense of the orientation space and then limitality, sort of filling in the details and getting an understanding where the edges are so that you don't bump into them and hurt yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.471,
    "end": 1389.937,
    "text": " And so I get the transparency and opacity piece and how it's explained in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.538,
    "end": 1396.404,
    "text": "But for a person who's trying to move from the generalized to the more specific, I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.274,
    "end": 1404.4,
    "text": " I think it's the opacity piece speaks clearly to the difference between that and something that's clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1405.0,
    "end": 1419.113,
    "text": "But I also think that the details get filled in when you can have an understanding what the limits are and not just limitlessly understand that it's now in your field of awareness, which is how they're describing this, which is your, where's your focus?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.153,
    "end": 1419.954,
    "text": "Where's your attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1422.099,
    "end": 1443.506,
    "text": " angstine i put this goldfish meme it's the story about the goldfish and what is water and the elder one is aware of water and then the younger ones are unaware of the water that they swim in cough cough and then it's kind of like the two mental extremes like water is opaque you can think of the water being like cloudy to this fish",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1444.406,
    "end": 1445.547,
    "text": " Maybe it has a different vision.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1446.087,
    "end": 1448.348,
    "text": "So then it can see that there's a drop off in vision.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1448.368,
    "end": 1449.869,
    "text": "It infers that it's in opaque water.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1449.889,
    "end": 1452.811,
    "text": "So water is something that it can ask about the conditions of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1453.251,
    "end": 1456.673,
    "text": "Whereas the small fish in this example, it's clear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1456.853,
    "end": 1457.674,
    "text": "It's like transparent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1457.714,
    "end": 1458.494,
    "text": "So they're seeing through it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1459.015,
    "end": 1460.596,
    "text": "Ergo, it's transparent to them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1461.316,
    "end": 1462.337,
    "text": "So they're imperceptible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1462.937,
    "end": 1465.058,
    "text": "So the green ones are accessible to the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1465.118,
    "end": 1465.739,
    "text": "You're aware of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1466.099,
    "end": 1468.58,
    "text": "It's like water that has an opaque tint.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1469.241,
    "end": 1472.983,
    "text": "And then the transparent means like you just can't differentiate it experientially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1474.58,
    "end": 1480.664,
    "text": " And that's a philosophical framework by, I think, Metzinger, which has probably been influential.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1483.565,
    "end": 1483.765,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1484.486,
    "end": 1487.688,
    "text": "Yeah, highly influential, I think, and increasingly so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.409,
    "end": 1498.454,
    "text": "I think this could be pushed a bit further because I think it's okay to state this as almost a philosophical piece, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.95,
    "end": 1523.808,
    "text": " bringing in stuff like mental space psychology which hasn't really been incorporated in this area but you know these subconscious um sort of opaque or transparent um awarenesses um are um part of our could be part of a deeper way of knowing if we assume that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.787,
    "end": 1543.887,
    "text": " thinking is through our senses if sense if actually the process of the brain is not all in the box but it's recapitulating stuff through the sensory world around us even in the subconscious that would tie in quite well with this but also give a bit more of a computational grounding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.001,
    "end": 1560.96,
    "text": " The other thing too, Daniel, if you'd have written the words opaque and transparent in a white-colored font with that white background, they'd still be opaque, but we wouldn't see them on the white background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.561,
    "end": 1562.903,
    "text": "And so that's, again, where...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1564.039,
    "end": 1564.319,
    "text": " Nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1564.459,
    "end": 1564.9,
    "text": "Good call.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1564.98,
    "end": 1574.287,
    "text": "In order to be able to bring the idea forward, it isn't just a comparison of transparency to something that actually has a sense of tangibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.347,
    "end": 1580.832,
    "text": "There's this other part of it that we'll pick it up because there is a contrast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.872,
    "end": 1582.933,
    "text": "There is some differentiation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1583.253,
    "end": 1588.157,
    "text": "It doesn't always just have to be that something's clear and something has depth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1590.138,
    "end": 1590.799,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1592.225,
    "end": 1593.746,
    "text": " Yeah, that's a really good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.806,
    "end": 1596.989,
    "text": "And actually that can extend as well to the size of the space you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.469,
    "end": 1609.759,
    "text": "So if you start to imagine the relationships or these kind of subconscious senses of how close or far certain ideas are, that changes depending on the size of the actual room you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.28,
    "end": 1620.228,
    "text": "And I imagine the different colours of the room, the lighting in the room as well might affect, I haven't really thought about this before, it might affect the transparent states as well because there may be some sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.237,
    "end": 1641.273,
    "text": " calibration going on you know so it might be quite profound to be in a blue room in terms of what your transparent states end up recapitulating so that's interesting we'll come back to i think a niche modification and design of regime of attention who made this slide or what did it mean to anyone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.486,
    "end": 1643.406,
    "text": " So this was mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.767,
    "end": 1647.707,
    "text": "The focused action I thought was like an interesting keyword.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.887,
    "end": 1650.808,
    "text": "The authors didn't use it once if you search the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.288,
    "end": 1658.49,
    "text": "And then as a Google search, you search for focused action and you get all kinds of life coaching, which is like, whoa, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.81,
    "end": 1660.871,
    "text": "I don't think that that's maybe the intention here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.971,
    "end": 1662.151,
    "text": "So this is just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.731,
    "end": 1672.938,
    "text": " the typical active inference loop where you have internal states, perception, external states, and action that are all connected and partitioned by a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.698,
    "end": 1677.661,
    "text": "So I'm extrapolating based on what I think that the authors mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.202,
    "end": 1682.705,
    "text": " Here, low precision is unfocused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.865,
    "end": 1686.308,
    "text": "And it's low precision also in terms of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.328,
    "end": 1690.491,
    "text": "Because perception is also when you register, you just saw something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.511,
    "end": 1691.632,
    "text": "They talked about the oddball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.992,
    "end": 1694.674,
    "text": "And you're seeing an image, seeing an image, seeing an image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.715,
    "end": 1696.116,
    "text": "And then all of a sudden, the image is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.416,
    "end": 1698.758,
    "text": "And it's like, oh, I wasn't even paying attention to what I was seeing at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.438,
    "end": 1703.622,
    "text": " So it's that perception can also have this kind of unfocused quality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.023,
    "end": 1715.594,
    "text": "So I related this to like a low precision kind of perception or action as unfocused and where it's high precision, where you're focused on what you should be focused on, that's focused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.852,
    "end": 1717.152,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1717.412,
    "end": 1733.103,
    "text": "Just one note on that is under the reward paradigm, plus minus valence, avoid approach, a sort of forward and backward linear mindset, we can say, oh, well, not just do we diagnose happiness or sadness or on a linear scale, but it's a goal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1733.804,
    "end": 1741.589,
    "text": "And so just what are the aspects of our experience or of just the outcomes of systems that can be said to be related to focus and attention and action?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1742.089,
    "end": 1745.932,
    "text": "So how about just mind wandering since it's a related topic?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1747.689,
    "end": 1752.936,
    "text": " Sure, this is, so here, these are different papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.016,
    "end": 1762.189,
    "text": "And so mind wandering has been explored in several different contexts, but specifically like the figure on the left is by Wanda Huck,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.331,
    "end": 1779.098,
    "text": " Hasselkamp and she studies she's at the mind-life Institute so studies directly meditation and the effects on the brain and here it just kind of shows the different brain regions that are activated during meditation or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.938,
    "end": 1783.383,
    "text": " Also, it's like where you have awareness and then your mind is wandering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.403,
    "end": 1792.214,
    "text": "You become aware that your mind is wandering and then you shift your mindset back to like, oh, I better be paying attention to my meditation, for example, focusing on my breath or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.574,
    "end": 1794.877,
    "text": "And then you have a state of focus again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.618,
    "end": 1802.482,
    "text": " And this kind of contrasting neural model of mind wandering, this is a 2016 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.003,
    "end": 1806.225,
    "text": "And here, they discuss this in a very different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.645,
    "end": 1811.208,
    "text": "So when I think about mind wandering, it's easy to think about in the context of meditation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.688,
    "end": 1816.371,
    "text": "But here, they describe like, okay, if you're focused on a task, that's on task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.111,
    "end": 1838.03,
    "text": " and then mind wandering is actually pursuit of internal goals which i thought was interesting like you're still focused but you're focused on your shopping list or whatever like internal thing that you're you want to focus on even though you're like this is like mind wandering and then they call this off focus",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.79,
    "end": 1846.755,
    "text": " is epistemic exploration, or this is like the exploratory, like where your mind, what I think of as mind wandering, they call this off focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.815,
    "end": 1857.242,
    "text": "And so I thought that that was kind of a different paradigm and not something that I'm used to hearing, like where you're just, where you catch yourself, like, why was I thinking about red balloons and frogs with three legs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.282,
    "end": 1861.565,
    "text": "Like where you just find yourself in this intellectual state, like, what am I thinking about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.605,
    "end": 1862.506,
    "text": "Or why was I even thinking that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.766,
    "end": 1865.168,
    "text": "Whereas mind wandering is like, you really are thinking about like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.009,
    "end": 1871.829,
    "text": " something else that's like you should be thinking about, but it's not exploratory, which I thought was kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.148,
    "end": 1873.408,
    "text": " Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1873.428,
    "end": 1880.055,
    "text": "The things I'd say about that on the bottom right, first, it doesn't look like there's a transition from the bottom left to the bottom right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1880.075,
    "end": 1893.327,
    "text": "So it could just be that the dynamics, the attractor dynamics of this dynamical system are such that when you just down project these massive data sets of neuroimaging, you get certain transition dynamics, which is totally the case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1893.367,
    "end": 1896.91,
    "text": "Like you're sleepy before you fall asleep and then different people",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1897.671,
    "end": 1925.44,
    "text": " accelerate or have different dynamics but there is kind of a trajectory um so that was one point was these could be very nuanced states and then the space and the transitions that exist or don't can be important and the second thing is that the y-axis has to do with some neuroactivity some neuro marker where it's low in the bottom two and high in the middle one but then the x-axis is behavioral results so the idea would be that there might be some correlation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1926.3,
    "end": 1929.682,
    "text": " between like, wow, it was like they did 30 seconds of really good task.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1930.223,
    "end": 1934.246,
    "text": "And then there was 15 seconds where they totally didn't do the task or it was variable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1934.766,
    "end": 1947.675,
    "text": "And then if you found a neural change that was like immediately preceding that or after it or during it, that's the kind of cross data set connections that this research is getting towards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1948.215,
    "end": 1952.779,
    "text": "But instead of just putting this into the broad framework of dynamical systems and statistics,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1953.829,
    "end": 1959.396,
    "text": " Now we have a process theory like active inference to explore some of the dynamics that give rise to those patterns.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1959.797,
    "end": 1961.139,
    "text": "So blue and then D.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1962.839,
    "end": 1964.901,
    "text": " So interestingly, there is a correspondence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.521,
    "end": 1967.803,
    "text": "So it does map what was found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.884,
    "end": 1970.266,
    "text": "And I had to read into the paper to kind of find this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.586,
    "end": 1975.61,
    "text": "But the mind wandering in the left image does map actually to the mind wandering in the image on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.111,
    "end": 1978.173,
    "text": "Or the brain regions are super similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.573,
    "end": 1981.475,
    "text": "So I read to just make sure that there was some cohesion there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.616,
    "end": 1982.076,
    "text": "And there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.136,
    "end": 1985.419,
    "text": "So it's interesting to me to think about this off task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.28,
    "end": 1988.822,
    "text": "What is off task versus mind wandering?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.882,
    "end": 1989.523,
    "text": "And what...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.383,
    "end": 1994.266,
    "text": " For me, if you're meditating and you're not focused on the thing, you're off task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.286,
    "end": 1995.927,
    "text": "But it's, I don't know, super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.148,
    "end": 1999.37,
    "text": "I just wanted to clarify that one point, though, that there is a cohesion there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.11,
    "end": 2000.631,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2000.991,
    "end": 2001.251,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.032,
    "end": 2009.337,
    "text": "Yeah, I used to have to work with people who were at a real... I got to be polite because I'm being recorded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.377,
    "end": 2011.219,
    "text": "They had a real joy out of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.843,
    "end": 2015.465,
    "text": " looking at time on task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2015.785,
    "end": 2019.929,
    "text": "This was something that they found really, really important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2019.949,
    "end": 2031.04,
    "text": "And so if you were task designing, you were supposed to be able to create something in your design scheme that would keep people focused all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.5,
    "end": 2032.821,
    "text": "And in the meantime, there's a whole bunch of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.542,
    "end": 2047.714,
    "text": " interesting papers that have come out in terms of creativity and tangential thinking and mind wandering as an actual gift for taking what's in the task and making it your own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.054,
    "end": 2056.081,
    "text": "Like if you're mind wandering, you're not, it's not a disconnected thought that you're having unless you're really being distracted by something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.153,
    "end": 2062.917,
    "text": " the video game or the music or whatever, it's usually something tangential to the task at hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.957,
    "end": 2066.119,
    "text": "And it's essentially an embodying exercise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.179,
    "end": 2082.829,
    "text": "So I think this is good stuff just because I think lots of times mind wandering, if you're focused on how many minutes was a person focused or concentrated is seen as a negative when from creative stance, it's a really important thing to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.65,
    "end": 2085.23,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2085.45,
    "end": 2086.291,
    "text": "And then Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2088.283,
    "end": 2101.26,
    "text": " Yeah, I think it's useful to see a transition, some sort of transition state between the regime of attention where you're on task and a regime of attention where you're mind-wandering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.981,
    "end": 2103.543,
    "text": "So I think that opens up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.526,
    "end": 2118.879,
    "text": " um questions of how things you know liminal spaces between states and um the need to like if you're always coming back on task yeah it would and you're not getting beyond that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.86,
    "end": 2144.771,
    "text": " state of losing focus um and that that could be a problem I mean it could be a problem with the mind wandering doesn't get back on task as well I suppose but uh so I think that's um that that would that would make a lot of sense I think nice how about um mindfulness so just the yellow part and then blue or anyone can give a thought on what they added um or um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.239,
    "end": 2164.829,
    "text": " Mindfulness, for the purpose of this work, they're going to focus on regulatory cognitive control strategies in which an agent seeks to control their mental states by becoming aware of the state as a cognitive process, as opposed to regulation strategies where one remains engrossed in the contents of the state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2166.155,
    "end": 2175.502,
    "text": " This style of regulation is central in mindfulness related intervention where patients learn to change their relation to thoughts and emotions rather than change the thoughts and emotions themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2176.202,
    "end": 2177.463,
    "text": "So this is pretty interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2177.523,
    "end": 2180.626,
    "text": "So becoming aware of the state as a cognitive process is like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2181.306,
    "end": 2183.166,
    "text": " this is a thought, I'm having a thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2183.766,
    "end": 2191.788,
    "text": "There's many, many praxis, many knowledge traditions built around this, which you can mention or have people with experience talk about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2192.608,
    "end": 2201.85,
    "text": "And the alternative is like, when you feel X, feel the X and be the X. That's sort of the opposite cue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2202.43,
    "end": 2208.771,
    "text": "So we're thinking like mental action, cues for action, like cues for a sport, Dean's favorite topic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2209.631,
    "end": 2216.193,
    "text": " And then there's cues for mental action that are verbal or have other modes of being delivered.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2216.633,
    "end": 2222.675,
    "text": "And what are the cues for mental action that leads to different regimes of attention, like Stephen said?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2222.695,
    "end": 2231.317,
    "text": "And then how are the measurements that we're going to make from different modalities going to inform that study and the kind of modeling that integrates across them, which we'll get to as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2231.497,
    "end": 2231.737,
    "text": "Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.499,
    "end": 2235.96,
    "text": " Yeah, this is a useful piece here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.98,
    "end": 2242.121,
    "text": "It's good to distinguish between, I mean, often children, for instance, there's now more emphasis on mindfulness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.661,
    "end": 2247.583,
    "text": "There's that big push to just get them busy, you know, make them do sports, make them do this, make them do the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.603,
    "end": 2256.225,
    "text": "So they're so busy with something they can't think about anything else, but actually saying to them, okay, you're going to be in a space where you could think of other things and you're going to work on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.182,
    "end": 2261.504,
    "text": " how to not focus on other things has some benefits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.544,
    "end": 2269.429,
    "text": "I think there's some slight downsides of that if someone's got trauma, because then it opens up the space for those things to be coming into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.949,
    "end": 2273.791,
    "text": "So I suppose, I think this is really helpful to see where they're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.811,
    "end": 2275.172,
    "text": "And it'll be interesting to know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.252,
    "end": 2303.865,
    "text": " um how this plays out because there's always a danger if someone tries to scale this type of work because it's it's also easier to use the insights from this type of work to try and capture someone's attention at scale or capture many people's attention by using some of the levers here as much as it is for the person on the inside to be able to resist all the distractions and the the flashes of light that they keep getting exposed to in their daily life thanks steven blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.27,
    "end": 2307.811,
    "text": " Yeah, kind of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.891,
    "end": 2310.353,
    "text": "I want to just follow what Stephen said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.453,
    "end": 2328.112,
    "text": "So I don't know that the children or even like us adults being constantly exposed to flashing blue light, like the smartphone, like instant dopamine addiction, you know, fulfillment thing is necessarily the opposite of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.154,
    "end": 2344.551,
    "text": " Mindfulness, I think that that filling is maybe the elimination of boredom, which you can have mindfulness with boredom or mindfulness while doing nothing and mindfulness while not doing nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.091,
    "end": 2355.554,
    "text": " So you can have actually not sitting in mindfulness meditation, but retain through, this is called like meditation practice, the meditation off the mat, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.574,
    "end": 2362.877,
    "text": "So like there's the conscious placement of the mind during the meditation session, but then when it's over, you carry that into your daily life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.297,
    "end": 2366.599,
    "text": " by constantly asking yourself, where is your mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.619,
    "end": 2370.502,
    "text": "That's the image I put in about the old Pixie song, where is my mind?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.343,
    "end": 2373.784,
    "text": "So there is the ability to carry mindfulness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.944,
    "end": 2380.789,
    "text": "Even if you're very busy, you can still practice mindfulness in your daily life without taking time to sit on the cushion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.829,
    "end": 2389.335,
    "text": "So I think we are starving our children of boredom, which maybe is, I'm more focused on or more worried about a lack of creativity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.795,
    "end": 2399.897,
    "text": " Because I think that that boredom process where your mind is really wandering to red balloons and frogs with three legs, that is where the creative nature tends to bubble up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.137,
    "end": 2401.437,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2401.657,
    "end": 2405.038,
    "text": "And I won't mention the person's name, but I hope that they've emailed us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2405.698,
    "end": 2407.458,
    "text": "They have emailed us, so I hope they talk more about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2407.538,
    "end": 2417.8,
    "text": "But they've related these aspects of active inference to the yoga of action, karma yoga, and basically the way that action exists in the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2418.24,
    "end": 2418.56,
    "text": "So I hope...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2419.804,
    "end": 2421.505,
    "text": " not what my knowledge area is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2421.545,
    "end": 2423.226,
    "text": "So I look forward to learning about that though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2424.306,
    "end": 2429.389,
    "text": "So before we jump into the paper, this has been a nice long background because there's a lot to say and it's pretty interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2430.03,
    "end": 2436.033,
    "text": "Look at this fun April 1st, April Fool's Day with Steven and Blue and I.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2437.814,
    "end": 2449.241,
    "text": " But they write in this paper that the key technical innovation presented in the paper is an extension of the active inference framework derived from the work of Hesp et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2449.261,
    "end": 2452.884,
    "text": "2021, which was the paper that we discussed in live stream number 19.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2454.085,
    "end": 2460.649,
    "text": "So if you want kind of the kernel of what this discussion is about, then check out number 19.0 and 0.1 and 0.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.709,
    "end": 2462.03,
    "text": "And we were talking then about affect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2466.993,
    "end": 2491.123,
    "text": " and about the way that that made deep agents so listen there to learn more and now we're going to be doing a few of the similar things seeing some similar figures so it's a good background listen okay figure one does anyone want to give a first description it says in the caption a probabilistic graphical model showing a basic generative model for moment-to-moment perception",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2497.304,
    "end": 2504.446,
    "text": " Okay, so the observation O is going to be used across different layers, but here is the model of perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.746,
    "end": 2513.668,
    "text": "So we can debate whether it's realism or not later, but this is kind of like the retina or the sensor of the camera O. It's like, did a photon hit it or not?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2513.728,
    "end": 2515.789,
    "text": "This is an observable that you measure with a sensor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2517.428,
    "end": 2537.082,
    "text": " s at each level is going to be a hidden state so-called because it's not directly observed but it's inferred from observations through a which is a mapping so like this could be day and night and this could be photon hitting versus no photon hitting and then you can imagine the mapping there",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2537.762,
    "end": 2540.224,
    "text": " But we'll see how they nest and get more complex than that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2540.904,
    "end": 2542.645,
    "text": "And then D is the initiator.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2543.166,
    "end": 2559.917,
    "text": "It's a prior over hidden states, which turns out to be important because as you compute the likelihood of different hidden states being the case, moment to moment or through time, you need to start with an idea of essentially how likely certain states are and how closely they map to observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2560.797,
    "end": 2565.721,
    "text": "That's the kernel of the Bayesian modeling that we're going to elaborate a lot",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2566.701,
    "end": 2568.543,
    "text": " like multiple successive times.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2569.103,
    "end": 2579.173,
    "text": "But this is the underlying system that can be thought of like photons hitting the receptor and a mapping to underlying states as influenced at least initially by a prior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2579.994,
    "end": 2581.295,
    "text": "Okay, any comments on one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2581.696,
    "end": 2583.938,
    "text": "Or we can go to the next generalization in two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2588.723,
    "end": 2613.004,
    "text": " okay so two is a base graph showing a basic generative model of perception with precision so it has the same terms and you know dsao as above dsao but now there's a new node and each shape just at a first pass represents some value that can be taken by a variable",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2613.922,
    "end": 2618.366,
    "text": " And then an edge that connects two states is like a relationship between them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2618.707,
    "end": 2625.393,
    "text": "And there's different kinds of nodes and there's different kinds of edges slightly in how they influence each other, but they just mean that they influence each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2625.413,
    "end": 2628.776,
    "text": "And that's important because the edges actually in the grand scheme are very sparse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2629.437,
    "end": 2630.858,
    "text": "It's not an all by all model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2631.379,
    "end": 2638.846,
    "text": "So this model is extremely more tractable to compute than like an all by all matrix of just estimating the coefficients of how related terms are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2639.406,
    "end": 2642.27,
    "text": " So it's a very constrained model space, but it still describes a lot of system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2642.81,
    "end": 2651.161,
    "text": "And the second figure adds in this gamma sub A, which is the precision, which is one over the uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2651.522,
    "end": 2654.405,
    "text": "So just as we had talked about those being two sides of the coin earlier,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2655.583,
    "end": 2659.805,
    "text": " This is like uncertainty slash precision, depending on which way you want to think about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2660.306,
    "end": 2667.269,
    "text": "High uncertainty, you're really unsure, that's low precision and vice versa, but it still maps onto the sensory outcome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2668.09,
    "end": 2671.672,
    "text": "In both these cases, after the sensory outcome occurs,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2672.572,
    "end": 2696.398,
    "text": " then there's uh an update the prior becomes the posterior after getting a precision weighted updating and that's just how bayesian updating works so this is a bayesian scheme for updating that initially doesn't include a precision on the a and now it does include a precision on the a any thoughts on two before three",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2697.785,
    "end": 2699.066,
    "text": " Yeah, I think it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.086,
    "end": 2706.509,
    "text": "It's good to know that the expected precision is tied to the likelihood mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.709,
    "end": 2710.331,
    "text": "It doesn't try and tie itself directly to the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.471,
    "end": 2719.275,
    "text": "It's in the way that the state is being... So that helps to really notice that and make that clear because that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.182,
    "end": 2722.363,
    "text": " gives the logic a little bit more of clarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.584,
    "end": 2727.066,
    "text": "I think that's often a bit that's not teased out as often as it has been here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.086,
    "end": 2727.847,
    "text": "That's quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.367,
    "end": 2728.707,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.928,
    "end": 2729.228,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2729.308,
    "end": 2730.609,
    "text": "And what else is interesting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2730.689,
    "end": 2735.312,
    "text": "So good observation that the uncertainty is connected only to the mapping.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2736.232,
    "end": 2738.093,
    "text": "So it's not uncertainty about the state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2738.134,
    "end": 2739.935,
    "text": "It's about the mapping in this formulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2741.385,
    "end": 2752.689,
    "text": " Now we're going to see a similar move and two things happen in figure three to bring that previous model into this kind of twice generalized space of generative models of action and perception.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2753.269,
    "end": 2758.491,
    "text": "The first thing is that now there's observations through time versus at a moment with just one observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2758.671,
    "end": 2761.772,
    "text": "So subscript one, two, three, through time, three time steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2762.732,
    "end": 2766.053,
    "text": "Then here's that DSAO stack.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2766.633,
    "end": 2770.975,
    "text": "And then B is the transition matrix between states through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2772.506,
    "end": 2774.587,
    "text": " So we've talked about that on other streams before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2775.227,
    "end": 2788.812,
    "text": "And then again, a similar move, just like you pointed out, Steven, how the uncertainty or like the intervention in this case, the policy pie, it's actually modulating the transition mappings rather than the states themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2789.473,
    "end": 2789.613,
    "text": "So,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2790.293,
    "end": 2795.134,
    "text": " I'm sure that has very interesting computational properties that I don't know the details of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2795.654,
    "end": 2804.137,
    "text": "But I think that's some components that make it amenable perhaps to message passing or to the variational inference methods.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2804.577,
    "end": 2807.938,
    "text": "But that's definitely an interesting observation that you made.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2807.998,
    "end": 2808.538,
    "text": "It's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2808.638,
    "end": 2810.338,
    "text": "It happens again here in a totally different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2810.918,
    "end": 2812.619,
    "text": "And then pi, the policy selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2813.895,
    "end": 2834.909,
    "text": " is influenced by preferences which play into the calculation as expected free energy as well as this baseline prior e so we've seen this one before and this is how policies are selected over um for the next time step based upon the um expectations of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2835.854,
    "end": 2854.368,
    "text": " hidden states and observations through time in relationship to priors, e, how they're apt to perform before starting this sequence of events, and then the way that they calculate their preferences over observation states, which also relates to how you said the body-centric inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2858.041,
    "end": 2866.487,
    "text": " This might be a question, Daniel, for them, but it says preferences over outcomes, and it goes into the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.527,
    "end": 2878.415,
    "text": "Is that almost like different ways you could weight the way the expected free energy terms are presented, you know, over maybe Hamilton's least action versus...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.591,
    "end": 2883.713,
    "text": " resolving, you know, would they be doing something like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.833,
    "end": 2886.854,
    "text": "I'm not sure we can answer that, but does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.094,
    "end": 2888.995,
    "text": "It's a preference for sensory states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2889.856,
    "end": 2897.279,
    "text": "And then we saw in the model stream one with Ryan Smith, like if you wanted to have a very weak preference in the matrix, it would be like one versus 1.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2897.439,
    "end": 2900.82,
    "text": "I'm just making those numbers up, but the point is like they're relatively close.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2901.341,
    "end": 2905.402,
    "text": "It's like a 60-40 election so that the preference is very weak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2906.623,
    "end": 2907.923,
    "text": "And then you could also set it up to 100 versus one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2909.304,
    "end": 2937.253,
    "text": " then if you think about that like when you're just totally thirsty and you're willing to engage in all kinds of actions that's how you could computationally put in direction as well as magnitude of preferences over outcome some people that describes you know maybe some individuals have a broad sensory tolerance others have a narrow sensory tolerance or preference so that's so you got you so it's almost like you can you can narrow you can either open up or narrow down",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2938.538,
    "end": 2943.3,
    "text": " the amounts of options that are going to be available by saying the gap here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.76,
    "end": 2949.583,
    "text": "And then in the absence of preference, if you don't have a preference for pheromone, it's just going to be a diffusion walk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2950.683,
    "end": 2954.345,
    "text": "So that's how preference plays into the decision-making, but also other pieces do too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2955.225,
    "end": 2955.425,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2956.005,
    "end": 2967.15,
    "text": "So then here, here's where we introduce this second nested layer with the deep generative model of mental action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2968.308,
    "end": 2977.937,
    "text": " So here the same DSAO is recapitulated from the orange, but then the O is split into two nodes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2978.898,
    "end": 2985.804,
    "text": "One is an estimate of the state, but also it's passing or connecting to the precision, the uncertainty.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2986.845,
    "end": 2990.629,
    "text": "So the features that were being discussed like up until figure three,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2992.276,
    "end": 2999.679,
    "text": " as being just part of how the inference was performed are now still doing the same exact role.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3000.319,
    "end": 3010.764,
    "text": "They're just being emitted by the state through the A, S sub one of two, like the second level in parentheses, through the A matrix at the second level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3011.224,
    "end": 3013.345,
    "text": "And then that's resulting in these two outputs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3014.045,
    "end": 3021.248,
    "text": "So this could be like a nested layer of thinking or a nested layer of concurrent programming or a nested layer of formality, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3024.729,
    "end": 3028.771,
    "text": " I'm going to get the author to make sure that I'm getting this right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.772,
    "end": 3035.234,
    "text": "But before, something I remember from what Casper talked about with his effective piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3035.935,
    "end": 3037.775,
    "text": "And then there's a figure five, which we'll get to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.815,
    "end": 3038.396,
    "text": "But to me...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.639,
    "end": 3044.222,
    "text": " The figures one, two, and three aspect of this are the unplannable parts of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.242,
    "end": 3050.485,
    "text": "The figure four does ask the question, why am I, or yes, why am I trying to pay attention to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.906,
    "end": 3052.507,
    "text": "It's kind of the transition space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.887,
    "end": 3059.491,
    "text": "And then the figure five is where we could actually do some planning because we're saying to ourselves, now pay attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3060.213,
    "end": 3066.035,
    "text": " because we're putting that second order, we're paying ideas to ideas piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.275,
    "end": 3074.577,
    "text": "So I think up until this point, up until figure four, it was unplannable what we're modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.057,
    "end": 3084.0,
    "text": "At figure four, we start to transition, and then in figure five, we can actually incorporate a plan if we so choose, if that's part of our policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.031,
    "end": 3089.273,
    "text": " Nice point, these are really helpful labels, like pie at the first level, what am I trying to do?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3089.954,
    "end": 3094.937,
    "text": "So in the case of the light hitting the receptor and then is it day or night?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3095.417,
    "end": 3103.461,
    "text": "When we introduce policy, that would be like, should I swivel the cart, move my sunflower head left or right, move my camera left or right under the preference for light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3104.122,
    "end": 3106.283,
    "text": "Now, if you didn't have preference, it wouldn't matter, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3106.343,
    "end": 3108.664,
    "text": "If you don't know where you're going, it doesn't matter where you go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3109.245,
    "end": 3112.667,
    "text": "But if you have a preference vector that gets increasingly stringent, you're gonna pursue",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3113.647,
    "end": 3128.835,
    "text": " those policies that will lead to getting the observations that are in line with your preference now here the second level so this is again what am i perceiving what am i trying to do that's the motor cart with a visual receptor and then here the hidden state",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3129.926,
    "end": 3134.408,
    "text": " And again, it's just the same exact placement analogously the first layer is what am I paying attention to?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3135.049,
    "end": 3137.25,
    "text": "And the policy is a policy over attentions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3138.19,
    "end": 3145.114,
    "text": "So that's what makes this model nesting outside of the smaller perceptual level model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3145.354,
    "end": 3146.794,
    "text": "So Blue, did you wanna say something or no?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3146.814,
    "end": 3148.515,
    "text": "Okay, then Steven, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3152.497,
    "end": 3155.479,
    "text": "So it's treating the precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.335,
    "end": 3166.217,
    "text": " And it's somehow merging that with the states and pushing that through another matrix and probably doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.257,
    "end": 3170.418,
    "text": "I know Ryan Smith talks about a cycle of six in terms of when they model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.478,
    "end": 3172.179,
    "text": "They go through six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.539,
    "end": 3173.839,
    "text": "It will iterate through six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.939,
    "end": 3183.822,
    "text": "And then the next level will just sample the sixth, the sixth, the sixth, the sixth data point, so to speak, in the faster data going below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.302,
    "end": 3192.83,
    "text": " But I'm not sure how does that work with the two being combined?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.311,
    "end": 3199.718,
    "text": "The two are combined basically to give you the higher O2, is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.393,
    "end": 3214.801,
    "text": " So I don't know about the six specifically, but here you can see like at the first time point of the slower model, this is like the hour hand, there's like the estimation or inference over states one, two, and three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3215.945,
    "end": 3237.367,
    "text": " everything about them like what's the hidden state and the mapping and the observation which you can then conditionalize the inference on a subset of those variables but that's what the whole model is and then then it's like you're estimating at time one about time one two and three and then at time two you're also estimating over that trajectory but the slower hand is like the hour hand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3238.308,
    "end": 3239.148,
    "text": " Okay, continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3239.968,
    "end": 3242.069,
    "text": "Because I think this is where five is where you're getting at, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3242.109,
    "end": 3243.489,
    "text": "It's totally the contribution of the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3243.97,
    "end": 3250.751,
    "text": "So they summarize as saying that they make three, and this is, the 19 has sped all for a lot of this structure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3251.652,
    "end": 3257.173,
    "text": "They summarize that they make three novel contributions to parametrically deep active inference models of cognitive control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3257.993,
    "end": 3260.114,
    "text": "The first contribution is to stipulatively",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3261.26,
    "end": 3267.183,
    "text": " define attentional and meta-awareness states as the mechanism of opacity control at different hierarchical levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3268.083,
    "end": 3275.086,
    "text": "The second is to provide a formal definition of attentional and meta-awareness control via an account of higher level policy selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3275.947,
    "end": 3282.89,
    "text": "The third is to formally demonstrate the relationship between meta-awareness states and the capacity for deliberate attentional control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3284.07,
    "end": 3290.551,
    "text": " we're gonna look at the model in figure five, and that's still gonna be like sort of the abstract skeleton of the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3291.092,
    "end": 3293.532,
    "text": "And then there's gonna be a simulation results.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3294.172,
    "end": 3299.534,
    "text": "So that was kind of all the background actually to their primary contribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3300.394,
    "end": 3305.655,
    "text": "Now in figure five, we see this explicitly three layer model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3307.188,
    "end": 3325.719,
    "text": " and this is the primary contribution is this model topology and architecture and then the interpretation of the higher order states in terms of the opacity transparency and then eventually a more generalized perspective on mental action",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3326.855,
    "end": 3350.084,
    "text": " and bring this all together with a model that does basically the same trick around the second layer as happened around the first layer so these layer one and layer two are the exact same from figure four and now there's this third green layer where the states are asking the unobservable question how aware of my how aware am i of where my attention is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3352.06,
    "end": 3373.085,
    "text": " then the policy question is am i trying to maintain awareness of my attentional state or something like that we can get at what exact wording these parameters map onto but totally interesting tape and structure of the model in question so any thoughts or what was exciting to people about figure five stephen and then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3375.089,
    "end": 3377.47,
    "text": " Yeah, it's exciting to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.49,
    "end": 3382.593,
    "text": "It's got some similarities to the valence, the deeply felt effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.673,
    "end": 3388.756,
    "text": "Valence has been a higher level sort of calibration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.776,
    "end": 3394.88,
    "text": "I suppose in a way they might try and find a way to put those two together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.14,
    "end": 3400.242,
    "text": "When you say I'm aware of where my attention is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.701,
    "end": 3403.822,
    "text": " Well, what kind of awareness is that awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.882,
    "end": 3405.403,
    "text": "Is it a feeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.844,
    "end": 3408.665,
    "text": "It feels good or is it something else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.705,
    "end": 3411.246,
    "text": "So, yeah, nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.067,
    "end": 3414.428,
    "text": "Dean or Blue, otherwise we can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3415.549,
    "end": 3416.929,
    "text": "I just want to say a couple of quick things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3416.949,
    "end": 3428.395,
    "text": "So the way that they laid the paper out, this made a really good case for why they were focusing on the transparency and the opacity piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.536,
    "end": 3430.997,
    "text": "And they don't make any claims around whether or not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.301,
    "end": 3461.307,
    "text": " person who's looking at a white page with white text written on it can actually see that white text or whether or not the size of the font is so large that you're only seeing one pixel in the letter A on that page so you can't even see the A but I think both of those things matter when we're talking about attention as well how can you pay attention to something where you can't see the contrast or how can you pay attention to something where the proportions are so out of whack that they just don't make any sense to you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.747,
    "end": 3474.71,
    "text": " Now I know they're not talking about that here, but it would seem to me that that would also be a part of where this computational piece would be really, really helpful because to a learner, sometimes it's easy to see the tunnel within the mountain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3475.29,
    "end": 3482.292,
    "text": "Sometimes it's really, really hard to be able to pick something up off the page when it's either way out of proportion or there isn't any contrast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3482.892,
    "end": 3489.194,
    "text": "So I just wanted to kind of, I want to, I want to give the authors credit and I think, I hope, I think I know where they're going next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3491.567,
    "end": 3491.807,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3491.847,
    "end": 3492.087,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3492.848,
    "end": 3493.128,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3494.568,
    "end": 3500.811,
    "text": "Let's go into the little one cul-de-sac of the formalities that is kind of interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3501.311,
    "end": 3512.856,
    "text": "And then we can also ask the authors to explain a little bit more to us, but just to get at how does this S state sub T so through time across time points at the second level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3513.336,
    "end": 3516.597,
    "text": "So that's going to be what we're focused on is how this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3517.998,
    "end": 3538.661,
    "text": " is kind of at the intersection of perhaps you could even say the bottom up and the top down signaling or at the very least it's at sort of a um you know mid-level street in the scale of streets of variables from local neighborhoods like down here in the bottom cluster to sort of regional hubs to this broader",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3539.582,
    "end": 3569.202,
    "text": " connection that is happening at an even slower or deeper time scalar way we're kind of looking at this middle piece as a as perhaps an example of again how factors from bottom up and top down interact and then it's kind of like legos maybe it can be generalized from there and you can say okay let's nest this within that or see what happens if you connect over here but they write mathematically the attentional and meta awareness state inference is calculated based upon three sources of evidence",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3570.629,
    "end": 3592.107,
    "text": " read prior beliefs so this is the B and the S at layer two so those are um like what is previously influencing that layer specifically so that's what happened before at that layer direct perceptual evidence e.g the metacognitive observation of one's attentional state blue",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3593.683,
    "end": 3598.791,
    "text": " And then orange, ascending evidence based on the precision beliefs of the level below.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3598.811,
    "end": 3600.253,
    "text": "So maybe that's where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3601.721,
    "end": 3616.667,
    "text": " If you just opened your eyes in the morning and it was too bright and you don't have the resolution, now you can't make the good mapping between fine-grained details because your resolution from a sensory perspective, like the precision is adapted for a different regime of environmental regularities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3617.248,
    "end": 3619.329,
    "text": "So there's perhaps many ways to model this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3620.029,
    "end": 3623.29,
    "text": "So then they say something that was kind of interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3623.77,
    "end": 3629.093,
    "text": "For the ascending messages from the continuous expected precision to the discrete states,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3630.046,
    "end": 3632.355,
    "text": " we use Bayesian model reduction,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3633.712,
    "end": 3639.954,
    "text": " for the derivation C frist in 2018 to evaluate the marginal likelihood under the priors associated with each higher level state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3640.894,
    "end": 3646.956,
    "text": "This gives in the case of the attentional evidence, for example, and then the equation that has these components that were here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3647.016,
    "end": 3660.181,
    "text": "So it sounds probably extremely technical, but it's a pretty interesting topic that we'll look at just in another slide, because it is really important to understand how this bottom-up continuous info becomes translated to discreetly different states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3661.221,
    "end": 3674.731,
    "text": " And then this is just to note that this is like the general structure of the model, which you could imagine is also computer variables, but then they preset two mental states associated with just specific parameters that they chose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3675.412,
    "end": 3680.196,
    "text": "So especially the simulation is just like a parameter combination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3680.556,
    "end": 3683.138,
    "text": "It's not all the possible dimensions one could explore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3683.398,
    "end": 3684.759,
    "text": "So that was just to note.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3685.46,
    "end": 3688.222,
    "text": "So here's, oh yeah, Steven, go for it before we go to model reduction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3689.033,
    "end": 3692.0,
    "text": " I think this is helpful to think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.191,
    "end": 3695.812,
    "text": " how that top level has that impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.832,
    "end": 3703.797,
    "text": "So you can imagine, you know, you wake up sometimes, say you're at home and you wake up and it's just, and slowly you just, you see the room you expect to see, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.177,
    "end": 3715.344,
    "text": "And there's the other times when you wake up and you've gone away and there's that jolt because the prior expectations were still locked into like, you're dreaming about waking up at home or you're sort of, but you're not at home, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.365,
    "end": 3715.765,
    "text": "And there's that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.225,
    "end": 3719.067,
    "text": "So it's almost like you're fulfilling your expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.087,
    "end": 3721.749,
    "text": "These higher level could just start to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.864,
    "end": 3727.065,
    "text": " percolate out as you enter into certain states or into certain rooms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.765,
    "end": 3733.967,
    "text": "So I think that's quite a nice way of thinking top-up, top-down, bottom-up, and that being about perception as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.027,
    "end": 3735.968,
    "text": "Cool, nice point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3736.508,
    "end": 3742.569,
    "text": "Deep priors, narrative priors, how did I get here with sensory priors at the moment-to-moment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3743.29,
    "end": 3748.131,
    "text": "So here's the paper with Friston, Parr, and Zeidman from 2018-19, Bayesian Model Reduction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3748.151,
    "end": 3748.191,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3752.085,
    "end": 3763.306,
    "text": " The yellow parts are highlighted, but just one green part and then kind of a takeaway here is we consider structured learning and hierarchical or empirical base",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3764.212,
    "end": 3768.435,
    "text": " that can be regarded as a metaphor for neurobiological processes like abductive reasoning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3769.196,
    "end": 3776.541,
    "text": "So I know that that's what we're kind of excited about and the paper that we brought up of Majeed Beni, but that's super interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3776.581,
    "end": 3784.347,
    "text": "Like just to kind of skip to the last sentence, how are they going to be using model comparison of Bayesian models to explore abductive reasoning?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3786.068,
    "end": 3796.696,
    "text": " One takeaway, but really would be great to have people who know more about this topic have a little bit more insight would be like we can compare Bayesian models that only vary in their priors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3797.456,
    "end": 3800.259,
    "text": "It's really easy to compare the similar structures of models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3800.959,
    "end": 3805.803,
    "text": " that just vary in like whether they think it's gonna be a Gaussian centered at five or centered at seven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3806.183,
    "end": 3809.266,
    "text": "There's a lot of tools that help you very rapidly compare that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3809.586,
    "end": 3815.271,
    "text": "But if you have two totally disparate model, two programming languages, they're predicting different things, it's really hard to compare them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3815.831,
    "end": 3827.801,
    "text": "So the frequentist comparisons can be very intractable as well as sampling and simulation based ones that are just like brute force, or they can have stringent requirements like the hierarchical likelihood ratio test",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3828.542,
    "end": 3832.044,
    "text": " is only applicable to certain subsets of frequentist modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3832.965,
    "end": 3834.246,
    "text": "So structure learning is hard.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3835.006,
    "end": 3836.467,
    "text": "What is the structure of causation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3836.567,
    "end": 3839.309,
    "text": "What's the structure of the data, the shape of the data, Dean, like you brought up?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3840.069,
    "end": 3854.038,
    "text": "So how can we frame this question and challenge about learning about structure of data in terms of model comparison or updating of priors amongst models that have similar structures but just different quantitative variables?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3854.978,
    "end": 3858.56,
    "text": " And so Bayesian model reduction is a way that you can do this kind of structured learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3859.321,
    "end": 3872.389,
    "text": "And one loose analogy is the lasso regression, which tries to restrict to a very small set of few strong factors in a data set that might have like many weakly interacting factors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3872.809,
    "end": 3875.951,
    "text": "It kind of truncates the distribution and just says like, give me the most relevant ones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3876.591,
    "end": 3880.674,
    "text": "And if it's just massively interacting, then, you know, so be it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3881.494,
    "end": 3897.008,
    "text": " And that kind of a regression is going to have a similar use, which is to converge upon a smaller number of things that are really informative while keeping the model also similar, which should be reminiscent of like the Bayesian information criteria, AIC as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3898.049,
    "end": 3899.631,
    "text": "And then here's in that paper,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3900.782,
    "end": 3902.803,
    "text": " And it relates to what we read earlier.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3902.823,
    "end": 3917.448,
    "text": "How do you go from quantitative continuous estimates, in this case coming from perceptual updating of that retina sensor, how do we plug in from the continuous and map to categorical a discrete selection of models?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3918.413,
    "end": 3928.236,
    "text": " So mapping from continuous to continuous, you can just do like a dilation or some other function mapping, but it gets a little bit different when you want to map between these worlds of continuous and discrete.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3929.396,
    "end": 3944.24,
    "text": "And it turns out that the way it works is that inference is performed within and among a family of models, Bayesian models, that are using parameters like quantitative difference in parameters to describe structural connections between variables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3945.08,
    "end": 3958.008,
    "text": " so here's like let's just say that black is zero and white is one then here's like all the combinations of linear models that were used to generate the different models so this is the exhaustive frequentist approach and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3959.028,
    "end": 3971.396,
    "text": " Here, what's happening is the Bayesian model is estimating the relevance of each of up to 20 parameters, and then estimating a credible interval, which is 90% in this case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3971.416,
    "end": 3977.139,
    "text": "90% of the time it's within this interval, we think, or that's where it's likely to be under some value of stringency.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3977.62,
    "end": 3979.001,
    "text": "That's the red blur.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3979.821,
    "end": 3983.842,
    "text": " And then you prune the ones that are like not significantly different from zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3984.383,
    "end": 3992.906,
    "text": "So it doesn't mean that they're not zero or they're not playing a role or the proteins don't touch, but it means that you can actually structurally simplify the relationship between variables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3993.606,
    "end": 4004.39,
    "text": "So that's moving from continuous evidence about models of a discrete family to a reduced model that could potentially be extremely parsimonious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4005.802,
    "end": 4025.248,
    "text": " so that's just the bayesian model reduction but that's like i guess a sub component of this paper so wanting to know more about how it comes into play or if there's an analogous process on the generative way down okay any thoughts on that or just that was one little section well i was just thinking i mean i'm not sure if i've",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4026.041,
    "end": 4045.427,
    "text": " got this potentially right but i can see this brings in the idea of how action can be used to think like in creative abductive work you you know you can start to actually create entropy or create confusion to create some possible outcomes and that the art of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.291,
    "end": 4052.335,
    "text": " the creative process isn't necessarily the creation of random novel ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.375,
    "end": 4053.716,
    "text": "It's being able to prune back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.176,
    "end": 4063.422,
    "text": "I think it comes a bit back to that idea of that task-related off-focus mind-wandering, you know, the ability to then go backwards and forwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.963,
    "end": 4067.845,
    "text": "And that might tie in with this ability here to do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.107,
    "end": 4072.628,
    "text": "I'm not sure, but it sounds like this would tie into that somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.349,
    "end": 4073.569,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.789,
    "end": 4074.53,
    "text": "We'll ask the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.339,
    "end": 4076.199,
    "text": " OK, nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4076.319,
    "end": 4077.18,
    "text": "Onto the simulations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4077.22,
    "end": 4078.94,
    "text": "Also, people can just leave when they need to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4080.44,
    "end": 4089.483,
    "text": "This section is going to provide the simulation results that show how the model described in the previous section engenders opacity transparency phenomenology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4090.063,
    "end": 4095.985,
    "text": "So outputs of the model that recapitulate some of the dynamics that have been described in other experiments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4096.945,
    "end": 4100.946,
    "text": "And then they're going to use that agent with a three-layer generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4102.597,
    "end": 4111.602,
    "text": " Okay, so first was just the... Any thoughts on what the simulation is or just to contextualize it before we talk more about it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4113.663,
    "end": 4113.863,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4114.604,
    "end": 4115.464,
    "text": "The code is available.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4115.624,
    "end": 4116.665,
    "text": "It's a Colab book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4117.725,
    "end": 4118.366,
    "text": "It's pretty cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4118.666,
    "end": 4122.288,
    "text": "It makes a lot of the graphs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4122.668,
    "end": 4124.129,
    "text": "So nice work for the authors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4124.169,
    "end": 4127.271,
    "text": "Maybe we can walk through it or ask about certain parts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4127.811,
    "end": 4130.172,
    "text": "But cool that it's an interactive notebook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4131.173,
    "end": 4131.333,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4132.854,
    "end": 4134.616,
    "text": " Anyone want to describe seven?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4137.939,
    "end": 4138.48,
    "text": "Sure, I will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.401,
    "end": 4147.649,
    "text": "So here it says, just the yellow part, it says, in the first half of the trial, the agent is in the focused state, which confers a higher precision, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.349,
    "end": 4152.814,
    "text": "the agent is generally more confident about how their observations map onto states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.294,
    "end": 4158.558,
    "text": " In the second half of the trial, the precision drops as the agent moves into the distracted state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.099,
    "end": 4162.682,
    "text": "As a result, their beliefs about latent states are updated more slowly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.142,
    "end": 4165.364,
    "text": "So this is kind of like, I wasn't really paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.384,
    "end": 4167.086,
    "text": "Did I just see a car flash in front of me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.106,
    "end": 4169.448,
    "text": "I don't really know because I wasn't really paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.248,
    "end": 4175.473,
    "text": "Whereas if you're focused on the screen and watching the car, you see every flash and you know exactly when it flashed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.775,
    "end": 4204.751,
    "text": " nice way to put it blue so the blue is what um happened it's like a tone like a lower piece even like a lower tone versus a higher tone that happens some frequency of the time and then um it is just this is a agent that's artificially held with a total focus state for the lighter half and then it just switches instantly and we're exploring how this s at the first level so to go back to figure five",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4205.671,
    "end": 4232.352,
    "text": " that's the perception is s at the first level and then that is an estimate that's changing through time and so um when it's focused it's like higher highs and sharper and lower lows and then distracted states just more like wait what stuff's more just spread out and it maybe has a different recovery or similar speed but lower to rise so that's how they say that um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4233.496,
    "end": 4238.057,
    "text": " That's how they make their claims about the way that the attentional state influences A1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4239.918,
    "end": 4242.439,
    "text": "By making the likelihood mapping more or less informative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4243.039,
    "end": 4247.76,
    "text": "Because if it's uninformative, the likelihood mapping, then why does the sensory input matter?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4248.18,
    "end": 4248.72,
    "text": "Go with your gut.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4250.061,
    "end": 4253.982,
    "text": "But if it's very precise, you want to go with what your lying eyes are telling you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4255.134,
    "end": 4260.638,
    "text": " And that is reflecting in figure eight, this phenomenological cycle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4260.838,
    "end": 4265.822,
    "text": "So these can be discrete just via that mechanism of like the continuous to discrete estimation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4266.503,
    "end": 4272.648,
    "text": "And they write that this is the diagram of the phenomenological cycle that occurs during sustained attention tasks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4273.348,
    "end": 4280.532,
    "text": " The process cycles through being focused, becoming distracted, becoming aware of this distraction, and then refocusing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4281.052,
    "end": 4284.955,
    "text": "So it's cool because it looks like internal-external states in a way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4285.715,
    "end": 4291.979,
    "text": "And action-intense states, like it's a OODA loop, or there's so many other four-fold models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4293.126,
    "end": 4294.646,
    "text": " But what are we actually looking at here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4294.786,
    "end": 4297.907,
    "text": "We're looking at the dynamics of that attractor state as it wanders.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4298.767,
    "end": 4305.569,
    "text": "So I feel like since both of you have thought about attention or awareness, maybe what did this look like or what does this mean to you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4307.749,
    "end": 4311.39,
    "text": "Do you think that we attend through steps all the time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4311.51,
    "end": 4316.211,
    "text": "I know that for the simulation, they want to be able to see that in order to be able to do the calculations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4316.251,
    "end": 4317.311,
    "text": "But do you think people do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.04,
    "end": 4325.023,
    "text": " So I think that the shift from focused to distracted is maybe not discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4325.503,
    "end": 4329.065,
    "text": "That might be more of a continuous shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.051,
    "end": 4349.619,
    "text": " transition but definitely like as soon as i'm aware that i'm distracted like the attention gets redirected like that is a the awareness of distraction is a discrete like bam oh and then the redirection of attention is is also like i can replace it and then i'm focused again but then the transition so it's just this top left corner where it's a little fuzzy for me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.094,
    "end": 4352.015,
    "text": " I really agree with that, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4352.055,
    "end": 4355.998,
    "text": "Like, awareness of distraction to redirection of attention, that's like, you know, the eye of Mordor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4356.298,
    "end": 4357.66,
    "text": "It just goes somewhere else, okay?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4358.34,
    "end": 4369.089,
    "text": "But then the distracted to the awareness of distraction is actually that same, but it's the eye, the cognitive, metacognitive eye of Mordor turning its eye on a lower level estimate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4369.569,
    "end": 4377.055,
    "text": "So I agree that actually this, from noon to six, it looks, it's pretty interesting how it maps, but then...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4377.916,
    "end": 4403.585,
    "text": " do we think about focus and distraction as part of a continuum of a single variable or is this like in a yeah is there can you wobble or is there like more dimensions to just being super strongly obsessively doing something how far do you pull back what if you have to you know put down the first pen to pick up a different pen you're pulling back from the goal but you're moving towards it so that's the kind of deep policy questions that are so cool that we're raising blue",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4404.431,
    "end": 4408.854,
    "text": " Well, so it's cool because here it's this gamma function, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.894,
    "end": 4410.675,
    "text": "Like, so the gamma is the precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.136,
    "end": 4417.74,
    "text": "And so just by changing the gamma and like you can change the gamma incrementally, however you want to change the gamma, like 0.01, 0.1, 0.0001.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4420.382,
    "end": 4429.369,
    "text": "And then by changing that gamma, you can really get that shift like computationally from focus to distracted by just by changing that precision metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.389,
    "end": 4429.569,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.492,
    "end": 4430.732,
    "text": " Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4430.792,
    "end": 4436.296,
    "text": "And I mean, that's kind of imagine the little headband when people are paying attention and what do you do?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4437.397,
    "end": 4444.423,
    "text": "So here I copied the left side of I think five and then just laid it next to here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4444.523,
    "end": 4446.744,
    "text": "So these are the questions that again, each layer is asking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4447.785,
    "end": 4449.847,
    "text": "The blue layer is like the perception layer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4451.027,
    "end": 4456.111,
    "text": " and related to the policy that's going to get those perceptions in line with preferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4457.212,
    "end": 4459.854,
    "text": "So moving the cart back and forth to be in the right amount of light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4460.434,
    "end": 4462.676,
    "text": "Then hidden mental states are about paying attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4463.497,
    "end": 4476.007,
    "text": "And then what influences the precision and emits a precision variable and an observable at a higher level, just like A sub one at the second level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4476.207,
    "end": 4477.007,
    "text": "Here's like A three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4478.052,
    "end": 4482.035,
    "text": " And here's now the slow one, but it's happening actually at every time point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4483.156,
    "end": 4489.741,
    "text": "So again, you could probably elaborate this in various ways and ask like how many time steps of action are calculated per attentional state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4490.721,
    "end": 4493.864,
    "text": "How many attentional states are calculated per metacognitive state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4494.604,
    "end": 4496.806,
    "text": "Are they all in the flow?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4498.227,
    "end": 4500.008,
    "text": "It's so interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4501.349,
    "end": 4505.673,
    "text": "So here, then they also put down the specific matrices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4505.773,
    "end": 4507.574,
    "text": "I assume the ones that we'll see in this video",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4508.353,
    "end": 4509.153,
    "text": " Colab notebook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4509.694,
    "end": 4515.497,
    "text": "These are just like the parameters that are going to illustrate some of the dynamics that are going to be interesting for the fields.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4516.238,
    "end": 4522.101,
    "text": "But again, these are parameters that could be learned or updated or could reflect not just a two by two option.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4523.362,
    "end": 4523.602,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4524.662,
    "end": 4527.164,
    "text": "So maybe even copying this guy out again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4527.504,
    "end": 4528.144,
    "text": "Here, figure 10.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4531.246,
    "end": 4531.526,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4531.806,
    "end": 4531.967,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4533.041,
    "end": 4555.94,
    "text": " so here are the three layers of the model and so the bottom layer is playing the oddball Paradigm so it's like listening to like regular tones and then once in every x percent there's a differential tone but also that could be like which one of these security events is anomalous or which one of these trades would be effective amidst the prior that 90 are probably not so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4557.338,
    "end": 4562.081,
    "text": " It starts off focused and all systems are normal on the sensory side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4562.162,
    "end": 4564.223,
    "text": "And it gets distracted, it returns to being focused.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4565.404,
    "end": 4567.125,
    "text": "This is the true state at each level is the dot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4567.926,
    "end": 4569.827,
    "text": "So the bottom layer is like the percept of the sound.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4569.907,
    "end": 4571.668,
    "text": "This is the attention, this is the meta awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4573.15,
    "end": 4580.155,
    "text": "And then this you see at the change point from being distracted to focus, there's a switch point in the third level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4581.315,
    "end": 4584.097,
    "text": "So then everything's normal, the sensory level, and then it's distracted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4585.034,
    "end": 4589.457,
    "text": " And then the oddball happens at 21 or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4590.177,
    "end": 4592.038,
    "text": "And then that like flips it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4592.639,
    "end": 4595.1,
    "text": "It says, flips it back into attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4596.481,
    "end": 4600.244,
    "text": "And then that continues and it stays in that state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4601.46,
    "end": 4602.541,
    "text": " until an event happens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4602.581,
    "end": 4629.817,
    "text": "And so this is just simulating out the dynamics, but the idea with this kind of a graph is that we can scan along and look at how changes in one level either are influencing each other statistically, causally within our model, not necessarily about the real world, but just literally causally because we specified it in our model and then do parameter fitting and be like, whoa, we can explain 95% of the variance in this behavioral data set, even though we didn't observe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4630.757,
    "end": 4649.279,
    "text": " the red or the orange we observed this or their task variability but then we have enough data points from enough individuals and from time series of this individual and then start to add in some other measurements and there's a lot of data to do inference on these higher order states about any comments on 10.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4653.052,
    "end": 4653.293,
    "text": " Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4654.114,
    "end": 4655.518,
    "text": "I'm just thinking, so sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.798,
    "end": 4660.77,
    "text": "I'm just thinking about how this is going to be used, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.877,
    "end": 4664.339,
    "text": " by companies to keep you working.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4665.079,
    "end": 4669.422,
    "text": "Like, I just can't help but, like, think about thinking about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.803,
    "end": 4670.643,
    "text": "Like, are you paying attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.683,
    "end": 4671.564,
    "text": "Are you not paying attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4671.624,
    "end": 4673.605,
    "text": "Can we give you an oddball to make you pay attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.946,
    "end": 4677.788,
    "text": "Like, you're sitting at work and all of a sudden, like, oh, shit, I wasn't even paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.828,
    "end": 4679.67,
    "text": "So, yeah, like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.81,
    "end": 4680.41,
    "text": "I think about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.45,
    "end": 4684.113,
    "text": "And it's kind of scary and it's kind of, I don't know, it's real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.345,
    "end": 4705.81,
    "text": " think blue if people actually tried to do that I think they would be more misinformed than they would be informed as I said for half a dozen years I work with people who whose goal was to pull apart and sort of get a better understanding of this time on task piece and they're no closer today to understanding it then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4707.25,
    "end": 4718.275,
    "text": " They were a decade ago and they spent a lot of time on it because I don't know that this literally maps into an appreciation or understanding of what on task versus off task is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4718.795,
    "end": 4720.376,
    "text": "There's tangents to tasking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4721.196,
    "end": 4724.558,
    "text": "And I don't think that this really gives us a sense of what that is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4724.838,
    "end": 4727.219,
    "text": "I think the blue layer does speak to the unplannable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4727.819,
    "end": 4729.98,
    "text": "I think that the middle layer does speak to transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.4,
    "end": 4733.442,
    "text": "And I think the top of green red does speak to plannable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.462,
    "end": 4735.703,
    "text": "But if somebody in an organization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4736.633,
    "end": 4743.796,
    "text": " thinks that they're going to have a better sense of how they're going to determine whether a person was on task or not, I say good luck with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4744.757,
    "end": 4755.462,
    "text": "So I actually have a colleague that's developing a way to determine if a person's in the flow state or not, which is very different, very interesting, like with physiological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.602,
    "end": 4757.223,
    "text": "So attentional is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.243,
    "end": 4759.764,
    "text": "Like, are you paying attention versus are you in flow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.464,
    "end": 4761.585,
    "text": "And it's really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.605,
    "end": 4763.926,
    "text": "And they've got some decent results so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.494,
    "end": 4769.236,
    "text": " Yeah, well, they can count the number of saccades or saccades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4769.316,
    "end": 4774.598,
    "text": "And I've looked at the whole visual memory thing and all of that literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4774.938,
    "end": 4784.541,
    "text": "And they're still not getting any closer to understanding when a person is on or off task because they want to break it down to that kind of a binary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4784.621,
    "end": 4787.822,
    "text": "I say, let them continue to do that because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4790.918,
    "end": 4795.862,
    "text": " I'm not sure if it's nefarious, but I think it has the potential to become that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4796.202,
    "end": 4799.305,
    "text": "So I'd like them to go and spend all their time on it because they're not going to figure it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4800.206,
    "end": 4801.127,
    "text": "Keep them distracted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4802.148,
    "end": 4804.269,
    "text": "Oh, Dean, laying down breadcrumbs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4805.11,
    "end": 4805.571,
    "text": "I love it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4806.171,
    "end": 4806.632,
    "text": "Carry on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4808.253,
    "end": 4814.438,
    "text": "Figure nine is going to be that same cycle of four that we were talking about on eight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4815.549,
    "end": 4827.535,
    "text": " And now in addition to just the sort of qualitative label, we're gonna map that onto the structure of the model that we were discussing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4828.455,
    "end": 4835.638,
    "text": "So here, like the redirection of attention is being framed as policy two, pi at the second level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4836.619,
    "end": 4840.641,
    "text": "So where's the action?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4842.025,
    "end": 4845.046,
    "text": " Pi at the second level is this orange one here on figure five.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4846.026,
    "end": 4849.588,
    "text": "So that is influencing what one is paying attention to through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4850.528,
    "end": 4852.049,
    "text": "And then that is being mapped to here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4852.169,
    "end": 4860.272,
    "text": "And similarly, you can read through and just work through the combinatorics here of what these map to from a dynamical systems perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4860.932,
    "end": 4865.514,
    "text": "Like while it's in a parameter neighborhood or regime or attractor state,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4866.539,
    "end": 4880.391,
    "text": " or manifold that's in one area in a distracted state, described by a wide range of continuous parameters that map onto the categorical distinction of the true state being distracted, but the perception being that one is focused.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4881.032,
    "end": 4883.935,
    "text": "So just work through what these distinctions are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4883.955,
    "end": 4884.795,
    "text": "It's pretty interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4887.378,
    "end": 4888.599,
    "text": "Yeah, anything to add on that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4888.619,
    "end": 4889.099,
    "text": "It's kind of cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4889.119,
    "end": 4890.921,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4893.249,
    "end": 4903.323,
    "text": " 11 is going to be another kind of... Just like in 7, they had the attention at the second layer at one parameter level, and then they just, like, turned down the dimmer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4904.204,
    "end": 4904.825,
    "text": "In figure...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4906.429,
    "end": 4933.858,
    "text": " 11 they're going to have a high meta awareness and then turn down the dimmer to the low meta awareness at the s3 so recapitulating the way that they added this third layer to hespedal 2021 they're recapitulating figure seven in how they vary the parameters changing through time but now you can see the dynamics are totally different like the spiking between focus and distraction is actually happening faster during the period of fixed high meta awareness",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4935.393,
    "end": 4938.976,
    "text": " Whereas during the period of low meta awareness, actually it's like there's longer intervals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4939.036,
    "end": 4940.137,
    "text": "It's like, whoa, what just happened?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4940.798,
    "end": 4942.419,
    "text": "I was having low meta awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4942.9,
    "end": 4943.9,
    "text": "The time just flew by.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4944.441,
    "end": 4957.192,
    "text": "Or maybe there's another interpretation, but it's just a nice plot that gets at how just a parameter combination can give us insight into the structure of the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4957.712,
    "end": 4962.737,
    "text": "So we kind of have the graphical doorway, the programming doorway, then this is like the outcome oriented",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4963.871,
    "end": 4967.114,
    "text": " data science way, because this is just input in a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4967.134,
    "end": 4968.435,
    "text": "It's just in a machine learning notebook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4968.995,
    "end": 4975.86,
    "text": "It doesn't really even explicitly invoke the graphical structure that we just have been talking about the whole time, but it is that embodied in a simulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4975.88,
    "end": 4979.503,
    "text": "All right, Dean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4981.304,
    "end": 4986.649,
    "text": "No, I got to talk to the author tomorrow because it brings up the thing about... Is it tomorrow?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4986.749,
    "end": 4988.19,
    "text": "I'm pretty sure it's... Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4988.71,
    "end": 4989.791,
    "text": "I'm going to want to bring up what I...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4991.653,
    "end": 4993.658,
    "text": " You should talk about it as a crosswalk analogy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4993.698,
    "end": 4994.721,
    "text": "I'm just going to leave it at that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4996.465,
    "end": 4998.651,
    "text": "I can see you being a great crosswalk guard.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5001.295,
    "end": 5021.797,
    "text": " you wait so figure 12 this is kind of the last figure i thought this was an awesome figure and one i i know that we'll return to many times a based graph of a deep generative model of mental action generalized over all precision parameters so now that attentional state",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5022.902,
    "end": 5045.955,
    "text": " likelihood mapping is going from potentially a binary state like we saw here focused or not i mean uh yeah um the likelihood mapping kind of like the dark side of the moon album cover can emit like five simultaneous outputs it can output a tuple or a vector from a computational perspective perspective and it can output what we talked about here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5046.775,
    "end": 5056.0,
    "text": " but it can also emit an uncertainty and potentially even other things connecting to multiple of these lower level parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5056.82,
    "end": 5062.964,
    "text": "So now there can be an uncertainty over the priors, whereas in the previous simulations, D just stood alone and there wasn't uncertainty around it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5063.544,
    "end": 5070.068,
    "text": "So it's just sort of taking the next step and just being like, okay, if we went from estimating the valence",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5071.004,
    "end": 5074.666,
    "text": " with the actual like plus or minus, are things going better or worse than expected?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5075.447,
    "end": 5078.148,
    "text": "And we just said, okay, what's the sister of valence, reward?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5078.449,
    "end": 5081.911,
    "text": "The sister is the uncertainty and the precision and their relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5082.491,
    "end": 5092.237,
    "text": "So now this paper, that's why it builds on HESP 2021, because it fills in the other compliment there, which is the precision modulation by higher level states, rather than the valence modulation by higher level states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5092.397,
    "end": 5093.438,
    "text": "How well are things going?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5094.246,
    "end": 5107.317,
    "text": " And then that insight to generalize into the variation from a top-down level has strong precedent in Bayesian modeling where it's related to like the parametric empirical Bayes and hierarchical Bayes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5108.018,
    "end": 5109.139,
    "text": "So big.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5110.88,
    "end": 5120.869,
    "text": "A lot of philosophical questions about what a parameter means, challenges in implementing it, but this is a relatively generalizing step in the publications.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5124.972,
    "end": 5126.333,
    "text": " Oh yeah, exactly that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5127.054,
    "end": 5131.157,
    "text": "It's the same higher level affective states applied to the likelihood precision rather than model precision.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5132.218,
    "end": 5139.983,
    "text": "And then, note that this evidence is only available when higher level likelihood precisions is non-zero, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5140.003,
    "end": 5141.564,
    "text": "when the state is opaque to some degree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5142.104,
    "end": 5146.948,
    "text": "As a result, the transparency opacity distinction can be directly related to the evidence calculation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5148.9,
    "end": 5164.918,
    "text": " so she thought what does that mean or just interesting like we don't notice something and then we do so it's kind of like it's transparent and then it becomes opaque and we observe it in this model it puts us over threshold of observation that takes us off task as defined by policy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5165.973,
    "end": 5168.194,
    "text": " Okay, on to the implications and bigger questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5168.274,
    "end": 5169.734,
    "text": "So, Blue, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5170.055,
    "end": 5178.118,
    "text": "Well, so just to your last point, like, I wonder if, you know, have you ever felt so focused you're distracted?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.918,
    "end": 5187.902,
    "text": "Like, that's a common thing for me, and maybe it's focused on the wrong task, but it's also, like, you're focused to the exclusion of everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.462,
    "end": 5193.524,
    "text": "So I just wonder how that goes into this transparency, opacity, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.704,
    "end": 5195.605,
    "text": " Gradient, maybe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.965,
    "end": 5200.63,
    "text": "So anyway, and then, yeah, on to implications and bigger questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5201.271,
    "end": 5203.233,
    "text": "So I think about, oh, sorry, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5203.633,
    "end": 5204.975,
    "text": "Did you have something, some response?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.995,
    "end": 5205.195,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5206.536,
    "end": 5206.637,
    "text": "Oh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.037,
    "end": 5208.979,
    "text": "Go for it, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5210.521,
    "end": 5210.821,
    "text": " So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.001,
    "end": 5213.024,
    "text": "So implications and bigger questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.364,
    "end": 5220.494,
    "text": "So here I like when so I obviously got one during this discussion about being so focused that you're that you're not paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.136,
    "end": 5226.481,
    "text": "But also if we're talking about adding hierarchical levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.202,
    "end": 5232.164,
    "text": " So I wonder about here, beyond meta-awareness, I wonder about collective consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.325,
    "end": 5243.61,
    "text": "Like, so is there, you know, when you realize that you're part of a collective, and then when the collective develops some kind of meta-consciousness, like, so it makes me think about that and about maybe how to model something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5244.13,
    "end": 5252.494,
    "text": "Maybe in ants, for example, because there's the individual level, and then there's definitely, like, the society structural level, the consciousness of the colony, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.514,
    "end": 5256.036,
    "text": "And also, you know, simulation theory, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.856,
    "end": 5266.727,
    "text": " So at what level, becoming aware that we're in a simulation, where does that fit into the hierarchical nesting of this deep meta-awareness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.445,
    "end": 5271.986,
    "text": " Funny stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5272.406,
    "end": 5276.593,
    "text": "Wouldn't have thought that that's where we would get, you know, but that's kind of what it has come to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5277.654,
    "end": 5279.898,
    "text": "Any thoughts on that, Dean, before we go to the next slide?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5280.458,
    "end": 5285.105,
    "text": "No, I think it ties in nicely with the, what do we metacognize over?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5287.188,
    "end": 5289.55,
    "text": " And I'm going to bring up the crosswalk tomorrow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5289.91,
    "end": 5290.111,
    "text": "Yep.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5290.751,
    "end": 5295.235,
    "text": "So this future of phenomenology slash neuro phenomenology, just whatever we want to call it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5296.696,
    "end": 5300.72,
    "text": "Here's just a few angles on what is slash has and will happened.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5301.52,
    "end": 5305.423,
    "text": "There's multimodal brain measurements, OSPM, where art thy sting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5306.144,
    "end": 5319.887,
    "text": " but just it lays out in 2007 and earlier, but in that textbook and in the online documentation, kind of generalized frameworks for harmonizing across different modalities of neuroimaging, behavioral imaging, hidden state modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5320.407,
    "end": 5323.128,
    "text": "So a lot of the seeds are in SPM.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5324.608,
    "end": 5335.131,
    "text": "What we can talk about integrating now, other than in a laboratory setting like EEG and fMRI at the same time together, but increasingly, even at home, physiological sensors,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5336.462,
    "end": 5349.113,
    "text": " wearables, cameras, and environmental sensors, the capacity for models that involve multiple humans and finding the synchronies and attunements amongst them under environmental changes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5349.633,
    "end": 5354.458,
    "text": "And this is like the work of Hyperscanning and Guillaume Dumas and a lot of other people in that field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5355.796,
    "end": 5360.199,
    "text": " Thinking about cyber physical systems, like what if the state is inside the head purportedly of a human?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5360.899,
    "end": 5364.081,
    "text": "Is that different than if this state is purportedly inside of a software?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5364.502,
    "end": 5365.662,
    "text": "Which ones get to be affect?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5365.723,
    "end": 5367.804,
    "text": "Which ones get to be what standing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5367.824,
    "end": 5375.069,
    "text": "And then also it helps us and always is important, maybe you'll go here with who and why and how, Dean, but,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5375.669,
    "end": 5403.068,
    "text": " really just all these axes that phenomenology has been addressed from developmental multicultural neurodiversity a lot of historical perspectives that also is continuing to weave together and not being said to be obsolete or simplified by a computational model yeah if you want to know more phenomenology go and read some sean gallagher",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5405.791,
    "end": 5426.476,
    "text": " nice don't know about that but it sounds cool yeah anything there or last okay then here was just one paper that kind of came out just on a closing note like how it connects out maybe to other areas this was um looking at behaviors across a bunch of different fruit fly species drosophila",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5427.594,
    "end": 5447.861,
    "text": " And then here's the big figure or one of them, kind of mapping, just like you might map genes being correlated or might map neural activations to be correlated across different regions of the brain, those same matrix methods, tensor methods, fundamentally, covariance estimation,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5448.621,
    "end": 5451.562,
    "text": " can be used to study different kinds of relationships.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5451.582,
    "end": 5454.103,
    "text": "So earlier, we saw the neural activity and the behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5454.583,
    "end": 5456.784,
    "text": "Here, the heat map is like behavior to behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5457.244,
    "end": 5459.165,
    "text": "They're looking for pure behavioral co-variation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5459.805,
    "end": 5476.411,
    "text": "But then what's really cool about this paper is that they use several techniques from information theory, which we see all the time in FEP, information, thermo, cool, going that way, but then also puts it explicitly in a comparative evolutionary framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5477.389,
    "end": 5496.079,
    "text": " So this is really moving towards models that can just very seamlessly integrate different kinds of data as easy as integrating the same kind of data, just the matrix is type A of data by type B of data rather than type A by type A. So these kinds of models that cross data input types",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5497.472,
    "end": 5502.955,
    "text": " need to be connected to broader traditions, like thinking about development, ecology, evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5503.915,
    "end": 5512.8,
    "text": "And it's just also interesting how these fields, which are increasingly data rich, are gonna be using different cutting edge theoretical frameworks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5513.261,
    "end": 5517.163,
    "text": "So that's just one closing thought about where's evolution in this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5517.643,
    "end": 5518.443,
    "text": "Where's development?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5519.244,
    "end": 5521.305,
    "text": "Where's, what are we doing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5521.585,
    "end": 5524.547,
    "text": "All these components that discussion elicits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5525.707,
    "end": 5528.349,
    "text": " So any last thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5528.429,
    "end": 5535.732,
    "text": "Otherwise, thanks, Blue and Steven and Dean, because this was fun to work on, and I think we all got to learn a lot here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5537.713,
    "end": 5537.893,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5539.174,
    "end": 5539.514,
    "text": "Definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5541.295,
    "end": 5541.795,
    "text": "More tomorrow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5542.116,
    "end": 5542.756,
    "text": "Yep, I know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5542.876,
    "end": 5545.958,
    "text": "We've just been so not on top.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5549.419,
    "end": 5549.599,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5549.619,
    "end": 5550.04,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5550.24,
    "end": 5550.98,
    "text": "Thank you again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5551.16,
    "end": 5552.141,
    "text": "Thanks, everyone, for watching.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5552.261,
    "end": 5552.581,
    "text": "Peace out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5554.382,
    "end": 5554.522,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]