[
  {
    "start": 7.507,
    "end": 33.295,
    "text": " all right hello and welcome it is june 27th zero utc 2024 and we are in active inference model stream number 12.1 with beth fisher and yakupawi so we will have a presentation and a discussion on an active inference model of the optimism bias so thank you both for joining and beth to you for the presentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.962,
    "end": 35.262,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.443,
    "end": 36.124,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.085,
    "end": 37.846,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.866,
    "end": 45.537,
    "text": "So I'm Beth and I'm going to talk about work we've just put out as a pre-print and active inference model of the optimism bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.458,
    "end": 53.348,
    "text": "And this is work we've done along with Chris White, who I think a lot of you will already know or read some of his work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.529,
    "end": 60.057,
    "text": "And yeah, we're here in Australia at the Monash Center for Consciousness and Contemplative Studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.92,
    "end": 63.602,
    "text": "And this is part of my PhD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.903,
    "end": 64.344,
    "text": " project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.364,
    "end": 66.046,
    "text": "So I'm doing my PhD with Jakob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.39,
    "end": 78.285,
    "text": "So what I'll do is I'll, first of all, give a bit of an overview of what the optimism bias is, and why this is interesting to study why I'm interested in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.627,
    "end": 83.954,
    "text": "And then going to talk a bit about the field of computational psychiatry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.235,
    "end": 88.341,
    "text": "So I'm using active inference, not so much in a way to understand, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.013,
    "end": 94.683,
    "text": " to understand the nitty gritty of active inference, but more as an application as a tool in computational psychiatry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.703,
    "end": 104.22,
    "text": "So I thought it would be helpful to explain how we can use these models in these kinds of settings and the purpose of why I'm using these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.423,
    "end": 111.173,
    "text": "Then I'll go through the simulations that we have in the paper and then just some conclusions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.106,
    "end": 138.544,
    "text": " So the optimism bias is a cognitive bias where our expectations are better than reality and what's interesting about the optimism bias is that you might think in order to make the best decisions in life and have the best life outcomes you should represent information as it is in reality and not have expectations that are better than reality but the optimism bias shows us that if we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.794,
    "end": 145.08,
    "text": " think things are better than they are and overestimate the likelihood of good things happening, we have all these better life outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.521,
    "end": 152.646,
    "text": "So people who are optimistic have a lower risk of all-cause mortality and reduced risk of cardiovascular disease.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 153.767,
    "end": 158.071,
    "text": "They have decreased fatigue and chronic illness, and they engage in more self-care behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 158.131,
    "end": 166.759,
    "text": "There's even this really cool study that showed that people who are optimistic had improved cognitive functioning following a traumatic brain injury.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.583,
    "end": 176.753,
    "text": " Optimists, they just earn more money, they have better immune systems, and they just have less anxiety and worry overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.695,
    "end": 185.583,
    "text": "So why would it be that being optimistic and thinking things are better than they are leads to all these positive things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.104,
    "end": 189.928,
    "text": "So to explain that, I'm going to go through an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.169,
    "end": 194.873,
    "text": "So imagine here you're someone who holds the reality beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.629,
    "end": 200.281,
    "text": " So in reality, it's true that 50% of marriages end in divorce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.642,
    "end": 204.591,
    "text": "If you work out, you reduce your risk of heart disease by 14%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.012,
    "end": 209.063,
    "text": "And if you eat well, you reduce your risk of cancer by 10%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.466,
    "end": 213.233,
    "text": "But then imagine that you're someone who's optimistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.449,
    "end": 218.715,
    "text": " So if you're optimistic, you might think, no, only 10% of marriages end in divorce.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 219.436,
    "end": 223.981,
    "text": "If I work out, I'll reduce my risk of heart disease by 40%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.101,
    "end": 227.526,
    "text": "And if I eat well, I'll reduce my risk of cancer by 30%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.666,
    "end": 234.954,
    "text": "So if we hold these optimistic beliefs, we're going to be way more likely to do these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.555,
    "end": 237.737,
    "text": "So we'll be more likely to eat well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.758,
    "end": 243.304,
    "text": "We're going to be more likely to work out and we're going to be more likely to go out there with the hope of finding a partner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.157,
    "end": 258.593,
    "text": " And although not everything will work out for you because the reality statistics are there on the left, by going out and engaging in more activities and things in life, we increase our chances of some things working out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.173,
    "end": 262.617,
    "text": "It's like the idea of minimizing the risk of missed opportunity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.657,
    "end": 272.869,
    "text": "If I do go out there and work out and go to parties and eat well and all these things, I'm going to have more likely chance of some of them working out than if I just stay at home and don't do anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.423,
    "end": 276.627,
    "text": " So being optimistic increases our engagement in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.707,
    "end": 280.533,
    "text": "And this overall is a positive thing that can lead to all these health benefits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.997,
    "end": 289.945,
    "text": "So if optimism is really good for all these things, what is the connection between optimism and mental health?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.447,
    "end": 296.434,
    "text": "So people with anxiety and depression have been shown to lack optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.474,
    "end": 300.84,
    "text": "They can either have expectations that are worse than reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.92,
    "end": 302.502,
    "text": "So this can be pessimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 303.072,
    "end": 305.756,
    "text": " Or they can have expectations that match reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.956,
    "end": 312.886,
    "text": "So this is sometimes called depressive realism, which as we've kind of gone over that this isn't a good thing either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 314.568,
    "end": 320.958,
    "text": "So what I'm interested in is, well, could we increase optimism as an intervention for depression and anxiety?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.098,
    "end": 324.563,
    "text": "So that's what, what I, what I, what I want to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.968,
    "end": 331.813,
    "text": "So to explain how I'm going to do this and how active inference fits in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 331.996,
    "end": 340.984,
    "text": " into this goal, I'm just going to explain a bit about computational psychiatry and what we're kind of aiming to do in that space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.545,
    "end": 345.507,
    "text": "And I'll go through the steps of what you want to do for your aim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.789,
    "end": 352.273,
    "text": "So the first thing, which I guess in most areas in science, you have to come up with a conceptual idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 352.293,
    "end": 357.978,
    "text": "So to do this for this project, I read a lot about active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 358.098,
    "end": 361.581,
    "text": "I read a lot about optimism and tried to think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 362.287,
    "end": 369.179,
    "text": " how active inference could best model optimism, what predictions we could maybe make from these models, and how we can model that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.219,
    "end": 374.969,
    "text": "So you want to spend a lot of time on this first step coming up with a good conceptual idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.069,
    "end": 381.28,
    "text": "And I'm sure a lot of you who've done the active inference work, you know that there's a lot to that step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.32,
    "end": 382.422,
    "text": "That's an important step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.025,
    "end": 385.628,
    "text": "But once you come up with your idea,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.114,
    "end": 387.596,
    "text": " you can run these simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.676,
    "end": 389.559,
    "text": "So that's what we've done in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.7,
    "end": 399.234,
    "text": "So I thought a lot about optimism, how it fits in active inference, and then ran some things on my computer to see, okay, well, can I simulate what I want to see?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.274,
    "end": 404.563,
    "text": "Am I seeing optimism come out in active inference in the way that I want it to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.583,
    "end": 408.088,
    "text": "And then the next step after that, the idea is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.03,
    "end": 413.614,
    "text": " After you've run your simulations, you kind of have a good base to then fit the data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.654,
    "end": 423.123,
    "text": "So what's nice about running the simulations is you kind of have more background knowledge before you go out and just start, start fitting and collecting data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 423.143,
    "end": 428.989,
    "text": "So you can design your experiments to, to fit what you've found in, in the simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.95,
    "end": 437.777,
    "text": "Um, I, I, my image here is of these rats because we have other work where we've done, um, active inference data fitting to, to a rat model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.817,
    "end": 438.818,
    "text": "So that's, what's going on there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.452,
    "end": 449.083,
    "text": " And then the point of all of this is that hopefully in the end, we can come up with a model that will have an application in the clinic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.004,
    "end": 466.744,
    "text": "So after we've done our simulation and our data fitting, well, the idea to use the optimism as the example, we'll have some model that then clinicians can use to help measure and understand how optimism is working for a patient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.784,
    "end": 468.366,
    "text": "And then they can use that model to,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.565,
    "end": 498.488,
    "text": " to design treatments for that person so that's the whole goal and aim of what I'm doing and that's why I'm doing what I want to do and that's why and how I'm using active inference so in terms of the optimism plan this paper is talking about the simulation step and then hopefully from there we can do some data fitting for this work so then there were just some other things I wanted to say before we start talking about the models about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 498.923,
    "end": 509.755,
    "text": " when we're thinking about models to use in the clinic, there's some considerations that are important that might be different to considerations if you're using active inference and modeling in other settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.416,
    "end": 525.572,
    "text": "But if we want to use them in computational psychiatry, we actually want simple models because if the end goal is that a psychiatrist or psychologist or doctor uses them, we don't want anything super complicated because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 526.143,
    "end": 527.585,
    "text": " Um, that won't be practical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.625,
    "end": 529.387,
    "text": "That won't be, that won't be used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 529.467,
    "end": 539.598,
    "text": "So one of the things when I'm designing my models is I'm trying to, to use models that, that are simple, that can give us more information about a disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.898,
    "end": 542.721,
    "text": "Um, but it still can still be used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.502,
    "end": 547.026,
    "text": "And then the idea is that this can help with precision psychiatry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.326,
    "end": 555.795,
    "text": "So at the moment, um, you can go to the doctor, you do a self report for depression, you get diagnosed with depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.197,
    "end": 582.222,
    "text": " there isn't really much understanding of the mechanisms that are involved of of what caused the depression or different things that may have caused it so hopefully these models that we design can we can understand okay well maybe that person is experiencing these uh depressive symptoms because they have low optimism or maybe they don't have low optimism maybe there's something else that that's going on um that we can understand through the use of these models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 583.855,
    "end": 590.503,
    "text": " So I hope that kind of sets the scene of this work and hopefully that made sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.486,
    "end": 607.425,
    "text": "So when I did all the reading of the literature and on active inference and optimism, this is our conceptual idea of an active inference model of the optimism bias that is the precision over the positive outcomes for the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 608.887,
    "end": 613.693,
    "text": "And that might not sound that groundbreaking given the definitions of optimism I've given,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 614.973,
    "end": 619.418,
    "text": " but we'll go through the models to see how we can fit this into the framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.9,
    "end": 630.81,
    "text": "So what we did is that we formalized optimism as a state factor in the generative model that then could be applied to different simulations and tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.13,
    "end": 642.562,
    "text": "So we have this, I'm not sure if you can see the mouse very easily, but we have this optimism state factor here, and we have an optimistic state and a pessimistic state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.203,
    "end": 644.524,
    "text": "And the idea is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.892,
    "end": 650.757,
    "text": " you can take this state factor in different situations and different task settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 651.838,
    "end": 660.867,
    "text": "And we wanted to do something like this because optimism is this higher level belief that affects different areas of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 660.947,
    "end": 665.471,
    "text": "It's not just constrained to one setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 665.991,
    "end": 671.376,
    "text": "So we wanted to think, okay, well, how can we use something that can be general and applied to different tasks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.717,
    "end": 674.359,
    "text": "And can we use this in the simulations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.082,
    "end": 684.673,
    "text": " And the optimism state factor controls or it conditions the precision of the updating for the positive outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.813,
    "end": 688.538,
    "text": "And we'll go through the examples and hopefully that will start making more sense how that works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.541,
    "end": 697.228,
    "text": "So when I go through the rest of the talk, I'll refer to optimism bias as levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.388,
    "end": 700.752,
    "text": "And I just wanted to explain what I mean when I talk about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 701.592,
    "end": 727.701,
    "text": " so we refer to these different optimism levels depending on the optimism state factor so here we would say this is optimism level 0.1 um because there are 0.1 optimism 0.9 pessimism you will have 0.5 optimism and then this would be fully a level one optimism spray um so when i",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 728.356,
    "end": 729.997,
    "text": " go through the rest of the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.077,
    "end": 733.2,
    "text": "This is what, when I am referring to levels, this is what I mean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.124,
    "end": 745.23,
    "text": "So we ran, well, three different simulations, but we refer to them as experiments in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 746.972,
    "end": 751.776,
    "text": "So the first one was we simulated the loss of the optimism bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 753.237,
    "end": 757.941,
    "text": "So we wanted, so one of the things that's interesting about optimism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 758.832,
    "end": 761.235,
    "text": " Is it seen across species?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.356,
    "end": 770.429,
    "text": "So we see it, um, in bees, in horses, all animals have optimism and it's this, this is a, it's an adaptive, adaptive bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.629,
    "end": 774.194,
    "text": "And it suggests that the optimism bias is something that we're born with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.274,
    "end": 778.74,
    "text": "It's something, it's not like other biases that, that we learn later on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.861,
    "end": 780.803,
    "text": "It's something that is, is a part of us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 782.025,
    "end": 786.932,
    "text": "And there's a lot of research throwing that optimism, um, over,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 787.942,
    "end": 792.188,
    "text": " depending on your environment in childhood, you can have lower levels of optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.369,
    "end": 797.937,
    "text": "So factors that you're exposed to early on can influence the level of optimism that you have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 798.037,
    "end": 807.051,
    "text": "And we wanted to kind of do this first experiment with this developmental stage to simulate how optimism might be lost or maintained during development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 807.071,
    "end": 808.954,
    "text": "So that's the idea of the first experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.077,
    "end": 826.011,
    "text": " The second experiment, we applied our optimism by a state factor that was lost or maintained in experiment one to a belief updating task that's used in the literature on optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.151,
    "end": 829.434,
    "text": "So this is used in human participants to study optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 829.495,
    "end": 835.48,
    "text": "And we wanted to do this because hopefully this can ground our model in actually empirical literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.58,
    "end": 839.464,
    "text": "And then if we're able to replicate results that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.647,
    "end": 848.957,
    "text": " is found in the empirical literature on optimism, it kind of gives our model, we kind of have more hope that this is a model that we can then go out and use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.977,
    "end": 850.779,
    "text": "So that was the idea of that step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.722,
    "end": 857.307,
    "text": "And then the third step was we ran a two armed bandit task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.829,
    "end": 863.854,
    "text": "But it's a modified two armed bandit task where we wanted to see if we could measure optimistic action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.055,
    "end": 865.536,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.647,
    "end": 873.758,
    "text": " Because optimists engage in the world more, we wanted to see if we can develop a task that can measure that kind of engagement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.818,
    "end": 879.988,
    "text": "So I'll go through the details of that a bit when we get to that step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.008,
    "end": 885.617,
    "text": "So the first simulation I'll go over is the simulation of the loss of the optimism bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.128,
    "end": 893.781,
    "text": " So as I've already kind of mentioned, there are environmental factors that affect optimism levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.861,
    "end": 902.5,
    "text": "So this can be things that happened to you in childhood, if you're exposed to trauma, your socioeconomic status, these kinds of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.58,
    "end": 907.892,
    "text": "So people who usually have gone through more adversity during childhood have lower optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 910.825,
    "end": 917.853,
    "text": " And another thing is that people who are optimistic have improved cardiovascular responses to stress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.953,
    "end": 920.917,
    "text": "So this means that they have a healthier arousal outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.858,
    "end": 931.99,
    "text": "So if they get really stressed out or exposed to something, they don't have this super high arousal, which, as we know, isn't very good for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.13,
    "end": 939.915,
    "text": " And then on the other hand, as probably most of you know, anxiety is related to high arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 940.116,
    "end": 944.54,
    "text": "So if you're anxious, you can have just high arousal overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 944.66,
    "end": 951.306,
    "text": "And also when there's nothing there to really warrant that arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.35,
    "end": 961.335,
    "text": "So what we wanted to do was to simulate this loss of optimism bias over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.822,
    "end": 968.032,
    "text": " by exposing the agents to higher and lower arousal and positive and negative valence events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 969.454,
    "end": 975.424,
    "text": "And the idea behind that is that obviously we know that there's high arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.385,
    "end": 981.754,
    "text": "You can have high arousal from positive and negative things, and you can have low arousal from positive and negative things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.088,
    "end": 986.052,
    "text": " And a healthy agent would be able to have all of those equally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.232,
    "end": 987.994,
    "text": "And, and, and that's, that's a good thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 988.434,
    "end": 996.763,
    "text": "Whereas someone who is anxious or they can sometimes experience this high arousal, um, as a negative thing, if even when it's not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.923,
    "end": 1003.61,
    "text": "So this is what we wanted to see if we expose the agents to these things during development, does this change their optimism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.271,
    "end": 1007.033,
    "text": "And we also looked at how it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.367,
    "end": 1012.594,
    "text": " looked, uh, affected their arousal mappings, but we'll go through that in the figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.562,
    "end": 1022.188,
    "text": "So for this experiment, so this is just our little image of the experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1022.208,
    "end": 1027.115,
    "text": "So we have the agent who's exposed to all of different combinations of these events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1027.175,
    "end": 1030.54,
    "text": "So positive high and low, negative high and low.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1032.19,
    "end": 1036.195,
    "text": " And for this experiment, we have a hierarchical active inference model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.296,
    "end": 1037.998,
    "text": "So this means that we have two levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.6,
    "end": 1044.967,
    "text": "So the first level of this model just set up the valence arousal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.368,
    "end": 1051.516,
    "text": "So we just fed the model different, um, valence and arousal states, and there was no learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.576,
    "end": 1053.058,
    "text": "There was no, no actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.078,
    "end": 1057.063,
    "text": "It was just, just feeding those observations that the, that the agent had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1057.083,
    "end": 1058.265,
    "text": "So this is our first level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.456,
    "end": 1063.959,
    "text": " And then on our second level, this is the agent's optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.98,
    "end": 1067.363,
    "text": "So this is happening at a slower time course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.683,
    "end": 1073.869,
    "text": "They're getting these valence and arousal observations over these weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.949,
    "end": 1076.232,
    "text": "That's how we operationalize it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.033,
    "end": 1081.237,
    "text": "And this is changing, affecting their optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.238,
    "end": 1089.585,
    "text": "So in the hierarchical models, the states of level one, they give the observations for level two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.105,
    "end": 1095.873,
    "text": " So whatever state the agent was in in this level one, it gives them their observations there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.356,
    "end": 1102.962,
    "text": "So on this second level, the agent was learning two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1103.222,
    "end": 1108.369,
    "text": "So they were learning their optimism, which is our state factor here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1110.171,
    "end": 1113.596,
    "text": "And they were also learning their arousal likelihood matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.956,
    "end": 1118.442,
    "text": "So over time, if they're in an optimistic or pessimistic state,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.877,
    "end": 1145.374,
    "text": " mapping between high and low arousal so they're the two things that that we were looking at so our first result so this is what the optimism looked at after the simulation of development and we we ran it for 200 agents so this is optimism this is optimism state factor remember we talk about those levels",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.945,
    "end": 1149.249,
    "text": " and then the proportion of negatively valenced events they had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.091,
    "end": 1162.723,
    "text": "So what we found is that agents that were more optimistic after development were exposed to less negative valence events, which is what we would hope to see and that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.865,
    "end": 1172.914,
    "text": "Agents that were less optimistic were exposed to more negative valence events, also something we would expect to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1174.413,
    "end": 1178.758,
    "text": " But what we can also see in this plot is there is quite a lot of variability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.92,
    "end": 1187.208,
    "text": "But this is actually a really good thing because when we're thinking about humans, they have a lot of variability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1187.229,
    "end": 1190.733,
    "text": "So it's nice to have a model that can show this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.774,
    "end": 1195.138,
    "text": "So there's also instances, let's see an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.418,
    "end": 1201.686,
    "text": "So this agent here is pretty optimistic, but they were exposed to lots of negatively valenced events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1202.729,
    "end": 1212.426,
    "text": " So this can be for things if someone, well, the agents, if they're initially exposed to a lot of good things earlier on, it can kind of be protective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.507,
    "end": 1217.816,
    "text": "So when they get these negative valence events later on, it doesn't change their model as much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1217.836,
    "end": 1219.479,
    "text": "It doesn't change their optimism as much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1219.539,
    "end": 1221.423,
    "text": "So we can think of that as protective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.685,
    "end": 1227.133,
    "text": "Or we have agents here who weren't exposed to many negatively valence events, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.991,
    "end": 1230.294,
    "text": " but they don't have much optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.414,
    "end": 1235.78,
    "text": "And this could be because maybe they're exposed to these events much earlier on in the, in the simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.063,
    "end": 1251.339,
    "text": "Um, and this, yeah, so this is also what, what, what we would say we can also say in, in the literature is that good things that happen can be protective against the more negative things that can happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.359,
    "end": 1254.403,
    "text": "So this, this was cool to say that that had the variability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.91,
    "end": 1260.474,
    "text": " So then this, so that was the optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.534,
    "end": 1264.76,
    "text": "And now we're looking at the likelihood matrices from the simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1264.92,
    "end": 1274.033,
    "text": "So this is the likelihood matrices that look at the optimism and pessimism states versus the low and the high arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.697,
    "end": 1281.504,
    "text": "So here we have an agent who has optimism level 0.07.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.544,
    "end": 1283.547,
    "text": "So this is a pretty pessimistic agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.501,
    "end": 1296.631,
    "text": " And what we can see is that the high arousal outcomes, there's a lot higher precision between the pessimistic state and the high arousal outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1298.373,
    "end": 1305.359,
    "text": "So what this means is that these agents get high arousal outcomes and it's like, okay, I'm in a pessimistic state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1305.379,
    "end": 1306.6,
    "text": "I'm in a pessimistic state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.141,
    "end": 1312.926,
    "text": "So this is what we would expect to see with someone who",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.26,
    "end": 1314.101,
    "text": " who is anxious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1314.281,
    "end": 1319.768,
    "text": "So this high arousal, it's getting, giving a lot of information that you're in a, in a certain state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.091,
    "end": 1327.778,
    "text": "And then here we have this optimistic agent who has a completely flat likelihood matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.798,
    "end": 1340.233,
    "text": "And this is a healthy, healthy, um, mapping because the, whether you are experiencing high or low arousal doesn't, um, give you any, you can be in either state and that's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.155,
    "end": 1341.495,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.931,
    "end": 1344.914,
    "text": " So that's again, how we would think of, of healthy individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.835,
    "end": 1351.961,
    "text": "Uh, they can experience high arousal and that can be from a good or a bad thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.101,
    "end": 1355.584,
    "text": "And they, it doesn't give them a signal or something bad's happening right away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.386,
    "end": 1363.672,
    "text": "So this was also, we were excited to see this, um, this kind of mapping in the likelihood matrix from the simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.713,
    "end": 1368.217,
    "text": "We also found a lot of variability in these as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1368.237,
    "end": 1371.82,
    "text": "These are just two examples, cuz we ran 200 different agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.795,
    "end": 1377.943,
    "text": " Um, but again, variability for us and what we're doing is a good thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.484,
    "end": 1387.537,
    "text": "So this just gives us, um, yeah, more ways we can look at that different individuals so that we were happy to see the variability as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1391.223,
    "end": 1401.098,
    "text": "So just to sum up experiment one, um, we found that exposure to more negative valence events, reduced optimism, which is what we wanted to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.82,
    "end": 1408.014,
    "text": " We found that pessimistic agents learnt higher precision for high arousal, which inferred pessimistic state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.036,
    "end": 1413.746,
    "text": "And then we found optimistic agents had a flat likelihood matrix, so arousal did not influence their state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.127,
    "end": 1416.492,
    "text": "So these were two things that we wanted to find.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.497,
    "end": 1421.483,
    "text": "So now I'll go on to experiment two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.876,
    "end": 1430.143,
    "text": " So for experiment two, we use the belief updating task that's used in literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.163,
    "end": 1434.449,
    "text": "This is a standard optimism task that's used in humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.291,
    "end": 1442.959,
    "text": "And the way this task works is a participant is asked to estimate the likelihood of a bad thing happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.72,
    "end": 1446.843,
    "text": "So what's the likelihood you'll develop cancer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.923,
    "end": 1448.365,
    "text": "And you give that estimation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.577,
    "end": 1454.604,
    "text": " And then the participant is shown the actual likelihood of that estimation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.644,
    "end": 1460.273,
    "text": "And that likelihood can be lower or higher than their estimation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.214,
    "end": 1468.004,
    "text": "So if they're told their risk of something bad is lower, that's considered a good news trial because they've just been given good news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.745,
    "end": 1474.694,
    "text": "Whereas if they're told their risk of something is worse, that's a bad news trial because they've just been given bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.737,
    "end": 1478.419,
    "text": "And you can look at how much",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.939,
    "end": 1506.263,
    "text": " participants update to good news so how much do they change their beliefs when they get good news versus how much they change their beliefs when they get bad news so it's measured it's measured here so we can see that this is the control so controls that are optimistic because people are generally optimistic and we can see that they update more to good news than bad news and then we have the participants who have major depressive disorder",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.58,
    "end": 1510.706,
    "text": " and they don't have the same asymmetry when they update to good and bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.752,
    "end": 1532.217,
    "text": "So we wanted to use this task to see if the optimism state factor that we simulated in this first experiment could then be used in the belief updating task",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1532.821,
    "end": 1537.127,
    "text": " to show if we can see the results that we find in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.348,
    "end": 1561.478,
    "text": "Because if we can then show that, well, agents who are more optimistic by our model, how we're defining optimism, update, have this same asymmetry in belief updating, and that pessimistic agents don't, then our model, it's kind of more evidence to show that our model might be capturing something that's useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.348,
    "end": 1566.271,
    "text": " So I'll go over the model here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.291,
    "end": 1574.198,
    "text": "So we set up the task so we had the optimism and pessimism state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1574.218,
    "end": 1582.967,
    "text": "So if the agent was in an optimistic state, it updated more to a good outcome than a bad outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1584.488,
    "end": 1591.735,
    "text": "If the agent was in a pessimistic state, it updated more to a bad outcome than a good outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.035,
    "end": 1595.618,
    "text": " the likelihood matrix here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.02,
    "end": 1604.326,
    "text": "There was an initial hidden state factor, which was the belief about the good versus bad outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.427,
    "end": 1609.691,
    "text": "So the agent gets this belief about the good versus bad outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.191,
    "end": 1617.898,
    "text": "They're then fed observations, which is either better than expected or worse, so good news or bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.918,
    "end": 1620.22,
    "text": "So they're given good news or bad news observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.917,
    "end": 1630.77,
    "text": " And then, so then they are updating their hidden state factor belief from the observation of good versus bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.434,
    "end": 1639.103,
    "text": "And whether they're in an optimistic or pessimistic state, this influences how much they update to good versus bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.706,
    "end": 1646.916,
    "text": "So the optimism state factor is conditioned on this updating here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.393,
    "end": 1658.502,
    "text": " And then we took the difference between the initial hidden state factor belief, so that's here, compared to the hidden state factor belief after the observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1658.622,
    "end": 1662.186,
    "text": "So that's the D and then in the next step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.107,
    "end": 1667.892,
    "text": "And we took the difference to look at the good versus bad news for the updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.574,
    "end": 1678.843,
    "text": "For this, we actually ended up running, so usually in the tasks that human participants run, they do 70 trials, so we wanted to do 70 trials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.005,
    "end": 1684.309,
    "text": " The way that this best worked though, was to actually run 70 different models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.09,
    "end": 1689.675,
    "text": "So we, so each model is, um, each trial is a different model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.076,
    "end": 1704.75,
    "text": "And then we take the results of, of each of those, um, which, yeah, I mean, I guess that can, we can get into a discussion about modeling and what we're modeling and how it's working.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.79,
    "end": 1709.134,
    "text": "But I suppose you can think of like, well, if we have a model of my,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.536,
    "end": 1719.81,
    "text": " belief about car accidents and we have a model about my belief about cancer, they could all be different models for this purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1719.87,
    "end": 1724.637,
    "text": "It's a different belief that we're, it's a different concept, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.14,
    "end": 1730.685,
    "text": "I hope this is all making sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.745,
    "end": 1739.357,
    "text": "I haven't done an online talk for ages and it's hard to know how this is going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.193,
    "end": 1741.594,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.634,
    "end": 1746.902,
    "text": "So we've got our belief updating task and let's look at the results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.266,
    "end": 1753.193,
    "text": "So here we have our optimism state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1753.213,
    "end": 1754.796,
    "text": "So this is the optimism level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.856,
    "end": 1756.338,
    "text": "So this is a very optimistic agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.358,
    "end": 1758.382,
    "text": "This is a very not optimistic agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1759.684,
    "end": 1764.752,
    "text": "And we find that the optimistic agent updates more to good versus bad news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.213,
    "end": 1766.475,
    "text": "So we can see that here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1767.485,
    "end": 1771.831,
    "text": " And we can see that the more pessimistic agents update more to bad versus good news.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1773.393,
    "end": 1782.966,
    "text": "And then here we have this figure from the study that looked at optimism in controls versus people with major depressive disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.228,
    "end": 1792.519,
    "text": "And we have this here to show that we did kind of replicate this pattern in belief updating in our simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.96,
    "end": 1794.522,
    "text": "So that was exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.092,
    "end": 1821.032,
    "text": " the major so if if these if the people with mdd uh have more real depressive realism then they would be this optimism level 0.5 and we can see that we that we are replicating this result um so that was that was exciting because this we were able to show that so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.042,
    "end": 1827.749,
    "text": " We found that our belief updating task simulation results were comparable to the literature on optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.192,
    "end": 1838.021,
    "text": "So we say that this is kind of some evidence for our optimism model because we're able to replicate things that are already out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.204,
    "end": 1844.649,
    "text": "And this also provides a good basis for a model that can be tested for fitting data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.729,
    "end": 1851.778,
    "text": "So if you think about the first, when I was talking about the goals of using models in the clinic, we want to have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1852.163,
    "end": 1855.086,
    "text": " models that we can also collect data and fit them for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1855.166,
    "end": 1859.551,
    "text": "And not all models are able to do that so easily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1859.572,
    "end": 1861.434,
    "text": "It can be tricky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.534,
    "end": 1872.206,
    "text": "So this is a model that we can now just go and get people to do this task and fit the model to see if we then get the same optimism state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.246,
    "end": 1875.25,
    "text": "And we can also look at the likelihood matrices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.31,
    "end": 1877.412,
    "text": "So that's stuff that we can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.092,
    "end": 1882.816,
    "text": " All right, so now I'm onto the last experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.518,
    "end": 1890.306,
    "text": "So we have simulated the loss of optimism or maintained it depending on the development of the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.847,
    "end": 1894.872,
    "text": "We've shown how it's worked in this belief updating task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.892,
    "end": 1898.878,
    "text": "And now we're gonna look at optimistic action in this two-armed bandit task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.761,
    "end": 1909.052,
    "text": "And in this two-armed bandit task, what we did was the agent could either select left or right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.382,
    "end": 1914.606,
    "text": " So left was high risk, high reward, right was low risk, low reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.447,
    "end": 1919.952,
    "text": "Or there was a third option where the agent could select stay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.352,
    "end": 1922.695,
    "text": "So this was like the safe option.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1923.656,
    "end": 1926.999,
    "text": "So if you selected stay, you didn't lose any money, but you didn't win any money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.481,
    "end": 1939.933,
    "text": "And this is an important thing to be able to model for what we're interested in, because if you are depressed and you're not optimistic,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.302,
    "end": 1948.391,
    "text": " one of the things that you can tend to do is, is stay at home and not go out and engage in all those things that, that I was talking about at the start of the talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.773,
    "end": 1963.449,
    "text": "So it's, it's helpful if we can see, um, to model this, what, what, who would be decided making this decision to stay, stay, you know, just stay safe, stay at home, not, but not getting any rewards overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1965.511,
    "end": 1967.153,
    "text": "And one of the, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.5,
    "end": 1982.558,
    "text": " this is kind of related to optimism, but one of the, um, interventions for depression at the moment is behavioral activation in cognitive behavioral therapy, which is the idea to get people to go out in, in the world more and engage in more things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.059,
    "end": 1988.345,
    "text": "So it, it would be good if we could have a task that we can measure this, this decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1989.727,
    "end": 1992.25,
    "text": "So that's what we, that's what we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.393,
    "end": 1998.118,
    "text": "So in this task, yeah, we have our, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.617,
    "end": 2003.983,
    "text": " Our three actions that say, so this, this model involves policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2004.143,
    "end": 2008.048,
    "text": "So we've had a hierarchical model to begin with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.809,
    "end": 2012.373,
    "text": "We had this second, our second model had no policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.393,
    "end": 2015.838,
    "text": "And then this is where the agent, this is where our optimistic action comes in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.98,
    "end": 2021.625,
    "text": "And here again, we have our optimism versus pessimism state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.095,
    "end": 2024.218,
    "text": " So this is what's been going on throughout.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.999,
    "end": 2030.147,
    "text": "And so here we have the generative process, which is actually just the structure of the two-armed bandit task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.008,
    "end": 2039.48,
    "text": "So if I select left, we've got 70% chance of a large win, 30% chance of a large loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.54,
    "end": 2044.428,
    "text": "If I select right, we've got 65% chance of a small win, 40% chance of a small loss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.35,
    "end": 2047.512,
    "text": "So this is what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2047.745,
    "end": 2048.827,
    "text": " in the actual task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.907,
    "end": 2050.75,
    "text": "And this is the belief of the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.97,
    "end": 2058.203,
    "text": "So if you're optimistic, you have this high precision over the large win, and the small wins are just wins in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.243,
    "end": 2064.934,
    "text": "And if you're pessimistic, you have this large precision over the over the loss of the losses rather than the wins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2066.216,
    "end": 2068.76,
    "text": "And this is controlled by this state factor here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.722,
    "end": 2072.166,
    "text": "This is how that the agents updating their beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.183,
    "end": 2080.27,
    "text": " Um, and we ran, I think it was 60 trials for, for this, for this task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2083.534,
    "end": 2086.998,
    "text": "So here are our results for this task, the total winnings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.759,
    "end": 2089.762,
    "text": "And so again, we've got our optimism level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.842,
    "end": 2095.249,
    "text": "So this would be an agent with optimism level 0.9, optimism level 0.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.349,
    "end": 2096.871,
    "text": "So this is a pessimistic agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2098.133,
    "end": 2102.318,
    "text": " And we can see that the more optimistic an agent is, the more winnings they have overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.979,
    "end": 2113.371,
    "text": "So in this task setting, having this precision over these positive outcomes was led to this higher winnings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.911,
    "end": 2118.857,
    "text": "The agent who had the precision over the low outcomes actually ended up losing money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2118.917,
    "end": 2124.664,
    "text": "But what's also important about this figure is that we can see that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2125.083,
    "end": 2128.347,
    "text": " It wasn't that the most optimistic agent had the most winnings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.408,
    "end": 2131.332,
    "text": "We see that the agent here has the most winnings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.593,
    "end": 2146.512,
    "text": "And an important idea when we're thinking about optimism and interventions is it probably isn't going to be the case that 100% optimism all the time in every situation is a good thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2147.253,
    "end": 2152.12,
    "text": "Different environments that we're in, there's going to be different levels of optimism that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.994,
    "end": 2154.476,
    "text": " that are going to be most beneficial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.536,
    "end": 2170.556,
    "text": "And that's another thing that's what's so nice about being able to do these models is that we can kind of explore what those different levels look like and test that out in different environments rather than just saying, oh, optimism is good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.596,
    "end": 2177.004,
    "text": "Let's make everyone optimistic without actually really understanding how it's going on in this sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.605,
    "end": 2180.368,
    "text": "So findings like this are important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.643,
    "end": 2189.369,
    "text": " So then we wanted to look at, well, what's the actions of these agents that led them to these different outcomes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.61,
    "end": 2198.136,
    "text": "So we have our pessimistic agent here, and we can see that they just selected left and right, and then they're just like, no, that's it, I'm just gonna stay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2198.977,
    "end": 2208.806,
    "text": "So we can think of this as somebody who might be depressed, who goes out, has some bad times, and they're like, no, I'm just gonna stay at home now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.126,
    "end": 2211.688,
    "text": "That's not gonna give me any,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.989,
    "end": 2214.473,
    "text": " any of rewards or anything that I'm looking for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2214.493,
    "end": 2221.483,
    "text": "We have this middle agent who kind of went back and forth between the left and right arm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.523,
    "end": 2229.696,
    "text": "And then here we have the optimistic agent who went right, left, and then just stayed in the left arm, which is the high risk, high reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2229.716,
    "end": 2235.364,
    "text": "But overall, that would lead you to the most money in the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2236.677,
    "end": 2248.93,
    "text": " Uh, so this, this is nice because we can see, um, what kind of actions, uh, the actions of how, uh, what kind of actions would result from the different beliefs that these agents have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.95,
    "end": 2252.173,
    "text": "And this is the behavior that we've been talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.038,
    "end": 2261.183,
    "text": "So our two armed bandit task, uh, was able to capture optimistic action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.935,
    "end": 2274.051,
    "text": " And we could see that the optimism promoted the engagement action because the optimistic agents didn't select stay, they kept going in the task, selecting left and right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.754,
    "end": 2284.427,
    "text": "We also found that full optimism is not the most beneficial in this task setting, which is an important consideration, especially if we're thinking about interventions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.93,
    "end": 2292.739,
    "text": "And then, yep, so they were the three simulations that we ran.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2293.833,
    "end": 2307.026,
    "text": " So with these three different simulations, we feel like this is pretty good initial support for an active inference model of optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.086,
    "end": 2313.913,
    "text": "There's a lot of positives about modeling optimism with this active inference model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.093,
    "end": 2316.215,
    "text": "We can use it in these different task settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2316.756,
    "end": 2320.039,
    "text": "We've set up models that we can now collect data for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2320.099,
    "end": 2323.823,
    "text": "So that's the first conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.081,
    "end": 2334.873,
    "text": " Our model demonstrated how optimism could be lost in development, which is an important consideration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.933,
    "end": 2342.284,
    "text": "Our belief updating task grounded the model in literature on optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.604,
    "end": 2347.911,
    "text": "So we're able to show, okay, this is how it fits to things that are already out there measuring optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2347.951,
    "end": 2355.582,
    "text": "And our two-armed bandit task was able to show how optimistic action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2356.068,
    "end": 2358.071,
    "text": " was able to measure the optimistic action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.715,
    "end": 2366.925,
    "text": "So the next step is to fit participant data to the optimism model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2367.406,
    "end": 2370.731,
    "text": "And we've designed these models with that in mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.872,
    "end": 2384.472,
    "text": "So a lot of the choices that we made were for this next step, which is going to be an exciting step, I think, to see if we can see if this is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.722,
    "end": 2389.371,
    "text": " we can get data to fit and then hopefully use these models as a tool in the clinic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.034,
    "end": 2391.475,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.403,
    "end": 2395.764,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.008,
    "end": 2399.632,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.153,
    "end": 2400.513,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.533,
    "end": 2403.439,
    "text": "Should I keep sharing this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2403.942,
    "end": 2406.324,
    "text": " If somebody asked something, we can bring it back up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.525,
    "end": 2408.026,
    "text": "But um, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.287,
    "end": 2410.289,
    "text": "Thank you for the for the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.489,
    "end": 2415.134,
    "text": "Um, Jakob, do you want to give any initial thoughts or or?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.017,
    "end": 2423.783,
    "text": "No, this is a result of Beth's brainpower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.163,
    "end": 2426.766,
    "text": "And so I'll leave word to Beth on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.708,
    "end": 2428.988,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.913,
    "end": 2436.58,
    "text": " Okay, so a few questions I wrote down and then also we'll see what else people ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.161,
    "end": 2447.192,
    "text": "So what brought you from the review of how people had modeled optimism to this relationship with anxiety and arousal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.794,
    "end": 2456.261,
    "text": "So why was I interested in the optimism and the arousal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.422,
    "end": 2456.882,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.178,
    "end": 2467.791,
    "text": " Because it seems like you could be very chill and believe that, you know, the lottery is going to be better than expected or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.432,
    "end": 2474.419,
    "text": "So what brought you into looking at the relationship with arousal specifically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.18,
    "end": 2477.363,
    "text": "Yeah, that's a really good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2477.443,
    "end": 2486.295,
    "text": "It was thinking about events that happen in childhood and development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.427,
    "end": 2516.13,
    "text": " that can cause like so so what happens when when a child has a traumatic event what happens when they're in an uncertain environment um so initially that was the idea and then we're thinking about this arousal seems to play a part in in these traumatic events and that is when um when children are developing they are learning this this kind of mapping so we first think of that and then we looked at the literature on optimism and arousal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.549,
    "end": 2523.456,
    "text": " And then it's like, oh, actually, optimism actually helps maintain healthy arousal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.957,
    "end": 2532.125,
    "text": "So it was kind of, it was just a search, I guess, and finding, thinking about what happens during development that might affect optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.265,
    "end": 2534.107,
    "text": "What's the nature of those experiences?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.788,
    "end": 2540.594,
    "text": "So what is it about those experiences that cause a child to feel a certain way or have a certain belief?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.674,
    "end": 2543.117,
    "text": "Obviously, there's something going on in the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.157,
    "end": 2546.1,
    "text": "Those things are connected to anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.738,
    "end": 2548.54,
    "text": " And then that, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.56,
    "end": 2556.709,
    "text": "And then it happened to be like, oh, this is, this is cool and interesting now because we're reading on optimism and arousal and optimism is good at maintaining that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.07,
    "end": 2559.232,
    "text": "Can we fit those things together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.272,
    "end": 2561.695,
    "text": "Uh, so we kind of explored it in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.775,
    "end": 2572.307,
    "text": "And I guess what's also nice about running the simulations is when we come up with those ideas, uh, when maybe not, so they're interesting ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.557,
    "end": 2574.123,
    "text": " We're not a hundred percent sold on them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.223,
    "end": 2576.633,
    "text": "And then you run the simulations and then you're like, oh, okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.653,
    "end": 2581.993,
    "text": "This, we can see these dynamics playing out, um, which seems to tell us something interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2583.391,
    "end": 2584.552,
    "text": " Yes, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.872,
    "end": 2591.198,
    "text": "Formalizing structurally different ways of thinking about these psychological constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.759,
    "end": 2608.855,
    "text": "And what about like any situations where pessimism or just sort of on the mark accuracy, like what is it about situations or lifestyles or different areas where optimism is relevant?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.895,
    "end": 2612.318,
    "text": "And is it always that way or where wouldn't it be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.192,
    "end": 2616.557,
    "text": " So if there's a situation where optimism is not a good thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.439,
    "end": 2617.699,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.859,
    "end": 2618.14,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.961,
    "end": 2624.27,
    "text": "Well, I think it really is important to think of an individual's environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.071,
    "end": 2629.738,
    "text": "So, I mean, I live in Melbourne, I have a great life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2630.119,
    "end": 2636.449,
    "text": "For me, it's like very good thing to be optimistic because if I go out into my environment, there's lots of opportunities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.8,
    "end": 2643.466,
    "text": " So it, it pays for me to think things are better than they are because I can go out and do all these things and, and there's lots of opportunities there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.426,
    "end": 2652.873,
    "text": "I wouldn't say someone in a, a Syria, like if someone's in a war zone, I wouldn't say, oh, you know what you should be optimistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2652.934,
    "end": 2656.997,
    "text": "Like that's an environment where optimism won't be beneficial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2657.197,
    "end": 2663.062,
    "text": "And when we're thinking about these interventions, that's such an important thing to consider.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.082,
    "end": 2664.783,
    "text": "Uh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2664.804,
    "end": 2666.605,
    "text": "So, and also if we're, if.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2666.939,
    "end": 2675.208,
    "text": " So you could have a, a patient who might be in depressed or low optimism because they're in something like a domestic violence situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.669,
    "end": 2678.873,
    "text": "You wouldn't wanna say, oh, you should, um, just be optimistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2678.893,
    "end": 2679.634,
    "text": "Like that will help.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.914,
    "end": 2682.477,
    "text": "You wanna help fit their environment first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.037,
    "end": 2691.347,
    "text": "So I think the environment is such a big, important part in when optimism is a good thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.528,
    "end": 2693.149,
    "text": "Um, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2694.293,
    "end": 2696.296,
    "text": " Jakob and I have spoken about this a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.698,
    "end": 2700.382,
    "text": "So this is the idea of the generative model and the generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.764,
    "end": 2709.436,
    "text": "If we are optimistic and we have these positive beliefs and then we engage in these positive actions, we do also change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.237,
    "end": 2716.507,
    "text": "We can influence the generative process so we can change our environment to be better as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.647,
    "end": 2720.593,
    "text": "So it's kind of like a feedback loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.613,
    "end": 2723.457,
    "text": "So there are situations where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.382,
    "end": 2736.374,
    "text": " being optimistic because your environment affords you opportunities, but then that optimism and engagement changes the environment to afford even more opportunities and make things better overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.477,
    "end": 2740.879,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.899,
    "end": 2741.86,
    "text": "Make, make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.2,
    "end": 2754.152,
    "text": "Some situations where the agent's beliefs or actions don't change like the slot machine, but then there's other situations like maybe interpersonally where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.073,
    "end": 2779.195,
    "text": " getting somebody else excited is part of like a feedback loop that that um okay i'll ask a question from the chat upcycle club wrote do you think active inference can help computational psychiatry and even cognitive science in general to model additional cognitive biases beyond the optimism bias",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.693,
    "end": 2783.177,
    "text": " Um, that's a really good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.677,
    "end": 2796.335,
    "text": "And yeah, I think that we can model, I think it lots of different biases with active inference, and other models as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2796.355,
    "end": 2809.975,
    "text": "And I think that they're going to be really important in computational psychiatry, because so much of our behaviour and the things that we do have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.022,
    "end": 2811.784,
    "text": " A lot of it can be from the biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2812.045,
    "end": 2814.608,
    "text": "I mean, we all have them, all different biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.049,
    "end": 2816.551,
    "text": "And a lot of them we're not aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.812,
    "end": 2819.455,
    "text": "So a lot of them we think we don't have them, but we do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.495,
    "end": 2824.683,
    "text": "And these models are a really good way of investigating that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.143,
    "end": 2827.607,
    "text": "I have lots of biases I think I don't have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.087,
    "end": 2839.303,
    "text": "And yeah, but if I could have a model of it and do a task that could look into that without me self-reporting on it, I would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.672,
    "end": 2841.013,
    "text": " probably would be very helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.074,
    "end": 2868.598,
    "text": "And I guess the argument for using active inference is when we are going out in, so the way that the active inference modeling works and we're doing actions to kind of fulfill these beliefs that we have, it can kind of show how all of these different biases could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2869.287,
    "end": 2878.656,
    "text": " sustained, I guess, not just the optimism one others as well, because we're looking for observations and being in the world to, to, to fit our model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.003,
    "end": 2902.213,
    "text": " yeah the piece about action as like a self-fulfilling prophecy in active inference is is interesting because in a reward maximization model of behavior selection it's almost like optimism or at least doing the best of the options that are available that's the nature of action selection itself whereas in active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.447,
    "end": 2930.8,
    "text": " Something is being selected because it's believed to be likelier or likeliest So in that sense it sort of seems to on a first pass encode this sort of ball rolling downhill Just down the middle things should be just right as they are So then it's interesting to see like what are the ways that you you can model optimism and then the fact that you had it as a second level of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.843,
    "end": 2957.412,
    "text": " sits it as a sort of domain general feature or like cognitive summary variable um so is this like the same generative model that you adapted three ways or or how were the across the experiments was it the same graph being used in slightly different settings yeah it was the same the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.51,
    "end": 2987.314,
    "text": " model so that was that and and you know i again because we're trying to have a model that has an application at the end i mean ideally if we're thinking about what this is really looking like it would be heaps of levels of models and optimism is that at the very top but that's that wasn't our goal is our goal was something that can be used but that yeah i think optimism is definitely this if we're thinking about hierarchical models it would be kind of very much at the top and shaping our um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2987.598,
    "end": 2991.123,
    "text": " perception and action and all those things in lots of different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.968,
    "end": 3011.631,
    "text": "Jakob, want to add anything or what brought you in the lab to want to explore this question other than having an optimistic belief about a cool grad student?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.298,
    "end": 3017.584,
    "text": " I mean, it's there is this 100% best initiative to focus on optimism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.644,
    "end": 3030.603,
    "text": "And the group as such has a nice kind of active inference focus on, you know, trying to model various things and contemporary contemplative practices as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.544,
    "end": 3032.185,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.485,
    "end": 3040.372,
    "text": " which relates to mental health and wellbeing and optimism is, I've discovered through Beth's work here, really a key element in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.012,
    "end": 3046.717,
    "text": "And then there's some nice, Beth and I have talked a lot about how I might disconnect to the free energy principle and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.737,
    "end": 3059.949,
    "text": "And so we've kind of played rather playfully around with ideas of a universal optimism bias that a self-evident agent should have or might have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.549,
    "end": 3061.21,
    "text": "So trying to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.033,
    "end": 3070.272,
    "text": " So I don't know if you mentioned, Beth, that the optimism bias is found in an astounding range of different creatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.382,
    "end": 3078.471,
    "text": " you know, mice, donkeys, you know, bees, birds, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.092,
    "end": 3083.738,
    "text": "And so it's not like, you know, status bias or things that we humans have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.758,
    "end": 3085.78,
    "text": "It's not a specifically human bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.401,
    "end": 3089.385,
    "text": "It's really astoundingly broad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.685,
    "end": 3093.851,
    "text": "And so again, Beth and I have talked a lot about, well, that's a kind of funny thing, isn't it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.311,
    "end": 3098.757,
    "text": "That it seems more fundamental than other biases or maybe other biases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.26,
    "end": 3101.402,
    "text": " kind of linked to the optimism bias or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.503,
    "end": 3112.014,
    "text": "And so we then found some traces of optimism bias in the work from Thomas Parr and so on as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.034,
    "end": 3117.32,
    "text": "And then we tried to kind of rather speculatively draw a line between the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.5,
    "end": 3124.288,
    "text": "So it's a very good example of this lab, this center is very led by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.062,
    "end": 3131.138,
    "text": " you know, the projects that the PhD students and the postdocs want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.338,
    "end": 3133.764,
    "text": "And I kind of come for the ride, which is fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.226,
    "end": 3138.938,
    "text": "And then something magical happens when these things begin to converge and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.958,
    "end": 3141.805,
    "text": "So it's not a coincidence, of course, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.088,
    "end": 3150.395,
    "text": " that Beth's work on optimism here really kind of lifts things up and kind of gives us this kind of sense of, but there's something bigger going on as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.856,
    "end": 3166.23,
    "text": "And then Beth's real focus, as you started talking about Beth, is how can this work out there in the world, in the clinic and so on, which is also incredibly important because it's very easy to sit and just be super enthusiastic about active inference and the free energy principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.85,
    "end": 3168.172,
    "text": "What difference does it make?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.233,
    "end": 3170.914,
    "text": "So that's really nice as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.746,
    "end": 3176.971,
    "text": " Yeah, that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.991,
    "end": 3180.696,
    "text": "So what was the universal optimism bias?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.362,
    "end": 3186.404,
    "text": "Should I talk about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.544,
    "end": 3191.491,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3191.511,
    "end": 3203.348,
    "text": "So I think one way to kind of... So this is written for a kind of celebratory special issue of a journal for Carl Friston's 65th birthday, some of you might have seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.222,
    "end": 3210.409,
    "text": " it's a little bit tongue in cheek, a little bit informal, like these puff pieces, sometimes I wouldn't call it a piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.429,
    "end": 3213.732,
    "text": "But, you know, it's a little bit of a genre and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.752,
    "end": 3217.817,
    "text": "So we allow ourselves to let our hair down a little bit and to speculate a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.658,
    "end": 3232.693,
    "text": "And there's this nice, very short bit in Thomas Paz and Giovanni Pizzugo and Carl Friston's Active Influence book where in one of Thomas's earlier papers as well, where he says,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.197,
    "end": 3242.351,
    "text": " you know, if the agent exists, it must be able to kind of withstand the dissipative forces of the universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.072,
    "end": 3259.255,
    "text": "And then Thomas goes on and says, this means there's a kind of optimism bias that must be in play where in this coupled isolation between the agent and the surrounding world, that the agent kind of believes that they have the upper hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.218,
    "end": 3263.001,
    "text": "And we interpret that as a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.217,
    "end": 3272.775,
    "text": " universal optimism bias and then we try to draw the line to this behaviour that we see in all these different kinds of creatures and organisms out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.398,
    "end": 3282.593,
    "text": "To put an idea out there more than to kind of prove anything but it was kind of an interesting thing to think about because then the optimism bias",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.024,
    "end": 3298.928,
    "text": " and we can kind of come around in a circle between something very fundamental about the free energy principle and self-evidencing and so on, and then the focus of Beth's work on clinical relevance and so on, and maybe somehow arrive at something interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.608,
    "end": 3302.509,
    "text": " That's cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.529,
    "end": 3308.678,
    "text": "It's kind of like seeing the first principles grounding for what is seen in the clinic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.238,
    "end": 3321.675,
    "text": "And then if the beliefs were, if the bee or the person or whatever it is, believes that things are worse than they are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.668,
    "end": 3350.616,
    "text": " then that could be part of a descending spiral so the question is how much optimism from sort of like just a tiny bit to delusionally risky and then it um sets that as something about differential persistence like you could have whole populations and simulating um evolution and all this with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.035,
    "end": 3374.022,
    "text": " different kinds of um biases um so where else slash next will you be heading in the work beth um so we just have also put out a pre-print with some rat data some um so it was a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.322,
    "end": 3403.165,
    "text": " study uh giving rats psilocybin which is the ingredient in magic mushrooms and we did active inference model fitting to that data to show that over time psilocybin was increasing optimism in the rats and uh well that we it's it's kind of the same task paradigm that the rats can decide to engage in the task or not so so similar to the the two unbanded task i just spoke about um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3403.668,
    "end": 3412.984,
    "text": " So that's something I'm super excited about because obviously psilocybin is getting a lot of interest at the moment with treatments for depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.144,
    "end": 3417.932,
    "text": "So I think understanding the mechanisms of that is super important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.433,
    "end": 3428.41,
    "text": "And so hopefully that work can go to the next step when we're looking to see how those models might work in humans, like the psilocybin and active inference models might work in humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.082,
    "end": 3434.829,
    "text": " Then data fitting for collecting data for the studies I spoke about today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.849,
    "end": 3444.64,
    "text": "We also are coming out with a computational model of how gratitude practice might increase optimism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3445.741,
    "end": 3451.247,
    "text": "And again, that's all thought out with how we can then collect data and fit and test that as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.508,
    "end": 3456.253,
    "text": "So lots of different optimism interventions and modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.9,
    "end": 3488.755,
    "text": " how do you see epistemic value in relationship to optimism um like learning and updating um for its own sake rather than right expecting utility of a situation well i think that that is inherently optimistic do you does that make that i just think that that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3489.173,
    "end": 3499.471,
    "text": " Like that is an optimistic thing to go out there and reduce uncertainty and believe that there's, you know, just for the sake of like, oh, well, there's going to be something more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.132,
    "end": 3505.081,
    "text": "I think that that's an optimistic action and belief in itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3507.104,
    "end": 3511.452,
    "text": "I think also what we've talked about death often is –",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.87,
    "end": 3519.218,
    "text": " If you don't optimistically engage, you might be missing a state transition out there in the environment that might have happened without you knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.318,
    "end": 3526.346,
    "text": "So you keep going to parties, all parties suck, and you keep, you optimistically keep going out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.047,
    "end": 3531.492,
    "text": "And part of it is, well, maybe I'll go on the 10th party.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.973,
    "end": 3535.617,
    "text": "There's been a bit of a change in the social scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.597,
    "end": 3554.719,
    "text": " the toxic person has left i have matured a bit now it will be good so there's been these state transitions and if i don't engage i won't learn like i won't get the epistemic value about state transitions up so that's a kind of an element of an epistemic side of optimism maybe as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.83,
    "end": 3557.314,
    "text": " That's very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.434,
    "end": 3567.26,
    "text": "It's sort of like, it could be possible if, especially what you brought in in the third example with actions over optimistic states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.28,
    "end": 3568.523,
    "text": "So basically,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3569.735,
    "end": 3597.666,
    "text": " attention or the ability to control one's optimism state i mean that'd be kind of cool but then there'd be a way to weave different foraging bouts so that when you go out and it you go out with high hopes and then when those high hopes are confirmed it's like great i should be that optimistic but then when it wasn't it could be framed as a learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.507,
    "end": 3603.752,
    "text": " And then it could just, you could stay in the game and continue playing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.792,
    "end": 3608.436,
    "text": "It's like I'm playing this slot machine because I think it's going to give a high expected reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.177,
    "end": 3613.501,
    "text": "And then I'm going to play this one because I'm trying to learn what its reward is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.561,
    "end": 3628.294,
    "text": "And then that might keep one doing that engaged action rather than, that's very interesting, rather than only like putting the thumb on the scale of utility and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.882,
    "end": 3629.844,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.864,
    "end": 3644.038,
    "text": "This is kind of related, but we found something really cool in the rats where over time, so it was like the last days of the, it was like 14 days after the psilocybin treatment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.795,
    "end": 3648.881,
    "text": " the rats who were given the psilocybin had lower loss aversion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.021,
    "end": 3653.687,
    "text": "So in the C matrix, like the value of the loss was smaller for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3654.429,
    "end": 3661.038,
    "text": "So the idea is like, yeah, you can go out somewhere and even if you get something bad, it just doesn't affect you as much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.118,
    "end": 3664.122,
    "text": "You're kind of like, you're more resilient to that in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3664.142,
    "end": 3671.613,
    "text": "And that's the example of like, yeah, I can go to 10 parties and I have a bad time, but if I'm optimistic, that's not affecting me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.653,
    "end": 3672.574,
    "text": "And I'm, yeah, I'm,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3672.824,
    "end": 3692.74,
    "text": " still learning i'm still going out there and i'm curious to see like what the 11th party is gonna bring which is a good thing it will it will be it will be a very interesting journey i mean you laid out sort of the road map with going from the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3693.023,
    "end": 3717.883,
    "text": " the conceptualization of the problem through the simulation and then that will be interesting on the sort of diagnostic sense-making side and then on the intervention side and then also so many existing um diagnostic instruments and interventions may kind of fit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.129,
    "end": 3744.867,
    "text": " into this way of um modeling i'll i'll um ask a question from the chat courtney asks would you consider a bias the same as an expectation is optimism the expectation of a positive outcome yeah so that's a good question i so it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.467,
    "end": 3754.879,
    "text": " it is an expectation of a good outcome, but then it also affects your, it's not just the expectation because it also affects your belief updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3755.94,
    "end": 3759.625,
    "text": "So it's not just, oh, I expect the good things to happen when I get the good things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3759.686,
    "end": 3764.873,
    "text": "They're also changing my beliefs more than, um, the bad things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3765.013,
    "end": 3771.122,
    "text": "And I think if it was only an expectation, you wouldn't have that asymmetry when you're updating your belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.783,
    "end": 3774.727,
    "text": "So I think that's why it's more just like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.747,
    "end": 3776.389,
    "text": "That's probably more of the bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3777.162,
    "end": 3803.912,
    "text": " component to it it affects different things not just it can be carried out in these different ways not just that that one way whereas if i just have positive expectations that might not necessarily mean when i get the positive thing i update more to that positive outcome as well but they're all good questions like how these different things connect so i would say positive expectations isn't one element of the optimism bias",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3807.284,
    "end": 3808.066,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.609,
    "end": 3823.116,
    "text": "Any sort of closing thoughts or what do you leave people with slash how could they learn more or build up their optimism bias or whatever it may be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.227,
    "end": 3827.651,
    "text": " Well, thank you so much for inviting us on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3827.712,
    "end": 3829.013,
    "text": "This has been so nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3829.173,
    "end": 3830.535,
    "text": "It's been really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3830.655,
    "end": 3836.843,
    "text": "It's so exciting when you do your own work and you're like, how is this fitting to anything or is anyone interested in this at all?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3836.864,
    "end": 3839.427,
    "text": "And then you have nice conversations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3839.507,
    "end": 3841.369,
    "text": "It's always really positive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3843.893,
    "end": 3850.501,
    "text": "Yeah, I think it's... I hope that this kind of work gives people hope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.541,
    "end": 3853.305,
    "text": "And I...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.247,
    "end": 3862.48,
    "text": " I hope that also there's people who want to use Active Inference in these more practical ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.58,
    "end": 3863.502,
    "text": "It's been helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3864.082,
    "end": 3869.972,
    "text": "And if anyone ever wants to reach out and talk about ways to do that, I'm happy to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3870.012,
    "end": 3874.639,
    "text": "Because I think Active Inference holds so much promise as a framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.659,
    "end": 3880.288,
    "text": "And when we can start getting it out there in these kind of settings, that's going to be really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3881.062,
    "end": 3884.046,
    "text": " Yeah, and if you can, try and be optimistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3885.347,
    "end": 3888.051,
    "text": "And if you can't, we might have some interventions for you soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.954,
    "end": 3891.355,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.375,
    "end": 3892.756,
    "text": "Jakob, any last thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.46,
    "end": 3899.464,
    "text": "No, I think it's appropriate that death gets last word, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.847,
    "end": 3908.115,
    "text": "Maybe wait until we publish the psilocybin paper before you take magic mushrooms to become optimistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.867,
    "end": 3910.348,
    "text": " Will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.789,
    "end": 3913.134,
    "text": "Will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.154,
    "end": 3913.394,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.875,
    "end": 3916.44,
    "text": "Thank you very much both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.743,
    "end": 3918.444,
    "text": "Till the next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.544,
    "end": 3919.887,
    "text": "And I'm sure it'll be a good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.831,
    "end": 3923.053,
    "text": "Thanks so much, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.173,
    "end": 3923.514,
    "text": "See ya.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.855,
    "end": 3924.837,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3924.857,
    "end": 3924.957,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]