[
  {
    "start": 2.782,
    "end": 3.943,
    "text": " All right, greetings everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.945,
    "end": 13.474,
    "text": "It is October 10th, 10-10, 23, and we're in our discussion of Chapter 7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.554,
    "end": 25.228,
    "text": "So last week, Ali and I recorded like the short video overviews of Chapters 9 and 10, just because there was only a few of us during our Cohort 4 slot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.394,
    "end": 49.191,
    "text": " and we just wanted to complete those um overviews so now we're in the chapter seven um discussion so we'll jump over to the chapter seven page um and before we look at like any of the specific questions like does anybody just want to share um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.875,
    "end": 53.138,
    "text": " What did they think about chapter seven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.158,
    "end": 61.328,
    "text": "What, what was their impression or, or how would they summarize it to, to somebody or what was just exciting to them about chapter seven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.316,
    "end": 68.537,
    "text": "Well, can I start?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.138,
    "end": 77.929,
    "text": "Um, so hello.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.124,
    "end": 106.988,
    "text": " daniel hi yeah go for it go for it yeah so so my um impression of chapter seven is about uh it's mainly about the uh discrete uh state and discrete outcome model of the active inference and i found it is particularly uh useful to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 108.301,
    "end": 116.568,
    "text": " have a detailed understanding of one of the example, which is this T maze example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.011,
    "end": 138.308,
    "text": "And it is kind of the first active inference model that I can get my hand on and try it out and change those parameters or the matrices used in the active inference model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 138.895,
    "end": 145.447,
    "text": " and see how the active inference actually works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 150.336,
    "end": 151.258,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.278,
    "end": 152.48,
    "text": "I think that's kind of the point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.983,
    "end": 159.233,
    "text": "Anyone else want to give a thought on 7?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.25,
    "end": 167.718,
    "text": " Yeah, I would just second everything that Wenxuan said just now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.84,
    "end": 181.638,
    "text": "I think it's a great way to actually see maybe how some of the ideas that we've been reading about prior in the textbook actually start to hang together and play out in an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.658,
    "end": 184.242,
    "text": "I think that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.863,
    "end": 194.314,
    "text": " The use of discrete variables is highly like kind of interpretable I think this is a it comes a little bit more naturally to me to read this chapter versus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.896,
    "end": 206.267,
    "text": "You know Chapter eight with continuous variables, because we get to see like you're you know more precise specific things that have discrete choices and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.928,
    "end": 212.895,
    "text": "and things that occur and then also just some kind of interesting observations that come out of that was a different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.483,
    "end": 234.799,
    "text": " um kind of components of the model like you know as you get further in the chapter there's a discussion of like here are the interesting things that happen whenever you don't include preferences or have highly uniform preferences like there's just pure novelty seeking on the part of the agent who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.387,
    "end": 239.252,
    "text": " Like in the team A's example, they just can't sit still.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.312,
    "end": 241.154,
    "text": "They never come back to the same spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.274,
    "end": 256.813,
    "text": "It's pure just seeking epistemic value, it seems, because there's nothing pragmatic to do, because there's nothing in particular that they're going for, because it's not been hard-coded into the initialized preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.114,
    "end": 262.44,
    "text": "So yeah, just giving us that really big,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.64,
    "end": 271.492,
    "text": " Matt Pinyan, model for active inference here in the discrete form, in addition, seeing the interesting dynamics that can kind of play out emerging properties and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.496,
    "end": 274.997,
    "text": "Matt Pinyan, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.98,
    "end": 278.642,
    "text": "Matt Pinyan, anyone else want to make a general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.924,
    "end": 280.665,
    "text": "Matt Pinyan, comment on seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.855,
    "end": 299.666,
    "text": " I would just echo that, given that I've come from a psychology background, and so seeing the exploration, exploitation paradigm just being laid out in that way, and they make their comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.806,
    "end": 308.553,
    "text": "They believe they've come to understand how these two go hand in hand instead of being competitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.573,
    "end": 311.316,
    "text": "I thought that was also very, very intuitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 314.638,
    "end": 314.979,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.559,
    "end": 316.66,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.062,
    "end": 345.887,
    "text": " yeah the continuous time setting is kind of like having your hand on the rudder in a boat and uh so you're making continuous actions and there's a continuous flow in these paths and the discrete time is like chess or checkers like time clicks discreetly and the actions are discrete the states are discrete and so that can make it kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.323,
    "end": 373.748,
    "text": " clearer a little bit more cut and dry um cool does anybody want to jump to a specific section of seven or we can look at the questions and just like look at the upvoted ones or if anybody submitted any and just like look at what's interesting in seven or or somebody can propose a section that that they want to look at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.186,
    "end": 395.158,
    "text": " I'm mostly interested in chapter 7.3, decision-making and planning as a reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.081,
    "end": 406.232,
    "text": "I wonder if someone else has preference to talk about the 7.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.55,
    "end": 407.611,
    "text": " Yeah, let's get to 7.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.872,
    "end": 410.676,
    "text": "Basically, 7.1 is just one paragraph we can see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.696,
    "end": 415.062,
    "text": "7.2 is just a passive inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.642,
    "end": 419.788,
    "text": "This is just the downstairs section of the discrete time model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.028,
    "end": 425.315,
    "text": "We have hidden states changing through time, being related to observations at each time point and a prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.836,
    "end": 435.409,
    "text": "So it's just the downstairs of figure 4.3, and it's kind of worked out in multiple stages with this music listening example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.676,
    "end": 464.569,
    "text": " so then we get to 7.3 now we take that downstairs the part that looks like an e um and we add in the action so this is where we actually get active inference and then what makes it active inference under the free energy principle is that the unified imperative for action selection is going to be expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.14,
    "end": 492.295,
    "text": " so right because there are other models that have um sense making or signal processing on the inbound and then decision making or action selection or control theory on the outbound like that is in a loose sense active inference but when we're talking about active inference we're talking about active inference and the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.697,
    "end": 496.862,
    "text": " which is what we get when we bring in the variational and the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.683,
    "end": 500.887,
    "text": "Okay, so what aspect of 7.3 do you want to explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.208,
    "end": 504.932,
    "text": "Well, first about this figure that you're showing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.952,
    "end": 511.68,
    "text": "I have a question about the fourth line from the bottom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 513.301,
    "end": 517.326,
    "text": "Do you see third while C and E appear in the panel on the right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.547,
    "end": 520.35,
    "text": "Do you see that sentence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 520.37,
    "end": 520.51,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 522.262,
    "end": 523.183,
    "text": " Where is the E?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.604,
    "end": 527.668,
    "text": "I couldn't find the E. Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.529,
    "end": 532.414,
    "text": "So E is the habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.715,
    "end": 539.122,
    "text": "E represents the prior distribution on policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.203,
    "end": 545.569,
    "text": "So let's just say that we have four affordances, up, down, left, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.43,
    "end": 552.117,
    "text": "The E vector is like 0.25, 0.25, 0.25, 0.25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.265,
    "end": 560.494,
    "text": " So in that situation, E conveys through its inclusion which actions are possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.935,
    "end": 567.761,
    "text": "And by the value in E, that is the prior on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.842,
    "end": 578.813,
    "text": "So if they were all 0.25s and there was four affordances, then that would be like saying those options are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.232,
    "end": 584.981,
    "text": " in the absence of being sharpened by expected free energy are equally likely to be taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.143,
    "end": 598.442,
    "text": "And, um, we can look at, um, the, the nervous system diagram in figure 5.4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.063,
    "end": 607.416,
    "text": "So here's E so here on the indirect pathway observations are coming in habits are being triggered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.083,
    "end": 633.555,
    "text": " on the direct pathway we have expected free energy sharpening our habit distribution that doesn't just mean yeah it doesn't just mean exaggerating it it could upweight something like let's just say there's a rare policy um like but in a given situation it has high epistemic and or pragmatic value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.177,
    "end": 663.002,
    "text": " then you'd hope that even though your prior on um doing it is very low like what's the prior on taking off your seat belt well on a 10-hour car ride it's low but then when the car is stopped and you want to leave that's an amazingly salient thing to do so he basically hosts what can be done and in the absence of any decision-making process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.472,
    "end": 672.761,
    "text": " the distribution of actions to be taken, and then G sharpens that to update the policy posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.742,
    "end": 677.686,
    "text": "And then the policy posterior is where action is sampled from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.548,
    "end": 679.908,
    "text": "I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.029,
    "end": 681.389,
    "text": "I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.79,
    "end": 692.28,
    "text": "From the figure of 7.3, it seems that C and E plays the same role as affecting the distribution of policy, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.868,
    "end": 718.993,
    "text": " they kind of absolutely um absolutely like um free energy expected free energy here G can be understood as a statistical distribution about policy conditioned upon C and E we we just discussed why E matters for the calculation of policy posterior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.918,
    "end": 723.682,
    "text": " C matters because of equation 2.6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.903,
    "end": 733.995,
    "text": "So C matters for G calculation because C is going to decide what is of pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.599,
    "end": 749.233,
    "text": "So in that representation that they have in 7.3, they're basically just saying policy is being computed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.715,
    "end": 756.341,
    "text": " conditioned upon preference and on habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.663,
    "end": 757.963,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 758.003,
    "end": 760.626,
    "text": "So C is preference, E is habit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.006,
    "end": 766.572,
    "text": "So they encode different kind of preferences of the policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.333,
    "end": 767.613,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.959,
    "end": 773.26,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 773.28,
    "end": 774.0,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.08,
    "end": 776.503,
    "text": "That's very, very good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 777.264,
    "end": 777.364,
    "text": "Cool."
  },
  {
    "start": 778.036,
    "end": 785.808,
    "text": " Yeah, I mean, anyone else have like a thought on 7.3 or a question on 7.3 or just how they see it or how they interpret it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.1,
    "end": 795.742,
    "text": "So I have further question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.963,
    "end": 805.697,
    "text": "So again, on this figure of 7.3, so we see the policy pie affects the, the, the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 805.981,
    "end": 835.245,
    "text": " state-pervenient transition matrix B. I wonder if it's possible to model the policy also affect the matrix A, meaning that it not only affects the pervenient transition matrix, but also affects the transformation from the state to the outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.407,
    "end": 841.839,
    "text": " David Price- Great great question all kind of mentioned two ways that you could think about that so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.862,
    "end": 851.361,
    "text": "David Price- As you mentioned policy intervenes in be how things change their time, like when you turn on the air conditioner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.459,
    "end": 879.002,
    "text": " doesn't like reach into the room and just like modify the thermometer it modifies how the temperature changes through time so it modifies the dynamics of the hidden state the temperature and then that results in a thermometer changing so first answer to the question is we don't need policy to change a if we want if we prefer it to be cooler",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.218,
    "end": 902.374,
    "text": " we take the policy to turn on the air conditioner then in the next time step the temperature of the room is going to drop let's say one policy is you know turn on the air conditioner temperature drops by one turn off it it goes up by one so you turn it on the temperature drops in the room and then the thermometer is cooler so one answer is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.945,
    "end": 913.139,
    "text": " you don't really want to touch a, because the mapping between hidden states and observations, isn't really something you can act on directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.68,
    "end": 917.746,
    "text": "And so we're intervening in the real underlying hidden causal process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.048,
    "end": 920.73,
    "text": "And then that admits up first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.75,
    "end": 932.226,
    "text": "And the second answer is you could develop an active inference model where a meta cognitive agent selects, which a matrix to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.775,
    "end": 939.483,
    "text": " So, um, maybe you decide whether to put on sunglasses or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.724,
    "end": 946.893,
    "text": "And then when you have sunglasses on colors are mapped to your vision this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.413,
    "end": 950.097,
    "text": "And when you do something different, they're mapped a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.938,
    "end": 956.546,
    "text": "So that would be taking a policy choice on which aid to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.248,
    "end": 958.348,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 960.151,
    "end": 975.729,
    "text": " But in most settings, the relationship between hidden states and observations, it's orthogonal to, or you could say it's factorized away from how hidden states change their time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.652,
    "end": 986.361,
    "text": "Keeping this model sparse in the sense that keeping as few edges as possible,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.965,
    "end": 996.597,
    "text": " keeps the computational cost low and keeps the kind of parsimony high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.18,
    "end": 999.961,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.981,
    "end": 1000.882,
    "text": "That's very good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.902,
    "end": 1013.597,
    "text": "So yeah, so it really depends on how the states and the outcomes are defined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1015.535,
    "end": 1033.327,
    "text": " Maybe in my case, we can define it in such a way that the policy affects only the state's transition probability, not affecting the translation from the state to outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1034.609,
    "end": 1037.695,
    "text": "Yeah, in almost all cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.822,
    "end": 1054.161,
    "text": " you will have policy only intervening in B. So making a generative model, I mean, this chapter six, making a generative model is, if you can describe what all of these are in your system of interest, you literally have the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.122,
    "end": 1060.869,
    "text": "And how do you categorize different things that you have or want to include into this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.989,
    "end": 1063.892,
    "text": "Well, observations are literally the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.593,
    "end": 1067.817,
    "text": "If it's in a spreadsheet, it's literally an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.505,
    "end": 1072.57,
    "text": " then policies are actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.59,
    "end": 1079.018,
    "text": "So if something is something that an agent can do and then everything else is a hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.561,
    "end": 1097.601,
    "text": "Now, if you're in a fully observable situation like a chessboard, then it can seem like there's a redundancy, like the observation is the location of the piece and the hidden state is the true location of the piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.374,
    "end": 1110.114,
    "text": " So in that case, it's not really a partially observable Markov decision process, POMDP, it's just an MDP because it's a fully observable decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.895,
    "end": 1115.383,
    "text": "But A allows us to bring in the partial observability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.384,
    "end": 1123.977,
    "text": "But if you're in a fully observable setting, then you can almost think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.142,
    "end": 1152.85,
    "text": " direct intervention however even in that case then the a matrix is just an identity matrix like it maps perfectly between hidden states you know you have an accurate thermometer 37 just maps to 37. then a is an identity matrix and it has basically no computational cost and then your model is more flexible in case you ever did have a noisy thermometer or a missing measurement if you had a pomdp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.083,
    "end": 1180.913,
    "text": " then it's fine but if you were to only have the mdp then you can't deal with the noisy or a partially observable setting yes thank you thank you daniel that's very detailed yeah i'll hold out uh hold my questions for okay other participants to ask yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.416,
    "end": 1185.418,
    "text": " Anyone want to just give a thought or a question on this section?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.557,
    "end": 1217.616,
    "text": " um yeah I guess just since it's it's been a bit since I actually read like really did a deep dive on this particular chapter um but um I just I'm trying to make sure I grasp like whenever they're describing the the teammates shortly after um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.558,
    "end": 1219.661,
    "text": " Yeah, I guess we're still in 7.3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.861,
    "end": 1222.788,
    "text": "They just start to describe like the A matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.449,
    "end": 1225.354,
    "text": "Like in this case, they become tensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.361,
    "end": 1233.813,
    "text": "With the TMAs, you have their outcomes and then there are locations and then there are contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.535,
    "end": 1237.562,
    "text": "So I guess the, you know, the mouse,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.897,
    "end": 1258.808,
    "text": " uh searching for a reward is looking for i guess the outcome is like whether the the space they land on is a reward or not um and uh the location is just you know them navigating the maze itself the locations of the maze and then also you have the context i might i might be mixing those up a bit but it's just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.788,
    "end": 1287.445,
    "text": " just trying to make sure i can grasp like we're looking at potentially 3d 4d and so on um like kind of tensor um you know quantities here that are based on all of the kind of dimensions to what the mouse is doing rather than just uh yeah looking at it's like a 2d thing is as nice and simple as that would be yes um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.555,
    "end": 1289.656,
    "text": " Basically, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.956,
    "end": 1294.881,
    "text": "So A, I mean, you could think of it as, okay, well, pull back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.262,
    "end": 1311.238,
    "text": "The context is whether you're in world state A or world state B. So the two contexts are whether the food is on the left or the right in this study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.778,
    "end": 1313.72,
    "text": "You did mention that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.8,
    "end": 1314.041,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.481,
    "end": 1318.545,
    "text": "So now A maps between observations and hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.437,
    "end": 1324.064,
    "text": " there's going to be two types of hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.847,
    "end": 1330.774,
    "text": "And so each of them projects out to a given observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.216,
    "end": 1335.16,
    "text": "A1 is about location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.781,
    "end": 1337.664,
    "text": "A2 is about context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.246,
    "end": 1347.098,
    "text": "I don't know if you would properly call this a tensor, but certainly this is two matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.533,
    "end": 1350.437,
    "text": " But it's not, but they're different shapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.419,
    "end": 1352.801,
    "text": "This is a five by five matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.642,
    "end": 1357.047,
    "text": "And this is a three by four matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.067,
    "end": 1367.602,
    "text": "When we get to B, it will be a true tensor in the sense that every slice of B is going to be a matrix with the same dimensionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.603,
    "end": 1371.728,
    "text": "But here it's kind of like two parallel channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.828,
    "end": 1376.595,
    "text": "Like this would be analogous to having two sensory modalities, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.913,
    "end": 1388.006,
    "text": " So if we had vision and hearing, those A matrices could map to the same hidden state, like maybe, you know, is there lightning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.328,
    "end": 1390.81,
    "text": "Or is there a thunderstorm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.33,
    "end": 1395.135,
    "text": "And you might have a mapping between hearing and is there a thunderstorm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.056,
    "end": 1398.078,
    "text": "And vision and is there a thunderstorm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.14,
    "end": 1403.545,
    "text": "Or you can have those two observation modalities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.655,
    "end": 1428.132,
    "text": " map to two different hidden state modalities like in this case i just want to make one more point before we continue um forward in the teammates because um it was brought up about the explore exploit the most probable policies are those that lead to the lowest expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.247,
    "end": 1442.782,
    "text": " Again, this is one of the key distinguishing features, if not the key distinguishing feature between active inference, guided policy selection, and reinforcement learning or reward maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.802,
    "end": 1452.432,
    "text": "There is no proposal of a reward or utility function that gets optimized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.087,
    "end": 1463.38,
    "text": " There's just the definition of the generative model, and then the generative model does the likeliest thing, given its setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.701,
    "end": 1465.203,
    "text": "Again, that doesn't mean the animal lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.944,
    "end": 1477.018,
    "text": "It doesn't mean that X, Y, Z. It just means that given how the generative model is set up, it does the likeliest thing, and then given empirical results,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.1,
    "end": 1483.487,
    "text": " David Price- Data chapter nine we set up or parameterize the generative model to be the likeliest one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.35,
    "end": 1487.671,
    "text": "David Price- So no okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.691,
    "end": 1492.997,
    "text": "David Price- yeah sorry yeah I do have a question regarding 7.4 where you're right there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1493.017,
    "end": 1494.398,
    "text": "David Price- yeah here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1495.039,
    "end": 1502.787,
    "text": "David Price- So i'm i'm a bit confused what she and Q means um.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1503.813,
    "end": 1512.501,
    "text": " Do we always use P represents the prior or the true distribution and Q as approximate distribution?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1512.521,
    "end": 1533.28,
    "text": "Is this Q the one we actually want, the decision that we intend to change our belief by updating our approximation to the real probability?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1533.715,
    "end": 1535.377,
    "text": " So P is the real map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.417,
    "end": 1535.837,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.519,
    "end": 1539.861,
    "text": "Q is the real mapping in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.764,
    "end": 1544.105,
    "text": "So it's a natural log.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.165,
    "end": 1545.927,
    "text": "So this is kind of like taking a surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.569,
    "end": 1548.99,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.01,
    "end": 1554.816,
    "text": "It's of observations conditioned upon preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.456,
    "end": 1561.242,
    "text": "So this is really what you observe in relationship to what you prefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.943,
    "end": 1575.319,
    "text": " You, and the reason why it has the P is because we're talking about like the, the actual observations coming in and Q is the variational distribution that we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.761,
    "end": 1577.322,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.342,
    "end": 1578.503,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.523,
    "end": 1578.684,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.704,
    "end": 1579.345,
    "text": "Now it's clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.825,
    "end": 1587.575,
    "text": "So we actually, we can change Q to minimize this G Q G pi, this object function here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1587.936,
    "end": 1588.056,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1590.23,
    "end": 1614.094,
    "text": " yeah um yeah like q are about our beliefs whereas we don't really get to control in the same way like we q of observations conditioned upon policy so what do i believe the sequence of future observations will be o tilde conditioned upon what i do that's all in the mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.711,
    "end": 1621.477,
    "text": " that is different than what is the sequence of observations given my preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.858,
    "end": 1629.424,
    "text": "You can change your preferences, but that doesn't change observations given your preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.385,
    "end": 1643.558,
    "text": "And similarly, you could change your belief about hidden states, but you can't in the same way control the mapping between observations and hidden states in actuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.664,
    "end": 1669.714,
    "text": " yeah and this is like a restatement in equation 7.4 of equation 2.6 expected free energy so we have same epistemic and pragmatic value okay so let's go through the teammates and just see how this is gonna play out okay so the two factors so factor is being used to describe a different kind of hidden state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.892,
    "end": 1673.656,
    "text": " So again, there's two factors here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.497,
    "end": 1677.281,
    "text": "There's the context factor and the location factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.943,
    "end": 1689.056,
    "text": "One of those is a controllable factor, location, whereas context is not a controllable factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.917,
    "end": 1697.187,
    "text": "If it were, there would be another policy type, change the food to the left to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.753,
    "end": 1701.181,
    "text": " But we're not in that setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.201,
    "end": 1706.919,
    "text": "So this example brings up the distinction between controllable and uncontrollable factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.263,
    "end": 1709.708,
    "text": "Observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.772,
    "end": 1713.358,
    "text": " They are the fundamental observables that's in the spreadsheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.119,
    "end": 1720.229,
    "text": "Then everything that's not an observation is a hidden state factor, state factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.191,
    "end": 1724.616,
    "text": "And then some state factors are controllable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.518,
    "end": 1729.564,
    "text": "Those are the ones that have policies intervening in their B matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.007,
    "end": 1733.03,
    "text": "Other state factors are uncontrollable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.591,
    "end": 1736.235,
    "text": "It's just a latent cause of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.62,
    "end": 1762.78,
    "text": " that's proposed within a cognitive model but with respect to that uncontrollable state factor that's like listening to music the first example that's like a passive inference on that state factor okay so the controllable state are the are the uh are the locations of the mouse right right because it can move",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.907,
    "end": 1788.582,
    "text": " uncontrollable stays are the locations of the stimulus yeah because the mouse doesn't get to decide where the food is all right yeah okay yeah um so and that's where agency and self-efficacy can come into play is to what extent do actions bear upon um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.975,
    "end": 1817.708,
    "text": " can can the agent take actions and make a difference that makes a difference take an action that changes some state in the world controllable factor and how are and then this is all about how they evaluate that it could be chosen because it has high pragmatic value because doing that kind of exerting that kind of control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.413,
    "end": 1829.771,
    "text": " brings observations closer to alignment with preferences, pragmatic value, or it might lead to new information about the world, epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.692,
    "end": 1843.392,
    "text": "And that's the entropy, the expected difference of the entropy of observations conditioned upon hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.148,
    "end": 1859.828,
    "text": " in comparison with observations conditioned upon policy so this is basically like the entropy of the a matrix so that's that's the mapping between observations and hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.28,
    "end": 1867.752,
    "text": " Here, we're asking how much is it gonna matter differently if we condition upon policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.533,
    "end": 1872.7,
    "text": "So let's just say that the A matrix has a given entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.72,
    "end": 1876.045,
    "text": "The A matrix has a given uncertainty associated with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.143,
    "end": 1879.327,
    "text": " The least uncertain A matrix is like the identity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.887,
    "end": 1882.731,
    "text": "Just one on the diagonal and all zeros elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.151,
    "end": 1884.012,
    "text": "You have perfect knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.152,
    "end": 1885.614,
    "text": "It becomes a fully observable setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.175,
    "end": 1889.739,
    "text": "The most entropy A matrix is just all uniform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.66,
    "end": 1896.507,
    "text": "Basically, the measurements don't even matter because all the measurements are equally likely to map to any hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.588,
    "end": 1899.83,
    "text": "So that's on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.691,
    "end": 1903.855,
    "text": "And now the question is, conditioned upon action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.404,
    "end": 1911.152,
    "text": " is there gonna be a difference in the sharpness of that mapping?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.173,
    "end": 1917.882,
    "text": "Well, if it's a policy that doesn't lead to sharpening of the A, it doesn't have epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.064,
    "end": 1934.567,
    "text": "In comparison, if there's a policy such that you believe that taking that policy is gonna sharpen your understanding of outcomes, then this is a non-zero value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.365,
    "end": 1938.446,
    "text": " So that's the epistemology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.768,
    "end": 1942.63,
    "text": "Yes, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1943.351,
    "end": 1949.357,
    "text": "However, you said that, you know, from the model, the A matrix is fixed, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1949.477,
    "end": 1957.505,
    "text": "It's not affected by, you know, all the entries in A matrix are not affected by the policy pi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1958.226,
    "end": 1965.313,
    "text": "Because policy pi affects only the state transition probability matrix B. And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.58,
    "end": 1970.329,
    "text": " What do you mean by sharpening A using policy pi?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1972.954,
    "end": 1973.855,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.975,
    "end": 1979.105,
    "text": "So there's a few pieces here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.466,
    "end": 1981.269,
    "text": "First off, there's A matrix learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.65,
    "end": 1984.635,
    "text": "That is not happening in this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.662,
    "end": 1992.03,
    "text": " But it is a cognitive phenomena that the A matrix could be updated, but it's not being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.051,
    "end": 1993.132,
    "text": "There's no learning here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.315,
    "end": 2001.583,
    "text": "Now, let's just say that we have observations and hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.745,
    "end": 2009.734,
    "text": "One of the observations doesn't lead to gaining information about hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.036,
    "end": 2014.2,
    "text": "Like it maps 50% of the time to A or B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.142,
    "end": 2021.11,
    "text": " another observation gives you a lot of information about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.472,
    "end": 2037.253,
    "text": "Then that policy can, the policy that leads you to get that informative observation, that has a high epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.595,
    "end": 2043.462,
    "text": "Now, that doesn't mean that policy reaches into A,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.403,
    "end": 2066.344,
    "text": " in the factorization of the base graph right so it's it's not like every single thing it's like saying well um how could what the finger does influence the knee they're not connected directly it's like well yeah but the whole generative model is executed as a whole so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.315,
    "end": 2081.651,
    "text": " You can, I mean, to put it a different way, you can use expressions in the active inference ontology that associate different variables that aren't necessarily connected through an edge here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.854,
    "end": 2090.222,
    "text": "So these edges are not the only possible sentences that you can construct when talking about the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.957,
    "end": 2096.603,
    "text": " So you can talk about how G is related to O, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.843,
    "end": 2106.194,
    "text": "Obviously, because observations are what are, O tilde are what are being taken into account when we're talking about G, but there's no line between G and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.138,
    "end": 2117.087,
    "text": "So this is just asking, will those observations be informative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.653,
    "end": 2145.589,
    "text": " and and the observations being informative doesn't need to entail updating of the a matrix I see I see yeah good point good yeah or you know there's two people you can ask one of them he flips a coin the other one right tells you the truth so the epistemic value with going to the person who gives you the good information is high",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.155,
    "end": 2151.38,
    "text": " even if you have a fixed understanding of that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.623,
    "end": 2155.605,
    "text": "Let's look at it in the TMAs setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.847,
    "end": 2157.487,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.507,
    "end": 2158.368,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.569,
    "end": 2159.35,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.37,
    "end": 2162.333,
    "text": "So technically, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.493,
    "end": 2169.101,
    "text": "Technically the A matrices are tensors, but it's a little bit of an irregular one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.284,
    "end": 2171.544,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.505,
    "end": 2176.47,
    "text": "So here we have these two kind of parallel A's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.125,
    "end": 2190.463,
    "text": " on the first and the second factors mapping the actual location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.025,
    "end": 2199.876,
    "text": "Here on the rows, note that there's this L and the R. This is because the hidden states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.312,
    "end": 2207.981,
    "text": " are in the cases of being on the right, being on the left, and being in the starting position, those are all identity mappings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.062,
    "end": 2225.222,
    "text": "But now because we're in the black on the right setting, the epistemic Q at the bottom, when you are physically in the bottom, you go to the hidden state, which tells you you're in the R context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.043,
    "end": 2227.144,
    "text": "And there's all zeros here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.284,
    "end": 2229.627,
    "text": "That hidden state cannot be reached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.433,
    "end": 2234.497,
    "text": " But of course, when the context is switched, it's the exact opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.078,
    "end": 2235.979,
    "text": "There's a one here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.78,
    "end": 2242.887,
    "text": "Going to the bottom maps you to the, it's the L state, and there is no way to reach the R state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.949,
    "end": 2246.671,
    "text": "And we also see a flipping of the 98s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.691,
    "end": 2250.355,
    "text": "98 is here on the bottom left and on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.476,
    "end": 2254.399,
    "text": "And here it's on the top left on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.852,
    "end": 2262.059,
    "text": " This is, again, just to show these matrices are necessary and sufficient for specifying the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.241,
    "end": 2268.705,
    "text": "They describe literally exactly what is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.586,
    "end": 2273.61,
    "text": "All that your generative model knows is what you specify in these matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.01,
    "end": 2275.571,
    "text": "There's no other information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.014,
    "end": 2278.894,
    "text": "So that's the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.395,
    "end": 2282.698,
    "text": "This is showing the two contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.269,
    "end": 2304.074,
    "text": " and it's showing the mappings between location and this kind of like location plus distinction between the messages that the epistemic cue on the bottom could provide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.735,
    "end": 2311.183,
    "text": "And then also notice that when you're in the starting or the bottom position,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.159,
    "end": 2338.588,
    "text": " you're you're in the sort of like dashed line like you're not finding out anything but then when you're in but then there's a 98 chance you have a 98 sensory accuracy there still is a two percent mapping between um you know um if you know if you're on the left in this context and it's black there's still a two percent chance it maps to white",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.648,
    "end": 2358.364,
    "text": " Okay, now we get to B. So similarly, we're gonna have two B matrices or two B tensors for each of these state factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.726,
    "end": 2369.537,
    "text": "B2, they're gonna introduce first because B2, the context stays constant over time and can be represented as an identity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.973,
    "end": 2375.078,
    "text": " So basically this is just keeping the same thing through time within a trial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.283,
    "end": 2382.786,
    "text": "And this is where we get the true B tensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.488,
    "end": 2395.079,
    "text": "Here, this describes location changes as a function of movement selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.961,
    "end": 2399.524,
    "text": "So we have from and to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.622,
    "end": 2406.51,
    "text": " And then there's four actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.433,
    "end": 2411.056,
    "text": "B does all the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.578,
    "end": 2414.32,
    "text": "Let's look at the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.36,
    "end": 2417.564,
    "text": "Observations are just data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.725,
    "end": 2420.147,
    "text": "Hidden states are hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.348,
    "end": 2425.974,
    "text": "They're just descriptors, proposed or actual latent descriptors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.994,
    "end": 2427.756,
    "text": "And then this is just a sensory mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.799,
    "end": 2455.084,
    "text": " but all the work of the meaning of embedded action is going to play out through B. The dimensionality of B is also higher because B is whatever the dimensionality is of the state factor, then as many slices as there are policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.806,
    "end": 2458.367,
    "text": "Because each policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.14,
    "end": 2487.679,
    "text": " is going to change how the world changes now if all of these slices were the same that would be like saying whichever policy you select the world is going to change in the same way so in that situation there's no real causal efficacy or agency of that agent yes so b is really where it's at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.393,
    "end": 2502.426,
    "text": " And in this example, the B is just given and fixed, but there are other examples that we could explore that you can look up where there's B matrix learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.908,
    "end": 2512.657,
    "text": "So that's learning the consequences of one's actions through taking different policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.218,
    "end": 2519.725,
    "text": "So that's a situation kind of like a multi-armed bandit where you actually have to learn the mapping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.97,
    "end": 2522.051,
    "text": " between different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.437,
    "end": 2529.078,
    "text": "Preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.581,
    "end": 2538.607,
    "text": "Here, C2 is the context associated preference vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.868,
    "end": 2543.552,
    "text": "So we have, if there's, the dashed line is neutral.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.273,
    "end": 2546.775,
    "text": "So this is, these three elements correspond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.017,
    "end": 2552.962,
    "text": " to these three elements, zero, six, negative and six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.366,
    "end": 2563.614,
    "text": "And then these five in the top C correspond to these five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.257,
    "end": 2575.969,
    "text": "And then as they say, there's a slight, they give a negative one to the starting position just to kind of bump it off and get it going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.658,
    "end": 2582.365,
    "text": " Because if it really had no preferences, I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.863,
    "end": 2610.867,
    "text": " all of this comes into the parameterization why is it six and not nine and negative nine why not nine and negative two that is the parameterization question so when we're in a pedagogical setting and we're just like looking to play around that's when it's super helpful to have the the code and like do parameter sweeps or just by hand play around with how different variables change the outcome of the model um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.133,
    "end": 2624.449,
    "text": " And then in chapter nine, it discusses more, well, how would you go from a bunch of videos of rats in the maze to inferring what the likeliest parameters are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.131,
    "end": 2627.173,
    "text": "But here they're just given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.24,
    "end": 2639.908,
    "text": "Also, just note that these values are given in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.964,
    "end": 2647.25,
    "text": " away that it's actually like e to the blank.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.651,
    "end": 2664.729,
    "text": "So the six here has actually a very interpretable meaning in terms of the ratio of the preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.471,
    "end": 2669.254,
    "text": "So this is not just like six arbitrary points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.702,
    "end": 2672.744,
    "text": " or like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.106,
    "end": 2678.631,
    "text": "It is just literally describing kind of like the odds ratio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.476,
    "end": 2683.596,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.616,
    "end": 2691.645,
    "text": "D, in the context domain, it's just one half, one one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.106,
    "end": 2694.728,
    "text": "Or it could have just said 0.5, 0.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.849,
    "end": 2698.212,
    "text": "But they're conveying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.597,
    "end": 2725.178,
    "text": " that it has to sum to one something must happen this is a distribution and the values are the same so uniform distribution this is a perfect knowledge over the starting position right daniel cass or christine here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.66,
    "end": 2730.465,
    "text": " So this D2 is half and half probability, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2731.787,
    "end": 2737.273,
    "text": "But this is not known to the agent who makes the active inference, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.175,
    "end": 2738.635,
    "text": "It is known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.096,
    "end": 2743.782,
    "text": "It starts out completely unsure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.802,
    "end": 2746.045,
    "text": "It starts out with a 50-50 belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.645,
    "end": 2752.633,
    "text": "But it's kind of funny because it's like, it's 100% sure that it's 50-50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.693,
    "end": 2759.094,
    "text": " Like same as a coin flip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.555,
    "end": 2761.497,
    "text": "You're 100% sure that it's 50-50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.845,
    "end": 2782.919,
    "text": "If you had a more sophisticated model, and it is shown in a later figure, you could have a hyper prior on D. So you could ask, how confident am I about the prior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.42,
    "end": 2784.561,
    "text": "You can do that for any of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.807,
    "end": 2814.818,
    "text": " okay okay so you have a hyper prior that can uh characterize d2 uh maybe character by some parameter right so you can later on learn those parameters exactly exactly any parameter that you want to learn in a bayesian statistic setting you need a hyper prior if you don't if how if it's just a fixed parameter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.169,
    "end": 2838.122,
    "text": " then it's like the equivalent of the Dirac Delta function it's just like a spike like you have like it's just like a single observation right yeah um and and it's always a very interesting thing in this case or in in your own generative models like what is being made explicit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.587,
    "end": 2842.89,
    "text": " And then what is actually being kept implicit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.91,
    "end": 2850.558,
    "text": "For example, how does the rat know that it's going to get the information at that location?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.06,
    "end": 2853.261,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2853.281,
    "end": 2854.142,
    "text": "More question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2854.402,
    "end": 2856.685,
    "text": "How does the rat know it's half and half?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2857.766,
    "end": 2859.287,
    "text": "It's just given.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2859.327,
    "end": 2865.814,
    "text": "I mean, that's like asking how does the rat know that moving to the left is going to get it to the left?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.65,
    "end": 2874.819,
    "text": " But also keep the figure 9.2 in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.9,
    "end": 2888.337,
    "text": "Weird, it's like it can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.166,
    "end": 2895.767,
    "text": "9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.722,
    "end": 2926.851,
    "text": " we're making a map of the rat here is literally figure four figure 4.3 or figure 7.3 right there d is not shown so we're just describing its map of its space we're not claiming to make a total account of everything that the rat knows um but yeah i mean there's more to say on this example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.983,
    "end": 2928.665,
    "text": " Then there's an I example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.827,
    "end": 2938.299,
    "text": "Here in 7.10, here's the prior on D. Here's the lowercase letters or hyperpriors on everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.006,
    "end": 2947.872,
    "text": "Then another example with a maze finding agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.174,
    "end": 2953.26,
    "text": "And then a hierarchical nested model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.713,
    "end": 2982.775,
    "text": " where you put a GM as a leaf in another GM and that is shown in a nested example so it's kind of a long chapter actually but because there's a lot of examples that are kind of like densely packed but just in our last like minutes here what what does anyone find interesting or what questions they still have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.083,
    "end": 2995.252,
    "text": " Well, I still have one more question in the end of section 7.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.133,
    "end": 2996.654,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3000.619,
    "end": 3003.624,
    "text": "So it's two sentences above 7.4.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3007.589,
    "end": 3011.715,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.551,
    "end": 3019.514,
    "text": " Yeah, you're still at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3023.379,
    "end": 3024.18,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.363,
    "end": 3026.423,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.443,
    "end": 3027.605,
    "text": "I think further up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3029.187,
    "end": 3033.152,
    "text": "So it talks about the neural neural activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.274,
    "end": 3035.936,
    "text": "OK, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3036.557,
    "end": 3039.681,
    "text": "So the second to the last sentence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.706,
    "end": 3047.372,
    "text": "They talk about field potentials and neural activities, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.555,
    "end": 3073.208,
    "text": " uh in figure 7.2 yeah um so so my question is how realistic is this um chima's model uh compared to the experimental data so we have this is a simulation right so basically we constructed the actual uh inverse model using the data to simulate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.947,
    "end": 3078.093,
    "text": " the activities of a mouse in the teammates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.937,
    "end": 3100.225,
    "text": "So my question is, how does the simulation results compare to the actual biological experiment, the activities of the mouse and how the mouse brain activities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.778,
    "end": 3130.515,
    "text": " imply or or correspond to this numerical simulation i'm not aware of them doing this in a rat doing the teammates but it may exist we should look it up in other settings it maps very very well now that's just like from from my perspective it's just a bonus because active inference is not developed as an account of brains",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.883,
    "end": 3138.874,
    "text": " The particular partition, the Bayesian mechanics, all of the cognitive physics doesn't need to be about any specific system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.615,
    "end": 3151.431,
    "text": "However, as the empirical lines of work have shown, various features of the model that are very non-trivial are recapitulated in biometrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.954,
    "end": 3157.6,
    "text": "That suggests that the analytical solution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.103,
    "end": 3162.809,
    "text": " and the biological embodiments have a convergence strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.81,
    "end": 3165.552,
    "text": "An example of that is predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.113,
    "end": 3178.187,
    "text": "Predictive coding was invented by humans as a way to do video encoding because it turns out that frame differencing is the most efficient way to do video encoding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.948,
    "end": 3182.372,
    "text": "Like instead of just trying to compress every frame,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.521,
    "end": 3188.327,
    "text": " you basically compress the B matrix because if something doesn't change, you don't even need to mention it in the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.148,
    "end": 3200.54,
    "text": "So predictive coding was a purely information theoretic consideration, but it turned out to be utilized in neural coding situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.162,
    "end": 3210.25,
    "text": "So I see it as positive where it aligns, but where it doesn't align, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.09,
    "end": 3214.213,
    "text": " it doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.233,
    "end": 3219.338,
    "text": "It just means that there's something else happening that isn't just narrowly that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.1,
    "end": 3230.289,
    "text": "Yeah, because you see in figure 7.2, they show the neural activities and the fire arrays and local field potentials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3230.609,
    "end": 3237.756,
    "text": "So there must be some mechanism to translate the outcome of the numerical simulation into",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.107,
    "end": 3245.82,
    "text": " those neural activities, right, the biological embodiment of the numerical size.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.943,
    "end": 3259.542,
    "text": "So through what mechanism do they transform this numerical into the field potentials, for example, neural activities?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3263.183,
    "end": 3268.249,
    "text": " Yeah, it's all in the MATLAB code in the MATLAB functions that are used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.21,
    "end": 3277.881,
    "text": "It describes it in more detail, but basically the LFPs are associated with, with belief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.683,
    "end": 3279.864,
    "text": "Hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.889,
    "end": 3285.09,
    "text": "Have a firearm race.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3285.323,
    "end": 3287.887,
    "text": " Are they associated with the decision?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3288.167,
    "end": 3296.039,
    "text": "You could imagine different firing rates or different, I mean, and this has been studied extensively in the FMRI and EEG setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.163,
    "end": 3313.947,
    "text": "Does the ERP in the ERG or does the local field potential associate with a more intense stimuli, with a more expected stimuli, with a less expected stimuli, with learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.281,
    "end": 3316.724,
    "text": " Those are all hypotheses that people have explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.906,
    "end": 3324.392,
    "text": "And for different stimuli in different settings, you see different patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.056,
    "end": 3330.499,
    "text": "Okay, any last comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.264,
    "end": 3341.571,
    "text": "I mean, I don't wanna keep us too long, but I just, yeah, I still,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.226,
    "end": 3347.519,
    "text": " as a last bit, I find the novelty seeking rather interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.539,
    "end": 3352.43,
    "text": "Like just the example, it's roughly around page 145, 146.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.232,
    "end": 3356.64,
    "text": "Like if you were to model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.127,
    "end": 3376.907,
    "text": " give it like if there were an absence of preferences for an agent then like i'm just quoting here the drive to novelty resolution give it by expected free energy minimization leads our simulated creature to avoid any previously visited locations um just like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3377.005,
    "end": 3390.038,
    "text": " You know, it becomes like a purely like the model is attempting to resolve expected free energy, if I understand this correctly, by just it's just seeking more and more information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.138,
    "end": 3392.584,
    "text": "It's going to places it hasn't been before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.564,
    "end": 3412.193,
    "text": " um there's nothing pragmatic about returning to previous places it's not attempting to realize any preferences that say i need to go back right so i just thought that's a really nice kind of kind of emergent property that we see whenever you leave out preferences here and it for me it kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.173,
    "end": 3437.134,
    "text": " lays a lot of emphasis on like the importance of of preferences their impact upon behavior in these models and just maybe makes me think of like how to you know maybe start with preferences how to model those appropriately because it can highly impact um right like an agent's behavior yep great points and the strength of the preferences overall",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.485,
    "end": 3445.143,
    "text": " And where that ends up on a continuum between novelty seeking and basically ruthless pragmatism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.188,
    "end": 3447.529,
    "text": "Indeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.351,
    "end": 3448.591,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.393,
    "end": 3449.995,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.598,
    "end": 3454.666,
    "text": "We go into chapter eight next time in the later time slot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.946,
    "end": 3457.573,
    "text": "So peace till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.154,
    "end": 3458.374,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.337,
    "end": 3460.058,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3461.001,
    "end": 3461.181,
    "text": "Good day.",
    "speaker": "SPEAKER_03"
  }
]