[
  {
    "start": 7.469,
    "end": 8.949,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.309,
    "end": 11.51,
    "text": "This is Actin Flab guest stream number 22.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.21,
    "end": 23.812,
    "text": "I'm here with Dr. Anna Lemke and we are here to discuss dopamine and beyond and really looking forward to this conversation and appreciate the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.032,
    "end": 29.673,
    "text": "So to you for any introductory context and then really looking forward to this discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.233,
    "end": 31.553,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.613,
    "end": 33.994,
    "text": "Well, thank you so much for having me, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.014,
    "end": 34.974,
    "text": "You know, I've, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.919,
    "end": 41.561,
    "text": " been interested in you and your work for many years now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.721,
    "end": 48.563,
    "text": "And so I'm really excited to have an excuse to reconnect and just excited to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.184,
    "end": 51.364,
    "text": "And you asked me to start by introducing myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.485,
    "end": 61.048,
    "text": "So I'm a professor of psychiatry and behavioral sciences and also addiction medicine at Stanford University School of Medicine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.758,
    "end": 66.781,
    "text": " I'm also author of the book, Dopamine Nation, Finding Balance in the Age of Indulgence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.841,
    "end": 68.722,
    "text": "And that's what we're going to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.862,
    "end": 70.083,
    "text": "And Daniel's quoted in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.223,
    "end": 77.567,
    "text": "And I would have actually included Daniel more in there if I were smart enough to actually understand the work that he does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.948,
    "end": 81.769,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.589,
    "end": 85.271,
    "text": "We'll get there with the ants and the dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.491,
    "end": 91.074,
    "text": "But maybe just what is Dopamine Nation about and what motivated you to write it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.27,
    "end": 121.524,
    "text": " So dopamine nation is kind of a blend of neuroscience made simple, combined with practical advice for how to live in a dopamine overloaded world, holding up people in recovery from severe addictions as modern day profits for the rest of us, because all the neuroscience in the world, as valuable as it is, can't make up for the experience of people who have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.974,
    "end": 123.515,
    "text": " gotten into recovery from addiction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.535,
    "end": 141.985,
    "text": "Dopamine Ignition also posits a kind of global hypothesis, you know, tentatively posits the hypothesis that the growing rates of anxiety, depression, suicide, and other mental health disorders across the world are caused at least in part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.665,
    "end": 150.508,
    "text": " by the problem of overabundance and the kind of lack of appropriate friction in our lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.668,
    "end": 161.111,
    "text": "In other words, the ways in which our lives are maybe too easy and the way that our primitive wiring is mismatched for this modern ecosystem of overwhelming overabundance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.092,
    "end": 164.332,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.117,
    "end": 173.378,
    "text": " One dopamine question, and then I think we'll start to see some areas of overlap with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.118,
    "end": 186.781,
    "text": "What could you say to the role of dopamine in reward and motivation signaling, like in wanting and liking, and how does dopamine play a role in behavioral selection?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.241,
    "end": 193.662,
    "text": "Okay, so dopamine is essential for the experience of motivation, reward, and pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.508,
    "end": 199.91,
    "text": " It may be even more important for motivation than it is for the experience of pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.95,
    "end": 216.137,
    "text": "And I base this on the work of my amazing neuroscience colleagues who have done experiments, for example, where they engineer a rat's brain to be depleted of dopamine receptors and discover that if they give that rat food, it will eat the food and seem to take pleasure in the food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.177,
    "end": 224.14,
    "text": "But if they put the food, you know, some distance away, the rat will starve to death, meaning that the absence of dopamine in these key reward circuits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.394,
    "end": 234.7,
    "text": " make it such that that animal is no longer motivated to do the work that it takes to get their reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.96,
    "end": 245.427,
    "text": "And my neuroscience colleagues like Rob Malenka have said that for him, the definition of addiction is how hard an animal is willing to work to get their reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.267,
    "end": 250.23,
    "text": "And that has direct application to the clinical work that I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.25,
    "end": 252.832,
    "text": "You know, we all like what we like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.396,
    "end": 257.379,
    "text": " And once we experience the thing that we like, of course, we want to repeat it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.92,
    "end": 280.298,
    "text": "But the kind of fundamental difference between those who go on to develop addiction and those who don't is that those who develop addiction are willing to work very, very hard to get their drug of choice and are willing to give up a lot of other things, even when that pursuit causes enormous amount of personal costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.138,
    "end": 308.622,
    "text": " thank you for that that's really powerful with professor malenka's definition of how hard they work to get it because it's like an action-oriented definition that could be measured in or proxied by different things especially clinically as opposed to like an inference or a purely cognitive based report like a survey how often do you think about something like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.422,
    "end": 332.177,
    "text": " and uh that's very interesting and that's i think one of the themes that we'll pick up on which is action and for active inference it's right there in the title it's like there's always going to be a minimum of two and when we're talking about behavior and cognition they're an inseparable whole and then that plays out in a lot of different ways like partially with the embodiment and the inactive perspectives",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.737,
    "end": 361.518,
    "text": " that come to view but also just like as you said it's pragmatic too because it's relevant to always be thinking about action and cognition as like a dyad in the context rather than trying to separate them and then find a correlation across love it love it so i've been a psychiatrist for going on 30 about 25 years and i would say the first half of my book training and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.15,
    "end": 367.891,
    "text": " life experience and education was really focused on changing people's cognitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.571,
    "end": 375.193,
    "text": "So focusing on people's thoughts and emotions and using language as a tool to talk about those, to change those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.673,
    "end": 388.776,
    "text": "But as my career went on, I became more and more skeptical of this as a solitary pursuit and more and more convinced that what we need to do is focus on changing behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.485,
    "end": 394.075,
    "text": " And when I'm dealing with patients with addiction, that is in fact now my first intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.095,
    "end": 398.725,
    "text": "I will say, let us first change the behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.423,
    "end": 410.873,
    "text": " And in doing that experiment, and what I mean is abstain from your drug of choice, see what happens, and then let's make certain inferences based on what that experience was like for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.193,
    "end": 414.016,
    "text": "And that's really atypical in psychiatry today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.376,
    "end": 422.403,
    "text": "What we do instead is we talk and we talk and we talk about why the behaviors are happening without really focusing on changing the behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.844,
    "end": 424.985,
    "text": " And I think we really, that's not good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.165,
    "end": 431.75,
    "text": "Like, because for example, my patients will come in, they'll be addicted and they'll say, I'm addicted because I'm depressed or because I had this trauma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.25,
    "end": 437.193,
    "text": "All of that may be true, but we can talk about the trauma till the cows come home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.513,
    "end": 442.296,
    "text": "You have to change the behavior and you have to do it before you feel like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.916,
    "end": 444.177,
    "text": "So that's really interesting too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.217,
    "end": 448.68,
    "text": "Like patients will say, well, you know, I'm just not, I don't,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.096,
    "end": 453.719,
    "text": " I'm not motivated to do X, Y, or Z. So this is an early where like, I don't feel, I said, you know what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.319,
    "end": 458.581,
    "text": "If you wait till you feel like doing it, you will never do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.122,
    "end": 470.008,
    "text": "What you need to do is change the behavior, experience the impact on your feeling by changing the behavior and then take it from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.949,
    "end": 472.249,
    "text": "So I totally agree with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.349,
    "end": 476.852,
    "text": "It's this intense marriage of the cognition, emotion, and the actual actions that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.352,
    "end": 486.772,
    "text": " And we almost always are focused on, you know, the cognitions and emotions, and we don't get people to do enough of just focusing on changing behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.221,
    "end": 504.716,
    "text": " Okay, so I think that's our first theme, which is this action orientation, and that plays into the embodiment and the inactive aspects, but also it has a kind of corollary, this like act first principle, and that helps us perturb the causal structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.217,
    "end": 513.244,
    "text": "Because if we're just looking at the N equals one observational experiment, well, your consumption will be correlated with...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.349,
    "end": 529.075,
    "text": " price of oranges and then how do you actually get at something deeper in the world and that's sort of a relevant type of intervention so action and also action first is pretty cool any other thoughts on that or we can go in a different direction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.165,
    "end": 535.207,
    "text": " Well, I would also say that this brings to mind, you know, you asked about surveys and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.227,
    "end": 557.718,
    "text": "Like, I don't really like, just personally, like, I don't really, I mean, I think there's value for like survey studies, but the problem is what you really end up picking up there is more about what the dominant cultural narrative is that explains why people do X, Y, or Z. And you're not really tapping into why they really do X, Y, or Z. The other thing I would say that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.411,
    "end": 574.907,
    "text": " know um the way that we think about science is that it's not a single person's life narrative but i really believe that that that there's science when you see a series of individuals over and over again you hear their stories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.467,
    "end": 577.968,
    "text": " And you can recognize very similar patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.328,
    "end": 583.129,
    "text": "And then you do an intervention and you see the results and you do that repeatedly with many people over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.429,
    "end": 598.492,
    "text": "It's not like your classic, you know, clinical study, but it feels really true and real to me in a way that a lot of times clinical studies don't or can't capture some of the deeply nuanced complex aspects of human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.03,
    "end": 604.951,
    "text": " I love the way you think about things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.971,
    "end": 605.972,
    "text": "It's so crazy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.052,
    "end": 606.613,
    "text": "I love that part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.973,
    "end": 607.474,
    "text": "You're like, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.375,
    "end": 611.238,
    "text": "Didn't know what was going to come next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.298,
    "end": 612.539,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 613.259,
    "end": 613.86,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.1,
    "end": 618.745,
    "text": "So back to the book and also to connect this to an active inference theme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.345,
    "end": 625.391,
    "text": "So decision-making in active inference, like policy selection, the pie variable is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.312,
    "end": 645.457,
    "text": " the way that different possibilities are ranked is not just by their reward or their expected like value or utility which would be common in a kind of reinforcement learning or a reward maximization framework but there's like two components that go into that policy selection there's a epistemic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.423,
    "end": 652.249,
    "text": " knowledge oriented, like learning and curiosity, intrinsic motivation, and then there's a pragmatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.769,
    "end": 659.576,
    "text": "So there is a utility element and the ability to dial in on utility, but also there's the ability to kind of pull back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.776,
    "end": 663.3,
    "text": "And when you were describing your book structure,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.665,
    "end": 682.109,
    "text": " Certainly while reading it, and as you described it, there was like an epistemic component, neuroscience made accessible for those who might not have the molecular background, but also like on page 48 with a baseball game, it's just fun for even those who might've seen it in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.609,
    "end": 690.471,
    "text": "And then there's the pragmatic part, which uses the stories to kind of connect to useful tips, so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 691.351,
    "end": 697.113,
    "text": " Where do you think epistemic and pragmatic value come into play in how you're thinking about this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.734,
    "end": 702.676,
    "text": "So epistemic is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.696,
    "end": 710.819,
    "text": "And thank you for showing the examples related to my book, because that helps me also understand what you mean by those terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.639,
    "end": 720.943,
    "text": "So what I find really interesting about how to intrinsically motivate people with addiction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.017,
    "end": 731.823,
    "text": " is that if they have a framework in which to understand their behavior, it really does help people change their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.663,
    "end": 734.104,
    "text": "It's really a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.665,
    "end": 740.348,
    "text": "And what's fascinating to me is that neuroscience talks and everything else walks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.509,
    "end": 747.192,
    "text": "And by that, I mean, when I explain to people their behavior with a neuroscience framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.785,
    "end": 750.267,
    "text": " it carries a lot of currency to P for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.347,
    "end": 751.508,
    "text": "It feels real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.069,
    "end": 756.973,
    "text": "You know, it feels like it's almost like, let me just throw it out there like a modern day religion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.414,
    "end": 760.977,
    "text": "Like you could, you could use very different framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.057,
    "end": 762.698,
    "text": "Like you could use a moral framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.758,
    "end": 764.5,
    "text": "You could use a philosophical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.401,
    "end": 771.786,
    "text": "People don't resonate with that the same way they resonate with the neuroscience, which is why I use the neuroscience framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.747,
    "end": 773.708,
    "text": "So I think, and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.332,
    "end": 775.633,
    "text": " People will carry it around with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.673,
    "end": 783.837,
    "text": "So, for example, I use this extended metaphor of a balance, pleasure-pain balance, and gremlins represent neuroadaptation, and they hop on the pain side of balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.357,
    "end": 788.86,
    "text": "And, for example, I had a reader write me and say, you know, I'm really trying really hard to quit smoking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.32,
    "end": 796.844,
    "text": "And whenever I have an urge to smoke a cigarette, I just imagine those little gremlins, those little neuroadaptation, hopping up and down on the pain side of balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.044,
    "end": 798.625,
    "text": "I'm like, you're not going to win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.665,
    "end": 800.406,
    "text": "You know, I'm going to outlast you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.435,
    "end": 802.436,
    "text": " So that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.516,
    "end": 804.297,
    "text": "People will, you know, it's like a frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.357,
    "end": 816.242,
    "text": "We need those epistemological frameworks that we project onto the world to help us cope, make decisions, last, you know, in difficult situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.262,
    "end": 821.004,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.385,
    "end": 821.665,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.225,
    "end": 825.727,
    "text": "Maybe even one way that that person is experiencing their",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.097,
    "end": 850.171,
    "text": " um experience the way that they're thinking about their behavior and inference it's um like the the metaphor that you're bringing the baseball game for the neurotransmitter synapse the gremlins um even some of the more flow charts like how different stages are related to each other there's always like a person's form moving through it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.911,
    "end": 859.688,
    "text": " And then that provides a lot of accessibility to enter into that space and like kind of imagine counterfactuals, which is our...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.181,
    "end": 884.214,
    "text": " human cognitive expertise in a sense is not to memorize 11 digit numbers even outside of ultra specific training it's to like okay if the neurotransmitter like when i looked at that example i thought well what where are the glia are they the crowd are they like what are they doing are they supporting this pitch",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.094,
    "end": 892.081,
    "text": " And then there's that time scale, but then it already opens the door to questions that the molecular representation is like, oh, well, then it's a done deal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.161,
    "end": 893.542,
    "text": "With the pre and post synaptic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.324,
    "end": 896.225,
    "text": "Yeah, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.305,
    "end": 897.646,
    "text": "And I think, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.575,
    "end": 909.058,
    "text": " Obviously, these metaphors are like a gross oversimplification and get things, you know, can't explain all of the phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.438,
    "end": 917.24,
    "text": "But as you say, if we try to explain it all and we get too complicated, then it feels to people like memorizing a list of numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.66,
    "end": 926.543,
    "text": "So it has to be true enough to represent the real science, but not so complex that people can't take it with them and apply it in their everyday lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.901,
    "end": 931.023,
    "text": " And it also, it takes it out of the kind of uncanny valley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.704,
    "end": 934.026,
    "text": "An example there would be like the ribosome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.246,
    "end": 935.427,
    "text": "It's a purple blob.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.067,
    "end": 940.651,
    "text": "And it's like, well, it's really not, but it's represented so commonly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.331,
    "end": 942.652,
    "text": "And then that locks in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.712,
    "end": 944.373,
    "text": "But then at the baseball game, we know it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.393,
    "end": 945.354,
    "text": "It's a different scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.374,
    "end": 946.915,
    "text": "So it's approachable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.376,
    "end": 950.938,
    "text": "And then anyone who wants to look into the receptor slash glove.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.958,
    "end": 952.119,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.58,
    "end": 952.8,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.775,
    "end": 984.041,
    "text": " okay um that was kind of exploring what was the second area which was like the epistemic and the pragmatic like always pairing the knowledge gaining with the useful and then recognizing that there's a time for the more knowledge oriented maybe there's a building on campus that's more knowledge oriented and then also there's a time and a place for what's useful and maybe that's part of the conversation that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.025,
    "end": 990.667,
    "text": " do you want to see or how do you want to see it with applied neuroscience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.628,
    "end": 995.749,
    "text": "Can you, can you say what you mean a little bit more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.809,
    "end": 996.83,
    "text": "I didn't quite get that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.55,
    "end": 1007.235,
    "text": "Like connecting the epistemic and the pragmatic, the learning and research oriented work with the practical tips is disconnect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.395,
    "end": 1008.315,
    "text": "How could it be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.415,
    "end": 1009.156,
    "text": "How should it be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.576,
    "end": 1013.918,
    "text": "How will we make that connection like flexible and, and work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.317,
    "end": 1019.658,
    "text": " Yeah, I mean, there's obviously, you know, a huge disconnect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.778,
    "end": 1034.004,
    "text": "Like this is the problem where we're sort of, you know, in this ivory tower, we're learning this stuff, we're acquiring this knowledge, we're, you know, people, you know, neuroscientists like you actually adding new knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.465,
    "end": 1037.826,
    "text": "But yeah, then the question is, how do we get that to people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.464,
    "end": 1050.173,
    "text": " to actually benefit them in their everyday lives and also getting it to students to give them a sense of meaning and purpose in their work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.574,
    "end": 1061.423,
    "text": "So it doesn't feel so incredibly disembodied from the world that we live in and the reasons behind why we do, I mean, why do we want to acquire this knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.003,
    "end": 1067.928,
    "text": "I mean, there's not just, I mean, maybe it is knowledge for its own sake, but I think deeply people want to feel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.493,
    "end": 1071.555,
    "text": " They're contributing, making the world a better place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.935,
    "end": 1077.478,
    "text": "So I think it's really important to do, we need to do more to bring those things together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.498,
    "end": 1087.564,
    "text": "I feel like medical education, so there's the preclinical years and then there's the clinical years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.584,
    "end": 1094.948,
    "text": "And I know for me personally, like those clinical years were where I first sort of felt like, oh, thank goodness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.526,
    "end": 1100.749,
    "text": " So here I am interacting with like real human beings and trying to take this knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.31,
    "end": 1102.731,
    "text": "And also I'm impatient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.871,
    "end": 1103.992,
    "text": "I'm very impatient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.392,
    "end": 1110.596,
    "text": "So I feel like the human interaction, I could see more quickly that I was making a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.636,
    "end": 1121.083,
    "text": "I didn't have the kind of patience that it takes to be a scientist in the sense that you are, where you really have to have faith, a deep, deep faith that what you're doing matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.496,
    "end": 1125.28,
    "text": " And that down the road, you will see its application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.702,
    "end": 1131.747,
    "text": "Unless it's just the beauty of it, for its own sake, compels you and draws you in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.787,
    "end": 1135.11,
    "text": "But I'm ultimately a very kind of pragmatic person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.13,
    "end": 1136.992,
    "text": "And I'm also impatient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.273,
    "end": 1139.555,
    "text": "So I need to see that a lot sooner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.875,
    "end": 1140.596,
    "text": "But how about you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.716,
    "end": 1142.378,
    "text": "I'm sure you have many thoughts on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.478,
    "end": 1143.259,
    "text": "I'd love to hear them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.745,
    "end": 1150.886,
    "text": " Well, yes, very interesting, and as we were kind of joking about before, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.463,
    "end": 1181.746,
    "text": " everyone especially in an age of specialization abundance of specialisms that being able to like connect across them is really important like having not had firsthand experience in for example any of the stories presented and that's like the microcosm of the discussion with frameworks and people's lives kind of meeting from the ground up so patience that's an interesting thing and you pointed to like how different people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.123,
    "end": 1190.507,
    "text": " seemingly display behaviorally different amounts of patience, and they probably experience it differently too, but also it's patience for different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.948,
    "end": 1204.615,
    "text": "Intermittent fasting over this many hours or this many days, all the things might align for one person at one time, and it's very easy to be patient behaviorally versus not, versus some other strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.316,
    "end": 1210.339,
    "text": "And so trying to think about that in an active inference way, it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1210.979,
    "end": 1217.661,
    "text": " In active inference, the question is always about what is the decision right now for inference and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.861,
    "end": 1228.163,
    "text": "So how should I be perceiving and learning and acting in the moment given the long horizon or the stated horizon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.383,
    "end": 1232.804,
    "text": "So what is going to be the best move in this chess move",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.68,
    "end": 1243.163,
    "text": " given the kind of uncertainty about the future of the game, including like the uncertainty about what the other side will do or something like that, or even uncertainty over one's own actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.343,
    "end": 1255.646,
    "text": "And then patience is like, well, what is happening when the best action selection is to not engage with something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.346,
    "end": 1258.867,
    "text": "So what is it that actually values",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.162,
    "end": 1261.383,
    "text": " for something that is valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.483,
    "end": 1265.968,
    "text": "Like it's easy to be patient for something that's just a purely negative experience, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.249,
    "end": 1268.391,
    "text": "I'll just, I'll hold off, not interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.832,
    "end": 1273.196,
    "text": "But being patient, we kind of are applying to something where it's like, I do want to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.236,
    "end": 1303.054,
    "text": " call this person before the time I said I would call them but I'm getting impatient or like I want this research project to be over I wish that this was faster which everyone involved in research or maybe analogously like it would be awesome if myself or if this patient were seemingly on their recovery faster or something so how does it come to be that sometimes we wait in the moment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.031,
    "end": 1305.732,
    "text": " And other, other times we don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.833,
    "end": 1307.774,
    "text": "And like, is it okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.814,
    "end": 1309.035,
    "text": "Or when should we do stuff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.936,
    "end": 1311.476,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.117,
    "end": 1315.039,
    "text": "Um, gosh, so much there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.639,
    "end": 1316.84,
    "text": "So let's start with your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.86,
    "end": 1318.721,
    "text": "How, how, how does it come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.862,
    "end": 1327.688,
    "text": "How, how do we, I mean, you know, I quote you in the book saying that the world is, uh, sensory rich and causal poor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.708,
    "end": 1333.412,
    "text": "And I just love that quote because it wraps up in this night, nice little package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.256,
    "end": 1351.419,
    "text": " Um, the, the, the problem with highly reinforcing drugs and behaviors, which is that in the moment they feel like the right thing and they feel good, but the long-term consequences of repeated use is to get us to a potentially very dark place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.799,
    "end": 1356.02,
    "text": "But we don't necessarily see the connection between those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.6,
    "end": 1356.8,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.22,
    "end": 1360.961,
    "text": "So how is it that we come to see that connection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.258,
    "end": 1388.098,
    "text": " And I think as a psychiatrist, having listened to thousands and thousands of people's narrative life stories over time, that one of the ways that we get there is actually the autobiographical self-narrative, that words are tools and that those tools are a way not just to organize past experience, but actually create roadmaps for the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.658,
    "end": 1391.18,
    "text": "So it's not just, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.364,
    "end": 1397.685,
    "text": " The way that we tell our stories about our lives are very, very impactful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.705,
    "end": 1408.107,
    "text": "I think Foucault or somebody like that said that autobiographical narrative is the only way that we have to document lived time, which is really, really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.428,
    "end": 1415.349,
    "text": "Like for all of the cool technology that we have, the only thing that documents lived time is storytelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.167,
    "end": 1430.142,
    "text": " So, and I've seen this again and again, when my patients come in and they tell an autobiographical narrative in which they are constantly the victim of the world and other people, and that's why they're addicted, those people are not going to get better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.063,
    "end": 1433.586,
    "text": "And part of what I need to do over time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.133,
    "end": 1442.019,
    "text": " is to move them toward what I consider to be a more truthful narrative, which is that there's always something that we have contributed to the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.62,
    "end": 1450.506,
    "text": "Maybe we just showed up and that was our contribution, but it's never always entirely somebody else's fault.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.947,
    "end": 1457.612,
    "text": "And for people who get into sustained and robust recovery, you can hear the difference in their autobiographical narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.632,
    "end": 1463.577,
    "text": "And one of the fundamental differences, they're able to tolerate the shame",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.264,
    "end": 1475.791,
    "text": " that comes with acknowledging their character defects and the mistakes that they made and what they contributed to their messed up situation, which is just basically closer to the truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.291,
    "end": 1478.512,
    "text": "So telling the truth is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.912,
    "end": 1481.234,
    "text": "Telling truthful stories is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.314,
    "end": 1490.059,
    "text": "And I think that those stories actually become the tool by which we are able to remain patient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.606,
    "end": 1493.767,
    "text": " in the face of, you know, delayed gratification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.487,
    "end": 1505.949,
    "text": "That's what keeps us able to not, to do something that we should do in the moment, but don't feel like doing, or to abstain from doing something that we feel like doing in the moment, but shouldn't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.069,
    "end": 1519.431,
    "text": "And, you know, whether that story takes a framework based on neuroscience, or whether there's a religious or spiritual framework, like, you know, my reward will come in another life,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.1,
    "end": 1536.925,
    "text": " There are many different ways to build that story, but that story has got to be the thing that allows that person to kind of delay this gratification in the service of living a more flourishing life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.356,
    "end": 1543.679,
    "text": " I'd like to ask a follow-up question from the chat and then give her a mark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.219,
    "end": 1545.04,
    "text": "Neuro pixel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.54,
    "end": 1550.464,
    "text": "Nice screen name asks, how can we learn to build patients for healthy habits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.586,
    "end": 1553.947,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.987,
    "end": 1555.107,
    "text": "How can we learn to build that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.188,
    "end": 1556.569,
    "text": "So, so good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.029,
    "end": 1562.513,
    "text": "So I think there are a couple, uh, there are a couple stages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.674,
    "end": 1564.555,
    "text": "First, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.508,
    "end": 1584.478,
    "text": " It's to recognize that when you first stop doing a bad habit, you will suffer more so that the initial, your initial experience will be increased pain, not like immediate reward from stopping that bad habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.958,
    "end": 1592.002,
    "text": "So I think so that like setting up expectations in that way, but that the longer you can go abstaining from that bad habit,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.33,
    "end": 1601.877,
    "text": " the faster you will get to that place where you begin to feel better and you don't miss that bad habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.258,
    "end": 1604.199,
    "text": "And in fact, you start to reap the benefits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.459,
    "end": 1607.021,
    "text": "You have to know it's going to get worse before it gets better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.463,
    "end": 1621.473,
    "text": "Everybody talks about practicing mindfulness and what that is, but actually there's almost no better opportunity for practicing mindfulness than to give up something that's bad for you that you really like, a bad habit, because what will happen is it'll stir up all kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.533,
    "end": 1622.514,
    "text": "It's very disruptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.257,
    "end": 1638.703,
    "text": " And I think then the ability to learn that you are not your thoughts and emotions, but that you can stand some distance from that and not respond to that, but just objectively observe those things is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.604,
    "end": 1652.929,
    "text": "I think giving up a bad habit with other people so that you're not doing it alone is really important because you can then go to other people and sort of suffer together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.912,
    "end": 1656.393,
    "text": " And then I think meaning making is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.773,
    "end": 1668.535,
    "text": "So to give up the bad habit so that you yourself can feel better, but also what is the greater meaning of abstaining from that thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.715,
    "end": 1674.396,
    "text": "And often it's a consumptive process and a greater meaning could be saving the planet, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.436,
    "end": 1677.477,
    "text": "I'm doing this for me, but it's also good for the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.455,
    "end": 1681.315,
    "text": " Thanks for the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.855,
    "end": 1701.541,
    "text": "So one of those words you mentioned was expectations, which is a core idea in Bayesian statistics and a long history of like Bayesian brain, predictive coding, predictive processing, many different approaches to neuroscience behavior and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.681,
    "end": 1706.923,
    "text": "And active inference does build on that and uses the idea of expectations to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.402,
    "end": 1711.204,
    "text": " as far as expected futures and things like that a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.584,
    "end": 1715.066,
    "text": "And so it's interesting to think about the role of dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.646,
    "end": 1721.929,
    "text": "And like you said, set up for this because then it'll basically go that way and you'll stay on track.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.429,
    "end": 1728.453,
    "text": "Whereas if you expect to go faster or different, you're gonna feel like worse or anxious or uncertain about how to proceed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.113,
    "end": 1737.964,
    "text": " And it's totally modeled in an active inference way by thinking about the estimate is not how many points, how many am I getting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.324,
    "end": 1741.528,
    "text": "It's how many points relative to how many points I expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.309,
    "end": 1745.332,
    "text": "And then one can be doing better or worse or as expected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.273,
    "end": 1749.275,
    "text": " And if things are going well, there's positive valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.796,
    "end": 1752.758,
    "text": "If things are going as expected, it's like neutral valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.178,
    "end": 1756.42,
    "text": "And if things are going poor, there's like anxiety and negative valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.141,
    "end": 1767.108,
    "text": "And so that is one way where moving from like a reward only perspective to be like, well, yes, there's an expectation of reward and precision along that path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.708,
    "end": 1773.215,
    "text": " will be pleasurable or neutral, but it's not going to be like winning, winning, winning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.335,
    "end": 1776.56,
    "text": "It'll be like neutral with oscillation around neutral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.205,
    "end": 1777.845,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.606,
    "end": 1779.006,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.126,
    "end": 1786.931,
    "text": "And I can tell you, you know, in the, like the lived experience of treating patients, this is absolutely key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.291,
    "end": 1802.34,
    "text": "So one of the things that we do in our clinic is to help people get off of chronic opioids, like, you know, Oxycontin or Vicodin or Norco or chronic benzodiazepines like Xanax, Valium, Atomium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.241,
    "end": 1804.922,
    "text": "And, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.828,
    "end": 1814.232,
    "text": " You would think this is not that complicated, but actually a lot of patients are looking for help with this and can't find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.652,
    "end": 1816.293,
    "text": "And they find it in our clinic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.613,
    "end": 1823.257,
    "text": "And the one thing that I would say we provide, which is the real value, is to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.631,
    "end": 1826.932,
    "text": " establish appropriate expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.633,
    "end": 1833.576,
    "text": "Because what happens is they'll go see a doctor and they'll say, I need to get off of Xanax or I really want to get off of Xanax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.016,
    "end": 1835.157,
    "text": "And the doctor will say, oh, that's easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.297,
    "end": 1841.401,
    "text": "You know, just go down by, you know, 50% of your starting dose over the next week and you'll be fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.921,
    "end": 1845.183,
    "text": "And the patients do that or same thing with their opioid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.203,
    "end": 1852.407,
    "text": "They do that and they're in horrific psychological and physical pain because they're in withdrawal or maybe they even have a seizure, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.027,
    "end": 1860.589,
    "text": " So their experience is totally worse or much worse than what their doctor predicted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.609,
    "end": 1863.29,
    "text": "And of course, the doctor is like the respected authority.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.67,
    "end": 1865.35,
    "text": "So then they feel angry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.47,
    "end": 1866.971,
    "text": "They also feel betrayed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.991,
    "end": 1868.351,
    "text": "They also feel like they're weird.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.751,
    "end": 1869.591,
    "text": "Like, why am I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.191,
    "end": 1870.832,
    "text": "They come to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.052,
    "end": 1880.334,
    "text": "And my patients have told me again and again, Dr. Argue, the most important thing you said to me when we went down by my opioid or my benzo by a little bit, and we go very slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.607,
    "end": 1884.228,
    "text": " is that I would feel worse before I feel better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.948,
    "end": 1885.628,
    "text": "And I really do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.728,
    "end": 1894.371,
    "text": "I way emphasize that so that if they go and they taper and it's not even, it's not as bad as what I, then they're like happy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.931,
    "end": 1900.733,
    "text": "It's like, you know, you told me it was going to be bad for a while until my body re-equilibrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.173,
    "end": 1903.894,
    "text": "And it was bad, but it wasn't like I could do it, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.974,
    "end": 1908.736,
    "text": "So that setting expectations, it's really, really important, like in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.848,
    "end": 1919.276,
    "text": " It's almost like there's a wanting for reduction or sobriety, but actually they don't like it behaviorally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.677,
    "end": 1921.899,
    "text": "Not on the psychological, what are they thinking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.939,
    "end": 1922.96,
    "text": "What does the survey say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.681,
    "end": 1929.046,
    "text": "But actually like, well, you don't like the green room if you aren't spending your time in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.507,
    "end": 1932.209,
    "text": "It's how we would say it about the other kinds of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.29,
    "end": 1936.493,
    "text": " So it's kind of like interesting, like where do we like something, but not want it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.994,
    "end": 1940.297,
    "text": "What does dopamine and other neurotransmitters doing then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.377,
    "end": 1945.001,
    "text": "How about the situations where we do or don't have patients?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.121,
    "end": 1952.067,
    "text": "Like those are such great questions and entry points for our own life and for research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.588,
    "end": 1958.713,
    "text": "And that's like kind of the bridge is the introduction of the paper or the context for the grant is like kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.537,
    "end": 1965.259,
    "text": " could be that bridge, but then sometimes it is more about how it appears rather than how it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.279,
    "end": 1966.54,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.56,
    "end": 1972.062,
    "text": "And I think the variable of time is so important for all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.522,
    "end": 1979.384,
    "text": "Like if, I mean, you know, we can sign up for a lot of suffering if we know it's time limited, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.424,
    "end": 1984.907,
    "text": "Like, okay, I can do this because Dr. Lemke said I would feel like crap for two weeks and I would start to feel better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.527,
    "end": 1988.748,
    "text": "And so, you know, you can hang in there for that or whatever, you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.255,
    "end": 2011.955,
    "text": " know the the intervention is that that makes a huge difference so returning to the quote on page 75 about uh the world is sensory rich and causal poor you know personal communication uh when 2018 because i think there's a very interesting difference or something and how i'm thinking about it now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.715,
    "end": 2038.355,
    "text": " oh interesting okay i'd love to hear that so i think that was when i was just beginning to learn about active inference and free energy principle and bayesian brain and i was thinking well wow it's not just like signal detection on the pixels or whatever there's the causal inference and then that's like you followed up like we know that donut tastes good in the moment but we are less aware that eating a donut every day for a month adds five pounds to our waistline",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.428,
    "end": 2046.312,
    "text": " We get that understanding through personal experience, relationships, science, research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.893,
    "end": 2053.577,
    "text": "We build that understanding, that expectation of cause in, and then all of a sudden our behavior is like more natural to switch in the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.178,
    "end": 2060.302,
    "text": "So I was thinking, you know, starry-eyed graduate student, sensory rich and causal poor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.402,
    "end": 2061.542,
    "text": "I think now I might say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.688,
    "end": 2070.357,
    "text": " sensory poor and causal poor because the sensory part is of extremely limited",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.441,
    "end": 2077.084,
    "text": " frequency, only some chemicals that we can detect, only some sounds that we hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.064,
    "end": 2081.846,
    "text": "Even within a domain, we're not always paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.227,
    "end": 2092.293,
    "text": "Our blind spot is evidence that we're in a generative model of vision because the sensory data is sparse and noisy and blurry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2093.153,
    "end": 2101.338,
    "text": "And so it's like in the world that's sensory poor and causal poor, we can finally disengage from this like watching a movie",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.674,
    "end": 2103.314,
    "text": " perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.735,
    "end": 2105.236,
    "text": "And it's like, it's so generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.316,
    "end": 2108.618,
    "text": "It's so much about our expectations of the cause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.199,
    "end": 2116.023,
    "text": "And also we're not just watching a movie, a vision, and we're expecting and generating even that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.646,
    "end": 2120.006,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.286,
    "end": 2121.047,
    "text": "So powerful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.127,
    "end": 2132.295,
    "text": "I think this is really why I think there's so much power in our self narratives, because I think those self narratives that we project onto the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.004,
    "end": 2136.646,
    "text": " absolutely impact what we perceive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.726,
    "end": 2159.076,
    "text": "Just yesterday, I was meeting with a very beloved patient of mine who happens to be, you know, a graduate student, you know, who has had a really mixed experience in his lab and feels like he hasn't made any friends and nobody likes him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.397,
    "end": 2160.517,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.334,
    "end": 2166.415,
    "text": " also feels like they're all jerks and they're kind of out to get him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.875,
    "end": 2183.698,
    "text": "And what I tried to get him to see is that he has a narrative and a vision that he superimposes on the world such that all he remembers or appreciates is like the slights, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.818,
    "end": 2188.199,
    "text": "And he doesn't have access to the other things because he's so entrenched.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.943,
    "end": 2191.464,
    "text": " in this particular version of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.526,
    "end": 2216.318,
    "text": "Just to give like a personal example, you know, I talk about in the book, my very complicated relationship with my mom, and how part of the healing for my relationship was to get out of this place where I'm always saying how terrible she is, and instead appreciating really the great things about her, which are many, and also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.077,
    "end": 2218.499,
    "text": " what I've contributed to the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.079,
    "end": 2225.025,
    "text": "But before I could do that, I was engaging in behaviors that just reinforced my worldview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.045,
    "end": 2227.087,
    "text": "And I'll give you a very tangible example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.45,
    "end": 2240.34,
    "text": "One of the things that had bothered me about her was that I would email her and she wouldn't respond to my email in a timely or what I felt was appropriate fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.918,
    "end": 2245.86,
    "text": " and this came up at one point where I emailed her about something that was really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.9,
    "end": 2269.388,
    "text": "I felt it was really important, and she didn't respond, and I gave her a week, and then I gave her a month, and I gave her three months, and I got angrier and angrier as time went on and, you know, railed about it to my husband and say, see, this is exactly what I'm talking about, and then, you know, was eventually just able to just forget about it and whatever, move on, and then I was on email and kind of looking through, I don't know, kind of cleaning up my email and discovered that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.738,
    "end": 2277.462,
    "text": " that my original email that I had sent to her, that I was so angry that she hadn't responded to, was actually in my draft box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.742,
    "end": 2279.222,
    "text": "It had never been sent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.043,
    "end": 2285.405,
    "text": "And I think there are so many ways in which we do that, where we don't even get the opportunity to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.465,
    "end": 2287.606,
    "text": "Like it was just, in this case, I did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.626,
    "end": 2293.249,
    "text": "But we sort of do these things to sort of, you know, hold on to this world view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.022,
    "end": 2299.935,
    "text": " which typically has other people being the bad actors and it doesn't force us to look at ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.599,
    "end": 2301.839,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.899,
    "end": 2302.18,
    "text": "So one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.352,
    "end": 2329.925,
    "text": " interesting piece there is like we might be totally on board for the past being a reconstruction in the present the generative aspect of memory and then it's also easy to believe in the generative aspect of the future it hasn't happened yet we don't know about it and then as per that predictive coding type of like sensory generative model we're also now casting so it's like the past the present the future you know the three",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.885,
    "end": 2333.487,
    "text": " areas that we know about, they're all generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.868,
    "end": 2338.191,
    "text": "So there is reception of signals, but also like all of those are generative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.852,
    "end": 2344.296,
    "text": "And then you pointed to like this idea of kind of a cognitive degree of freedom in our narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.017,
    "end": 2349.941,
    "text": "And so we might even model that as like an action or a movement in a narrative space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.681,
    "end": 2355.305,
    "text": "And so how do we make appropriate actions in narrative space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.385,
    "end": 2358.487,
    "text": "Because do we just say, okay, graduate student?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.567,
    "end": 2359.989,
    "text": "No, they're awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.167,
    "end": 2366.39,
    "text": " Or how do we know what to say and how to actually do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.41,
    "end": 2367.05,
    "text": "Believe it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.31,
    "end": 2367.791,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.831,
    "end": 2371.533,
    "text": "So this student of mine that I mentioned, this patient of mine who happens to be a graduate student.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.853,
    "end": 2375.055,
    "text": "So he's about to, you know, finish up and go on to a postdoc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.515,
    "end": 2380.057,
    "text": "And I actually suggested that to him as sort of as an experiment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.077,
    "end": 2381.458,
    "text": "Because I often talk about this as an experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.478,
    "end": 2388.542,
    "text": "I said, you know, as you move on to your next lab, why don't you try an experiment where you just take as,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.537,
    "end": 2399.546,
    "text": " like an a priori supposition that everybody in the lab loves you, that they want the best for you, that they are your friends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.447,
    "end": 2414.14,
    "text": "And anytime you have like a paranoid thought or a negative thought about them, really critically appraise that and really even doubt that and fact check it or reality test it with somebody else that you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.259,
    "end": 2420.521,
    "text": " And I think through that, he might be able through iterative processes, because it's such a feed forward cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.861,
    "end": 2426.682,
    "text": "The problem is when we're paranoid or suspicious of other people, they sense it and they way back off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.783,
    "end": 2432.024,
    "text": "And then as soon as they back off, we get more paranoid as we should, because they've given us the signal that they backed up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.264,
    "end": 2434.345,
    "text": "And then that, you know, it's a, it's a reinforcing cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.745,
    "end": 2441.347,
    "text": "So if we kind of discard that primary narrative and then act in the world as if, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.037,
    "end": 2448.52,
    "text": " Not in a fake way, but as if certain things were true that we didn't necessarily believe up front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.96,
    "end": 2455.983,
    "text": "And I have to ask my patients to do this all the time, especially when my patients are addicted and whose lives are being destroyed by their addiction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.863,
    "end": 2461.925,
    "text": "I say to them, you have to imagine and essentially have faith that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.541,
    "end": 2465.983,
    "text": " giving up your drug of choice will lead to a better life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.543,
    "end": 2468.344,
    "text": "Right now, what you see is two choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.444,
    "end": 2473.967,
    "text": "You see continuing to use or stop using and being miserable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.567,
    "end": 2482.731,
    "text": "And I'm holding out to you the possibility of stop using and being happy or being happier than you are while you're using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.112,
    "end": 2491.436,
    "text": "But it is a leap of faith because you are going to have to wait a long time and do a lot of things where really you don't feel that at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.113,
    "end": 2496.557,
    "text": " You just have to believe that it's true and approach every day as if that is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.318,
    "end": 2508.048,
    "text": "The other thing I talk about in my book, which is maybe a little bit of a paradox given what I just said, is this idea of radical honesty and how important truth-telling is to this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.128,
    "end": 2515.975,
    "text": "Again, because truth-telling is important to build true narratives, and true narratives are important to be able to know how to make decisions correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.405,
    "end": 2518.105,
    "text": " going forward in our lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.146,
    "end": 2525.367,
    "text": "And it's a small thing, but you know, my patients will say, and patients in recovery will say, I can't lie about anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.387,
    "end": 2530.428,
    "text": "When I was using, I of course lied about my drug use, but I also lied about stuff that it didn't even matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.848,
    "end": 2534.108,
    "text": "And my favorite anecdote is my patient who's now in really sustained recovery, doing great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.449,
    "end": 2537.389,
    "text": "He says, you know, when I was using, I was in the lying habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.409,
    "end": 2540.45,
    "text": "If I was at McDonald's and a patient called and said, hey, where are you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.53,
    "end": 2541.85,
    "text": "I'd say, hey, I'm at Burger King.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.29,
    "end": 2545.753,
    "text": " If I was a Burger King, my patient, my friend would call, I'd say, yeah, I'm Amy Donald's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.233,
    "end": 2549.416,
    "text": "So it got to be like this where like, like lies about everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.456,
    "end": 2553.88,
    "text": "So part of his recovery, and this is what I actually prescribe to patients is radical truth telling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.9,
    "end": 2561.326,
    "text": "Like you cannot tell a lie about anything because that telling the truth, I think helps us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.886,
    "end": 2569.112,
    "text": "First of all, it's, it's cognitively effortful, but secondly, it really grounds us in what is true and real truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.591,
    "end": 2577.256,
    "text": " and helps us in an iterative fashion, stay closer to that, to build these truthful narratives, which I think are really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.436,
    "end": 2590.204,
    "text": "So there's a bit of a paradox there, because I'm saying on the one hand, pretend stuff that you don't feel is true, but which might be true, which you can't see, but at the same time, be really honest about like your daily actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.614,
    "end": 2618.584,
    "text": " nice here here were some of the active themes that i kind of heard there action as a self-fulfilling prophecy and action as being in the business of acquiring evidence for a given generative model that's a big theme and also in order to switch action policies there has to be a transient suppression of precision on the policy like if we're sitting down we have to transiently",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.364,
    "end": 2635.259,
    "text": " implicitly or explicitly believe that it could be a different way otherwise we'll just continue to get evidence that we're sitting down and then um it's a very active way to kind of escape that gaslight paradox so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.5,
    "end": 2662.15,
    "text": " you were talking about setting a confident prior for the next epoch and so that just today you're low on how you believe others think of you and uncertain or you're low and precise but great it's actually all in the past now behaviorally and then in your next endeavor you could just try starting higher in an unknown future but just peg it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.89,
    "end": 2687.792,
    "text": " higher and try to be more precise which is going to look like being more skeptical looking for evidence on the upside and so it's like instead of focusing on the past and trying to re-narrativize the past we can include the behavior of the past which for sure is inalterable into a prospective narrative of the future that makes actions like patience maybe more plausible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.789,
    "end": 2689.61,
    "text": " Yeah, love it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.19,
    "end": 2692.252,
    "text": "I mean, I just love that science speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.292,
    "end": 2692.992,
    "text": "It's so exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.012,
    "end": 2703.66,
    "text": "And it maps so well to these kinds of aphorisms or sort of the approach that we take in psychiatry and psychotherapy, but using very different language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.68,
    "end": 2704.861,
    "text": "And that's always really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.322,
    "end": 2714.068,
    "text": "And it just reminds me so much of the Alcoholics Anonymous saying of taking it one day at a time, which is so fundamental for this whole process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.488,
    "end": 2716.33,
    "text": "Because what happens when we take it one day at a time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.932,
    "end": 2720.533,
    "text": " It means that we wake up and we say the past is the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.253,
    "end": 2722.914,
    "text": "The future is the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.654,
    "end": 2737.158,
    "text": "All I need to do today is focus on what I can do today to make my life and your life and our lives a little bit better without putting too heavy on me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.278,
    "end": 2743.639,
    "text": "Like, I mean, I'm not going to go and like save people in Ukraine, obviously, but what are the things that I can do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.88,
    "end": 2745.48,
    "text": "I can pick up that piece of garbage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.871,
    "end": 2748.493,
    "text": " So it kind of narrows the time scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.873,
    "end": 2766.804,
    "text": "It forces us to be in the here and now, which also expands our senses so that we can take in more actual data so that I'm not like ruminating and cogitating on my own, you know, sort of self-involved, you know, problems, which is where like, you know, most of us spend a lot of our headspace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.824,
    "end": 2768.245,
    "text": "I don't know why we do that, but we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.665,
    "end": 2773.868,
    "text": "But instead I noticed that there's like a Reese's peanut butter cup wrapper on the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.358,
    "end": 2775.878,
    "text": " I could pick that up, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.198,
    "end": 2784.94,
    "text": "That's one thing that I could notice that I have the urge to lie about why I'm late for this meeting, but I could not, I could choose not to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.66,
    "end": 2787.421,
    "text": "I can choose that today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.841,
    "end": 2789.261,
    "text": "That's kind of exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.041,
    "end": 2795.242,
    "text": "Like to me, that sort of opens up all kinds of possibilities because I'm not future catastrophizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.562,
    "end": 2798.103,
    "text": "I'm also not future grandiosing, you know, where they're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.476,
    "end": 2799.737,
    "text": " Like, oh, I have to do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.757,
    "end": 2800.477,
    "text": "I have to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.557,
    "end": 2801.578,
    "text": "Or I'm not going to be good enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.898,
    "end": 2803.399,
    "text": "I'm not ruminating on my past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.479,
    "end": 2804.24,
    "text": "So I'm saying, you know what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.78,
    "end": 2809.203,
    "text": "Today is the only unit of time that I really need to focus on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.644,
    "end": 2814.847,
    "text": "And a string, I always say this to my patients, a string of good days makes a string of good weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.967,
    "end": 2817.549,
    "text": "And a string of good weeks makes a string of good months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.869,
    "end": 2820.371,
    "text": "And before you know it, you've got a couple good decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.731,
    "end": 2821.772,
    "text": "And that's a lifetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.132,
    "end": 2824.854,
    "text": "And that's a life well-lived, which is what we all want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.068,
    "end": 2858.457,
    "text": " and to even bring in one other active term the affordance which is the capacity for action which comes from the ecological psychology field the affordance is relational and so it's about like the motivation by that entity and the agency that they feel they do or don't have from a narrative perspective and the affordances that their niche scaffolds and provides for them or not and also the narratives that the niche provides or not and then like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.955,
    "end": 2863.618,
    "text": " is what is going to be engaged in that behavioral decision in the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.998,
    "end": 2884.794,
    "text": "And then you also talk about like adding friction as like a pragmatic strategy that I'm sure everyone has experimented with variously on different facets, but it's like, it's an example about the pragmatic tips, but also they're connected to behavioral and cognitive modeling in this perhaps even formal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.755,
    "end": 2887.436,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.398,
    "end": 2889.618,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.956,
    "end": 2896.101,
    "text": " We covered many fun topics, like just a few that I kind of wrote down were patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.102,
    "end": 2903.327,
    "text": "I guess the patients who you clinically see and having patients in the moment and then expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.705,
    "end": 2930.638,
    "text": " action and taking action as a first perturbation then the dopamine as reward and epistemic and pragmatic value and there's a lot of interesting research on active inference and dopamine signaling and then a lot of active terms like action priors confidence precision narrative information like all the amazing terms and just very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.803,
    "end": 2935.505,
    "text": " fun and also powerful book and a lot of great material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2937.126,
    "end": 2937.806,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.826,
    "end": 2950.932,
    "text": "This has been really fun as I knew it would be as talking to you is always illuminating and surprising in fun and positive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.952,
    "end": 2959.476,
    "text": "I always learn that I have so much respect for your, you know, intelligence and creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.536,
    "end": 2961.037,
    "text": "It's always exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.166,
    "end": 2967.909,
    "text": " Thank you and hope to talk to you and any others from the farm in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.69,
    "end": 2969.55,
    "text": "Sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.851,
    "end": 2971.052,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.452,
    "end": 2971.612,
    "text": "See ya.",
    "speaker": "SPEAKER_01"
  }
]