[
  {
    "start": 6.195,
    "end": 6.896,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.356,
    "end": 12.199,
    "text": "Welcome to Team Calm Podcast One, tentatively titled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.399,
    "end": 15.36,
    "text": "Really looking forward to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.021,
    "end": 19.983,
    "text": "I'm Daniel, and along with me are Ivan and Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.003,
    "end": 21.444,
    "text": "Do you want to introduce yourself briefly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.167,
    "end": 27.327,
    "text": "Yeah, my name is Alex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.527,
    "end": 30.269,
    "text": "I just can say that I'm a researcher",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.093,
    "end": 57.158,
    "text": " in system management school in moscow by now just for protocol hello my name is joan uh i just interested in internet active inference stuff great well to be interested in active inference is all that's needed for this paper and this discussion so let's get right into it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.598,
    "end": 60.961,
    "text": " We're going to structure the discussion like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.461,
    "end": 67.307,
    "text": "First, we'll start with some warm-up questions, then we'll get to the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.168,
    "end": 75.576,
    "text": "And this isn't the end-all, be-all format for paper discussions, but a few big areas that we'll hit upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.277,
    "end": 78.959,
    "text": "We'll ask, what are the big questions of this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.2,
    "end": 80.721,
    "text": "What do the authors want to address?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.542,
    "end": 88.708,
    "text": " Then we'll go through the abstract line by line because it's really important to understand how the authors summarize their own work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.09,
    "end": 99.958,
    "text": "We'll look at the roadmap of the paper, which sections come in which order so that we can have a big bird's eye perspective on where the paper is going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.055,
    "end": 105.677,
    "text": " Then we'll go down into some definitions and claims that the authors make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.877,
    "end": 112.02,
    "text": "We can ask whether we agree with their definitions or whether their claims resonate with how we think about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.261,
    "end": 119.143,
    "text": "Then we'll have time to have any questions that we want to address that are about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.084,
    "end": 129.128,
    "text": "And then also there's a few slides at the end where we prepared some visualizations about markup blankets and about active inference itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.737,
    "end": 132.637,
    "text": " So let's get to the warm-up questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.938,
    "end": 137.059,
    "text": "And so either of you can maybe give a first thought here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.459,
    "end": 138.219,
    "text": "What is a narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.719,
    "end": 140.639,
    "text": "And how is a narrative different than a story?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.081,
    "end": 149.162,
    "text": "And this can come from the free energy active inference perspective or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.302,
    "end": 151.002,
    "text": "But one of you two, guys, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.124,
    "end": 158.664,
    "text": "At the moment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.268,
    "end": 183.622,
    "text": " i believe what first when what we need to do what we need to define this difference because uh if we have two words uh it should mean something different but as in any case it's depends on perspective and interest from how we see it and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.265,
    "end": 196.69,
    "text": " Maybe is a narrative and ontology is also some different and ontology is different from the story as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.091,
    "end": 204.615,
    "text": "So some kind of more formal definition for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.335,
    "end": 214.18,
    "text": "We have a great review on different papers presented in the text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.7,
    "end": 239.862,
    "text": " and so it looks like a state of the art in this field from scientific point of view but if we go more engineering way and trying to find a way to and approaches to use functions of these narratives ontologies and lately stories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.625,
    "end": 243.265,
    "text": " Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.406,
    "end": 246.928,
    "text": "And we'll get to see exactly their definition of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.048,
    "end": 248.949,
    "text": "It's actually the first sentences of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.89,
    "end": 250.791,
    "text": "Yvonne, anything there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.332,
    "end": 252.532,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.572,
    "end": 253.793,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.573,
    "end": 265.5,
    "text": "Another question that is sort of a fundamental in communication but also very important applied question is how individual and collective narratives interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.001,
    "end": 268.743,
    "text": "So do groups genuinely have narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.816,
    "end": 273.158,
    "text": " or do group narratives just consist of individual narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.82,
    "end": 280.402,
    "text": "We can, I mean, we can move past these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.442,
    "end": 287.225,
    "text": "These are really just for warming up and thinking about what the paper is arising out of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.706,
    "end": 293.409,
    "text": "And so just the last warm up question that anyone could like a stretch before hitting the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.929,
    "end": 296.67,
    "text": " before you run the paper, you might want to stretch with these questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.29,
    "end": 311.395,
    "text": "And just to really get us thinking big about what this paper could be about and what science can tell us about narratives, this question is, what does a functional evolutionary or statistical perspective on narratives look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.035,
    "end": 320.978,
    "text": "So instead of just approaching it from a psychological or from an anthropological perspective, how can we take it deeper and connect it to other areas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.918,
    "end": 325.101,
    "text": " Any last warm-up thoughts or we can just go right into the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.245,
    "end": 348.821,
    "text": "Maybe yes and it's about introduction and first sentence in introduction about narratives are report of real or imagined events and maybe I was not so close inside but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.915,
    "end": 357.14,
    "text": " maybe we need to define some definition and perspective about events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.04,
    "end": 375.352,
    "text": "What is it events for us at this moment and in systems and events in Active Inference, what could be here like fundamental for us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.711,
    "end": 382.614,
    "text": " Good question, and we're going to return to their exact definition of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.634,
    "end": 384.395,
    "text": "We'll have it up on a later slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.635,
    "end": 388.137,
    "text": "So keep that thought around, and let's just go into the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.157,
    "end": 396.962,
    "text": "So the paper we're going to be discussing is called Narrative as Active Inference, an Integrative Account of the Functions of Narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.422,
    "end": 401.064,
    "text": "And it was posted on SciArchive, which is a preprint server.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.544,
    "end": 403.465,
    "text": "The version we're looking at is from June 18, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.766,
    "end": 410.209,
    "text": " And the first author's name is Nabil Bouzagarin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.65,
    "end": 412.211,
    "text": "Apologies for pronunciation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.131,
    "end": 415.653,
    "text": "And there are several other authors as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.814,
    "end": 420.857,
    "text": "The paper really sets out to address a few big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.128,
    "end": 431.231,
    "text": " The first question is, what does the concept of active inference offer us in the context of narrative or when discussing the concept of narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.951,
    "end": 432.951,
    "text": "That's the big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.471,
    "end": 450.816,
    "text": "And then to take it down one more level, they're going to specifically ask, how does this active inference perspective on narrative address questions related to identity, episodic memory, future projection, event segmentation, which is actually I trimmed it, but it's related to what you're discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.297,
    "end": 453.298,
    "text": " storytelling, enculturation, and more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.479,
    "end": 455.78,
    "text": "So let's get to the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.221,
    "end": 459.262,
    "text": "It's kind of simulating reading a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.522,
    "end": 465.105,
    "text": "You know, start from a title, then we'll go through the abstract, and then we'll go into the definitions next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.486,
    "end": 471.349,
    "text": "But let's just go bit by bit through the abstract so we can really see what the authors think they're doing in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.01,
    "end": 479.234,
    "text": "First sentence is basically saying that narratives are important and other people have recognized it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.814,
    "end": 486.439,
    "text": " The second sentence says that research has identified several functions of narratives that are important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.261,
    "end": 497.869,
    "text": "If anyone has any thoughts that they want to add on to one of these sentences or disagreement, they can also use the raise hand feature in Jitsi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.389,
    "end": 505.556,
    "text": "So in the bottom left, the hand, if you want to say something, the abstract is not too contentious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.386,
    "end": 513.694,
    "text": " In this paper, this is the key signal phrase that's marking what they're actually doing in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.315,
    "end": 517.579,
    "text": "They're going to characterize social and cognitive functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.859,
    "end": 525.909,
    "text": "Those are the plurality of functions of narratives in terms of the framework of active inference, which we're going to talk a lot more about in detail what is active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.728,
    "end": 537.452,
    "text": " And then they say that active inference is depicting the fundamental tendency of organisms to adapt, update, and maintain inference about their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.933,
    "end": 541.894,
    "text": "That's sort of the beginnings of a definition of active inference, which we're going to come back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.335,
    "end": 553.76,
    "text": "They then review literature related to the function of narratives in all of those areas that we discussed, identity, event segmentation, episodic memory, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.881,
    "end": 568.244,
    "text": " And then the last sentence of the short abstract is we recast these functions of narratives in terms of active inference, outlining a parsimonious model that can guide future developments in narrative theory, research and clinical applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.904,
    "end": 577.926,
    "text": "And so this is kind of a common theme that we see in active inference and free energy principle related research at this current moment in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.766,
    "end": 603.405,
    "text": " the uh second half of the 2010s and the 2020 period which is um the authors usually consisting of a team with some disciplinary experts as well as some more free energy or active inference experts will approach an area like narratives or depression or evolution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.125,
    "end": 608.769,
    "text": " And they'll seek to integrate multiple phenomena under a common model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.289,
    "end": 622.499,
    "text": "So instead of saying, well, you've got the short term memory system and the long term memory and the declarative memory and this type of memory, they'll sort of recast a lot of previous models into one common framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.979,
    "end": 624.861,
    "text": "So that's what active inference can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.521,
    "end": 630.142,
    "text": " And the idea would be that by having an integrated framework, we're going to get multiple benefits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.582,
    "end": 640.124,
    "text": "The first is that we have an elegant and a parsimonious way for addressing the otherwise unrelated phenomena arising from the same physical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.644,
    "end": 644.385,
    "text": "So we shouldn't have 10 models for describing 10 different kinds of memory in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.865,
    "end": 649.706,
    "text": "We should have one model for memory in the brain, and then different aspects of it could relate to these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.606,
    "end": 652.348,
    "text": " phenomena that we want to actually explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.009,
    "end": 668.825,
    "text": "And the second thing, so it gives internal coherence to the study of systems to use an integrated framework, but also it provides external coherence because now the information or the thermodynamic components of the brain can be considered alongside something like a computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.966,
    "end": 670.767,
    "text": "So that's the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.981,
    "end": 677.765,
    "text": " Here's the roadmap of the paper, and I just copied out the section titles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.526,
    "end": 690.316,
    "text": "And this is just so that even if some of these section titles sound a little bit like they're not fully specified or anything, this is just so we can first sketch out the whole arc of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.056,
    "end": 701.56,
    "text": " The first section is called the function of narrative, and you can see they're going to be talking about narrative from a non-free energy, non-active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.82,
    "end": 712.923,
    "text": "They're going to be drawing on other research, for example, relating narrative to identity, meaning-making, which is also sometimes called sense-making, and coherence as well as storytelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.523,
    "end": 717.725,
    "text": "They'll talk about the narrative practice hypothesis, which is from social psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.837,
    "end": 732.937,
    "text": " The second section of the paper is explicitly about active inference, where they define active inference, and then they specifically relate how active inference can be thought of when looking at human social and cultural life",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.468,
    "end": 740.432,
    "text": " And then the third section of the paper, no surprise, is narratives as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.953,
    "end": 757.825,
    "text": "And so here is where they're going to combine section one and two into discussing how framing narrative as active inference gives us these features of a model that we'd like to see, like it's elegant, it's parsimonious, it has high explanatory power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.845,
    "end": 763.429,
    "text": "It might lead to unique predictions, unique explanations, unique experiments that we could test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.829,
    "end": 768.693,
    "text": " These are all the things that we care about from a scientific and a meta scientific perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.274,
    "end": 771.976,
    "text": "So that's the big roadmap of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.356,
    "end": 778.001,
    "text": "And now we can finally get into the first two sentences of the paper, which are right here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.641,
    "end": 782.905,
    "text": "And Alex, this is where you were talking about the definition of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.445,
    "end": 787.888,
    "text": " So it's great that they begin the paper just with a definition of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.289,
    "end": 793.172,
    "text": "And I'll just read it out, and then either of you or both of you, I'd love to hear your thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.372,
    "end": 794.573,
    "text": "Where does this resonate with you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.753,
    "end": 795.774,
    "text": "Where does it not resonate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.294,
    "end": 806.642,
    "text": "They write, narratives are reports of real or imagined events which can be presented in language, either verbally or textually, or through sequences of images or other symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.728,
    "end": 809.49,
    "text": " That's their first short definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.75,
    "end": 818.68,
    "text": "And the second sentence is, the narrativity of these reports lies not just in their content, which may point directly to specific events, but also in their structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.08,
    "end": 826.228,
    "text": "That is, the ways in which the linguistic or other symbols convey a set of relationships among events, especially temporal relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.589,
    "end": 827.53,
    "text": "So what do you guys think?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 839.64,
    "end": 861.347,
    "text": " Here, for me, what is important here that it's present idea about ability in a language to present, to represent maybe to person firstly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.105,
    "end": 873.332,
    "text": " and he can share it in text and describe himself and maybe try to understand somebody using these symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.115,
    "end": 879.356,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.177,
    "end": 881.957,
    "text": "Ivan, anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.521,
    "end": 889.402,
    "text": "No, not right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 890.706,
    "end": 890.966,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.086,
    "end": 899.428,
    "text": "So I think there's a few other words that we might want to also define, and this is the nature of language, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.468,
    "end": 902.569,
    "text": "We could always go and ask, well, what is a report?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.169,
    "end": 909.331,
    "text": "Is a narrative only real if it's reported or what's the difference between real and imagined or what do you mean symbols?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.531,
    "end": 916.893,
    "text": "So there's a lot of play in these definitions still, but the features that I found interesting, the first part,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.805,
    "end": 922.127,
    "text": " is that narratives are specific reports of real or imagined events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.727,
    "end": 927.749,
    "text": "So it's kind of like if a tree falls in a forest and no one hears it, did it happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.809,
    "end": 931.49,
    "text": "If no one reports the narrative, there is no narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.131,
    "end": 934.032,
    "text": "If nobody's speaking, there's no narrator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.412,
    "end": 942.315,
    "text": "So a narrative is a declarative event in that telling the narrative or experiencing it is what makes it real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.268,
    "end": 952.272,
    "text": " And then also this idea that a narrative is a sequence of symbols, whether they're verbal symbols or text symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.193,
    "end": 956.674,
    "text": "These symbols are representative as symbols are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.735,
    "end": 961.977,
    "text": "And to bring it to the second section, the string of symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.697,
    "end": 968.379,
    "text": " It's not just that there's a Shannon entropy of the string or there's some surprise or there's some sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.06,
    "end": 976.943,
    "text": "It's actually that the representative nature of the symbols is inferring something about specific events, again, either real or imagined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.783,
    "end": 979.404,
    "text": "Also, how the events are linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.004,
    "end": 984.026,
    "text": "And this is especially important in the context of things happening through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.461,
    "end": 987.202,
    "text": " So that's their definition of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.843,
    "end": 993.587,
    "text": "And pretty shortly after that, we get to one of their fundamental claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.308,
    "end": 1004.136,
    "text": "And there's going to be a key sentence here that is actually meta-scientific in the sense this is their evaluation of the research literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.796,
    "end": 1010.798,
    "text": " They say that narrative has socio-interactional and cognitive representational functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.618,
    "end": 1017.5,
    "text": "However, the extant literature tends to focus on only one of these two aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.6,
    "end": 1021.781,
    "text": "In other words, they're saying that the narrative has socio-interactional roles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.261,
    "end": 1027.723,
    "text": "For example, the narrative of a country is often manifested through politics or through policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.445,
    "end": 1034.987,
    "text": " There are social implications for the interactions between different narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.608,
    "end": 1038.81,
    "text": "And then that's sort of bodies interacting with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.49,
    "end": 1044.514,
    "text": "But then inside of the head, there's also this cognitive representational component of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.974,
    "end": 1052.679,
    "text": "And that has to do with how different people experience narratives or how different altered states of consciousness influence the ability to generate narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.68,
    "end": 1054.24,
    "text": "And then they write.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.83,
    "end": 1060.614,
    "text": " In this paper, we propose a unified model that accounts for both of the functions of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.294,
    "end": 1066.438,
    "text": "So this is where they're taking stock of the previous state of the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.898,
    "end": 1072.361,
    "text": "They're saying, look, narrative literature falls into basically either one of two categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.642,
    "end": 1080.627,
    "text": "Either it's about treating the person as a black box and then looking at how narratives occur in the social context, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.607,
    "end": 1088.211,
    "text": " It goes the other approach, which is it zooms in on the brain or on the mind from a neuro or from a psychological perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.731,
    "end": 1095.635,
    "text": "And that ends up giving not enough emphasis to the social components of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.456,
    "end": 1105.48,
    "text": "So my questions for you two are, what are the implications of this unresolved dichotomy and what might an answer to this problem look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.069,
    "end": 1117.753,
    "text": " In other words, what would it look like to have a satisfying science of narratives and what are the implications of us not having that satisfying science of narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.017,
    "end": 1135.421,
    "text": "If there will be implications for one common model and it will be possible to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.137,
    "end": 1146.811,
    "text": " predict outcomes for testing this model in different applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.951,
    "end": 1150.958,
    "text": "This could be more scientifically or at least engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.517,
    "end": 1160.062,
    "text": " Yep, and another engineering perspective on this would be false positive and false negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.542,
    "end": 1164.606,
    "text": "So let's just say that we have two different methods for dealing with narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.926,
    "end": 1168.469,
    "text": "One of them doesn't give enough emphasis to what's happening inside of the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.11,
    "end": 1171.211,
    "text": "That's the socio-interactional one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.692,
    "end": 1176.056,
    "text": "And then the other perspective on narrative doesn't give enough emphasis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.676,
    "end": 1178.237,
    "text": " emphasis on what's happening outside of the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.857,
    "end": 1182.198,
    "text": "And so we're going to end up with false positives and false negatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.498,
    "end": 1184.699,
    "text": "We're going to end up with lost in translation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.719,
    "end": 1191.941,
    "text": "We're going to end up with situations where one approach leads to one prediction, but then a different approach leads to a different prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.561,
    "end": 1197.824,
    "text": " And without some sort of higher level theory to help us resolve that, there's just not going to be clarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.165,
    "end": 1211.593,
    "text": "So we can see that having this unresolved dichotomy, not just is it theoretically unsatisfying, it'd be like if you had one model for physiology that happened just in the liver and one in the outside of the liver,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.373,
    "end": 1223.538,
    "text": " But that would be theoretically unsatisfying, but also it might lead to some very real consequences when models don't agree, and then people end up acting off of the bad information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.338,
    "end": 1230.04,
    "text": "So no surprise here, but they're going to resolve this dichotomy with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.78,
    "end": 1232.981,
    "text": "So here's how they define active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.902,
    "end": 1241.465,
    "text": "And then we're going to spend a lot of time talking about active inference and adding in some more figures, because there aren't any figures in this paper, which is totally fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.206,
    "end": 1249.009,
    "text": " But the crux of the issue is about applying active inference to the idea of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.109,
    "end": 1257.894,
    "text": "So we really want to understand what active inference is, and then we'll use the active inference framework to potentially reduce our uncertainty about what narratives are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.494,
    "end": 1266.919,
    "text": "So they write, active inference is a new theory that provides an account of the nature and mechanisms of knowledge-driven context appropriate action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.88,
    "end": 1271.582,
    "text": "Originally proposed as a theory of the structure, function, and dynamics of the brain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.253,
    "end": 1281.626,
    "text": " in the 2010 Friston paper, active inference provides a broad framework that has been extended to explain living organisms and cognitive systems across multiple scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.628,
    "end": 1284.51,
    "text": "So that's the definition of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.971,
    "end": 1287.274,
    "text": "And I just tried a little first stab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.865,
    "end": 1295.008,
    "text": " There's two big key terms, and they come up again and again in this discussion and in others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.208,
    "end": 1301.652,
    "text": "And that's active inference, which is I put it in an idea cloud because this is the big idea that we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.172,
    "end": 1304.893,
    "text": "And on the bottom right there is the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.534,
    "end": 1308.395,
    "text": "And the free energy principle is the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.876,
    "end": 1312.978,
    "text": "It's the model that we're working under.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.738,
    "end": 1315.779,
    "text": " that we get active inference from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.559,
    "end": 1329.602,
    "text": "And in the 2018 interview where Fristin says that the free energy principle is beyond falsification, it's at the axiomatic level, so that doesn't mean it's indubitably correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.203,
    "end": 1338.385,
    "text": "In fact, axioms exist beyond the space of correct versus incorrect because correct and incorrect only exist within the context of an axiomatic set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.265,
    "end": 1348.268,
    "text": " And Friston compares free energy principle to something more like the principle of least action from physics in the sense that other patterns are fit within that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.408,
    "end": 1351.529,
    "text": "So it's kind of like the, it's the canvas that we're going to be drawing on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.33,
    "end": 1357.812,
    "text": "And so here are a few of the key things that combine to give us active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.812,
    "end": 1361.153,
    "text": "One of them is informational thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.136,
    "end": 1369.301,
    "text": " Another important topic is informational foraging, and that's the active part, is the actual foraging for information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.141,
    "end": 1385.271,
    "text": "Then another term that comes into play is deep models, so temporally deep models with a deep past and a deep future predictive component, as well as you could almost call them thick models, so models that include multiple modalities or multiple perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.189,
    "end": 1390.851,
    "text": " There's an element of the integration of ecology, evolution, and development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.452,
    "end": 1397.475,
    "text": "So we're not looking to make a science of narratives that only applies to tweets or only applies to novels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.935,
    "end": 1402.137,
    "text": "We want something that's fully grounded in ecology, evolution, and development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.778,
    "end": 1409.741,
    "text": "And then also there's this key term, the Markov blanket, which we're going to go into a little bit more detail in the coming slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.202,
    "end": 1412.803,
    "text": "But first off, what do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.319,
    "end": 1416.56,
    "text": " What does that make you guys think about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.885,
    "end": 1435.171,
    "text": "Great overview about domains and basic stones for these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.291,
    "end": 1442.155,
    "text": "So really, as free energy principle, the principle give us the opportunity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.096,
    "end": 1471.521,
    "text": " and freedom to try to implement it to explain different systems and organisms so and active inference as a more focused on this domain around a brain about how its work on cognitive and metacognitive levels and so on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.857,
    "end": 1498.496,
    "text": " yep and that's the key difference between the axiomatic principles which cannot be falsified in other words there's no observation that would falsify the free energy principle whereas evolution by natural selection just to give an example it could be falsified if we found some sort of anomalous explanation or an anomalous observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.076,
    "end": 1503.361,
    "text": " then it could reduce the likelihood that a certain model is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.501,
    "end": 1507.966,
    "text": "In other words, specific hypotheses arise from these other fields that I have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.522,
    "end": 1511.463,
    "text": " written in the black or the dashed line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.983,
    "end": 1517.626,
    "text": "Like if you find that the organism is only looking one second into the future, it's not a deep model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.866,
    "end": 1519.987,
    "text": "So you can test whether it's a deep model or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.487,
    "end": 1523.288,
    "text": "You can test the role of ecology, evolution, development, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.189,
    "end": 1528.931,
    "text": "You could look at whether the actions of the organism are consistent with thermodynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.131,
    "end": 1557.783,
    "text": " you know if more energy is coming out of the system than coming in then it violates thermodynamics so that's something specific and on the other hand free energy principle is a little bit different and uh there's so much to this and you know every every podcast we do every discussion we have we could spend so long discussing the fundamentals and so i feel like it's a good approach each time it's like a coat of paint we're just going to keep on coming over the same topics again and again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.641,
    "end": 1561.142,
    "text": " and going into them a little bit more deeply each time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.962,
    "end": 1564.823,
    "text": "So let's look a little bit at the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.043,
    "end": 1571.206,
    "text": "And here I'm drawing from a paper of Gallagher and Allen, 2016, which is in the Synthese, the journal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.986,
    "end": 1575.127,
    "text": "And this paper is pretty nice because it's not by Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.228,
    "end": 1584.571,
    "text": "It's a rarity, you know, but it's not by Friston, but it contextualizes the work of Friston and collaborators from a philosophical perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.191,
    "end": 1588.493,
    "text": " So here are philosophers trying to talk about Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.434,
    "end": 1603.283,
    "text": "They're focusing on this center node A, and they write the circle that's shaded in gray, the big one, represents the Markov blanket of node A. This consists of A, its children, parents, and parents of children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.824,
    "end": 1606.145,
    "text": "So here is how I'm thinking about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.746,
    "end": 1614.471,
    "text": "Pedigree, like a family tree, is a metaphor for the generative process that leads to people or leads to a person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.117,
    "end": 1620.681,
    "text": " you know that any person has to have two parents, and if any children, there has to be a partner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.801,
    "end": 1623.663,
    "text": "So that's like S in this, the parent of child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.224,
    "end": 1640.236,
    "text": "So now what's interesting to note is in a world where the rules are different, for example, if three people were required to create a child, or we were able to create a cloning technology where only one person was required to create another human,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.876,
    "end": 1647.04,
    "text": " Then the rules of this system would be different, and so the Markov blanket would be drawn differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.62,
    "end": 1655.945,
    "text": "So generalize this idea of a structural form or a scheme, a schema, for causal forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.586,
    "end": 1663.37,
    "text": "So it's like the two parents cause A. This is not saying, oh, those are the only two things that cause a person to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.049,
    "end": 1673.2,
    "text": " other things, but just within the context of a pedigree, the only information you need to know is the parents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.148,
    "end": 1681.59,
    "text": " there's times where these connections that are being extracted are statistical and there's times where they're causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.01,
    "end": 1688.631,
    "text": "And this is sort of an interesting point because it really gets at the heart of what do these lines represent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.371,
    "end": 1698.254,
    "text": "And so there's times where the real world system, we don't know about where the edges are and we want to use observed data to get the edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.374,
    "end": 1704.015,
    "text": "So we have a bunch of stock prices and we want to run a model that says, okay, when gold goes up,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.455,
    "end": 1711.318,
    "text": " then we want an arrow from the gold node to some other node for when the price responds in relationship to gold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.778,
    "end": 1716.18,
    "text": "So that's like a statistical or numerical extraction of these edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.701,
    "end": 1721.663,
    "text": "And that is related to approaches like structural equation modeling, SEM modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.552,
    "end": 1726.695,
    "text": " causal and tropic forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.416,
    "end": 1733.04,
    "text": "And then there's other times, like in the case of this graph, where the relationships are genuinely causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.36,
    "end": 1738.724,
    "text": "So that's where the edge is actually representing a cause-effect relationship of the states of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.645,
    "end": 1743.368,
    "text": "So I'm going to nuance this Markov blanket drawing a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.608,
    "end": 1752.392,
    "text": " So here it says, in small script, the subpartition of internal and external states is going to occur according to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.452,
    "end": 1753.932,
    "text": "This is the caption of that figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.473,
    "end": 1758.755,
    "text": "And then I just added extra colors instead of just having the subscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.375,
    "end": 1767.059,
    "text": "So I blacked out the hidden external states to really emphasize that the things that are outside of the Markov blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.799,
    "end": 1770.543,
    "text": " are truly speculative causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.983,
    "end": 1774.688,
    "text": "So in this case, it's like we don't know who the grandparents of A are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.269,
    "end": 1780.035,
    "text": "We know that something led to the parents, but we truly don't know what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.616,
    "end": 1783.8,
    "text": "And then we know that something has to lead to the parents of the child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.0,
    "end": 1785.142,
    "text": "But again, we don't know where they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.492,
    "end": 1788.276,
    "text": " And then there could be downstream effects of the child, but we don't know what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.897,
    "end": 1799.273,
    "text": "And so A, like the focal individual, what's happening inside of that green node is the internal states of A, the system in focus, the system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.154,
    "end": 1809.842,
    "text": " And then you can think of the things that A causes, whether by itself or with a collaborator, are like the active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.002,
    "end": 1821.912,
    "text": "Those are the admitted actions of A. And then everything that is coming into the Markov blanket but isn't an internal state and isn't an active state is a sensory state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.632,
    "end": 1831.618,
    "text": " And it's kind of weird to think about a pedigree as having sensory states, but we'll see a few other versions of Markov blankets where the term sense is going to be more appropriate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.039,
    "end": 1838.103,
    "text": "But the point is whether you call it a sensory state or just a Markov blanket input, it's the same structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.943,
    "end": 1843.306,
    "text": "Any questions on that or there's some more visualizations of Markov blankets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.749,
    "end": 1848.83,
    "text": "Yeah, maybe let's see some more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.731,
    "end": 1849.931,
    "text": "Cool."
  },
  {
    "start": 1851.195,
    "end": 1855.716,
    "text": " So another key point about Markov blankets is that they can be multi-scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.536,
    "end": 1860.117,
    "text": "So here I've borrowed a figure from Ramstad et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.817,
    "end": 1870.56,
    "text": "2018, and this is the Answering Schrodinger's Question paper, which is a extremely powerful multi-level phrasing of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.124,
    "end": 1883.509,
    "text": " And so I've carried over those same hidden internal active and sensory states idea and then added this pink or magenta color to the outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.929,
    "end": 1885.189,
    "text": "And that's the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.609,
    "end": 1888.17,
    "text": "So we can see the hidden states are outside of the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.751,
    "end": 1893.552,
    "text": "And then the active states, the blue circles, are what penetrate outward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.833,
    "end": 1896.193,
    "text": "Those are actions that leave the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.614,
    "end": 1900.355,
    "text": "And then the red states are incoming sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.84,
    "end": 1907.243,
    "text": " Now, the reason we can talk about multi-scale Markov blankets is reflected here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.843,
    "end": 1913.325,
    "text": "So this whole thing, let's just say this is like a cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.206,
    "end": 1919.448,
    "text": "Inside of the cell, you have some stuff going on, and then you have actions coming out, and you have sense coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.089,
    "end": 1926.872,
    "text": "But that cell is actually also in the context of a larger unit, let's say a tissue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.652,
    "end": 1930.094,
    "text": " And in this case, a bunch of cells are next to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.174,
    "end": 1934.076,
    "text": "And so each cell is doing this at the cellular receptor level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.456,
    "end": 1942.601,
    "text": "But then the organ can also be thought of as having internal, external, active, and sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.621,
    "end": 1946.003,
    "text": "And what the mathematical claim is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.185,
    "end": 1953.148,
    "text": " is that there's a continuity between these two different levels of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.928,
    "end": 1957.409,
    "text": "And so there's a few ways you can think about this continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.09,
    "end": 1960.951,
    "text": "One is just the compositionality argument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.687,
    "end": 1982.305,
    "text": " which is like, okay, if tissues are composed of cells and cells are composed of organelles, it's sort of a Markov blankets all the way down approach, but there's also some formal continuities as well as some possible ways which we can make a model of this level, which is a mixture of Markov blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.665,
    "end": 1988.19,
    "text": "And then here at the more granular level, we can actually parameterize those relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.783,
    "end": 1999.708,
    "text": " And another way that we can look at the Markov blanket, again, I'm invoking the previous magenta pedigree version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.888,
    "end": 2003.971,
    "text": "So here's the pedigree version of the Markov blanket around A, the focal individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.691,
    "end": 2010.535,
    "text": "And then here, I've used the same colors on a neural-focused Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.995,
    "end": 2014.477,
    "text": "So here, the Markov blanket is around the brain or the brain of the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.288,
    "end": 2022.139,
    "text": " and the internal states are what are happening inside the brain, action states leave the brain, and sensations enter the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.674,
    "end": 2026.437,
    "text": " And then the hidden states are what are happening outside of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.038,
    "end": 2030.501,
    "text": "And then I put this kind of arrow in quotation marks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.641,
    "end": 2034.945,
    "text": "And this is really where we get to the idea of a causal generative model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.425,
    "end": 2041.471,
    "text": "And that's when the brain speculates about how causes in the world might actually be related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.031,
    "end": 2048.377,
    "text": "And it turns out that having a causal model of the world is one of the most effective ways to reduce your uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.857,
    "end": 2059.365,
    "text": " Because if you're always just waiting for sensations to show up and then trying to deal with them by changing your model or by doing actions, it's going to be a very confusing world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.906,
    "end": 2068.813,
    "text": "But if you can have a causal model of the world that says, for example, oh, a car is something that emits certain light and sound and heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.453,
    "end": 2071.915,
    "text": "And so none of those different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.036,
    "end": 2079.54,
    "text": " stimuli are surprising because I have a generative model of the world where a car is driving in the street in front of me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.12,
    "end": 2082.421,
    "text": "And so that's what explains the sensations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.962,
    "end": 2089.845,
    "text": "You don't need to explain the sensations of the sound by changing your role model or by doing action per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.186,
    "end": 2094.048,
    "text": "Just making this causal link in the world can reduce your uncertainty a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.168,
    "end": 2099.611,
    "text": "But that's something that whether or not it's in the world, it's actually being inferred by the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.595,
    "end": 2109.657,
    "text": " And then just to unpack the math one more level and also connect the brain out to other systems, here's a very similar drawing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.558,
    "end": 2119.78,
    "text": "And this is just showing how, again, the internal states of the brain influence the active states, which influence the world, plus the world has its own dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.44,
    "end": 2124.581,
    "text": "Those relate to sensory readouts, which influence the brain's internal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.901,
    "end": 2126.542,
    "text": "And again, that plays back into action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.322,
    "end": 2137.471,
    "text": " And similarly, in the context of a non-brain cognitive entity like a bacillus, we see that this internal model, there's the exact same relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.571,
    "end": 2139.432,
    "text": "The internal model influences action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.173,
    "end": 2142.895,
    "text": "Action influences the world, plus it influences itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.676,
    "end": 2150.902,
    "text": "Then the world influences observed states, sensory states, and those feed back into the internal model of the bacterium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.562,
    "end": 2156.285,
    "text": " And so this is something that goes beyond brains or neurons or neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.345,
    "end": 2159.687,
    "text": "This is something that has to do with inference and Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.748,
    "end": 2162.029,
    "text": "Any thoughts on that one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.571,
    "end": 2167.152,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.512,
    "end": 2169.213,
    "text": "Maybe it will be late.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.053,
    "end": 2180.22,
    "text": "Important, I think, about how Markov blanket set up borders with outside",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.144,
    "end": 2181.805,
    "text": " of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.705,
    "end": 2194.135,
    "text": "So we can consider and work with it as a real border to define information flows or something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.115,
    "end": 2195.576,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.656,
    "end": 2201.781,
    "text": "So I think there we could go to section 1.1 of the paper, Narratives as Cognitive Schemas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.53,
    "end": 2210.556,
    "text": " Maybe I'm sort of jumping ahead by just already talking about the active inference perspective on narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.397,
    "end": 2217.222,
    "text": "But when I think about narrative and Markov blankets, one thought is like a joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.483,
    "end": 2219.884,
    "text": "Three people walk into a bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.905,
    "end": 2224.349,
    "text": " It's like it's already told you the who and the what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.87,
    "end": 2226.972,
    "text": "It's told you who is entering what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.092,
    "end": 2228.353,
    "text": "The Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.453,
    "end": 2230.516,
    "text": "We're not talking about the street outside the bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.956,
    "end": 2234.38,
    "text": "We're not talking about the office building down the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.76,
    "end": 2238.204,
    "text": "We're talking about the physical border of the bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.265,
    "end": 2242.227,
    "text": " And we're talking about three people entering that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.767,
    "end": 2245.589,
    "text": "So we still there's a lot of uncertainty in that narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.669,
    "end": 2258.877,
    "text": "But just by saying three people walk into a bar, if the next line of the story is and then the chicken says it's like it's a non sequitur because that is something happening in the story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.918,
    "end": 2263.32,
    "text": " But it's not part of the actual narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.721,
    "end": 2265.522,
    "text": "It's not part of what was set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.102,
    "end": 2277.99,
    "text": "And so short stories or jokes or other narrative retellings are like little model systems where we can explore how exactly are narratives set up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.171,
    "end": 2279.031,
    "text": "What are the inputs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.271,
    "end": 2281.773,
    "text": "What are the transformations that happen during the narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.793,
    "end": 2282.714,
    "text": "And then what are the outputs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.294,
    "end": 2284.575,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.397,
    "end": 2295.7,
    "text": " Yeah, I think it's possible to consider this perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.401,
    "end": 2308.267,
    "text": "And maybe one thing I want to add on this slide about sensations and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.048,
    "end": 2317.573,
    "text": "So if we can speak about mental action and a sensation like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.618,
    "end": 2325.741,
    "text": " mental representation of person for himself, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.562,
    "end": 2326.742,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.684,
    "end": 2342.394,
    "text": "So in this way, mental action, is it the same action or you need to do this action with, yeah, you need to do this action with outer world, yeah, for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.955,
    "end": 2345.796,
    "text": "Great, great, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.217,
    "end": 2347.698,
    "text": "And this is kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.769,
    "end": 2357.293,
    "text": " For example, when people talk about speech as a motor behavior, then it's like it all works for when people are speaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.353,
    "end": 2363.635,
    "text": "But then what about the mental action of preparing speech or of hearing voices but not vocalizing them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.696,
    "end": 2370.738,
    "text": "So there's this question about representation, which is basically, like you said, is mental action action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.358,
    "end": 2376.44,
    "text": "And then the flip side of that is, is mental representation sensation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.841,
    "end": 2377.761,
    "text": "Is that fair?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.997,
    "end": 2380.618,
    "text": " Yeah, correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.319,
    "end": 2381.579,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.699,
    "end": 2383.301,
    "text": "So here's what I would say to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.843,
    "end": 2394.536,
    "text": "What we're experiencing as conscious entities, I mean, not speak for anyone else, but what we're experiencing is always our internal generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.0,
    "end": 2398.863,
    "text": " So that's why when we look out at the world, we don't see a blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.044,
    "end": 2409.413,
    "text": "It's why the world appears to have similar clarity across the whole visual field, have color across the visual field, et cetera, because we're experiencing our generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.973,
    "end": 2419.962,
    "text": "And so when there's a mental arising, when there's awareness of some phenomena that isn't necessarily driven by a change in the external",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.322,
    "end": 2420.762,
    "text": " conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.882,
    "end": 2421.702,
    "text": "So you're in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.882,
    "end": 2424.983,
    "text": "It's a dark room or it's an unchanging light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.563,
    "end": 2428.864,
    "text": "And all of a sudden, you think about being at the lake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.444,
    "end": 2431.924,
    "text": "So that's an experience that you're having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.584,
    "end": 2433.424,
    "text": "It could be a memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.444,
    "end": 2434.325,
    "text": "It could be a fantasy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.365,
    "end": 2435.565,
    "text": "You could put different words on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.085,
    "end": 2442.046,
    "text": "But no sensory data entered you to cause that thought to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.746,
    "end": 2448.007,
    "text": "And so in this model of the Markov blanket, the sensations are actually very, very specifically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.888,
    "end": 2454.752,
    "text": " the sensory information that's being transmitted through the primary senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.252,
    "end": 2460.856,
    "text": "So the internal states, the dynamics of the internal states, it's like, wow, I'm bored in this room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.537,
    "end": 2462.457,
    "text": "I wish I were at the lake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.978,
    "end": 2464.158,
    "text": "Now I'm experiencing the lake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.899,
    "end": 2471.824,
    "text": "And so you can still have that awareness and the representation of the lake, but that's actually not happening through the sense thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.364,
    "end": 2476.725,
    "text": " So again, just there, we're always experiencing the internal generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.886,
    "end": 2479.426,
    "text": "So experiences are not here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.726,
    "end": 2480.866,
    "text": "Experiences are out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.306,
    "end": 2483.727,
    "text": "This is purely about actual sense data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.447,
    "end": 2493.49,
    "text": "And then in the exact same way, action is actually referring to what is physically embodied by the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.23,
    "end": 2503.617,
    "text": " And so if the organism is planning which strategy it's going to use, policy planning, and it's like, OK, I'm going to wait 10 seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.737,
    "end": 2507.8,
    "text": "And then as soon as he goes left, I'm going to go right and I'm going to run past him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.56,
    "end": 2511.943,
    "text": "That's all part of the general model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.583,
    "end": 2514.304,
    "text": " It's part of the internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.924,
    "end": 2519.565,
    "text": "And not until the organism actually acts is the action real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.025,
    "end": 2525.607,
    "text": "So mental experiences and mental processes are all happening on the green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.527,
    "end": 2531.149,
    "text": "And the red is literally smell, taste, sound, vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.649,
    "end": 2534.19,
    "text": "And the blue is quite literally motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.99,
    "end": 2536.15,
    "text": "Does that categorize it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.21,
    "end": 2537.051,
    "text": "Or what do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.451,
    "end": 2539.431,
    "text": "Yeah, cool inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.332,
    "end": 2541.732,
    "text": "For me right now, it's more clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.588,
    "end": 2545.756,
    "text": " Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.776,
    "end": 2549.306,
    "text": "So let's go to section three, narratives as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.465,
    "end": 2559.829,
    "text": " let's, we can kind of get to the real crux, which is what does it mean to take an active inference perspective on narratives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.509,
    "end": 2572.715,
    "text": "And so one part that I thought that was pretty nice point was that the second sentence of section three, they say, we suggest that the capacity to build and share narratives evolved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.175,
    "end": 2584.284,
    "text": " So key, it evolved largely because it provides group members with the ability to engage in cooperative action by avoiding unexpected states of uncoordinated or contextually inappropriate action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.005,
    "end": 2588.187,
    "text": "E.g., this is how we do things here, not in other ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.828,
    "end": 2595.854,
    "text": "And so you reduce uncertainty for other people in a cultural context when you drive on the correct side of the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.514,
    "end": 2605.264,
    "text": " it would lead to a lot of uncertainty if every single time people had to come to a sort of just in time decision about which side of the road to drive on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.745,
    "end": 2611.091,
    "text": "And so norms, whether they're implicit or explicit, norms are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.972,
    "end": 2640.391,
    "text": " really interesting to think about in the uh sense of reducing uncertainty and so you can reduce uncertainty about somebody's um behavior in various ways and they suggest that this leads to an account of the conservative aspects of cultural practice uh or the traditional components really just the idea that anything is preserved is conserved or held as traditional from the past and that ensures that human agents that are in culture that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.091,
    "end": 2644.394,
    "text": " are able to reduce their uncertainty when working with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.315,
    "end": 2646.996,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.076,
    "end": 2652.681,
    "text": "Or how does that seem to you too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.781,
    "end": 2665.231,
    "text": "For me, it's interesting to address from ideas of niche construction and really from functional side, it's how you describe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.411,
    "end": 2667.173,
    "text": "It's reducing uncertainty and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.525,
    "end": 2680.523,
    "text": " provide ways to be more effective in communication and other kind of stuff doing in collective way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.513,
    "end": 2685.775,
    "text": " Yeah, so that's one on page 19.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.995,
    "end": 2699.224,
    "text": "That's just one nice idea about how this reducing uncertainty perspective of free energy principle, rather than maximize reward, it contextualizes a lot of traditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.584,
    "end": 2712.834,
    "text": "So for example, it's hard to understand how some cultural traditions or cultural norms are simply about maximizing reward because it's like reward for whom or how is it calculated or how is it implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.414,
    "end": 2727.287,
    "text": " But rather, when we switch out the thing that has to be done by culture as not just maximizing success or reward, but actually just maximizing the precision of the action, it makes a lot more sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.967,
    "end": 2736.452,
    "text": " So then at the end of page 19, this is a second area where narratives and active inference are going to intersect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.832,
    "end": 2745.397,
    "text": "They write, coherent self narratives provide individuals with a mean to maintain a stable course of action pertaining to own particular goals and experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.857,
    "end": 2747.939,
    "text": " which limits the occurrence of unexpected states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.46,
    "end": 2756.988,
    "text": "And so that first account of cultural uncertainty reduction is something that's happening at the level of like a population or a group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.689,
    "end": 2761.292,
    "text": "And this second sense of narrative is more like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.293,
    "end": 2766.695,
    "text": " something that somebody tells themselves as a means to maintain a stable course of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.035,
    "end": 2776.16,
    "text": "So for example, I'm going to go ride my bike to get some batteries because my flashlight doesn't have any batteries and I'm riding to the store and then I get a flat tire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.36,
    "end": 2778.361,
    "text": "So now I need to walk my bike to the bike store.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.761,
    "end": 2783.664,
    "text": "But after I go to the bike store, then I'll be able to get those batteries so I can go to the flashlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.364,
    "end": 2797.959,
    "text": " It's like it makes sense because that story about I, that story about what has to get done, it's very flexible, but it also prevents the occurrence of unexpected states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.339,
    "end": 2801.563,
    "text": "And when unexpected states do occur, like getting a flat tire,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.083,
    "end": 2809.486,
    "text": " it can be incorporated into my narrative about my day instead of causing me to freeze or halt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.826,
    "end": 2814.688,
    "text": "Like a computer, if there's an unexpected exception, might just freeze or crash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.288,
    "end": 2818.969,
    "text": "But informational foragers, real evolutionary creatures can't do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.45,
    "end": 2824.812,
    "text": "So that's one other very, very personal way that narrative matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.472,
    "end": 2831.054,
    "text": "And then just on page 20, furthermore, narratives are potential generators of innovation and change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.011,
    "end": 2842.637,
    "text": " And this is sort of combining those previous two, the collective narrative precision increasing components, and then the individual precision increasing components of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.177,
    "end": 2858.286,
    "text": "And then this is sort of bringing them together and saying that by doing active inference like search of imagining, of exploring, imagining new possibilities in response to or anticipation of adaptation can reduce your uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.806,
    "end": 2876.591,
    "text": " And so, for example, if we say we're going to reduce our uncertainty about the future of the climate by doing this and that kind of modeling, and even though this or that weather pattern hasn't actually occurred, we should build a new wall here and we should prepare this field for growing this crop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.051,
    "end": 2880.172,
    "text": "So that's the way in which using predictive action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.912,
    "end": 2905.628,
    "text": " um or acting in anticipation of environmental changes can reduce your uncertainty and that's a story that you're telling about the future it's a narrative um any other thoughts there um i want to say is for self narratives that uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.781,
    "end": 2928.68,
    "text": " Actually people spend most of their time living in their self narratives and as for really feeling themselves good they always creating some kind of unreal stories and really going sometimes going in a wrong way mentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.155,
    "end": 2933.516,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.136,
    "end": 2944.66,
    "text": "One of the tenets about what leads to an organism surviving is the organism has to have an optimistic future model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.42,
    "end": 2950.022,
    "text": "The organism has to have a worldview where it sees itself existing in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.302,
    "end": 2952.423,
    "text": "I mean, why sleep if there's no tomorrow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.463,
    "end": 2954.023,
    "text": "Or why eat if there's no tomorrow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.063,
    "end": 2955.364,
    "text": "Or all these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.184,
    "end": 2966.887,
    "text": " And we see that kind of survival reflex playing out when somebody is being held underwater, their body will struggle because it's not part of the expected sensory inputs to be drowning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.567,
    "end": 2973.429,
    "text": "So on one hand, we see this fundamental struggle for life, which is deeply optimistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.809,
    "end": 2979.331,
    "text": "But then at the same time, that goes awry when people sort of end up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.191,
    "end": 2985.678,
    "text": " licensing themselves to be the judge, jury, and executioner, so to speak, of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.258,
    "end": 2995.729,
    "text": "And then they're the star in their movie, and they're walking around the world, and everything is only mattering to the extent it makes sense to them or it benefits them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.27,
    "end": 2999.333,
    "text": "So having this personal level narrative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.507,
    "end": 3003.248,
    "text": " is sometimes at odds with the collective narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.868,
    "end": 3005.909,
    "text": "That's really a huge area of tension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.45,
    "end": 3012.492,
    "text": "And that makes me think a lot about this multilevel Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.972,
    "end": 3013.552,
    "text": "Here's us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.213,
    "end": 3016.274,
    "text": "Here's one person, let's just say, on the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.674,
    "end": 3020.035,
    "text": "Here's stories coming in, narratives coming in, memes coming out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.235,
    "end": 3021.996,
    "text": "So information in, information out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.056,
    "end": 3026.558,
    "text": "And the hidden model is someone's political beliefs or their beliefs about Lord of the Rings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.358,
    "end": 3032.683,
    "text": " And then that person is actually taking part in larger systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.763,
    "end": 3037.507,
    "text": "And so here's the whole country or the whole group chat or the whole team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.347,
    "end": 3042.01,
    "text": "And then that team also gets inputs and gives outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.12,
    "end": 3050.442,
    "text": " And so that's coming back to your original question about what are Markov blankets in the context of narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.182,
    "end": 3056.343,
    "text": "And one element is Markov blankets are defined by what comes in and what comes out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.263,
    "end": 3059.223,
    "text": "And that's informational in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.724,
    "end": 3070.566,
    "text": "And another answer or another aspect of the answer is because these Markov blankets are also defined by their internal mechanics, or at least their internal dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.286,
    "end": 3079.391,
    "text": " So dynamics would be referring to the patterns that are just simply observable, and the mechanics would be the actual rules that lead to those dynamics arising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.991,
    "end": 3081.472,
    "text": "We can think, what are those rules?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.092,
    "end": 3086.374,
    "text": "And one example about where the rules could be a little different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.795,
    "end": 3089.756,
    "text": "Let's just go back to that joke about three people in the bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.117,
    "end": 3095.44,
    "text": "We go, three aliens walk into a bar on a world where gravity is reversed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.34,
    "end": 3110.949,
    "text": " So it's like I've put this extra rule into the narrative, and now other stuff is going to happen in the narrative that locally is going to make sense because I've also specified this other mechanism that's going to be relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.31,
    "end": 3115.472,
    "text": "But without specifying that mechanism, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.582,
    "end": 3120.544,
    "text": " It's assumed that the rules of gravity are regular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.164,
    "end": 3127.947,
    "text": "And actually, another funny thing, and there's been some work on this, is with humor and optimal surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.528,
    "end": 3136.011,
    "text": "Like simply to be insulting is not funny, as well as to say what everyone else says is also usually not funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.611,
    "end": 3145.316,
    "text": "But it's on that edge of chaos where comedy and uncertainty and some are laughing, some are crying, some people are trying to stop themselves from laughing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.996,
    "end": 3148.097,
    "text": " All these things happen due to surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.637,
    "end": 3166.781,
    "text": "And so to think about this joke, and again, not to get too over-analyzing of jokes, but when the joke ends with a twist, and it was something that wasn't necessarily specified at the beginning, but there's a double entendre, there's a pun, these things are all humorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.361,
    "end": 3172.082,
    "text": "And what's humorous about them is they deliver that optimal level of novelty or surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.5,
    "end": 3184.403,
    "text": " Let's go to section 3.1, cognitive schema and active inference on page 20.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.183,
    "end": 3189.825,
    "text": "And so this is gonna be drilling down a little bit into the cognitive schema.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.965,
    "end": 3192.346,
    "text": "So this is internal to someone's brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.706,
    "end": 3203.63,
    "text": "These are the cognitive patterns that one person has on board that are related to narratives that has to do with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.19,
    "end": 3231.372,
    "text": " and so they basically write about how having specific narratives of events like i was going to the store and then this happened and then this happened or i went to college and then this happened those events organize your life they or they give meaning to what you have to do when you have to wake up and not just like a you know theological meaning like literally it just gives sense to your day it tells you which direction to head out of the house",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.133,
    "end": 3238.497,
    "text": " And then secondly, there's this meaningfulness that arises from general events and collective narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.818,
    "end": 3254.887,
    "text": "And they basically say that what we can do, and also I'll just point out that those two levels of analysis, the cognitive and the collective, those are referring back to when they said that the issue with the field is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.277,
    "end": 3260.099,
    "text": " The literature on narrative focuses on either one or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.52,
    "end": 3270.726,
    "text": "So psychologists will focus on the internal cognitive schema of narrative, and anthropologists will focus, or the cultural researcher will focus on the collective narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.767,
    "end": 3274.909,
    "text": "And they're going to try to use active inference to bridge that gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.689,
    "end": 3291.675,
    "text": " And so basically, they say on the quote that goes from 20 to 21, what explains these associations, why these individual and collective narrative roles are adaptive in an evolutionary sense is basically because they facilitate the process of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.135,
    "end": 3300.778,
    "text": "And page 21, that is the capacity of narratives to represent the specificity of events and to represent multiple events in a meaningful and coherent way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.418,
    "end": 3307.542,
    "text": " helps individuals to more accurately predict future events and therefore respond to changing circumstances in their lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.303,
    "end": 3309.484,
    "text": "So that's pretty key.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.644,
    "end": 3311.005,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.012,
    "end": 3330.898,
    "text": "As it's stated about active inference that here in paper that it's first of all about adaptive behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.447,
    "end": 3359.415,
    "text": " and for sure this part is about how it's work in real life for example and people are really act like with obviously in some stories and describe for them for themselves future future possible events and in terms for example engineering again you first need to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.365,
    "end": 3366.927,
    "text": " create a description of future system and how it will work in future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.348,
    "end": 3370.128,
    "text": "So this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.828,
    "end": 3372.489,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.389,
    "end": 3388.774,
    "text": "And just at the end of that section on the bottom of 21, where they say, in short, having a narrative or a repertoire of narratives furnishes inference with a simple and efficient way to account for sensory evidence at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.594,
    "end": 3397.901,
    "text": " And what that allows organisms to do is to then provide hypotheses that enable inference to the best prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.461,
    "end": 3401.444,
    "text": "So you're telling the story, and it's like, OK, so there I was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.464,
    "end": 3404.927,
    "text": "I had the flashlight and the batteries, and my bike was working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.547,
    "end": 3408.35,
    "text": " And then you can actually make hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.45,
    "end": 3414.676,
    "text": "Even if you knew very little about the person, you could then say, well, what do you think would happen if they found out that the batteries were dead?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.197,
    "end": 3419.361,
    "text": "Oh, they might go back to the store because, remember, they needed the batteries for the flashlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.881,
    "end": 3422.203,
    "text": "Or what would happen if this other thing happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.444,
    "end": 3426.307,
    "text": "So the narrative allows temporally related events",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.108,
    "end": 3429.749,
    "text": " to become meaningful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.389,
    "end": 3445.475,
    "text": "And in the context of artificial intelligence and in big data, this is so important because the data overload means that let's just say that you had somebody who they had agreed, consented to provide you all their data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.795,
    "end": 3454.158,
    "text": "So in the whole day, you have their full movement patterns, all their smartphone and every web search and all their transactions, all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.798,
    "end": 3463.789,
    "text": " you still might never be able to reduce it to so simple a story in just a few sentences as, I had to get batteries for my flashlight, but then my bike tire got a flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.577,
    "end": 3475.539,
    "text": " That is really, really hard to extract from just the GPS data and the transaction data because it's intermingled with so many other different components happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.18,
    "end": 3481.481,
    "text": "And so narratives are how we relate that sequence of events to ourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.121,
    "end": 3483.801,
    "text": "It's how we relate it to other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.341,
    "end": 3491.103,
    "text": "And then the challenge is to generate computational systems that can interact at that level of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.413,
    "end": 3499.395,
    "text": " Like, OK, Google, I want to get a haircut within three miles of where I am, or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.875,
    "end": 3501.135,
    "text": "That's what we don't have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.315,
    "end": 3518.88,
    "text": "And that's why the artificial intelligence community is so interested in these topics, because potentially an active inference-based artificial intelligence, both confusingly AI, could have a more effective role in some of these questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.935,
    "end": 3524.437,
    "text": " So let's go to 311, Narrative Identity and Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.357,
    "end": 3532.34,
    "text": "In this section, they're going to go a little bit more into that first person narration component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.314,
    "end": 3542.039,
    "text": " And on 22, they write, coherent narratives linked together aspects of our experience in ways that decrease contradictions amongst choices, values, and goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.679,
    "end": 3553.265,
    "text": "And so the contextualization of narrative is like, well, it was really important to me to spend time with my family, but then for work, I had to go away for two days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.986,
    "end": 3557.548,
    "text": "And so that narrative is what allows that person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.174,
    "end": 3566.757,
    "text": " to have two things that are otherwise contradictory, which is, well, if family is important and work is important, then what are you going to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.337,
    "end": 3571.279,
    "text": "But the way that that's narrated, it ends up not being that big of a deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.839,
    "end": 3585.924,
    "text": "And so it isn't that big of a deal because, as they point out, coherent narratives can reduce the dissonance amongst the complex and overarching expectations we have about our lives, especially with relationship to future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.202,
    "end": 3593.305,
    "text": " So that's kind of, I think, one very interesting topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.266,
    "end": 3595.066,
    "text": "Anything there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.266,
    "end": 3596.967,
    "text": "Or Ivan, any questions or thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.33,
    "end": 3616.318,
    "text": "And again, I want to put about personal and functionally coherent narratives that people in their lives usually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.119,
    "end": 3617.939,
    "text": " not action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.479,
    "end": 3624.801,
    "text": "We are trying to create new narratives why we don't do any action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.121,
    "end": 3631.402,
    "text": "And when we speak about action, it's about learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.122,
    "end": 3634.943,
    "text": "And learning, it's about updating your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.043,
    "end": 3645.625,
    "text": "And it looks like it's quite difficult for people stop to create new narratives",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.821,
    "end": 3656.531,
    "text": " just not going to do some actions yep very very true um two quotes that that really makes me think about on 22",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.181,
    "end": 3678.277,
    "text": " uh about two-thirds the way down says self and identity narratives are framed against a background of cultural norms and values so they also can reference alternative narratives that provide explanations for non-normative unusual inconsistent or untoward events in the individual's life trajectory so that'd be something like you know when i was growing up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.937,
    "end": 3684.259,
    "text": " Everybody was drafted into the army, but then because of this situation, I didn't have to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.859,
    "end": 3693.223,
    "text": "That explains why the individual was doing something, explains why they had the sensory experience of being at home for a specific interval of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.843,
    "end": 3700.808,
    "text": " but it also juxtaposes it against a collective, potentially normative idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.848,
    "end": 3706.691,
    "text": "This has a lot to do with humans seeking to differentiate themselves from each other is one tendency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.272,
    "end": 3713.536,
    "text": "We want to be unique in some ways, but also there's other areas where we want to fit in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.236,
    "end": 3718.883,
    "text": " And so there might be cultures where it's valued more to be fitting in or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.283,
    "end": 3723.389,
    "text": "There might be different dimensions where we fit in, different dimensions where we don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.469,
    "end": 3726.052,
    "text": "That's kind of like the idea of intersectionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.857,
    "end": 3736.386,
    "text": " And then on the page 23, where they're talking about meaning-making and sense-making, and I totally agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.446,
    "end": 3745.115,
    "text": "What you're talking about with most people being in a non-active state, the sensations coming in, the, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.595,
    "end": 3748.517,
    "text": " media coming in or the internet coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.397,
    "end": 3752.84,
    "text": "It's just updating their internal states, updating, updating, updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.26,
    "end": 3757.483,
    "text": "But it doesn't seem to be reflected that heavily in action sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.943,
    "end": 3765.708,
    "text": "And then they write on the middle of 23, the meaning making process is an adaptive response to the occurrence of unexpected circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.148,
    "end": 3773.433,
    "text": "When expectations are broken, an imaginative reorganization of our representations of ourselves and our environment is needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.853,
    "end": 3790.899,
    "text": " But unfortunately, if somebody sometimes gets a statistic or a fact that is not consistent with their worldview, then that's where we see logical fallacies like, oh, ad hominem, or that person's just trolling, or they're just trying to frustrate me or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.219,
    "end": 3798.882,
    "text": "Because it's always possible to include into your worldview just the idea that that one fact is wrong or irrelevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.602,
    "end": 3807.306,
    "text": " rather than actually move into this totally new worldview because shifting the deeper attendance of your worldview is anxiety producing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.127,
    "end": 3815.971,
    "text": "And so then also just to what you said about niche, they talk about how before a new sense of familiarity and coherence, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.011,
    "end": 3826.918,
    "text": "a new niche, that's a narrative niche, can be reinstated, exploration of new meaning, epistemic foraging, must occur in order to generate, test, and discover new adaptive inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.206,
    "end": 3830.628,
    "text": " So that's kind of a cool idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.63,
    "end": 3836.494,
    "text": "Let's go to 3.12, Event Narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.175,
    "end": 3848.166,
    "text": "So this section 3.12, which is a good length, we can kind of just skip to the summary on 27 of this section where it says,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.542,
    "end": 3857.232,
    "text": " Event narratives are ideally suited for active inference because of their ability to represent past and future events respectively in segmented event sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.833,
    "end": 3866.304,
    "text": "And that provides a pool of uniquely structured information that helps predict future events and structures these inference in the form of cohesive future events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.285,
    "end": 3888.871,
    "text": " So it seems like a very basic point to build the paper towards, which is that narratives help us recognize where we are, recognize who we are personally and culturally, recognize where we've been, and then make predictions about the future that hopefully will help us reduce uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.591,
    "end": 3894.173,
    "text": "These points are not major, but I would argue that it's actually quite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.586,
    "end": 3913.725,
    "text": " encouraging and powerful, that these sorts of claims, which usually would be the qualitative endpoint of some sort of psychological or cultural analysis of narrative, rather, those are the starting points for us having a quantitative analysis potentially to analyze narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.754,
    "end": 3919.716,
    "text": " But this section we've been kind of discussing throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.357,
    "end": 3927.66,
    "text": "So section 3.13, integrating the functions of cognitive schema narratives as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.24,
    "end": 3933.023,
    "text": "So that's one of the final sections before they turn to storytelling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.978,
    "end": 3942.48,
    "text": " That just is about what it says it's going to be about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.56,
    "end": 3944.0,
    "text": "Any thoughts on that one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.06,
    "end": 3946.201,
    "text": "That's kind of related to what we've been discussing as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.642,
    "end": 3959.425,
    "text": "Where they say on 27, on the bottom, future projections and episodic memory can be understood as mental action or policy selection and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.165,
    "end": 3962.226,
    "text": "So that kind of relates to the idea of mental action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.427,
    "end": 3964.567,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.923,
    "end": 3980.651,
    "text": " Yep, and then just to kind of finish out the body of the paper before we return to a few more images and close out the section three two, storytelling regimes of attention and deontic cues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.672,
    "end": 3996.061,
    "text": "So regimes of attention are this idea that you're paying attention to something, you know, when the child is in school and they're being trained to pay attention to different sorts of cues and what symbols mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.841,
    "end": 4008.647,
    "text": " This idea that attention and that attention as shaped by active inference, as on 29, where there's a few citations to Constant et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.667,
    "end": 4011.629,
    "text": "2019 and Constant et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.649,
    "end": 4015.011,
    "text": "2018, that narratives direct what is salient to human agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.051,
    "end": 4043.931,
    "text": " um so it'd be like you know three people walk into a bar and one of them has three legs it's like one of those statements is surprising the one about three people walking into a bar is not but the one about somebody having a different number of body parts is and so narratives allow us to very very easily draw on the tremendous amount of information that we have in our generative model of the world and then use that to discover anomalies in our observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.731,
    "end": 4053.571,
    "text": " And deontic is a word that means duty, so related to what somebody must or should do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.51,
    "end": 4061.976,
    "text": " And so we can think about narratives for ourself and collective narratives as being deontic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.356,
    "end": 4077.569,
    "text": "So when JFK said, ask not what your country can do for you, but what you can do for your country, it's almost like instead of thinking about the United States of Markov blanket and how that is going to provide something for you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.681,
    "end": 4089.604,
    "text": " As well, you might want to think about you as a Markov blanket and how you as a personal narrative active inference machine might also be playing a role in this larger system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.744,
    "end": 4092.424,
    "text": "Maybe he was thinking about free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.524,
    "end": 4093.224,
    "text": "Maybe he wasn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.304,
    "end": 4093.864,
    "text": "Hard to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.565,
    "end": 4100.066,
    "text": "And then they kind of close the loop in that paragraph in the middle of 30 where they write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.607,
    "end": 4112.332,
    "text": " Deontic cues guide the sensory motor patterns through which agents engage adaptively their niches, action, thereby guiding the ways in which agents update their recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.632,
    "end": 4115.654,
    "text": "So for example, when my alarm clock goes off and I go,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.394,
    "end": 4137.127,
    "text": " OK, I have 30 minutes to take a shower, get dressed, bike to school because I have to be sitting in this lecture hall so that I can receive the sensory input of the lecturer so that I'll be able to update my model about organic chemistry so that when there's a final, I'm able to reduce my uncertainty about what the answer is so that I'm able to get this grade that I want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.767,
    "end": 4144.051,
    "text": "And so the deontic cue is like the post note that might be on my alarm clock that says, get up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.111,
    "end": 4145.632,
    "text": "You have to go to organic chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.212,
    "end": 4149.133,
    "text": " But that ends up guiding the sensory motor patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.953,
    "end": 4154.214,
    "text": "And ideally, that is an adaptive engagement through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.814,
    "end": 4157.755,
    "text": "And then that leads to differences in perception and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.135,
    "end": 4162.316,
    "text": "And then this relates to a lot of other work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.396,
    "end": 4165.257,
    "text": "I think it might be the Vessier et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.777,
    "end": 4170.778,
    "text": "2020 citation on page 31, which is the idea of thinking through other minds, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.518,
    "end": 4177.868,
    "text": " is a more recent development in the free energy slash active inference cultural perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.588,
    "end": 4181.289,
    "text": " So let's go just to their conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.15,
    "end": 4184.932,
    "text": "The authors are going to summarize what they've been discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.512,
    "end": 4195.179,
    "text": "They write, we have proposed an integrative model of the diverse functions of narrative as tools for active inference in ways that clarify their cognitive and social uses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.419,
    "end": 4201.543,
    "text": "So again, the big point of the paper was that there's this cognitive internal level and this social external level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.164,
    "end": 4204.926,
    "text": "And literature tends to focus on one or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.726,
    "end": 4208.668,
    "text": " They brought the big guns out, active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.048,
    "end": 4213.671,
    "text": "And so they're going to integrate cognitive and social under the umbrella of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.792,
    "end": 4216.633,
    "text": "So that's going to give internal coherence to the study of narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.434,
    "end": 4225.54,
    "text": "And it's also going to give external coherence because now we can study narrative alongside other informational and thermodynamic processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.32,
    "end": 4230.341,
    "text": " Then they, in the following sentences, recall a bunch of the specifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.722,
    "end": 4253.35,
    "text": "They talk about how narratives are useful for segmenting events, for building an information pool, for making future projections, for meaning making and sense making, for belief updating, for assimilating unexpected information, for maintaining cohesive integrity of our complex network of expectations so as to minimize internal contradictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.21,
    "end": 4258.812,
    "text": " as well as providing expectations to culturally common situations and typical life trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.533,
    "end": 4270.098,
    "text": "And then they close by discussing that idea of the deontic narrative and the narratives that are about how the world could or should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.678,
    "end": 4276.701,
    "text": "And then that situates our role in the world and that actually shapes our sensory motor action patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.721,
    "end": 4299.277,
    "text": " and that their last sentence is just that the importance and ubiquity of narratives in the various domains of adaptation and sociality, it should be explained not by appeal to entertainment or simply information exchange or communication only, but rather by phrasing this all within the context of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.657,
    "end": 4304.581,
    "text": "We get a very, very powerful framework to get internal and external coherence for narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.735,
    "end": 4312.679,
    "text": " And then just sort of in closing, I thought I would go to a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.14,
    "end": 4321.424,
    "text": " Paper from March 31, 2020, Active Inference on Discrete State Spaces, a Synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.345,
    "end": 4329.15,
    "text": "And just a little bit looking at how active inference, what could be the next steps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.25,
    "end": 4335.914,
    "text": "And this is something that the three of us have talked about quite a lot, which is this paper is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.575,
    "end": 4339.357,
    "text": "It's also a qualitative perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.037,
    "end": 4344.2,
    "text": " that doesn't dig into all the details that we wanted to see resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.8,
    "end": 4347.221,
    "text": "That's why research is on the edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.002,
    "end": 4352.505,
    "text": "And so these are just a few of the ways in which active inference has been specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.845,
    "end": 4357.608,
    "text": "And so we might begin to think about how narrative could play into some of this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.388,
    "end": 4364.454,
    "text": " So here we see that familiar diagram with the brain internal states, action states, external sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.174,
    "end": 4371.961,
    "text": "And then there's basically two things that are happening, two optimization processes that are happening at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.541,
    "end": 4378.867,
    "text": "Perception is the brain making sense of sensory data and action is the brain selecting policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.828,
    "end": 4386.712,
    "text": " And what happens is the way that free energy is minimized, given the sensory data, two things can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.212,
    "end": 4396.557,
    "text": "You can either make sense of the sensory data by changing your worldview, or you can change your sensory data by engaging in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.418,
    "end": 4405.382,
    "text": "And so it turns out that by different transformations of these mathematical relationships that are specified exhaustively in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.653,
    "end": 4408.333,
    "text": " we pull out a few key terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.393,
    "end": 4409.274,
    "text": "So here's value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.794,
    "end": 4412.335,
    "text": "This is the discounted or the expected utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.915,
    "end": 4432.36,
    "text": "It turns out that the value, expected value of an action or expected value of a stimulus relating to questions about optimal control and cybernetics as well, these questions about value actually arise purely from thinking about uncertainty through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.3,
    "end": 4436.942,
    "text": " Uncertainty through time is also related to surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.982,
    "end": 4454.051,
    "text": "This is why on both of these we see this log P be given M and this negative F and F. And then also we're able to introduce the topics of entropy, self-organization, synergetics, homeostasis, and of course model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.092,
    "end": 4459.975,
    "text": "This is the key term PBM that's represented in all of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.502,
    "end": 4463.943,
    "text": " So those are a few interesting topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.703,
    "end": 4477.588,
    "text": "This is another visualization that talks about how active inference and Markov blankets have very specific other downstream mathematical relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.748,
    "end": 4481.59,
    "text": "Again, not too much to discuss at this point, but these are just to put up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.728,
    "end": 4484.91,
    "text": " And then this is the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.63,
    "end": 4491.294,
    "text": "And here are the different variables in their brain represented visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.875,
    "end": 4503.103,
    "text": "So here are, for example, the generative model and how things are being influenced and how motor cortex is ending up, select policy, moving to the motor cortex, moving out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.212,
    "end": 4512.735,
    "text": " And then maybe we can just close on this slide, which Alex, I think you put in where we have two agents or more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.635,
    "end": 4517.196,
    "text": "And here for agent one, here's their regime of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.256,
    "end": 4521.057,
    "text": "This is their internal model, what they're paying attention to, what is salient for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.757,
    "end": 4523.498,
    "text": "And this is related to who they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.518,
    "end": 4527.719,
    "text": "If they don't speak the language, they can pay attention to the sounds, but they can't pay attention to the meanings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.183,
    "end": 4532.285,
    "text": " If they don't know the area, they can pay attention to the words, but not really the connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.246,
    "end": 4536.988,
    "text": "Agent one engages in action, and that kind of dumps into the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.368,
    "end": 4540.79,
    "text": "And the world is full of epistemic resources, cues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.81,
    "end": 4542.151,
    "text": "This is just what is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.872,
    "end": 4546.474,
    "text": "And then the world ends up dealing out sensations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.174,
    "end": 4549.535,
    "text": " to both of these agents, and then it feeds back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.035,
    "end": 4553.417,
    "text": "And so it's kind of like the conversation would be, okay, this person is listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.597,
    "end": 4554.097,
    "text": "They speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.517,
    "end": 4557.939,
    "text": "It dumps it into the text room or the Jitsi video chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.579,
    "end": 4562.38,
    "text": "That's sensed by Agent N. Agent N pays attention, acts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.78,
    "end": 4564.081,
    "text": "That goes back into the chat room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.521,
    "end": 4569.263,
    "text": "And so there's like this infinity here, and that's thinking through other minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.863,
    "end": 4571.564,
    "text": "That's how narratives are shared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.644,
    "end": 4575.566,
    "text": "This is really where we want to go is thinking at a really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.386,
    "end": 4579.367,
    "text": " formal level as well as an applied level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.967,
    "end": 4584.729,
    "text": "How can we bring this kind of clarity to action, sensation and collaboration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.229,
    "end": 4589.331,
    "text": "How can we bring that to the systems perspective, the complexity perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.112,
    "end": 4594.192,
    "text": "Yep, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.972,
    "end": 4602.115,
    "text": "And I want to add that here we see a green zone about epistemic resources and silence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.047,
    "end": 4632.283,
    "text": " and as we see from this paper narratives are really one of fundamental part of human well-being and developments and culture social and so on so and if so much functions in it we need to see closer to things like about epistemic side of this narrative and silent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4632.918,
    "end": 4647.289,
    "text": " silence part of these narratives and trying to find ways to have some kind of evaluation and qualification for such sources or narratives as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.211,
    "end": 4651.352,
    "text": " Agreed, agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.672,
    "end": 4657.375,
    "text": "And again, with this idea of there's the internal coherence and then the external coherence, we can return to that joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.835,
    "end": 4663.598,
    "text": "It's like in the context of the joke, you can make a Markov blanket for the joke, where three people walk into a bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.758,
    "end": 4666.52,
    "text": "That's literally the three people walking into a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4667.18,
    "end": 4667.96,
    "text": " How about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.02,
    "end": 4670.881,
    "text": "Three people walk into a Markov blanket, they get lost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.221,
    "end": 4683.764,
    "text": "But then, zooming out, there's also the cultural context that the joke occurs within, the kind of context that makes three people walk into a bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.425,
    "end": 4685.345,
    "text": "Now, that's common.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.545,
    "end": 4692.767,
    "text": "It's an American or it's an English joke format, you know, this many people walk into a bar or knock, knock, who's there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4693.507,
    "end": 4696.368,
    "text": " Now, that might be a culturally specific thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.848,
    "end": 4703.831,
    "text": "And so that joke is going to be more or less expected, more or less funny to somebody who's in that cultural context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.251,
    "end": 4711.854,
    "text": "And so the epistemic resources and the salience have to deal with the stimulus in question, like the joke itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4712.435,
    "end": 4722.679,
    "text": "But also, it has to be taken into account that because we're talking about agents that are paying attention, the culture of the agent is going to dictate what they find salient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.399,
    "end": 4733.403,
    "text": " There might be things that are in the world that are not salient because the individual doesn't have the narrative that allows them to retain that salience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4735.824,
    "end": 4737.985,
    "text": "Any closing thoughts, especially Yvonne?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4741.392,
    "end": 4753.001,
    "text": " I just remembered one Russian joke that's covered in English with people walking in the bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4753.101,
    "end": 4756.003,
    "text": "It's the bill goes in the forest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.704,
    "end": 4764.129,
    "text": "It starts with the bill goes in the forest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4764.55,
    "end": 4768.793,
    "text": "It has a lot of different ends in this story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4770.211,
    "end": 4770.732,
    "text": " Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.332,
    "end": 4780.542,
    "text": "And some of these cultural stubs, like these starters for jokes, it allows the format for anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4780.662,
    "end": 4782.724,
    "text": "It's kind of like a HTTP packet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4783.264,
    "end": 4786.167,
    "text": "You have the header that just says, I'm an internet packet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.668,
    "end": 4791.873,
    "text": "That's like saying, when you say a bear walks into a forest, it's like, I'm telling you a joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.654,
    "end": 4795.196,
    "text": " But you can't just say, I'm going to tell you a joke right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.697,
    "end": 4800.841,
    "text": "And so these are signals that are extremely rich with information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.762,
    "end": 4809.769,
    "text": "And just having a text-based natural language processing AI will totally miss out on that cultural context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.209,
    "end": 4812.391,
    "text": "And then let's say you told a variant of the joke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.451,
    "end": 4816.074,
    "text": "An ant walks into the forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.122,
    "end": 4821.806,
    "text": " It's not a non sequitur, but it's not really referencing a real ant walking into a forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.266,
    "end": 4833.735,
    "text": "And these are these overlapping levels of cultural jokes and meaning that are really pointing the way to how rich the study could be with active influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.698,
    "end": 4841.661,
    "text": "So how do you think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4843.779,
    "end": 4869.478,
    "text": " what the first thing that is people don't have people of different culture don't have to do not missing the point of communication how can what do they can what can they do first to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.33,
    "end": 4873.651,
    "text": " reduce miscommunication?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.512,
    "end": 4895.525,
    "text": "Yeah good question and especially in a digital and international context it's so important that there's reduction of uncertainty so I mean just really quickly a few things would be just at every possible opportunity where there's any question about uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.269,
    "end": 4899.913,
    "text": " I feel like always getting the consent from both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.033,
    "end": 4902.375,
    "text": "OK, we were just talking about this topic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.056,
    "end": 4907.361,
    "text": "And so just getting used to agreeing with each other and getting used to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.201,
    "end": 4919.908,
    "text": " altruistically or just politely exchanging information starts to train us to work well together, even when the situation is very tense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.308,
    "end": 4924.871,
    "text": "So that's one part is where we can be extremely accurate in communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4925.271,
    "end": 4926.612,
    "text": "We should be extremely accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.406,
    "end": 4938.471,
    "text": " And then on the technological side, I think it's important just to communicate simply instead of using things, oh, we'll just use video and use body language and make sure that you're really expressive with your hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.552,
    "end": 4953.219,
    "text": "Yeah, the tone of voice and the hand motions, even if they come across with no lag and the person is watching your screen, different cultures might unpack different hand motions or different facial expressions very differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.039,
    "end": 4969.103,
    "text": " And so I think that when there's differences in culture that lead to challenges in communication, it's critical to really just focus in on what you're actually trying to communicate and make sure that there's as little uncertainty as possible about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.703,
    "end": 4973.784,
    "text": "And then the cultural stuff, deal with it as it's needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.224,
    "end": 4980.206,
    "text": "And whenever it's needed to deal with it, absolutely it's important to deal with it because nothing can be more important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.766,
    "end": 4984.331,
    "text": " than helping the team become more effective, more precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.694,
    "end": 4998.17,
    "text": "I think in digital it's more simple to make clear enough communication between a team or two people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4998.815,
    "end": 5011.982,
    "text": " Because when we are talking in real life, we can't add some hashtag to describe what do we mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5022.748,
    "end": 5028.236,
    "text": " Yep, we can use rich multimodal features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.597,
    "end": 5034.305,
    "text": "So we could be having this chat, and someone could say, I'm sorry, could you spell out the city that you mentioned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.006,
    "end": 5036.709,
    "text": "And then they can type it in the text box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.311,
    "end": 5042.415,
    "text": " somebody can share their screen and draw something out, things that couldn't happen in person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.435,
    "end": 5043.616,
    "text": "I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.656,
    "end": 5045.137,
    "text": "These are all really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.658,
    "end": 5047.84,
    "text": "And that relates to epistemic resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.36,
    "end": 5056.568,
    "text": "So when the people who you're dealing with are all in the same discipline and all the same culture, maybe the epistemic resources are very professional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.229,
    "end": 5060.912,
    "text": "But when we're talking about broad spectrum communication,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.65,
    "end": 5073.094,
    "text": " Potentially the epistemic resources and the salience cues would be like using a color scheme that's accessible for everybody and using icons to demonstrate where the settings are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.234,
    "end": 5082.937,
    "text": "Like having a gear in the bottom right of Jitsi, the three dots, having a gear that says setting, that's really helpful because it's kind of like a universal icon for the settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5083.857,
    "end": 5089.12,
    "text": " And then otherwise it could be a situation where someone doesn't know English and they can't find the settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.24,
    "end": 5095.063,
    "text": "So then how are they going to be able to find the language option because they can't even find the settings section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.564,
    "end": 5100.707,
    "text": "But with the gear, it's a salience queue that goes beyond culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.587,
    "end": 5104.609,
    "text": "And so that is what helps people get along together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.089,
    "end": 5108.231,
    "text": "And again, going back to like, what are the actual applications of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.131,
    "end": 5126.074,
    "text": " If we could understand how individuals in different cultures are going to perceive different narratives and what role they see themselves playing in the narratives, it could really open the door to extremely interactive and authentic narratives by people that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.855,
    "end": 5145.66,
    "text": " don't have to be situated as being at odds with some sort of evil system and it's like they're the righteous crusader fighting against everyone else who's dumb or the system's corrupt and they're just you know doing what they can all these narratives that pit the individual versus the group or versus specific groups",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.724,
    "end": 5175.329,
    "text": " lead to adversarial game theory and so not not that there's never going to be competition in the world but potentially by having these protocols for interaction and for communication just like we have protocols for trade we could have protocols for information that are also healthy yeah cool and as for protocols and you said before about signals and i think we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.996,
    "end": 5182.04,
    "text": " If you speak about culture, it's really mostly shared by narratives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.62,
    "end": 5203.813,
    "text": "And if we consider culture not like a global phenomenon, but a local, so each team could have their own culture, and they define it by narratives, and it creates a niche by that, supported by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.659,
    "end": 5223.663,
    "text": " tools and the tools really could support such protocols where some meta information added to communication and communication process is also structured according to some models from active inference as we see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5225.086,
    "end": 5226.107,
    "text": " Totally agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.127,
    "end": 5234.694,
    "text": "And I think on a closing note, this has been our first podcast livestream discussion for Team Calm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.825,
    "end": 5239.448,
    "text": " So it's a landmark event for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.149,
    "end": 5244.913,
    "text": "We're using Jitsi for live streaming to YouTube.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.213,
    "end": 5247.815,
    "text": "We used Google Slides for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.835,
    "end": 5254.701,
    "text": "The preprint server, SciArchive, and the internet in general are what allowed us to make these presentations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.863,
    "end": 5261.264,
    "text": " We can really just see this as happening as just another event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.344,
    "end": 5263.645,
    "text": "We're observing this live stream come to an end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.165,
    "end": 5272.647,
    "text": "It's part of our narrative of having met in service of these ideas and with a lot of the same interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.567,
    "end": 5279.128,
    "text": "And so, yeah, this was really a great discussion and I'm looking forward to continuing these discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5280.749,
    "end": 5282.129,
    "text": "Thank you very much for your leading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5282.887,
    "end": 5295.009,
    "text": " with discussion i think results are interesting and we will use it in future for sure all right i'm going to terminate the live stream now",
    "speaker": "SPEAKER_01"
  }
]