[
  {
    "start": 0.089,
    "end": 4.099,
    "text": " some questions that we had from the dot zero, but also new questions arising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.98,
    "end": 11.662,
    "text": " So we'll just start with an introduction and saying hello, and then it'll be awesome to hear the author's initial contextualization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.282,
    "end": 30.588,
    "text": "So I'm Daniel, I'm a researcher in California, and as explored a little bit in the dot zero with Sid, there's a few places that we were super curious about ranging from how does one go from a phenomena that they want to model like navigation to the analytical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.408,
    "end": 35.229,
    "text": " equations and how is that related to active inference and the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.269,
    "end": 43.973,
    "text": "And then how do we go from that analytical formulation to the actual gigabyte of video data and the real-time sensing and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.013,
    "end": 47.374,
    "text": "So a lot of exciting topics and I'll pass to Blip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.505,
    "end": 50.085,
    "text": " Hi, I'm blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.105,
    "end": 52.026,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.306,
    "end": 54.968,
    "text": "And this paper was kind of way over my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.748,
    "end": 56.529,
    "text": "For a lot of reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.589,
    "end": 58.55,
    "text": "It's just so far out of what I normally do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.45,
    "end": 75.318,
    "text": "But I have some questions related to the hierarchical modeling and how that is kind of used and how that can be related or cannot be related to maybe biological systems that model in a hierarchical way similarly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.239,
    "end": 84.386,
    "text": " And I'll pass it off to Adam, I guess, if you want to start or introduce yourself and you guys can take it away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.466,
    "end": 85.487,
    "text": "Hi, I'm Adam.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 86.007,
    "end": 96.095,
    "text": "I'm a systems neuroscientist who's currently a research fellow at the Johns Hopkins Center for Psychedelic and Consciousness Research.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 97.016,
    "end": 105.323,
    "text": "I've been collaborating with Tim and Ozen and others on trying to understand the natures of navigation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 108.471,
    "end": 119.499,
    "text": " and the ways in which the hippocampal and entorhinal system might be relevant, and the ways in which this could be used as a means of understanding thought more generally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 120.48,
    "end": 128.466,
    "text": "And it's been awesome and slightly intimidating, except Tim is awesome, so that's made it less intimidating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 133.325,
    "end": 134.246,
    "text": " So that brings it to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.706,
    "end": 135.826,
    "text": "I'm Tim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 136.047,
    "end": 139.769,
    "text": "I'm a computer scientist and roboticist at Ghent University.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.369,
    "end": 147.213,
    "text": "We haven't subscribed to the Active Infants formalism to try to make our robots slightly more intelligent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.914,
    "end": 152.355,
    "text": "This paper was, I think, one of our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.008,
    "end": 156.531,
    "text": " major accomplishments last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.771,
    "end": 173.108,
    "text": "It was a collaboration with Adam where we basically look at the problem of navigation from different angles ranging from active inference modeling to an actual implementation on a real robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.372,
    "end": 197.049,
    "text": " and at the same time looking at how could this work in in an actual brain or or whatever the relations uh and the synergy is there so it's really exciting uh to to have this paper out but also this was just as getting started i'd say it was it was basically our first um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.436,
    "end": 227.077,
    "text": " artifact that we published we have another one together with adam in the works and and yeah i'm pretty sure that we will continue this endeavor for for quite some time longer so we're all just only just getting started so uh that being said probably a lot of the questions are also still questions for us so we'll see uh to what extent we can give give an answer uh as of today already",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.147,
    "end": 229.448,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.708,
    "end": 235.742,
    "text": "Well, we can start with this sort of triad that is highlighted in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.279,
    "end": 240.481,
    "text": " And Adam, you said it as understanding the basis of navigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.761,
    "end": 258.894,
    "text": "And we have these three legs to the stool, kind of three threads that intertwine in the paper with analytical formulation of navigation, which is what Blue mentioned with a hierarchical generative model, and the implementation in robotic and in biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.294,
    "end": 262.397,
    "text": "So maybe a first question is, how has this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.217,
    "end": 285.852,
    "text": " intersection of modeling navigation with robotics and biology been conceptualized and what brought you to apply active inference in this way and what does it add we should go first",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.451,
    "end": 311.94,
    "text": " So maybe my perspective here is that we basically got started from a robotics perspective, like looking at the navigation problem and looking at the ways that it's being solved right now and implemented right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.08,
    "end": 319.043,
    "text": "And at the same time, we already had quite some experience with Active Inference, but more like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.413,
    "end": 340.218,
    "text": " on yeah simple problems let's say our first um our first experiments were more on this kind of mountain car environment or a simulated car racer but it was always our goal to kind of try to scale it up to um yeah to real world robots and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.944,
    "end": 372.126,
    "text": " we got started by drawing and seeing parallels between current implementations out there that seem to match with how we would look at it from an active inference perspective and kind of work our way from both ways so on the one hand try to get some implementation running and on the other hand seeing how we could formalize it and actually make the math work in the active inference framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.522,
    "end": 388.784,
    "text": " and what we found out was that actually the the best matching implementation from a robotics perspective was actually one that was quite bio-inspired so it was basically the the red slam model from milford at all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.426,
    "end": 394.715,
    "text": " where they had these heavy inspiration from grid cells, place cells, and these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.576,
    "end": 403.91,
    "text": "And yeah, of course, it was not really a surprise given the fact how active internet is also grounded in neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.565,
    "end": 413.032,
    "text": " And so that's where we reached out to Adam to basically show off like, OK, this is our trajectory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.772,
    "end": 414.673,
    "text": "This is our plan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 415.214,
    "end": 421.038,
    "text": "This is our current implementation and how we think the math could work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.379,
    "end": 427.904,
    "text": "And then Adam, with his infinite knowledge of how the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.388,
    "end": 431.529,
    "text": " It could work in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.549,
    "end": 439.752,
    "text": "He gave like all kind of pointers like, OK, but this is interesting because what you implemented here is actually looking a lot like this kind of system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 439.832,
    "end": 443.613,
    "text": "And what you're doing here is actually very much like these kind of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.673,
    "end": 447.255,
    "text": "And then we just said, OK, let's let's begin this further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 447.475,
    "end": 451.556,
    "text": "And we basically started on carving out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 453.837,
    "end": 462.431,
    "text": " ping-ponging like, okay, if this is how it's done in the brain, then maybe we can make something more similar in the mouth or in the implementation, vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.232,
    "end": 468.421,
    "text": "And the paper is basically a first step where we had, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 470.29,
    "end": 474.874,
    "text": " the three bits kind of in place, but we know where the open issues are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.435,
    "end": 483.64,
    "text": "But it actually has something working on and sensible on all three levels, I'd say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.361,
    "end": 488.704,
    "text": "And that's where we are at at this moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.947,
    "end": 492.207,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.427,
    "end": 493.088,
    "text": "Thank you, Adam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.188,
    "end": 494.929,
    "text": "Anything you add to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.874,
    "end": 521.176,
    "text": " I guess what I would add is I'm increasingly compelled by the idea that robotics as a touchstone and basis for understanding different aspects of mind is like it might be the most powerful kind of grounded empiricism we can do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 522.265,
    "end": 536.899,
    "text": " And I think it's both because it's like the, like a lot of times, like that Feynman quote of like, what I cannot build, I cannot understand is like mentioned, but this is actually building systems that, yeah, this is that, that, that have to work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 537.479,
    "end": 547.889,
    "text": "And, um, and these problems like in going through them and looking at the different solutions, like the kind of understanding you get, I think is really, uh, unique.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 548.661,
    "end": 559.029,
    "text": " Um, but also I think it's particularly apps because of what our minds, other than control cybernetic control systems for bodies that have to move through the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 559.87,
    "end": 564.693,
    "text": "And so this idea that like the way roboticists are approaching it, like it's.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 566.495,
    "end": 568.076,
    "text": "And that is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 568.911,
    "end": 572.494,
    "text": " the exact problem that nature had to solve, that natural selection had to solve.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 572.634,
    "end": 573.834,
    "text": "Now the question is, was it the same?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 573.855,
    "end": 587.344,
    "text": "It might be in some cases, because you'd expect within bounds nature to be a fairly clever blind designer in terms of what it might discover.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 587.964,
    "end": 592.988,
    "text": "And so just going back and forth between the robotics perspective",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 593.755,
    "end": 605.179,
    "text": " and how it might work in biology, and then the abstract algorithmic implementations of them for the robots, and seeing how those can mutually inform each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 606.92,
    "end": 613.903,
    "text": "For me, this is how I basically want all my thinking about the mind to be from now on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 614.023,
    "end": 619.925,
    "text": "I feel like this is the most powerful way of thinking on it, that back and forth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 626.052,
    "end": 628.434,
    "text": " Let's enter in the biological door or blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.454,
    "end": 629.075,
    "text": "Do you have a question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.036,
    "end": 630.296,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.017,
    "end": 644.871,
    "text": "So Adam, what, even though of course it's a deep area and there's writing in the paper and citations and so on, what is so interesting about the structuring of the grid cells through space and time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.572,
    "end": 649.536,
    "text": "And what can we learn from that about effective ways of navigating?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.208,
    "end": 675.877,
    "text": " So in latent SLAM, we have these pose cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 675.977,
    "end": 683.765,
    "text": "And actually, I think it's probably better for Tim to talk about that, like the exact ways in which these cells function within the robotic system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 684.385,
    "end": 687.709,
    "text": "I think that actually brings more clarity than",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 688.544,
    "end": 695.726,
    "text": " um, the more mysterious, like, so there's lots of ideas have been going around in like computational neuroscience of like what the grid cells might do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 696.346,
    "end": 701.188,
    "text": "But I actually think the greatest clarity comes from like, well, how would the analogs work in the robotic system?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 701.208,
    "end": 702.708,
    "text": "So I'm going to kick that to Tim.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 703.208,
    "end": 704.048,
    "text": "Uh, what do you think Tim?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 707.189,
    "end": 707.469,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.509,
    "end": 717.232,
    "text": "So I, I think that's in, in our current implementation, the, the parallel with grid cells is kind of, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 718.802,
    "end": 720.683,
    "text": " hardwired in the implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 720.823,
    "end": 729.648,
    "text": "It's kind of, by design, you have something that looks, if you squint your eyes a lot, it looks a bit like a grid cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.929,
    "end": 733.431,
    "text": "I wouldn't say that we actually have grid cells in here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.092,
    "end": 742.977,
    "text": "Because to me, the grid cell is basically, it should be an abstract, it should be giving you a way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 745.382,
    "end": 748.623,
    "text": " modeling movement in an abstract space, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.143,
    "end": 755.144,
    "text": "And in the case of navigation, the space by accident maps to the real world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.024,
    "end": 773.667,
    "text": "And the grid selectivation is just a peculiar way of encoding where you are in the space without just giving you the XY coordinates, basically, but the more kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.807,
    "end": 803.343,
    "text": " uh higher dimensional more robust representation of where are you on in this on this grid and how do you if if i now move how does how does your um location in in in this reference frame or this grid uh change and so in our in our implementation we basically just said okay we know that we are in a roughly flat uh surfaced world so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.477,
    "end": 812.821,
    "text": " the main coordinates that we need to track and integrate over are the X, X, Y position and the head direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 812.861,
    "end": 815.702,
    "text": "These are basically the main things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 816.462,
    "end": 820.824,
    "text": "And I mean, we use this thing called the continuous attractor network to kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.847,
    "end": 842.354,
    "text": " represent these three coordinates and we basically we inject the knowledge that if you move forward then you will also move forward to within this attractor network location and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 844.935,
    "end": 848.439,
    "text": " Roughly, this corresponds to doing kind of path integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.639,
    "end": 856.789,
    "text": "And I'm pretty sure that grid cells are giving you similar functionality in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 856.809,
    "end": 859.852,
    "text": "But I would not say that our current implementation actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 860.842,
    "end": 878.929,
    "text": " I think the parallel is more with place cells, because there we do learn representations from visual sensory inputs that kind of give you an estimate of this is a particular location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.589,
    "end": 882.43,
    "text": "And if you see a similar pattern, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.513,
    "end": 901.17,
    "text": " it is likely that you are visiting the same location again and if at the same time you happen to have a very similar x y uh and head direction as in your uh as in your previous time you you kind of saw something similar like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.93,
    "end": 905.691,
    "text": " then you have pretty good evidence that you are actually in the same spot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.071,
    "end": 914.573,
    "text": "And then this is what you then call loop closure, and then you kind of reorient yourself as if you were at the same location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.034,
    "end": 924.436,
    "text": "So that's kind of how I would think of grid cells and place cells in our current work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.157,
    "end": 928.497,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.677,
    "end": 930.478,
    "text": "Blue, do you have any questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.498,
    "end": 931.358,
    "text": "Yes, please, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.657,
    "end": 940.022,
    "text": " So I'm curious as to the role, if any, or how the system may change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.303,
    "end": 944.145,
    "text": "If you included proprio reception, which is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.844,
    "end": 948.025,
    "text": " the sense of where your body is in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.085,
    "end": 955.967,
    "text": "And so like this is partially modeled through the visual system at place cells, grid cells, et cetera, but it's, it's not always right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.987,
    "end": 960.509,
    "text": "So it includes other senses like balance and you know, where's my hand and these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.169,
    "end": 972.853,
    "text": "And I'm just curious if your model includes that in any way or only or, or not, or how it may change if it did give it, give it kind of like a more embodied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.778,
    "end": 987.401,
    "text": " Yeah, so basically, in our case, the proprioception is limited to basically the velocity commands that you issue to the robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.521,
    "end": 989.582,
    "text": "It also observes these again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 989.622,
    "end": 994.583,
    "text": "So it assumes that it knows which command it's sending, and then these are also kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.563,
    "end": 1020.455,
    "text": " fed back to the model as kind of a sensor so if you say drive forward or turn left or turn right with these kind of angular velocities this information is also sent into the model and this is then what we call the action so everywhere in the especially in the low level model you see the action pop-up this is basically you can you can see this as kind of a proprioception thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.776,
    "end": 1032.068,
    "text": " And so everything kind of predicts what will happen given what I sensed that I was doing, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.029,
    "end": 1040.377,
    "text": "And we do it both for the visual sensor, like what would I see if I'm turning left or right or go forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.098,
    "end": 1046.661,
    "text": " but also for tracking the pose and doing the pattern integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.701,
    "end": 1058.528,
    "text": "Like if I move forward and my heading was a zero angle, then I will probably just move forward in the x direction of the cam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.33,
    "end": 1069.374,
    "text": "And that introduction of counterfactuals and anticipation, what would happen if I did this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.307,
    "end": 1078.577,
    "text": " is very interesting area and also it speaks to the composability and the flexibility of the active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.997,
    "end": 1087.667,
    "text": "Like Sid highlighted that only the visual data were being used here with RGB values of video, but there are other kinds of sensors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1088.308,
    "end": 1113.389,
    "text": " that could be used as another sense state and that would kind of increase the dimensionality of the model maybe it is a value add maybe it's not but it doesn't require um rewriting it's like more like plugging in a different hard drive than it is like having a different computer um so you mentioned a higher dimensional robust representation of location and that's definitely one of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.46,
    "end": 1141.256,
    "text": " advantages and and aspects of the model that'll be important to explore more like in the dot zero we explored this paper are we ready for service robots that showed how sometimes even trivial changes to environments can result in the robot getting lost because it has referenced to something like a chair that's no longer at the same location so how does this model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.932,
    "end": 1146.175,
    "text": " provide a higher dimensional robust representation of location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.235,
    "end": 1154.441,
    "text": "And how did you go from thinking about that to the actual way that the generative model is framed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.66,
    "end": 1155.88,
    "text": " Yeah, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.947,
    "end": 1188.171,
    "text": " To get back at the problems that you mentioned on the service robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.611,
    "end": 1197.996,
    "text": "So basically, the major problem in Robotics Slam is that indeed, if your environment changes slightly a bit, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.342,
    "end": 1224.789,
    "text": " the same location doesn't look the same anymore in whatever sensor modality you're using and that can be problematic especially if you if you want to model the environment as like a metric system where you basically define this is my origin so this is zero zero in the coordinate system and now i will",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.964,
    "end": 1232.907,
    "text": " for every obstacle or thing that I approach, I will log my estimation of the XY coordinates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.688,
    "end": 1239.191,
    "text": "And then suddenly when your chair moves, of course, yeah, everything breaks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.071,
    "end": 1248.635,
    "text": "But here in this system, we actually get rid of being grounded in a metric space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.176,
    "end": 1251.517,
    "text": "The only thing that matters is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.402,
    "end": 1281.556,
    "text": " this location looks very similar to something i i visited before it also seems likely given the the pet integrated trajectory i i assume i was following so this might be the same spot and if you think that or if the chair moved in in that place yeah that's fine then you just say okay maybe it's a different spot it doesn't really matter",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.653,
    "end": 1311.668,
    "text": " um at some point you will have a kind of a queue that is stable right so and that's actually what we also do as as humans if you want to navigate you just look for the the the cues that you are that you know that are pretty stable if you visit a a new town you will look for the church tower because you know it will not move you will not orient yourself based on the color of the cars that are parked uh somewhere so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1312.91,
    "end": 1319.123,
    "text": " I think by using the active inference principle as a starting point,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.677,
    "end": 1331.66,
    "text": " you can get rid of a lot of these problems because your agent will automatically look for these stable queues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.3,
    "end": 1346.205,
    "text": "And if suddenly the environment changes, we'll just accept this and just model it as like, okay, I think I'm revisiting this same trajectory, but now it looks different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.245,
    "end": 1352.027,
    "text": "So maybe I just have to model it as such as this is kind of a trajectory that can change often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.567,
    "end": 1361.898,
    "text": " And maybe this implies that if you plan the next time, you'd rather prefer a different trajectory where you know that everything is stable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.559,
    "end": 1367.444,
    "text": "So this is the same as reducing your ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.965,
    "end": 1370.087,
    "text": "So I think that getting rid of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.295,
    "end": 1394.573,
    "text": " everything should be structured in this x y location in a metric space and else i don't know what's going on just by getting rid of that and and and just assume anything can happen anything can change and if it does not change i i prefer it i like it better uh this helps a lot uh to circumvent a lot of the traditional problems i've seen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.694,
    "end": 1401.475,
    "text": " Adam, anything to add on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.056,
    "end": 1425.863,
    "text": "I mean, so one of the things that we've been working on is, like in this paper, it's trying to say, OK, so to what degree are the principles of what we understand about the natures of the hippocampal and entorhinal system being reflected in this simultaneous localization and mapping problem in latent SLAM?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1427.117,
    "end": 1442.742,
    "text": " And some of the other work we're doing is also going in the reverse direction of what can these principles of these slam principles use for autonomous navigation?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1443.482,
    "end": 1446.803,
    "text": "What can they tell us about the brain functioning as a cybernetic system?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1447.083,
    "end": 1450.784,
    "text": "And so one idea in general is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1451.948,
    "end": 1476.28,
    "text": " each of these operations, in addition to having this fundamental significance of the basics of being able to move through the world, this task that any active inferential system that's going to survive and do what it needs to do has to handle, but to what extent",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1477.529,
    "end": 1482.853,
    "text": " were these same principles repurposed for sophisticated inference more generally?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1482.873,
    "end": 1491.298,
    "text": "And to what degree is sophisticated inference structured according to SLAM principles?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1492.239,
    "end": 1503.447,
    "text": "And so if you're talking about these loop closure events, like finding this highly familiar state and where you think you know where you are by this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1504.679,
    "end": 1518.987,
    "text": " Convergence of like your trajectory information and your pose well this question would be like this is a model potentially for the feeling of insight or discovering of like causal accounts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1520.428,
    "end": 1520.668,
    "text": "Is this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1522.751,
    "end": 1530.576,
    "text": " And is this actually a source of inter-individual differences, which would be fairly fundamental?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1530.656,
    "end": 1533.198,
    "text": "How familiar do you think things are or not?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1536.14,
    "end": 1541.344,
    "text": "How much do you update on encountering these highly familiar situations?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1542.084,
    "end": 1550.11,
    "text": "And so me personally, what I've been wondering is, to what extent, of all the details, to what degree",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1550.839,
    "end": 1557.422,
    "text": " So re-representing the biological details in terms of the kinds of descriptions that Tim is giving here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1558.243,
    "end": 1562.645,
    "text": "And also, though, thinking of cognition more generally as navigation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1563.105,
    "end": 1571.649,
    "text": "And so thinking of each of these things, what are the analogs at the level of thought as a kind of navigation through generalized space?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1574.711,
    "end": 1575.011,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.291,
    "end": 1576.612,
    "text": "Yeah, there's been navigation through.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1577.802,
    "end": 1584.707,
    "text": " A lot of interesting work on exploration, exploitation in mind and space, Hills et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.727,
    "end": 1592.692,
    "text": "2015, and on thinking about planning and the evolution of planning as being related to spatial as well as cognitive foraging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.095,
    "end": 1599.958,
    "text": "So it's interesting to think about cognition as navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.093,
    "end": 1607.855,
    "text": " I think about the feeling that I have when I'm searching for a thought, a word, a name of a person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.875,
    "end": 1619.239,
    "text": "It literally feels like you're scrolling through a filing cabinet, physically looking for this piece of information in your brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.359,
    "end": 1627.522,
    "text": "And I know that different neurons store different pieces of information, like the Jennifer Aniston neuron and these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.232,
    "end": 1635.556,
    "text": " So I wonder what, can you just elaborate maybe a little bit more on that, Adam, about like cognition as navigation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.656,
    "end": 1640.058,
    "text": "Is it like literally navigating to find the right neuron that goes ding, ding, ding, ding, ding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.078,
    "end": 1641.078,
    "text": "Like that's the one I wanted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.098,
    "end": 1654.105,
    "text": "So like to some degree it could be in that like, it's like two ways I might think of it as one of like you were talking before and you were like bringing up like memory palaces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1654.929,
    "end": 1672.083,
    "text": " And I think that would be one example of thought is navigation, which is with this art of memory in terms of it can be part of the way we access and organize the information we work with when we're thinking is through a kind of spatialization often.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1672.243,
    "end": 1680.169,
    "text": "And actually, to the extent that we show really great virtuosity with memory, it's through an explicit process of spatializing and navigating through domain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1680.83,
    "end": 1683.712,
    "text": "And that gives us the best purchase we have",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1685.714,
    "end": 1690.036,
    "text": " you know, remembering these building, constructing and accessing these complex structures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1691.057,
    "end": 1703.703,
    "text": "But in terms of like what you're describing with like something kind of like, you know, Jennifer Anderson or like neurons are like kind of finding, the thing that's coming to mind there is like foraging theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1704.303,
    "end": 1712.567,
    "text": "And so what you might be foraging for, like when you're like looking for like something that fits is a certain amount of like familiarity,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1713.2,
    "end": 1728.354,
    "text": " Or like some amount of like, you know, it could take different forms, like, you know, some sort of, uh, you know, maybe, maybe it's a entire receptive code and it's like, like a visceral feeling of like compelling this, or maybe it's like a more of like a proprioceptive code.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1728.374,
    "end": 1729.655,
    "text": "And it's like tension in the body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1729.675,
    "end": 1735.18,
    "text": "I don't know what it might be, but this, like, there's some sort of read you're having on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1737.392,
    "end": 1738.853,
    "text": " are you finding what you're looking for?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1738.873,
    "end": 1741.715,
    "text": "And so then the idea would be like, you're foraging for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1741.735,
    "end": 1750.362,
    "text": "And so you might spend a little bit of time in some area of conceptual space, and you're kind of moving around in there, like trying out different permutations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1751.023,
    "end": 1752.704,
    "text": "And then you're like, nah, I'm not finding it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1752.744,
    "end": 1758.208,
    "text": "And then you might do like a different tack, and then move to another area of semantic or conceptual space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1758.689,
    "end": 1759.71,
    "text": "And you're searching around there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1759.81,
    "end": 1760.15,
    "text": "And so like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1761.06,
    "end": 1764.182,
    "text": " In forging theory, these would be called, I believe, levy flights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1764.802,
    "end": 1774.086,
    "text": "And so there's something called the marginal value theorem, which is if you're trying to be an optimal forager, you're trying to balance exploration and exploitation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1774.506,
    "end": 1786.271,
    "text": "And so you don't want to spend too long in a given patch if it's not having what you want, but you don't want to leave a patch prematurely if it's a good patch to be exploited.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1786.791,
    "end": 1788.212,
    "text": "And so the idea is if you're looking for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1789.159,
    "end": 1795.063,
    "text": " searching for a name or something that fits, it might take the form of this kind of generalized foraging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1795.203,
    "end": 1808.271,
    "text": "But instead of you locomoting through spaces, you're actually spending different amounts of time in semantic spaces and then shifting based on whether you think you're actually, it's like a juicy patch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1809.212,
    "end": 1815.756,
    "text": "And so with the marginal value theorem, it says if your current rate of foraging drops below the historical return, then you should go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1819.097,
    "end": 1823.101,
    "text": " And so there might be different inductive biases in the brain that would represent this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1823.141,
    "end": 1837.113,
    "text": "For example, the hippocampal system, this might look like, for instance, the way my plan is, you might get this prediction error drops below a certain amount or goes past a certain amount.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1837.673,
    "end": 1841.096,
    "text": "And then the hippocampal system ramps up with a lot of her current activity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1841.116,
    "end": 1841.937,
    "text": "It's called a ripple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1842.678,
    "end": 1845.78,
    "text": "And then it resets itself and retiles the space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1847.162,
    "end": 1855.028,
    "text": " stimulates cortex and a new set of operative policies and specializations might occur.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1855.748,
    "end": 1864.814,
    "text": "And so this would be an example of a mechanism, like hippocampal system might have a built-in mechanism for these attentional shifts and these imaginative shifts when you're doing foraging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1865.475,
    "end": 1868.197,
    "text": "It might be reflected also in other ways, like dopamine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1868.717,
    "end": 1870.598,
    "text": "So there's some thoughts on my thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1870.658,
    "end": 1875.742,
    "text": "Nathaniel Dahl will talk about one way of interpreting a ponency between phasic and tonic dopamine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1876.428,
    "end": 1880.75,
    "text": " would be the tonic would tell you what's your average return, basically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1881.55,
    "end": 1891.433,
    "text": "And there seems to be a kind of functional, I don't know if it's not quite antagonism, but the more your tonic is high, the less impactful any phasic event is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1892.274,
    "end": 1903.518,
    "text": "And so it would be kind of like if you're foraging what would occasion a shift or not, you might actually see this playing out in the way neuromodulators work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1905.607,
    "end": 1915.218,
    "text": " I don't know if that helps at all, but the idea is that this is the sort of thinking in terms of forging or navigation through generalized spaces as basically being.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1917.06,
    "end": 1926.691,
    "text": "So I guess there's a kind of a priori reason you would expect it to be generally good, which is, well, doesn't everything",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1928.929,
    "end": 1957.186,
    "text": " most of the things we encounter do indeed exist in spaces and then most things the way we understand them is by like spatializing them let's like we graph them we we do like multi-dimensional scaling we do different things to try to like it's just like a way we understand things but it also seems like this was probably both evolutionarily and developmentally like this was the original challenge that had to be solved where the systems were paying their weight and that this would then involve like a repurposing and a redeploying for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1958.007,
    "end": 1959.067,
    "text": " more abstract domains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1960.268,
    "end": 1968.689,
    "text": "So like there's some other like, I think it's Burgess has done some good work, right finding like, for instance, like, we might create like a morphos space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1969.009,
    "end": 1979.712,
    "text": "And we're like looking like, like, they'll create like these generative, like birds with like different like neck lengths, and you're trying to do like categories over like what the different kinds of birds are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1980.392,
    "end": 1984.553,
    "text": "And there's like, there's evidence that the way we do the categorization is we'll create",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1985.319,
    "end": 1988.46,
    "text": " a spatial ization of this task structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1988.48,
    "end": 1995.803,
    "text": "And there's some evidence that the capital system is we're navigating through that in dealing with these categories.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1997.143,
    "end": 2006.967,
    "text": "Anyway, so that's, that was a lot of rambling, but like, I don't know if that got it with any of that land or Yeah, lots of Atlanta is very cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2006.987,
    "end": 2007.327,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.507,
    "end": 2007.687,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2009.699,
    "end": 2033.874,
    "text": " one note that will i'm sure be exploring going forward optimal foraging theory is often put in the context of utility which is just the pragmatic component in active inference in terms of policy selection so optimal active inference foraging is like when the epistemic and the pragmatic gain are being considered so that's quite interesting and then also there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.494,
    "end": 2037.997,
    "text": " as you brought up individual and collective navigation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.598,
    "end": 2046.446,
    "text": "So one case is sort of the sovereign robot, no Wi-Fi, onboard computation, alone in the warehouse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.106,
    "end": 2053.252,
    "text": "But then in the case of, for example, an ant colony where there's stigmergy and modification of the environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.213,
    "end": 2065.458,
    "text": " that might be possible or even facilitated by different onboard cognition and different outsourced or offloaded, which brings us to extended cognitive discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.138,
    "end": 2069.04,
    "text": "But let's return to this question about going from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.02,
    "end": 2085.987,
    "text": " this resiliency of navigation that a biologist knows exists, a roboticist might want to see, how did you then go to that third space and actually have a hierarchical model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.307,
    "end": 2093.691,
    "text": "So here in figure two or wherever else you suggest, what is happening here and how did this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.611,
    "end": 2099.816,
    "text": " graphical structure come to be as opposed to potentially like other graphical structures that could have been used?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.1,
    "end": 2107.224,
    "text": "OK, so basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.086,
    "end": 2113.651,
    "text": "Let me first maybe explain what all the variables mean in this in this figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2114.251,
    "end": 2114.772,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.674,
    "end": 2117.755,
    "text": "Going from the bottom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2118.346,
    "end": 2124.195,
    "text": " At the bottom we have the O's, OTs, which are basically observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.255,
    "end": 2128.982,
    "text": "So these are like the visual inputs, what the robot sees, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.805,
    "end": 2146.459,
    "text": " And then we have two latent variables, S and P, where S is basically an estimation of all the latent factors that give rise to the observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.539,
    "end": 2153.485,
    "text": "So it's kind of a latent space that confines all possible visual observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.588,
    "end": 2171.469,
    "text": " And p, on the other hand, is the latent variable that has a representation of your pose, which is then basically, in this case, your xy position and head direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.874,
    "end": 2177.759,
    "text": " And then we have one more, which is the aid action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2178.42,
    "end": 2182.825,
    "text": "And so that's what I hinted at previously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.845,
    "end": 2186.469,
    "text": "This is basically your proprioception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.489,
    "end": 2188.512,
    "text": "You know what you have been doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.291,
    "end": 2195.834,
    "text": " So therefore, up until the past, the 80s are also shaded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.874,
    "end": 2200.696,
    "text": "So it means that you basically have access to what you have been doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.816,
    "end": 2206.118,
    "text": "It's like the low level action, like move forward to this velocity or turn left or turn right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2206.598,
    "end": 2215.122,
    "text": "But then for the future, this becomes an unobserved thing and you basically want to infer potential actions you should be doing in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.003,
    "end": 2217.283,
    "text": "And then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.097,
    "end": 2226.061,
    "text": " For the future, a number of actions can be just summarized as pi, which is then the policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.081,
    "end": 2233.665,
    "text": "So the policy is no more than a sequence of future actions that you want to do or that you intend to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2235.466,
    "end": 2237.807,
    "text": "And then we move up a level in the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.088,
    "end": 2249.627,
    "text": " and there we have two more variables one is the location l and this is then basically kind of a more coarse grained",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.427,
    "end": 2275.127,
    "text": " yeah look representation of location where am i but it's not really uh it's not necessarily tied to a metric space it's just like identifying this is a location and then we have uh also an action space at this level but this is the more uh we call this moves or m",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.01,
    "end": 2280.494,
    "text": " And the move is basically kind of moving from one location to another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.874,
    "end": 2291.863,
    "text": "So locations can just be more coarse grains like what you define as like a separate location in your environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2292.879,
    "end": 2304.342,
    "text": " Whereas at the lower level, the states, if you move from one state to the other, it's basically just saying, okay, what would be the next frame of my camera sensor be like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.702,
    "end": 2309.684,
    "text": "And so it's also crucial to know that these two levels operate on different kind of timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.184,
    "end": 2314.245,
    "text": "So the lowest level timescale is basically a very fine scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.925,
    "end": 2318.126,
    "text": " fine-grained action perception loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.146,
    "end": 2332.492,
    "text": "I send the motor commands to the robot and I read out my camera and this can go to, I think we implemented it at like 10 hertz, so 10 times per second to get a new camera frame and we updated the motor command.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.172,
    "end": 2343.116,
    "text": "Whereas location is just like moving from one location to another can take you maybe 10 or more time steps at the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2344.591,
    "end": 2349.155,
    "text": " And then, of course, one of the crucial bits is then, how do you identify a location?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.787,
    "end": 2375.477,
    "text": " And so basically how it comes to be is that if you basically observe your space through the camera images, we infer this abstract state space S, and then we look at what is the surprise of being in this state versus what I predicted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.997,
    "end": 2381.019,
    "text": "And if this surpasses like a certain threshold, so yeah,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.228,
    "end": 2385.909,
    "text": " pretty complex to explain, but I'll do my best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2386.289,
    "end": 2401.034,
    "text": "So every time, every time step, you get basically a new camera image and you can calculate like what is what is the divergence between what I was thinking about the state previously and how does it how did it shift?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.767,
    "end": 2430.139,
    "text": " with my new observation is then basically your kind of the bayesian surprise that you had from seeing this observation and every time step we accumulate like this number and once we suppose a certain threshold which is kind of a hyper parameter we just fix it that's something that seems to work so if you suppose this threshold you basically say okay this is now distinct enough from n time steps before so it must be something new it must be a new kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.774,
    "end": 2454.406,
    "text": " location in my map and then you add this thing as a distinct location in your map and you add like a link from the previous location to this one and you start and then you continue further on building the map and this is how you then kind of create this more coarse grained map of your environment and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.343,
    "end": 2479.814,
    "text": " you can then reason like how should i move from this location to another and you then can you can basically use your your previously visited locations and moves to kind of have a model of how can i move in this space but at the more coarse grade level moving from one location to another and it also means that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.507,
    "end": 2495.517,
    "text": " by using this surprise on inferred latent space that we infer from visual input, it means that not every edge has the same distance in real space necessarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.857,
    "end": 2505.163,
    "text": "So if the robot is traversing a white hallway where the walls are perfectly white and everything is the same,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.573,
    "end": 2509.939,
    "text": " Then it will take a long time for this threshold to be reached.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.279,
    "end": 2515.387,
    "text": "And it will only at larger distances make a new node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.427,
    "end": 2517.17,
    "text": "Because everything looks the same anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.19,
    "end": 2520.696,
    "text": "So there's no extra information that I need to put in the map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.283,
    "end": 2532.598,
    "text": " But if you then suddenly see a door, for example, then you suddenly reach your threshold and you add a new location in your map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2533.019,
    "end": 2536.543,
    "text": "And so it's basically the locations in the map are basically defined on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.206,
    "end": 2548.208,
    "text": " what is the information I got by looking at this thing, rather than how much meters did I traverse in this time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.608,
    "end": 2564.151,
    "text": "And that makes it a really interesting way of representing maps, because it's more like how much information is there in this particular location, rather than which xy position is here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.023,
    "end": 2569.127,
    "text": " Does it make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.254,
    "end": 2571.474,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.336,
    "end": 2578.439,
    "text": " And it feels to map onto the distinction between like Kronos and Kairos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.079,
    "end": 2587.162,
    "text": "Like in this analogy here, Kronos is the chronometer, it's the watch time, it's the geometry, it's the XY grid, it's one meter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.702,
    "end": 2592.544,
    "text": "And then Kairos is like the timeliness of action and the time it takes to complete an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.144,
    "end": 2599.267,
    "text": "And then something being like boring, that's going through a low information hallway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.907,
    "end": 2601.148,
    "text": " in the cognitive forging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.228,
    "end": 2602.63,
    "text": "It's like, are we there yet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.07,
    "end": 2612.818,
    "text": "Driving through this featureless landscape where the salience is low because my predictions are basically being met almost too well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.539,
    "end": 2614.62,
    "text": "And there's a lot of other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.226,
    "end": 2616.966,
    "text": " ways to go with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.467,
    "end": 2619.387,
    "text": "Adam, anything to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.407,
    "end": 2624.849,
    "text": "And also, again, I'm just kind of curious, like, what is the space of the possible graphical structures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.249,
    "end": 2632.372,
    "text": "Do you think that this is the only or the sort of grandfather graphical model for hierarchical navigation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.412,
    "end": 2643.836,
    "text": "Like, how do we go from imagining this tactics and strategy multi-level model to a graphical model that we believe will be consistent with active inference and amenable to message passing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.46,
    "end": 2659.188,
    "text": " Maybe to add on this last question, I think Kristen has a paper on deep temporal hierarchical models where he basically lays out more generic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.849,
    "end": 2675.599,
    "text": "If you're looking at the ultimate generic hierarchical model, you'll find it there where it's basically just an aggregation of states that give rise to observations that go from one state to another",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.987,
    "end": 2681.921,
    "text": " given an action, and then you can add the level on top and level on top and you can keep on adding levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.585,
    "end": 2685.289,
    "text": "And that's kind of the prototypical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2685.714,
    "end": 2687.135,
    "text": " hierarchical model, I would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.536,
    "end": 2706.788,
    "text": "And what we see here is kind of particular instantiation where we took some domain knowledge like, OK, for navigation, what would be sensible levels to think about and what would these latent states then what should they represent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.348,
    "end": 2710.771,
    "text": "And then, of course, you easily end up like, OK,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.751,
    "end": 2716.774,
    "text": " At the lowest level, I need to have some state that represents my camera images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.335,
    "end": 2721.157,
    "text": "And at the higher level, I want to have some locations in the map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.584,
    "end": 2724.585,
    "text": " How do they then relate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.705,
    "end": 2728.928,
    "text": "Okay, I probably also want this spot integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.968,
    "end": 2737.034,
    "text": "So maybe I need to have a special first-class citizens here in the form of my posts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2737.935,
    "end": 2749.564,
    "text": "And that's how you basically build up the model from first looking at this prototypical hierarchical model, then looking at, yeah, but in my case, what do I think is sensible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.864,
    "end": 2751.045,
    "text": "What could these things mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.747,
    "end": 2764.297,
    "text": " And then try to figure out like, okay, at this stage, we kind of converge on the one hand from top down, like does the math work out to bottom up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.498,
    "end": 2767.02,
    "text": "Does this match with my implementation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.48,
    "end": 2770.402,
    "text": "And then at some point we converge to this basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2772.264,
    "end": 2776.327,
    "text": "So the high road and the low road, they do lead to Rome after all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.368,
    "end": 2777.729,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.29,
    "end": 2780.651,
    "text": "Adam, what would you add in there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.362,
    "end": 2787.865,
    "text": " Well, first of all, I love that metaphor just now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2788.505,
    "end": 2801.832,
    "text": "Another thing I would add is, so like, you know, on my end, like, I'm trying to use this as like abstractions for understanding, you know, aspects of like brain functioning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2801.893,
    "end": 2808.256,
    "text": "So let's say we're talking about these, you know, this top level",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2809.648,
    "end": 2813.21,
    "text": " This is one way of interpreting like, you know, hippocampal place cells.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2814.05,
    "end": 2832.897,
    "text": "And these, whether you create a new note or not, based on what threshold of familiarity or surprise, this would potentially be like an example, I think, of an extremely powerful source of individual differences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2833.692,
    "end": 2839.133,
    "text": " Like maybe you could think of this in terms of like Piagetian like assimilation or accommodation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2839.633,
    "end": 2851.636,
    "text": "But you could see like if your thresholds are too low or too high, you could end up representing a domain in ways with that are either like you can get false.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2851.996,
    "end": 2857.498,
    "text": "You can get things that are like excessively granular or insufficiently granular to represent the domain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2858.058,
    "end": 2860.418,
    "text": "And you can get different types of errors associated with it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2860.998,
    "end": 2862.739,
    "text": "And so this, for instance, could define",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2864.378,
    "end": 2873.326,
    "text": " Even things like more like some people will talk like autism to schizophrenia spectrums and to some, there could be like kind of underlying predispositions for this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2874.067,
    "end": 2884.837,
    "text": "And it might actually be, I think that's an oversimplification, but you could think of these thresholds as some cognitive spectrums might just fall out of them as you get different types of minds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2884.857,
    "end": 2890.142,
    "text": "If you have like a more granular, like an overly inclusive or an underly inclusive category structure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2890.868,
    "end": 2915.362,
    "text": " but some other things like just trying on this would be like, if we're talking about this, um, you know, lower level, and if we're thinking of like these, um, like enter rhino grid cells as well, not quite being while the posts here aren't quite grid cells, but the, this idea of like this, um, mapping of your, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2918.804,
    "end": 2921.305,
    "text": " what your body position is and where you're oriented.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2922.246,
    "end": 2932.993,
    "text": "And then having this conjoined with what's in your visual field, and then using these sources of information to mutually constrain each other and using where you are in space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2935.075,
    "end": 2941.539,
    "text": "And these all being necessary, like for instance, this seems to be fundamentally what was needed to get the robots to work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2941.76,
    "end": 2944.942,
    "text": "And we have not so dissimilar sensors and effectors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2945.658,
    "end": 2966.795,
    "text": " And so one thought is, I think it's Guillaume Dubas has, I just messed up his name, but he has this interesting paper on the default mode system, it's called Dark Control, and thinking of it as doing tree search.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2967.696,
    "end": 2971.359,
    "text": "But to loop it around,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2972.615,
    "end": 2995.102,
    "text": " dispose information it's possible that somewhat like the posterior nodes of the dmn are actually helping to encode this information um like if you go like to the parietal portions that actually might be where is my body where is it reflected and then if you're going like to these midline portions of it um you know what's in my visual field or what am i imagining",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2996.041,
    "end": 3001.404,
    "text": " And then if you want to go for this future part, that might be the anterior portions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3002.605,
    "end": 3010.449,
    "text": "So like the DMN or the dorsal medial prefrontal cortex maybe coupling with the anterior hippocampus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3010.489,
    "end": 3024.797,
    "text": "But basically, it would seem that the stream, these core aspects of the model might be ways of functionally understanding the core aspects of an agent architecture used for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3026.061,
    "end": 3029.062,
    "text": " mental simulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3029.982,
    "end": 3037.683,
    "text": "There seems to be a striking amount of convergence between the things that people like Tim are identifying as just like, what's necessary?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3037.723,
    "end": 3038.823,
    "text": "How do we solve the problem?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3039.743,
    "end": 3054.006,
    "text": "And the features of neuronal organization that would be these defaults or canonical processes that you're seeing as really just fundamental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3055.265,
    "end": 3056.447,
    "text": " We call it the default focus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.527,
    "end": 3057.488,
    "text": "It's active all the time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3057.548,
    "end": 3058.129,
    "text": "What's it doing?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3059.411,
    "end": 3067.702,
    "text": "Maybe part of what it's doing is it's allowing us to do this kind of navigation through space and time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3067.722,
    "end": 3071.988,
    "text": "Yeah, those are some thoughts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3074.403,
    "end": 3082.528,
    "text": " Navigation through space and time in the sort of territory sense would be clock time and metric space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.968,
    "end": 3084.549,
    "text": "What is your X, Y, Z, T?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.189,
    "end": 3087.651,
    "text": "And then navigation through mental space and time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.973,
    "end": 3094.016,
    "text": " might have some resonances or analogies, but it's not a piece of grid paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.937,
    "end": 3102.022,
    "text": "So what is it and how does it become realized through ecology, evolution, and development?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.082,
    "end": 3103.062,
    "text": "So awesome points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.103,
    "end": 3103.463,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.283,
    "end": 3108.946,
    "text": "Real quickly, in terms of the time issue, it seems like there's these multiple ways that time comes in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3109.227,
    "end": 3111.108,
    "text": "It's like one sense of like the sense of time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3111.795,
    "end": 3119.376,
    "text": " as you might be doing accumulation based on the frequency with which you're having meaningful informational events.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3120.277,
    "end": 3123.037,
    "text": "Like Bud Craig calls it these global emotional moments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3123.857,
    "end": 3135.399,
    "text": "And Anil and others have some, I think with Murray Shanahan, have some interesting models of the sense of time in terms of the amount of information flux through your sensors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3136.039,
    "end": 3138.88,
    "text": "But then there's another kind of time that might actually involve",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3140.473,
    "end": 3150.222,
    "text": " Over spatial ization of a trajectory and you might be using something like path integration in terms of like how you're doing some types of duration estimation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3151.043,
    "end": 3159.03,
    "text": "Not necessarily just like accumulating like like a sense of accumulation, but some of it might be like where am I in navigating through a timeline.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3159.758,
    "end": 3162.219,
    "text": " And I think you'll see this reflected in the way people talk.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3162.279,
    "end": 3164.781,
    "text": "And we could dismiss this and say, oh, that's just mere metaphor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3165.321,
    "end": 3187.514,
    "text": "No, I think that metaphor is how we're actually constructing some sense of time, which actually gives us forms of control that we would not have otherwise were we not able to actually extend our minds metaphorically in that way and then be able to basically navigate through spatialized time to keep track of some longer time sequences if we want to plan with respect to them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3189.082,
    "end": 3189.364,
    "text": " Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3189.605,
    "end": 3189.926,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.227,
    "end": 3190.489,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.024,
    "end": 3195.086,
    "text": " Hello, great to see you all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3195.626,
    "end": 3198.049,
    "text": "I was curious in terms of time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.289,
    "end": 3214.523,
    "text": "Well, one of the things is, do you think time is, or this process is distributed around different parts of the sensorium processing because different sensorium have different speeds or different rates or different abilities?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.584,
    "end": 3219.447,
    "text": "And then the other thing coming back to time as well is people can be going through time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.54,
    "end": 3230.204,
    "text": " They can be like, or they can be, time can come towards them, or time can be sort of developing around them, which often happens in Asian cultures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3231.004,
    "end": 3234.406,
    "text": "Time is seen more as something that's around them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3234.466,
    "end": 3244.45,
    "text": "So I'm curious, like, how these ideas of temporality might link to the ways that we imagine ourselves with our sensorum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3252.355,
    "end": 3280.55,
    "text": " I mean, if it is indeed the case that some forms of the spatialization, if it is the case that spatializing time is happening both in some cases through some fairly abstract metaphorical and linguistic constructions, then this would imply that you should be able to get meaningful cultural differences",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3281.485,
    "end": 3308.862,
    "text": " based on these shared constructions and maybe even some like quasi like warfian effects where like linguistic modifications could actually um change the way people are seeing themselves and others in relation to time with some fairly significant consequences so um our warfian effects to unpack the jargon of just like um you know the idea that the um our thought is constrained in some meaningful way by the uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3309.625,
    "end": 3313.828,
    "text": " constraints and affordances of our language are constraints and affordances on the way we think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3315.789,
    "end": 3318.231,
    "text": "There's like stronger and weaker versions of that hypothesis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3319.712,
    "end": 3320.272,
    "text": "Thank you, blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.639,
    "end": 3350.048,
    "text": " So it's interesting because as we've been talking about like spatial maps and spatial context, like spatial representation, navigating through space, I have been thinking a lot about semantic navigation also, like when we're looking for a thought, when we're looking for, we're navigating, forging for information or, you know, in these context rich domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.488,
    "end": 3352.609,
    "text": "And I just wonder what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.305,
    "end": 3368.137,
    "text": " Is the semantic navigation related to, linked to, is there overlap in the brain in the way that we process semantic orientation and representation and space also?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.538,
    "end": 3369.699,
    "text": "So I'm just curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.241,
    "end": 3373.322,
    "text": "Hashtag maps of meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.406,
    "end": 3401.392,
    "text": " yeah maybe uh i can uh i can respond on this from from my perspective and then i'll probably have to leave you guys um but so i think one of the most important things at least to me uh of of how this this whole endeavor of of constructing this uh and and doing this together with adam is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.272,
    "end": 3423.607,
    "text": " we basically we start off with uh with robot navigation which is from a roboticist perspective it's really like about x and y position and about times and seconds but what we do here is we by by creating this model we basically get rid of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3424.307,
    "end": 3430.854,
    "text": " close tie of being grounded in seconds and meters, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3431.254,
    "end": 3446.068,
    "text": "I think this is one of the most crucial aspects of our model, because it shows that, well, on the one hand, I think we all agree that we don't get born measuring time in seconds and measuring space in meters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.669,
    "end": 3446.809,
    "text": "So,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.99,
    "end": 3464.248,
    "text": " that we actually get at least the framework that also gets rid of these these metrics and just learns to navigate in this more abstract space and if we can get it to work for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3464.707,
    "end": 3477.301,
    "text": " for navigation per se, moving through actual physical space, then I'm pretty sure that we can also extend the model further to navigate any abstract space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.341,
    "end": 3480.524,
    "text": "Because in the end, once we are at the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3482.026,
    "end": 3497.902,
    "text": " once we get the level above our our sensory inputs then everything is in our case just a learned latent thing basically so if we can if we can make this work for physical navigation i think we are already a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.164,
    "end": 3503.71,
    "text": " a big step closer to making it work for any navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3503.77,
    "end": 3509.038,
    "text": "And indeed, we come to the realm of like, okay, I have lots of memories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.498,
    "end": 3514.746,
    "text": "These are tied together somehow because how these memories just came to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3515.512,
    "end": 3519.555,
    "text": " Can I now navigate this space towards the memory that I'm looking for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3520.355,
    "end": 3529.121,
    "text": "Or if you are solving a math problem, how do you navigate the space of math equations to get the solution for this thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.802,
    "end": 3532.043,
    "text": "I think once we get rid of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.264,
    "end": 3551.37,
    "text": " the time and space that are so tight for your sensorium and move towards a more abstract space and be able to navigate that, this is the crucial bit here, I would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.09,
    "end": 3556.012,
    "text": "And so with that, I'd like to thank you for the discussion until now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3556.172,
    "end": 3561.834,
    "text": "I'll try to be there next week as well and join the discussion further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3562.574,
    "end": 3562.994,
    "text": "Thank you, Tim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.184,
    "end": 3566.525,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.825,
    "end": 3567.746,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.766,
    "end": 3576.856,
    "text": "And also speaking to that cultural basis, there was the inch, foot, pound paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.89,
    "end": 3589.513,
    "text": " And that has, in certain places, also coexisted or been complementary or contradictory with the centimeters, grams, second based upon something different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.593,
    "end": 3596.554,
    "text": "And what would happen if a larva was born and the little one, the second, was like what we call three seconds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.174,
    "end": 3599.055,
    "text": "Is that just a more chill larva?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.615,
    "end": 3600.355,
    "text": "Because every...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.175,
    "end": 3603.618,
    "text": " One of its moments is taking a few more heartbeats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.738,
    "end": 3605.66,
    "text": "It can actually take a breath per little one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.22,
    "end": 3620.454,
    "text": "So there's a lot that we probably don't even know how much we don't know until we're in feedback with these models that both fully realize not just in the equations, but in the actual robotics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.215,
    "end": 3650.154,
    "text": " grounding us in those actual observations of red green blue pixel intensities which is like what adam was saying that robotics are are an empirical platform to be studying the nature of cognition and brain and mind and then here is where we move into a different space and time and so that is an excellent point by tim stephen yeah so following on from what you're saying daniel is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.249,
    "end": 3655.69,
    "text": " I know Tim just mentioned about, you know, have the abstracted ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.87,
    "end": 3661.571,
    "text": "But there's also maybe the grounded, you mentioned grounded ways of knowing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.991,
    "end": 3667.433,
    "text": "So it might be that the future we abstract out what we think it might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3667.573,
    "end": 3672.053,
    "text": "And then there may be ways where we feel what's right, what feels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3672.594,
    "end": 3673.494,
    "text": "So you hit a door.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3674.642,
    "end": 3679.186,
    "text": " and you feel there's an information affordance and it can ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3679.746,
    "end": 3698.842,
    "text": "So I was wondering how much that supports not needing to have the metrics, like you say, and maybe the metrics that we've created, like the second, are partly because they're at that kind of sweet spot or somehow close to a sweet spot of what sort of makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.342,
    "end": 3702.064,
    "text": "You know, someone had to decide on a foot or a hand, you know, so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3703.444,
    "end": 3705.885,
    "text": " Was it the small person's hand or was it the big person's hand?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3705.925,
    "end": 3708.006,
    "text": "And they sort of said, well, what about John?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3708.026,
    "end": 3709.686,
    "text": "And maybe he was the king.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3709.726,
    "end": 3710.167,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3711.347,
    "end": 3712.988,
    "text": "But it got decided somehow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.088,
    "end": 3716.749,
    "text": "So I think this is a good question about grounding versus abstraction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3716.789,
    "end": 3719.53,
    "text": "I don't know what the thoughts are on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3720.751,
    "end": 3720.951,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.563,
    "end": 3733.126,
    "text": " This higher level in a purely metric model, it could be like, well, on the bottom level, we're dealing with centimeters and 100 millisecond frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.686,
    "end": 3739.868,
    "text": "And the coarse graining is at the level of 100 times the spatial distance and 100 times the temporal distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.69,
    "end": 3744.172,
    "text": " What this model is doing is something different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.272,
    "end": 3758.386,
    "text": "And I think that is, again, this biological inspiration, which is that what is happening in the level that the action perception loop is nested within is not just a bigger version of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.787,
    "end": 3780.016,
    "text": " Well, it both is and isn't because it has some resonance graphical structures that support the composability and attractability of act-inf models, yet also it's doing something that's categorically different, which is navigating in a more topological space rather than the more geometric space down the bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.456,
    "end": 3784.878,
    "text": "What are you thinking about, Adam?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3787.239,
    "end": 3787.999,
    "text": "It seems like with the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3788.9,
    "end": 3814.122,
    "text": " well i guess one is i suspect it is me on no coincidence that seconds are about the time extent that they are and that we have like the metric units we use like a foot or a meter or a yard in terms of like in terms of grounding and in terms of connection to affordance it's like a second for maybe you know um a relation to a certain",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3815.037,
    "end": 3838.001,
    "text": " maybe like a heart rate or certain like biophysical pattern generators, or like the scope of working memory being an iconic memory, being stable on different scales or like a yard or a meter, like the, basically the reach that you'd have your arm, like, like Perry personal space and like a field of affordances around your body where it's particularly concentrated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3840.342,
    "end": 3840.562,
    "text": "And so,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3841.577,
    "end": 3851.961,
    "text": " These are ways in which the granularity of our modeling would be influenced by language, or language would reflect it and maybe, to different extents, influence it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3852.041,
    "end": 3860.305,
    "text": "But you would have this other kind of granularity of space that might be different for different species, but also within a species and within an individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3861.005,
    "end": 3869.649,
    "text": "For instance, the hippocampal system will lay out these tilings of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3870.976,
    "end": 3880.825,
    "text": " For a task domain and they'll have like a kind of they'll be refreshed like maybe it looks like like every like three seconds or so, but if you're in like a big space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3881.806,
    "end": 3892.156,
    "text": "But this tiling will actually have hexagonal arrays or hexagonal time it'll fill whatever space it's in and it'll have different levels of granularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3893.037,
    "end": 3896.74,
    "text": "And so, if you're in like a big space it's going to necessarily be less granular.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3897.25,
    "end": 3901.592,
    "text": " And if you're in a small space, it'll probably be more granular.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3901.612,
    "end": 3903.954,
    "text": "And there's other things that will influence the granularity also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3905.655,
    "end": 3910.437,
    "text": "There's a brainstem locomotor nuclei that are detecting how fast are you moving.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3910.698,
    "end": 3915.16,
    "text": "And then this will influence the granularity of your of space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3916.021,
    "end": 3918.902,
    "text": "And so that's some of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3923.547,
    "end": 3942.42,
    "text": " some of this what is relevant, some of this are greening of a domain, some of it will be reflected by these basically innate architectural inductive biases, and some of them will be more socioculturally constructed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3945.729,
    "end": 3953.371,
    "text": " One thing before moving on is I like how Tim, as he left, that was one hell of a mic drop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3953.951,
    "end": 3972.656,
    "text": "So he's already solved, in terms of kinds of grounding, not only is this potentially a way of having an architecture capable of navigating conceptual domains and abstractions, basically what Bengio calls System 2 AI,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3974.056,
    "end": 3975.837,
    "text": " or what some would call strong AI.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3977.859,
    "end": 3982.703,
    "text": "But it's also grounding in that it actually works as a control system for an embodied embedded agent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3983.403,
    "end": 3999.135,
    "text": "And so now you might have a single system capable of both giving you symbol grounding by allowing something to be in the world alongside other agents and have actual semantics in terms of pointing to things in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3999.155,
    "end": 4001.036,
    "text": "So you can have a semantic network",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4002.589,
    "end": 4004.009,
    "text": " Just like symbols pointing at symbols.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4004.469,
    "end": 4011.891,
    "text": "But ultimately, such a system would allow you to ground up your semantic network in things in the world and shared symbols.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4013.451,
    "end": 4019.852,
    "text": "And so, I mean, ultimately, this is a path to, you know, who knows how far, you know, anyone working on it today gets.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4020.192,
    "end": 4028.093,
    "text": "But this is ultimately a path to AGI built that takes on an activist principles of what you would need to do so.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4029.314,
    "end": 4031.194,
    "text": "Which is more than a little exciting, I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4032.262,
    "end": 4034.884,
    "text": " Oh, I'm starting to see why people are interested in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.925,
    "end": 4057.256,
    "text": "Excellent point about the symbolic semantics and logic and how that connects to the inactive insight, the pragmatic turn, ecological psychology, biosemiosis, all of these features that get left on the cutting block if we take a computational linguistics approach only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.977,
    "end": 4061.319,
    "text": "Computational linguistics plus the mouth movement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.344,
    "end": 4074.38,
    "text": " already one has incorporated that pragmatic turn in that embodiment element and that's quite a different model than just the substrate independent symbol manipulator stephen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.97,
    "end": 4085.957,
    "text": " Yeah, I think it's exciting, indeed, because it can open up a lot of... I'm really interested in mental space psychology and peripersonal space and working with space as an instrument.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4086.357,
    "end": 4088.378,
    "text": "And, well, I'm more than interested in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4088.438,
    "end": 4091.661,
    "text": "That's my main focus in many ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4093.062,
    "end": 4099.106,
    "text": "But what's really been the challenge is giving it a plausible bridge, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4099.886,
    "end": 4103.629,
    "text": "Because they're working primarily, you're looking at what action policies are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4105.099,
    "end": 4106.5,
    "text": " and what has been enacted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4107.801,
    "end": 4112.664,
    "text": "And it's very hard to go back to observations because you're coming from the other direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4112.764,
    "end": 4120.109,
    "text": "So I think it'd be really interesting to see what this robot, whether you could actually see, well, what kind of robot is this robot?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.07,
    "end": 4121.81,
    "text": "What's it like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.911,
    "end": 4126.994,
    "text": "What kind of story patterning gets triggered by this robot?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4127.034,
    "end": 4127.694,
    "text": "And maybe if I...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.966,
    "end": 4154.354,
    "text": " it grew up with a slightly heavier wheel on one side or something it has a slightly different um character you know so i mean i wonder if there's a kind of an actual uh a way that the action policies themselves start to encode a certain personality based on the physicality and sensorum that get weighted",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4158.638,
    "end": 4167.905,
    "text": " I mean, that would be like, in terms of this generalization of slam principles as a way of understanding cognition more generally, I think that would be a great test case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4168.385,
    "end": 4171.167,
    "text": "And those are the kinds of hypotheses you would look for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4171.187,
    "end": 4178.672,
    "text": "If your wheel is weighted more heavily on one side or the other, that could have all sorts of things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4178.692,
    "end": 4188.199,
    "text": "For instance, what Tim was describing with this node creation, where it's not just a function of metrics, but on",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4189.508,
    "end": 4190.048,
    "text": " information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4191.169,
    "end": 4211.939,
    "text": "And the and so this creates like a distorted space, but but an adaptively distorted space, you would expect usually, because multiple forms of value are influencing the granularity of this sort of space, like necessarily is like a map, it's like space is a graph, but but a graph being shaped by multiple kinds of value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4212.919,
    "end": 4216.361,
    "text": "And so you would expect things like like that kind of real asymmetry you're talking about to result",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4217.23,
    "end": 4219.574,
    "text": " in different kinds of graph spaces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4220.175,
    "end": 4227.408,
    "text": "And this could then potentially have some transfer more generally across more than just physical spaces in theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4228.91,
    "end": 4229.171,
    "text": "Also,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4230.414,
    "end": 4236.697,
    "text": " Coming back to that granularity issue, let's say the way you move through the world is quicker or slower.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4237.358,
    "end": 4257.287,
    "text": "That itself then might have transferred not just to, well, how is it that I'm representing the space I'm physically moving through, but that then can get reflected in cognitive styles in terms of the way you relate to semantic spaces, in terms of the way you're going to forage through them, what you consider to be near or far connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4257.807,
    "end": 4258.928,
    "text": "This is the kind of...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4260.674,
    "end": 4271.681,
    "text": " that would be like a whole research program, which would be, but using this as like a source of bridging principles of like, so some connection between embodied experience and then more abstract thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4272.321,
    "end": 4285.409,
    "text": "Well, maybe this is a source of some of the ways in which concrete embodied experiences go on to shape basically thought on the more abstract level as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4290.151,
    "end": 4307.097,
    "text": " very very interesting and especially when we think about the mental action papers that we've read like live stream number 25 with sanford smith et al about metacognition as mental action and so in this two-level robotics case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4308.36,
    "end": 4332.632,
    "text": " talking about the sort of lower level motion and then the higher level navigation of locations where we can say i want to go to the post office and then the grocery store but then we have this more tactical taking a step time scale that's a lot faster if this bottom layer is based upon cognition and perception also this higher level is not just navigation in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.985,
    "end": 4339.508,
    "text": " the warehouse, that's actually like, where do I want to be in my regime of attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.108,
    "end": 4343.209,
    "text": "Or what would I like to be considering from a metacognitive perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4343.549,
    "end": 4347.771,
    "text": "How do I navigate to a place where I prefer what's healthy for me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.432,
    "end": 4360.517,
    "text": "So there's all kinds of other questions about navigation in parameter spaces that are not just like topologically the cousin of the warehouse space, but truly in the mental space fully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.318,
    "end": 4362.178,
    "text": "Blue, and then Steve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.867,
    "end": 4374.71,
    "text": " So since we brought up hierarchical here in the paper, it looks like and I mean, I can hold this for Tim, Adam, too, if you don't feel comfortable talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.77,
    "end": 4378.851,
    "text": "But maybe maybe you're good in the hierarchical space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.551,
    "end": 4382.892,
    "text": "It seems that it's just a core screening like in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.838,
    "end": 4390.524,
    "text": " So like, you know, the higher level is just like a coarse grained version of what happens at the lower level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.365,
    "end": 4397.371,
    "text": "And it's easy to see how that takes place or take shape in like a topographical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4399.683,
    "end": 4402.244,
    "text": " it doesn't leave a lot of room for emergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.504,
    "end": 4415.587,
    "text": "And I wonder, like, if we jump to thinking about a semantic space, you know, we have words and we've got the relationships with words to each other, proximity, you know, how close do you expect to find, you know, there to was or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4415.907,
    "end": 4419.108,
    "text": "So how linked are the words together in a semantic space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.548,
    "end": 4426.05,
    "text": "But I wonder if, you know, you can go into topic modeling and that gives you like a kind of a core screening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.456,
    "end": 4431.618,
    "text": " But is there more room for emergence in that kind of space, maybe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.638,
    "end": 4443.103,
    "text": "Or what other, how do you, I don't know, how would you just allow for emergent things to come through in this kind of hierarchical modeling or mapping?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.564,
    "end": 4453.747,
    "text": "I think when Tim comes back, it could be worth it for him to go into more detail on the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4454.917,
    "end": 4460.2,
    "text": " parameters that go into node creation or not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4461.06,
    "end": 4470.825,
    "text": "Because I feel like to the extent that you're getting some flexibility in ways of understanding like emergence, that would be your models of emergence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4470.925,
    "end": 4478.028,
    "text": "And that would be like where you would basically create this coarse grained ontology of different levels of granularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4479.149,
    "end": 4479.329,
    "text": "What",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4481.614,
    "end": 4484.956,
    "text": " what constitutes like an occasion for core screening of what kinds?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4487.998,
    "end": 4497.064,
    "text": "It seems like the node creation would be where your, your assumptions about that of what kinds of emergency you might be dealing with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4498.705,
    "end": 4500.185,
    "text": "That's where we'd come into this kind of model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4501.326,
    "end": 4509.211,
    "text": "Is it rich enough to account for like all, I wouldn't quite say that in terms of like, you know, all the different forms of emergency you can get.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4510.312,
    "end": 4510.992,
    "text": "So some of it, you know,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4513.194,
    "end": 4519.6,
    "text": " But by enough, I mean enough to be a full on general intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4520.16,
    "end": 4530.65,
    "text": "But I do think there is room for some flexibility there at that parameterization of Tim's model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4531.13,
    "end": 4533.613,
    "text": "But he would explain it better than I would.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4536.007,
    "end": 4555.024,
    "text": " i'll make a comment and then ask a question in the chat and then also see you steven so um it was mentioned that uh there is the embodiment of certain prior information in the continuous attractor network like if my position is this and i move forward then that is putting me into this different position in the can and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.965,
    "end": 4558.828,
    "text": " Blue asked about topic modeling and semantic spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.028,
    "end": 4561.33,
    "text": "So that territory is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.53,
    "end": 4564.133,
    "text": "So the maps should be appropriately different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.713,
    "end": 4570.499,
    "text": "And so we could say, for example, like California is nested within the United States.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.259,
    "end": 4574.242,
    "text": "That is not violating any geographical priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.822,
    "end": 4577.925,
    "text": "But what about a paper that's interdisciplinary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.803,
    "end": 4593.529,
    "text": " that might be at the intersection of two different topics, or depending on how those topic models are generated, one could think of every paper as existing across 100 different topics to different quantitative amounts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.149,
    "end": 4607.234,
    "text": "And so it actually does bring us to this question, which Sid has asked, which is we're hearing a lot in the paper, in the natural speech and so on, different complementarities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.59,
    "end": 4630.963,
    "text": " lower and higher so here where the lower model is the finer scale and the the red i'm trying not to mix metaphors but lower and higher is sometimes used with inner and outer or finer and coarser coarse graining more specific more general so what is that restaurant where those are the dishes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.305,
    "end": 4658.142,
    "text": " could it something be above or below and you get it but it could also be more like a kernel and more like the fruit and you get it and it could be more like sand or more like gravel and you would get it what does that mean or say we'll think and then allow adam to speak first",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.867,
    "end": 4684.767,
    "text": " I think that's a deep and complex question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4685.388,
    "end": 4689.708,
    "text": "And there's a couple of levels or a couple of entry points there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4689.748,
    "end": 4696.57,
    "text": "But one thing is, like you mentioned, like inner and outer is another way of describing as opposed to higher and lower.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4696.99,
    "end": 4710.673,
    "text": "And there's a, I think, connection between this latent slam architecture and meta learning, where you're having like a more fine grained process for like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4711.929,
    "end": 4716.413,
    "text": " that's more task specific and for like adaptive fine grained couplings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4716.493,
    "end": 4726.721,
    "text": "But then you nest that or you create like an outer loop, which is like a slower aggregation process that's coarser, but then allows for sharing of information across episodes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4727.602,
    "end": 4736.469,
    "text": "So it's a kind of like so this is basically a kind of meta learning system and giving you this divide and conquer approach of like levels of granularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4738.09,
    "end": 4738.651,
    "text": "I don't think",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4739.321,
    "end": 4743.884,
    "text": " anyone quite knows yet what the significance of this is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4744.064,
    "end": 4754.511,
    "text": "But one interesting thing about the grid cells is they seem to have a multi-scale hierarchy in their organization in terms of there's this axis.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4755.272,
    "end": 4767.92,
    "text": "I believe as you go within entorhinal cortex, as you go more dorsal to ventral or more superior to inferior,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4769.798,
    "end": 4784.465,
    "text": " you'll get these discrete cutoffs of potentially implying some kind of harmonic nesting of scales, maybe even coupling with multi-scale synchronous dynamics in cortex, unclear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4785.805,
    "end": 4796.95,
    "text": "But there does seem to be these multiple scales reflected in grid scales, in internal crystals having different levels of granularity of their spatial representations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4803.191,
    "end": 4830.437,
    "text": " And the thing that's interesting, I'm curious about is like, what are the, or one thing I'm curious about is like, to what degree, for instance, do different like neuromodulator systems, like some of the ways in which like they could be understood in terms of like them having their functions is maybe like influencing which granularity is most present, like moving into like now in a situation of like attending to like the fine granules and, or,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4831.078,
    "end": 4835.24,
    "text": " this is a situation where we're going to really go course and just ignore those details.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4835.8,
    "end": 4848.145,
    "text": "And that some neuromodulatory systems, their effects on neural dynamics might actually be best explained, might be well explained in terms of this adaptive changing of the granularity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4851.513,
    "end": 4852.973,
    "text": " Very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.233,
    "end": 4860.035,
    "text": "And we see that in teamwork where sometimes it's time to control paste and just fill out the spreadsheet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.095,
    "end": 4862.836,
    "text": "Other times it's time to add a column to the spreadsheet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.276,
    "end": 4874.379,
    "text": "Other times there are this open-endedness to the task and including the local objectives and also even broader mission and one's own relationship to the team and the project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4876.772,
    "end": 4888.296,
    "text": " perhaps if there's a similar biological substrate, then it would stand to reason that there could be multiple representations that are emitted from some kind of common generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4888.937,
    "end": 4889.237,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.038,
    "end": 4905.943,
    "text": "So one thing that I'm actually really interested in is exploring these SLAM principles in the insect case, because they have analogous and potentially largely homologous systems with the central complex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4907.168,
    "end": 4919.473,
    "text": " And I feel like that's an area I'm looking to look into next is to really understand these things, not just looking at the mammal case, but I want to look at the insect case with the central complex and see the similarities and differences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4920.013,
    "end": 4922.334,
    "text": "What special adaptations were there?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4922.354,
    "end": 4926.976,
    "text": "To what extent are the functions realized by similar means or different means?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4927.076,
    "end": 4935.34,
    "text": "But in terms of a way of understanding things like that neuromodulator hypothesis of influencing the granularity of spatial modeling,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4936.167,
    "end": 4954.002,
    "text": " It's possible, although I wouldn't necessarily bet on it based on conversations with you, David, but it's possible that you're getting extensive homology and common significances for things like flexible influence of the granularity of the forging parameters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4954.582,
    "end": 4959.026,
    "text": "It's possible those are remarkably conserved and that you might actually see them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4959.682,
    "end": 4966.763,
    "text": " That being said, like you also were alluding to, though, the SLAM instance is different in insects in that this is a multi-SLAM.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4967.983,
    "end": 4973.384,
    "text": "In general, there's a lot of multi-SLAM happening in vertebrates also, but I think not to the same degree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4973.464,
    "end": 4987.707,
    "text": "And so you might expect some potentially substantial differences there as a result of the SLAM problem having that additional set of challenges and sources of information it can leverage.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4989.71,
    "end": 4994.593,
    "text": " I can't wait for solitary wasp slam and eusocial colony slam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4995.334,
    "end": 4995.614,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4998.296,
    "end": 5014.146,
    "text": "From what I'm hearing, you could correlate these multi-slams to regimes of attention in many ways, because that could dictate the nature of these granularities and where they are in the space, in the place, in the body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5017.697,
    "end": 5044.563,
    "text": " we often assume i think when blue was saying there about there's there's inner outer and the some of those are also false assumptions that that rolls out over everything that we assume so in the sense that inner is purer and higher is purer but often um that might depend on the multi-slam that's been dunked at the time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5046.741,
    "end": 5051.065,
    "text": " Yeah, like coarser and finer, slower and faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5051.606,
    "end": 5060.855,
    "text": "So one interpretation would be that the slower timescale is the coarser graining in the sense that it's like seconds, not milliseconds, and the finer is the faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.597,
    "end": 5071.963,
    "text": " but there's also maybe an interpretation where actually the, if you're clicking up mile by mile instead of foot by foot, that is actually moving faster and it's coarser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.463,
    "end": 5076.105,
    "text": "And if you're counting grains of sand at a time, it's finer and slower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5076.665,
    "end": 5088.592,
    "text": "So I think even sometimes the direction that one interprets is not there, but it doesn't remove the dialectical nature or the intermodal nature, but the way that, is it gonna be like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5091.175,
    "end": 5097.018,
    "text": " A sugar with all the OHs pointing down or all the OHs pointing up or some blend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.339,
    "end": 5103.962,
    "text": "It has to go one way or the other, but maybe it doesn't have to be any one specific way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.783,
    "end": 5104.963,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.671,
    "end": 5127.599,
    "text": " So I am wondering, and this is also interesting in terms of the insect case, if there's some kind of, maybe like a generic, free-installed, readily adaptable, coarse-grained version of a place cell that's just kind of there as a generic representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.419,
    "end": 5137.589,
    "text": " Like a perfect example, I mean, when you're thinking about core screening, like a map and a location, like you know where everything is in your house, like you know where your bathroom is and you know where all the things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.41,
    "end": 5146.6,
    "text": "But, you know, when you travel, you have an expectation, even if you've never been to the hotel before, you have the expectation of what the elevator is going to sound like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.0,
    "end": 5172.03,
    "text": " how the carpet all looks the same with that funky weird pattern and the hallways twist and turn and like when you get into the hotel room there's going to be a bathroom and there's going to be a window and there's going to be a bed and a tv and a remote so you have this like pre-generic supposition of how the hotel is going to look does that live in a play cell somewhere that just like morphs into oh the bathroom's here and the light's here so that you're not stumbling around in the middle of the night like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.49,
    "end": 5179.278,
    "text": " And similarly, like there's all kinds of, when you go out hiking, you know, you expect there to be trees and rocks and stuff outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.319,
    "end": 5188.389,
    "text": "And so do you just like mash your map onto like some preexisting generic place holder, a place cell place holder?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.409,
    "end": 5190.212,
    "text": "It's interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.345,
    "end": 5198.206,
    "text": " it's like a prior for the abstract space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.226,
    "end": 5203.687,
    "text": "It's a prior distribution over hotel rooms, which is totally encultured and totally based upon experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.327,
    "end": 5211.89,
    "text": "And then either one is surprised or not, just as when any other prior meets sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.39,
    "end": 5214.81,
    "text": "Adam, what do you think of that, Steve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.991,
    "end": 5224.293,
    "text": "I mean, these are details that are definitely like half or beyond the edge of anything I or maybe anyone knows.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5224.373,
    "end": 5224.613,
    "text": "But the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5227.838,
    "end": 5240.0,
    "text": " I guess just like these, how many different, so one way that these place fields are sometimes modeled is in terms of like these like chained attractors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5240.781,
    "end": 5247.062,
    "text": "And so like within the hippocampal system, like you can get like this highly recurrent activity, especially in some of the subfields.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5248.242,
    "end": 5254.763,
    "text": "And you can set up like this set of these densities of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5257.308,
    "end": 5279.464,
    "text": " recurrent activity and then you can have like information kind of moving between them as a like predictive map not just of like not just like here's the things but you know people debate how the best things like Gershman talks about successor representations but that there's a transition structure of which attractor will act which of the places will activate first in the sequence and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5281.374,
    "end": 5309.064,
    "text": " And so I guess the question, the question I'm wondering is like, so like, you know, you're encountering like a new scene and you're like laying down like a set of landmarks or a tiling of space, like to what degree is this information encoded in, in what circumstances and to what degree is it encoded in like the local connectivity within the hippocampal system and whether you're getting like this set of schemas that you're going to like draw up like the most similar one based on",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5310.146,
    "end": 5338.045,
    "text": " some like degree of similarity will cause like one attractor network to get pulled up over another and now this is the timeline you're working within and this is like the policies the the policy set you're like would be pulling from and this is your framing of the domain um or to what degree is it relying more heavily on like the moments and moments um like cortical dynamics and like the mental simulation that might be happening and like to which extent like is it constrained",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5339.301,
    "end": 5344.483,
    "text": " by the history of plasticity within the hippocampus, what schemas are going to be operative?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5345.984,
    "end": 5360.311,
    "text": "And to what degree is it more of a negotiation where it's going to be more ad hoc, more determined by the moment-to-moment contingencies and this funneling through the whole cortical virtual reality machinery or whatever you want to think of it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5362.192,
    "end": 5363.392,
    "text": "And to what degree is this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5364.293,
    "end": 5365.073,
    "text": "There's not one answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5365.093,
    "end": 5367.274,
    "text": "This varies both across and within individuals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5368.007,
    "end": 5384.28,
    "text": " that this is actually like a core aspect of cybernetic functioning is actually leaning more heavily on the priors or the current of established over more learning ethics or leaning more on the situationally specific factors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5384.8,
    "end": 5387.603,
    "text": "Like how much do you shoehorn what's going on into your existing schemas?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5388.163,
    "end": 5388.964,
    "text": "How much do you simulate?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5389.004,
    "end": 5389.925,
    "text": "How much do you accommodate?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5390.405,
    "end": 5394.688,
    "text": "And that this being potentially like a flexible parameter and maybe some of that flexibility is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5395.925,
    "end": 5418.375,
    "text": " like baked into the logic of neuromodulators like actually flexibly influencing this uh unclear but like yeah so very very edge of anything i know but it's it's very much like part of the excitement for me is like wondering like is this like um does this provide like like a functional and algorithmic significance for like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5419.221,
    "end": 5423.187,
    "text": " this otherwise just mess of biological details?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5423.527,
    "end": 5429.996,
    "text": "Do some of them have elegant cybernetic understandings by virtue of thinking of these kinds of questions?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5431.558,
    "end": 5432.539,
    "text": "Can I just respond really quick?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.9,
    "end": 5433.441,
    "text": "Yes, please, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.246,
    "end": 5454.494,
    "text": " That made me think a whole bunch about like, maybe we don't need a map, a place self for each individual hotel room, but it's like a node when we were discussing nodes earlier, like a coarse grained, just an attractor space, like dump all of the hotel room maps into this little nodule so that when you get to a hotel room, it's all the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5455.434,
    "end": 5479.091,
    "text": " thing like it's okay i've been here before even if you've never been to that kind of place and and that would kind of explain things like deja vu like when you get to a place like i've been here before when did i come here like when you're driving down the street didn't i just drive down the street you it just is lumped over there into that little attractor mesh node that that's not necessarily a specific place but just like a squishy ball of similar places",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.155,
    "end": 5493.773,
    "text": " And also, I really love how we spoke about some of these things, Adam, in your collaboration with Colin DeYoung, Cybernetic Big Five, in livestream number 13, I think at the beginning of 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.813,
    "end": 5494.434,
    "text": "And now we're revisiting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.634,
    "end": 5500.314,
    "text": " Same but different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.494,
    "end": 5502.476,
    "text": "The more things change, the more they stay the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.516,
    "end": 5512.521,
    "text": "And this idea of like modulatory features of cybernetic systems as being important for variation within and among individuals is just such an essential point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.561,
    "end": 5516.503,
    "text": "And it's so true that a lot of the details are yet to be resolved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5517.043,
    "end": 5517.283,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5519.024,
    "end": 5526.488,
    "text": "Yeah, you could go a bit further still, because what if you don't have maps put to one side, but there's action policies",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5527.833,
    "end": 5552.241,
    "text": " actually have interest in how much this is feasible but action policies that recapitulate something like a map so like by an embodiment by an inactive chain of or initiation of some actions at different scales it basically recapitulates some sort of uh nascent starting point so you don't have to have any representations there and like when the door is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5553.3,
    "end": 5580.56,
    "text": " engaged the set of actions that that does that creates could open up an effectively a map um so i don't know how much between i mean i know in this model it does start to create a network of attractors but i'm wondering whether how much things could be sparked off from engage in a particular affordance a particular meaningfulness in something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5583.078,
    "end": 5594.527,
    "text": " I mean, there's actually a live debate about the extent to which... So Tolman initially was talking about the hippocampal cognitive map.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5595.208,
    "end": 5608.799,
    "text": "And part of the reason people like to talk about maps is because of the flexibility they give you in terms of if you... Like the map serves as a generative model and it gives you like a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5611.864,
    "end": 5614.645,
    "text": " I can flexibly access it to generate trajectories.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5615.285,
    "end": 5617.686,
    "text": "But you can do that with a well-structured graph also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5617.726,
    "end": 5633.131,
    "text": "But there's a spectrum of interpretations of people thinking that you're dealing with more things that are more map-like and things that are more context-specific and graph-like and flexible and more dynamically constructed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5633.571,
    "end": 5635.272,
    "text": "And it seems like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5639.032,
    "end": 5643.455,
    "text": " It's kind of a cop-out, but in general, I always take every debate, and I'm like, you're probably both right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5643.875,
    "end": 5658.483,
    "text": "And so it's like you want, for the sake of, I guess, maybe stability or for the sake of potentially greater transfer of understandings and inferential power across episodes, you might want something more map-like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5659.243,
    "end": 5665.727,
    "text": "But if you go too map-like, you're losing the ability to deal with the nuances of specific contexts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5666.707,
    "end": 5667.047,
    "text": "And so...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5669.308,
    "end": 5675.292,
    "text": " So this, again, might be different perspectives on the same thing that tend to converge with trade-offs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5675.752,
    "end": 5689.501,
    "text": "You could have more context-sensitive or more situationally invariant representations, and these could reflect cognitive styles and maybe fundamental axes of variation for cognition and sense-making.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5689.521,
    "end": 5693.824,
    "text": "One thing that's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5698.154,
    "end": 5719.18,
    "text": " In terms of like cybernetics, Daniel pointed out like earlier, like, you know, like Jordan Peterson, like part of like, it's actually interesting that maps of meeting Peterson's book was actually heavily informed by Yacht-Pangsepp's affective neuroscience and ecological models more generally, like based on things like animal foraging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5719.661,
    "end": 5727.243,
    "text": "So I actually think that's where Jordan Peterson got that rhetoric about maps is actually from doing a kind of affective neuroscience perspective, grounded",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5728.373,
    "end": 5732.256,
    "text": " in this ecological perspective of foraging animals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5733.217,
    "end": 5736.139,
    "text": "And so, yeah, I think that's actually where that came from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5737.82,
    "end": 5739.321,
    "text": "Yes, very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5739.381,
    "end": 5740.862,
    "text": "And I think I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5740.902,
    "end": 5744.204,
    "text": "We may have even explored as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5744.505,
    "end": 5748.988,
    "text": "In one paper, Reimagining Maps, that I wrote with RJ and a colleague, Mikel,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5750.376,
    "end": 5769.755,
    "text": " we learned about this historical distinction between archival maps and itinerary maps and today we just think about maps as being like one more lumpy category but there's many differences between the map that actually is like a multi-map or mega map and holds a lot of information potentially in a metric way versus the itinerary map",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5770.376,
    "end": 5781.863,
    "text": " head straight until you see the two big trees, then you're gonna wanna take a left, that type of more conversational or casual or navigable map that is highly contextual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5782.383,
    "end": 5789.447,
    "text": "And with current map systems, that's one of the challenges because we have that mega map, it's downloadable, but it's not gonna fit on your phone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5790.007,
    "end": 5797.512,
    "text": "So what is the projection that's contextual and situational that's actually gonna enable effective action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.84,
    "end": 5801.804,
    "text": " that is also going to be perceived as map-like by the user.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5801.824,
    "end": 5802.606,
    "text": "Yes, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.232,
    "end": 5811.153,
    "text": " So this is like a personal attack in question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.693,
    "end": 5822.756,
    "text": "So anybody who spent any kind of time with Daniel knows that he's constantly drawing or writing or writing things down, like all the time, taking notes, taking notes, taking notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5823.136,
    "end": 5830.818,
    "text": "And I wonder, like, can you take your notes as like a mental map of where you were at that time that you were making that drawing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.858,
    "end": 5831.738,
    "text": "Like, does it like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5832.558,
    "end": 5836.864,
    "text": " recapitulate your conversations that you were having, the ideas that were running through your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5836.884,
    "end": 5843.813,
    "text": "Can you use these drawings that you're always doing as a kind of conversational mental space map?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5846.516,
    "end": 5848.278,
    "text": "If anything, it's the opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5849.19,
    "end": 5851.131,
    "text": " I just leave the thought behind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.171,
    "end": 5855.132,
    "text": "And if we look at this, I think, okay, something happened by which we wrote this down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5855.152,
    "end": 5861.294,
    "text": "It would be awesome if there was many people with their regime of attention on taking live notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5861.394,
    "end": 5866.996,
    "text": "I know that's not an approach for everybody, but then we could all look at that shared pheromone distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.876,
    "end": 5869.557,
    "text": " and then make it new again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.998,
    "end": 5876.382,
    "text": "And maybe we remember our exact previous thought, though that's impossible, or unlikely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5876.963,
    "end": 5882.407,
    "text": "But instead, we can make the relationship with the material and with those notes like new again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.608,
    "end": 5883.868,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5886.31,
    "end": 5889.212,
    "text": "Yes, maybe a little harder to categorize with language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5889.272,
    "end": 5897.078,
    "text": "But in a way, it's the traces of your action policies, even if it was capturing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5898.462,
    "end": 5899.543,
    "text": " The interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5899.603,
    "end": 5904.485,
    "text": "So one thing I'm very interested in is how we realign things to action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5905.885,
    "end": 5911.508,
    "text": "Because we've kind of been enculturated to think it's all about thoughts and feelings, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5912.008,
    "end": 5917.671,
    "text": "And because active inference puts it in this other domain, well, what does that mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5917.691,
    "end": 5924.114,
    "text": "And how do we talk about active inference when we're enculturated to think through other things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5925.612,
    "end": 5944.956,
    "text": " natural ways of using english i'm finding that a big challenge myself but i think so as you're laying down those traces are you showing your action policies of how to record something rather than your thoughts if that makes sense and is your thoughts always slightly hidden",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5946.633,
    "end": 5948.054,
    "text": " Yeah, great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.334,
    "end": 5958.38,
    "text": "Just like we were thinking about earlier with a sort of substrate, implicit, agnostic, ignored, linguistic, symbolic models, like a Turing tape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5958.44,
    "end": 5961.362,
    "text": "It has infinite space and it can just make infinite grammar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.402,
    "end": 5964.484,
    "text": "And so that sort of purely symbolic approach to language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5965.788,
    "end": 5968.65,
    "text": " and then its relationship to thought and experience is one question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5969.191,
    "end": 5984.023,
    "text": "But when we think about finite actual sequences of language use and deployment as action, either keyboard typing or assisted typing technology, or speaking as also a motor action,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5984.964,
    "end": 5996.028,
    "text": " it totally changes the game because we're not just in this forest of infinite plausible grammars, but rather one realized and preferred action sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5996.088,
    "end": 6000.469,
    "text": "And then, of course, thoughts are unobserved, but the actions are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6000.549,
    "end": 6001.47,
    "text": "And that's the whole...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.23,
    "end": 6023.305,
    "text": " um quantum reference frame and share generative model and rhetorical nature narrative nature of cognition and so indeed the the action insight I think is going to be something that we'll keep returning to um we'll have a final closing the plane or whatever and um I'll also just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6025.41,
    "end": 6054.146,
    "text": " give a little preview which is that next week we're going to be having a guest stream with Adam so if it relates at all Adam how does it relate what is the guest stream going to be about and then um perhaps in your absence what would be exciting to discuss in 42.2 um no you're right there is a guest stream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.736,
    "end": 6056.017,
    "text": " A quick thought though.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6056.738,
    "end": 6064.826,
    "text": "So like Blue, you were suggesting like Daniel's notes could serve almost like a kind of memory palace and accessible map.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6065.246,
    "end": 6072.052,
    "text": "And then Daniel, you're saying it's more like a stigmatistic mechanism for coordination, like with pointing and cueing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6073.434,
    "end": 6074.615,
    "text": "And that's interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6077.034,
    "end": 6084.756,
    "text": " I wonder if when people are reading books, the ability to use the book as a map slash palace gives you better retention than something like a Kindle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6085.517,
    "end": 6087.077,
    "text": "Like the book is like a physical object.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6087.437,
    "end": 6091.398,
    "text": "Anyways, so oh yeah, free will.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6091.578,
    "end": 6100.241,
    "text": "And so for next week, I would say that basically, so my over hypothesis is that many of the details",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6104.444,
    "end": 6129.992,
    "text": " that Tim is using for these systems will end up being relevant as abstract interpretations of the core parameters of us as active inferential cybernetic systems, both with respect to basically the basics of it lets us be in the world in an embodied way as living robots.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6132.887,
    "end": 6139.71,
    "text": " also in terms of their extension to high-level cognition, scaling active inference to more complex domains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6140.61,
    "end": 6158.098,
    "text": "And so in general, I'm trying to understand with limited success as many details as I can of Tim's work, because I think it's just some of the most promising sources of constraints we have on inference interpretations and sources of hypotheses.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6159.016,
    "end": 6180.667,
    "text": " basically whatever details tim is willing to get into i think it would be well well worthwhile to try to grok those and that's what i'm that's what i'm doing um in terms of uh next week uh so some of this is relevant in that um the basic idea would be that um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6181.454,
    "end": 6210.924,
    "text": " these LeBay phenomenon, these studies in which people are seeing these slowly building potentials leading up to action that have predictive information, but where they peak in advance of people claiming that they have decided to take actions and where these studies are interpreted as evidence that people don't have free will and we can get into all sorts of conversations about how it makes sense to think of free will in different ways, whether it makes sense to talk about it at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6212.094,
    "end": 6222.36,
    "text": " but that these studies are usually interpreted as saying that your consciously experienced mental states cannot enter causal streams leading to action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6223.261,
    "end": 6231.226,
    "text": "And so what I'm suggesting is that is not the case and that there's multiple ways in which your subjective states are meaningfully causal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6231.886,
    "end": 6237.63,
    "text": "If we think of what's leading up to something like deciding to move your hand in like a labette experiment,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6238.391,
    "end": 6263.693,
    "text": " if that is reflecting a buildup of model evidence over your proprioceptive pose or of you deciding to take that action this kind of evidence accumulation if it's occurring via sophisticated affective inference that this would be a way of understanding it and that part of what would influence how much buildup or not you get would be the specifics of this basically deep tree search",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6264.753,
    "end": 6279.742,
    "text": " from sophisticated, that we might understand as sophisticated affective inference, as being orchestrated by the hippocampal and entorhinal system as iterative mental stimulation, where you're sampling out these different possibilities of, hmm, what would it be like if I move my arm or not?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6280.362,
    "end": 6290.429,
    "text": "And then you're then evaluating that, and you're peeling off these different counterfactuals, and that if across these you get enough",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6292.259,
    "end": 6314.965,
    "text": " affective charge associated with going down some of these forks eventually this results in threshold crossing but the idea would be that this would be relevant to some of the hippocampal slam work and that you can think of this imaginative planning stage leading up to even seemingly spontaneous actions you can think of this like imaginative phase as being largely orchestrated",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6315.857,
    "end": 6333.507,
    "text": " by the hippocampal system which might be best understood as a general system for uh or a system for generalized foraging and mapping i don't know if that made sense but that's like some of the connections wow if you still want to come for the guest stream you're welcome to do so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6334.702,
    "end": 6336.642,
    "text": " No, thanks for the awesome summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6336.682,
    "end": 6339.803,
    "text": "And I know that we'll be able to unpack it a lot more next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6341.023,
    "end": 6343.884,
    "text": "Blue or Steven, what are some last thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6343.904,
    "end": 6350.025,
    "text": "What was exciting or interesting to you in where we've been and where shall we forage next?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6352.745,
    "end": 6353.785,
    "text": "So I can go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6354.285,
    "end": 6358.026,
    "text": "I was really interested in taking this into semantic space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6358.086,
    "end": 6362.887,
    "text": "And I wonder what other kind of spaces that we can maybe think about mapping out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6363.995,
    "end": 6367.597,
    "text": " how we build, how we construct maps, cognitive space, and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6367.737,
    "end": 6373.92,
    "text": "And I'm excited to talk to Tim about where Emergence fits into the hierarchical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6375.641,
    "end": 6375.941,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6376.061,
    "end": 6376.561,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6376.842,
    "end": 6377.122,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6377.142,
    "end": 6381.304,
    "text": "Yeah, I think keeping the idea",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6382.216,
    "end": 6391.264,
    "text": " keeping things clean, keeping things nascent and deflatory, even in this case here, is really something I think to continue looking at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6391.544,
    "end": 6398.971,
    "text": "And I'm really curious about what happens when we see that door and that door says you can go down that corridor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6399.631,
    "end": 6401.473,
    "text": "Am I going to go down into a different corridor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6402.694,
    "end": 6404.755,
    "text": " regime of attention, I'm gonna stay where I am.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6404.815,
    "end": 6417.52,
    "text": "So I think that ability to take these principles and say, okay, what is it that happens when I encounter something and it triggers something?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6418.18,
    "end": 6419.161,
    "text": "How much is that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6420.2,
    "end": 6446.862,
    "text": " significant in terms of making things happen and i'm curious then how that can marry with a lot of the mental space work that i do building out metaphor landscapes or actually letting someone explore spatially and one last thing actually that came up and someone said to me that the other day is that he's really curious why when he picks up his plastic pencil it doesn't mean as much to him as when he holds a shell",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6447.944,
    "end": 6458.129,
    "text": " So there's something about like when that door has got some prior, there's something that you know about being in the woodland versus being somewhere which is dead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6458.989,
    "end": 6477.258,
    "text": "And even that itself could explain a lot about how navigating those places, the eco-psychology of going into a wooded space, a living place, actually can be important for people just in a wellness, what might seem a very woo-woo,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6478.849,
    "end": 6506.681,
    "text": " uh type of stuff actually could be somehow linked to what we're talking about here so yeah brilliant thanks awesome yeah very exciting and fun discussion i really like that last piece which is what i know i'm gonna carry forward and hopefully reflect on next week how will we build that colony is it a memory palace blueprint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6507.893,
    "end": 6526.256,
    "text": " is it stigmatic coordination but how and so somewhere between the um mental Palace Cathedral and the sort of picking up pebbles and having no bigger picture is where we are in our cognitive and social Maps and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6527.762,
    "end": 6542.098,
    "text": " that's quite an area and Adam the central complex modeling I can't wait so thank you all for joining thanks Tim also so Adam Steven and blue and Sid and Dean in the chat so thanks everybody and see you next time",
    "speaker": "SPEAKER_01"
  }
]