[
  {
    "start": 27.145,
    "end": 32.69,
    "text": " All right, hello and welcome to ACT-INF live stream number 42.0.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.43,
    "end": 35.792,
    "text": "It's April 16th, 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 36.933,
    "end": 38.334,
    "text": "Welcome to the ACT-INF lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.755,
    "end": 44.56,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.661,
    "end": 47.422,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.203,
    "end": 52.686,
    "text": "This is a recorded and an archived live stream, so please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 53.587,
    "end": 55.329,
    "text": " All backgrounds and perspectives are welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 55.829,
    "end": 58.792,
    "text": "And we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.852,
    "end": 61.234,
    "text": "And Sid, thanks a ton for joining.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.715,
    "end": 64.157,
    "text": "Really looking forward to this conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.816,
    "end": 71.078,
    "text": " If you want to learn more about Active Lab activities, check out activeinference.org.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.378,
    "end": 83.902,
    "text": "Okay, we're here in Active Lab stream number 42.0, and we are starting to learn and discuss this paper, Robot Navigation as Hierarchical Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.742,
    "end": 107.733,
    "text": " in the journal neural networks october 2021 it's by ozon katal tim verbellen tun van de male bart dote and adam saffron and some of whom we're looking forward to speaking with in the upcoming weeks and this video is an introduction for some of the ideas and just some background and context and uh rapidly assembled fun and memes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 108.413,
    "end": 109.314,
    "text": " that we'll go through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 109.614,
    "end": 117.522,
    "text": "So it's just an introduction of a discussion and we hope that if you're watching live or later that you can still contribute to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.182,
    "end": 122.786,
    "text": "And we're gonna go over the main aims and claims of the paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.615,
    "end": 134.504,
    "text": " then the abstract and roadmap, and then walk through some cool keywords and context, which will be great to hear Sud's perspective from working with robotics, which is an area that certainly I've never actually been involved in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.624,
    "end": 148.134,
    "text": "So going through some of the more applied work that we're going to see with robotics, and also some of the more formal aspects from active inference, and then this third vector that maybe we both share, which is some of the biological basis of navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.494,
    "end": 148.594,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.5,
    "end": 151.781,
    "text": " We're going to just go into the introductions first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.461,
    "end": 152.961,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 153.221,
    "end": 156.222,
    "text": "I'm a researcher in California, and I'll pass to Sid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.802,
    "end": 160.083,
    "text": "So Sid, I'll walk through your slides, but yes, let's hear it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 160.103,
    "end": 163.864,
    "text": "SIDDHARTHA SRINIVASAHADARAMANI, Yeah, let's go to slide nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.004,
    "end": 177.188,
    "text": "And before I even address myself, I would say that we need to address the elephant in the room, that this is livestream number 42, which is one of my favorite numbers and the favorite number for a lot of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.668,
    "end": 180.971,
    "text": " because it's the answer to life, universe, and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.471,
    "end": 188.376,
    "text": "So this is the first time that I am coming to an Active Inference live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.997,
    "end": 193.4,
    "text": "And I'm actively inferring the whole idea of Active Inference itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.64,
    "end": 194.761,
    "text": "I'm very new to the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.262,
    "end": 199.925,
    "text": "So yeah, I'm very excited to learn a lot of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.065,
    "end": 207.511,
    "text": "And yeah, just as we are on this slide right now, 42 has a lot of other references that you can check out on that Wikipedia link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.3,
    "end": 209.901,
    "text": " Okay, moving to the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.901,
    "end": 217.824,
    "text": "I usually document the many things that I've been up to at this particular link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.324,
    "end": 225.207,
    "text": "And in the next slide, I highlight the few places where I have had the fortune to be at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.307,
    "end": 235.732,
    "text": "So I formally have studied computer science and design, and I've meandered by accident and by intention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.332,
    "end": 239.515,
    "text": " in a lot of different places that you can see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.655,
    "end": 250.064,
    "text": "So I studied computer science at a university in India which practices a lot of hands-on experience, and that's where I got my start in robotics and a lot of other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.065,
    "end": 264.436,
    "text": "Then studied further through various participatory workshops and internships at space organizations, media labs, and then spent two years at financial services to understand how money works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.036,
    "end": 270.462,
    "text": " and was introduced to robotics mostly through open source software in the bottom most thing that you see here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.762,
    "end": 272.564,
    "text": "That's the Google Summer of Code program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.505,
    "end": 278.63,
    "text": "And I would go into more detail about how that robotic journey even started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.07,
    "end": 282.734,
    "text": "These days, I'm very much interested in how coordination happens and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.214,
    "end": 296.987,
    "text": " how we can think about security of countries and communities in general, and more importantly, all the emerging aspects of society, that's technology, economics, culture, and policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.348,
    "end": 307.257,
    "text": "So I know that active inference is a study of autonomous behavior, and we are moving into this era where decentralized and autonomous organizations are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.418,
    "end": 313.862,
    "text": " gaining a lot of popularity as well as mainstream acceptance increasingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.982,
    "end": 323.249,
    "text": "So it's very interesting to see where this new field of study that's active inference, that is a field that is invented in our lifetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.409,
    "end": 334.237,
    "text": "It's very rare to see that you get to explore a field that is so recent and has a long history through connections to other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.657,
    "end": 339.939,
    "text": " So it's definitely an evolving area which can help explore other evolving areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.039,
    "end": 346.921,
    "text": "And that's what I find very fascinating about applying active inference in the way that it's applied in this paper as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.421,
    "end": 355.364,
    "text": "So I'll try to explain the history of robotics in a way through the lens of my experience with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.824,
    "end": 359.626,
    "text": "So one of the first things that I did when I started studying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.086,
    "end": 362.447,
    "text": "So as you can see, I started studying in 2012.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.807,
    "end": 370.109,
    "text": " and immediately jumped into all the robotics labs that I could get my hands on in university.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.329,
    "end": 376.071,
    "text": "One of the first tasks that was very appealing to me was multi-robot teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.391,
    "end": 378.392,
    "text": "How do teams operate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.472,
    "end": 391.796,
    "text": "Teams have been a constant fascination for me throughout life, like human teams, teams of biological organizations and organisms such as ants and bees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.316,
    "end": 395.299,
    "text": " And then teams of robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.46,
    "end": 411.554,
    "text": "And we derive a lot of inspiration as well as a lot of biomimicry kinds of techniques in multi-robot exploration as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.994,
    "end": 418.337,
    "text": " So the specific topic that we were studying is in the next slide, which is multi-robot terrain exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.677,
    "end": 431.762,
    "text": "So if we go to slide 13, these were the different techniques we were studying, just like ants leave pheromone trails and different signals for other members of their colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.562,
    "end": 437.046,
    "text": " We tried to model these kinds of similar techniques, like recency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.586,
    "end": 448.073,
    "text": "How recent was it that a robot that was covering a particular terrain that hasn't been explored before, how recently was that covered?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.153,
    "end": 453.457,
    "text": "You can imagine this as a grid, a two-dimensional grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.817,
    "end": 457.42,
    "text": "You see the green squares, those are the multi-robot teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.92,
    "end": 459.942,
    "text": "The green square represents a robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.482,
    "end": 464.143,
    "text": " and they are trying to explore and map out this entire area as a team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.583,
    "end": 469.485,
    "text": "And the assumption is that they can communicate amongst themselves, and in certain cases, they cannot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.965,
    "end": 488.35,
    "text": "So the red squares represent obstacles, and you will see a similar obstacle map in this paper in which they use a warehouse, but we were using similarly configured different obstacle maps, both in a simulated environment as well as a physical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.81,
    "end": 499.984,
    "text": " So we explored different approaches back then, which is things like just representing them as an automata, like giving them very simple deterministic rules, which they can follow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.385,
    "end": 507.894,
    "text": "And those could be imagined as simply as Conway's Game of Life, like the glider pattern or similar patterns that you might know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.554,
    "end": 523.566,
    "text": " And then we moved on to more animal-inspired or bio-inspired techniques, which is a technique like recency, in which the robot leaves pheromone trails in each square, and each square has like a countdown timer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.706,
    "end": 526.468,
    "text": "How recently was it visited by any other robot?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.709,
    "end": 530.872,
    "text": "So this can be understood as ants leaving trails which decay over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.512,
    "end": 539.055,
    "text": " And this gives other ants an idea of how to map that surrounding region effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.495,
    "end": 548.399,
    "text": "And then there were very simple approaches which were more suited for the digital world, such as simply node counting, that how many robots have visited this node before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.479,
    "end": 552.561,
    "text": "So every time you visit any square, you just increase its count, visit count by one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.101,
    "end": 561.908,
    "text": " So that helps the robots in understanding, okay, this area has been visited five times and the surrounding squares have only been visited two times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.928,
    "end": 565.311,
    "text": "So I should maybe explore the unexplored regions first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.831,
    "end": 568.413,
    "text": "So these were different techniques that were used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.033,
    "end": 576.259,
    "text": "And we moved on, published a few papers and were also inspired by military organization techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.839,
    "end": 584.621,
    "text": " the typical OODA loop or the Observe, Orient, Decide, and Act, which is kind of applied active inference in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.441,
    "end": 593.222,
    "text": "So we did explore that, like clustering approaches and different ways of conquering the whole map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.322,
    "end": 601.264,
    "text": "So this was an exploration and exploitation problem that I had the opportunity to study in second and third year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.864,
    "end": 604.066,
    "text": " So of my undergraduate computer science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.226,
    "end": 610.571,
    "text": "And then I went on to like fancier things, thanks to the Google Summer of Code program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.812,
    "end": 616.096,
    "text": "So this was a project with the Italian Mars Society, which reports to the European Space Agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.176,
    "end": 620.98,
    "text": "And here it was more about autonomous navigation, working with a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.3,
    "end": 624.142,
    "text": "So this was a robot and a human team working together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.263,
    "end": 629.464,
    "text": " And the next slide shows how it actually happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.845,
    "end": 640.588,
    "text": "So if we go to the next slide and play the video, we will see that it is meant for an astronaut who is safe in a Martian habitat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.948,
    "end": 647.03,
    "text": "And the robot is a rover, which is exploring the Martian terrain outside in a more dangerous environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.45,
    "end": 656.557,
    "text": " So every movement of the rover comes from the astronaut's movements, which are mapped from an omnidirectional treadmill that the astronaut is walking on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.997,
    "end": 664.683,
    "text": "And similarly, there is feedback received from the rover's camera, which feeds into the astronaut's virtual reality headset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.083,
    "end": 689.18,
    "text": " So do note that this was back in 2015 when headsets were clunky, when things moved very slowly, but Kinect was all the rage, like mapping body movements, mapping robot movements in unexplored territory using 3D cameras, which is a technique that this paper also uses using RGB and depth cameras.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.6,
    "end": 694.524,
    "text": "So those were the techniques which still are very popularly used even today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.024,
    "end": 706.526,
    "text": " So this was my introduction to understanding how different robot and human teams can work and how telerobotics and telepresence can work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.566,
    "end": 721.449,
    "text": "So my responsibility in this project was to do the entire networking architecture and ensure that there's no latency or there's no feedback in which a robot can enter a dangerous state just because the astronaut did not receive the information on time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.909,
    "end": 730.216,
    "text": " So this is how we began and the operating system that we used in that particular experiment is on slide 16.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.656,
    "end": 733.398,
    "text": "So whenever the video is done, we can move to the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.478,
    "end": 737.642,
    "text": "So in slide 16, you see a husky robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.742,
    "end": 742.966,
    "text": "So these are open source robots that are very popularly used with the robot operating system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.486,
    "end": 747.691,
    "text": " And we'll keep coming back to this particular framework of ROS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.951,
    "end": 749.933,
    "text": "So ROS became extremely popular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.033,
    "end": 764.029,
    "text": "It gained its reputation from the earliest DARPA challenges in which a very popular car just crossed through an entire desert terrain navigating autonomously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.509,
    "end": 769.651,
    "text": " So ROS was an open source robotics library which was built out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.411,
    "end": 776.252,
    "text": "And you see many different sensors and actuators on this particular rover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.352,
    "end": 781.074,
    "text": "So you see a lot of symbols which will be repeated in this particular paper as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.954,
    "end": 789.279,
    "text": " So the task of a localization technique is to gather all these sensor inputs, fuse all those inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.599,
    "end": 803.368,
    "text": "So the sensors can be understood as IMU or like measurement units, inertial measurement units, such as like accelerometers and speed and all those measurement metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.649,
    "end": 807.251,
    "text": "Then you have camera, which is similarly RGB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.311,
    "end": 811.534,
    "text": "That's red, green, blue colors of the visible spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.555,
    "end": 820.481,
    "text": " And then you have 3D sensing in the sense of the Kinect sensor that you see on that particular robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.042,
    "end": 823.424,
    "text": "And you would see a similar setup in this paper as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.464,
    "end": 833.693,
    "text": "They use a TurtleBot2Y robot, which we will get into, which is also using ROS, and it uses the same concept as we used in that particular paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.093,
    "end": 844.477,
    "text": " So all these different attributes such as GPS, 3D sensing, odometry, camera, and IMU are inputs to the robot localization technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.657,
    "end": 850.7,
    "text": "And all of this together is meant to estimate the three-dimensional surroundings of a particular robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.24,
    "end": 853.941,
    "text": "And all these techniques do not use active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.981,
    "end": 858.363,
    "text": "They used probabilistic methods, which we will slightly refer in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.923,
    "end": 876.167,
    "text": " So it's very promising to see that if we are inspired so much from biological ways of navigation, we should rather use a technique which organisms have evolved to be so effective at over so many years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.747,
    "end": 887.549,
    "text": "And as humans, wayfinding was considered a survival skill for a long, long time before we entered the era of Google Maps and we just totally lost the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.149,
    "end": 892.813,
    "text": " technique of finding our way around rural, urban, and natural settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.294,
    "end": 903.463,
    "text": "So wayfinding and navigation and localization and mapping was a technique which is very familiar to anyone in their 70s or 80s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.563,
    "end": 908.528,
    "text": "If you ask them, how would you find your way around a city block or the jungle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.888,
    "end": 911.711,
    "text": "They will have their own ways of navigating that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.451,
    "end": 922.956,
    "text": " So they will either use natural cues like wind direction, the way the sun is setting, the map that they have already covered, asking people around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.357,
    "end": 936.103,
    "text": "So these kinds of techniques are built in our human brain and it's very natural for animals to use that as well in urban as well as their own natural environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.483,
    "end": 942.03,
    "text": " So this paper goes into these many big questions, which is in the next slide, slide number 17.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.07,
    "end": 949.139,
    "text": "So over to Daniel, where he illustrates all these wonderful connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.982,
    "end": 951.502,
    "text": "Thanks for the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 953.024,
    "end": 966.281,
    "text": " innovation on the live stream format a lot of fascinating background and it sets us up really well to discuss some of the big questions of this paper and some of the big questions in general so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.518,
    "end": 994.261,
    "text": " One big question, just the kind of thing that would bring somebody to want to even read this 2021 paper or future work is how do biological, like evolved and human created, mathematical, statistical and robotic, so several different kinds of human created entities, how do biological and human created entities engage in actionable, tractable, adaptive navigation in complex, conditional and changing landscapes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.861,
    "end": 1002.322,
    "text": " And that's a question that one could ask about everything from the organismal level to the colony level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.092,
    "end": 1007.835,
    "text": " arguably also an organism, but in a little different way, and all manner of biological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1008.436,
    "end": 1019.483,
    "text": "And then here is a really nice slide from this Bill Ant Robotics project where they did a direct side-to-side of the harvester ant's anatomy and also their robot's anatomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.763,
    "end": 1029.29,
    "text": "And that's kind of like a bridge that takes us into a different space first with the walking around the warehouse and does it stay standing when it gets pushed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.37,
    "end": 1032.692,
    "text": "And can it localize when somebody turns off the light in the room?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.192,
    "end": 1041.955,
    "text": " and these sort of basic, though still relatively advanced, but also relatively basic tasks and settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.615,
    "end": 1052.778,
    "text": "And then off on the right side here are some of the visions and representations that people use for when those low level activities are such that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.883,
    "end": 1058.645,
    "text": " If a robot can resist being pushed over, then how does that have complex feedbacks with society?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1059.045,
    "end": 1072.531,
    "text": "So it was just something that you also impressed upon, like the very holistic nature of this area and also just how to keep a lot on the table talking about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.771,
    "end": 1074.792,
    "text": "So that's what will be fun to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.892,
    "end": 1075.272,
    "text": "What do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1075.933,
    "end": 1076.113,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.299,
    "end": 1094.345,
    "text": " I think before we enter into the paper itself, I would want to understand from you what has been your learning from observing ant behavior and studying their actions in such an environment, like in natural as well as artificial environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.423,
    "end": 1112.066,
    "text": " I can hopefully accurately relay an anecdote from my PhD advisor, Professor Deborah Gordon, and she would often talk about how there would be at a conference or some type of competition, and this is something I've observed, but to a lesser, smaller extent,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.007,
    "end": 1131.333,
    "text": " is there'll be a presentation of an algorithm or a robotics implementation of so-called swarm algorithm or ant colony algorithm ant colony optimization we see it on the pure optimization computer only but also a lot of bio-inspired robotics design and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1132.541,
    "end": 1136.803,
    "text": " One common feature of these algorithms is that there's some underlying map that's shared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1136.863,
    "end": 1148.27,
    "text": "Like when you mentioned the grid counting, of course, there has to be a mesh network so that the robots kind of have basically either telepathy or some kind of common signal, even if it's asynchronous or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1148.33,
    "end": 1153.232,
    "text": "But there has to be some sort of updating of the grid in their mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1154.713,
    "end": 1168.042,
    "text": " being in the field and also drawing upon what we know about what we know about ants, the nestmate, when it's deciding to forage or not, it doesn't know how many seeds the colony has, how many seeds are out there, what the right decision would be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1168.563,
    "end": 1175.788,
    "text": "So it must use stochastic interactions that it receives locally and cognitive constraints to make its decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.488,
    "end": 1179.709,
    "text": " And then once it's out there, there's no telepathy amongst the ants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.749,
    "end": 1181.03,
    "text": "There's no queen control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.35,
    "end": 1185.671,
    "text": "There's no forager groups that all like tell each other orders and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.011,
    "end": 1197.595,
    "text": "So that navigation is also multi-sensory and related to their cognitive constraints, but also their finesse in a certain niche and a harvester ant is not gonna forage well in the Arctic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.016,
    "end": 1204.618,
    "text": "And so understanding how it's that interplay between the nestmate and the colony and the variability of the environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1204.998,
    "end": 1222.889,
    "text": " It's a really rich area and it's easy to bring in other modalities that humans can use like long range communication and understanding how those novel affordances for decentralized systems design do or don't relate to some of the ways that biological systems work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.269,
    "end": 1224.61,
    "text": "That's a really fascinating area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1226.897,
    "end": 1227.197,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.897,
    "end": 1241.04,
    "text": "And the reason I think that this paper is relevant, first of all, because it's based on active inference, which is like the study of how the human brain would react in certain scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.38,
    "end": 1250.122,
    "text": "But more broadly, how a biological organism or an organized colony would react in those kinds of situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.762,
    "end": 1255.163,
    "text": "And just like you said, the map may not be shared in certain cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.163,
    "end": 1259.405,
    "text": " The map, the team might be decentralized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.865,
    "end": 1262.446,
    "text": "Communication might be unavailable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.546,
    "end": 1268.429,
    "text": "These are extremely realistic situations, even for groups of robots today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.609,
    "end": 1283.636,
    "text": "So you can imagine these as robots who are exploring the fallout of a nuclear situation, like when a nuclear plant needs to undergo maintenance and humans cannot enter that area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.136,
    "end": 1288.997,
    "text": " So you cannot assume 100% communication when the robot is mapping out that area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.498,
    "end": 1302.241,
    "text": "So this is one of the important reasons why some amount of cognition and some amount of active inference of the terrain is extremely important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.521,
    "end": 1308.383,
    "text": "And our infrastructure in robotics as well as communication is only now getting there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.563,
    "end": 1312.064,
    "text": "Like with the new standards introduced in 5G and 6G networks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.464,
    "end": 1319.667,
    "text": " we will start getting into like scenarios where robots become parts of our daily lives and they already have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.107,
    "end": 1332.572,
    "text": "So I'm based in Singapore and it's very common to see cleaner robots and teams of like helper robots moving around like in university campuses as well as airports and shopping centers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.672,
    "end": 1339.475,
    "text": "So these robots have covered the entire terrain already so they use like very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.055,
    "end": 1346.399,
    "text": " basic approaches of obstacle avoidance and trying to clean the entire area and complete their objectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.439,
    "end": 1363.549,
    "text": "And there is very little stochastic action going on there because most of those tasks can be completed in a hard-coded map that is shared among those robot teams in a very specific highly connected environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.889,
    "end": 1372.157,
    "text": " But when we start moving into more urban environments where this cannot be guaranteed, we definitely need approaches like the one described in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.678,
    "end": 1377.983,
    "text": "So yeah, with all that context, we can jump into the aims and claims of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.249,
    "end": 1379.529,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.75,
    "end": 1383.613,
    "text": "So just to read some of the aims and claims, which we're going to revisit a bunch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.194,
    "end": 1387.677,
    "text": "The paper is Robot Navigation as Hierarchical Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1388.418,
    "end": 1398.467,
    "text": "And some of their main claims were that they are going to first propose a hierarchical generative model casting navigation as minimizing expected variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.128,
    "end": 1403.111,
    "text": "So that is what brings all of these areas of navigation robotics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.232,
    "end": 1407.655,
    "text": " under the umbrella or drawing an edge to active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.356,
    "end": 1416.162,
    "text": "We show how perception, localization, mapping, and navigation naturally emerge from optimizing this hierarchical generative model under active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.023,
    "end": 1421.086,
    "text": "So that's sort of the theory and background and some of the formalisms that we'll go through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.787,
    "end": 1431.015,
    "text": "Then they implement the system in Silico on a real world robot platform, navigating a warehouse environment using camera sensor input only.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.113,
    "end": 1440.855,
    "text": " And then they also have this third angle, not just the theoretical and the robotic implementation of that, but the biological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.115,
    "end": 1447.837,
    "text": "And they relate their work to various findings and hypotheses in biology about navigation in the rodent and primate brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.118,
    "end": 1450.338,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1450.598,
    "end": 1450.778,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.978,
    "end": 1453.099,
    "text": "Do you want to read that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.139,
    "end": 1453.699,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.759,
    "end": 1455.579,
    "text": " Wonderful claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.639,
    "end": 1460.382,
    "text": "Before we jump into the claims, I was very fascinated by the list of authors of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.422,
    "end": 1464.023,
    "text": "So I'll just zoom into that a bit if that's visible on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.864,
    "end": 1470.166,
    "text": "So you see that three of those authors are located in Belgium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.306,
    "end": 1483.272,
    "text": "And the last author really fascinated me because they come from a center of psychedelic and consciousness research, which happens to be one of my favorite facilities in the entire world focusing on these kinds of topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.732,
    "end": 1496.584,
    "text": " So I would also like to ask you that, how do these kinds of multidisciplinary research show through in this particular paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.704,
    "end": 1504.051,
    "text": "So obviously, we have teams of engineers and researchers from Belgium, but we also have an author from a very different field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.492,
    "end": 1507.835,
    "text": "And how do you think that contributed in this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.755,
    "end": 1512.737,
    "text": " That'll be something great to ask them when they visit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.217,
    "end": 1522.084,
    "text": "But I think at the general level, we see several factors, including like, of course, a shared interest common framework in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.605,
    "end": 1530.95,
    "text": "Also, I'm sure some... We'll have to find out in this specific case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.49,
    "end": 1534.192,
    "text": "But it's a great question, and it's an important question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.073,
    "end": 1535.653,
    "text": "Okay, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.066,
    "end": 1541.849,
    "text": " I'll read the abstract first half, or the first three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.37,
    "end": 1556.923,
    "text": "Localization and mapping has been a long-standing area of research, both in neuroscience to understand how mammals navigate their environment, as well as in robotics to enable autonomous mobile robots.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1557.463,
    "end": 1564.81,
    "text": " In this paper, we treat navigation as inferring actions that minimize expected variational free energy under a hierarchical generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.291,
    "end": 1573.299,
    "text": "We find that familiar concepts like perception, path integration, localization, mapping naturally emerge from this active inference formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.992,
    "end": 1585.08,
    "text": " Moreover, we show that this model is consistent with models of hippocampal functions and can be implemented in Silico on a real-world robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.841,
    "end": 1597.915,
    "text": "Our experiments illustrate that a robot equipped with our hierarchical model is able to generate topologically consistent maps and correct navigation behavior is inferred when a goal location is provided to the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.373,
    "end": 1603.075,
    "text": " That's a lot to get into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.758,
    "end": 1608.381,
    "text": "The paper makes a very simple claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.461,
    "end": 1620.875,
    "text": "If we broadly look at the paper, it makes a very simple claim that active inference works and it's able to consistently reproduce maps which are representative of the physical world map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.857,
    "end": 1633.448,
    "text": " This literally goes into the map is not the terrain kind of discussion that we have been having in Active Inference live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.028,
    "end": 1643.818,
    "text": "In this case, they are able to consistently reproduce a particular kind of map that is a warehouse kind of a setting, and they compare it with many different approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.839,
    "end": 1665.812,
    "text": " there's many different tasks that you can see here so the highlighted tasks tell you that there's perception which is understanding the entire environment then combining all the paths that can be taken from point a to point b and then localization which is understanding your own position as a robot in that particular environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.872,
    "end": 1690.465,
    "text": " and then mapping as you are doing all of these things simultaneously localizing your position and state as well as mapping the entire region while you're doing that and all of these are naturally emerging from like formulating it as like active inference which is minimizing expected variational free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.925,
    "end": 1708.925,
    "text": " So yeah, just before we go into more detail, do you want to explain to robotics researchers who might visit this livestream about why they should care about variational free energy and probably these new words that might be very important for them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.386,
    "end": 1710.647,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.727,
    "end": 1711.327,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.329,
    "end": 1713.41,
    "text": " very clear summary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.91,
    "end": 1721.216,
    "text": "And definitely we hope that this kind of a presentation, at least in the .zero and also in the group discussions, it's like a two-way street.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.316,
    "end": 1727.361,
    "text": "So people are gonna have different amounts of familiarity with some of the robotics, as well as with the active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.541,
    "end": 1730.943,
    "text": "So to anyone who's anywhere in that space,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.764,
    "end": 1735.566,
    "text": " I think there's a lot to be said for just taking a first principles approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1736.007,
    "end": 1738.328,
    "text": "That's sort of a simplicity and elegance route.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.888,
    "end": 1748.054,
    "text": "There's value to be found in transdisciplinary approaches like localization and mapping and cognitive affects and emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.514,
    "end": 1753.037,
    "text": "Some of the psychological frameworks that we've been discussing in other live streams or other papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.318,
    "end": 1760.384,
    "text": " There's value in not just simplicity, but in finding connections like complexity and patterns across systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1761.165,
    "end": 1775.52,
    "text": "And I think also for something that is clearly so nascent in its development to be able to, as Sid is describing, have some functional closure of maps and cast this problem of like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1776.488,
    "end": 1802.146,
    "text": " where is one and how should one act and what is the bigger space map look like and all of those things which as discussed in the real world have all these other challenges like the communication of those maps and everything however just at the individual wayfinding route drawing on first principles from biology and being a part of a conversation that's clearly already functional but also has a lot of potential is probably a good thing to at least listen to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1804.505,
    "end": 1806.606,
    "text": " Okay, so how do they do that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.466,
    "end": 1808.166,
    "text": "Here's the roadmap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.126,
    "end": 1814.028,
    "text": "In the beginning, they introduce the problem and some of the background, just like we've done in these last minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.668,
    "end": 1818.489,
    "text": "They then discuss some biological perspectives on navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.289,
    "end": 1826.911,
    "text": "They then formulate in sections three and four, the hierarchical active inference model for navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.271,
    "end": 1833.233,
    "text": "It's gonna be a two-layer model, and we're gonna go into it a lot, and there'll be colors that are consistently associated with the levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1834.133,
    "end": 1843.469,
    "text": " They then discuss the experiments, which is the implementation, the M-robot embodiment of the robot, and then they have some discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.397,
    "end": 1860.029,
    "text": " Before we enter into each of these specific topics, I would share what I had shared with Daniel a week ago when we started approaching this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.83,
    "end": 1865.295,
    "text": "This paper is exceptionally well-written, even if you're not from any of these fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.755,
    "end": 1872.983,
    "text": " So just looking at the language that's used, it's very easy to follow for the most part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.043,
    "end": 1878.929,
    "text": "And they make references to topics which people will be familiar with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.969,
    "end": 1884.515,
    "text": "So they explain active inference, free energy, and all these different concepts of SLAM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.955,
    "end": 1897.222,
    "text": " and very technical terms in an extremely simple language, which is why I think it's a great paper to start with if you are new to either of these fields, robotics or active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.783,
    "end": 1907.188,
    "text": "Very true, because I know I was looking up a lot of robot citations, watching videos and learning a lot because it's just totally not my area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.228,
    "end": 1908.429,
    "text": "And I can imagine somebody",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1908.888,
    "end": 1911.309,
    "text": " with a different background would have a different experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.329,
    "end": 1920.013,
    "text": "So it's, I agree, an awesome written paper and it exists for anyone who wants to go into more detail and check out the citation networks if you're in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.033,
    "end": 1933.559,
    "text": "They listed several keywords, active inference, robot navigation, deep learning, SLAM, simultaneous localization and mapping, and then RATSLAM, which is a biologically inspired version of SLAM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.1,
    "end": 1936.461,
    "text": "So let's just go to your active inference meme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.541,
    "end": 1943.748,
    "text": " If you'd like to give a real-time meme reading, please feel free to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.768,
    "end": 1946.21,
    "text": "The meme explains itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.472,
    "end": 1954.419,
    "text": "This is essentially teaching robots as if you're teaching a child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.22,
    "end": 1960.005,
    "text": "I think that is essentially what all kinds of learning techniques come down to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.605,
    "end": 1967.708,
    "text": " And there was another meme of a toddler reading neural networks for babies, which is not in this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.788,
    "end": 1973.67,
    "text": "But that meme essentially meant that a neural network is learning how neural networks work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.95,
    "end": 1978.973,
    "text": "And so this meme is inspired by that, that in order to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.553,
    "end": 2003.858,
    "text": " solve a particular purpose you need to infer actively which means you need to firstly be active and that's the first condition and the second condition is that you need to be constantly inferring like your own assumptions about the environment about the observations that have transpired in the last few time steps and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.438,
    "end": 2006.639,
    "text": " continue to do both these steps in a loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.099,
    "end": 2012.202,
    "text": "And in that combination of those two loops, you are able to solve that purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.562,
    "end": 2019.586,
    "text": "So the meme is inspired from Rick and Morty in which the only sole purpose of that robot is to pass butter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.426,
    "end": 2030.971,
    "text": "And in this case, that sole purpose of just implementing active inference in a robot is all that's needed to solve that particular task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.332,
    "end": 2033.813,
    "text": "And that is intended for the claim of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2034.213,
    "end": 2044.135,
    "text": " So that is why Active Inference as a whole, I think, is all-encompassing when it comes to doing all the steps that we covered in the last seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.946,
    "end": 2075.142,
    "text": " i'll only comment on what you said because it's so true that as a holistic and composable model it'd be possible to bring in different sensor modalities different communication connectivities different actuator possibilities and active inference could grow in terms of how it's being used so this is like a relative to some other possible algorithms which would have to be composed in a bit of an ad hoc or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.74,
    "end": 2100.915,
    "text": " in principled way this is a way to explore just that that you infer actively could be for the robot in condition a or the robot in condition b depending on the generative model and the markov blanket and the external states in the world itself in the context so um let's just go straight into the meme analysis of this second video meme you have prepared",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.446,
    "end": 2112.134,
    "text": " Yeah, meme analysis is something new that might be unique for this livestream, at least in this animated format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.454,
    "end": 2123.363,
    "text": "And as you can see in this particular meme, and in the previous meme, that a robot has to forget all their existing slam techniques that robots have popularly used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.503,
    "end": 2127.606,
    "text": "So we go into many different techniques that are cited in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.167,
    "end": 2131.81,
    "text": "So one of those techniques is obviously rat slam, which we will go into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.25,
    "end": 2151.239,
    "text": " next but probabilistic robotics is like this popular book this classical book which was used by robots of the last decade or two and it describes many different approaches of how SLAM can be implemented and all techniques that we see in conventional robots today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.619,
    "end": 2164.949,
    "text": " whether it's like a robot that's cleaning your house or a robot that's serving you food in one of those experimental restaurants, all of them use probabilistic robotics techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.629,
    "end": 2173.875,
    "text": "And this meme in particular goes into firstly the mission of this entire participatory lab, which is act, infer, and serve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.535,
    "end": 2187.504,
    "text": " And once you do that, once you do all these three things as a robot, you're able to successfully navigate your way around these very confusing terrains, which might be complex and dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.284,
    "end": 2200.252,
    "text": "And on the top, you have a diagram which describes how deep learning methods typically work and how this paper implements one of those techniques with an active inference flavor on top of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.777,
    "end": 2212.798,
    "text": " how active inference and deep learning like how this like combination of these two fields has come through in this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.426,
    "end": 2214.626,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2214.866,
    "end": 2222.411,
    "text": "First, I'll interpret the meme and then describe the deep learning, but then we'll get into more details as we actually walk through the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.551,
    "end": 2229.335,
    "text": "So I see the Act In First serve of Act In Flab, which is open to anybody who wants to participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.036,
    "end": 2241.003,
    "text": "And then it's a little bit like the experiment where people are passing basketballs to each other, and then something unexpected crosses the screen, and many people will not report seeing that other thing crossing the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.223,
    "end": 2242.684,
    "text": "But there's a lot of analogies to other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.137,
    "end": 2244.017,
    "text": " cognitive context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.397,
    "end": 2254.48,
    "text": "So it's like, we're focused in the lab, but then also we have to be aware of the unknowns and the unexpected and the anomalies within the anomaly space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.82,
    "end": 2262.342,
    "text": "And then that's how we get to four, which is like the tetrahedra, which is bigger than just us, anyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.622,
    "end": 2265.643,
    "text": "So how to be doing that nestmate thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2266.403,
    "end": 2274.568,
    "text": " that we can juggle and three numbers in our head at once or seven numbers in our head at once or can only grab two things at once or even fewer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.928,
    "end": 2280.451,
    "text": "So how do we actually use these limitations that we have and be part of still a bigger navigation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.471,
    "end": 2281.631,
    "text": "So it's nice meme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.112,
    "end": 2293.178,
    "text": "Basically, this paper is going to present a method that uses some model structures from active inference, but also uses some more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.787,
    "end": 2299.131,
    "text": " mainstream deep learning and machine learning techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.912,
    "end": 2313.065,
    "text": "And those methods we'll talk about more like the specifics of how they're combined, but it contains both things that are like machine learning, neural network type approaches, as well as that being structured in an active inference way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.986,
    "end": 2322.952,
    "text": " And that active inference structure, when it's just with simple matrices, can be looked at like in the model stream one or in active inference, a step-by-step guide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.332,
    "end": 2329.916,
    "text": "That's the very simple matrix multiplication, very austere kernel of the active inference structuring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.437,
    "end": 2340.303,
    "text": "And then here, because some of the data includes like video data and it's being implemented on modern hardware, it does have like a deep learning, machine learning aspects and modules to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.983,
    "end": 2343.804,
    "text": " Okay, so here's SLAM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2344.344,
    "end": 2346.065,
    "text": "Finally, finally, the keywords.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2347.066,
    "end": 2351.828,
    "text": "So researching it, I found this paper, Are We Ready for Service Robots?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2352.748,
    "end": 2355.009,
    "text": "and presenting a dataset for SLAM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2355.79,
    "end": 2360.952,
    "text": "And on the bottom right, it's showing some different scenes as well as how they change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.673,
    "end": 2367.716,
    "text": "And the paper concludes that with respect to this challenge of simultaneous localization and mapping,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.416,
    "end": 2393.422,
    "text": " that various factors can often confuse a robot and so one can imagine this is just like an algorithm that has a blind spot or some sort of area of poor performance for any number of reasons and that's exactly how these authors begin the paper with being able to robustly explore and navigate an environment has been a long-standing challenge in robotics so the paper just begins with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2394.465,
    "end": 2404.534,
    "text": " What we've been talking about, which is that this is like a perennial and a cross-system problem, but also in hashtag 2022, it's far from solved in real-world settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.534,
    "end": 2406.315,
    "text": "What else would you add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.456,
    "end": 2412.901,
    "text": "I mean, I especially like the title of the paper, which describes why we are doing all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.081,
    "end": 2415.303,
    "text": "The title is Are We Ready for Service Robots?,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.823,
    "end": 2422.345,
    "text": " And in the previous meme, we saw the third pillar of the trifecta after act and infer is serve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.786,
    "end": 2431.989,
    "text": "So all the robots that we are building and most of the applications that we focus on are meant to serve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.609,
    "end": 2435.01,
    "text": "They have service as an objective function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.69,
    "end": 2454.08,
    "text": " And that is what makes this task challenging, because if you are replacing human actions by a robot, you have to forget all the assumptions we make when dealing with human teams, because human teams are dynamic and they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.101,
    "end": 2481.361,
    "text": " learn on the fly and obviously they might not be as effective as a robot who might be better evolved to or better suited through its architecture to consider depth and different kinds of attributes in a changing environment but that group organization poses a lot of challenges to traditional SLAM techniques such as changing even one thing in that environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.681,
    "end": 2486.708,
    "text": " can greatly modify what map the robot had made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.269,
    "end": 2497.063,
    "text": "And you can imagine this as there's a map, and you had localized your position with reference to particular objects in the map, and then you move those objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.503,
    "end": 2501.425,
    "text": " So the robot's world just shifted all around it, literally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.005,
    "end": 2517.913,
    "text": "And that simple change might be very obvious for humans to detect, but for a robot which is using those reference points to localize itself in the world and construct the map out of it, that is a big challenge in traditional SLAM approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.353,
    "end": 2537.246,
    "text": " So yeah, many people who have tried to train a robot before it cleans their house by like driving the robot around in different rooms is very familiar with this particular problem that when you move a chair in between the robot just completely forgets its entire sense of its surroundings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.706,
    "end": 2541.949,
    "text": "So, so yeah, that's why I really like this reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.149,
    "end": 2542.249,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.751,
    "end": 2554.72,
    "text": " Yes, and that's going to come into play with the internally maintained hierarchical generative model that the robot has on board, and that may offer it some resilience against these kinds of changes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.8,
    "end": 2556.501,
    "text": "So that's why we're going this route at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.202,
    "end": 2562.806,
    "text": "And one adjacent work that's discussed in the paper is rat slam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.367,
    "end": 2567.79,
    "text": "So I will play the video, Sid, if you want to maybe describe or contextualize rat slam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2569.423,
    "end": 2592.94,
    "text": " Yeah, so RATSLAM was this bio-inspired technique which really solved SLAM in a very simple manner, which is that it could perform as effectively as other SLAM techniques which relied on expensive equipment and replaced it with a simple camera which has imperfect information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.32,
    "end": 2599.062,
    "text": " So the video goes into it in a lot more detail, and we'll cover it in the next slide as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.783,
    "end": 2613.408,
    "text": "But essentially, it's a hippocampal model, which means that it models like a rat's brain and is able to map the world and localize the robot that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.588,
    "end": 2619.871,
    "text": "So I think the video is very self-explanatory, and the next video will explain it even more about how the map is constructed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.731,
    "end": 2622.052,
    "text": "Yeah, let's look at that one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2622.192,
    "end": 2622.912,
    "text": "Okay, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.222,
    "end": 2627.163,
    "text": " So what is happening in this second video?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.403,
    "end": 2632.984,
    "text": "Yeah, so the second video is one instance of RADSLAM, which is Open RADSLAM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.264,
    "end": 2639.806,
    "text": "So this was a code base that was released both for C++ as well as the ROS operating, the robot operating system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.346,
    "end": 2649.769,
    "text": "And here you see this one particular robot called the IRAT robot mapping out an Australian environment, which is an urban environment that you see on the top right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.47,
    "end": 2661.542,
    "text": " And you see the robot making specific circles around certain loops and making both exploration decisions along the boundaries as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.983,
    "end": 2669.071,
    "text": "So this is very similar to how a rat or a biological organism would explore a particular territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.571,
    "end": 2678.398,
    "text": " So all of this is being done with a single camera, and that is the main achievement of this particular piece of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.898,
    "end": 2689.106,
    "text": "So through this paper, you see that the inputs on the top right are mapped into the images that you see on the bottom right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.867,
    "end": 2694.991,
    "text": "And those simple images are what's being used to map out the terrains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.251,
    "end": 2704.158,
    "text": " So to the human eye, that particular input is extremely blurry and not high fidelity enough to map out a terrain effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.258,
    "end": 2710.764,
    "text": "But as this paper explores, it can very effectively do that, even when we degrade the image quality by a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.284,
    "end": 2726.334,
    "text": " So that is why RATSLAM became very popular as a cited reference in this paper, because it's one of those bio-inspired techniques which comes very close to active inference techniques that this paper goes into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.075,
    "end": 2731.858,
    "text": "So yeah, that's what this video covers, and it explores different kinds of terrains, as you can see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.679,
    "end": 2732.979,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.6,
    "end": 2735.421,
    "text": "So the paper...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.502,
    "end": 2748.429,
    "text": " In the introduction, introduces the relevance of this necessity of the deep navigational functions that humans and other organisms have, but also that robots we would want to design having.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.229,
    "end": 2751.43,
    "text": "That's the main theme here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.311,
    "end": 2761.215,
    "text": "If we learn from biology and bring action into robotic slam, we may be able to have a way to approach these questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.356,
    "end": 2787.001,
    "text": " and then they say okay well how are we going to bring action into slam because this is sort of the inactivist insight that having the perfect map in one's head is like the knowing but then the knowing how to act is not always trivial even with the most high resolution map like one could know exactly every molecule of the car and still not know how it would fail in an environmental situation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.741,
    "end": 2803.909,
    "text": " And that's what an activist and an activism gets at, which is like, what if somebody doesn't have the digital twin model of where things are in their body, but actually the representation, if there even is one, is more about how the body should move or how one should act.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2804.429,
    "end": 2807.851,
    "text": "So that's called the pragmatic turn or the inactivist term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.591,
    "end": 2812.274,
    "text": " And in the terms of cognitive science, that's the 4E cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2812.794,
    "end": 2824.483,
    "text": "So even though that is about the richness of usually human cognition embedded in culture, extended, et cetera, et cetera, it's interesting to, again, see that come into play with this discussion of robotics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.543,
    "end": 2827.845,
    "text": "Like what if there are cultural practices around movement in a space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2828.445,
    "end": 2832.849,
    "text": "How could that or be integrated into a robotics model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.109,
    "end": 2836.071,
    "text": "So there's a lot that goes with this discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.977,
    "end": 2843.541,
    "text": " taking serious of action selection as a real primary imperative, not just the hypothetical mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.342,
    "end": 2854.148,
    "text": "So they say, well, let's use active inference as a process theory of the brain that casts action as perception as two sides of the same coin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.308,
    "end": 2858.59,
    "text": "Not sure if it was action and perception, but still maybe it stands both ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2859.151,
    "end": 2861.932,
    "text": "And a process theory is just like a way that it gets done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.613,
    "end": 2865.235,
    "text": "So how do organisms get it done or...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.115,
    "end": 2879.857,
    "text": " taking one step removed in the instrumental direction how will we model organisms getting it done and then people can debate about what organisms actually do but this is like us actionably mapping that territory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.956,
    "end": 2886.559,
    "text": " In section two, they introduce some neural correlates of navigation, which we're going to discuss in the next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.419,
    "end": 2892.802,
    "text": "And in section three, they bring the question of navigation in terms of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.163,
    "end": 2906.99,
    "text": "And so that's when they go from this hierarchical Bayesian generative model of localization, and on one hand, connect it to the active inference framework, and on the other, to this prior work on machine learning in robotics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.298,
    "end": 2911.7,
    "text": " And that was also related to their previous paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.8,
    "end": 2915.224,
    "text": "So the authors, of course, have previous work and there's related work too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.921,
    "end": 2933.108,
    "text": " In the introduction, they raised two very important points before they start to go into the actual techniques they have implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.388,
    "end": 2940.233,
    "text": "They say that humans easily explore and map their surroundings without much extra thought or considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.874,
    "end": 2943.256,
    "text": "Intuitively, we build a logically consistent map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.656,
    "end": 2945.717,
    "text": " without needing accurate distance measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.137,
    "end": 2951.639,
    "text": "And we find it natural to think about navigation in terms of sequences of moves towards locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.179,
    "end": 2959.862,
    "text": "And when we are considering moving to that new location, humans typically do not consider lower level tasks such as opening doors or lifting feet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.622,
    "end": 2968.969,
    "text": " In this paper, they go into lower level tasks as well, because those kinds of assumptions cannot be made for robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.55,
    "end": 2977.396,
    "text": "And they also mention an interesting point, which is that the working of the human mapping and localization hasn't been thoroughly understood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.277,
    "end": 2986.644,
    "text": "But the best models we have so far are present for rodent navigation, which is where RATSLAM and other techniques come from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.424,
    "end": 2997.866,
    "text": " So this predicates the work that goes on into this paper and how they model this as a multi-agent active inference task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.107,
    "end": 2999.327,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.987,
    "end": 3005.268,
    "text": "So the H slash E system is the hippocampal slash entorhinal system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3006.048,
    "end": 3014.63,
    "text": "And homologous brain regions are here shown for the mouse, the rodent, the macaque, which is a type of primate, and the human.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.451,
    "end": 3018.108,
    "text": " and these brains are sort of aligned",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3019.713,
    "end": 3046.575,
    "text": " and shown so that one can see how these regions are evolutionarily related to one another and then on the bottom are some examples of histology or tissue stainings showing like kind of a cross section and a little bit more detail at the cellular level because as one might imagine this has been studied and there's many many copious numbers of like review papers and so it's like a whole thing how people have studied this like many others but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.277,
    "end": 3050.976,
    "text": " Here is a citation that they provided in the paper, I believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.264,
    "end": 3059.726,
    "text": " which was a Buzaki paper about memory navigation and the theta rhythm in the hippocampal entorhinal system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3060.066,
    "end": 3077.47,
    "text": "So suffice to say that the function of this coupling of brain regions has been modeled in some very fascinating and rich ways and trying to understand how the same brain regions in different functional ways can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3078.23,
    "end": 3094.911,
    "text": " be integrating different aspects of selfness and memory navigation wayfinding some of the complexities of how these different functions are related to each other anything to add on that and then we'll look at how that has been addressed in the active inference framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3096.781,
    "end": 3115.767,
    "text": " Yeah, the only thing I would add is one particular image that I'll paste in this particular slide, which is look at the similarity between the tasks done by the hippocampus and the intrarenal system and the similar set of sensors on this particular robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.287,
    "end": 3130.636,
    "text": " So we use extremely similar architectures to center ourselves in the world, which is we use sensors in the form of sensory organs and obviously ears and eyes and all these are sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.756,
    "end": 3139.642,
    "text": "But all of that is computed in that particular region of the brain, which is considered the robot localization module in this particular robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.102,
    "end": 3144.485,
    "text": "So yeah, that's what that analogy I find interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.566,
    "end": 3145.866,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.167,
    "end": 3155.577,
    "text": "And that's with the action states and the sense states, like just like the sensors and the actuators, we could have two of the same kind or 50 of the same kind or 50 different kinds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3155.597,
    "end": 3158.94,
    "text": "And that's like the kind of multi-sensor fusion that's also interesting to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3159.701,
    "end": 3161.302,
    "text": "And they write in the paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.843,
    "end": 3184.237,
    "text": " will ground the following discussion of the hippocampal entorhinal system in terms of its role in generalized search and navigation and the citation here is to this kaplan and friston paper we're not going to go over this model right now but people could pause look at the graphical model go to the citation and we'll hear about it more from the authors how did they build on prior work",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.592,
    "end": 3193.555,
    "text": " All I'll add here, unless if you want to ask somebody who's totally chill, would be they use a Bayesian graphical framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3194.195,
    "end": 3196.596,
    "text": "And we're going to see a lot of Bayesian graphical frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.356,
    "end": 3203.518,
    "text": "The nodes, the circles represent statistical variables of different kinds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3204.238,
    "end": 3209.965,
    "text": " And then the edges reflect the sparsity of influence of connections amongst those variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.465,
    "end": 3214.85,
    "text": "So like two variables that influence each other have arrows pointing between each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3215.17,
    "end": 3218.915,
    "text": "And this is a Bayesian graph way that is sometimes used to represent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.395,
    "end": 3220.436,
    "text": " models graphically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3220.576,
    "end": 3228.26,
    "text": "And that's kind of playing on graphical in two senses, like it's visual, it's graphical, like a picture, but also it's a graph, like a network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.62,
    "end": 3234.423,
    "text": "So it's something that is a representation of models at the intersection of those two senses of graphical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.883,
    "end": 3236.464,
    "text": "And we use them a lot in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3236.844,
    "end": 3246.629,
    "text": "And in this paper, they made active inference models for navigation and search, and they overlaid it on some of the plausible neuroanatomy of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.949,
    "end": 3256.988,
    "text": " the brain and some of the functions that those regions of the brain have been modeled or seen as performing great okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3260.066,
    "end": 3276.373,
    "text": " the paper also on the biological section explores the grid cells and we saw the grid cells also in rat slam the grid cells are in the entorhinal cortex so it's in the he system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.393,
    "end": 3302.807,
    "text": " they represent a largely triangular or hexagonal tiling of space organized according to egocentric reference frames now it's hexagonal in the flat plane but what shape is it in higher dimensions and they write that the regularity of these repeating grids provides a basis for path integration via estimating distances and location in terms of the direction and frequency with which this metric grid metric tiling is traversed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.994,
    "end": 3307.716,
    "text": " And this was pretty interesting to hear how they framed it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.457,
    "end": 3315.041,
    "text": "In physical domains, it has been observed that the spacing of grating representations varies as a function of the space being tiled, e.g.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.101,
    "end": 3322.785,
    "text": "smaller and more fine-grained if an agent is situated within an enclosure or larger and more coarse-grained if it is situated in an open space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.866,
    "end": 3336.929,
    "text": " The granularity of tilings appears to be influenced by brainstem locomotor nuclei, potentially reflecting an inductive bias for greater speed being more likely in larger spaces, as well as by exteroceptive stimulus such as optic flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.689,
    "end": 3344.671,
    "text": "So it makes me think about driving at 70 miles per hour, and it's like one still has this extended sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3345.571,
    "end": 3369.747,
    "text": " of mobility and well I could make a left turn out over that space and time scale and that's as natural feeling to somebody who's familiar with driving in a certain context as like I'm running at this speed and I could make a certain turn at a certain speed and then the optic flow reminds me of a great experiment with honeybees where they had them forage but they had to go in and out through this long section where there was an alternating stripe pattern",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3370.347,
    "end": 3381.235,
    "text": " And so when the stripes were thick, like let's just say a meter of dark and then a meter of light, then they would forage a certain distance and they would be able to do the waggle dance and communicate it to their nest mates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3381.735,
    "end": 3398.447,
    "text": "But then when that was replaced with a very fast alternating stripes, it increased what's known as optic flow, which is just the simple rate of change, like the frame differencing across the retina and the bees were foraging a shorter distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.167,
    "end": 3425.196,
    "text": " because it was like their estimates of optic flow were higher and i think that speaks to also a point that stephen has raised in the chat which is the information geometry versus information geography and that could be connected to a lot of different other areas so that's just something to think about with how is the actual space represented how is the perceptual space represented and the grid cells are something that people have modeled as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3426.069,
    "end": 3430.351,
    "text": " being at the intersection there from a cognitive perspective and from a tissue perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3433.233,
    "end": 3433.733,
    "text": "Anything to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.034,
    "end": 3435.334,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.414,
    "end": 3439.296,
    "text": "So yeah, Stephen has raised a great point about the geography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.496,
    "end": 3445.96,
    "text": "And I think in humans and organisms like ants and bees, it's more about survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.16,
    "end": 3453.524,
    "text": "And that is why they attach a different kind of grid sizing for different kinds of terrains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.744,
    "end": 3455.345,
    "text": "And yeah, your description of driving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.865,
    "end": 3460.869,
    "text": " in an open wide road is extremely accurate, and so is the bees one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.349,
    "end": 3469.395,
    "text": "And I think it comes down to minimizing error or being more specific in constrained environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.397,
    "end": 3476.941,
    "text": "So if their actions are as wide and as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.083,
    "end": 3491.552,
    "text": " broad ranging as an open environment that might be harmful for their objective function, which is not only reaching from point A to point B in that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.285,
    "end": 3501.632,
    "text": " small environment, but also survival, like just banging into an obstacle if they are not being very specific about their grid size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.072,
    "end": 3513.6,
    "text": "So I think, yeah, it comes down to optic flow as well as I think these survival functions, which are like hidden states in the models of all these agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.262,
    "end": 3516.883,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3517.503,
    "end": 3517.683,
    "text": "The",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.88,
    "end": 3531.987,
    "text": " move from the biological towards the formal by writing speculatively if hippocampal pattern completion is inherently predictive or generative in a bayesian framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.662,
    "end": 3538.246,
    "text": " then this could help to scaffold the development of more sophisticated predictive abilities for the rest of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3538.706,
    "end": 3552.476,
    "text": "So I think this is a very deep area that'll be fun to explore in the conversations, but it's almost like you can bootstrap more complexity off of something that is already providing a more complex and oscillating signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3553.097,
    "end": 3560.222,
    "text": "So I think the richness of self and the place-basedness and learnability there is quite interesting to explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3561.282,
    "end": 3570.328,
    "text": " And they also note that there's ample evidence that spatial awareness is at the core of the mammal brain with explicit representation for pose, heading, and location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.928,
    "end": 3574.77,
    "text": "So what I wanted to explore here in the discussions was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3576.01,
    "end": 3581.957,
    "text": " Location is the core of the mammal brain or cognitive functions in general or in insects too or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.337,
    "end": 3583.118,
    "text": "No, it's olfaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3583.679,
    "end": 3584.379,
    "text": "No, it's emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3584.98,
    "end": 3585.521,
    "text": "No, it's this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3585.941,
    "end": 3589.625,
    "text": "So where do some of these core functions fit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3590.286,
    "end": 3592.468,
    "text": "And then they close the section by just writing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3594.526,
    "end": 3598.228,
    "text": " taking it from the introduction with the robotics to the biological in section two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3598.509,
    "end": 3606.593,
    "text": "And then they say, in the remainder of this paper, we will further build on these insights using a process theory of the brain deeply rooted in predictive processing, active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3607.033,
    "end": 3614.637,
    "text": "So you'll note that other than our additional context, like we haven't gotten into active in the paper, but that's when they cross the Rubicon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.098,
    "end": 3618.88,
    "text": "And from here on out, we're going to be talking about the active inference formalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.56,
    "end": 3621.021,
    "text": "Anything else to add, Sid?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.01,
    "end": 3647.786,
    "text": " I really liked how you framed that particular importance that different kinds of organisms and robots have to be assigned when we are dealing with their objective functions, which is, is location the most important state for them, or are other senses more important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.486,
    "end": 3663.082,
    "text": " And if you're thinking about self-driving cars, and evidently Tesla is very particular on not using LiDAR and laser depth sensing technologies, it's trying to just use RGB depth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.502,
    "end": 3666.424,
    "text": " cameras and trying to navigate the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.524,
    "end": 3673.008,
    "text": "And I think the same is true for Comma, which is another open source self-driving toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.649,
    "end": 3687.458,
    "text": "So these kinds of toolkits that exist for navigation in the physical world, they just rely on location and vision as their only source of input and not other senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.158,
    "end": 3695.61,
    "text": " So yeah, it's interesting how you can modify the importance of these different attributes to achieve different tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.694,
    "end": 3697.874,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.655,
    "end": 3699.697,
    "text": "So into section three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3700.546,
    "end": 3702.948,
    "text": " Navigation as hierarchical active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3703.389,
    "end": 3715.281,
    "text": "Okay, so this is where active inference gets applied in the theory level, and then it gets applied in another way when it becomes simulated, and then in another way when it becomes enacted, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.461,
    "end": 3719.945,
    "text": "So, we cast the SLAM problem in terms of a hierarchical Bayesian generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.706,
    "end": 3724.069,
    "text": " The agent reasons on two different nested levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3724.79,
    "end": 3733.398,
    "text": "So there's going to be the use of a higher and lower to describe these two different ones, but one could use different spatial metaphors like inner or outer or however else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3734.058,
    "end": 3739.183,
    "text": "On a higher level, but this is going to be consistent with the coloring and which one is placed above or below.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3739.904,
    "end": 3744.868,
    "text": "On a higher level for long-term navigation and on a lower level for short-term perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3745.729,
    "end": 3754.276,
    "text": " On the higher level, the agent is capable of reasoning in terms of sequences of location it wants to visit without having to worry about the intricacies of how to control its actuators to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3764.605,
    "end": 3793.654,
    "text": " on the lower level the agent can reason and plan in terms of observation sequences without needing to think too far ahead short-term action selection plans based upon ongoing input we will distinguish between the higher level and the lower level actuation by calling them moves m and actions a for the two higher and lower levels and the sensor readings like the visual input but other sensors could be added too at the lower level are called observations and that's modeled with an o",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3794.625,
    "end": 3799.648,
    "text": " And that reminded me of the relationship between strategy and tactics in chess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3800.448,
    "end": 3805.251,
    "text": "Whereas in strategy, there are more heuristics like control the center or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3806.397,
    "end": 3809.639,
    "text": " the knight on the rim is grim because it has reduced mobility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3810.179,
    "end": 3818.284,
    "text": "That doesn't actually suggest how to do it or what kind of a direct or oblique strategy would actually be realized in which way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3818.384,
    "end": 3819.965,
    "text": "It's just sort of like general ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3820.505,
    "end": 3833.692,
    "text": "And then there's the tactical and the rollout and all of that in the specifics of the situation, which cannot be really thought too far in advance because even just two or three in advance, the branching is so complex",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3834.753,
    "end": 3861.302,
    "text": " that it's not really useful all the time although some brute force approaches have used that to great success and it may work in certain cases but it's not a general strategy just to roll out tactics further and further and then hope that strategy just falls out of rollouts of tactics so i'm sure you'll have some thought on that but how do you think that frames this as a multi-scale statistical problem and then it's going to be approached from this bayesian active inference way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.719,
    "end": 3864.582,
    "text": " Yeah, I think it perfectly models it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.242,
    "end": 3866.925,
    "text": "You added strategy and tactics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.225,
    "end": 3872.272,
    "text": "I would only add objectives as the third element to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.472,
    "end": 3878.44,
    "text": "Objectives, strategy, and tactics are these different levels of tasks that people want to achieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.02,
    "end": 3899.352,
    "text": " And this is not only true for the tasks that you refer to like chess or other applications, but also like when we go about in our own life, like our higher level task can not just be going to the post office, but achieving some objective as a result of that, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.232,
    "end": 3906.058,
    "text": " I am going to the post office because I might have received an admission letter from a university.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.299,
    "end": 3914.467,
    "text": "And that has a higher level task on top of it, which is this has broader implications to my career or life in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.867,
    "end": 3919.352,
    "text": "So one person's or one robot strategy can be another robot's tactics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.832,
    "end": 3923.076,
    "text": "And the way you define moves and actions is totally different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.636,
    "end": 3928.318,
    "text": " arbitrary and dependent on how reliable your sensors are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.498,
    "end": 3944.124,
    "text": "So I think the levels are the place where we draw the line between lower, higher, or inner and outer levels are dependent on the sensors, which is the ground truth that we can reliably measure in that particular moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.919,
    "end": 3954.384,
    "text": " The only thing I'll add there is that also, just like you said, where one robot strategies and others tactics, this nesting of Bayesian generative models can be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3955.535,
    "end": 3979.416,
    "text": " three layers it can be four layers Etc so there's arbitrary design of these graphs and we've seen like in metacognitive papers like active live stream number 25 on metacognition as mental action it actually is like action and perception all the way up all the way down so just because a layer isn't modeled we have an interface for the unknown through the blankets that we do specify",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.956,
    "end": 3982.978,
    "text": " Okay, so let's look at it specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3982.998,
    "end": 3985.42,
    "text": "All right, on the left is figure one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.8,
    "end": 3989.484,
    "text": "It is the prototypical generative model of an active inference agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.204,
    "end": 3997.991,
    "text": "As we discussed a little before, the nodes in the graphical model represent random variables where the gray color is indicating the observed variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3998.311,
    "end": 4000.613,
    "text": "So the observations are observed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.374,
    "end": 4025.039,
    "text": " in gray and then the actions are also observed so one could complicate this assumption but we're assuming that like if the robot is hitting the gas that it knows that it's actually doing that motion an observation at the current time step o sub t is generated by the hidden state s so it has the white node so it is a not directly observed but it's like a parameter in a model the generative model of the robot",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4026.792,
    "end": 4031.556,
    "text": " which in turn is generated by the previous hidden state and action at time step t minus one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4031.856,
    "end": 4041.224,
    "text": "So it's like, here's S in the past, and it's marching forward, and then it's influenced by its prior states, as well as by how actions influence states, if at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4042.224,
    "end": 4051.332,
    "text": "And future states and observations depend on future actions, which are determined or not completely determined, but have a statistical relationship with the policy pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.972,
    "end": 4056.296,
    "text": " And policy, pi, is sequences of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4056.696,
    "end": 4061.94,
    "text": "If one has a policy depth of one, then the action at the next time step and the policy are the same inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.441,
    "end": 4068.866,
    "text": "But when we have a horizon of planning that's deeper than one, it means that policies are actually sequences of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4068.886,
    "end": 4071.788,
    "text": "And that's part of the complexity of cybernetics and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4072.509,
    "end": 4091.176,
    "text": " and on the right I have a little bit cut this generative model into a grid so the now time step is the action that we took in the past the hidden state inference at that time unobserved and the real-time observation and then the left to right is the past",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4092.162,
    "end": 4098.805,
    "text": " time step, the now time step, the next time step, and then just deep future time steps, whatever the horizon of planning is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4099.445,
    "end": 4101.105,
    "text": "And this is a discrete time model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4101.125,
    "end": 4107.108,
    "text": "There's also continuous time active inference models, and they can be used together, but it's not in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4107.948,
    "end": 4109.889,
    "text": "And at the top is policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4110.169,
    "end": 4114.791,
    "text": "And there's a lot of cognitive apparatus that might connect to this pie, but that's also not modeled here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.251,
    "end": 4117.892,
    "text": "Action selection is these A's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4119.131,
    "end": 4141.477,
    "text": " those are just your actions through time i moved e2 e4 and then nf3 and then the hidden states are whatever the hidden states are that are being tracked as being influenced or related to policy selections via action and then hidden states emit observations and that's what makes it a partially observed markov process and then because it's a um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4142.708,
    "end": 4155.196,
    "text": " policy variable that's being modeled here, it's a partially observed Markov decision process because it's not just the Markov process inference, it's also having action as a parameter that's planning as inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4157.778,
    "end": 4158.478,
    "text": "Anything to add on one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.126,
    "end": 4174.173,
    "text": " Yeah, I think adding the grid really helps simplify the different steps that the agent has to take and how it's composable with different policies that might connect from different objectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.753,
    "end": 4189.04,
    "text": "So yeah, the observed and unobserved are, I think, the more important key pieces here, which, again, can have different probabilities because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4190.38,
    "end": 4201.005,
    "text": " As you go through deeper layers, you can consider the previous layer's unobserved state to be your current layer's observed state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.545,
    "end": 4208.408,
    "text": "It depends on how much probability you assign to the strength of that particular observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.835,
    "end": 4235.05,
    "text": " i just want to add one last thing which is the observations in the future are unobserved so just to note that there's a difference between the past and the future and one could also imagine that maybe there's a forgetting or something like that but that's a very key difference is that the same type of variable like actions are unobserved in the future we can't say well we'll make these three moves it's like but what if another chess piece blocks that specific move well that would be dumb of them to do but would it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.297,
    "end": 4238.563,
    "text": " So that's part of the complexity of strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.164,
    "end": 4243.174,
    "text": "So figure two is where they go from this single layer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.204,
    "end": 4267.918,
    "text": " model this is kind of the kernel of the model and they're going to introduce a slightly more complicated graphical model this is going to specifically cast navigation as a hierarchical generative model for active inference and so the lower level is this again more tactical more local visual perception on the bottom filled in observations that's the real-time camera data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4268.618,
    "end": 4271.239,
    "text": " coming in is one way to think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4271.719,
    "end": 4278.642,
    "text": "But another way to think about it is actually by looking at the arrow direction, it's being generated using some underlying states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4279.503,
    "end": 4283.885,
    "text": "And then the actions at that lower level are also being observed in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.765,
    "end": 4297.591,
    "text": "And at the lower level highlighted in blue, the model is entertaining beliefs about hidden states S and the agents pose P. So here's the S and the P, like each time step, there's a hidden state and the pose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4298.843,
    "end": 4325.233,
    "text": " hidden states are giving rise to the observations o and then the hidden state and pose are influenced by the previous state that's the arrow coming horizontally pose and action or the higher level model in the case of the initial states and so here is like at each time step so here we're like in this blue block with a t um uh like at the faster model time step",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.175,
    "end": 4346.452,
    "text": " and then at the slower level there's an injection from this like slower click that shoots something in and then that influences the rest of this blue block and then it's carried forward and there's another injection like a slower time scale at that more strategic level and at the higher level highlighted in red the agent reasons about locations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.81,
    "end": 4355.921,
    "text": " The next location is determined by executing the move on M. So here's the more slower updating movements, like where one is in that map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4356.582,
    "end": 4361.068,
    "text": "And then this is the more fine grained action selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4363.171,
    "end": 4364.513,
    "text": "What do you see in this figure?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.614,
    "end": 4375.923,
    "text": " Yeah, so it's a continuation of the previous figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.203,
    "end": 4380.909,
    "text": "And the speed differences are what's interesting here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.969,
    "end": 4385.516,
    "text": "The higher level being just a two-step process, whereas the lower figure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.036,
    "end": 4389.44,
    "text": " has more actions involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.001,
    "end": 4399.653,
    "text": "So yeah, you see that observations exist in both these layers, but there's more depth of unobserved states in that particular lower layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.396,
    "end": 4403.357,
    "text": "I hope that now by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4404.534,
    "end": 4425.431,
    "text": " filling in some formalisms related to this that we can put a little detail because there's a lot that could be said about this and I hope that we've been at least consistent in our descriptions but we'll look forward to hearing from the authors on it so um they write in active inference the agent will infer beliefs over these hidden states based upon experience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4426.812,
    "end": 4449.747,
    "text": " looking back into the past observations those are the observations from the past that the computer has access to as well as infer future actions through a process of minimizing variational free energy this is where they're going to introduce this free energy minimization as kind of like a model metric that helps do parameter selection parameter optimization on this type of graph",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4450.327,
    "end": 4455.99,
    "text": " So we have some graphical structure, believe it or not, and it could look different, that does strategy and tactics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4456.331,
    "end": 4457.151,
    "text": "It's like the skeleton.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.531,
    "end": 4466.717,
    "text": "But then the real challenge is to have the video data come in and to have the movement data actually modeled and to make that happen on limited hardware and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.717,
    "end": 4490.705,
    "text": " and so what they do is first describe that in terms of equations and then they're going to talk a little bit later about like how the equations get adapted into using neural networks and actual cameras and sensors but this is just going to be still at the equation level going from this graphical intuition about how to do strategy and tactics and how to have them modify each other into an analytical way of framing it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4491.505,
    "end": 4497.096,
    "text": " So P is the joint model of O, S, A, pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.216,
    "end": 4502.927,
    "text": "That's the observations, the video camera data, the states, hidden states at this layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4504.366,
    "end": 4523.315,
    "text": " and the actions and the policy different aspects of the past present and future are modeled as sparsely connected so one could believe it or not that those are sparsely connected so-called in reality but in this model there's actually quite sparse connectivity amongst variables even though if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4525.487,
    "end": 4537.914,
    "text": " If it's new to you, it might look like a circuit board or something, but relationship to the all versus all that it could be connected, this is a quite sparse connectivity, like this bottom left one doesn't influence this top right one, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4539.943,
    "end": 4546.926,
    "text": " Factorization is a way that that sparsity of the variables can be converted into a factorized equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4547.127,
    "end": 4558.592,
    "text": "So we have this joint distribution, which is like the ultimate panopticon distribution, but because there's sparsity of connectivity, different parts of the model can be like partitioned out differently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4558.892,
    "end": 4564.155,
    "text": "So it's like this big joint model that gets separated into separate parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4564.695,
    "end": 4567.917,
    "text": "And each of those one can interpret as being like the distribution of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4568.777,
    "end": 4574.22,
    "text": " So like there's the distribution of policies, over two policies or over continuous policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4574.761,
    "end": 4579.443,
    "text": "Then there's the distribution of action states that are taken depending on the policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4579.784,
    "end": 4584.667,
    "text": "So like given that I intended to move A and then B, did I actually take A?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4585.227,
    "end": 4588.149,
    "text": "Then there's the state underlying distribution in green.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4588.809,
    "end": 4590.631,
    "text": " hidden state, so that's not directly observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4590.951,
    "end": 4594.635,
    "text": "The blue is the distribution of observations conditioned on hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4595.135,
    "end": 4597.698,
    "text": "That's like a Bayesian hidden Markov model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4598.258,
    "end": 4608.829,
    "text": "And then there's this relatively more complex and combinatoric term that is asking, well, how do states depend on past states and actions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4610.407,
    "end": 4614.67,
    "text": " And then how do actions actually depend on policy decisions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.51,
    "end": 4620.194,
    "text": "And how do the observations in the future depend on the hidden states in the future?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4621.595,
    "end": 4627.559,
    "text": "So it's taking this joint model and breaking it down into a few different pieces that, as we'll see, can be simplified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.459,
    "end": 4636.965,
    "text": "And that makes this problem tractable in a way that just the all by all non-factorized, non-factorizable model is much more difficult to fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4640.529,
    "end": 4641.69,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.91,
    "end": 4648.112,
    "text": "And this goes into the practical implementation of how such a thing can be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.212,
    "end": 4658.717,
    "text": "And the interesting factor in this formula for me is the combinatoric term, which takes in the previous states and multiplies it with the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.817,
    "end": 4665.42,
    "text": " And this is one of the ways active inference can be modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.58,
    "end": 4677.286,
    "text": "And I think in previous live streams, there might be different implementations of the same framework, where OS, A, and pi are used in many different formulae and arrangements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.407,
    "end": 4680.567,
    "text": "Great point, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4681.228,
    "end": 4683.969,
    "text": "Though there are some differences in notation across papers,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4685.575,
    "end": 4689.158,
    "text": " there is hopefully more coherence than not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4689.278,
    "end": 4694.362,
    "text": "So knowing this framework helps one understand active inference domain, different domain models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4694.782,
    "end": 4700.926,
    "text": "Okay, so how is free energy going to be used to fit this model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.96,
    "end": 4728.533,
    "text": " both on the sort of perception as inference side, so that's the part of the model on the bottom that's more like a, what is my pose given the visual input and what action should I take in the short term, and this deeper, more navigational layer in the red, how are those going to be reconciled and parameterized, which includes action selection and policy selection, how's that going to be parameterized using a single criterion?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.738,
    "end": 4745.548,
    "text": " So they use the variational free energy, and it's calculated up to the current step T. So variational free energy, as contrasted, which we'll get to with expected free energy, variational free energy is like the parts that are observable are easier to calculate over, one can imagine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4745.808,
    "end": 4747.229,
    "text": "So that's the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4747.649,
    "end": 4753.433,
    "text": "And the expected free energy is going to have continuity with the variational free energy, but it's going to introduce this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.133,
    "end": 4771.489,
    "text": " complexity of calculating expected free energies about unobserved observations and actions but they're similar but it goes like from first variational free energy is looking back and that's the more perceptual component and then there's a deeper expected component once a time horizon is considered so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.759,
    "end": 4784.487,
    "text": " can go into this more with the authors but briefly in the first line f this variational free energy is being defined as the expectation that's the fancy e of the difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4786.559,
    "end": 4810.97,
    "text": " the q distribution which is the variational distribution that's under the control of the experimenter of the robot and that's like a simplified distribution family so just like fitting a linear model can be done even if the data are super non-linear and you're totally misled fitting a linear model can be quite fast or fitting just a parabolic model can be quite fast so if you constrain what model family you're willing to use for q",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4812.824,
    "end": 4828.317,
    "text": " though there are still some quite expressive families that are also tractable, then you can try to minimize the expectation of the difference between the distribution that you're controlling and this distribution that you'd like to know that's gonna help you go a long way towards doing policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4829.598,
    "end": 4834.342,
    "text": "This expectation can be rewritten using a KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4836.204,
    "end": 4838.986,
    "text": "And that can also be rephrased as a difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.952,
    "end": 4842.675,
    "text": " a KL divergence and another expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4843.737,
    "end": 4847.621,
    "text": "We can go more into this with the authors, and I think that will be great to hear their explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4847.641,
    "end": 4849.704,
    "text": "But for now, I just want to leave it at that level of detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.051,
    "end": 4853.211,
    "text": " Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.552,
    "end": 4862.515,
    "text": "And I mean, the broader point that I see from this particular framing is like representing it in terms of divergence and evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.655,
    "end": 4872.758,
    "text": "And this is how not only they use it for their experimental setting, but this is how the actual free energy model will be implemented in a real life situation as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.198,
    "end": 4883.664,
    "text": " in which the first term, which is in their control, may not be in their control when the robot is in a dynamic environment like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.004,
    "end": 4889.367,
    "text": "So in this particular paper, in a warehouse environment, this kind of a framing makes perfect sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.088,
    "end": 4895.491,
    "text": "But when the setting might be different, the framing might also need to reflect that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.621,
    "end": 4896.821,
    "text": " Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4897.382,
    "end": 4900.345,
    "text": "And also there's that complexity minus accuracy interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.585,
    "end": 4900.745,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.506,
    "end": 4901.686,
    "text": "Okay."
  },
  {
    "start": 4902.107,
    "end": 4915.001,
    "text": "So here's where they move from the variational free energy F to the expected free energy G. So they write, crucially, in active inference, the agent will not only optimize its generative model by minimizing F for past observations...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4916.158,
    "end": 4920.52,
    "text": " In addition, the agent will also select actions that it believes will minimize its future surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4920.94,
    "end": 4922.92,
    "text": "However, future observations are not yet available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4923.581,
    "end": 4933.464,
    "text": "The free energy F cannot be computed and the expected free energy G is used instead to compare the effect of various policies or actions in relation to the goal of reaching the preferred state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4933.884,
    "end": 4940.847,
    "text": "So wouldn't it be simple if we could just infer how the map looked in the past and then make decisions based upon how the map looked in the past,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4941.223,
    "end": 4947.365,
    "text": " but that opens up to all these basically failures of function in changing environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4948.725,
    "end": 4964.809,
    "text": "G in formalism three is a sum across over a given time horizon T. So the expected free energy G of pi and T policy in time for a given certain policy pi and time step T in the future is defined as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4965.865,
    "end": 4973.95,
    "text": " And this is going to be another set of formalisms, but we can just pull back and remind ourselves of that sentence from the introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4974.25,
    "end": 4980.114,
    "text": "Active inference is a process theory of the brain that casts action as perception as two sides of the same coin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4980.914,
    "end": 5009.975,
    "text": " so variational free energy which is more perceptual like because it's looking in past observed states and then g which is going to introduce the uncertainty of action in an uncertain future how an f how are f and g similar or different how are they being cast as two sides of the same coin how through the present are those two processes being reconciled because time step five from now is going to be like now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5010.871,
    "end": 5027.647,
    "text": " then so how will we have continuity in dealing with certain moments like now but then there's things that we're uncertain about in the past and the present and the future and they're all very quite different kinds and they have different relationships to past actions and that's like the blockchain angle you can't change the past",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5028.368,
    "end": 5035.53,
    "text": " You can change your interpretation of the past, but then there's a different kind of variability or openness in inferences about the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5036.03,
    "end": 5039.631,
    "text": "So these are great questions to learn about and think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.151,
    "end": 5041.932,
    "text": "How are FNG similar and different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.572,
    "end": 5043.992,
    "text": "What is variational free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5044.472,
    "end": 5045.633,
    "text": "What is expected free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.173,
    "end": 5051.754,
    "text": "What is free energy of the expected future, which Baron Millage et al have introduced?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5051.954,
    "end": 5054.235,
    "text": "And what other kinds of representations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5055.015,
    "end": 5068.129,
    "text": " of this nexus are relevant to think about because these cited papers and shown equations do not exhaust the richness of that setting, but it's awesome how they pulled back to just this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5069.13,
    "end": 5071.813,
    "text": "It's a function G of what you do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5074.059,
    "end": 5090.801,
    "text": " and what horizon you're considering it over tau and then implicitly how you think about all of that and how you think about that so they both pulled out to a level that i think will provide a lot more discussion but also we have to get specific in order for that robot to be in the warehouse",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.614,
    "end": 5095.255,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.535,
    "end": 5106.583,
    "text": "And the only fascinating observation for me, obviously there's a lot in this slide because this is the entire model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.623,
    "end": 5109.786,
    "text": "This is the crux of the entire calculation where you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.526,
    "end": 5113.849,
    "text": " variational free energy and the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.949,
    "end": 5125.116,
    "text": "And you see the similarity between both these formulae where divergence and log evidence is mentioned and then complexity and accuracy are terms of that formula.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.216,
    "end": 5139.586,
    "text": "And eventually it comes down to risk and ambiguity in the expected free energy formula when all the probabilities are given a certain policy and on a particular time horizon, which is represented by tau.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.326,
    "end": 5154.715,
    "text": " So these terms like divergence complexity risk are like in one bucket and log evidence accuracy and ambiguity are like in the same similar category in those two formulae.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.808,
    "end": 5156.789,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5157.049,
    "end": 5173.262,
    "text": "I think we will, as we expect the unexpected, we'll start to actually accelerate through because the goal of the dot zero is really to set a lot of that context because that is what brings one to the trailhead, so to speak, for a lot of the details that they're going to present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5173.663,
    "end": 5177.866,
    "text": "And of course, the accuracy of their experiments and the implications and everything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5178.547,
    "end": 5182.53,
    "text": "So we're just going to sort of continue on knowing that that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5183.945,
    "end": 5211.489,
    "text": " getting there is getting quite a far way with this paper and then we're going to go slightly faster through many other aspects of the paper just to like give it a first pass so um here in formalism five they are casting p of pi the distribution of policies as a softmax sigma of the free energy on policy and this temperature parameter gamma",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5212.904,
    "end": 5222.33,
    "text": " This is casting planning as an inference problem, which allows one to go from like the relative free energies of different policies to a decision on those policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5222.51,
    "end": 5232.777,
    "text": "And when there's high temperature, it's like the pie chart is made, but one is still just picking from the different policies as if they had relatively more equal pies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5233.198,
    "end": 5241.363,
    "text": "Whereas when the temperature's low, like absolute zero, then one is selecting the best policy, like more than it should be expected in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5243.624,
    "end": 5248.327,
    "text": " And so that gamma reflects the confidence that the agent has in current beliefs over policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5248.607,
    "end": 5253.931,
    "text": "So when there's a lot of confidence, then the best expected policy is selected always.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5254.311,
    "end": 5257.373,
    "text": "When there's low confidence, then it's not taken into account as much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5257.913,
    "end": 5262.116,
    "text": "And that's, of course, a fun to think about in the context of like expecting the unexpected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5262.136,
    "end": 5263.316,
    "text": "I think I can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5263.336,
    "end": 5264.057,
    "text": "I think I can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5264.878,
    "end": 5269.003,
    "text": " And then it says on the bottom right, no one had the heart to tell him he was going the wrong way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.644,
    "end": 5275.53,
    "text": "So one can think they can and be acting consistent with their model and going the wrong way relative to what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5276.692,
    "end": 5282.478,
    "text": "So there's a lot, again, there that connects like the math to some broader questions that we all have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.14,
    "end": 5284.701,
    "text": "What do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.994,
    "end": 5288.095,
    "text": " Yeah, totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.135,
    "end": 5290.716,
    "text": "And the meme really brings the point home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.576,
    "end": 5294.518,
    "text": "So yeah, let's go to the next one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.058,
    "end": 5305.383,
    "text": "And in 37, live stream number 37, people can read about this dual interpretation of preferences and expectations and about how they co-realize each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5306.55,
    "end": 5311.791,
    "text": " So section 3.2, they move to the hierarchical generative model for navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5312.471,
    "end": 5318.933,
    "text": "And here it's the same higher and lower model with blue at the lower timescale, red at the higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5319.873,
    "end": 5331.236,
    "text": "And it's gonna be basically as we spent more time on previously, but just applied to this multi-scale navigation problem where it was being approached a little bit more abstractly before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5331.776,
    "end": 5333.797,
    "text": "So in formalism six,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5334.537,
    "end": 5342.443,
    "text": " they're going to have their big joint model be all the things that one would want to know in this whole nested model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5343.844,
    "end": 5345.985,
    "text": "That's why previously when we saw the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5347.318,
    "end": 5353.584,
    "text": " P distribution, there was only four variables because it was considered at just a more simple kernel layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5354.205,
    "end": 5360.091,
    "text": "And this is writing it out for the whole nested model where there's actions and moves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5360.711,
    "end": 5364.695,
    "text": "So moves across these two layers being jointly considered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5365.416,
    "end": 5379.13,
    "text": " And then it's going to be like this multiplication between the lower level distribution and the higher level distribution because it can be factorized across these two levels because they're sparsely connected because of how it was designed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5379.95,
    "end": 5385.776,
    "text": "So that simplification takes like sort of an all by all model and just simplifies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5386.423,
    "end": 5400.937,
    "text": " at this level that corresponds graphically to the sparse connectivity allows those two to kind of twist a little bit independently from each other, yet also containing a common basis in this joint distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5403.019,
    "end": 5403.519,
    "text": "Anything to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5404.861,
    "end": 5410.506,
    "text": "No, I think this will be clarified further in the next slide, which goes into global policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5411.997,
    "end": 5415.62,
    "text": " So in the higher level red, the global policy is omitted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5415.88,
    "end": 5418.122,
    "text": "Every move is treated independent of each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5419.423,
    "end": 5425.707,
    "text": "This hierarchical arrangement allows the system to reason about its environment further ahead, both temporally and spatially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5426.348,
    "end": 5432.092,
    "text": "And so then they take this joint distribution and it gets broken down into these three terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5434.065,
    "end": 5441.288,
    "text": " From formalism 7, we can see the generative model decomposes into terms for both the lower level dynamics, blue, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5441.348,
    "end": 5443.588,
    "text": "how actions influence the next state in pose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5444.289,
    "end": 5451.811,
    "text": "So we broke the blue out from the red, and then there's this other term, which we can talk about, from the joint distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5452.952,
    "end": 5453.612,
    "text": "What do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5456.809,
    "end": 5465.792,
    "text": " Yeah, I think this is where it comes to expressing in terms of G, which was the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.912,
    "end": 5468.353,
    "text": "And we see those terms repeat here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.573,
    "end": 5478.496,
    "text": "And I think this is the most important formula of this paper in which the global policy selection happens at the higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.616,
    "end": 5478.736,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.106,
    "end": 5502.159,
    "text": " okay so as we saw before with a simpler version first there was a decomposition on p there's a factorization on a p distribution we saw this like with a simpler p here they then got turned into an f and a g here we have a more full featured p it is also going to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5503.035,
    "end": 5510.379,
    "text": " turned into an F, which is the variational free energy, and then a G. So this is F of the hierarchical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5510.519,
    "end": 5524.327,
    "text": "They write, now that we fully specified our generative model, that was P, the factorized joint distribution, we again turn the variational F and then later the expected G free energy that will be minimized in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5525.256,
    "end": 5543.401,
    "text": " So it's a variational distribution queue that they're fitting and they take the same approach as they took earlier with the single layer model and they reach this hierarchical free energy that can be rewritten by the bottom row as the decomposition of the free energy of the lower model and of the higher model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5543.801,
    "end": 5550.103,
    "text": "So I think it'll be great to hear the authors, like how did they reach this and what do they think it means?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5552.636,
    "end": 5560.745,
    "text": " But I think the awesome question to think about here is how do we think about free energy minimization in multi-agent and multi-scale systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.807,
    "end": 5564.209,
    "text": "How do free energy decompositions work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.289,
    "end": 5568.094,
    "text": "And what if nine do really well, then one doesn't?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5568.634,
    "end": 5570.957,
    "text": "How does that group outcome work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5571.96,
    "end": 5577.347,
    "text": " get traded off against, well, everybody's doing a little bit worse, but isn't that better than one person doing a lot worse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5577.547,
    "end": 5581.352,
    "text": "Well, it depends by how much you mean by a lot and a little and the situation and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5581.672,
    "end": 5587.96,
    "text": "So how does all of that going to be amenable to these kinds of seemingly cut and dry decompositions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5590.239,
    "end": 5592.141,
    "text": " Yeah, that is an excellent question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.421,
    "end": 5600.63,
    "text": "And another question that I would add to this is how many terms can you decompose this into as you think about more and more models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5600.73,
    "end": 5608.599,
    "text": "So here we have a lower level and a higher level, but can there be multiple levels for different kinds of scenarios?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5609.815,
    "end": 5632.456,
    "text": " awesome okay so they are now going to pick up on that bottom line there's a low and a high decomposition of the hierarchical variational free energy and they write this falls apart into a term for the lower level and the higher level of the hierarchy which we can further unpack for the higher level we get and then they provide a expansion of that f high and f low",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5633.377,
    "end": 5644.942,
    "text": " And these have the same complexity and accuracy interpretation as we saw with the previous F, except that this complexity minus accuracy can be understood as being about only the higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5645.462,
    "end": 5651.885,
    "text": "And this complexity minus accuracy on lower level can be interpreted as being about only the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5652.265,
    "end": 5656.127,
    "text": "So it's like been a separation of consideration between these levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5656.567,
    "end": 5659.048,
    "text": "But again, they're coming from a common joint distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5659.827,
    "end": 5678.29,
    "text": " so that is just like a example of taking the analogous logic and path that was followed on the single level model then using this composable framework making the nest degenerative model and then being able to apply the same kinds of techniques to reach the same kinds of conclusions but now in this different context",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5681.147,
    "end": 5682.389,
    "text": " Yeah, totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5682.87,
    "end": 5694.126,
    "text": "Yeah, splitting it into like these very specific terms and differentiating the forest from the trees where high is the forest and the lower level are the trees is very, very helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.467,
    "end": 5697.471,
    "text": "And it also shows how they are related and not related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.577,
    "end": 5700.657,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5701.078,
    "end": 5704.299,
    "text": "So now they're going to make that F to G move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5704.939,
    "end": 5713.302,
    "text": "When considering future time steps tau, the variational free energy becomes an expected free energy, which again unfolds to a term for each level in the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5713.882,
    "end": 5720.525,
    "text": "So they're going to do that F high and F low type decomposition, but it's going to be about G, the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5721.085,
    "end": 5723.526,
    "text": "And so here's the low on the right and the high on the left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5724.206,
    "end": 5727.508,
    "text": "And so here there's that same risk plus ambiguity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.408,
    "end": 5753.779,
    "text": " but now it's being applied to the decomposition between the high and the low and so similarly to equation four this unpacks in a risk term to reach a prior goal location and an ambiguity term intuitively this means the agent selects a route to its goal location with the lowest ambiguity hence if the agent operates in a completely static environment without uncertainty this basically becomes equivalent to shortest path planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5754.298,
    "end": 5764.882,
    "text": " So that was really interesting to hear about, again, in the context of what you described, like well mapped, well connected, real time updating, highly controlled settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5765.462,
    "end": 5783.548,
    "text": "The future is more like F than it is like G because it's like you can just trust in the future that you'll get a snapshot update and you'll be able to make the perfect move because you'll be able to do shortest path planning and traditional optimization techniques because you'll have no ambiguity about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5784.548,
    "end": 5786.95,
    "text": " the future, basically in the short term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5787.471,
    "end": 5793.997,
    "text": "And then that gets more complex when there actually is different kinds and different patterns of ambiguity in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5794.037,
    "end": 5796.099,
    "text": "So it's just like such a cool way to hear about it now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5797.441,
    "end": 5799.302,
    "text": "Yeah, couldn't have said it better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5800.163,
    "end": 5802.946,
    "text": "Similar thoughts on this particular framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5804.691,
    "end": 5823.11,
    "text": " that was section three in section four there now we still haven't seen active applied yet we haven't seen any action perception loops it's been like very analytical to this point so now in section four they're going to actually bring that generative model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5824.338,
    "end": 5825.76,
    "text": " into active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5825.86,
    "end": 5830.985,
    "text": "So they write, now we've established our generative model and the variational free energy optimization objectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5831.586,
    "end": 5837.172,
    "text": "We present how to instantiate such a model in Silico for navigation on a real robot with camera input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5837.912,
    "end": 5845.3,
    "text": "So it's kind of interesting because in Silico often means like we only simulated it, but here it means we implemented it on a Silicon processor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5846.121,
    "end": 5869.25,
    "text": " yeah in a uh in a real embedded situation and so um the observations are the raw pixels from the camera sensor and the actions consist of the command specifying the linear and angular velocity so that is just taking that generative model structure that we described kind of abstractly like the we just talked about the observed observations but is that a one pixel camera",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5869.77,
    "end": 5870.892,
    "text": " Is it a 4K video?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5871.232,
    "end": 5871.953,
    "text": "Is it LiDAR?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5872.314,
    "end": 5877.482,
    "text": "This is where they are going to connect it to the specifics of what they actually do in the robot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5879.522,
    "end": 5891.551,
    "text": " Yeah, the only thing I'll add is, again, this picture, because it's such a helpful picture in framing the pixels and the sensors that are being captured in their case as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5891.812,
    "end": 5902.4,
    "text": "So they are taking just this camera inputs, which is R, G, and B values for this particular paper, as well as the IMU units and the odometry units, which is velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.56,
    "end": 5904.8,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5905.781,
    "end": 5913.05,
    "text": "So in section 4.1, they highlight the visual perceptive aspects of their model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5913.23,
    "end": 5914.311,
    "text": "We're not going to describe it here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5914.491,
    "end": 5915.152,
    "text": "We'll hear about it soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5915.272,
    "end": 5918.496,
    "text": "But 4.1 focuses on that visual perceptive aspect. 4.2...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5920.498,
    "end": 5926.721,
    "text": " which we're also not gonna focus on here, takes it a little bit out from the visual perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5927.341,
    "end": 5930.102,
    "text": "How is the tree recognized given the retina?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5930.483,
    "end": 5933.684,
    "text": "And this is like the path integration around those trees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5934.344,
    "end": 5936.986,
    "text": "So this is a path integration approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5937.966,
    "end": 5945.69,
    "text": "And then they also bring up some points about how this has some similarities on the biological side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5946.75,
    "end": 5959.382,
    "text": " and also they introduced this topological map component of the higher generative higher level generative model the red model um do anything to add especially maybe about that topological basis of the higher model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5962.384,
    "end": 5968.548,
    "text": " Yeah, so this is where it's attaching it to the physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.928,
    "end": 5975.193,
    "text": "This is where the lower levels and higher levels get connected through these particular formulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5975.353,
    "end": 5978.995,
    "text": "So this is a question I will have for the authors as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5979.275,
    "end": 5983.158,
    "text": "How is this CAN-CN network represented?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5983.398,
    "end": 5988.782,
    "text": "And why did they choose this particular framing of connecting the two levels?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5989.301,
    "end": 5999.689,
    "text": " Yeah, they write, the posterior distribution, that's the one that we control, is represented by a continuous attractor network, a CAN, a 3D cube that wraps around the edges with these different dimensions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6000.93,
    "end": 6008.837,
    "text": "So that might enforce some type of closure on the network, which we also saw happening with the rat slam, but that'll be a good thing to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6009.497,
    "end": 6014.982,
    "text": "Okay, so then in section 4.3, they highlight the localization and mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6016.328,
    "end": 6018.47,
    "text": " These are being simultaneously inferred, so it's a SLAM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6019.151,
    "end": 6027.3,
    "text": "And this is the localization and mapping features, which are another level kind of above or different than just path integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6028.374,
    "end": 6032.397,
    "text": " and they relate that to the higher level model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6033.058,
    "end": 6040.003,
    "text": "So they provide some other formalisms and maybe this gets at what we were discussing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6040.724,
    "end": 6042.585,
    "text": "Due to odometry integration drift.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6042.625,
    "end": 6045.428,
    "text": "So inaccuracy about how many footsteps you took.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6045.468,
    "end": 6052.293,
    "text": "Like that's the kind of the reason why people apparently walk in a circle when they're lost in a feature list landscape, because they have like a little bit of a different step length.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6052.673,
    "end": 6054.214,
    "text": "And so they have drift in their heading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6055.515,
    "end": 6058.937,
    "text": " Matching experiences will not have exactly the same associated pose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6059.557,
    "end": 6066.641,
    "text": "These displacement errors are distributed throughout the graph by use of graph relaxation, shifting the stored pose according to equation 16.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6068.049,
    "end": 6075.314,
    "text": " This enforces the map to be topologically consistent even after loop closures, which is often challenging in metric slam systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6075.655,
    "end": 6081.939,
    "text": "So that definitely gets at Stephen's information geography or information geometry versus information topology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6082.399,
    "end": 6088.824,
    "text": "Because if we enforce a rigid geometry, then tiny differences might drive us wild.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6089.385,
    "end": 6094.228,
    "text": "But if we enforce topological closure, then even if a road like became 30% longer,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6095.529,
    "end": 6100.759,
    "text": " we'd still be able to navigate from city one to city two, and it wouldn't be so bothersome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6104.224,
    "end": 6120.48,
    "text": " Yeah, and including drift is one of the fundamental things all robotics experiments have to do because everything that we formulate via math never seems to work out well in actual physical sensors and actuators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6120.5,
    "end": 6126.606,
    "text": "There's always that drift term that needs to be added, and I like how they have handled the drift here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6127.904,
    "end": 6128.164,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6128.585,
    "end": 6134.83,
    "text": "In section 4.4, they discuss and highlight the navigation features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6135.41,
    "end": 6136.731,
    "text": "And here we'll talk more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6136.831,
    "end": 6143.957,
    "text": "I just want to raise these questions because they make up like three of the perspectives that are really getting integrated and recombined here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6143.977,
    "end": 6146.499,
    "text": "And you spoke to it right there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6146.679,
    "end": 6148.681,
    "text": "How do mathematical entities navigate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6149.381,
    "end": 6175.828,
    "text": " like bayesian graph models and generative models how do biological entities navigate and how do robotic entities navigate and what are their similarities and differences and different opportunities and challenges and how will we generalize and make the right kinds of connections across different systems within these domains and across and among these domains so that's an awesome complexity question i hope a lot of people can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6176.408,
    "end": 6181.23,
    "text": " enter into these questions and provide their thought and be involved in this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6183.29,
    "end": 6183.57,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6183.991,
    "end": 6190.793,
    "text": "I mean, this could be a whole section on navigating navigation, which is an interesting topic for complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.634,
    "end": 6192.894,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6193.895,
    "end": 6206.961,
    "text": "Okay, Section 5, and this will be, I think, just fascinating to hear their hands-on experience about these experiments, which we're not going to go into too much detail in, but in Section 5, they describe their setup and implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6207.542,
    "end": 6207.642,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6208.422,
    "end": 6213.585,
    "text": " This is a teleoperation of a mobile robot in a lab with a warehouse style.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6214.265,
    "end": 6221.049,
    "text": "And they describe some details about like what kind of robot they used, what kind of camera was used and how many data points existed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6221.589,
    "end": 6233.276,
    "text": "And then they talk a little bit about their implementation of how that generative model became basically implemented using machine learning as a LSTM network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6236.306,
    "end": 6249.639,
    "text": " Yeah, this is the most fun part of the paper for many robotics researchers because this is like the standard robotic toolkit that's used in almost all robotics labs around the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.999,
    "end": 6259.188,
    "text": "Turtlebot has become like this raspberry pie of robots in which every lab has one and anyone can replicate this kind of an experiment easily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6259.868,
    "end": 6267.411,
    "text": " And it's interesting that they have access to all these sensors that they talk about, such as LiDAR and millimeter wave radar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.451,
    "end": 6273.333,
    "text": "But they only use the minimal set of sensors they need, which is the RGB data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6273.973,
    "end": 6277.994,
    "text": "And that is what they use to collect data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6278.094,
    "end": 6284.336,
    "text": "And they are sampling it at an interval which is very close to human perception, like 100 milliseconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6284.797,
    "end": 6288.758,
    "text": "It gets close to biological level perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6289.698,
    "end": 6293.0,
    "text": " Like the frame rate that we have for our sensory organs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6293.601,
    "end": 6296.282,
    "text": "So that is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6296.342,
    "end": 6305.588,
    "text": "And the implementation is even more interesting, which we have to definitely ask the authors about how they use this setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6307.199,
    "end": 6307.539,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6307.74,
    "end": 6307.96,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6309.081,
    "end": 6315.226,
    "text": "In figure three, they show on the right side a picture of the bot, turtle bot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6315.486,
    "end": 6316.447,
    "text": "So there it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6317.088,
    "end": 6323.854,
    "text": "And then on the left side, we see some still images of the lab warehouse seen at different points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6323.894,
    "end": 6330.179,
    "text": "So here, point one on the map is corresponding to what was seen as approaching this wall and doing a U-turn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6331.42,
    "end": 6357.618,
    "text": " and um so this is the path that was taken as it was kind of uh circulating these warehouse shelves basically um yeah and also i really appreciate how like you described um the the commonality of these techniques um because those i just didn't know that this was such a common hardware and it'd be awesome to see like what it will look like when people start to deploy it in different settings",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6358.718,
    "end": 6361.7,
    "text": " Yeah, and it's important because they use ROS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6361.82,
    "end": 6365.143,
    "text": "First of all, Turtlebot uses the robot operating system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6366.023,
    "end": 6375.11,
    "text": "If this is the first time people are looking at a Turtlebot, by just looking at the image, you can tell that it's a Roomba with a shelf on top of it with many different sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6375.49,
    "end": 6377.592,
    "text": " So honestly, that's all there is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.012,
    "end": 6388.902,
    "text": "So the movement is done by the vacuum cleaner on the bottom, the cleaning robot module on the bottom of the robot, and then the rest of the rack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6389.242,
    "end": 6392.925,
    "text": "The rack is full of sensors where you see the cameras attached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6393.365,
    "end": 6399.891,
    "text": "So earlier, there used to be Kinect cameras attached, and you can attach any sorts of additional units on top of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6400.151,
    "end": 6407.016,
    "text": " And then there's a processing unit there which takes in all those inputs and does all the calculations on board.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.517,
    "end": 6411.46,
    "text": "So yeah, reproducibility in robotics research is extremely rare.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.72,
    "end": 6418.625,
    "text": "And using a technique like this definitely helps for other labs to reproduce these kinds of results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6420.011,
    "end": 6421.012,
    "text": " Yeah, thanks for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6421.113,
    "end": 6425.899,
    "text": "And I'd be really curious to learn more also about the edge computing implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6425.979,
    "end": 6427.301,
    "text": "Is that a mini PC?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6427.381,
    "end": 6428.703,
    "text": "What exactly is needed here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6428.803,
    "end": 6430.405,
    "text": "What if the model were 100 times simpler?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6430.686,
    "end": 6433.149,
    "text": "What if it were 100 times more complex?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6433.87,
    "end": 6434.792,
    "text": "So in section 5.3,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6437.355,
    "end": 6445.057,
    "text": " they discuss the results and they ask three research questions and those are addressed in the following sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6445.097,
    "end": 6452.259,
    "text": "So they ask, does that lower level model learn accurate representations for inference and prediction by minimizing free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6452.739,
    "end": 6454.5,
    "text": "So does the lower level work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6455.58,
    "end": 6458.901,
    "text": "Two, can these representations be used in the hierarchical model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6460.39,
    "end": 6462.731,
    "text": " for generating topological maps of the environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6463.352,
    "end": 6471.996,
    "text": "Because although we kind of didn't discuss it in detail, that is that topological closure that's impressed upon at the higher level, but not at the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6472.396,
    "end": 6473.937,
    "text": "So can the lower level work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6474.597,
    "end": 6482.702,
    "text": "And then can it be used as a useful interface with this totally different in type topologically closed higher level model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.542,
    "end": 6492.41,
    "text": " And then the holistic question is, does the system infer sensible moves and actions by minimizing expected free energy to engage in navigation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6492.95,
    "end": 6503.539,
    "text": "Like, okay, given that the two components are interfacing, does the whole thing do free energy minimization in a way that ends up doing so-called sensible moves?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6504.46,
    "end": 6527.818,
    "text": " that is maybe what um a person would do if they said just patrol that warehouse just walk around without any too specific of a goal but just make sure that you walk everywhere pretty much that's pretty sensible they didn't spend any time over here they didn't just go up and down one shelf so that's sensible even though there's not quite a heuristic for that but i think that's really a fascinating question what is sensible behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6530.273,
    "end": 6530.974,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6531.214,
    "end": 6538.46,
    "text": "And I think they go into how they quantify sensible behavior by comparing it with other approaches in the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6538.78,
    "end": 6541.403,
    "text": "So it will be interesting to ask the authors about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6542.383,
    "end": 6542.584,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6543.304,
    "end": 6543.584,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6543.604,
    "end": 6548.068,
    "text": "Table one just goes into some details about their neural network parameterization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6548.609,
    "end": 6550.39,
    "text": "We'll hear about it from the authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6550.43,
    "end": 6552.412,
    "text": "So how did neural networks come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6552.472,
    "end": 6554.434,
    "text": "What was the process of fitting that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6555.154,
    "end": 6555.315,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6556.055,
    "end": 6556.536,
    "text": "Figure four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6557.329,
    "end": 6563.714,
    "text": " All right, figure four is the sequences of the ground truth observations, first row.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6564.194,
    "end": 6566.896,
    "text": "So that's the video data coming in on the top.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6566.977,
    "end": 6569.258,
    "text": "That's like, just looks like regular video data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.159,
    "end": 6572.381,
    "text": "Reconstructed observations, second row.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6572.901,
    "end": 6575.643,
    "text": "That's the generative model of visual input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6576.104,
    "end": 6581.608,
    "text": "And that's kind of like thinking about this in terms like a core screening, but this brings the visual input into the robot's terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6582.569,
    "end": 6586.232,
    "text": "Corresponding to latent space samples, third row.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6586.972,
    "end": 6592.815,
    "text": " So this is like potentially an internal representation, like a layer of a neural network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6593.455,
    "end": 6610.263,
    "text": "And so it's just showing that these perhaps very similar or different scenes can be differentiated via their position in like a higher dimensional latent space, or it's lower dimensional in the video, but it's higher dimensional than just like the X and the Y.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6612.558,
    "end": 6635.571,
    "text": " robot is turning towards the left in the sequence as can be seen from both the sequence of observation as well as the shift towards higher theta values in the pose cube and that's the pose cube activation on the bottom row so this is what it looks like at that lower model to go from video data to hidden state estimation the kind of coarse graining generative model of the video",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6636.587,
    "end": 6644.349,
    "text": " to this latent state internal representation to the pose estimation that's going to come into play at the higher level of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6644.769,
    "end": 6653.552,
    "text": "They're kind of overlaying time steps as columns during this execution of a turn and showing how different layers of that lower model are updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6656.454,
    "end": 6657.234,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6657.474,
    "end": 6659.615,
    "text": "And I think this is a time series like you described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6659.655,
    "end": 6666.996,
    "text": "Left to right indicates like 10 seconds, for example, 10 seconds of a turn of a robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6667.677,
    "end": 6677.459,
    "text": "And that was an interesting comment on the higher level dimension for a robot is lower level fidelity for us with those pixels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6677.999,
    "end": 6686.463,
    "text": " So yeah, the way we represent things and the way it's represented in a robot can have very different terminologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6688.023,
    "end": 6693.626,
    "text": "Yeah, and higher, lower, inner, outer, more, less, it's always in relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6693.686,
    "end": 6695.827,
    "text": "And so those can sometimes get swept under the rug.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6696.287,
    "end": 6698.708,
    "text": "It's a high dimensional representation that we did of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6700.909,
    "end": 6702.409,
    "text": "What do you have to ask in 42.0?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6702.569,
    "end": 6702.829,
    "text": "How high?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6705.848,
    "end": 6706.328,
    "text": " Pixels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6707.349,
    "end": 6708.549,
    "text": "It's just a few pixels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6710.35,
    "end": 6720.455,
    "text": "In Figure 5, they show the generated experience map left and a comparison map extracted from localization with RTAB map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6720.855,
    "end": 6731.14,
    "text": "I show the citation here, but I would love to hear your interpretation of what do they mean by the experience map is topological while the RTAB map is metric?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6731.34,
    "end": 6733.702,
    "text": "What are being shown differently here, here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6736.778,
    "end": 6746.807,
    "text": " Yeah, so yeah, they're comparing the figure that they obtained on the left with the data obtained from a similar technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6746.847,
    "end": 6753.133,
    "text": "So the way these robotics experiments work is they use different localization techniques and they are using RTAB",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6753.913,
    "end": 6755.654,
    "text": " which is another technique on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6755.895,
    "end": 6758.456,
    "text": "And yeah, the second point is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6758.536,
    "end": 6766.161,
    "text": "And I think that is Stephen's question as well, which is how is the information geography represented?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6766.321,
    "end": 6776.948,
    "text": "So the experience map, which is on the left, it briefly describes how the environment is topologically constructed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6778.7,
    "end": 6779.6,
    "text": " Yeah, closed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6780.261,
    "end": 6787.784,
    "text": "And the RTAP map is accurate to physical world metric units, which is measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6789.085,
    "end": 6792.367,
    "text": "So topology just means how everything is oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6792.947,
    "end": 6795.028,
    "text": "It doesn't need to be physically precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6795.868,
    "end": 6799.59,
    "text": "As a real world, it's like wisdom versus knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6799.85,
    "end": 6801.071,
    "text": "So topology is more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6802.372,
    "end": 6808.378,
    "text": " more of an idea that if you follow this kind of a map, you will find your way and you won't get lost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6808.739,
    "end": 6819.55,
    "text": "Whereas metric is like precise mapping of the physical environment and mapping it to scale, like one is to 20 or one is to 100 or whatever that scale may be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6821.341,
    "end": 6849.665,
    "text": " i really like that knowledge and wisdom and then here's um why there's always the minimum of two and why we respect both because the topological maps may be totally non-comparable in their geometry for two different entities mapping the same space and so if we are both trying to get the geometry of the geography that's where it's possible to have the most objective agreement on the knowledge side",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6850.583,
    "end": 6870.113,
    "text": " allegorically here and then the topological side can be so much simpler and so much more personalized and local and can actually help in those wayfinding and the changing situations and maybe there's analogy or there's resonance or there's small isomorphisms with different wisdoms but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6871.754,
    "end": 6894.677,
    "text": " one has gone down that path and has basically given up making the image on the right that other people will just see and recognize as well yeah that totally lines up with what i see so it's quite a nice point yeah okay figure six uh is some more outputs of the model so they uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6895.785,
    "end": 6897.187,
    "text": " Right, imaginary policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6898.99,
    "end": 6899.892,
    "text": "Imaginary policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6900.553,
    "end": 6902.957,
    "text": "So there's several images of different things happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6903.618,
    "end": 6904.479,
    "text": "There's the current state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6905.56,
    "end": 6908.141,
    "text": " which is the video input at that time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6908.821,
    "end": 6911.081,
    "text": "And then there's imagined short-term goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6911.641,
    "end": 6912.662,
    "text": "I want it to look like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6912.862,
    "end": 6917.183,
    "text": "I want the frame differencing at that time step to be super small.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6917.823,
    "end": 6922.164,
    "text": "I want to be really unsurprised about looking like this at that short time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6922.684,
    "end": 6928.605,
    "text": "In this turn, you can kind of see that piece on the left that's getting brought more into view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6929.205,
    "end": 6931.446,
    "text": "As I turn my head left, I don't want to be surprised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6931.586,
    "end": 6932.526,
    "text": "I want it to feel normal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6933.226,
    "end": 6945.513,
    "text": " And then in the long-term goal, there's a lot more like blurriness because it's not super important whether the handle is here or here because it's just an uncertain future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6946.293,
    "end": 6953.417,
    "text": "And so these are imagined policies that can be considered at past, present and future time steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6953.817,
    "end": 6958.8,
    "text": "And that's kind of what the partial observability of the hidden Markov model structure or motif",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6959.46,
    "end": 6973.833,
    "text": " brings into this picture this is why it's good to have a generative model rather than just a recognition or an input a signal processing model that's like where the whole generative bayesian concept and predictive processing from the biological side come into play",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6975.356,
    "end": 6977.057,
    "text": " And also in the future, it trails off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6977.077,
    "end": 6978.317,
    "text": "These are the same time series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6978.817,
    "end": 6985.8,
    "text": "And further and further in the future, it gets blurry and blurrier until it's like, I just want to be in a horizontal plane in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6986.681,
    "end": 6987.141,
    "text": "Basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6988.361,
    "end": 6988.742,
    "text": "Standing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6989.242,
    "end": 6989.422,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6991.706,
    "end": 7002.978,
    "text": " Figure D is very interesting in this particular picture where they have three different policies and you see very different results as a result of those policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7003.278,
    "end": 7011.427,
    "text": "This is robotics 101 behavior where you program the robot to always go left, always go right, or always go straight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7012.007,
    "end": 7022.977,
    "text": " And you start with these particular policies and then understand that these simple changes in behavior have such vast differences in the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7023.917,
    "end": 7026.58,
    "text": "So yeah, the sentence you just highlighted is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.08,
    "end": 7027.34,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.52,
    "end": 7033.784,
    "text": "So here the three policies are basically the two different turns are going straight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7033.904,
    "end": 7041.648,
    "text": "And so they say when calculating G low and evaluating the distribution on policies, this results in a probability close to one to take the policy go left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7041.828,
    "end": 7045.029,
    "text": "Like look at how on the bottom row, that's the go left policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7045.83,
    "end": 7047.431,
    "text": "It stays sharp in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7048.288,
    "end": 7058.276,
    "text": " But then the policies that diverge increasingly from the goals at different timescales, with respect to those goals, it becomes really unclear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7058.296,
    "end": 7059.437,
    "text": "So it's like, I want $100.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7060.278,
    "end": 7061.859,
    "text": "So I'm saving $1 per day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7062.32,
    "end": 7064.422,
    "text": "Then at day 71, I expect $71.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7064.622,
    "end": 7066.163,
    "text": "Wow, it's exactly $71.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7066.583,
    "end": 7067.784,
    "text": "That's like this bottom time one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7068.105,
    "end": 7070.146,
    "text": "And this is like, I'm losing money every day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7070.227,
    "end": 7071.608,
    "text": "I'm getting less and less clear on...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7072.108,
    "end": 7075.05,
    "text": " on how it's going to end up at 100 at this future time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7075.631,
    "end": 7083.257,
    "text": "So maybe that's not a good policy, not because my expected value is dropping, but because it's unclear how I'm going to get to 100.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7083.837,
    "end": 7089.021,
    "text": "And that's something that can be neutrally said without even taking a judgment on the amount at any given time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7091.109,
    "end": 7091.369,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7092.11,
    "end": 7092.31,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7092.891,
    "end": 7099.777,
    "text": "I think that analogy really drives the point home that you need to choose your policies according to the goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7100.297,
    "end": 7105.642,
    "text": "And I think all those goals were part of their formulation of the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7106.182,
    "end": 7112.588,
    "text": "So I think it's important to ask this to the authors, like how were these goals as well as policies chosen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7113.389,
    "end": 7117.092,
    "text": "And can this be generalized for different kinds of environments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7118.14,
    "end": 7118.4,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7118.72,
    "end": 7124.841,
    "text": "So figure seven, they write different goals for the long-term path of figure five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7125.261,
    "end": 7130.682,
    "text": "So just here's the figure five again with the topological closure of the higher model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7132.162,
    "end": 7138.383,
    "text": "The lower level dynamics model will take the corresponding states as preferred state goals sequentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7139.204,
    "end": 7143.984,
    "text": "So this is where we see the connections between the models becoming enacted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7144.425,
    "end": 7145.585,
    "text": "So let's just say that one is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7147.355,
    "end": 7150.016,
    "text": " coming around this edge, and there's two options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7150.056,
    "end": 7155.637,
    "text": "They can continue straight or they can go right, or they can go in reverse, but we're considering forward motion only.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7155.917,
    "end": 7157.478,
    "text": "So there's two alternate policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7157.858,
    "end": 7174.102,
    "text": "It's not the infinite space decision-making that humans are sometimes confronted with, but here it's a robotics motion decision about continuing straight, ostensibly to explore this final rightmost shelf sequence, or taking the right turn now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7174.282,
    "end": 7175.683,
    "text": "So go straight or turn right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7176.403,
    "end": 7178.223,
    "text": " Now, what would sensible behavior be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7178.723,
    "end": 7188.045,
    "text": "If one had recently or repeatedly visited the closer shelf, then to be more exploratory, it would make sense to like go straight so that this last shelf could be explored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7188.365,
    "end": 7195.566,
    "text": "So that's the kind of decision that we would want that robot to be able to incorporate when it's able to be making that decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7196.386,
    "end": 7205.808,
    "text": "And so that could be thought of as having a long-term goal to be expecting oneself to be on the far right shelf here, the bottom one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7206.653,
    "end": 7217.037,
    "text": " And then in the moment, which one of these actions, turn right or go straight, is going to be preferred with respect to how one acts now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7217.477,
    "end": 7225.42,
    "text": "And so then that's what it means to say the lower level dynamics model will take the corresponding states from the higher long-term path as the preferred state goals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7226.401,
    "end": 7229.042,
    "text": "So then one could be like, well, I'd prefer to see myself just right here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7230.022,
    "end": 7231.663,
    "text": "Already one has chosen a branch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7232.677,
    "end": 7236.918,
    "text": " But that is helping you reduce your uncertainty about being found here later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7237.598,
    "end": 7245.4,
    "text": "So that, although I really look forward to also hearing everyone else's like unpacking of like, what is the robot doing or thinking in that pivot moment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7246.26,
    "end": 7253.742,
    "text": "That's like kind of how I read the way that the long-term planning goals become imposed upon the lower level action selections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7258.191,
    "end": 7259.152,
    "text": " Yeah, I agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7259.212,
    "end": 7260.733,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7261.733,
    "end": 7266.056,
    "text": "What did you see or want to talk about with the contrast with other slam approaches?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7266.076,
    "end": 7270.639,
    "text": "Let me see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7271.963,
    "end": 7277.225,
    "text": " So yeah, this paragraph describes different SLAM approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7278.046,
    "end": 7286.63,
    "text": "And you see the same group of authors mentioned from probabilistic robotics, where Sebastian Thrun and the co-authors are mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7287.31,
    "end": 7293.073,
    "text": "And those were engineered approaches, which also used different kinds of Bayesian approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7294.995,
    "end": 7311.473,
    "text": " like statistics and then there were more bio-inspired approaches such as the rat slam group which is the 2013 paper and then yeah they rely on post scan and this experience map which they compare it with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7312.314,
    "end": 7323.3,
    "text": " And recently, deep learning has obviously been used on Visual SLAM, like you see in the bottom of this paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7324.18,
    "end": 7330.043,
    "text": "And yeah, the underlined section is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7330.083,
    "end": 7331.063,
    "text": "Do you want to cover that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7331.283,
    "end": 7334.325,
    "text": "The active inference allow for a holistic treatment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7335.859,
    "end": 7342.883,
    "text": " I think that's where they bring it home, which is they say, well, yes, people have used this recognition variational autoencoder model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7343.263,
    "end": 7349.066,
    "text": "And yes, there's been this topological approach to rat slam navigation closer and et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7349.386,
    "end": 7353.908,
    "text": "But then those are often, again, composed in an ad hoc way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7355.369,
    "end": 7364.774,
    "text": "And so active inference is providing a possible way to approach it in a more principled and more integrative first principles way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7367.875,
    "end": 7369.157,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7370.298,
    "end": 7370.739,
    "text": "Conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7371.08,
    "end": 7372.522,
    "text": "Let's hear it from the authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7372.802,
    "end": 7382.496,
    "text": "People can draw their own conclusions, but I'll just highlight the last sentence that we think this research direction might offer new insights, both on how navigation works in the mammal brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7383.857,
    "end": 7403.577,
    "text": " well as how to scale active inference to real world applications so it's like those were the three vectors we brought in with the biological mathematical and the robotics and then from that nexus it's kind of like it feeds back out because now from the brain they might be learning about the math and the robotics and then the others uh in a similar fashion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7404.864,
    "end": 7431.68,
    "text": " Yeah, and as the authors conclude the paper, they also bring up some open questions such as can these techniques be used for lifelong learning, which is a relatively new field of machine learning in which states change all the time and you do not need to retrain your model, but you just need to retrain specific parts of your model to continuously learn throughout the lifetime of that application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7432.1,
    "end": 7436.282,
    "text": " So they suggest something like a sleep cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7436.322,
    "end": 7449.707,
    "text": "That means that whenever the robot is charging, that is when it can update its model of the entire environment and share that and do that active inference approach to achieve lifelong learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7450.087,
    "end": 7454.549,
    "text": "So I'll be very interested in knowing this from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7454.829,
    "end": 7460.631,
    "text": "What are the weaknesses in this approach and how can this be solved to scale for real-world applications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7461.815,
    "end": 7462.115,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7462.275,
    "end": 7465.796,
    "text": "And how about just describe what this last video is showing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7466.937,
    "end": 7473.359,
    "text": "Yeah, so this video is just for people who are coming from the Active Inference Lab but want to see like a robot actually move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7473.659,
    "end": 7475.42,
    "text": "We have been talking about robots moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7475.46,
    "end": 7482.422,
    "text": "So if we play the video, it's just an introduction to TurtleBot and how people use it in an experimental setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7482.843,
    "end": 7489.165,
    "text": "So yeah, the first few seconds of the video will describe all there is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7491.129,
    "end": 7492.469,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7492.729,
    "end": 7497.371,
    "text": "Well, we leave a blank slide for the discussion sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7497.551,
    "end": 7501.732,
    "text": "This was an awesome and memorable discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7502.392,
    "end": 7512.214,
    "text": "And it's just the opening of the 42 when we'll continue on in a participatory group setting in the coming two weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7512.895,
    "end": 7517.516,
    "text": "And hopefully have any of the authors join or anyone else who would like to join in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7518.816,
    "end": 7526.158,
    "text": " I'll let you give a penultimate thought, but just really appreciated the care that you brought to these slides and to this stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7528.679,
    "end": 7533.36,
    "text": "Yeah, and thanks to Stephen and everyone else who asked questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7534.961,
    "end": 7535.741,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7535.961,
    "end": 7537.741,
    "text": "So do you have anything else you want to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7537.802,
    "end": 7542.563,
    "text": "Otherwise, we can just thank the listeners and head out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7543.752,
    "end": 7555.397,
    "text": " Yeah, I mean, this was my first active inference appearance in the sequence of hopefully a lot of appearances in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7555.538,
    "end": 7565.162,
    "text": "And this clarified a lot of concepts for me as well and connected it to one of the fields that I was very intimately connected with almost a decade back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7565.262,
    "end": 7569.604,
    "text": "So yeah, happy to see connections being reforged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7570.224,
    "end": 7570.525,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7571.745,
    "end": 7574.307,
    "text": " Yeah, looking forward to meet with the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7575.587,
    "end": 7575.807,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7577.108,
    "end": 7577.929,
    "text": "Thanks a lot, Sid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7577.949,
    "end": 7578.569,
    "text": "Thanks, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7578.729,
    "end": 7579.69,
    "text": "And see you next week.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7579.75,
    "end": 7579.93,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7581.451,
    "end": 7581.771,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]