[
  {
    "start": 0.249,
    "end": 24.388,
    "text": " to copy or not to copy that is the question from chimpanzees to the foundation of human technological culture recently appeared in physics of life reviews let me see if this works yeah sorry so it always start with a jigsaw puzzle and and the puzzle is why a highly innovative species like chimpanzees do not live in a complex technological world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.157,
    "end": 27.859,
    "text": " So we know chimpanzees are very inventive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.3,
    "end": 29.36,
    "text": "They are very creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.721,
    "end": 30.561,
    "text": "They are insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.162,
    "end": 32.483,
    "text": "They can learn socially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.584,
    "end": 42.931,
    "text": "But what we don't see in the same extent or similar extent we see in humans is the accumulation of complexity across generations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.812,
    "end": 72.889,
    "text": " you can see here in these images we have one of the more complex and demanding tasks that chimpanzees perform cracking nuts open and they can combine different tools they can use it in the appropriate order so this means they are very insightful and yet if we compare it with a rocket that can bring civilization to mars um it is clear that the accumulation of technology across generation works very differently in humans and other non-human species",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.083,
    "end": 84.779,
    "text": " So the basic question or the $1 million question is why does innovation fail to translate into technological cumulative complexity in chimpanzees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.961,
    "end": 88.986,
    "text": "Does it owe to a limited capacity to copy with fidelity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.907,
    "end": 100.953,
    "text": " or what is referred to as true imitation, which means reproducing not only the end result that would be emulating or emulation, but also the steps that lead to that end result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.513,
    "end": 109.238,
    "text": "So according to this view, failure to copy innovation with faithful accuracy hampers the intra and intergenerational spread.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.898,
    "end": 136.608,
    "text": " and any ensuing ratcheting up effects so possibly when coping with fidelity is impeded innovative performances are unlikely to leave their protagonist and this brings us back to the discussion we had the other day in the snakes and others paper where we said that after two million years ago early homo produced this almond shame be facially flaked stones and but this um kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.623,
    "end": 148.651,
    "text": " artifacts that we don't even dare to call them tools were not copied by conspecific observers because perhaps they were not attributing to them any kind of functional use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.731,
    "end": 156.356,
    "text": "So perhaps they were not seen as tools and were the result of manual inactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.097,
    "end": 157.237,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.322,
    "end": 171.667,
    "text": " So to ratchet up complexity, it is important that inventions, that is, tools, are copied with sufficient fidelity so that they retain the fundamental features or attributes that make them functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.568,
    "end": 184.153,
    "text": "So following the steps of demonstrated tool manufacture by an expert model to the letter is the simplest, fastest, and cheapest way to make sure that copies of the original artifact are accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.043,
    "end": 190.745,
    "text": " and here cheapest we refer to in terms of expenditure of energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.805,
    "end": 206.089,
    "text": "So if the copies are functional, hence useful, they keep circulating in the group community longer, and this gives increased opportunities for one or more individuals different from the original inventor to act in complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.609,
    "end": 214.291,
    "text": "So for example, one individual invents a wooden spur, and 100 years later, this melting of copper is discovered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.245,
    "end": 220.508,
    "text": " And another individual adds to it, to this spur, a sharp copper point, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.489,
    "end": 228.092,
    "text": "So here is an interesting concept of ratchet effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.857,
    "end": 234.04,
    "text": " that would explain in part why humans have built such complex cultural and technological work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.601,
    "end": 238.963,
    "text": "So the idea of the ratchet effect is that no generation starts from scratch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.284,
    "end": 246.508,
    "text": "Instead, inventions and cultural products created by one generation are kept in mind and transmitted to the next generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.109,
    "end": 251.992,
    "text": "This way, every generation is better off, supposedly, than the one that preceded it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.901,
    "end": 254.543,
    "text": " So here we can think of books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.703,
    "end": 263.434,
    "text": "Books are a wonderful way of keeping information, sharing it across generations and among the same generation also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.275,
    "end": 271.945,
    "text": "So thus technological complexity and success in humans is not dependent solely on the geniality of one or few individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.674,
    "end": 280.419,
    "text": " It is a joint endeavor where many individuals contribute their specific expertise and skills to produce increasingly complex artifacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.079,
    "end": 291.706,
    "text": "And again, we can think in establishing a colony in Mars, no single human alive could achieve that alone or would have the required expertise to achieve that alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.206,
    "end": 295.108,
    "text": "But all together, we can perhaps manage that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.368,
    "end": 300.691,
    "text": "So we need this kind of shared knowledge and accumulated across generations, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.598,
    "end": 316.889,
    "text": " So why it is some behaviors or innovation are copied or not can be explained at the level of social dynamics, but also at the level of the brain, or giving a more mechanistic explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.349,
    "end": 333.062,
    "text": "So explanation of why copying of behavior in chimpanzees does not occur with frequency have been often kept at the level of social dynamics, where factors such as social prestige, dominance, et cetera, are said to be key to explaining whether or not an invention is adopted by observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.15,
    "end": 336.69,
    "text": " And this approach relegates the brain to a subsidiary role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.511,
    "end": 347.972,
    "text": "Here, Michael and I, what we attempt is to identify what the minimum cognitive requirements are that can give rise to innovations and their horizontal and vertical transmission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.053,
    "end": 357.974,
    "text": "And we also attempted to differentiate the cognitive ingredient necessary for innovation from those that need to be in place for the adoption of an innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.814,
    "end": 361.835,
    "text": "So we wanted to establish a clear demarcation between the brains",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.992,
    "end": 370.098,
    "text": " the ones that innovate and the brains of those who observe an innovation, because we think this is important to be analyzed separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.361,
    "end": 383.469,
    "text": "So in order to see which are the mechanisms at the level of the brain that would allow for one innovation to be copied, we invoked the lens of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.682,
    "end": 400.895,
    "text": " According to active inference under the free energy principle, it is through their being limited to a restricted number of states, that is the attracting set, that organisms minimize the variational free energy of the internal states and resist entropic dissipation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.276,
    "end": 414.345,
    "text": "Minimizing variational free energy reduces prediction sensation discrepancies, prediction errors, that can be corrected by active sampling of predicted sensory inputs and perceptive modification of prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.578,
    "end": 426.582,
    "text": " This is sometimes expressed in terms of perceptual inference, that is, changing predictions to match sensations, and active inference, reactively changing sensations to match predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.42,
    "end": 436.647,
    "text": " Innovation, in a way, might represent a potential misfiring from a Darwinian perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.268,
    "end": 440.232,
    "text": "So minimizing variation of free energy can be achieved through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.532,
    "end": 448.463,
    "text": "Sensing creatures can act, active inference in order to fulfill their predictions, and thereby reduce discrepancy between the latter and sample reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.758,
    "end": 461.221,
    "text": " Being limited to a restricted number of states, what we could refer to as the attracting set, is therefore synonymous with minimizing variation of energy and hence maximizing adaptive fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.802,
    "end": 470.324,
    "text": "Here, innovation represents an anomaly and innovators are unorthodox actors or protagonists who entertain new courses of action or plans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.724,
    "end": 475.445,
    "text": "New phenotypical responses that have not been previously entertained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.48,
    "end": 483.702,
    "text": " And according to this interpretation of the free energy principle, it is at the level of policy selection where innovators stand apart from the crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.602,
    "end": 500.206,
    "text": "Their policy selection is, in a sense, faulty insofar as their ensuing behavioral outcomes are in marked contrast to those of their fellow actors who deploy orthodox responses that reduce discrepancies between predictions and sensations, thereby reducing the prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.846,
    "end": 505.247,
    "text": "And here when we talk of mispiring, we don't do it in a kind of negative sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.936,
    "end": 535.087,
    "text": " is just to express that these new behaviors these innovations necessarily will produce more surprise okay seeing surprising things with this phrase i i'm kind of paraphrasing andy clark in a paper in behavioral and brain sciences he referred to seeing surprising things to being able to lend credibility to the sensory information that is not in accordance to prior beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.363,
    "end": 547.307,
    "text": " So, the family of probability density is entertained by an individual, irrestricted to the system's prior bias and beliefs, equivalent, roughly speaking, to its phenotypical repertoire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.247,
    "end": 558.051,
    "text": "This means, by definition, that innovative behavior is both unlikely to be evinced in any given phenotype, and crucially, difficult to recognize when observed by another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.73,
    "end": 575.342,
    "text": " Should an innovator's behavior diverge markedly from the repertoire of plausible policies used usually by an observer to predict another's behavior, it may be beyond the capacity of the latter's generative model to recognize it, that is, to make sense of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.434,
    "end": 588.765,
    "text": " So large discrepancies pose a threat to the brain because one, updating involves making energetic demands, and two, risk reducing adaptive fitness by inappropriately changing the generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.266,
    "end": 594.19,
    "text": "And here we need to think that the generative model has been selected also in a specific economy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.31,
    "end": 598.174,
    "text": "So changing it might have risks, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.26,
    "end": 607.583,
    "text": " So what is required for a brain to entertain generative models that involve unusual or bizarre behaviors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.903,
    "end": 625.671,
    "text": "The hierarchical predictive interpretation of the brain or hierarchically mechanistic mind, an inference machine, sorry, implies that each level of the hierarchy of cerebral neuronal circuits conveys predictions or conditional expectations that suppress errors at the level below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.471,
    "end": 631.632,
    "text": " while concurrently conveying errors that permit the revision of the expectations at the level above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.653,
    "end": 644.096,
    "text": "Possibly, dynamical precision weighting enables the system, that is the brain, to readjust the confidence afforded to top-down expectations as opposed to bottom-up prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.076,
    "end": 645.656,
    "text": "In other words,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.443,
    "end": 661.521,
    "text": " In order to entertain a prior that an unlikely hypothesis might explain best some behavior weakness, it is first necessary to relax the precision or commitment to prior beliefs, thus enabling new or implausible hypothesis to explain novel behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.263,
    "end": 664.784,
    "text": "And here I introduce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.374,
    "end": 693.756,
    "text": " some things we discussed the other day professor freestone talk of attenuation of sensory information in relation to saccades which is kind of switching of this sensory information we are being aware of and that would be the opposite as being impressionable so i'm quoting professor freestone here if i can copy that means i am impressionable i will accumulate new evidence very quickly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.452,
    "end": 701.014,
    "text": " I have the capacity to assign greater evidence or precision to sensory evidence and suspend the precision to my prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.214,
    "end": 710.136,
    "text": "This is something he mentioned in the last active in-frame recording, 53.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.617,
    "end": 723.22,
    "text": "And to end this introduction, one concept we introduced in our paper, which is central to our discussion, is that of zones of bounded surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.971,
    "end": 734.076,
    "text": " So this is a new concept introduced to refer to the levels of mismatch between prior beliefs or top-down predictions and sensory information that a species can tolerate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.857,
    "end": 744.222,
    "text": "So first and foremost, the focus of the ZBS concept is on the observers and their ability to make sense of unobserved innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.501,
    "end": 758.634,
    "text": " Encoding and subsequent copying of an innovation depends on the degree of disparity or surprisal between predictable behaviors, namely those typical of the species, and the perceptual incoming information about novel behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.755,
    "end": 767.663,
    "text": "If the set BS is wide, it means that the species can give credit to the information received through its senses that challenges the prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.536,
    "end": 779.879,
    "text": " In short, a species can register, encode, and potentially reproduce innovative behavior observing con-specifics that deviate markedly from customary prototypical behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.579,
    "end": 786.6,
    "text": "The species is highly impressionable, if we use the words that Professor Friston used the other day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.32,
    "end": 797.863,
    "text": "So if the set bias is narrow, then a species' ability to change prior beliefs to accommodate new evidence regarding innovative practices observing con-specifics is compromised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.994,
    "end": 810.546,
    "text": " I guess to end up and avoid any kind of misunderstanding, we want to make clear that our zone-rebounded surprises have nothing to do with the zone of latent solutions by Tenier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.187,
    "end": 813.269,
    "text": "Albin, we are discussing similar topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.85,
    "end": 815.612,
    "text": "So the zone of latent solutions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.465,
    "end": 822.288,
    "text": " that was introduced by Tenie, Kai and Tomo Aselo refers to solutions to a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.929,
    "end": 836.417,
    "text": "For instance, extractive foraging that can be achieved by an individual in isolation during his or her lifetime and hence is not likely to be the product of cumulative culture involving social learning when observed in the wild.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.457,
    "end": 845.602,
    "text": "And for those readers interested in this concept, they can go to the original paper I'm showing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.537,
    "end": 854.102,
    "text": " And also, there is a recent paper by Andrew Whiten, who is a professor in St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.222,
    "end": 860.225,
    "text": "Andrews, that discusses this concept and that has replication by other authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.285,
    "end": 863.287,
    "text": "So it might be a good update for those interested also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.088,
    "end": 868.17,
    "text": "And with that, I finish this short presentation, and we can enter discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.151,
    "end": 872.212,
    "text": "Let me stop sharing screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.352,
    "end": 873.173,
    "text": "OK, now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.25,
    "end": 876.491,
    "text": " Thank you, Hector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.511,
    "end": 885.779,
    "text": "I will bring up the notes again, and to Michael, Carl, or Dean, whomever would like to provide a first response, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.107,
    "end": 897.168,
    "text": "Well, I don't really have a great deal more to add.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 899.19,
    "end": 903.694,
    "text": "I think... Hello?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 904.915,
    "end": 905.855,
    "text": " Yes, please continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.875,
    "end": 907.696,
    "text": "I'm not sure what's happened here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 909.276,
    "end": 909.997,
    "text": "You're all good, Michael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.817,
    "end": 911.857,
    "text": "We're here, Michael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.397,
    "end": 912.737,
    "text": "Hello?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 913.538,
    "end": 914.078,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 914.458,
    "end": 915.118,
    "text": "Yes, we hear you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.178,
    "end": 915.538,
    "text": "Continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.978,
    "end": 916.699,
    "text": "Yes, we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.779,
    "end": 918.159,
    "text": "I'm not quite sure what's happened here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 918.659,
    "end": 922.54,
    "text": "We seem to have snakes and ladders up on the screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 924.021,
    "end": 928.042,
    "text": "As I said, I don't think I can add much more to what Hector has just said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 928.062,
    "end": 934.004,
    "text": "I think it makes a very succinct summary of our paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 935.001,
    "end": 962.368,
    "text": " And I would like to certainly congratulate Hector for making what seems to me a very original and perceptive observation that it is the observers whom we have to thank for copying and therefore for the handing down of technological achievements by early humans",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 965.011,
    "end": 973.396,
    "text": " whereas too often the emphasis has been made on the person responsible for making a technological innovation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 974.796,
    "end": 982.921,
    "text": "But of course, unless somebody copies that, or at least unless it registers in the mind of somebody else, it is unlikely ever to get copied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 983.321,
    "end": 993.907,
    "text": "And although this seems to be a fairly obvious observation, it seems to have escaped most of those who have published on the matter hitherto.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 994.696,
    "end": 1000.82,
    "text": " And I think this is a very original contribution on Hector's part, which deserves to be complimented.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1001.68,
    "end": 1005.142,
    "text": "And really, that's all I wish to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.182,
    "end": 1008.224,
    "text": "I think I'd like to throw this open to other people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1008.944,
    "end": 1014.868,
    "text": "And if I can illuminate or elucidate any matters, I'm happy to do so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1014.908,
    "end": 1019.931,
    "text": "But I think this is really very much, to put it mildly, Hector's brainchild.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1020.631,
    "end": 1023.313,
    "text": "And congratulations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1026.206,
    "end": 1026.806,
    "text": " Thanks, Michael.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.826,
    "end": 1028.687,
    "text": "You're very kind, but this is our child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.508,
    "end": 1030.889,
    "text": "And you know a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.089,
    "end": 1032.47,
    "text": "You have a lot to contribute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.13,
    "end": 1035.932,
    "text": "So, I mean, I can only learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.552,
    "end": 1037.352,
    "text": "But thank you anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.834,
    "end": 1041.155,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.995,
    "end": 1043.516,
    "text": "Carl or Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.398,
    "end": 1050.56,
    "text": "Go ahead, Carl.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.94,
    "end": 1051.18,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.401,
    "end": 1053.302,
    "text": "So I just wanted to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1054.679,
    "end": 1063.404,
    "text": " reiterated Michael's admiration for both the idea, but also the very fluent and clear articulation of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.424,
    "end": 1074.651,
    "text": "It was nice for me to see that presented so succinctly because the clarity of the idea is really very evident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.552,
    "end": 1082.876,
    "text": "It struck me there is sort of two themes that we could discuss, which is the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.935,
    "end": 1108.067,
    "text": " the emergence of more complicated solutions to accurately engaging with and modeling our world i think that was a generic theme in the first part of the presentation but then very quickly we moved to this kernel idea this core idea um that it the dissemination and the transgenerational propagation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.905,
    "end": 1122.809,
    "text": " that could be read as some kind of cultural niche construction in a sort of evo-devo context depends upon being able to recognise a particular behaviour and thereby copy and imitate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1122.829,
    "end": 1125.97,
    "text": "I think that was the key thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.31,
    "end": 1132.472,
    "text": "And for me, just understanding the mechanics of that from the point of view of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.133,
    "end": 1141.315,
    "text": " belief updating and active inference was a, I think, a really useful thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.116,
    "end": 1163.583,
    "text": "And as Hector beautifully articulated, the ability to recognize something new and update one's generative model or posterior beliefs depends very sensitively on the confidence or the precision that you ascribe the sensory evidence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.201,
    "end": 1169.784,
    "text": " in relation to the precisions with which you hold your prior belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1169.924,
    "end": 1171.665,
    "text": "And I think that that's absolutely crucial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.685,
    "end": 1191.195,
    "text": "And I sort of highlight that issue because it is exactly the same issue that you will find when applying active inference and the free energy principle to psychiatry and the different ways in which we can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.215,
    "end": 1193.236,
    "text": "I can't remember, Hector, what was your word?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.296,
    "end": 1193.836,
    "text": "Misfire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1194.974,
    "end": 1203.302,
    "text": " in neither a good nor a bad sense, but certainly there are certain psychiatric syndromes that could be regarded as misfiring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1203.322,
    "end": 1216.112,
    "text": "And of course, there's a very close association with innovation and creativity and manic depressive psychosis, you know, framed in terms of various historical figures in the arts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.694,
    "end": 1222.718,
    "text": "And that I think is, you know, again, brings us back to this key notion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.655,
    "end": 1241.542,
    "text": " of getting that balance, the balance of the precision of our prior constructs, what we have accrued through experience-dependent learning, and the precision afforded evidence that this is how the world is actually working and how I am actually working, getting that balance right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.602,
    "end": 1244.123,
    "text": "And that's a really difficult job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.183,
    "end": 1252.206,
    "text": "Sometimes in computational psychiatry, we try to explain this in terms of a statistician.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.567,
    "end": 1268.454,
    "text": " In order to get the balance right, you have to be able to estimate these precisions in exactly the same spirit that a statistician, when making an inference doing a t-test, has to estimate not just the difference in the group means, but also the standard error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.934,
    "end": 1276.017,
    "text": "And it's often much more difficult to estimate the standard error than it is to estimate the difference in the group means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.638,
    "end": 1279.979,
    "text": "And that standard error is the inverse precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.159,
    "end": 1281.82,
    "text": "It's the weight that you afford.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.844,
    "end": 1288.468,
    "text": " the meaning, the significance of some quantitative difference, say a prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.748,
    "end": 1292.551,
    "text": "So you see this theme, there are two parts to inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.952,
    "end": 1299.897,
    "text": "The first order part is just the prediction error or the surprise, but then you have to assign",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.523,
    "end": 1301.985,
    "text": " How newsworthy is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1302.225,
    "end": 1305.248,
    "text": "You have to actually modulate that with its precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1305.508,
    "end": 1313.056,
    "text": "So you kind of multiply by the precision or divide by the standard error to get the actual thing that matters that's going to change your mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.577,
    "end": 1323.227,
    "text": "And there's a whole literature on different kinds of people in the context of neurodiversity that have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1323.7,
    "end": 1329.544,
    "text": " an impairment in being able or possibly have an impairment in being able to estimate that precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.564,
    "end": 1334.787,
    "text": "And I'm thinking here of the poster child of this kind of formulation, which is autism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.848,
    "end": 1344.013,
    "text": "And the idea being that there is an early developmental failure to attenuate sensory precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.673,
    "end": 1352.558,
    "text": "So they are rarely and continually during their early development, severe people with severe autism,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.333,
    "end": 1358.675,
    "text": " unable to ignore any of the sensations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1359.276,
    "end": 1368.62,
    "text": "And as a consequence, everything is surprising, everything's arousing, everything is in danger of revising any beliefs very, very quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.16,
    "end": 1372.362,
    "text": "So they're highly impressionable to the extent they can't build",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.308,
    "end": 1381.455,
    "text": " deeply coherent models of their lived world, or indeed the other artefacts such as mum that constitutes their world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.855,
    "end": 1394.405,
    "text": "So I'm just wondering whether a species that has the same kind of latitude in terms of either biasing attention or precision",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.926,
    "end": 1400.793,
    "text": " the sensory evidence versus accumulated prior beliefs, would display the same kind of misfiring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.813,
    "end": 1406.12,
    "text": "So you can go from one end, an autistic species will be overly impressionable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.701,
    "end": 1408.303,
    "text": "It'll be too evolvable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.463,
    "end": 1411.487,
    "text": "It won't be able to remember anything from generation to generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.373,
    "end": 1436.788,
    "text": " converse is a um somebody who you you know you can imagine from a psychiatric perspective um has committed unduly to very precise prior beliefs about the way the world works and you can think of this in terms of compulsive obsessional disorder or perhaps even depression you know the world is an awful place that is true therefore there's no point in going out you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.689,
    "end": 1440.451,
    "text": " challenging the evidence that the world is an awful place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.852,
    "end": 1448.479,
    "text": "So I'm just going to stay inside and feel isolated and not move or say very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.22,
    "end": 1452.343,
    "text": "So that would be an example of somebody who is not very impressionable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.383,
    "end": 1457.888,
    "text": "In fact, their pathology, their misfiring prevents them from acquiring any evidence to revise those beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1458.496,
    "end": 1481.627,
    "text": " So if you imagine a species that had that same kind of second order misfiring, so this is not the misfiring of the innovative soil, this is a failure to infer the second order statistics, the reliability, the precision, the variance, the entropy of the content of the things that they're trying to innovate or make sense of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.773,
    "end": 1493.197,
    "text": " You're left with this notion of a species that just cannot respond to selective pressures for selectability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.697,
    "end": 1500.279,
    "text": "They can't respond by adjusting their evolvability simply because they're fixed in their way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1500.319,
    "end": 1507.522,
    "text": "So for the environmental and eco-niche changes in any fundamental way, they're not going to be able to respond to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.522,
    "end": 1511.903,
    "text": "So I think there are many examples of this sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1512.355,
    "end": 1539.044,
    "text": " key this key if you like yes I think it would be called a pathology in the sense that in a volatile environment you would need to optimize the precision afforded sensory evidence in order to make the best sense and understand and engage with that environment and if you get that wrong there will be a pathology and I think basically Hector's formulation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.915,
    "end": 1545.937,
    "text": " really drills down and really focuses on the actual mechanism of this kind of pathology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.497,
    "end": 1559.24,
    "text": "It's all about the transcultural spread of generative models and sense making in terms of engaging either with artefacts or indeed with conspecifics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.78,
    "end": 1566.402,
    "text": "And I repeat, it's such an easy thing to get wrong as evinced in psychiatry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.422,
    "end": 1568.203,
    "text": "There are so many instances of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1570.963,
    "end": 1580.729,
    "text": " neurodiversity expressed clinically that I think reflects this singular dimension in terms of the ability to get that balance right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.99,
    "end": 1589.535,
    "text": "And I remember we discussed last time again in terms of impressionability and selection for selectability and the like, the same kind of mechanism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.575,
    "end": 1621.015,
    "text": " evolutionary uh mechanics but uh at the level that i think we're talking about today in terms of um you know evincing pursuing plans um and novel ways of doing things that may or may not be um recognized uh due to the due to a failure or not of getting um being able to suspend the precision your prior beliefs i think that that was a central um central theme i'll just close um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1621.578,
    "end": 1635.887,
    "text": " with an interesting comment that in terms of the kind of misfiring that Hector was implying, basically a novel way of doing things, being the unique province of those kinds of creatures that can plan possibly deeper into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1638.468,
    "end": 1650.696,
    "text": "There's a really interesting sort of link back to this precision notion in the sense that if you try to simulate the depth of planning of any sentient artifact,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.512,
    "end": 1661.878,
    "text": " then the degree to which they are able to look into the future depends upon the precision of their beliefs about the succession of contingencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.938,
    "end": 1664.26,
    "text": "What will happen if this happens?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.3,
    "end": 1666.141,
    "text": "And then what will happen if that happens?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1666.181,
    "end": 1674.567,
    "text": "So just technically the precision of the transitions amongst worldly states of affairs as you roll out into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1675.147,
    "end": 1677.309,
    "text": "And again, you have to estimate that precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.469,
    "end": 1680.551,
    "text": "So there's another, if you like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.411,
    "end": 1683.512,
    "text": " point at which precision gets into the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.552,
    "end": 1694.474,
    "text": "But in this instance, it's not the precision of the sensory evidence, but the prior precision about the ways things unfold and what will happen if I do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1695.155,
    "end": 1704.197,
    "text": "If you have a low precision there, then you don't plan very far into the future because you lose certainty and confidence very, very quickly after just a few moves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1705.094,
    "end": 1721.326,
    "text": " Whereas if you have very precise beliefs about the state transitions and the consequences of various actions or sequential policies, then you can roll out confidently much further into the future and perhaps find that innovative solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.586,
    "end": 1731.533,
    "text": "So again, we come back mechanistically to phenotypes that have differing degrees of precision that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.185,
    "end": 1753.797,
    "text": " in this instance, get into the game in terms of bounding the depth of the planning or the temporal horizons that you can entertain when scoring different plans in order to actually select the best action at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.472,
    "end": 1763.097,
    "text": " For me, that insight is really useful because I can see how one could simulate that quite easily in sort of toy situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.697,
    "end": 1769.841,
    "text": "So those are my thoughts inspired by Hector's excellent presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1773.883,
    "end": 1774.623,
    "text": "Thank you, Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.824,
    "end": 1777.005,
    "text": "Dean, what say you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.867,
    "end": 1785.051,
    "text": " Well, if it's, if it's okay, I'd like to sort of step back for a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1785.251,
    "end": 1797.762,
    "text": "And because we were privileged to be able to look at the two papers, almost simultaneously, I know chronologically, we've we've split it up into weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.802,
    "end": 1802.946,
    "text": "But as readers, we were able to kind of look at both papers side by each.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1803.772,
    "end": 1809.656,
    "text": " I kind of want to take a bit of a Hofstetter, strange loop, two-sided condition, Mobius.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1809.896,
    "end": 1814.498,
    "text": "We've got that, all those representations in a lot of our live stream introductions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1815.699,
    "end": 1824.304,
    "text": "So if we were to assume that, because Carl pointed out, not everybody can accommodate a two things at once perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1825.005,
    "end": 1832.209,
    "text": "If we can assume that that doesn't overwhelm, my question to the authors is, do they see their own journey",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1833.155,
    "end": 1849.865,
    "text": " as a one paper or artifact, artifact morphing into the next, or, and as we were pulled out and taken up by this relationship between epistemic and pragmatic values when uptaking an active inference perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1851.266,
    "end": 1852.467,
    "text": "That's part one of the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.507,
    "end": 1857.73,
    "text": "Part two is the former is kind of a sequential, mechanical, technical,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.436,
    "end": 1886.285,
    "text": " side of things the latter is the combinatorial plus meaning entailed and entangled so more more where am i relative so combined that's a relative depth of field as setting as establishing morphing we want to call it that as active inference strategy is applied how do the authors see or potentially see this perspective combining meaning the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.727,
    "end": 1893.213,
    "text": " sequential and or the combinatorial affecting, not effecting, but affecting what we believe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1895.375,
    "end": 1900.38,
    "text": "Because I'm a big believer that we can't just sort of strip the feelings part of this out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1900.48,
    "end": 1912.491,
    "text": "I think that's, whether we're talking chimpanzees or whether we're talking the emotions of sliding down a snake, those are part of this thing that we're looking at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.348,
    "end": 1923.106,
    "text": " I'll just give one short note on that in the paper sophisticated affective inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.177,
    "end": 1934.501,
    "text": " they simulated counterfactual futures, projections about futures, which are inactive inference, action oriented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.901,
    "end": 1940.423,
    "text": "All futures are analyzed and inferred about with respect to policy selection by the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.344,
    "end": 1952.849,
    "text": "And one of the patterns already apparent in even the simple simulations were that even if a very small fraction of counterfactuals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.849,
    "end": 1975.799,
    "text": " have like death as an outcome or highly negative outcomes it can increase the variance estimator on possible futures greatly leading to essentially ruminative behavior and affective anxiety around the legitimately warranted variance in possible outcomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.539,
    "end": 2005.733,
    "text": " So I see a key piece of this puzzle to be entertaining progressively wider time cones of possible futures in a prospective capacity and entertaining progressively wider time cones in the past of causal mechanisms and somehow negotiating that affect barometer in the moment as the eye of the needle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.858,
    "end": 2024.121,
    "text": " Hector, Michael, where do you see affect coming into the snakes and ladders to copy and not to copy set?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.841,
    "end": 2029.602,
    "text": "Well, may I make one or two comments?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2030.902,
    "end": 2044.106,
    "text": "First of all, in addition to what Professor Friston has told us about autism and so on, I think it's worth mentioning in the connection of the question that Daniel has just raised,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2045.572,
    "end": 2060.837,
    "text": " to say that there is clearly a difference in the evolution during the life cycle of early humans on the one hand and great apes and probably most human forerunners on the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2060.857,
    "end": 2071.201,
    "text": "The extension of the human life cycle, the extension beyond childhood and in particular, as I mentioned last time,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2073.632,
    "end": 2101.788,
    "text": " the adolescent growth spurt which we have, but which may not have existed in early Homo, even one and a half million years ago, I'm sure is relevant to making the evolutionary step between, let us say, the surprise that perhaps a chimpanzee has if she",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2103.428,
    "end": 2132.948,
    "text": " observes a dead bird and then regards this as counterintuitive because birds ought not to be lying on the ground throws it up into the air but this is an individual spontaneous reaction which is not handed on as part of a behavioral repertoire amongst the species and on the other hand when we begin to see the reproduction of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2133.959,
    "end": 2161.91,
    "text": " as it were, counterintuitive behavioural sequences, such as taking a lot of flakes repetitively by hand from a piece of stone, using another stone to produce an almond-shaped hand axe, fairly regularly flaked on both sides, something which is not found before Homo appears in the archaeological and paleoanthropological record.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2163.385,
    "end": 2168.967,
    "text": " but which is not something that seems to be a regular part of human behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2169.008,
    "end": 2181.093,
    "text": "It is almost as if the individual who made that was doing it as a kind of spontaneous thought of what might happen if I was to do this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2181.893,
    "end": 2190.217,
    "text": "Part of the deep generation of the hierarchically mechanistic mind which Professor Friston has told us about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2190.237,
    "end": 2192.718,
    "text": "A deep generation that, however,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2193.786,
    "end": 2223.289,
    "text": " may have been a misfiring it may have been simply a personal spontaneous event which is not easily recognised by others particularly if their shall we say to put it mildly their mental development is stunted due to the early adulthood and the lack of any adolescence, adolescence in particular which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.429,
    "end": 2252.389,
    "text": " and, of course, the development of the neuronal architecture of the brain, which in modern people continues until our mid-twenties, if this was not to have occurred, as it does not, of course, even in great apes, then there would have been, perhaps, a problem here about the deep generative potential of an individual ever being...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2253.907,
    "end": 2266.655,
    "text": " recognized such that it isn't just what might happen if I was to do this with a piece of stone, but what might happen if I was to copy what that other individual is doing with a piece of stone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2267.295,
    "end": 2270.677,
    "text": "And this, I think, is the stumbling block.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2271.018,
    "end": 2275.5,
    "text": "This is what has led to the Snakes and Ladders picture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2276.081,
    "end": 2283.105,
    "text": "It is what I think has led to the very slow adaptation of technological",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2284.761,
    "end": 2312.997,
    "text": " cumulative technological handing down from between generations or between individuals of a generation and between generations and it may well have been the case that it was not until demographical as well of course as paleobiological changes had evolved in the genus Homo that there was sufficient",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2313.81,
    "end": 2342.239,
    "text": " intercourse, not merely sexual but social, such that these questions continue to be asked ever more frequently and with the appearance of better and ever more fluent communication would allow what we now regard as human culture, specifically human nature, which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2343.484,
    "end": 2350.747,
    "text": " I think has differentiated us ever more from the great apes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2351.768,
    "end": 2353.068,
    "text": "Those are my thoughts on the matter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2358.231,
    "end": 2358.951,
    "text": "Thank you, Michael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.971,
    "end": 2361.652,
    "text": "Karl, or anyone else, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.49,
    "end": 2373.535,
    "text": " speak to the question about affect and what Michael has just treated as too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2375.937,
    "end": 2386.387,
    "text": "So one way of conceiving of affect and valence and the emotional aspects of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2387.441,
    "end": 2398.45,
    "text": " choosing different plans or making sense of my own bodily sensations is to think of it in terms of precision estimation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.031,
    "end": 2400.892,
    "text": "So one way of carving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.463,
    "end": 2416.174,
    "text": " One way of, a very generic way of thinking about some negatively, effectively charged states of mind would be those states of mind in which there is irreducible or unresolvable uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2416.875,
    "end": 2426.723,
    "text": "So to put simply, to be uncertain about what is going to happen to me or what I should do is to be in a state of angst.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.003,
    "end": 2427.723,
    "text": "And that can be,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.027,
    "end": 2432.33,
    "text": " linked to notions such as anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2433.071,
    "end": 2442.784,
    "text": "And, you know, with some extra nuances, other feelings such as, you know, a low affect, and indeed, if that is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.316,
    "end": 2445.996,
    "text": " or depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2446.937,
    "end": 2465.169,
    "text": "But I think the key thing here, and indeed many people have developed a calculus of emotion based upon whether your average level of uncertainty is increasing or decreasing, or is high and low, and adding these things together to get an ontology of emotional states from a purely sort of inference perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.589,
    "end": 2475.812,
    "text": " There's another body of thought and literature which links emotions to the literally gut feelings, interception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.432,
    "end": 2488.095,
    "text": "So certain emotional states are just hypotheses about the way that I am feeling now that best explain the myriad of extra-receptive, inter-receptive sensations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.736,
    "end": 2492.317,
    "text": "So I think there is a mechanics of affect in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.997,
    "end": 2499.499,
    "text": " certainly, interceptive inference and possibly more generally in terms of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.399,
    "end": 2513.744,
    "text": "However, there is another aspect of the feelings that we might associate when we feel compelled to do things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.824,
    "end": 2523.367,
    "text": "And I'm thinking here not about the irreducible or irresolvable uncertainty, but about uncertainty that can be resolved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.894,
    "end": 2536.459,
    "text": " I'm thinking here when Hector mentioned Andy Clark's treatment of surprise, there is also the truism that we expect to be surprised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.939,
    "end": 2550.265,
    "text": "And technically, that lens, that can be explained in terms of the imperatives for choosing those actions that will resolve uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.835,
    "end": 2553.796,
    "text": " about the way the world works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.856,
    "end": 2555.917,
    "text": "So this is just an expression of novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.557,
    "end": 2571.103,
    "text": "So if we anticipate that we are going to be surprised by some outcome, what we are saying is that that outcome is going to be informative and that it will reduce some uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.684,
    "end": 2574.307,
    "text": " technically it has a high expected information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.708,
    "end": 2588.625,
    "text": "So I'm speaking here as a statistician and using terms that would underlie the Bayesian principles of optimal experimental design, that we do these experiments specifically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.145,
    "end": 2596.229,
    "text": " in order to get surprising outcomes that are, by definition, going to resolve my uncertainty about my different hypotheses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2596.749,
    "end": 2606.594,
    "text": "So if we think about the misfires that are innovations, these are effectively, by definition, novel behaviours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.535,
    "end": 2613.658,
    "text": "And the fact that people, or certain people and certain creatures,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.565,
    "end": 2642.33,
    "text": " engage in novel in novelty seeking is entirely sensible from the point of view of the free energy principle because novelty seeking just is an expression of curiosity it is just an expression of choosing those outcomes that are going to yield rich information that has technically a high self-information or an unexpected information gain so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2643.444,
    "end": 2663.177,
    "text": " This is another view of the, if you like, the effective aspect that we do, we are compelled and expect ourselves and will possibly explain ourselves as being excited in a positive way and the opportunity to resolve uncertainty because we see an opportunity to do something novel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.297,
    "end": 2665.118,
    "text": "What is behind that door?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.158,
    "end": 2666.499,
    "text": "What is inside this present?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.099,
    "end": 2668.32,
    "text": "What would happen if I did that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.88,
    "end": 2684.207,
    "text": " And that's an entirely natural and by natural, I mean something that is easily naturalized under the physics of self-organization of any system that has or entails an implicit generative model of the consequences of its own action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2684.747,
    "end": 2692.89,
    "text": "So I thought it was a lovely link between that kind of affect written into the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2694.951,
    "end": 2720.21,
    "text": " um the is the imperative to seek novelty to seek surprises in the future um and what Michael was saying about uh well yes in order to do that you still have you still have you have to suspend your um your prior convictions because if you a priori think you know everything there is no novelty",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.278,
    "end": 2733.323,
    "text": " imperative for expiration uh and you just do the same thing time and time again but if you're in a if you can recognize that there is reducible uncertainty and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.123,
    "end": 2753.313,
    "text": " choose those actions that have the greatest expected information gain then you will necessarily succumb to novelty seeking behavior and thereby discover those misfire innovations so and it may be that you're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2755.512,
    "end": 2761.977,
    "text": " the story that Michael was telling was that we are built to be curious creatures for much longer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.338,
    "end": 2779.911,
    "text": "We are built to be able to respond to novelty and to find those innovative novel ways of behaving so that we retain that childlike curiosity as part of our epigenetic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.468,
    "end": 2784.632,
    "text": " neurodevelopmental programming for much longer than other species.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.153,
    "end": 2794.727,
    "text": "So I think that matches very nicely with the sort of the basic thesis that Hector was proposing during the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.787,
    "end": 2796.389,
    "text": "It all comes back to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2797.33,
    "end": 2818.839,
    "text": " getting the precision of your prior beliefs right and suspending very precise prior beliefs in order to explore hypotheses, and that exploration just is in terms of engaging in novel innovative behaviours that you know will resolve your uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2820.253,
    "end": 2824.075,
    "text": " So if that's right, it sort of engenders a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.415,
    "end": 2830.577,
    "text": "Why is there an evolutionary pressure for this kind of eternal childhood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2831.097,
    "end": 2839.921,
    "text": "So I want to ask Michael and Hector, because Michael certainly brought in language and cultural niche construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2843.162,
    "end": 2846.844,
    "text": "My guess would be that there will be a circular causality between the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.135,
    "end": 2857.485,
    "text": " the cultural eco niche and the phenotypes that are trying to adapt to that cultural eco niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2857.992,
    "end": 2871.621,
    "text": " such that they are required, or the phenotypes that have the greatest adaptive fitness are those that retain a greater curiosity in the context of the culture in which they find themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.121,
    "end": 2882.488,
    "text": "And part of that will be necessary to actually understand the communication and the signs and the semiotics afforded by their conspecifics, which could be read just as language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.989,
    "end": 2886.151,
    "text": "So my question is, does innovative tool use,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.392,
    "end": 2900.16,
    "text": " Does it emerge stochastically or at certain points along with communication and language?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2901.04,
    "end": 2904.843,
    "text": "Or are they not correlated?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.863,
    "end": 2910.787,
    "text": "And if they are correlated in terms of historically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.843,
    "end": 2914.825,
    "text": " What are their thinkings about the direction of causality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.925,
    "end": 2927.653,
    "text": "Does the fact that you remain curious and innovative for much longer lead to language that we can engage in novel communicative behaviours?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.294,
    "end": 2934.358,
    "text": "Or is it that we need to remain curious and open minded in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2935.018,
    "end": 2956.438,
    "text": " um thinking about or entertaining novel plans and innovative plans simply because we have to make sense of a world that is rich in information because there is language that is that has been culturally inherited or is it both is there is a both top-down and bottom-up causation so so two questions language",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.557,
    "end": 2973.185,
    "text": " tool use and copying, and the coupling between the sort of evolutionary and phylogenetic, sorry, the phylogenetic and the sort of phenotypic levels when it comes to things like language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.806,
    "end": 2977.347,
    "text": "Well, I wonder if I could come in here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2979.348,
    "end": 2983.571,
    "text": "Daniel, is it okay if I address Carl's questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2984.291,
    "end": 2985.892,
    "text": "Yes, in whatever order you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.142,
    "end": 2987.462,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2989.103,
    "end": 3002.629,
    "text": "Well, in the first place, there is a voluminous literature on the relationship between language and the origins of tool making and tool use.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3003.089,
    "end": 3013.553,
    "text": "And there's a lot of unresolved argument about whether the two came together very early in human evolution, let's say between 2 million and 1.5 million years ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3016.465,
    "end": 3034.395,
    "text": " as I originally thought some years ago, or whether in fact language as we know it, or shall we say fluent communication at least, only developed much later, as I'm coming out to believe now, and as Noam Chomsky has said for many, many years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3036.116,
    "end": 3045.702,
    "text": "I don't want to get involved in that because really we would need two or three programs and a lot of literature to compare and contrast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3048.047,
    "end": 3054.429,
    "text": " Rather, I would query whether we have an eternal childhood.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3056.39,
    "end": 3076.677,
    "text": "On the contrary, I think that physiological childhood is slowed down, and when the adolescent growth spurt arises, after about the age of, let's say, nine years old, at some times, or perhaps somewhat later at others,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3078.189,
    "end": 3088.256,
    "text": " is when we see a major change in behavior, which is no longer childish, but neither is it adult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3089.656,
    "end": 3091.237,
    "text": "Of course, we needn't go into that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3091.257,
    "end": 3097.481,
    "text": "We all know that adolescents can be very impetuous, but they can also be extremely anxious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3097.842,
    "end": 3107.508,
    "text": "And this brings us to the angst that Carl has mentioned, and which I certainly felt as an adolescent facing the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3108.399,
    "end": 3131.268,
    "text": " weekly Viva Voce examinations in human anatomy in the dissecting room, which in those days we all had to undergo, at least in the United Kingdom, as I can sure call the members, and which always put me into a state of extreme nervousness and has given me a lifelong worry about the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3132.891,
    "end": 3159.057,
    "text": " lack of accuracy, let alone precision in anatomical description and identification, and a concern with the statistical variability in human anatomy or aspects of it, anatomy in general, not necessarily human, and its relation to process, in other words, to physiology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3159.477,
    "end": 3161.378,
    "text": "And I feel myself much more",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3162.532,
    "end": 3181.418,
    "text": " Despite having lectured in human anatomy, much more aligned to physiology, and I spent some time doing neurophysiological stuff many, many years ago at Oxford and in Göttingen, than in the classification, this has to be that way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3182.442,
    "end": 3211.049,
    "text": " and as we were taught as medical students always think about the most obvious rather than the most obscure but we have to have the whole range before us and this brings in the whole problem of do we think in terms of very right or wrong concrete facts about stuff in general or do we think in terms of the statistical range",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3211.588,
    "end": 3227.073,
    "text": " variability whether it is in terms of occurrences let's say related to Poisson type distributions or to continuous variates which can be let's say related to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3228.051,
    "end": 3257.135,
    "text": " Gaussian type distributions and unfortunately it was only much later in life that I discovered that in fact modern statistics allows these two approaches to be compared and contrasted in a uniform manner I didn't know that 50 years ago alas which shows my ignorance still I would come back to the whole business of the growth",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3258.776,
    "end": 3287.556,
    "text": " curve of humans this clearly has altered when we look at chimpanzees and other great apes basically they don't have much of anything approaching adolescence they don't have this slowing down of growth and then a recuperation of the velocity of growth combined with most important not merely anatomical and physiological changes but also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3288.929,
    "end": 3311.766,
    "text": " those of the mind, the ability to innovate, the ability to have lateral thinking or the ability which I have noticed in some young people I've met with Asperger's syndrome to be able to concentrate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3313.576,
    "end": 3336.976,
    "text": " in great detail on particular matters which are extraordinarily arcane, such as Sanskrit literature in people that are not of a South Asian heritage, whereas in dealing with other people, other colleagues, they appear to be, shall we say, gauche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3338.477,
    "end": 3340.859,
    "text": "And this is, of course, well known.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3341.5,
    "end": 3341.86,
    "text": "However,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3342.769,
    "end": 3345.45,
    "text": " and indicates the range of variability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3346.89,
    "end": 3367.957,
    "text": "But it is the change which we all undergo in not merely physical, but also intellectual ability and inquisitiveness, which can get us into trouble when we are in adolescence, and as young men and women, given the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3370.349,
    "end": 3398.168,
    "text": " continual and continuous changes in our neuronal architecture, at least until our mid-20s these days, which I think distinguishes and has distinguished the evolution of Homo sapiens, well, Homo in general and Homo sapiens in particular, but I wouldn't rule out Neanderthals or even Homo erectus, and which I think has been cumulative",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3398.855,
    "end": 3423.631,
    "text": " and undoubtedly, although we have no idea, undoubtedly enhanced by increased and ever more complicated communication during the past probably half a million and certainly quarter of a million years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3427.153,
    "end": 3431.396,
    "text": " this curiosity, what would happen if we did this, what would happen if we did that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3432.757,
    "end": 3439.462,
    "text": "But even so, things are not rapidly grasped.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3440.643,
    "end": 3454.612,
    "text": "And we see that in different parts of the world, particularly in modern populations even, that have been long separated from each other, not everything is developed at the same rate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3455.273,
    "end": 3456.614,
    "text": "A couple of well-known examples,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3457.296,
    "end": 3484.16,
    "text": " are, for example, the wheel, which first appears probably on the Eurasian steppes about 5,000 years ago and was used for traction, and then appears quite independently in pre-Columban Mesoamerica about 2,000 years ago and was not used, even though it would have been very useful, for even anything as simple as a wheelbarrow, but simply to move around images.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3485.876,
    "end": 3488.358,
    "text": " whether they were dolls or toys or gods with no idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3489.638,
    "end": 3506.569,
    "text": "And another one, taken from the same two areas of the world, is the metallurgy of copper, which appears about, well, perhaps over 6,000 years ago in Eurasia, and possibly 2,000 years ago independently in the New World.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3508.089,
    "end": 3510.351,
    "text": "And yet, other things happen too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3510.911,
    "end": 3513.633,
    "text": "For example, in Australia,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3514.375,
    "end": 3524.577,
    "text": " we find modern people were making hand axes when these had long ceased to be made by anybody outside Australia.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3525.037,
    "end": 3529.078,
    "text": "Some of them may even be only a few thousand years old.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3530.778,
    "end": 3544.041,
    "text": "So this appearance and disappearance and reappearance is something which has not gone away and must be related somehow to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3545.968,
    "end": 3560.398,
    "text": " our ability to, for this deep generation of our inquisitiveness, our curiosity, and indeed our ability to not to see the most obvious thing around us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3561.039,
    "end": 3566.623,
    "text": "The desire to see only one simple solution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3567.543,
    "end": 3573.908,
    "text": "This, which so irritated me when my teachers in the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3575.098,
    "end": 3598.696,
    "text": " in the anatomy department when I was a medical student believed that there was only one right answer as to how many heads this muscle had or which how many vertebrae there were in this or that part of the vertebral column let alone in the skull and we know how very variable these matters can be so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3601.966,
    "end": 3624.182,
    "text": " There is this tension between the desire for things to be seen in one light only, in a one-dimensional way, and our natural inquisitiveness, this deeply generated desire to say, what would happen if it was like this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3625.943,
    "end": 3627.844,
    "text": "How has it come to be like that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3628.705,
    "end": 3631.307,
    "text": "Why is everything different and not the same?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3633.686,
    "end": 3634.787,
    "text": " I can't put it any other way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3635.147,
    "end": 3636.388,
    "text": "With that, I've said quite enough.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3639.83,
    "end": 3640.61,
    "text": "Thank you, Michael.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.69,
    "end": 3640.931,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.732,
    "end": 3644.193,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3645.313,
    "end": 3647.335,
    "text": "So again, this is for the authors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3647.995,
    "end": 3650.457,
    "text": "This has been really helpful to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3651.097,
    "end": 3659.883,
    "text": "As observers, because that's highlighted very clearly in the papers, I see both papers",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.483,
    "end": 3685.569,
    "text": " speaking to something that I would describe as condition set, meaning in the paper's examples, limit the game to, the game metaphor at least, to this type where there's a limited number of tiles and a clear continuation until a conclusion, or recognize the limit of the species to nut cracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.709,
    "end": 3689.53,
    "text": "So there's a real clear idea, and Michael's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3690.129,
    "end": 3691.509,
    "text": " and Hector have both spoken to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3692.47,
    "end": 3700.071,
    "text": "So what was the growth limit of the brain's capacity, et cetera?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3700.712,
    "end": 3716.175,
    "text": "What I'm curious about, and I don't know if Michael or Hector have a real clear answer to this, but I'm wondering what and when was maybe the range of time that we see",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3720.336,
    "end": 3726.038,
    "text": " the unlocking or sort of combinatorial explosion or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3727.059,
    "end": 3739.484,
    "text": "I guess what I'm asking is, is there a move that we can clearly see as being something that differentiates playing, which we know happens in a lot of species, and gaming?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3739.504,
    "end": 3744.926,
    "text": "Because as I said at the end of 53.1, I wondered if it was going to be game on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3746.055,
    "end": 3748.996,
    "text": " And so I'm curious what the authors think about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3749.436,
    "end": 3752.017,
    "text": "Is there a difference between playing and gaming?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3752.737,
    "end": 3758.399,
    "text": "Meaning that there's now an actual introduction of strategy in this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3760.579,
    "end": 3770.542,
    "text": "So maybe another way of asking it, is there a moment when you guys can point to it and say, this was kind of when we saw a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.162,
    "end": 3778.486,
    "text": " a reducing or maybe a relaxing of a limit-forward world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.068,
    "end": 3801.14,
    "text": "I wonder whether, in fact, this difference is really quite as great as Dean suggests, and whether it may have something to do with the ability in working memory and other aspects of memory in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3803.584,
    "end": 3830.883,
    "text": " dealing with, or in developing, logico-mathematical ability to plan, or in planning, and in communicating this ability, such that the planning is no longer on an individual level, but is participatory, and therefore a game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3831.423,
    "end": 3831.943,
    "text": "In other words,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3834.861,
    "end": 3858.185,
    "text": " and perhaps Hector can answer this question, but I would suggest that this developed slowly, gradually, and by no means in a continual, let alone a continuous manner, in Homo, but not in earlier, in a way, not in earlier and other hominid species.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3859.705,
    "end": 3864.086,
    "text": "Do we see, and this I would ask Hector, do we really see Homo",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3864.737,
    "end": 3894.248,
    "text": " let us say, chimpanzees or other great apes, developing the kind of logical math ability to make very, very simple combinatorial associations between objects or behavioural activities and developing this into a communal game which involves",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3894.801,
    "end": 3916.527,
    "text": " other individuals in the group, because as Hector has remarked on various occasions and informed me, when we see things like nut fagging in small groups of chimpanzees, it by no means is copied by all of them, let alone copied or emulated by all of them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3918.48,
    "end": 3927.163,
    "text": " by no means, even when it is, with faithful accuracy and precision in the manual operations that are required.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3928.024,
    "end": 3936.147,
    "text": "So I would ask Hector, do we see these associations being transformed into games?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3940.108,
    "end": 3942.009,
    "text": "Okay, that's a tricky question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.847,
    "end": 3954.4,
    "text": " I mean, what we know with chimpanzees is that they have promised to do these second-order relationships, which is like hierarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.337,
    "end": 3963.684,
    "text": " ordering of, for instance, if I have a set of objects, I can classify them attending to the color, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.004,
    "end": 3967.707,
    "text": "Chimps could do that, okay, if only color is involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.268,
    "end": 3970.53,
    "text": "But I can classify them by color and shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.95,
    "end": 3973.813,
    "text": "So this is another order of hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.833,
    "end": 3978.097,
    "text": "So I can pick things that are square and red and put them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.857,
    "end": 3981.26,
    "text": "So this ability to abstract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.92,
    "end": 4002.71,
    "text": " kind of ordering category so that i have relations of relations like in analogical reasoning when i i can focus on one dimension or in another simultaneously so i can shift my focus from one dimension to another in order to classify things this i think is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.67,
    "end": 4025.778,
    "text": " quite human like for instance the wisconsin card sorting test so i can shift from one dimension to another to classify objects or cards and this is something that seems good have more problems to do so they might classify in a first order categories like i put things that have a same color they could learn to do that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.799,
    "end": 4027.98,
    "text": " that wouldn't be a big problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.5,
    "end": 4034.144,
    "text": "But I guess I'd have to use two dimensions together to classify the objects that would have more problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.724,
    "end": 4039.607,
    "text": "Because this involves considering more than one dimension simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.147,
    "end": 4041.588,
    "text": "I'm not sure I'm making sense here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.608,
    "end": 4044.05,
    "text": "This is the Jonas Langer work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.81,
    "end": 4072.687,
    "text": " that he did with with kids and that's a remarkable work that jonas langer did and then there were these people in rome i was i think it was potty um at the lab of um bio park and rome that replicated that with um with chimpanzees uh i think it was a spinosi who replicated it and found that chimpanzees were more compromised in order to have this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.516,
    "end": 4075.517,
    "text": " classificatory relations of relations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.058,
    "end": 4082.301,
    "text": "And I think that's a very remarkable ability that we develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.701,
    "end": 4085.243,
    "text": "So I don't know if I answered your question, Michael.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.286,
    "end": 4102.693,
    "text": "Perhaps that comparison of two dimensions, color and shape, and then the snakes and ladders overlay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.786,
    "end": 4118.878,
    "text": " that lets us take the hypotenuse is that abductive jump enabled developmentally and neuroepigenetically by all these different features which happen over much slower time scales",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4120.427,
    "end": 4141.805,
    "text": " especially considering the actual millisecond time scale associated with recognition those other changes are so much slower but the ability to move diagonally on the grid through the rows and the columns and turn that into movement on a manifold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.562,
    "end": 4151.068,
    "text": " is the ability, looked at from the either row or column perspective, to move in both at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.949,
    "end": 4168.482,
    "text": "But by condensing those two dimensions into one, there can be new kinds of cognitive movements, and then applying that cognitivist lens, also evolutionary transitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.563,
    "end": 4171.224,
    "text": "Even without the complex...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.372,
    "end": 4191.063,
    "text": " cumulative feedback with the eco-cultural Niche merely in the um abductive moment and just one other piece I wanted to return to is that every variable can have a precision estimator or not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.535,
    "end": 4219.566,
    "text": " in the generative models and active inference every variable can be fixed and so the model can just be persistently surprised with no updating or one can have any kind of prior or hyper prior and so on and that enables learning and that's what enables not just estimation of the mean or the center of gravity the expectation of but also the variance the whole distribution and then it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.935,
    "end": 4248.513,
    "text": " by applying that kind of precision on everything view which as Michael brought up is exactly what modern statistics does you can't do inference with the t-test unless you have the mean and the variance won't go into any more details on the statistics but every variable has the center of gravity mean estimator and the variance estimator",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.454,
    "end": 4256.996,
    "text": " And so we talked about precision on sensory information, the mapping between observations and hidden state estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.376,
    "end": 4262.937,
    "text": "And then also there's this action oriented precision on how things will unfold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.217,
    "end": 4277.12,
    "text": "And you might be able to update your precision on sensory evidence by seeing something different, but updating your precision on how things will unfold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.187,
    "end": 4281.168,
    "text": " is oriented around taking actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.477,
    "end": 4300.978,
    "text": "Daniel, you must have some questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4301.358,
    "end": 4308.302,
    "text": "I can't be the only one floating questions and having my zone of bound and surprise of being expanded here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4310.892,
    "end": 4314.494,
    "text": " I have questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.995,
    "end": 4318.437,
    "text": "I can ask you a question, or Michael or Hector or Carl, please feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.119,
    "end": 4337.628,
    "text": "If you allow me, I would like to pick up with something that Professor Christo mentioned before that was kind of, was intriguing, because it is true that some great artists like Van Gogh and others were very creative,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.188,
    "end": 4361.682,
    "text": " and also i don't know if it's appropriate to say that they were in the verge of psychosis i don't know if it's appropriate because i don't have any statistics but i'm thinking if being innovative is this again is misfiring so i would like to separate two things one is how innovative you are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.967,
    "end": 4371.911,
    "text": " And I'm thinking in the echo niche, if you are well adapted to an environment, it's not a good idea that you try different things all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.611,
    "end": 4378.494,
    "text": "Because imagine that you have some place where there are nice berries, you have discovered a safe path to that place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.414,
    "end": 4384.357,
    "text": "And if you keep to that path, you go to the berries, you get there, you feed, so that's good for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.518,
    "end": 4411.564,
    "text": " imagine you want to try something new so you are very innovative and one day you decide to try another path to the very shortcut so you have one risk that you can face new dangers because this path is new you don't know what is waiting for you there the other is you face that you can get lost and then you could spend the energy you need to survive so in a way i don't think that being innovative is good in itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.563,
    "end": 4428.485,
    "text": " but we have the risk if we are too conservative that the environment changes and if the environment changes significantly we are not well adapted because we don't have alternative behaviors that are adapted to the new environment so i guess",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.488,
    "end": 4432.45,
    "text": " With this happens like psychological traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.87,
    "end": 4434.171,
    "text": "Nobody has extremes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.731,
    "end": 4439.474,
    "text": "So we don't have people with extreme psychological personalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.534,
    "end": 4445.597,
    "text": "I mean, we have pathologists, but the selection has favored kind of intermediate levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.677,
    "end": 4456.964,
    "text": "So I guess, and Professor Friston can correct me on this, he knows more about psychopathology, but I guess it happened with innovation that we need some kind of balance and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.652,
    "end": 4473.827,
    "text": " What is intriguing for me is how humans escape that balance in terms of how they manage to be creative and innovative at times, because we repeat many routines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.128,
    "end": 4475.909,
    "text": "But still, we can be very creative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.14,
    "end": 4493.574,
    "text": " and we have selected so we have been successful enough to our economy and i'm just thinking in this counterfactuals idea so i think this might have played a major role the ability to have counterfactuals because perhaps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.455,
    "end": 4511.96,
    "text": " instead of risking my life every time i innovate i can rehearse what will happen and as professor freeston mentioned before if i have a good precision i can imagine things that will unfold if the genetic model is very deep i can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.168,
    "end": 4518.169,
    "text": " think ahead many steps and see how I will fare in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.589,
    "end": 4523.45,
    "text": "So I can kind of rehearse things in my head before I put them into practice in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.99,
    "end": 4532.291,
    "text": "And this might help me to be innovative, but with a kind of bounded risk or controlled risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.471,
    "end": 4540.873,
    "text": "I don't know if this makes sense, but I think it must be some kind of balance between if I can rehearse things in my head, I'm very good at predicting things that I will...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.354,
    "end": 4564.732,
    "text": " evolve or unfold many steps ahead i can see how i will fare and then i can reach to be innovative i don't know i mean i'm very i'm being very speculative here okay so i just want to make clear that i'm being very speculative please carl",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.936,
    "end": 4568.777,
    "text": " Yeah, I'd like to speak to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4569.477,
    "end": 4577.359,
    "text": "Yes, you may be speculating, but I think those observations are very veridical and very useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4578.519,
    "end": 4581.86,
    "text": "I mean, you've brought a number of fundamental issues to the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4581.9,
    "end": 4592.243,
    "text": "First of all, the importance of being able to plan to have a generative model of the consequences of actions is not the gift of all species, and in some instances,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4593.464,
    "end": 4604.093,
    "text": " In your words, when the environment doesn't change, that would be an undue complexity cost to carry around a brain with a generative model of the consequences of my actions if I don't need it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4604.313,
    "end": 4607.776,
    "text": "If I was a virus or an insect, I wouldn't need that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4608.897,
    "end": 4610.078,
    "text": "It would be very inefficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4611.059,
    "end": 4620.867,
    "text": "So that sort of lends or brings you to a picture that our world is sufficiently complex and changing at pace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.095,
    "end": 4628.661,
    "text": " committing to very simple, underly expressive generative models is not an option.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4629.202,
    "end": 4640.994,
    "text": "And one really important way of making them more expressive is to increase that temporal horizon or temporal depth so that we can, in accord with things like simulation theory, roll out into the future and now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4642.468,
    "end": 4648.473,
    "text": " become the kind of phenotypes that can select among a number of plausible policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4649.074,
    "end": 4663.585,
    "text": "And I think that would be one bright line between lots of different genres and different species that could be just drawn on a dimension, which is just the depth of planning that my generative model will support.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.446,
    "end": 4670.391,
    "text": "And we've talked previously about that being constrained by the precision afforded",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4671.539,
    "end": 4676.941,
    "text": " in a given context, my beliefs about how I would roll out into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4677.301,
    "end": 4697.17,
    "text": "So I think that's just, from my perspective at least, that's a really important observation that the depth of planning is a very important functional characteristic of the generative models that are implicit in phenotypic behaviour and possibly in terms of what kinds of models are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.693,
    "end": 4705.674,
    "text": " level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4706.534,
    "end": 4726.37,
    "text": "The other, I think, key insight that you bring to the table here relates to what affords the right balance between novelty-seeking exploratory behaviour and the risks that that would entail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4726.87,
    "end": 4727.731,
    "text": "And I think that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.12,
    "end": 4735.15,
    "text": " from a purely mathematical point of view, is a really important observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4736.833,
    "end": 4741.222,
    "text": "Just to join the dots with other ways of understanding how the universe works,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4742.577,
    "end": 4748.602,
    "text": " that particular question is very easily framed in terms of constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4749.243,
    "end": 4761.634,
    "text": "So the free energy principle from which active inference inherits is one way of or is due to something called the maximum entropy principle under constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.674,
    "end": 4766.738,
    "text": "So this was brought to physics in the 20th century by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4767.919,
    "end": 4785.14,
    "text": " a foundational thinker et james who basically rewrote physics in terms of probability theory and said that basically everything that um of interest at least or physically um conforms to a constrained maximum entropy principle so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4786.337,
    "end": 4806.092,
    "text": " That actually is just an expression for TENS, the free energy principle, in the sense that the constraints from the point of view of the free energy principle are just what is brought to the table by a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4807.353,
    "end": 4809.734,
    "text": "And the entropy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4811.035,
    "end": 4812.477,
    "text": " pertains to the entropy of belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4812.517,
    "end": 4835.097,
    "text": "So you've got this dialectic simply at the level of the physics of measurement and inference, which means that I'm always trying to explain any measurement such that my predictions are as accurate as possible, but at the same time,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4838.044,
    "end": 4842.986,
    "text": " having the maximum latitude so that I don't over-commit in accord with Occam's principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4843.687,
    "end": 4852.491,
    "text": "So mathematically, what that means is the entropy of my beliefs has to be as big as possible, given the constraint that my measurement has to be an accurate measurement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4858.362,
    "end": 4865.686,
    "text": " So that may sound, if you like, completely unconnected to whether I choose to wander away from the berry path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4866.167,
    "end": 4877.073,
    "text": "But in fact, exactly the same maths applies to these quantities, either the constrained entropy or the variational free energy in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4877.653,
    "end": 4881.775,
    "text": "And what happens is you get exactly the same dialectic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.276,
    "end": 4883.576,
    "text": "You have two pressures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.697,
    "end": 4884.357,
    "text": "On the one hand,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4885.485,
    "end": 4912.726,
    "text": " to comply with Occam's principle or Occam's razor, and on the other hand, to keep all your options open, which in a sense is exactly, do I comply with the constraints that I know I'm going to get my berries and I'm not going to be eaten myself by a predator, or do I keep my options open and try that other path?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4913.328,
    "end": 4919.154,
    "text": " So this dialectic is just baked into the physics of any self-organizing system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4920.476,
    "end": 4924.18,
    "text": "And practically, it emerges in a number of ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4924.68,
    "end": 4926.542,
    "text": "One way of writing down the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4927.895,
    "end": 4942.002,
    "text": " free energy or the constrained entropy, from James's point of view, expected given a particular policy, do I go down this path or that path, is in terms of ambiguity and risk, using exactly your words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4943.023,
    "end": 4951.747,
    "text": "So the risk is just the relative entropy or the divergence or discrepancy between what I think will happen and what I expect to happen to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4951.767,
    "end": 4953.408,
    "text": "So I expect not to be eaten.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.828,
    "end": 4955.749,
    "text": "And that's the key constraint at hand here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4956.229,
    "end": 4983.029,
    "text": " it's not about rewards anymore we're throwing away the notion of rewards and we're now replacing it with a multi-dimensional construct which is all the constraints in the ways of being like having a certain temperature or not being very cold or very hot not being eaten not being dead just keeping within my characteristic states so you write down those characteristic states in terms of constraints and those constraints basically preclude certain states of being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4983.769,
    "end": 4989.323,
    "text": " And then I just compare what will my states be if I do this and how far away from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4991.202,
    "end": 5018.741,
    "text": " how far away is that anticipation from my prior constraints and that literally is called risk it's the KL divergence between your policy dependent predictive posterior and your prior preferences that have the constraints the other thing is the ambiguity and that simply reduces to making sure that you make moves in a way that underwrites a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5020.501,
    "end": 5027.885,
    "text": " an unambiguous precise mapping between what you see and what caused your sensation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5027.905,
    "end": 5029.646,
    "text": "So you avoid dark rooms, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5029.666,
    "end": 5030.507,
    "text": "You avoid the dark.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.587,
    "end": 5032.108,
    "text": "You avoid dark alleys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5032.388,
    "end": 5035.45,
    "text": "You don't go where you can't see what's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5035.77,
    "end": 5037.111,
    "text": "So that's the ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.131,
    "end": 5041.754,
    "text": "So together, the expected free energy is equal to risk plus ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.014,
    "end": 5070.118,
    "text": " When read like that, then the balance between the risk and the ambiguity, or another way of carving this up is in terms of expected information gain and expected cost, or it's complement expected value, where the value is just the how, to what degree am I complying with my constraints, enables you to now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5071.457,
    "end": 5093.597,
    "text": " write down the balance that resolves to a certain extent dissolves that dialectic by the precision of your prior preferences your constraints so if you're the kind of creature or child or insect that has very precise beliefs about the kinds of outcomes i expect to anticipate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.077,
    "end": 5101.739,
    "text": " And I may have very precise beliefs about my body temperature, for example, but I may have very less precise beliefs about where I am in terms of latitude.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5101.899,
    "end": 5110.56,
    "text": "I could be in Alabama, I could be in Newcastle, London, I could still be me, but I can't be minus two degrees centigrade and still be me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5110.9,
    "end": 5116.702,
    "text": "So some constraints are very precisely specified and other constraints are less precisely specified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5117.082,
    "end": 5120.682,
    "text": "So the risk is determined by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5124.143,
    "end": 5133.166,
    "text": " the precision of your prior beliefs about your characteristic states, the precision of the constraints you bring to the table as a phenotype.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5133.406,
    "end": 5138.448,
    "text": "And some things will be innate and completely sub-personal, just wired into your homeostasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5139.348,
    "end": 5140.288,
    "text": "Some will be learnable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5140.829,
    "end": 5144.03,
    "text": "Some may even be sort of oppositional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5144.17,
    "end": 5145.23,
    "text": "You know, we can talk about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5145.823,
    "end": 5152.506,
    "text": " But whatever, they have to be there because they define basically what kind of thing you think you are and how you act accordingly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5152.927,
    "end": 5172.676,
    "text": "So the balance between whether to go down another path as opposed to the berry path is going to depend upon this particular creature or phenotype and specifically the precision of their prior preferences in terms of what outcomes they would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5173.418,
    "end": 5194.631,
    "text": " a priori entertain and if they have very very precise preferences over not being eaten and there's even a marginal small probability of being eaten if they stray from the current path then they won't explore if on the other hand they have a slightly more liberal expectation about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5196.311,
    "end": 5219.289,
    "text": " being about the encounters with a predator for example um then there will be more um there will be more likely to engage in novelty seeking and exploratory behavior so you know perhaps put this even more simply you know this is the exploration exploitation dilemma written",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5219.87,
    "end": 5223.091,
    "text": " in terms of the physics of self-organization under planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5224.432,
    "end": 5229.314,
    "text": "And it all reduces again to precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5229.474,
    "end": 5232.135,
    "text": "And in this instance, it's the precision of the constraints",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5233.763,
    "end": 5248.24,
    "text": " articulated as your prior preferences, your characteristic states, the kinds of states that you believe characterize you, that if you stray from, you cease to exist, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5252.216,
    "end": 5256.62,
    "text": " So I don't think what you said was speculation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.7,
    "end": 5259.502,
    "text": "I think they're all fundaments of behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5259.522,
    "end": 5279.018,
    "text": "And actually, from an ethnological perspective, they speak to the heart of choice behavior and why we do the things we do and why it is always in the background, the game of saying, do I explore or do I play it safe?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5281.733,
    "end": 5282.113,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5282.514,
    "end": 5283.534,
    "text": "Thank you, Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.794,
    "end": 5284.014,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5284.034,
    "end": 5286.376,
    "text": "I think you're muted, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.136,
    "end": 5288.617,
    "text": "Thank you, Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.717,
    "end": 5289.238,
    "text": "Go ahead, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.039,
    "end": 5294.08,
    "text": "I'd just like to run with what Carl was saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5297.382,
    "end": 5299.564,
    "text": "This is mostly for Hector and Michael.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5302.625,
    "end": 5305.107,
    "text": "Here's a case in point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.268,
    "end": 5310.25,
    "text": "All the collective wisdom on the side of a volcano can suddenly be arrested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5311.007,
    "end": 5313.049,
    "text": " And yet there is still a Pompeii today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5313.069,
    "end": 5320.398,
    "text": "I wonder what you gentlemen think that says about certain species zone of bounded surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5333.717,
    "end": 5354.845,
    "text": " Dean does this refer to the materia the fixed materiality alone of the ruins of Pompeii of which no more will ever exist in the archaeological context being able to be unpacked into this collective wisdom",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5356.141,
    "end": 5361.944,
    "text": " I'm just curious because we are talking about regular irregularities and regular irregularities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5361.964,
    "end": 5366.486,
    "text": "These seismic events occur in the timeline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5367.487,
    "end": 5376.471,
    "text": "And I'm just curious what we think then as we reflect on that and still adopt that kind of risk mindset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5376.571,
    "end": 5381.353,
    "text": "As I said, I just want to run with what Carl was suggesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5382.194,
    "end": 5384.595,
    "text": "I don't know that there's an equivalent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5385.838,
    "end": 5400.873,
    "text": " I don't know if chimpanzees would do what humans have done, like see the evidence and still, you know, park themselves right in the path of danger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5401.153,
    "end": 5407.419,
    "text": "I'm just curious what they think about that in terms of the timeline aspect of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5418.991,
    "end": 5422.073,
    "text": " Hector or Michael, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5422.093,
    "end": 5426.055,
    "text": "I don't think you're muted now, Hector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5430.358,
    "end": 5431.319,
    "text": "Sorry, my mic is off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.2,
    "end": 5437.022,
    "text": "So it's a kind of difficult question, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5437.082,
    "end": 5448.289,
    "text": "I'm not sure if I understood correctly, but as you're referring to the Throne of Bandit Surprise, and linking what Professor Prieston said before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.798,
    "end": 5455.041,
    "text": " if I'm to take a new road, which is, I don't know what awaits for me there, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.022,
    "end": 5467.77,
    "text": "But if I'm very good at making guesses or inferring what might happen based on information I have gathered before, so I'm good at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.689,
    "end": 5471.91,
    "text": " anticipating what might unfold, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.31,
    "end": 5476.212,
    "text": "Because I have this complex machinery, let's call it working memory, which is a construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.832,
    "end": 5480.233,
    "text": "I have a powerful working memory, so I can entertain many possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.573,
    "end": 5495.058,
    "text": "And there is something that kind of rings a bell when Professor Alfridson was talking of precision, which is the concept of metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5496.229,
    "end": 5503.65,
    "text": " So metacognition refers to thinking about my own thinking, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5503.971,
    "end": 5508.531,
    "text": "And it has two clear aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.711,
    "end": 5513.392,
    "text": "One is how sure am I about my knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.472,
    "end": 5519.634,
    "text": "For instance, I'm sure I know something even when I cannot remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.714,
    "end": 5521.774,
    "text": "This is the tip of the tongue effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.301,
    "end": 5527.807,
    "text": " So I can give you an answer and be 100% sure this answer is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5528.208,
    "end": 5530.731,
    "text": "I can be 80% sure, 50% sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.951,
    "end": 5534.675,
    "text": "So I can evaluate how much sure I am about something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5536.257,
    "end": 5538.98,
    "text": "So this, I think, is a bit like precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.017,
    "end": 5547.021,
    "text": " So if I make some plans and I think what might unfold, I can be very sure this will happen or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5547.221,
    "end": 5549.562,
    "text": "And this probably has to do with my metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.122,
    "end": 5553.084,
    "text": "So how sure am I about what will happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.925,
    "end": 5556.366,
    "text": "And that might help me to decide whether I go or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.327,
    "end": 5569.293,
    "text": "And coming back to your sonopandasurpriser, I'm not sure if I'm digressing, but perhaps I can preempt the surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.367,
    "end": 5573.468,
    "text": " if I have a good precision or good metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.989,
    "end": 5584.173,
    "text": "So if I'm sure that I can rehearse things in my head and see how they will unfold, they won't be that surprising later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5584.633,
    "end": 5586.854,
    "text": "So I'm just speculating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.034,
    "end": 5598.62,
    "text": "Perhaps this ability to have counterfactuals, to have these kind of rehearsing in my head and this depth of generative models can preempt the surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.7,
    "end": 5614.437,
    "text": " and here i'm speculating clearly so i don't know if i answer your question about pompeii because i'm not sure they understood but just bring some some ideas that might be useful but again they are speculative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.232,
    "end": 5631.477,
    "text": " It'd be nice just to link that notion of metacognition and having beliefs about beliefs, the precision of a belief about the likelihood of being eaten by a predator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5633.078,
    "end": 5636.58,
    "text": "I think that's what Daniel was speaking to before when he was talking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5637.72,
    "end": 5641.203,
    "text": " the hierarchical depth of models and their increasing complexification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5641.744,
    "end": 5659.939,
    "text": "One really important way of making a model more expressive and context sensitive is to induce a hierarchy of exactly the sort that Hector was talking about in terms of this metacognitive aspect, but not just content, but crucially, again, coming back to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5660.844,
    "end": 5664.327,
    "text": " the confidence and the precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.468,
    "end": 5667.589,
    "text": "I think that's a very central concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5668.39,
    "end": 5684.262,
    "text": "I was just thinking, if you had to commit to what kinds of epigenetically specified constraints you would associate with the genome,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5685.802,
    "end": 5688.644,
    "text": " In what space would they live?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5689.964,
    "end": 5693.026,
    "text": "And my guess is that most of it is about the constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5693.566,
    "end": 5703.611,
    "text": "And within that, it's going to be the constraints on the precisions, that there are certain sort of innate ranges of outcomes that I will entertain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5708.163,
    "end": 5726.68,
    "text": " In principle, at least, you can actually just write down an entire generative model in terms of constraints and in terms of precisions in the sense that if the generative model is universally expressive and everything goes, then you can sort of carve out an apt",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5727.779,
    "end": 5742.707,
    "text": " structural form for that generative model, despite shrinking 99.9% of this overly expressive generative model to zero with very, very precise constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5745.028,
    "end": 5746.389,
    "text": " Well, perhaps I'll turn this into a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5747.109,
    "end": 5764.018,
    "text": "If you were trying to simulate artificial life in its most generic sense, if you're trying to simulate tool use, for example, the emergence of tool use in a synthetic population, and you had to actually write down",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5764.949,
    "end": 5771.054,
    "text": " what could be passed via genetically or epigenetically to each subsequent generation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5771.594,
    "end": 5774.416,
    "text": "What kinds of things would you specify?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5785.985,
    "end": 5788.728,
    "text": "That's kind of my question in the same sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5788.768,
    "end": 5789.048,
    "text": "How do we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5792.478,
    "end": 5794.798,
    "text": " Where do we draw those arbitrary lines?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5794.818,
    "end": 5806.28,
    "text": "I mean, it's the thing that comes up again and again as we continue to sort of see the next sedimentary layer of papers discussing this, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5806.62,
    "end": 5821.603,
    "text": "But the fact that it can be moving and the fact that there is a rate constant that you mentioned in the last live stream that has to be working, functioning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5822.398,
    "end": 5849.558,
    "text": " and effective and then there's still this question of so so what is our our what are we attending to and what are we still available to all at once and how do we organize that in a way that it most closely as you say precisely it that that's the best way of describing it what's really going on and that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5851.949,
    "end": 5854.811,
    "text": " That seems to me at least to be a moving target.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5857.653,
    "end": 5861.236,
    "text": "Just one quick speculative mapping as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5861.596,
    "end": 5862.156,
    "text": "First, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5864.194,
    "end": 5881.887,
    "text": " instead of just stacking bricks with content on content on content, intercalating layers of content estimation with metacognitive estimation is what allows the extendability of the multi-layer predictive processing type architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5882.487,
    "end": 5889.813,
    "text": "It's actually like the back and forth or the interplay between the content estimators",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5891.744,
    "end": 5894.653,
    "text": " and the variance estimators that allows that model to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.551,
    "end": 5925.328,
    "text": " not just be described in terms of its center of gravity but also in terms of its full distribution and then to carl's question about what is being passed down genetically and epigenetically and thinking about those terms even generically like in the context of perhaps source code and a configuration file or some other mapping of like what is inscribed from a classical information genetic perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5926.351,
    "end": 5955.64,
    "text": " and then what is contextually and more rapidly transmitted there's an interesting angle i could see it this way or potentially the opposite but there's a shorter term epigenetic firing rate and then a slower updating of neuromodulatory like genetic possibilities kind of opening and closing valves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5956.952,
    "end": 5969.611,
    "text": " over a slower time scale and then of course these are nested within another one so what is what is neuromod this can also itself be a firing rate in other ways but just focusing on this direction the uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5971.491,
    "end": 5988.884,
    "text": " inscribed constraints are like the width of the aperture and then the actual flow of the photons through the lens is an instantaneous firing rate that's happening way faster than the aperture can be dilated or not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5989.946,
    "end": 6007.579,
    "text": " And so merely the fact that there are multiple concurrent timescales and the associated interplay of their rate constants tells us a lot about this kind of learning architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.42,
    "end": 6016.546,
    "text": "What we do without understanding is the action question and related to our preferences and precisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6017.686,
    "end": 6018.147,
    "text": "However,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6019.884,
    "end": 6044.427,
    "text": " it seems pretty key that to alternate estimates about content with metacognitive type estimates and to package that set of two belief distributions mean and variance to package those also as one so it can be handled as a composite one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.717,
    "end": 6063.921,
    "text": " And just to point out that learning rates are the manifestation of that second order specification, that precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6064.982,
    "end": 6070.905,
    "text": "So they are the same thing at every time scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6071.785,
    "end": 6079.029,
    "text": "So you could articulate the developmental stages, for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6081.923,
    "end": 6095.099,
    "text": " the rejuvenation, but certainly the changes, say, in late adolescence as a programmed learning rate or learnability",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6095.908,
    "end": 6104.316,
    "text": " that can be read at some level as a precision, because the precisions are just the rate constants that link the state to the rate of change of the state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6105.678,
    "end": 6109.982,
    "text": "And that basically is just a learning rate at many, many different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6110.022,
    "end": 6115.588,
    "text": "So I think there's a sort of uniform way of putting together these different notions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6116.469,
    "end": 6117.87,
    "text": "Some useful notions here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6121.428,
    "end": 6126.049,
    "text": " from machine learning are sort of the notion of learning to infer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6126.069,
    "end": 6136.512,
    "text": "So I was thinking about an answer to my own question, and clearly you can't write down a generative model that's going to be able to get up and go to school in the morning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6137.253,
    "end": 6142.514,
    "text": "All you can do is to create a self-organizing blob",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6143.3,
    "end": 6157.858,
    "text": " that has exactly the right learning rates, so that it has exactly the right learnability, so that it can acquire a generative model and learn through experience-dependent plasticity that model of its little-lived world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6158.258,
    "end": 6161.963,
    "text": "Of course, that little-lived world has been constructed by other grown-up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6164.05,
    "end": 6164.531,
    "text": " babies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6165.311,
    "end": 6178.58,
    "text": "So we get back to this circular causality that evolution is trying to provide you with the right learning rates, precisions, and structural constraints on your generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6179.26,
    "end": 6184.604,
    "text": "But your generative models, from evolution's point of view, are actually creating the environment that has to be learned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6185.642,
    "end": 6191.469,
    "text": " So to my mind, there's a very beautiful circular causality here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6191.909,
    "end": 6197.295,
    "text": "As fast as you're learning, you're actually creating new worlds in which to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.315,
    "end": 6202.161,
    "text": "I guess we're seeing that at the moment with advances in technology and the like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6205.134,
    "end": 6216.299,
    "text": " Which brings me back to my question about the top-down versus bottom-up causation about what is a good model of this world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6216.379,
    "end": 6217.4,
    "text": "What is a good phenotype?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6226.61,
    "end": 6251.361,
    "text": " in our final 15 minutes or so here how do we move beyond the 53.2 either to the authors their directions and excitements about the work or anyone's exhortations or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6253.115,
    "end": 6279.405,
    "text": " raising of possibilities for other ways it can be developed i wonder if it's worth bearing in mind that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6283.596,
    "end": 6312.924,
    "text": " increasing technological not necessarily complexity but at least variability may well have permitted a reduction in selection pressure on the phenotype and evidently affecting both the genotype and epigenetics",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6314.851,
    "end": 6315.632,
    "text": " variability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6316.272,
    "end": 6344.035,
    "text": "I say this because I would like to draw attention to the graph which I presented last week which was taken from Professor Philip Tobias's work on early humans showing an increasing range of variation in the cranial capacity of bipedal hominids from the osteopathy signs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6344.744,
    "end": 6373.296,
    "text": " through to homo sapiens suggesting a reduction in selection pressure for particular well for the size of the brain basically I find it hard not to relate this to the advantages that slowly accrued to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6377.437,
    "end": 6404.672,
    "text": " tool use and thereby of course the variability and variation of tool making thereby reducing the risk or some of the risks existential risks that otherwise plague or have plagued other hominins whether",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6405.333,
    "end": 6421.24,
    "text": " extant, where the ancestors were extant, great apes or indeed the earlier forms of bipedal homininans, australopithecines, pananthropus, canianthropus, etc.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6422.441,
    "end": 6424.421,
    "text": "Well, who knows?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6425.382,
    "end": 6434.806,
    "text": "But it's perhaps not totally irrelevant that this variability",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6436.193,
    "end": 6464.63,
    "text": " has grown over the past couple of million years and is now very wide as I mentioned last week this I think is in contradistinction to the way in which selection pressures have been highly discriminatory in for example",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6465.233,
    "end": 6472.577,
    "text": " producing, let's say, the wide range of Darwin's famous Galapagos finches, just to give a well-known example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6477.439,
    "end": 6477.819,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6478.34,
    "end": 6478.68,
    "text": "Carl?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6480.381,
    "end": 6482.722,
    "text": "I'll ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6482.842,
    "end": 6489.925,
    "text": "Coming back to this theme of selection for selectability and the notion of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6492.281,
    "end": 6497.964,
    "text": " precision or learning rates cast in terms of mutation rates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6498.024,
    "end": 6516.294,
    "text": "So my favorite example of, and I'm sure there are better ones nowadays, when I was reading around this subject, my favorite example was the story told by Ernst Mayr about Drosophila fruit flies being reared in volatile versus non-volatile environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6516.314,
    "end": 6521.117,
    "text": "So you're rearing generation after generation at a fairly fixed temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6521.764,
    "end": 6529.073,
    "text": " and then an equivalent set of generations where they varied the temperature a few degrees plus and minus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6530.335,
    "end": 6538.906,
    "text": "And what they showed was that the mutation rate of the Drosophila in the volatile changing environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6540.345,
    "end": 6552.757,
    "text": " was greater than the genetic mutation rate in the less volatile population or transgenerational populations, which I thought was a beautiful example of selection for selectability itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6552.817,
    "end": 6561.925,
    "text": "That increased variation, certainly, or its phenotypic expression of implicit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6562.486,
    "end": 6570.232,
    "text": " increased genomic variability was itself an adaptive response to the rate of change of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.652,
    "end": 6589.206,
    "text": "So my question is, is there a similar sort of picture or view of variation in either phenotypic or genetic characteristics in over a longer timescale in sort of human evolution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.007,
    "end": 6590.107,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.487,
    "end": 6598.15,
    "text": " If there is, is there any evidence that there is in the past century or so?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6598.17,
    "end": 6615.338,
    "text": "Perhaps this is a bit of an ambitious ask, but is there any evidence that there has been a sort of phase transition in the variability and the evolvability of the associated phenotypic variation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6624.127,
    "end": 6647.405,
    "text": " the empirical or an empirical research agenda would be to make a hierarchical active inference model and perform dynamic causal modeling on different variability characters across levels of phenotypic and genotypic integration and have that model in use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6651.055,
    "end": 6654.783,
    "text": " but a very provocative and interesting question, Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6661.434,
    "end": 6687.487,
    "text": " to what extent is it happening with our cellular architecture and to what extents are these processes happening with our niche given these unique cumulative cultural generative model generative process thinking through other minds increasingly the production of artifacts that enable not just offloading but outsourcing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6689.54,
    "end": 6714.115,
    "text": " these do represent unique cognitive niches and so it will be quite interesting to investigate perhaps if we each want to have some closing round thoughts perhaps dean with the first word",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6715.728,
    "end": 6717.67,
    "text": " Thank you, because you know I hate having the last one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6718.05,
    "end": 6718.791,
    "text": "I'm just curious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6719.792,
    "end": 6724.017,
    "text": "Gentlemen, thank you again for your generosity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6724.717,
    "end": 6734.067,
    "text": "I'm just curious, now that you've dipped your toes in this Active Influence Institute livestream world, what are your impressions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6734.268,
    "end": 6735.429,
    "text": "Was it helpful at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6747.281,
    "end": 6747.902,
    "text": " Who is next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6751.706,
    "end": 6756.291,
    "text": "So I think it has been very useful and mostly very fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6756.452,
    "end": 6760.376,
    "text": "I mean, I've enjoyed a lot to have this discussion with all of you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.496,
    "end": 6761.938,
    "text": "So it's been very enjoyable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6763.96,
    "end": 6765.582,
    "text": "And just for the future,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6767.87,
    "end": 6774.435,
    "text": " I'm just wondering if there is such a thing like preempting surprise based on these counterfactuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6774.615,
    "end": 6785.984,
    "text": "I guess maybe it's already written and discussed and it's all clear, but I wonder that this might be an interesting idea to explore if I can preempt the surprise before I act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6786.324,
    "end": 6791.668,
    "text": "I mean, before even acting, but that's kind of, maybe that's resolved already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6793.069,
    "end": 6793.97,
    "text": "Anyway, it has been fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6794.01,
    "end": 6795.631,
    "text": "Thank you all, honestly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6799.977,
    "end": 6818.156,
    "text": " thank you that makes me think about saying I don't mean to surprise you but that's actually going to increase it's like oh boy has someone been injured but what is the show not tell of preempting surprise so that with a linear string in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6819.755,
    "end": 6840.326,
    "text": " there is the path from the old berry patch to the new berry patch such that it appears to be within a nested hierarchical model the path of least action to follow though in a less nested model it would be quite surprising",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.495,
    "end": 6858.523,
    "text": " Michael or Carl, your kind of closing thoughts or questions as we bring this set of 53 to a close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6860.084,
    "end": 6869.791,
    "text": "Well, I'll let Michael have the last word and just speak to what you just said and Hector's comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6870.352,
    "end": 6873.774,
    "text": "I think there's a lot of interest in that notion, you know, sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6874.312,
    "end": 6876.913,
    "text": " trying to preempt surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6876.933,
    "end": 6888.137,
    "text": "I mean, a simple reading of risk minimisation, you're just basically not engaging in policies that are going to result in surprising outcomes, where surprise is just the violation of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6888.915,
    "end": 6889.776,
    "text": " prior preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6891.077,
    "end": 6897.322,
    "text": "So at that level I think that's sort of almost a truism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6898.082,
    "end": 6913.294,
    "text": "But there is an interesting sort of implication of that which leads to notions of the way that we choose to behave epistemically in terms of avoiding information that would be very surprising.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6914.435,
    "end": 6932.584,
    "text": " sometimes articulate in terms of optimism bias, sometimes in terms of wishful thinking, but the kind of paradox that you get when we are Bayes' optimal creatures, and yet we don't want to open the letter from the GP giving us our most recent cancer results, or we don't want to open that letter",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6933.685,
    "end": 6939.529,
    "text": " whether we failed to get that job or pass that exam or indeed the anatomy dissection viva.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6940.429,
    "end": 6945.413,
    "text": "There are certain things that we avoid, there are certain surprises that we avoid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6945.693,
    "end": 6954.239,
    "text": "I'll put it another way, there are certain ways of pre-empting surprise by avoiding knowing stuff that we might find surprising.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6955.22,
    "end": 6962.225,
    "text": " And that's an emerging literature now, which takes you a little bit outside your comfort zone, but it's a fascinating literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6963.306,
    "end": 6966.729,
    "text": "You'll find things like trends in cognitive science and the like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6967.369,
    "end": 6975.715,
    "text": "In answer to Dean's question about these sessions, because this is not my first session, but this does exemplify it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6975.735,
    "end": 6977.997,
    "text": "Yeah, it's for fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6978.617,
    "end": 6979.638,
    "text": "We're amongst friends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6980.979,
    "end": 6984.64,
    "text": " indulging ourselves and those people who care to listen to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6985.06,
    "end": 6994.404,
    "text": "So I think the next thing to do is the next horizon, although I do think dynamic causal modeling of evolutionary trajectories is an excellent idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6995.164,
    "end": 7000.626,
    "text": "I suspect the heavy lifting now is to get the ideas that we've been talking about out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7000.866,
    "end": 7003.667,
    "text": "I think that's what Michael and Hector have to do, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7003.987,
    "end": 7006.128,
    "text": "It's just keep on telling the story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7006.448,
    "end": 7010.329,
    "text": "And in my experience, it usually takes about five to ten years before people start listening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7017.162,
    "end": 7017.902,
    "text": " Thank you, Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7018.642,
    "end": 7020.523,
    "text": "Michael, with the last word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7022.703,
    "end": 7026.604,
    "text": "Well, these sessions have been fun and most illuminating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7027.705,
    "end": 7039.647,
    "text": "There is a lot to be done on the matter of whether there have been phase transitions in the evolution of what we might call evolvability in the Guinness Homo over the past two million years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7040.188,
    "end": 7046.049,
    "text": "There are big arguments amongst human evolution specialists between whether there was a unitary",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7047.17,
    "end": 7075.682,
    "text": " evolutionary whether a unitary evolutionary model is acceptable or as lumpers like myself would like to believe or whether in fact there was a big bush with a lot of dead end separate unsuccessful species like Homo floresiensis, Homo lusoniensis, Homo",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7077.366,
    "end": 7085.711,
    "text": " or even perhaps Neanderthals, with whom I've had a lot of contact, having excavated about 15 of them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7087.571,
    "end": 7105.961,
    "text": "And these arguments are highly relevant to the matter of cognitive evolution and indeed as to whether the record of artifacts and tools can indeed inform us, and I believe it can, about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7106.857,
    "end": 7115.282,
    "text": " just how, and how slowly, I would say, evolution proceeded.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7116.962,
    "end": 7120.504,
    "text": "Of course, the splitters believe it happened in leaps, jumps and leaps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7121.865,
    "end": 7135.713,
    "text": "I'm rather convinced, as a Darwinist, I believe that things happen very, very slowly, and that we have to concentrate, and with this I conclude, on the, especially the neuro-epigenetic",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7137.376,
    "end": 7162.561,
    "text": " modification of genetic expression as affecting not merely morphology and physiology but also I would say cognition and in the matter in hand of course the ability or not that our surprisals affect",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7163.586,
    "end": 7187.761,
    "text": " onlookers and other people, permitting, let us say, modification of behavior in a very wide, in a far wider, with far wider results than those that occur in many other species, including some of those of our closest permit relatives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7188.422,
    "end": 7192.064,
    "text": "And thank you very much for organizing this session, Daniel and Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7193.154,
    "end": 7194.855,
    "text": " It's been a pleasure to take part.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7196.897,
    "end": 7204.143,
    "text": "I'm sorry that I have this terrible appearance, but I really can't do much about that at the moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7206.525,
    "end": 7208.006,
    "text": "I hope well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7210.668,
    "end": 7211.349,
    "text": "Thank you all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7211.429,
    "end": 7213.43,
    "text": "Michael, at least you have an excuse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7213.45,
    "end": 7214.831,
    "text": "I have no excuse at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7220.256,
    "end": 7220.596,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7222.045,
    "end": 7225.75,
    "text": " Till next time, long live the mean, long live the variance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7227.131,
    "end": 7227.572,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7227.592,
    "end": 7229.735,
    "text": "Bye, everybody.",
    "speaker": "SPEAKER_01"
  }
]