[
  {
    "start": 8.186,
    "end": 9.248,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.409,
    "end": 10.87,
    "text": "It's March 17th, 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.91,
    "end": 12.112,
    "text": "We're here in Active Livestream number 53.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.247,
    "end": 39.037,
    "text": " welcome to the actin institute we're a participatory online institute that is communicating learning and practicing applied active inference you can find us at the links on the slide this is a recorded and archived live stream so please provide feedback so we can improve our work all backgrounds and perspectives are welcome we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.759,
    "end": 47.986,
    "text": " Head over to ActiveInference.org to learn more about the Institute and getting involved with learning groups and projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.768,
    "end": 58.536,
    "text": "We're here in Academic Stream number 53.0 and our goal is to learn and discuss a pair of papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.568,
    "end": 70.899,
    "text": " The first paper is Snakes and Ladders in Paleoanthropology from Cognitive Surprise to Skillfulness a Million Years Ago by Hector Manrique, Carl Friston, and Michael Walker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.92,
    "end": 75.163,
    "text": "The article was posted to SciArchive in 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.704,
    "end": 80.468,
    "text": "And the second paper is To Copy or Not to Copy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.749,
    "end": 81.449,
    "text": "That is the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.537,
    "end": 86.08,
    "text": " From Chimpanzees to the Foundation of Human Technological Culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.081,
    "end": 92.466,
    "text": "This paper is with Manrique and Walker as authors, frist and less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.587,
    "end": 99.392,
    "text": "It was also uploaded to SciArchive and recently, as we have been delighted to discover,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.422,
    "end": 120.422,
    "text": " paper has been accepted in physics of life reviews however the quotes that we're drawing from and reading from today are drawn from the psy archive version just so people know and like all the videos we're here to make an introduction for some of the ideas and the materials it's not a review or a final word",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.539,
    "end": 144.704,
    "text": " in this 53.0 video we're going to introduce ourselves say hello and then we are going to call it like we see it with the aims and claims abstract roadmap keywords and there are no figures or formalisms in these papers but i think we'll have enough bounded surprise to navigate nonetheless",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.504,
    "end": 150.128,
    "text": " So let us begin with introductions and then we'll head into big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.508,
    "end": 151.689,
    "text": "So, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.751,
    "end": 154.131,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.191,
    "end": 154.551,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.571,
    "end": 155.352,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.453,
    "end": 161.236,
    "text": "I'm not going to do much around the warm-up question piece because I've got a big question coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.137,
    "end": 163.018,
    "text": "So I'll pass it over to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.279,
    "end": 164.759,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.12,
    "end": 166.901,
    "text": "I'm in California and agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.501,
    "end": 170.063,
    "text": "Please lead in with your big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.985,
    "end": 174.447,
    "text": "Well, I'm going to start by just sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.155,
    "end": 179.476,
    "text": " highlighting the big questions that the authors have, if that's okay, I'll just read them out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.657,
    "end": 190.281,
    "text": "So for the snakes and ladder paper, there were a number of questions that sort of enabled the authors to go forward with their ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.641,
    "end": 191.621,
    "text": "Two questions arise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.242,
    "end": 205.227,
    "text": "First, what is it that could provoke cognitive awareness as to the possibility of fashioning stone hand axes in relation to the affordances of raw materials and potential advantages for minimizing bioenergetic effort?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.842,
    "end": 213.905,
    "text": " Secondly, what does this say about the irregular appearance of this regular technique in the Pleistocene spatial temporal record?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.745,
    "end": 233.192,
    "text": "Also, how was remembered awareness retrieved from personal short and long-term memory transmitted as knowledge to others in whose memories it could become embedded with a degree of fidelity sufficient to enable intergenerational or intercommunal diffusion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.893,
    "end": 234.533,
    "text": "How far",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.219,
    "end": 237.361,
    "text": " was observational learning involved?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.601,
    "end": 241.964,
    "text": "Do you want me to read the CRNC or do you want to do that yourself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.365,
    "end": 246.788,
    "text": "All right, I'll read the questions from the authors in Copy or Not to Copy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.569,
    "end": 253.653,
    "text": "They wrote, why do chimpanzees not live in a complex technological world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.474,
    "end": 259.878,
    "text": "Why does innovation fail to translate into technological cumulative complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.439,
    "end": 263.821,
    "text": "Does it owe to a limited capacity to copy with fidelity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.702,
    "end": 266.925,
    "text": " What is the implication for innovations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.365,
    "end": 282.024,
    "text": "What ingredients must be present from a free energy principle standpoint in innovators' minds slash brains and in observers' minds slash brains for innovation to take root in a community and be transmitted between generations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.223,
    "end": 289.944,
    "text": " Yeah, great questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.864,
    "end": 312.515,
    "text": "Now, how do we want, well, we know how we want to do this, but one of the things before we get too far along is we want to, we as hosts today, really want to honor the fact that a lot of time has been spent making sure that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.105,
    "end": 327.128,
    "text": " ideas that the authors want to bring into the public domain are very clear and that we don't read a whole bunch into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.168,
    "end": 329.769,
    "text": "Now we're not going to speculate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.809,
    "end": 332.51,
    "text": "We're not going to go off on any kind of tangent here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.85,
    "end": 342.934,
    "text": "We're going to try to focus strictly on the arguments that they are putting forward because they're putting forward some pretty strong and I think well evidenced arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.614,
    "end": 346.075,
    "text": "So although there's lots of questions being asked,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.527,
    "end": 351.273,
    "text": " They're also trying to provide a few very defendable answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.595,
    "end": 354.116,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.12,
    "end": 382.537,
    "text": " that is to prelude the questions that we dean and i and ali are asking and then we're going to dive largely into verbatim quotations from the texts and we'll have a dessert session where we bring up some future topics and ideas what big question brought you into this 53d okay so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.699,
    "end": 391.823,
    "text": " Apologies, there's going to be a lot of reading today, so if you don't like my voice, you're going to just read this and hit the pause button.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.863,
    "end": 396.026,
    "text": "But anyway, the attention to topical transition is paper one to paper two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.526,
    "end": 402.95,
    "text": "And we're not really spending a lot of time right now saying which came first, because we think of them as a pair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.13,
    "end": 406.692,
    "text": "The shift between snakes and ladders model of evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.304,
    "end": 413.187,
    "text": " and learning comparisons across species with special attention given to innovation as copying ability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.227,
    "end": 418.05,
    "text": "Both papers, there is much to say and discuss around learning as an uptake exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.95,
    "end": 435.579,
    "text": "If as reviewers, people reading these papers, we were to take an active, and then in between that and inference, anthropologist, archaeologist, comparative psychologist approach to combining these manuscripts, and then I singled out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.098,
    "end": 445.543,
    "text": " many examples of where the authors speak expressively around combining, combinatorial, and you can read that on your own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.763,
    "end": 461.931,
    "text": "If we were to look at combinations, what might we learn when bicameral, for example, two I's, and bitemporal, meaning holding up then and now strategies as analysis, are approximated with active and inference as parentheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.691,
    "end": 463.592,
    "text": "Tool uptake,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.107,
    "end": 472.133,
    "text": " For example, telescopes and microscope usage after before or concurrent with compounding strategy uptake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.114,
    "end": 474.495,
    "text": "So that's my big question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.535,
    "end": 478.858,
    "text": "And I think we're probably not going to get close to an answer until the doc two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.239,
    "end": 484.903,
    "text": "That's why it's a big question, because I think it's going to be able to span a little bit of a window here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.837,
    "end": 487.117,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.178,
    "end": 490.999,
    "text": "And I wrote a shorter question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.019,
    "end": 505.906,
    "text": "Apart from other applications, for example, in research and development or in other fields or looking towards the future, how does the free energy principle and active inference serve as a historical framework or approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.626,
    "end": 515.27,
    "text": "So whether we lean towards Aristotelian causation philosophies or Tinbergen's approach to ethology, behavioral analysis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.57,
    "end": 524.807,
    "text": " How does a historical explanatory power fit in amongst the whys, the plurality of whys,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.022,
    "end": 527.283,
    "text": " in our investigations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.144,
    "end": 538.872,
    "text": "And Ali, who is joining for some discussions, proposed the question, how can self-organized systems use copy-discard functions to store information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.893,
    "end": 547.68,
    "text": "A little bit of an externalization from our category theory developments that I'm sure will arise later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.52,
    "end": 551.703,
    "text": "So you go for the top, I'll go for the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.708,
    "end": 571.962,
    "text": " Okay, so just before I start, I want to really emphasize the fact that the authors, I think to really comprehend what the authors are trying to put forward as an idea here, you have to really spend some time thinking through the aims of the papers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.441,
    "end": 574.342,
    "text": " and the claims we've placed a heavy emphasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.782,
    "end": 576.483,
    "text": "We're going to give a lot more time over to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.863,
    "end": 595.23,
    "text": "It's going to seem like we're going to give a lot of time over to the keys because having talked to the authors prior to coming on and doing this live stream set, they use those terms of the key and the key to unlocking some of these ideas that have been held for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.29,
    "end": 601.072,
    "text": "So apologies again, if it seems like we're text heavy or dialogue heavy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.872,
    "end": 605.094,
    "text": " But in order to really appreciate what's going on, you have to kind of get it out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.594,
    "end": 631.271,
    "text": "So for the snakes and lattice paper, provide a hypothesis, a paradigmatic account around how variational free energy is both individual, ontogenetic, and collective, phylogenetic, modeling, could have played a part in what could now be described as a methodological FEP paradigm for relating biological and technological behavior in homework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.327,
    "end": 643.212,
    "text": " Snakes and ladders in this context pertains to appearances and disappearances of Paleolithic skills in the early and middle Pleistocene record.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.273,
    "end": 651.296,
    "text": "Our proposal invokes a methodological paradigm grounded in existential principles that underpin the evolution of living organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.096,
    "end": 659.84,
    "text": "It is that some, at least, of the irregular regularities and regular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.405,
    "end": 683.972,
    "text": " irregularities of phenomena attributable to Homo in the Pleistocene record reflect the kinds of plausibility anomalous behavioral outcomes that doubtless occurred often in the stakes and ladder model of evolution in early members of our genus, regardless of their skeletal paleo-specific taxonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.192,
    "end": 685.492,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.832,
    "end": 688.073,
    "text": "I'll read the bottom and then feel free to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.847,
    "end": 691.488,
    "text": " explain the side-by-side visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.588,
    "end": 694.188,
    "text": "They wrote in to copy or not to copy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.229,
    "end": 714.014,
    "text": "An aim is to introduce the notion that chimpanzees and other great apes show considerable limitations in their ability or zone of bounded surprisal to overcome cognitive surprisal induced by innovative or unorthodox behavior, which rarely is copied precisely or accurately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.534,
    "end": 715.875,
    "text": "So things that can be innovated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.897,
    "end": 744.351,
    "text": " in a moment but do not have the ability to be recognized and carried forward and they discussed the circumstances under which Pleistocene homo underwent remarkable evolutionary adaptation of neurobiological propensities cerebral aspects are discussed that it is proposed here were fundamental for faithful copying which underpins social transmission of Technologies cumulative culture and culture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.333,
    "end": 751.434,
    "text": " So I think what we're going to be doing is holding up two things at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.195,
    "end": 758.777,
    "text": "The two things are copying as repetition and copying as origination, if there is such a word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.017,
    "end": 764.239,
    "text": "But essentially, these images here, there are copies that were simply cut and pasted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.859,
    "end": 765.859,
    "text": "So they were repeated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.46,
    "end": 767.32,
    "text": "And then there was one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.18,
    "end": 796.956,
    "text": " representation between those two that's an origination it didn't exist to be copied but now it can be so now what we're going to be doing is looking at okay so how does maybe all of that play out when we're observing the world around us when we're taking things in and trying to reduce our surprise how many things are we being deep faked on how many things are actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.62,
    "end": 810.856,
    "text": " original, representational, and therefore manageable as two very different places of understanding or appreciation maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.053,
    "end": 838.748,
    "text": " great all right I'll go for the first of the sections and then feel free to comment on them or to pick up on the second sections so in snakes and ladders they wrote cognitive surprises favoring anomalous behavioral propensities to sporadic expression can explain snakes and ladders appearances and disappearances of Paleolithic skills in the early and middle Pleistocene record",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.279,
    "end": 852.499,
    "text": " some behavioral outcomes attributable plausibly to individual members of Homo unable to maintain orthodox behavioral responses when faced with cognitive surprises, which is surprisal in the Bayesian terminology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.979,
    "end": 860.243,
    "text": " such individuals may show a particular neurobiological propensity for exploring unorthodox possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.024,
    "end": 873.012,
    "text": "The propensity has evolved further in humans than in great apes, which, unlike even our very young children, our larva, seem unable to envisage how things might be as well as how they actually are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.233,
    "end": 883.059,
    "text": "Whereas by coupling recall of past experience with prospective memory, humans are capable of blending reality among different potential spheres.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.737,
    "end": 903.167,
    "text": " Statistical considerations of classical population genetics are incommensurate with notions that Darwinian fitness and Pleistocene homo increased imperceptibly through gradual dual inheritance co-evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.688,
    "end": 910.412,
    "text": "Inherited changes preceded in well-nigh invariant lockstep",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.987,
    "end": 915.49,
    "text": " with heritability of adaptive behavioral and technological changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.23,
    "end": 937.642,
    "text": "Although ontogenetic autopoiesis may involve action perception cycles, a phylogenetic consequence could include unawareness by companions that those exceptions might allow new cooperative opportunities for minimizing the group's variation of free energy by performing unaccustomed behavior to attain dubious benefit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.439,
    "end": 955.091,
    "text": " Without foresight or fluent communication, innovations often must have disappeared unremarked, seen as useless, and their creator's prowess as misplaced energy and wasting time needed for satisfying the group's existentially implacable energetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.212,
    "end": 965.679,
    "text": "Pre-potent routine behavior and pro-social early homo plausibly resulted in failure to become aware of the potential of idiosyncratic inactive outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.892,
    "end": 979.577,
    "text": " Here, a prosaic approach merely inverts that narrative approach to interpreting the deep past which draws for its inspiration on humane and social studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.437,
    "end": 993.262,
    "text": "The inversion subordinates the narrative approach to critical scrutiny such that the narrative approach no longer seems to be the most appropriate or most parsimonious interpretation available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.803,
    "end": 998.306,
    "text": " Now, again, what we're doing is trying to avoid the situation where we're cherry picking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.366,
    "end": 1005.071,
    "text": "So if you want to pause and read what's been written in context, please feel free to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.131,
    "end": 1012.337,
    "text": "But we just want to make sure that we touch on the highest peaks in this range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.735,
    "end": 1016.097,
    "text": " Yes, the full papers are out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.157,
    "end": 1024.082,
    "text": "We're linearizing and curating in this dot zero, which has been an incredible experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.762,
    "end": 1032.127,
    "text": "And that has helped us grasp some of these points, hopefully, so we can take them further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.008,
    "end": 1035.729,
    "text": "And I'll read the quote, then you can go into the red zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.43,
    "end": 1036.87,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.27,
    "end": 1040.853,
    "text": "In Snakes and Ladders, they wrote, the argument proposed here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.048,
    "end": 1065.114,
    "text": " about a neurobiological propensity to an individual enactment in modifying stone considered from the standpoint of the free energy principle is not concerned with a null hypothesis of innate latent spontaneity instead it is directed towards interpreting irregular regularities and regular irregularities in the pleistocene snakes and ladders record",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.894,
    "end": 1091.385,
    "text": " of appearances and disappearances of bf lcts which we're going to get to tools given presence of bf lcts in widely differing biotopes which likely led to differential behavioral evolution of appropriate subsistence strategies and diets there is widespread comparability of the principal morphological attributes of bf lcts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.285,
    "end": 1101.447,
    "text": " of diverse petrology at sites with contrasting paleo environments and different spatiotemporal contexts or paleoanthropological taxa",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.708,
    "end": 1113.414,
    "text": " This renders unlikely any notion of a straightforward Mendelian genetic basis favoring BF-LCT outcomes by natural selection for a specific behavioral adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.135,
    "end": 1128.163,
    "text": "The circumstantial evidence seems to apply the adaptive evolution of human neurobiology propensities that support prospective memory in toolmaking together with short-term working memory, including haptic working memory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.723,
    "end": 1155.016,
    "text": " long-term working memory and long-term procedural memory and episodic memory of past matters and things so i just wanted i i'm doing a tease here because on the previous slide i i starred one of the claims and then the last claim on this slide here my note is essentially i'm just going to read the part that doesn't again have me speculating memory broken into types",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.905,
    "end": 1176.929,
    "text": " as you can see here, working memory, long-term, procedural, et cetera, and now being applied instrumentally, did all the memory types at some threshold of uptake afford a parallel processing of time, given time's potential variance over the simpler sequential sense of change as the starter pack priority today?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.949,
    "end": 1184.67,
    "text": "And when I say starter pack priority today, how much about what we do today is being projected or overfit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.422,
    "end": 1186.763,
    "text": " onto the deep past?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.744,
    "end": 1194.068,
    "text": "This is a question that Michael's presentation in the 53.1 is going to have much to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.209,
    "end": 1197.75,
    "text": "Also, the last claim of the copier not to copy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.77,
    "end": 1199.992,
    "text": "So a bit of a teaser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.012,
    "end": 1206.316,
    "text": "You're going to want to show up for 53.1 because I think Michael's presentation is going to really open up a lot of eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.558,
    "end": 1209.879,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.019,
    "end": 1224.153,
    "text": " into to copy or not to copy we go to their claims so just to read some of the first parts what is the implication for innovations a sine qua non",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.148,
    "end": 1244.061,
    "text": " for one to spread, so something that must happen to spread, is following its conception by one mind, namely the HMM, hierarchically mechanistic mind, of the protagonist's brain, it must then be apprehended by another mind, namely the HMM of an observer's brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.461,
    "end": 1246.203,
    "text": "And we're going to come back to that on the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.223,
    "end": 1253.087,
    "text": "Here innovations represent an anomaly and innovators are unorthodox actors or protagonists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.198,
    "end": 1271.957,
    "text": " Their policy selection is in a sense faulty, in the sense that their ensuing behavioral outcomes are in marked contrast to those of their fellow actors or agents who deploy orthodox responses that reduce discrepancies between predictions and sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.078,
    "end": 1275.34,
    "text": "Thus innovators fail to fulfill their predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.144,
    "end": 1285.87,
    "text": " If innovations be regarded as behavioral outputs, theirs are then responses that fall outside the repertoire typical of their community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.711,
    "end": 1293.095,
    "text": "And hence, satiris paribus, all other things equal, increase the prediction error, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.115,
    "end": 1298.679,
    "text": "the level of cognitive surprisal, in their exchanges with the surrounding eco-niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.619,
    "end": 1314.348,
    "text": " Predictive consequences of any observed innovative behavior will be too imprecise for the conspecific to make sense of that novel or unorthodox behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.809,
    "end": 1319.692,
    "text": "When sense cannot be made, copying cannot take place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.814,
    "end": 1324.156,
    "text": "Very clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.697,
    "end": 1331.902,
    "text": "When brains cope with high levels of cognitive surprisals, a plausible answer is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.805,
    "end": 1338.35,
    "text": " It is when the holding capacity of working memory increases from two to three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.05,
    "end": 1349.179,
    "text": "Working memory in this setting corresponds to the temporal depth of generative models that generate or predict the consequences of successive actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.219,
    "end": 1359.528,
    "text": "This transition increases temporal horizon, which amplifies cognitive versatility and one of my favorite things, recursive thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.902,
    "end": 1369.428,
    "text": " A working memory or detemporal model able to entertain diverse novel Bayesian beliefs is more likely able to recognize and remember innovative behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.089,
    "end": 1390.463,
    "text": "And it's easier for chimpanzees to perform complex actions that involve considerable motor demands than it is for them to reproduce actions that are simple and undemanding with regard to motor dexterity and yet unorthodox with regard to their habitual behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.782,
    "end": 1391.783,
    "text": " behavioral repertoire.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.926,
    "end": 1395.186,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.947,
    "end": 1400.931,
    "text": "I'll just joke and meme internally as we carry forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.054,
    "end": 1405.835,
    "text": "Go for the top half here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.936,
    "end": 1407.797,
    "text": "I'll do the first three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.437,
    "end": 1416.885,
    "text": "When considering early Pleistocene behavior, we need not assume memories were less complex psychocognitively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.691,
    "end": 1428.593,
    "text": " than are ours, it is prosaically sufficient to infer that they were simply less frequent owing to earlier consolidation of cerebral networks in Homo erectus' smaller brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.974,
    "end": 1436.375,
    "text": "And we're going to get into something called the zone of bounded surprisal, here and after the ZBS restricted them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.555,
    "end": 1446.857,
    "text": "Observations by early Homo erectus were translated often into activity intermediate between, I love that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.29,
    "end": 1451.312,
    "text": " emulation and imitation, owing to limited foresight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.612,
    "end": 1464.097,
    "text": "The, or their, ZBS limited their ability to join up the mental steps involved in planning and to infer counterfactual possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.718,
    "end": 1472.201,
    "text": "The focus of the ZBS is on the observers and their ability to make sense of an observed innovation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.456,
    "end": 1487.039,
    "text": " The ZBS allows any potentially novel or unorthodox behavior to be copied provided that the ranges or the levels of surprise provoked in observers are tolerated or manageable by them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.28,
    "end": 1496.882,
    "text": "There is bilateral neuronal activation in some brain regions when some tools are being fashioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.01,
    "end": 1523.328,
    "text": " activation is bilateral because fashioning stone requires precise and accurate monitoring by right hemisphere neurons of the left hand holding the future artifact as well as the actions shaping it performed by the right hand holding a hammer stone which are monitored by left hemisphere neurons together they coordinate continuously changing sensory motor representations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.269,
    "end": 1530.213,
    "text": " with appropriately changing hand movements undertaken in an organized forward sequence of perception action with feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.133,
    "end": 1537.578,
    "text": "Entertaining multiple and varied predictions in the Bayesian framework represented as probability densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.618,
    "end": 1540.94,
    "text": "In alternate models generated about reality,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.236,
    "end": 1552.145,
    "text": " enables the narrowing of cognitive gaps, or lessening of cognitive dissonance or surprisal when conspecifics are seen to carry out unusual or unorthodox behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.026,
    "end": 1555.849,
    "text": "That paves the way for horizontal and vertical transmission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.403,
    "end": 1573.578,
    "text": " The working memory capacity of chimpanzees seems to be below that tipping point at which multiple mental spheres or possibilities can be entertained simultaneously for pitting against an observed novel behavior while keeping cognitive surprisal within a tolerable range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.419,
    "end": 1582.547,
    "text": "Unsurprisingly, no copying occurs when innovations observed deviate markedly from usual chimpanzee behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.127,
    "end": 1586.229,
    "text": " Can I just throw something in here now at this point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.269,
    "end": 1589.412,
    "text": "We'll step back and think about this as a live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.052,
    "end": 1599.581,
    "text": "We are trying to avoid a tipping point by placing a heavy weighting on the aims and claims relative to most of the live streams that we've done in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.721,
    "end": 1604.965,
    "text": "This is a big buildup, but think of this as your classic barbell",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.088,
    "end": 1627.289,
    "text": " um analogy we've just set one plate on the bar now we're going to look at the bar and then we're going to look at the other plates on the other side of this when we get to the keys you can go for the first abstract i'll do the second you got it okay a scientific paradigmatic account suffices",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.151,
    "end": 1644.361,
    "text": " To interpret behavioral evolution in early homo, cognitive surprises favoring anomalous behavioral propensities to sporadic expression can explain stakes and ladders, appearances and disappearances of paleolithic skills in the early and middle Pleistocene record.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.081,
    "end": 1655.367,
    "text": "The account applies to the principle of stationary action, which underpins the free energy principle to self-organizing systems at an evolutionary timescale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.281,
    "end": 1676.075,
    "text": " unusual personal attainments, often explained by invoking progressive ascent of evolutionary phylogenetic ladders of cognitive and technical abilities, could be disregarded in a hominid community that failed to imagine or articulate possible advantages for its survivability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.275,
    "end": 1680.558,
    "text": "Such failure, as well as diverse, fortuitous demographic accidents,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.178,
    "end": 1691.702,
    "text": " could erase from collective memory the recollection of exceptional individual conduct, which disappeared down a snake, so to speak, of the human evolutionary puzzle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.302,
    "end": 1695.783,
    "text": "The puzzle discomforts paleoanthropologists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.383,
    "end": 1697.183,
    "text": "The gloves are on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.484,
    "end": 1701.985,
    "text": "Some explain it away with the self-justifying assertion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.671,
    "end": 1716.576,
    "text": " that separate paleospecies of Homo differentially possessed cognitive abilities that allegedly underlay the differential presence or absence in the Pleistocene archaeological record of traces of particular behavioral outcomes or skills.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.237,
    "end": 1731.142,
    "text": "An alternative methodological perspective grounded in the fundamental relationships between organisms and their environments affords parsimonious, prosaic, deflationary account for appearances and disappearances",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.832,
    "end": 1736.276,
    "text": " of behavioral outcomes and skills, thus the title, Snakes and Ladders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.517,
    "end": 1737.778,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.338,
    "end": 1740.68,
    "text": "And the abstract of copy or not to copy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.721,
    "end": 1755.655,
    "text": "A prerequisite for copying innovative behavior is the capacity of observers' brains, regarded as hierarchically mechanistic minds, to overcome cognitive surprisal by maximizing the evidence for their internal models via active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.136,
    "end": 1772.511,
    "text": " Unlike modern humans, chimpanzees and other great apes show considerable limitations in their ability or zone of bounded surprisal to overcome cognitive surprisal induced by innovative or unorthodox behavior, which rarely is copied precisely or accurately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.312,
    "end": 1781.54,
    "text": "Most can copy adequately what is within their phenotypically habitual behavioral repertoire, in which technology plays a scant part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.103,
    "end": 1791.047,
    "text": " Widespread intra- and intergenerational social transmission of complex technological innovations is not a hallmark of great ape taxa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.027,
    "end": 1800.892,
    "text": "Over 3 million years ago, precursors of the genus Homo made stone artifacts, and stone flaking was likely habitual before 2 million years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.032,
    "end": 1806.935,
    "text": "After this time, early Homo erectus left traces of technological innovations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.669,
    "end": 1815.591,
    "text": " though faithful copying of these and their intra and intergenerational social transmission were rare before a million years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.651,
    "end": 1827.453,
    "text": "This likely owed to a cerebral infrastructure of interconnected neuronal networks that bounds the expressivity of internal world models entailed by their functional architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.414,
    "end": 1837.676,
    "text": "Brains were smaller in size than ours and cerebral neuronal networks ceased to develop when early Homo erectus attained full adult maturity by the mid teen years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.663,
    "end": 1842.246,
    "text": " whereas their development continues until our mid-20s nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.106,
    "end": 1847.85,
    "text": "Pleistocene homo underwent remarkable evolutionary adaptation of neurobiological propensities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.91,
    "end": 1857.757,
    "text": "Cerebral aspects are discussed that it is proposed here were fundamental for faithful copying, which underpins social transmission of technologies, cumulative learning, and culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.598,
    "end": 1859.798,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.779,
    "end": 1871.503,
    "text": " One of the most amazing roadmap became road, rail became train station, clearing house slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.883,
    "end": 1872.683,
    "text": "So what is happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.184,
    "end": 1890.27,
    "text": "So the, the, I think the great gift that the authors have provided Daniel and I here is the opportunity because this, this work is talking about sequential time and when on that timeline,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.802,
    "end": 1892.043,
    "text": " Did things happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.223,
    "end": 1892.984,
    "text": "Which came first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.924,
    "end": 1902.13,
    "text": "Or why did something that we thought came after, suddenly we find new evidence that maybe it didn't come after?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.351,
    "end": 1903.992,
    "text": "Maybe it was co-occurring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.592,
    "end": 1915.2,
    "text": "And so what I want to do in this particular slide was talk about things like timelines and timetables around the idea of a learning destination, assuming that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.128,
    "end": 1922.633,
    "text": " learning does have some sense of convergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.193,
    "end": 1931.78,
    "text": "So my question was, well, what if all roads, be they rail or paved, lead to an active roam or roamference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.561,
    "end": 1934.463,
    "text": "Like, what is this journey that we're on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.523,
    "end": 1936.765,
    "text": "What is this interstate that we exist within?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.365,
    "end": 1944.411,
    "text": "And why do we always assume that what we're looking at is the ties between the rails instead of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.847,
    "end": 1958.958,
    "text": " making sure that when we're talking about a tipping point, we're talking about the fact that the entire underlying structure can hold up the vehicle that Daniel and I are basically sitting on right now and moving forward with, back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.599,
    "end": 1962.761,
    "text": "So the timelines and timetables to learning destinations are not uptakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.222,
    "end": 1967.405,
    "text": "Someone else's formatting is not your outing of a figure, okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.465,
    "end": 1972.109,
    "text": "So I've never been on an official DIG site, but I have come across",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.022,
    "end": 1975.143,
    "text": " dinosaur bones being in Alberta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.743,
    "end": 1981.264,
    "text": "And so you stumble across these things and whoa, what's that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.304,
    "end": 1983.905,
    "text": "In an otherwise field of play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.665,
    "end": 1990.107,
    "text": "How much can we schedule and how much is dependent on the sophistication of our hierarchical model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.787,
    "end": 1992.528,
    "text": "And again, I've practiced this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.828,
    "end": 1993.948,
    "text": "With apologies to Hector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.138,
    "end": 2002.138,
    "text": " Where are we departing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.619,
    "end": 2005.86,
    "text": "All we know is it's platforms one and nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.181,
    "end": 2007.541,
    "text": "Let's go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.842,
    "end": 2009.282,
    "text": "Vamos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.322,
    "end": 2010.882,
    "text": "All aboard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.563,
    "end": 2013.524,
    "text": "But great, great visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.984,
    "end": 2018.226,
    "text": "The papers do have sections, however, without figures or formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.997,
    "end": 2033.065,
    "text": " we were able to, and drawing on the unique subject matter and contributions, able to also even reconsider the linearity and the structure of the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.413,
    "end": 2058.135,
    "text": " the keywords are displayed on the slide just to quickly read through them in snakes and ladders free energy principle fep paleolithic enactment irregular regularities and regular irregularities haptic working memory tasks prospective epistotic and procedural memory phylogenetic and ontogenetic time scales favoring anomalous behavioral propensities to sporadic expression",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.656,
    "end": 2074.606,
    "text": " The principle of stationary action applied to self-organizing systems at an evolutionary timescale, and in copy or not to copy, chimpanzees, cumulative culture, free energy principle, generative model, homo erectus, innovation observer, stone tools technology, and the zones of bounded surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.647,
    "end": 2077.468,
    "text": "What can you add about the published priors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.236,
    "end": 2099.614,
    "text": " Well, I just think it's interesting because we've always used this image of the sort of the infinite and Antference ref, which I've always really liked because I just momentarily lost the strange loop piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.634,
    "end": 2100.095,
    "text": "What is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.475,
    "end": 2100.995,
    "text": "Mobius?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.396,
    "end": 2102.397,
    "text": "Is it a Mobius, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.263,
    "end": 2109.768,
    "text": " Amobia stripped also developed by here, MC Escher and Doug Hofstetter into the strange loop concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.928,
    "end": 2110.148,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.429,
    "end": 2110.649,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.709,
    "end": 2116.293,
    "text": "So all I wanted to do is add that the fact that maybe, maybe there is these branch lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.474,
    "end": 2132.366,
    "text": "And when we're talking about published priors, which can't like, I mean, no, they, I know that in the chronological time they came first, but if we were now to go to them post having read these papers, what, what would that reveal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.755,
    "end": 2135.976,
    "text": " Is a branch less important than the trunk?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.076,
    "end": 2136.476,
    "text": "I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.816,
    "end": 2137.216,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.576,
    "end": 2139.037,
    "text": "Without a trunk, there are no branches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.577,
    "end": 2143.338,
    "text": "But without branches, there is no totality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2143.418,
    "end": 2146.298,
    "text": "So that's what I was kind of laying out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.599,
    "end": 2152.9,
    "text": "Also, with respect to the literature, it's a canonical example of cumulative culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.94,
    "end": 2153.74,
    "text": "It's all at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.821,
    "end": 2160.002,
    "text": "And the timing of which, through Kronos, publications were added in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.175,
    "end": 2188.096,
    "text": " is by no means the chronos or the kairos of the learner or the researcher so going from just the past and the present two min two of the literature to the past present and future three with literature expands into the key points with another uh disclaimer for your health",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.397,
    "end": 2190.819,
    "text": " There are no Coles Notes version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.879,
    "end": 2195.824,
    "text": "It will both make sense and do justice to the analysis, research arguments as laid out in these papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.825,
    "end": 2200.209,
    "text": "We begin with keys and then start a process of unlocking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.749,
    "end": 2201.15,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.37,
    "end": 2203.773,
    "text": "So how do you want to do this, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.793,
    "end": 2208.498,
    "text": "Do you want to split each one of the slides or do you want to just swap slides?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2208.538,
    "end": 2209.379,
    "text": "I'll do one, you do one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.798,
    "end": 2209.978,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.238,
    "end": 2211.099,
    "text": "You go for this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.279,
    "end": 2212.54,
    "text": "You go for even slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.62,
    "end": 2213.541,
    "text": "I'll do odd slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.561,
    "end": 2214.682,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.382,
    "end": 2215.722,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.063,
    "end": 2217.484,
    "text": "So this is all the keys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.644,
    "end": 2220.506,
    "text": "There are 17 of them from the Snakes and Ladder paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.607,
    "end": 2224.909,
    "text": "Again, I really strongly recommend you have a read of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.429,
    "end": 2226.63,
    "text": "It's a fantastic paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.531,
    "end": 2232.654,
    "text": "But if you want the one and a half times speed version of hearing it, this is what it sounds like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.355,
    "end": 2236.137,
    "text": "Evidence of early and middle plasticine behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.661,
    "end": 2243.846,
    "text": " is distributed in disconcertingly uneven ways between 2 million and 200,000 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.246,
    "end": 2262.758,
    "text": "Our proposal is that some, at least, of the irregularities and irregularities of phenomena attributable to Homo in the Pleistocene record reflect the kinds of plausibly anomalous behavioral outcomes that doubtless occurred often in a stakes and ladders model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.303,
    "end": 2268.884,
    "text": " of evolution in early members of our genus regardless of their skeletal paleo-specific taxonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.264,
    "end": 2280.226,
    "text": "Increasingly, complex, extractive, and concomitant or consequent procedures appear in several parts of the world at various times towards the end of the late Pleistocene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.906,
    "end": 2288.688,
    "text": "Some seem to have arisen separately and independently in a snakes and ladders fashion and with different outcomes in different places and times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.835,
    "end": 2292.436,
    "text": " Self-evidencing underwrites much of the following arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.516,
    "end": 2295.117,
    "text": "However, there is an important nuance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.917,
    "end": 2301.919,
    "text": "Certain creatures may have evolved deep generative models with the ability to predict the consequences of their action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.439,
    "end": 2309.481,
    "text": "This kind of creature now has the capacity to entertain counterfactual futures under different actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.361,
    "end": 2313.402,
    "text": "This is a key aspect of active inference under the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.442,
    "end": 2319.544,
    "text": "Namely, actions and plans are selected on the basis of minimizing expected free energy under",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.96,
    "end": 2321.06,
    "text": " that plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.821,
    "end": 2333.425,
    "text": "In terms of Bayesian mechanics, evolution and natural selection can be regarded as natural Bayesian model selection, which is also known as structure learning in the cognitive sciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.125,
    "end": 2339.607,
    "text": "Evolution thus develops imperceptibly and intermittently, and the FEP concept",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.248,
    "end": 2359.473,
    "text": " is biologically and especially neurobiologically relevant, both at ontogenetic levels of cellular dynamics, neural circuitry, and behavior, and at phylogenetic levels of populations evolved through natural selection of biological adaptations and adaptability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.653,
    "end": 2368.795,
    "text": "Just before we move on, because there's a bunch of other keys here, I hope it makes sense that not only are we setting the bars up or the plates up on either end of the bar,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.87,
    "end": 2377.073,
    "text": " If we're talking about a tipping point, we as the agent, we're going to now bring that bar down to our chest and then re-extend ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.453,
    "end": 2381.075,
    "text": "We don't want the tipping point to be the bar comes down and then squishes us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.175,
    "end": 2390.159,
    "text": "So us setting this up, there's not a tipping point as a threshold is met and over the whole thing goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.559,
    "end": 2396.942,
    "text": "The tipping point is here, is there some agent that's actually capable of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.834,
    "end": 2400.555,
    "text": " We're talking directly about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.118,
    "end": 2420.551,
    "text": "Continuing with snakes and ladders, doubtless, tried and trusted routines predominated, and whoever performed them with daily efficiency was trusted by the group, whereas eccentric or idiosyncratic conduct was treated with indifference and not retained in collective memory or lore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.732,
    "end": 2423.073,
    "text": "Pre-potent routine behavior...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.363,
    "end": 2430.144,
    "text": " plausibly resulted in failure to become aware of potentially idiosyncratic inactive outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.444,
    "end": 2447.508,
    "text": "There is a difference between a spatiotemporal snakes and ladders picture of disappearances of tiny hunter-gatherer bands and appearances of others, and the snakes and ladders model of individual idiosyncratic or unorthodox activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.788,
    "end": 2453.409,
    "text": "Heterogeneous composition renders the former picture inappropriate for making predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.38,
    "end": 2455.558,
    "text": " Whereas the latter model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.949,
    "end": 2486.123,
    "text": " individual idiosyncratic or unorthodox activity by focusing on the information theoretic and energetic constraints on biological neurobiological and psychosocial evolution allows for the consideration of whether by doing so it may offer a reasonable interpretation of the material record in particular the uneven distribution of stone hand axes and evidence of paleolithic combustion between two million and two hundred thousand years ago",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.163,
    "end": 2511.423,
    "text": " the marginal relevance of stone about three million years ago for the existential biological imperative of maintaining homeostatic integrity and consequent reproductive success and survival of inarticulate hominina plausibly led stones to be regarded as quintessentially predictable and unsurprising and crucially lacking epistemic affordances implicit in tool use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.384,
    "end": 2523.412,
    "text": " Nevertheless, an individual could entertain more expressive models and respond to exploratory, epistemic, and exploitative pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.793,
    "end": 2533.84,
    "text": "She might discover novel ways of attaining predictable or unsurprising outcomes through her behavior and its outcome may well have been disregarded by her companions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.109,
    "end": 2556.367,
    "text": " the same such idiosyncratic behavior may trump prevailing expectations that normally are unsurprising and therefore favor minimization of variational free energy in line with the free energy principle it is unclear by what mechanism transmission of any conjectural package could have been sustained over the spatiotemporal dimensions involved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.489,
    "end": 2567.692,
    "text": " And so with respect to some kinds of tool usage, it is imprudent to infer that they reflect an unbroken tradition of manual behavior handed down from generation to generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.652,
    "end": 2579.715,
    "text": "If a generation lasts 25 years on average, then 200,000 years imply 8,000 generations, which presents a major challenge for the culture history approach to interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.011,
    "end": 2592.894,
    "text": " In late middle Pleistocene, BF-LCTs were made by precursors of H-sapiens in Africa and Neanderthals in Europe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.294,
    "end": 2595.874,
    "text": "Probably both used them in similar ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.935,
    "end": 2602.797,
    "text": "Nevertheless, the uneven spatial temporal distribution of BF-LCTs is undeniable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.017,
    "end": 2607.758,
    "text": "Cognitive and manual designs and strategies for responses in common",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.683,
    "end": 2614.745,
    "text": " underlying neurobiological propensities shared by the early and middle Pleistocene nappers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.805,
    "end": 2618.247,
    "text": "Nappers are people that actually form and shape these tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.407,
    "end": 2637.914,
    "text": "Sporadic local enactment by H. Heidelberghenis could well have been responsible for puzzling exceptional finds of what at first sight looked like impossibly early instances of stoneworking techniques that flowered only much later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.976,
    "end": 2647.903,
    "text": " showing that hand axes could be knapped with care and attention in Europe before the middle of the middle Pleistocene, thereby disproving a commonly held butte to the contrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.804,
    "end": 2664.037,
    "text": "The alternative ways of modifying stones that appeared after 2MA, namely on the one hand to make LCTs, that's one-sided, and in particular BF LCTs, and on the other to remove usable flakes from cores,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.063,
    "end": 2691.043,
    "text": " but also may have undergone some modifications, sometimes sort of facilitate the removal, implies that H. erectus could carry out two different irreversible chains of the manipulative reduction of stone, implying a capacity for haptic and short-term working memory, long-term memory, and prospective memory, beyond that of earlier homina or extant panins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.789,
    "end": 2715.761,
    "text": " Artifact diversity implies that, at times, Atriorectus could recognize not only the irreversibility of their respective chains of sequential manual reduction of stone, but also their correspondence to distinct morphological sets, which at least is comparable to second-order cognition that's understood implicitly by pre-verbal toddlers nowadays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.162,
    "end": 2745.671,
    "text": " While studying regional differences in the development of gray matter, which may be prolonged in temporal cortex, perhaps related to its role in integrating memory, object recognition, and audiovisual inputs, from the perspective of the free energy principle, these differences testify to structural priors that inherit from epigenetics and contextualize experience-dependent learning and planning as inference at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.343,
    "end": 2763.213,
    "text": " somatic time scale great and continuing with snakes and ladders also just to get it set as well the bf lct is bifacially flaked large cutting tools it's a type of tool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.318,
    "end": 2783.434,
    "text": " The circumstantial evidence seems to imply the adaptive evolution of human neurobiological propensities that support prospective memory in toolmaking, together with short-term working memory including haptic working memory, long-term working memory, and long-term procedural memory, and episodic memory of past matters and things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.639,
    "end": 2795.852,
    "text": " These propensities were and are phylogenetic outcomes of existential ontogenetic programs adapted through natural selection for satisfying the bioenergetic requirements of organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.264,
    "end": 2825.096,
    "text": " However, teaching and learning stone-napping skills are very different from a communicatively challenged H. erectus individual spontaneous enactment resulting in a disregarded BF-LCT outcome of iterative, inactive, haptic, lithic manipulations, regardless of any neurobiologically evolved cognitive neuronal propensity for such enactment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.057,
    "end": 2826.737,
    "text": "It's a huge claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.55,
    "end": 2855.787,
    "text": " getting and fashioning stone for subsequent use suggests awareness a potential albeit delayed advantages for lessening the efforts needed to acquire bioenergetic resources such behavior draws on short-term and long-term working memory episodic and procedural memory and prospective memory or forethought to a degree well beyond the capacity of living anthropoid apes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.834,
    "end": 2882.88,
    "text": " those are all the keys for snakes and ladders there's a strong relentless even focus on the moments of tool production the cognitive and extended cognitive phenomena associated with the performance of that act",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.446,
    "end": 2898.957,
    "text": " specifically with regard to hominids and with a focus on the bflct bifacially flaked large cutting tool of which the authors have extensive field expertise seeing in situ",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.998,
    "end": 2922.448,
    "text": " so snakes and ladders uses this fun board game metaphor to or reference to explain the sudden appearance and disappearance not by appeal to a cultural continuity mechanism tradition but rather the instantaneous a gentle zone of bounded surprise and action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.389,
    "end": 2956.908,
    "text": " Now, just before we get into copy or not to copy, what I think is, what we're trying to do here is hold up the fact that we believe that these, although each paper has been discretized to a particular topic, the continuity between the papers is what we'd really like to emphasize here because there are such strong strands",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.021,
    "end": 2966.065,
    "text": " or basically the shores are within such easy sight of one another that it's very nice to be able to kind of float back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.105,
    "end": 2980.933,
    "text": "We're going to now focus on the copy or not to copy piece of this, but to say that there isn't a way of being able to look at this as a continuity, I think we're trying to disrupt that right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.113,
    "end": 2986.896,
    "text": "So try to hold on as much of the snakes and ladder key points as you can as we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.785,
    "end": 2991.667,
    "text": " as we morph into this second perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.807,
    "end": 2994.108,
    "text": "It's perspective swap in 101.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.148,
    "end": 2999.851,
    "text": "Doesn't mean we're losing the details of either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.592,
    "end": 3003.172,
    "text": "Want me to start?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.632,
    "end": 3004.773,
    "text": "Oh, yeah, I'm uneven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.793,
    "end": 3005.813,
    "text": "You told me I had to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.873,
    "end": 3006.714,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3008.054,
    "end": 3015.878,
    "text": "Social learning theories about how information spreads do not explain how a seed of information is planted in each individual brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.502,
    "end": 3017.883,
    "text": " So we're back to the brain-based stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.803,
    "end": 3025.467,
    "text": "A useful lens is the free energy principle, which underpins a generative hierarchically mechanistic mind or HMM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.647,
    "end": 3033.911,
    "text": "Surprising or uncharacteristic sensory and physical states are precluded via a minimization of variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.231,
    "end": 3042.135,
    "text": "Interactions involve predictive processing and consequent perception action responses, active inference, yay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.978,
    "end": 3048.281,
    "text": " actively seeking predicted sensory exchanges with the world that minimize surprise or variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.043,
    "end": 3054.806,
    "text": "Fundamental involvement of learning minds is precisely the minds, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.826,
    "end": 3069.075,
    "text": "the brains, that are concerned in a mechanistic approach seeking to ascertain the minimum requirements, back to that threshold thing, for an innovation to nest, as it were, in one individual's brain before it can do so in another's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.256,
    "end": 3079.546,
    "text": " innovation and innovator are treated throughout in the context of habitual phenotypical behavior of a species from the perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.132,
    "end": 3101.482,
    "text": " a conspecific observer who witnesses novel or unorthodox behavior or its outcome, usually through but not necessarily, those that owe to activity performed by a conspecific but which, at the time of the observation, have not been adopted by other conspecifics in the group and therefore have not undergone social transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.162,
    "end": 3110.426,
    "text": "In many respects, the words are synonymous with invention and inventor, though these often connote post hoc,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.061,
    "end": 3111.662,
    "text": " recognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.963,
    "end": 3124.672,
    "text": "The imperative to maximize the expected information, curious behavior, responding to epistemic affordance resolves uncertainty and thereby reduces the long-term average of prediction errors in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.193,
    "end": 3137.844,
    "text": "However, this kind of innovative behavior is risky owing to its deviation from those phenotypical responses that selection is favored in a specific ecological niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.926,
    "end": 3147.61,
    "text": " when viewed from Charles Darwin's vantage point, of evolution by natural selection may be a far from advantageous trait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.23,
    "end": 3158.576,
    "text": "Deviations can have untoward consequences that even may threaten an innovator's very survival before reproductive age can be reached.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.436,
    "end": 3160.777,
    "text": "Oh, the risk reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.739,
    "end": 3166.6,
    "text": "Free hawk, post hawk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.123,
    "end": 3191.481,
    "text": " and that fine line that bridges the two continuing with copy or not to copy they write and also i will add dean has excellently visually differentiated in these slides innovative behavior can be regarded as a latent variable a plausible policy whose posterior probability must be inferred from a set of observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.469,
    "end": 3199.473,
    "text": " the family of probability densities entertained by an individual is restricted to the system's prior Bayesian beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.375,
    "end": 3209.6,
    "text": "It could be the case that a conspecific's innovative behavior will not fall neatly into one of these prior conceptions of a behavioral policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.38,
    "end": 3220.767,
    "text": "This means by definition that innovative behavior is both unlikely to be evinced in any given phenotype and crucially difficult to recognize when observed by another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.11,
    "end": 3225.152,
    "text": " was true for modern art, was true for the large tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.932,
    "end": 3233.416,
    "text": "Small deviations by innovators may be accommodated by observers who can take discrepancies into account by making minor adjustments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.596,
    "end": 3246.242,
    "text": "An innovator's behavior, should it diverge markedly from the repertoire of plausible policies used by an observer to predict another's behavior, may be beyond the capacity of the latter's generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.755,
    "end": 3257.661,
    "text": " A prerequisite of registering and encoding surprising sites may well be an ability to modify the generative model in order to accommodate sensory evidence that fails to meet top-down predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.462,
    "end": 3263.804,
    "text": " Brains might balance top-down expectations against bottom-up sensory evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.645,
    "end": 3274.991,
    "text": "The ability to do that dynamically and to conduct complex computations suggestive of high attentional executive control implies sensitivity to both previous experience and the current context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.691,
    "end": 3286.497,
    "text": "Perhaps the overriding of top-down predictions implies that those complex attentional and strategic components of working memory that distinguish humans from chimpanzees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.114,
    "end": 3301.087,
    "text": " Plausibly, familiarity by conspecific observers with the actions demonstrated in an experiment kept their surprise associated with the demonstrated actions within a manageable range, and this in turn prompted copying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.289,
    "end": 3307.254,
    "text": "And it's easier for chimpanzees to perform complex actions that are unorthodox",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.161,
    "end": 3320.591,
    "text": " Sorry, chimpanzees, it's easier for chimpanzees to perform complex actions that involve considerable motor demands than it is for them to reproduce actions that are unorthodox with regard to their habitual behavioral repertoire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.732,
    "end": 3330.781,
    "text": "Brains must shoulder an additional energetic cost whenever novel associated behavior responses are introduced that may override those already present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.534,
    "end": 3344.158,
    "text": " The acceptability of reproducing a novel artifact may owe at least as much to the ways in which broadly similar copies might be used with predictably accurate outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.959,
    "end": 3356.083,
    "text": "Again, big, serious disciplinary claims also with broad transdisciplinary and application consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.609,
    "end": 3389.803,
    "text": " By focusing attention less on the creative process of an invasion, more on the observers of it, this acceptance of the outcome underpins its intra- and intergenerational transmission, questions raise their head about just what materialistic phenomena are implicated, as opposed to psychocognitive and sociocognitive notions about mental developments during human evolution, and how and when they impinge on the HMM of our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.256,
    "end": 3400.019,
    "text": " neogene hominin precursors such that only in Pleistocene Homo was faithful copying become widespread and give rise to technological cumulative complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3400.099,
    "end": 3417.223,
    "text": "It's obligatory, therefore, to pay attention both to fundamental principles of biological science, with particular reference to neurobiology, and to the evolution of bi-natural selection of species of the genus Homo with particular reference to their brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.864,
    "end": 3418.984,
    "text": "I added a smiley face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.549,
    "end": 3432.502,
    "text": " Narrowing the range of adult behavior open to him may be protracted corticogenesis evolved in Homo only around 0.5 MA during the middle Pleistocene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.523,
    "end": 3441.612,
    "text": "In adolescence nowadays, co-activity between prefrontal and caudal cortices underlies agile working memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.203,
    "end": 3459.55,
    "text": " From the perspective of the FEP, these differences near anatomical testify to structural priors probably established through neuroepigenetic evolution, which contextualized experience-dependent learning and planning as inference at a somatic timescale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.11,
    "end": 3472.795,
    "text": "It's relevant that the interplay between working memory load and associated reinforcement learning affects prediction errors via parietal and dopaminergetic striatial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.008,
    "end": 3488.4,
    "text": " neuronal circuits involving algorithmic-like effects mediated by loops with basal ganglia with likely impingement also of episodic and procedural long-term memory input or medial temporal hippocampal cortices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3489.946,
    "end": 3491.167,
    "text": " You can read the middle section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.627,
    "end": 3502.855,
    "text": "When considering early pleistocene behavior, we need not assume that relationships between different kinds of memory were less complex psychocognitively than ours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.376,
    "end": 3513.243,
    "text": "It is prosaically sufficient to infer that they were simply less frequent owing to earlier consolidation of cerebral networks in homo erectus smaller brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3513.363,
    "end": 3515.544,
    "text": "That's being restated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.604,
    "end": 3519.047,
    "text": "We already talked about it earlier in our introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.168,
    "end": 3542.593,
    "text": " Yes, it reflects many of the so-called biological attributes that archaeologists study in terms of cranial volume and developmental trajectories and reaches towards some of those more ineffable or at least unrecorded cognitive phenotypes like working memory, ability to integrate diverse stimuli, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.534,
    "end": 3544.974,
    "text": "More on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.581,
    "end": 3554.946,
    "text": " Homo erectus observers' brains may have lacked neuronal networks efficient enough for enabling them to develop innovative behavioral responses in the early Pleistocene that were habit forming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.026,
    "end": 3560.269,
    "text": "A zone of bounded surprise, well, here and after ZBS, restricted them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.906,
    "end": 3578.875,
    "text": " Possibly, observations by early homo erectus were translated often into activity intermediate between emulation and imitation, owing to limited foresight about the significance of precise manipulations for determining the practicality and effectiveness of an outcome dimly envisaged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.996,
    "end": 3586.28,
    "text": "Their ZBS limited their ability to join up the mental steps involved in planning and to infer counterfactual possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.241,
    "end": 3590.402,
    "text": "That is a fundamental aspect of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.052,
    "end": 3617.086,
    "text": " selection of actions and plans is based on minimizing the free energy to be anticipated in undertaking them minimizing effort and also extremely interestingly as we explored in livestream 52 with lance da costa free energy is not the only discrepancy measure and one that was mentioned was the earth movers distance so it's interesting to think about active inference with the earth movers distance if you are actually moving earth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.235,
    "end": 3626.802,
    "text": " Zones of bounded surprisal, ZBS, are different from the zones of latent solutions, ZLS, proposed by Tenney et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.902,
    "end": 3637.612,
    "text": "in 2009 in their attempt to explain the lack of cumulative culture in great apes on the basis that cultural complexity is restricted by the limited potentials for individual intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.031,
    "end": 3649.972,
    "text": " Zones of bounded surprisal are separated by varying degrees of surprisal from the species' prototypical behavioral repertoire and could therefore resist the gravitational pull of the ZLS.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.513,
    "end": 3657.315,
    "text": " The focus of the ZBS concept is on the observers and their ability to make sense of an observed innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.076,
    "end": 3671.121,
    "text": "Encoding and subsequent copying of an innovation depends on the degree of disparity or surprisal between predictable behaviors, which are those typical of the species, and the perceptual incoming information about novel behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.278,
    "end": 3683.523,
    "text": " The ZBS allows any potentially novel or unorthodox behavior to be copied provided that the ranges or levels of surprisal provoked in observers are tolerated or manageable by them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.403,
    "end": 3688.725,
    "text": "The ZBS is constrained by the capacity of a species' cerebral neuronal network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.645,
    "end": 3707.944,
    "text": " as opposed to potentially a sociocultural explanation which might argue that the continuity or pattern overall of a tool's appearance would be rather constrained by the capacity of a social group's transmission capacity it's a yes and they're proposing a different tack",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.71,
    "end": 3715.995,
    "text": " ZBS focuses on the observer of an innovation and hence ZLS and ZBS can be useful complimentary concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.776,
    "end": 3719.798,
    "text": "I think we checked, but we never went below min two in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.619,
    "end": 3725.943,
    "text": "Properties of mirror neuron circuitry are necessary prerequisites for imitative copying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.196,
    "end": 3733.159,
    "text": " The left side of our brain contains neurons with canonical properties involved in tool use, and perhaps understanding it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.0,
    "end": 3740.083,
    "text": "The matter of understanding raises unavoidable awkward epistemological problems of merology, however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.583,
    "end": 3742.484,
    "text": "Merology is about parts and wholes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.466,
    "end": 3746.647,
    "text": "The cardinal and the ordinal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.329,
    "end": 3750.849,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.609,
    "end": 3756.612,
    "text": "Chimpanzees resemble macaques, and they differ from them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.079,
    "end": 3770.029,
    "text": " in sharing with humans coincident prefrontal somatotopic responses to transitive behavior, intransitive observation and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.73,
    "end": 3780.479,
    "text": "Humans differ from both in that arcuate, I was trying to practice this before we came on live and I still tripped, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.091,
    "end": 3792.015,
    "text": " Arcuate fasciculous white matter has undergone evolutionary modification affecting temporal lobe connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.916,
    "end": 3795.737,
    "text": "Learned behavior involves long-term working memory and procedural memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.457,
    "end": 3800.759,
    "text": "Conscious modification of learned behavioral patterns reasonably permits distinguishing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.417,
    "end": 3804.6,
    "text": " long-term working memory from short-term attentional working memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3805.261,
    "end": 3813.488,
    "text": "Even though most long-term memory is implicit and non-declarative, the boundary between explicit and implicit memory is porous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.15,
    "end": 3816.291,
    "text": "It's a broken line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.032,
    "end": 3820.775,
    "text": "Still blacks imply fact for propositional perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.616,
    "end": 3827.121,
    "text": "Individual train sequences change to a greater extent earlier in learning and stabilize later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3829.226,
    "end": 3834.851,
    "text": " Patterns of neuronal activity became increasingly distinct for trained sequences carried out at full speed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.871,
    "end": 3857.029,
    "text": "The selective importance of particular neuronal groups and included striatal activation comparing the motor sequences when carried out at different speeds permitted an analysis of the observation that areas of motor and sensory motor cortices show relatively slight changes in patterns of neuronal activity that are specific for particular sequences following training.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.898,
    "end": 3880.033,
    "text": " plausibly on account of the slow speed at which participants previously have been paced during training, hence defining that patterns of sequence-specific activation are strongest when performing at greatest speed implies that investigating fine-grained patterns of activity requires participants to cope with a strong manual challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3880.554,
    "end": 3886.498,
    "text": "Activation is bilateral because fashioning stone requires precise and accurate monitoring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.256,
    "end": 3891.917,
    "text": " in an organized forward sequence of perception action with feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3892.658,
    "end": 3895.118,
    "text": "Homo erectus brains had an appropriate working memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.539,
    "end": 3911.544,
    "text": "Moreover, they had to have a hierarchically organized neurocognitive capacity to generate in an observer the combinatorial ability needed for there to be any acceptably accurate copying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.324,
    "end": 3916.145,
    "text": "The stone undergoing artifactual modification as envisaged",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.04,
    "end": 3931.736,
    "text": " outcome that is abstracted and understood implicitly by both parties albeit invisible explicitly during the materializing through shaping process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.777,
    "end": 3938.344,
    "text": "Such abstraction severely challenges innate homeostatic drives in naive observers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.253,
    "end": 3963.508,
    "text": " Rebral neuroimaging of students learning to NAP chopping tools via those learning to NAP BFLCTS suggests significant distinctions in their respective judgments concerning the physical accuracy of predicted outcomes versus strategical appropriateness in preparing the intended tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.268,
    "end": 3970.914,
    "text": "It is as if the two groups were trying out different cognitive strategies differently during their respective apprenticeships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.928,
    "end": 3983.875,
    "text": " Accurately repeated preparations of BFLCTS evolved hand-in-hand with preferential natural selection of a propensity for developments in haptic working memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.515,
    "end": 3993.482,
    "text": "It must not be forgotten, of course, that working memory can also be an external physical resource that facilitates copying e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.762,
    "end": 3994.862,
    "text": "handbooks of instructions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.723,
    "end": 4000.167,
    "text": " YouTube demonstrations, or physical models available for copying, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.227,
    "end": 4004.65,
    "text": "models in an artist's studio or stone artifacts visible to Paleolithic observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.471,
    "end": 4010.475,
    "text": "As argued elsewhere, working memory is a complex, multidimensional concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.977,
    "end": 4013.878,
    "text": "You can take the last part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.379,
    "end": 4025.227,
    "text": "Evolution by natural selection is inherently conservative, and emergent neural representations exploited by lone individuals need not have been shared automatically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.913,
    "end": 4041.244,
    "text": " by other minds and groups of largely inarticulate homeorectus whose adaptive priors guided their action perception cycles towards adaptive unsurprising states by way of minimizing variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.304,
    "end": 4053.813,
    "text": "Those priors could involve neuroepigenetically controlled expressions of genes implicated in those cerebral neuronal developments that prioritize routine expectations and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.192,
    "end": 4063.858,
    "text": " consolidate habitual behavior to the detriment of recognizing the epistemic affordances that underwrite curiosity and surprising novelty-seeking behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.938,
    "end": 4078.608,
    "text": "In consequence, some infrequently found technological aspects of early Pleistocene innovative behaviors may well have been isolated instances until such times active inference brought about modification of adaptive priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.953,
    "end": 4091.586,
    "text": " thereby permitting acceptance and adoption by observers of unorthodox behavior that had failed to provide adaptive advantage hitherto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.99,
    "end": 4099.275,
    "text": "So much to unpack with what active inference allows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.796,
    "end": 4101.037,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.816,
    "end": 4129.486,
    "text": " so that is where our discussion of the key rings of the two papers ends just as a reminder the more extensive quotes are great resources to see in the final versions of the paper and so on and in the following couple of slides we wanted to bring in a few other directions a sampling of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.916,
    "end": 4135.439,
    "text": " extra resources that Dean and I were looking through in our dot zero preparation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4136.379,
    "end": 4140.762,
    "text": "And do you have any comments on this before I describe this side by side?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.863,
    "end": 4147.246,
    "text": "Yeah, I think it's good that you show the two representations on the right side of the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.586,
    "end": 4158.953,
    "text": "I think oftentimes we think of things of interstate as, you know, here are the two train tracks and they are in perfect parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.659,
    "end": 4169.807,
    "text": " What I also think often happens is the shortest distance between two points from formalism aspect is a straight line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.988,
    "end": 4180.475,
    "text": "But when what we're talking about is generative models, we're talking about two kinds of time, one that's continuous and one that's discrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.116,
    "end": 4189.422,
    "text": "And our ability to uptake something may be afforded when we meander slightly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.833,
    "end": 4202.317,
    "text": " So the representation on the left isn't to remove the idea of the barbell or to impose on the model that it has to be direct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4203.598,
    "end": 4209.58,
    "text": "Sometimes getting to the answer comes about in kind of strange and wonderful ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.28,
    "end": 4212.121,
    "text": "Sometimes things happen suddenly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4214.537,
    "end": 4215.558,
    "text": " because we meander.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.858,
    "end": 4225.768,
    "text": "So I'll turn over the actual diagram now to you and be able to talk about a little bit about that in terms of how we shape that in terms of discrete and continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.289,
    "end": 4227.609,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.69,
    "end": 4237.379,
    "text": "Well, this is figure 4.3 from Parr, Pizzulo, and Friston's 2022 Active Inference Textbook that we have textbook groups at the Institute around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.24,
    "end": 4238.36,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.383,
    "end": 4256.848,
    "text": " Two different taxonomic groups, maybe generative modelis erectus and generative modelis habilis or something like that, are juxtaposed in a way that highlights their structural similarity, but also calls attention to some of their details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.608,
    "end": 4261.329,
    "text": "On the top is a partially observable Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.809,
    "end": 4265.65,
    "text": "And this is a discrete time representation of a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.318,
    "end": 4275.886,
    "text": " The hidden states are evolving through time, and there's a past, present, and future, which are indexed with temporal markers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.426,
    "end": 4279.449,
    "text": "Time minus one, time right now, time plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.569,
    "end": 4282.411,
    "text": "And at each time, there's the emission of observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.491,
    "end": 4283.833,
    "text": "That's the tale of two densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.253,
    "end": 4291.8,
    "text": "It can emit generative AI densities from hidden states, or it can learn hidden states from observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.12,
    "end": 4293.001,
    "text": "That's the A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.181,
    "end": 4293.881,
    "text": "D is the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.662,
    "end": 4318.794,
    "text": " b describes how those hidden states change through time and g shapes policy selection through expected free energy that intervenes in how hidden states change through time and more briefly in the continuous time generative model rather than explicit representation of past present and future the approach taken is much more resonant with generalized coordinates of motion or a taylor series expansion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.75,
    "end": 4346.498,
    "text": " in which all past present and future time points are implicitly predicted through the specification of the derivatives of increasingly high order around the target variable latent state x there's a lot more to say but when i saw dean bring in the straight and the wavy and the kind of meta train track that together they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.597,
    "end": 4354.021,
    "text": " enabled seeing, I thought 4.3, that's where we want it to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.062,
    "end": 4356.683,
    "text": "And here's the interesting thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.764,
    "end": 4374.055,
    "text": "Even in that representation, if you were to suddenly realize that you liked the relaxing, meandering route, that you're not always in a hurry, you would probably have a better chance of realizing that in continuous time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.708,
    "end": 4384.954,
    "text": " The suddenness would occur as you stretched your window of analysis out, which again seems counterintuitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.295,
    "end": 4390.138,
    "text": "But that's what the representation affirms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.998,
    "end": 4394.04,
    "text": "And one last note on this before you introduce the next one is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.865,
    "end": 4403.869,
    "text": " In this figure 4.3, we see a crystallization of methodological pluralism in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.529,
    "end": 4411.413,
    "text": "So all questions of the form, how does active inference treat X phenomena, even for a specified subsystem,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.173,
    "end": 4416.196,
    "text": " There's no a priori reason to favor the left or the right foot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.796,
    "end": 4419.979,
    "text": "We want the barbell loaded on both sides before we bench press it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.639,
    "end": 4435.089,
    "text": "And so even the decision of the time window and the treatment of time, which is one of the most absolutely fundamental decisions in a model, let alone further structural learning questions, which were mentioned earlier in the quotations, is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.17,
    "end": 4463.782,
    "text": " even at that most fundamental divergence between discrete and continuous time generative models the active inference absolutely has a decision so what do you um see here and what do we want to bring in yeah no this is this was uh ryan smith's paper and what i what i what i like about this is he broke it down into decision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.77,
    "end": 4484.324,
    "text": " active inference just to, if you want to go back and have a look at that live stream set, um, what he was trying to speak to there was that a lot of stuff that's going on in folk psychology doesn't contradict what we now kind of understand in terms of how we can model things out using active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.564,
    "end": 4493.15,
    "text": "And again, you can, you can explain the diagram better than I can, but I think what's interesting here is, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.94,
    "end": 4504.504,
    "text": " To decide, to make a choice, to copy or not to copy, to throw a stone or not to throw a stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.745,
    "end": 4515.09,
    "text": "There's two slides here that we kind of have to kind of pull together again for what I wanted to focus on, which is on the next slide next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.11,
    "end": 4521.393,
    "text": "But here, what I want to do is kind of talk about this paragraph on the bottom left-hand side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.385,
    "end": 4526.767,
    "text": " You have a paper about sensory attenuation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.867,
    "end": 4528.487,
    "text": "What do we pay attention to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.507,
    "end": 4540.272,
    "text": "As an outcome desensitization, this only becomes problematic when contingencies in the environment, when the environment changes over time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.292,
    "end": 4545.075,
    "text": "So we are talking about things that agents do in time and in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.475,
    "end": 4552.698,
    "text": "But what this paper was talking about was sort of the folk psychological and some of those stories that we've used to try to explain things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.274,
    "end": 4556.617,
    "text": " and focuses on what's going on in the envelope, what's going on in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.018,
    "end": 4567.426,
    "text": "This highlights an important distinction between this type of habit formation and other mechanisms promoting habit-like patterns of behavior in decision active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.866,
    "end": 4573.871,
    "text": "For example, actions can also become resistant to change after repeated experience because agents build up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.298,
    "end": 4578.28,
    "text": " highly confident beliefs about the reward probabilities under each action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.901,
    "end": 4588.947,
    "text": "If contingencies change, it could take a very large number of trials for agents to unlearn such beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.967,
    "end": 4595.871,
    "text": "So I wanted to throw this in as a compliment to the habitization step that was in the copied or not to copy paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.492,
    "end": 4598.193,
    "text": "Do you want to explain the diagram real quick?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4599.198,
    "end": 4619.438,
    "text": " my only comment there is with respect to ali's question about copy discard the shadow of to copy or not to copy is to discard or not to discard because if people have been hitting their rocks one way and somebody else even if the functional mirror neurons allow one to understand that one is doing it differently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.247,
    "end": 4632.702,
    "text": " There's a whole variety of things that can happen and not all of them involve the successful contagion of even an resolutely positive improvement on tool use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.263,
    "end": 4639.29,
    "text": "And especially with complex trade-off frontiers and partially obscured views and all these other social complexities,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.231,
    "end": 4653.458,
    "text": " that is going to mean that to copy or not to copy, to discard or not to discard, copy-discard becomes a central piece in compositional accounts of surprise minimization under the hierarchically mechanistic minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.919,
    "end": 4665.964,
    "text": "So on this slide, which was just a continuation of that live stream set for DEC, I'm going to drop down to the fourth paragraph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.124,
    "end": 4669.126,
    "text": "If the highest value in an outcome space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.878,
    "end": 4690.516,
    "text": " was specified for observing tasting ice cream in the policy and the policy space included either choose don't move or choose walk to the ice cream truck and buy ice cream, a deciding active agent, active inference agent will infer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.121,
    "end": 4695.224,
    "text": " that walking to the ice cream truck and buying ice cream is the highest probability policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.264,
    "end": 4698.507,
    "text": "That is, it will form the intention to go buy ice cream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.547,
    "end": 4713.238,
    "text": "In addition, when considering the range of cases involving goal-directed choice, we have been unsuccessful at identifying examples where the policy would play a role inconsistent with representing desired outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.618,
    "end": 4714.839,
    "text": "Now, here's an interesting thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.919,
    "end": 4720.343,
    "text": "Even back then, if you look at the ice cream cone and you ask it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.462,
    "end": 4734.846,
    "text": " to the third person now, Daniel and Dean, looking at the slide, is the ice cream truck closer to us as we're viewing this or further away from us than the actual ice cream cone is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.266,
    "end": 4736.486,
    "text": "You get one sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4737.106,
    "end": 4744.388,
    "text": "And then if I grab this line, at first it appears that the ice cream cone truck is closer to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.448,
    "end": 4750.81,
    "text": "If I do this, however, and I grab this line, just like that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.605,
    "end": 4755.726,
    "text": " pull that away, now all of a sudden what's in the foreground?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.046,
    "end": 4756.926,
    "text": "The ice cream cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.847,
    "end": 4768.33,
    "text": "So oftentimes when we're trying to figure out what we desire or what our goal is, we're completely unaware of how we're setting up our own frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.77,
    "end": 4782.315,
    "text": "What rule we're actually following, if we have a rule, we're completely unaware of it, and yet that has a huge decision implication on what's the desired",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.268,
    "end": 4812.715,
    "text": " foreground background here is it you know how how are we coming about to this idea that this this one this one shape which we're going to have to arrive at by removing things is more advantageous than just leaving it the way it is so just to have one perspective on something unidirectional versus to be able to have those two perspectives on something so again this was in comparison to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.314,
    "end": 4823.779,
    "text": " a folk psychology narrative of telling how we might come to behaving versus the act of inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.76,
    "end": 4832.323,
    "text": "What Ryan wanted to do in his paper was say, they're not fighting with one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4833.144,
    "end": 4840.187,
    "text": "And oftentimes, if you actually understand that, you've made a lot of choices that you're not even aware of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.745,
    "end": 4849.171,
    "text": " that your generative model sometimes is a reduction to some rules that you may or may not even be able to articulate, and that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4851.093,
    "end": 4855.436,
    "text": "Yes, it will influence what you do present as an articulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.977,
    "end": 4865.864,
    "text": "It doesn't change what we now understand as the mechanisms that are present, and that may help us in terms of some of that predictive process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.786,
    "end": 4869.087,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.154,
    "end": 4872.935,
    "text": " Livestream 46, way back when.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.335,
    "end": 4877.556,
    "text": "All right, just a few more pieces to bring into the puzzle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.077,
    "end": 4884.839,
    "text": "So I'll give the first description on each of them, and then Dean, feel free to kind of bring in why you wanted these to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.439,
    "end": 4887.66,
    "text": "So here's a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.9,
    "end": 4902.121,
    "text": " variational synthesis of evolutionary and developmental dynamics which was written with friston myself constance knight parr and campbell we recently uploaded it to archive and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.467,
    "end": 4925.557,
    "text": " One of the main novelties or contributions of this paper was, in contrast with previous multi-scale biologically oriented active inference or FEP models, which used the formalism of nested POMDPs to model nested Markov blankets, thus creating one bigger and bigger tree with finer and finer leaves,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.775,
    "end": 4948.286,
    "text": " we used a explicit discontinuous multi-scale or scale-friendly jump such that within the lifetime, the intra-generational action perception loops and also developmental loops that we heard about in some selections from the papers today, that that particular partition, that thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.893,
    "end": 4973.869,
    "text": " over the course of its life in an ecologically embodied way can have bottom-up causation to this higher order thing which is a population thing and this higher order extended genotypic thing also uses the exact same particular partition mathematics and framing that we see across systems in ACT-INF",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.79,
    "end": 5002.038,
    "text": " and another way to look at that is here in the center is one thing with a blue ring going around it at a given level and it is itself composed of these smaller things which also are composed of even smaller things and also that main blue ring is playing a role in potentially a larger thing and this is the scale friendliness or the scale freeness of the fep formalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.157,
    "end": 5026.236,
    "text": " discussed in an ontogenetic phylogenetic setting within amongst generations and rather than utilizing this graft bigger and bigger pomdps strategy we introduce an explicit discontinuity in that things at a lower level are sampled or instantiated from a higher level distributional thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.177,
    "end": 5039.606,
    "text": " and the differential success of those within-generation trajectories can result in bottom-up causation, modifying the extended genotypic thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.406,
    "end": 5046.19,
    "text": "I hope that we'll have more sessions to talk more about this paper and related work, but just wanted to give that quick overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.431,
    "end": 5051.874,
    "text": "And I don't have a lot of deep background in biology, so the reason why I want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.631,
    "end": 5062.435,
    "text": " I was hoping that you would be interested in at least touching on this is because I think again, we're back to, so which have we chosen to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.455,
    "end": 5072.119,
    "text": "Have we chosen to zoom in on the scale friendly or have we just zoom in on the scale friendly or zoom out onto the scale free?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.759,
    "end": 5081.263,
    "text": "And I think we get a better understanding when we're able to appreciate the differences and put them back together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.829,
    "end": 5083.55,
    "text": " in our sort of our own model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.793,
    "end": 5088.654,
    "text": "Great, on to the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.715,
    "end": 5105.706,
    "text": "Here is a paper with Sean O'Connor who led this effort and myself from the end of 2022, Predictive Processing Interpretation of the Mirror Test and Implications of a Reflection Prediction for Human Cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.326,
    "end": 5108.268,
    "text": "And just to read one sentence from the abstract,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.068,
    "end": 5125.681,
    "text": " we hypothesize that a reflection prediction upon which our predictive processing interpretation of the mirror test is built may also offer a novel perspective to understand how humans locate themselves relative to a mirror, imitate others, and are self-aware from a social perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.301,
    "end": 5131.705,
    "text": "So what have you seen in that mirror mirror on the screen and why did you want it here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5133.887,
    "end": 5136.629,
    "text": "Because I think the sensory, first of all,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.196,
    "end": 5149.504,
    "text": " I strongly recommend people get this paper and read it because I thought it was an excellent paper and it should become part of more people's reading lists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.684,
    "end": 5166.094,
    "text": "One of the things that it really speaks to very clearly and makes a strong case around is the role of sensory attenuation and bringing the concept of sensory attenuation into the world of predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.816,
    "end": 5191.427,
    "text": " And I think it would be something that would be helpful for people to understand, especially if you're thinking that, for example, and I don't forget, Danny, you'll know what this is, but there was one of the things that was talked about in this paper was the idea that if you believe you do not have a limb, that one of the things that you could do is come up with a way of a mirror showing you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.361,
    "end": 5195.703,
    "text": " without that limb, even if you already possessed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.803,
    "end": 5214.332,
    "text": "So it's reinforcing what Hector and Michael and Carl were talking about in terms of, so how does active inference help us get to maybe some more plausible answers in prosaic ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.992,
    "end": 5220.755,
    "text": "And so the sensory attenuation piece to me was really valuable and tied in with some of the concepts we're talking about here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5221.84,
    "end": 5232.03,
    "text": " Yeah, one thought on that is let's grant an effective mirror neuron or recognition capacity just spatially in terms of tool usage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5232.33,
    "end": 5238.376,
    "text": "So that is not always granted with eyesight and partial occlusion of the working locations of tools and all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5238.457,
    "end": 5243.341,
    "text": "But let's just say that an observer can observe somebody else doing a motor behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5244.222,
    "end": 5247.924,
    "text": " and entirely understands the basis of that motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.284,
    "end": 5252.666,
    "text": "Like the person does a pirouette, or they write a line in cursive, or they play violin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.186,
    "end": 5260.09,
    "text": "You can have absolute understanding of the mechanisms of the baseball pitcher, of the hockey stick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.31,
    "end": 5268.774,
    "text": "Yet, there are multiple reasons from an embodied and cognitive perspective why the behavior cannot be copied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.605,
    "end": 5279.251,
    "text": " We can all understand that there are certain sport acts that are not just strength limited and they're not even necessarily dexterity limited that we cannot do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.651,
    "end": 5285.014,
    "text": "We cannot write in a language we do not know by hand, even though we might have the motor dexterity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.295,
    "end": 5287.836,
    "text": "And so that's a semantic explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.436,
    "end": 5295.981,
    "text": "Or quite simply, and to call back the zone of bounded surprisal, an observer may observe something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5297.345,
    "end": 5323.016,
    "text": " heteropraxis a different praxis and simply implicitly or even explicitly believe that's unlikely for me to do and as it was thought so it shall be done the innovation is over yeah and then lastly in a little bit um most extrapolatively previously in some work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.924,
    "end": 5349.311,
    "text": " uh I've juxtaposed Buckminster Fuller's life and work in times with that of William Blake and the prompting quote from the paper was above zones of bounded surprise are different from the zones of latent solution in their attempt to explain the lack of cumulative culture in great apes on the basis that cultural complexity is restricted by the limited potentials for individual invention so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.834,
    "end": 5355.658,
    "text": " Bucky and Blake were both tremendously inventive individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.559,
    "end": 5371.753,
    "text": "And to reflect a few lines of some Blake poetry, The Auguries of Innocence begins with, To see a world in a grain of sand and a heaven in a wildflower, hold infinity in the palm of your hand and eternity in an hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.513,
    "end": 5376.717,
    "text": "Those are some of the famous opening lines of that poem, and they speak to this time period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.957,
    "end": 5406.151,
    "text": " representation but the closing lines are less often quoted when we we are led to believe a lie when we see not through the eye which was born in a night to perish in a night when the soul slept in beams of light god appears and god is light to those poor souls who dwell in night but does a human form display to those who dwell in realms of day and i'll let you get the word on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.625,
    "end": 5408.686,
    "text": " Well, here's the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.986,
    "end": 5431.46,
    "text": "I want to thank again the authors who are going to be joining us for the dot one and dot two for allowing us to pull two of their papers into proximity and allow us to talk about them so proximally because we, I think I speak for both of us, but you can correct me on this, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5431.92,
    "end": 5436.763,
    "text": "I think with the use of active inference and our continuous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.159,
    "end": 5462.743,
    "text": " that are continuous updating with active inference as a way of strategizing are coming to realize that sometimes things that seem really distal and unrelated when brought together, you as the person who's looking at two things at once with both of your eyes open tend to learn a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5463.556,
    "end": 5479.086,
    "text": " And so whether it's pulling Buckminster Fuller and Blake into the same slide deck or talking about to copy or not to copy and snakes and ladders, it's actually a real treat to be able to bring things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.571,
    "end": 5485.892,
    "text": " that seemed like, well, that, you know, conventionally, that was field work, and this is lab work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5486.452,
    "end": 5503.636,
    "text": "Being able to have one foot in both of those realms really helps the person who likes to go back and forth, who is moving from a position of being really familiar with a subject matter to being somebody who can actually get into the predictive matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.363,
    "end": 5509.644,
    "text": " because they're more comfortable in doing the update thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.624,
    "end": 5512.505,
    "text": "They're not quite so stuck and bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5514.205,
    "end": 5521.167,
    "text": "And that means when I see ZLS and ZBS beside one another, it makes me very, very happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.708,
    "end": 5535.612,
    "text": "So that's why I wanted you to get acknowledged for some of the work that you've done in terms of this isn't the first time that you've seen an advantage in bringing two things that don't seem like they,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.403,
    "end": 5554.024,
    "text": " belong on the same table and bringing them together and kind of going whoa look what happens when you do great thanks any final comments or i'll give a final thought go for it all right well i would just like to echo uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5555.305,
    "end": 5582.081,
    "text": " your words we really appreciated even dare i say working with the authors in this dot zero and even negative dot one the first of its kind interval these papers initially to me at least felt like two pillowy beds of plain text",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5583.376,
    "end": 5610.076,
    "text": " can't think of any other way to say it right now however once we dug at that field site and we brushed off some of those uni and bifacial tools and ideas there was just more and more to find and explore so I'm very much looking forward to the coming dot one dot two and potentially Beyond and we hope you've enjoyed this 53.0",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.22,
    "end": 5613.764,
    "text": " Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.146,
    "end": 5614.388,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.71,
    "end": 5615.214,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.576,
    "end": 5615.838,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  }
]