[
  {
    "start": 7.473,
    "end": 29.177,
    "text": " hello and welcome it's november 11 2024 we're in active inference guest stream number 92.1 with max eifer we're going to be discussing a variety of thermodynamic and bayesian topics it should be very exciting if you're watching live feel free to write any questions in the live chat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.157,
    "end": 35.146,
    "text": " Max will go through some sections of several papers and I will read questions and ask questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.186,
    "end": 37.449,
    "text": "So thank you, Max, for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.99,
    "end": 40.173,
    "text": "Looking forward to hearing about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.534,
    "end": 40.975,
    "text": "Take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.036,
    "end": 42.297,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.637,
    "end": 44.84,
    "text": "Yeah, thank you for the introduction and thanks for having me on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.141,
    "end": 47.084,
    "text": "Really excited to talk about this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.945,
    "end": 49.708,
    "text": "So there are a few papers I want to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.728,
    "end": 56.458,
    "text": "One called Thermodynamic Linear Algebra about kind of a novel hardware approach to solving linear algebra problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.898,
    "end": 58.641,
    "text": "Another one called Thermodynamic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.621,
    "end": 66.558,
    "text": " Bayesian inference, which is similarly about using these new thermodynamic hardware devices for Bayesian inference problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.742,
    "end": 75.837,
    "text": "But before I get into that, I just wanted to make a note on kind of like the story of this work and how it evolved, because I think it's pretty interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.817,
    "end": 99.748,
    "text": " um so i'm working at a company a startup called normal computing and where we started off was just thinking about what's kind of the best hardware paradigm for for ai and especially probabilistic machine learning because these are some of the most challenging tasks computationally and seen as some of the most necessary to be able to do kind of robust um ai without you know hallucinations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.728,
    "end": 102.798,
    "text": " And a big approach to that is probabilistic machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.259,
    "end": 112.81,
    "text": "And a lot of our approach was inspired by this report that came out of a workshop in 2019 called Thermodynamic Computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.583,
    "end": 138.274,
    "text": " and i'm sharing it uh can you see my my screen here what i'm sharing okay yeah so there's this one quote here in the introduction that i think really summarized the point it says somewhat paradoxically while avoiding stochasticity and hardware we are generating it in software for various machine learning techniques at substantial computational and energetic cost so one of the big kind of takeaways from the work they did in this um this workshop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.254,
    "end": 146.948,
    "text": " was there was kind of a consensus that emerged that we're working so hard to suppress the randomness that comes up naturally in our hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.308,
    "end": 154.68,
    "text": "And then we need randomness actually to run various randomized algorithms, especially in probabilistic machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.141,
    "end": 159.047,
    "text": "And so if there were some way to just use the randomness that's naturally there,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.027,
    "end": 165.681,
    "text": " that we know about due to thermodynamics to achieve those algorithmic goals, maybe we would save a lot of energy, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.701,
    "end": 169.71,
    "text": "So that was kind of one of the ideas we were inspired by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.374,
    "end": 174.741,
    "text": "But the first step along this journey was,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.666,
    "end": 182.935,
    "text": " So there was an earlier paper where we basically proposed circuits that are capable of sampling from a normal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.496,
    "end": 186.54,
    "text": "And I'll get more into the math of why that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.821,
    "end": 191.366,
    "text": "Why do circuits that look like this allow you to sample from a multivariate Gaussian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.508,
    "end": 199.237,
    "text": "So this was kind of the first work that was published at Normal, actually before I started working there, called Thermodynamic AI and the Fluctuation Frontier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.757,
    "end": 205.605,
    "text": "But how you can think of this is this is the electronic analog of a system of coupled harmonic oscillators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.585,
    "end": 218.282,
    "text": " So if you can just think about a bunch of masses that are coupled together by springs and that are also damped, so they have friction acting on them, and there's also noise acting on them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.682,
    "end": 223.569,
    "text": "So kind of damped system of harmonic oscillators driven by noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.829,
    "end": 226.753,
    "text": "That's the kind of system that we're talking about in these works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.374,
    "end": 231.88,
    "text": "And we're just kind of looking at this electronic analog, which is completely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.86,
    "end": 259.369,
    "text": " uh analogous completely isomorphic to that that picture uh in terms of masses on springs um so one of the first problems we were interested in solving was solving the linear system of equations so you can think of this as if i have a few planes in an n-dimensional space here i have three planes in a three-dimensional space um and in general i'll have n planes in an n-dimensional space and i want to find the one point where they all intersect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.349,
    "end": 261.372,
    "text": " assuming that there is such a point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.913,
    "end": 285.508,
    "text": "And you can think of that mathematically as I'm giving a matrix A and a vector B, and I want to find the point X that satisfies this equation, AX equals B. So solving this kind of problem has tons of applications in economics, engineering, but also in AI for training neural networks more efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.488,
    "end": 289.693,
    "text": " you know, if you can solve linear systems quickly, then there's benefits to training, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.174,
    "end": 293.358,
    "text": "So that's one of the first problems that we decided to look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.759,
    "end": 307.395,
    "text": "And well, so I think that it's interesting to compare our approach with earlier approaches to analog computing, basically, because it's something that people have actually tried to do for quite a while is build analog computers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.435,
    "end": 312.441,
    "text": "In other words, where the signals are not stored as binary numbers, ones and zeros,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.421,
    "end": 341.618,
    "text": " but can take values in between and so you're kind of using the capacity of the hardware to represent more precise numbers than just a one and zero and in theory that seems to make sense but the big problem that analog computing ran into is is basically that there's a lot of noise that's present and noise and imprecision kind of prevents you from answering from solving these problems like like linear systems of equations uh with the accuracy that you that is needed uh by the application",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.598,
    "end": 364.409,
    "text": " So I guess the big insight of this work in this thermodynamic linear algebra paper is that if you model the noise, if you understand the noise in your system well enough and you model that noise, then you can actually predict the behavior of the system on the distribution level, even if the system is unpredictable on the trajectory level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.01,
    "end": 371.318,
    "text": "And the way we describe that, modeling the noise, is using what's called a stochastic differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.298,
    "end": 388.12,
    "text": " So equation 2 here I've written is a stochastic differential equation where I'm saying that dx, the change in the state of the system, which is really a collection of voltages on capacitors in the circuit, the way it changes in time has two components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.16,
    "end": 391.925,
    "text": "The first is this term, which is called the drift term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.945,
    "end": 395.509,
    "text": "And you can think of that as the predictable part of the change in the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.95,
    "end": 399.094,
    "text": "And it's the gradient of this quadratic function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.074,
    "end": 402.077,
    "text": " And then the second term is the noise term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.397,
    "end": 405.621,
    "text": "So that's the result of kind of the random forces from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.261,
    "end": 427.663,
    "text": "And what this actual potential energy function here corresponds to is exactly that system of coupled masses on springs or harmonic oscillators, which we've kind of drawn here, illustrated in a way that like you can basically think of the system as being a bunch of little balls coupled together by springs that are all being jostled around by noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.947,
    "end": 437.702,
    "text": " And so the problem we wanted to solve, right, is that we had this matrix A and a vector B, and we wanted to find the point X such that AX equals B, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.423,
    "end": 446.074,
    "text": "And the way we're going to do that using this physical system is by allowing it to come to equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.054,
    "end": 461.286,
    "text": " meaning that after it's kind of run for enough time under these dynamics, eventually the state will be uncertain, but the state will be described by a probability distribution that is the Boltzmann distribution, the exponential of the negative potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.908,
    "end": 465.936,
    "text": "And so because the potential energy here is a quadratic function,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.916,
    "end": 472.609,
    "text": " the distribution of this form where you have E to the minus V of X, where V of X is this quadratic, is just a Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.25,
    "end": 481.005,
    "text": "And it turns out that the mean of that Gaussian is A inverse B, which is exactly the solution to that system of linear equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.807,
    "end": 484.532,
    "text": "And the covariance matrix is actually A inverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.512,
    "end": 487.096,
    "text": " So there's there's I guess two things to notice here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.116,
    "end": 499.973,
    "text": "The first is that if we want the mean of the linear system, if we want the answer to the linear system of equations, we can just allow this system of coupled harmonic oscillators to come to equilibrium and then estimate the mean of its state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.534,
    "end": 507.263,
    "text": "And if we actually if we wanted something else, we wanted the inverse of the matrix A, then what we could do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.243,
    "end": 518.248,
    "text": " is we could allow the system to come to equilibrium and then estimate all of the second moments of its state, or in other words, estimate its covariance matrix, which turns out to be this A inverse here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.515,
    "end": 532.437,
    "text": " So I also, I want to expand a little bit on this idea of like, what do I mean when I say that we could model the system and we can predict its behavior at the distribution level, even though it's unpredictable at the trajectory level, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.858,
    "end": 538.667,
    "text": "So when I wrote that, when I showed that equation, this equation two on earlier slide,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.647,
    "end": 551.705,
    "text": " What I mean by when I say it's unpredictable at the trajectory level is that if I know x of t, I can't predict x of t plus 1 with certainty because there's this noise that acts as a force on the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.186,
    "end": 557.213,
    "text": "And so you would need to know what the values of those random numbers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.193,
    "end": 574.813,
    "text": " are going to determine what the state is at time t plus one um but if i know like initially if i have some probability distribution for the state at time t1 and i want to know what's the probability distribution of the state of time t2 that is a question i can answer using this equation um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.793,
    "end": 586.391,
    "text": " And just for an illustration of this, on the left-hand side here, this kind of blue twisting path is a trajectory of the system where I've initialized it at this point over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.911,
    "end": 588.774,
    "text": "And then I've run it for a long amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.475,
    "end": 597.207,
    "text": "And the state of the system here, there's only two variables, x1 and x2, kind of orbits around in this ellipse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.187,
    "end": 612.259,
    "text": " But if I instead of just running one of these simulations running this one trajectory, if I ran many of these simulations and sample the initial state from kind of a from a normal distribution centered on this point,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.239,
    "end": 637.757,
    "text": " and then I look at the distribution over time for that collection of you know many thousands of trajectories I would get this plot here on the right and so what you see that the big there's a big difference between these two pictures in that the left one we have this trajectory which is behaving in kind of an unpredictable and random way but the distribution itself is behaving in a very predictable and in nice kind of smooth way and in one another way to think about this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.737,
    "end": 643.784,
    "text": " is that the equation I showed earlier is a stochastic differential equation called a Langevin equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.124,
    "end": 650.031,
    "text": "And it describes the dynamics in terms of the left picture, in terms of the trajectory or at the trajectory level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.451,
    "end": 659.642,
    "text": "But if I want an equation that describes what is happening in the right picture, that would be the Fokker-Planck equation, which describes the dynamics at the distribution level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.002,
    "end": 663.726,
    "text": "And so it's basically it's nice to be able to have these two pictures in mind at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.907,
    "end": 665.989,
    "text": "On the one hand, we're thinking about the trajectory level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.969,
    "end": 691.015,
    "text": " and on the other hand we're thinking about the the distribution level picture of the dynamics um and so when we go up to higher dimensions it's not as easy to make you know to make this plot i can't make uh i have no way to easily draw you know a 10 dimensional hyper ellipsoid the way i can do it in two dimensions but there is still a way we can visualize it and the way we can visualize it is by looking at the covariance matrices um so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.995,
    "end": 716.53,
    "text": " it's i guess just to go back here like what really are these ellipses well these ellipses really each of these ellipses really represents a whole distribution a normal distribution um and this ellipse is kind of the typical place where you would expect to find points that are drawn from that distribution but another way of describing the properties of that distribution is by its covariance matrix which describes all of the kind of parallel pairwise correlations between all the different variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.51,
    "end": 719.179,
    "text": " For here, we only have two variables, so it would be 2 by 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.6,
    "end": 722.048,
    "text": "But if we had 10 variables, it would be 10 by 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.57,
    "end": 726.121,
    "text": "Here, we have it for eight variables, so it's 8 by 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.763,
    "end": 729.793,
    "text": "And what we're looking at here is really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.904,
    "end": 743.881,
    "text": " over time as we go from kind of this black circle on the left side to this red ellipse on the right side, you can think of that process in higher dimensions in this eight dimensional case as how this matrix here is changing over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.341,
    "end": 755.275,
    "text": "So it's kind of the same thing, but now we're just watching a video of how the covariance matrix changes over time instead of plotting many ellipses at different moments in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.255,
    "end": 759.139,
    "text": " Now, another interesting thing about this video here is that this isn't a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.82,
    "end": 770.751,
    "text": "This is actually an experimental demonstration that we did on the hardware that we created at Normal Computing on circuits that look essentially like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.231,
    "end": 784.705,
    "text": "So these are just, as I mentioned earlier, these are just electronic implementations or realizations of coupled harmonic oscillators that happen to come to this equilibrium state, which is a multivariate normal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.685,
    "end": 791.038,
    "text": " and which has these properties that you can use it to solve linear systems of equations and get the inverse of matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.559,
    "end": 793.683,
    "text": "I guess, yeah, just one more word of detail here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.024,
    "end": 802.56,
    "text": "So this input matrix here is the matrix A. And then target inverse, this is the actual inverse of A that you can do just numerically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.581,
    "end": 804.364,
    "text": "You can compute the inverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.344,
    "end": 818.921,
    "text": " And then what these hopefully and in fact do kind of arrive to are the estimates, close estimates of the inverse of the matrix A, because that's the covariance matrix is supposed to be proportional to the inverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.141,
    "end": 830.875,
    "text": "So you may be wondering at this point, this seems interesting, but why is it that we would go to all this effort to actually try to solve linear systems or invert matrices in a completely new way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.816,
    "end": 834.199,
    "text": "What about this approach is promising?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.179,
    "end": 854.28,
    "text": " So one thing that's promising about it is that we have kind of theoretical results that show that we get better asymptotic scaling as the problem size increases with this thermodynamic architecture than the state of the art digital algorithms do to solve the same problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.26,
    "end": 883.103,
    "text": " So without, yeah, I can talk more about like the difference between the overdamped and the underdamped at some point, but just the headline here, if we look at this one row linear system, what this is saying is that basically on the digital state of the art methods take like order of D squared, you know, the amount of timescales with the square of dimension to solve a linear system using something like the conjugate gradient method, for example, whereas with our kind of thermodynamic approach,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.437,
    "end": 889.083,
    "text": " you get an amount of time scaling with d, so order of n instead of order of n squared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.503,
    "end": 892.146,
    "text": "So you have some kind of polynomial speed up there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.607,
    "end": 895.49,
    "text": "And we proposed a number of other algorithms in that paper too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.07,
    "end": 900.515,
    "text": "So the one for inverting a matrix, I basically explained how that one works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.575,
    "end": 907.082,
    "text": "It's just you end up estimating the second moments instead of estimating the mean of the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.062,
    "end": 915.412,
    "text": " And there, you also get a polynomial advantage because instead of taking order of n cubed, you get order of n squared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.432,
    "end": 927.467,
    "text": "And we also have algorithms for getting the determinants of a matrix or solving something called the Lyapunov equation, which is a matrix equation that kind of generalizes the idea of the inverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.92,
    "end": 936.652,
    "text": " So one other thing I wanted to show actually is just kind of an animation or maybe a more vivid illustration of what's going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.333,
    "end": 947.127,
    "text": "So what you're seeing here is just like a simulation of a two-dimensional coupled harmonic oscillator system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.107,
    "end": 956.401,
    "text": " where right now the matrix A is just the identity matrix, and so in other words, there's no coupling between the two harmonic oscillators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.421,
    "end": 964.573,
    "text": "We have two separate harmonic oscillators that aren't coupled together, and the coordinate of one is plotted as the x-axis, and the coordinate of the other is plotted as the y-axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.154,
    "end": 970.262,
    "text": "So because they're not coupled, we wouldn't expect to see any correlation between them, and we don't in fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.63,
    "end": 972.753,
    "text": " And there's also noise being added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.793,
    "end": 977.661,
    "text": "So I can kind of change the amount of noise here by increasing the temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.681,
    "end": 990.02,
    "text": "And I can change the resistance to change the amount of damping and change the inductance, which is essentially like changing the mass of the mass on a spring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.52,
    "end": 998.713,
    "text": "And by kind of tuning these parameters, I can get something that looks more or less like I'm getting a bunch of samples from this multivariate normal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.693,
    "end": 1000.155,
    "text": " And in fact, I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.175,
    "end": 1006.985,
    "text": "And I can look here at the marginals and see these are samples from these, you know, these are the histogram basically looks like a normal distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.666,
    "end": 1014.616,
    "text": "Although just because all the samples seem to be to have the right distribution, that doesn't mean that the samples are independent from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.636,
    "end": 1017.04,
    "text": "They could all be, you know, highly correlated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.391,
    "end": 1026.513,
    "text": " And so we can also look at kind of the autocorrelation function here, where basically the more you crank up the noise, the faster the correlation decays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.573,
    "end": 1033.83,
    "text": "In other words, if you want to predict where will the next sample be based on the current sample, if there's very little noise, that's kind of easy to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.81,
    "end": 1036.293,
    "text": " But if there's a lot of noise, that's really hard to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.834,
    "end": 1040.659,
    "text": "And I can also just take samples less frequently if I don't want as much correlation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.679,
    "end": 1044.704,
    "text": "So that's what I'm doing here is I'm kind of cranking up the amount of the interval between samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.144,
    "end": 1049.23,
    "text": "And now that will suppress correlation between samples quite a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.151,
    "end": 1056.679,
    "text": "But at this point, there's something a little bit trivial about this example because they're just two harmonic oscillators that aren't coupled to each other at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.659,
    "end": 1074.128,
    "text": " so really what we're interested in is is when we couple them together um so i think yeah we would change this kind of term and so what this ellipse now is the ellipse has changed this predicting you know where we expect to see the samples now that there's a coupling between these these two masses on springs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.108,
    "end": 1077.812,
    "text": " And I think it's nice just to think intuitively about why does it happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.832,
    "end": 1082.477,
    "text": "Why do we expect to see the distribution look like this when we turn on a coupling between the springs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.877,
    "end": 1091.706,
    "text": "Well, it's basically just that like we, instead of having two separate masses on springs that are oscillating by themselves, now there's another spring that's pulling them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.846,
    "end": 1093.488,
    "text": "And so they want to be close together, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.869,
    "end": 1103.018,
    "text": "And so that means that we're likely to see points where the position of X1 is similar to the position of X2, whether they're both positive or both negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.998,
    "end": 1108.03,
    "text": " And that's kind of exactly what we're seeing as we see samples kind of filling in this ellipse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.852,
    "end": 1111.078,
    "text": "So, yeah, I just wanted to show that kind of animation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.098,
    "end": 1120.18,
    "text": "This is just a kind of some JavaScript code I wrote a while ago as kind of a visualization tool for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.345,
    "end": 1127.695,
    "text": " I also, yeah, I have the paper pulled up here and I can talk more about like, how, how do we, um, there are a few things I can talk more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.815,
    "end": 1134.624,
    "text": "So for example, like how do we derive these complexity results of the asymptotic scaling or how do these other algorithms work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.844,
    "end": 1137.027,
    "text": "Like, um, the determined estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.368,
    "end": 1144.157,
    "text": "Um, but yeah, I wanted to maybe at this point, pause and see if there were any questions either from the audience or Daniel or anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.177,
    "end": 1144.277,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.244,
    "end": 1168.257,
    "text": " awesome okay anyone can write questions in the chat yeah hearing more though about how do you pull out different analytically useful values from heat what does that mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.523,
    "end": 1179.972,
    "text": " Taking a stab at it now, but revisiting it, I mean, how is it that there are these tractable, useful quantities arising out of physical objects like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.619,
    "end": 1183.14,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.846,
    "end": 1185.289,
    "text": " Yeah, I think that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.609,
    "end": 1199.695,
    "text": "I mean, to go back to the history of like, so first off, the first thing people tried to do was just pure analog computing, where they didn't really consider the noise or assumed you could suppress the noise enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.675,
    "end": 1205.684,
    "text": " And that analog computing approach is based on a system that physically solves a differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.406,
    "end": 1215.54,
    "text": "So whereas our approach is a system that physically solves a stochastic differential equation, but it's still useful to think about the analog case where there's no noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.52,
    "end": 1218.362,
    "text": " and where you're just trying to solve a differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.243,
    "end": 1231.794,
    "text": "Because one thing you might think to do is if you want to solve a differential equation, instead of just solving it numerically on a computer, you could actually just try to build a system that actually evolves according to the differential equation you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.715,
    "end": 1245.426,
    "text": "So that's one perspective on why do these physical objects do useful computations, because it's kind of like saying we're going to build the physical system that behaves in that way instead of trying to simulate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.406,
    "end": 1257.802,
    "text": " And I guess, yeah, another perspective is that, well, so with the linear systems, right, like you can, in theory, you can solve linear systems on an analog computing device as well that doesn't have any noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.422,
    "end": 1265.271,
    "text": "And what's kind of going on there is that you're basically doing very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.251,
    "end": 1288.17,
    "text": " efficient multiply and accumulate operations in a sense in that if you want to add together like n things um digitally that's going to basically take order of n steps but if you want to add together n things kind of using some analog device there are ways to do it that are more more like constant time so for example if i have n wires that all converge at one point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.15,
    "end": 1293.697,
    "text": " and I send a current into each one of those end wires, then the current that comes out is the sum of those currents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.097,
    "end": 1298.222,
    "text": "So it's kind of a way of adding together all of those end things in constant time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.523,
    "end": 1310.918,
    "text": "So I think those two perspectives are kind of useful, that one, we get very efficient analog multiply and accumulate operations, and the other is that we're kind of building the system instead of simulating it in some sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.315,
    "end": 1317.506,
    "text": " What is the transferability of these shapes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.606,
    "end": 1324.079,
    "text": "Like, do you have it work really well on this five by five matrix, but then you need to go back to square zero for six by six?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.781,
    "end": 1330.813,
    "text": "Or how do you deal with making on the fly changes or adapting to specific problems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.076,
    "end": 1333.679,
    "text": " Right, yeah, so that's a very good question, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.719,
    "end": 1345.703,
    "text": "Like how, you know, how does it, how do these things work in particular when we go up to like the limit of like much larger matrices, which is relevant for, you know, the big kind of AI and industrial applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.104,
    "end": 1349.41,
    "text": "What we found is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.727,
    "end": 1356.494,
    "text": " Generally, these algorithms behave pretty well as we increase dimension over a large range of different dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.514,
    "end": 1360.158,
    "text": "We can go up to thousands of dimensions and still get the answer very accurately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.839,
    "end": 1365.764,
    "text": "But there are other properties of the matrix that are relevant too that can make it hard to solve the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.205,
    "end": 1369.388,
    "text": "One that's very important, for example, is the condition number of the matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.59,
    "end": 1376.376,
    "text": "So if you think about those ellipses, well, I guess I can just go, yeah, scroll down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.71,
    "end": 1405.283,
    "text": " if for a matrix that well the condition number is the ratio of like the largest singular value to the smallest singular value of a matrix and what the singular values are is they're the length of like this kind of this long axis here and this short axis here uh and so an ellipse that's very long and skinny has a very large condition number basically the condition number basically describes how long and skinny the ellipse is or if it's in high dimensions it's like some kind of n-dimensional pancake",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.263,
    "end": 1435.27,
    "text": " if it has and it has a large condition number and basically yeah um matrices with harder with larger condition numbers end up being harder to invert or to solve a linear system for if matrix a has a large condition number um but you know there's still uh there's still ways to do it but it's that's i would say one of the bigger challenges to generalization is that like as you go up to higher dimensions it's kind of easier to get matrices that end up having very large condition numbers so more can go wrong i guess",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.25,
    "end": 1453.654,
    "text": " And you, to what extent, rely on repeated, de-correlated, long-term sampling of single objects versus parallelized or replicated sampling across objects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.774,
    "end": 1456.077,
    "text": "And then what does that have to do with ergodicity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.103,
    "end": 1465.373,
    "text": " Yeah, so I think I'll first answer the question about ergodicity, actually, because, yeah, I think that that's a very good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.393,
    "end": 1476.225,
    "text": "That's a very good way to phrase the question, actually, because if I look at this plot on the left, this is just a single trajectory, right, that I've run for a very long amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.046,
    "end": 1486.637,
    "text": "And it turns out that if I just take enough samples of this single trajectory, that even if those samples are kind of correlated with each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.09,
    "end": 1506.01,
    "text": " um it still you know will work but if if i have n samples it's better to have an uncorrelated samples and correlated samples but i don't need to actually run many trajectories in parallel i can just run one and it turns out that that one trajectory has the same statistics the same mean covariance as if i had run",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.99,
    "end": 1532.233,
    "text": " a thousand you know or a thousand or a million separate trajectories and that doesn't happen for every you know for every stochastic differential equation but it does happen for this one and that property is called ergodicity right the property of ergodicity is that the ensemble averages and the time averages are you know are the same they're the same statistics um so on the right hand side here this is kind of looking at the ensemble picture which would be more like if i had used parallelization and built many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.213,
    "end": 1534.057,
    "text": " of the devices and kind of random and parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.798,
    "end": 1540.69,
    "text": "So I guess the answer to the question of like, which one do we do or which one in practice is more useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.011,
    "end": 1542.073,
    "text": "You can do either one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.113,
    "end": 1550.61,
    "text": "I think that it's it's a it's kind of a knob or a lever you have to turn if you if you have more, if you can pay more for more hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.928,
    "end": 1577.07,
    "text": " uh and you can pay more energy then you can solve the problem faster by running many trajectories in parallel whereas if you only want you know one device that that only runs one of these trajectories you can just take samples at different points in time and because of ergodicity it's the same as the ensemble statistics basically cool carry on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.337,
    "end": 1577.637,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.657,
    "end": 1577.898,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.918,
    "end": 1579.44,
    "text": "Yeah, I thought those were all great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.46,
    "end": 1580.321,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.382,
    "end": 1588.712,
    "text": "Yeah, I guess there was one other thing I wanted to say just at a kind of a high level about like, how do we go about getting these complexity results?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.634,
    "end": 1601.51,
    "text": "Because you can imagine there might be something subtle about it just because this algorithm, for example, is never actually guaranteed to give you the right answer because it's based on randomness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.391,
    "end": 1607.057,
    "text": "You know, the state is not, the mean is not guaranteed to converge to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.037,
    "end": 1626.75,
    "text": " the you know to the solution to the linear system it's just very likely to do that um and so you need basically i think of it as it's um yeah it was this term that was coined by uh i forgot his name a computer scientist um leslie i think uh or what was the name uh yeah i forgot his name but um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.131,
    "end": 1642.181,
    "text": " It's called probably approximately correct is the idea that you have a computation that with a high probability will be within a certain radius, you know, within a certain error tolerance of the correct solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.582,
    "end": 1645.448,
    "text": "And so that's kind of the approach we take to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.255,
    "end": 1650.159,
    "text": " quantifying the runtime analysis for these algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.46,
    "end": 1659.149,
    "text": "And I guess an example of that is down here in the appendix, where you can kind of find we have bounds on, let's see, where is this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.594,
    "end": 1664.675,
    "text": "Yeah, so it'll be down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.715,
    "end": 1672.363,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.858,
    "end": 1683.113,
    "text": " Yeah, so we basically have a bound on how long do you need the time to be in order to have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.278,
    "end": 1707.531,
    "text": " state close small closer than epsilon to the solution with probably with probability at least p basically and so all of our results are formulated in that framework of you choose the success probability you choose the relative error tolerance and then you get out a time basically that you need to run your system for you need to average for and those kind of results are quoted up here in these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.73,
    "end": 1708.632,
    "text": " these tables basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.133,
    "end": 1715.228,
    "text": "But yeah, so I think that's really what I had to say on the thermo linear algebra paper, unless there are any other questions about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.669,
    "end": 1720.922,
    "text": "And I think otherwise I'll move on to talking about this thermodynamic Bayesian inference paper, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.322,
    "end": 1724.49,
    "text": "Let me ask one question about that last bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.061,
    "end": 1728.488,
    "text": " Um, how do you get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.788,
    "end": 1741.213,
    "text": "Did you build different objects and then backcast the formal relationships, or do you play around with the formalisms and then ask if or how a physical object could realize it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.864,
    "end": 1753.303,
    "text": " Right, so yeah, so all of these mathematical results are derived within a pretty abstract framework, which is the abstract framework is just the stochastic differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.924,
    "end": 1763.421,
    "text": "So in other words, in order to derive these complexity results, we just start by assuming that the system evolves according to this stochastic differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.401,
    "end": 1767.245,
    "text": " And once we've made that assumption, we can completely forget about the physical implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.605,
    "end": 1774.693,
    "text": "Whether it's actual masses on springs or capacitors and inductors or whatever, those details become irrelevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.713,
    "end": 1785.745,
    "text": "And so we're just talking about the kind of mathematical properties of how quickly the distribution converges under these dynamics to the stationary distribution of this equation, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.61,
    "end": 1790.91,
    "text": "OK, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.818,
    "end": 1809.285,
    "text": " So yeah, so one thing that we noticed basically when we were doing that, when we were writing that thermo-linear algebra paper, is that we noticed that while we'd gotten these very nice and satisfying polynomial speedups that we predicted, it seemed like we somehow should be able to get even better speedups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.785,
    "end": 1820.762,
    "text": "And the reason for that was that much of the runtime of running those thermo-linear algebra algorithms was actually dominated by just taking averages of the state of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.742,
    "end": 1824.846,
    "text": " In other words, if we go back to this picture,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.176,
    "end": 1830.542,
    "text": " here, it turned out that we initialize the system out of equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.883,
    "end": 1833.867,
    "text": "It very rapidly comes to its equilibrium distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.228,
    "end": 1842.1,
    "text": "And then we have to spend a long time drawing samples from this equilibrium distribution and averaging those samples in order to get the estimate of the mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.5,
    "end": 1850.652,
    "text": "And so we started to think about, well, what if there are applications where we don't need to take averages, where we just want to draw samples from the equilibrium distribution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.053,
    "end": 1852.555,
    "text": "Because if that were the case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.535,
    "end": 1862.192,
    "text": " then we would probably we might be able to get a much better speed up because we wouldn't even have to do this this long, you know, the longest or the hardest part of our algorithm, which is moment estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.693,
    "end": 1874.273,
    "text": "And so that was basically the genesis of this thermal Bayesian inference paper, because we started thinking, like, what kind of problems is the output sample from a distribution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.354,
    "end": 1895.164,
    "text": " what kind of problem you're you don't want something that's a deterministic function of the input but you want to sample and one thing that came that came up is sampling from the bayesian posterior of some model so uh so that's kind of a pretty common task that that you know people want to do is they have some parameter data say and then some data observed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.684,
    "end": 1900.513,
    "text": " data, y, like different samples, y1, y2, so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.194,
    "end": 1913.676,
    "text": "And you want to condition your, you have some prior distribution for your hidden variable, or yeah, you have some prior distribution for your parameter theta, and then you have a likelihood, which is like a theory of how the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.858,
    "end": 1925.85,
    "text": " parameter theta determines the observed data y. And given those two things, given your data and your prior and your likelihood, you want to condition the parameter theta on the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.931,
    "end": 1934.96,
    "text": "And then often you want to sample from that posterior distribution, the distribution that's kind of been revised by the presence of your data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.66,
    "end": 1938.263,
    "text": "And so we basically started thinking about whether there's a way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.243,
    "end": 1947.422,
    "text": " We could use a similar approach based on a physical realization of like noisy management dynamics in order to do Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.562,
    "end": 1950.388,
    "text": "And then we wouldn't have to do moment estimation or averaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.408,
    "end": 1952.211,
    "text": "And so we might get much better speed ups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.133,
    "end": 1955.217,
    "text": "And so that's basically what we did in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.257,
    "end": 1958.985,
    "text": "And I guess at a higher level,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.965,
    "end": 1981.075,
    "text": " there's kind of a nice formalism for how you can think about yeah just what what is going on at a higher level and how we're doing bayesian inference using a physical system here um and so what it is it's it's it's related to the idea of an energy-based model that one way of parameterizing a probability distribution p is to write that probability distribution p is the exponential",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.055,
    "end": 1991.776,
    "text": " of some energy function, or e to the minus v. So this is just a way of writing any distribution you can write in this form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.117,
    "end": 2002.337,
    "text": "But also importantly, this is the form a distribution will take in statistical mechanics when you allow a system to come to equilibrium that has some energy v.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.317,
    "end": 2021.777,
    "text": " form of its kind of equilibrium distribution um and so this when you talk about uh probability distributions in those terms it's often called like an energy-based model approach um and there's something convenient about using energy-based models for bayesian inference basically which is that when you take the log of your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.757,
    "end": 2044.744,
    "text": " probability density function instead of like multiplying together probability density functions you end up adding together energy functions because we're now talking about the logs of the probabilities instead of the probabilities and so that's what's going on with this equation here it says u1 of theta equals minus ln of p theta minus ln of py given theta so here um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.724,
    "end": 2047.068,
    "text": " P theta is the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.228,
    "end": 2052.637,
    "text": "That's our assumption of the distribution for the parameters theta before we've gotten any measurements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.278,
    "end": 2061.252,
    "text": "PY given theta is our theory or model of how Y depends on theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.312,
    "end": 2063.155,
    "text": "In other words, how does the data that we can observe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.135,
    "end": 2065.999,
    "text": " depend on the parameter that we can't observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.061,
    "end": 2079.819,
    "text": "And so what you would do in Bayes' theorem is you multiply together, or not even Bayes' theorem, just the definition of the joint distribution is p of theta and y is p of theta times p of y given theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.219,
    "end": 2085.767,
    "text": "But now instead of multiplying these things together, we're going to be adding them together because we're talking about the energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.747,
    "end": 2094.39,
    "text": " So this energy kind of represents the joint distribution somehow because it includes the contributions from the prior and the likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.366,
    "end": 2113.532,
    "text": " And so what you do in these thermobase and inference problems is you start out with one energy, one potential energy, which can be thought of as like kind of a box that, you know, you can think of the system as some, well, like in thermodynamics, we might think of it as like a gas inside of a box.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.552,
    "end": 2117.998,
    "text": "And then you can change the potential energy by moving a piston in or out or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.978,
    "end": 2133.827,
    "text": " or sometimes we think of it as like a marble in a bowl and then you can reshape the bowl changing the potential energy which is maybe closer to like this picture here where when we change the potential energy we're like changing the shape of this bowl basically um so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.634,
    "end": 2152.643,
    "text": " back here what's plotted in this panel a is what happens when we vary when we change the potential energy function over time so between time zero and time one we're going to change the potential energy from a potential energy that's associated with the prior uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.842,
    "end": 2154.885,
    "text": " which is U zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.905,
    "end": 2157.328,
    "text": "So U zero equals minus log of P theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.788,
    "end": 2163.475,
    "text": "And that's like this blue curve is the probability density when we're in that prior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.876,
    "end": 2174.709,
    "text": "And then we slowly change the potential or slowly or quickly, we change the potential energy to U one, which is the distribution that corresponds to the posterior basically for theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.57,
    "end": 2182.579,
    "text": "In other words, it's the distribution where you've conditioned theta on all of your observed data basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.559,
    "end": 2204.753,
    "text": " uh and so what we're seeing in this plot is that as we as we change the potential over time the distribution of the system changes and it goes from this gaussian distribution to this kind of asymmetric distribution which in this case is the posterior for like bayesian logistic regression um and another view of that is in panel b where we're looking at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.733,
    "end": 2207.176,
    "text": " how the thermodynamic quantities change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.636,
    "end": 2214.284,
    "text": "So whenever you're changing the potential energy of a system, the potential energy function of a system, you can be doing work on the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.965,
    "end": 2220.612,
    "text": "And so this orange curve here is beta times work, where beta is 1 over kT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.233,
    "end": 2225.197,
    "text": "And we see that the potential energy changes between time 0 and time 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.638,
    "end": 2227.5,
    "text": "And during that window of time, we're doing work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.921,
    "end": 2230.524,
    "text": "But then at time 1, the potential energy stops changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.924,
    "end": 2233.187,
    "text": "And so no work is being done there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.167,
    "end": 2238.476,
    "text": " And so we can see how much work is being done on the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.637,
    "end": 2252.02,
    "text": "And then there's also heat, which is the change in energy that's not associated with the work being done, which you can compute just kind of using the first law that DE equals DW minus DQ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.152,
    "end": 2276.134,
    "text": " um so we have work and heat which are kind of the two most fundamental uh thermodynamic quantities i guess um and then we also have uh the free energy uh we also you know a quantity of great importance and there's there's kind of two different versions of free energy that are that are plotted here so one is this dashed line which is the equilibrium free energy and what that means is that at each instant in time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.603,
    "end": 2282.289,
    "text": " The potential energy is changing, but we could imagine a system that was in equilibrium at that instant in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.99,
    "end": 2291.84,
    "text": "And if we did have a system that was in equilibrium at that instant in time, its free energy would be the equilibrium free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.2,
    "end": 2299.388,
    "text": "So that's kind of the definition of the equilibrium free energy is the free energy of a system at equilibrium with the instantaneous potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.705,
    "end": 2306.721,
    "text": " Then there's the non-equilibrium free energy, which can basically be larger than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.165,
    "end": 2317.647,
    "text": "The reason it can be larger than that is that the system is not in equilibrium at all times, that if you're quickly changing the potential energy, the system is driven out of equilibrium,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.627,
    "end": 2342.048,
    "text": " and so you can kind of look at the gap between these like the gap between the dotted black line and the solid black line as the extent to which the system is out of equilibrium at each moment in time and what happens is when when we quickly change the potential from time zero to time one the system is coming out of equilibrium these these two lines are getting farther apart and then at time one we stop changing the potential and the system starts to come back into equilibrium basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.028,
    "end": 2359.125,
    "text": " And just another note on this is a nice interpretation of the difference between these F minus F equilibrium is that it's actually the KL divergence or the callback callback library divergence of between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.105,
    "end": 2363.793,
    "text": " the distribution of the system at any time and the equilibrium distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.694,
    "end": 2376.253,
    "text": "So that's just another way of saying that it characterizes to what extent the system is out of equilibrium, because this KL divergence is basically a way of quantifying the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.233,
    "end": 2382.29,
    "text": " So it's not technically a distance measure, but a kind of distance between probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2382.872,
    "end": 2391.576,
    "text": "And so it turns out that this like F minus F equilibrium is equal to the KL divergence between the distribution and the equilibrium distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.012,
    "end": 2401.885,
    "text": " Um, so that's kind of the general framework of like what we're doing in the thermal Bayesian inference is that we're, we're setting up a system so that we can change this potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.446,
    "end": 2410.757,
    "text": "And we turn on, we, we have a potential energy term that represents the prior, and we have another kind of coupling term that represents the likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.797,
    "end": 2416.104,
    "text": "And then we have like physical degrees of freedom that represent the observed data that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.725,
    "end": 2419.909,
    "text": "And when we turn on this interaction between data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.345,
    "end": 2428.756,
    "text": " and all of these observational degrees of freedom, then the equilibrium distribution becomes the Bayesian posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.116,
    "end": 2435.405,
    "text": "And if we wait for a long enough time, then we can measure the state data and get samples from the Bayesian posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.105,
    "end": 2437.207,
    "text": "So let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.307,
    "end": 2441.112,
    "text": "I say a little bit more about that just in theory and how that plays out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.713,
    "end": 2448.141,
    "text": "But you might notice here that this kind of is the key to the algorithm is this stochastic differential equation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.121,
    "end": 2473.588,
    "text": " which is you know similar to the form of the stochastic differential equation i showed on this slide equation two um and in that it has kind of this drift term which is like the predictable change in the state of the system and then this um this noise term which is like the unpredictable change in the state um and so let's see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.1,
    "end": 2477.922,
    "text": " Yeah, I think that, oh yeah, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.942,
    "end": 2481.205,
    "text": "So I guess what I'll, yeah, I'll talk a little bit about the examples we did in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.246,
    "end": 2490.415,
    "text": "So what we did was we tried this out for two kinds of Bayesian inference, like two examples of Bayesian inference, one of which is a Gaussian-Gaussian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.476,
    "end": 2497.203,
    "text": "So where you have a Gaussian prior and a Gaussian posterior, and the other is Bayesian logistic regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.223,
    "end": 2501.647,
    "text": "So where you have like a Gaussian prior and a logistic likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.028,
    "end": 2505.972,
    "text": "So this plot here is for the Gaussian-Gaussian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.952,
    "end": 2513.081,
    "text": " And we see basically the prior is one of these green ellipses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.722,
    "end": 2519.55,
    "text": "And then the likelihood is the red ellipse or might be the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.81,
    "end": 2523.455,
    "text": "But then you get the posterior, which is kind of in the middle somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.056,
    "end": 2527.2,
    "text": "And it turns out that you can use this circuit over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.18,
    "end": 2539.681,
    "text": " in order to sample from that blue ellipse, that blue distribution, which we've actually simulated this circuit in SPICE, which is a popular library, popular software package for simulating circuits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.282,
    "end": 2548.716,
    "text": "And so what you do is you have one set of resistors that's used to input the prior covariance matrix,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.118,
    "end": 2555.004,
    "text": " and another set of resistors that's used to put in the likelihood covariance matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.405,
    "end": 2559.709,
    "text": "And then once you do that, you can measure the currents through these inductors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.17,
    "end": 2565.536,
    "text": "And measuring those currents gives you a sample from the desired posterior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.256,
    "end": 2571.922,
    "text": "So yeah, I guess that's at a high level what I wanted to say about this Gaussian-Gaussian model case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.303,
    "end": 2578.129,
    "text": "Were there any questions about either the overview, like the general picture of thermobasian inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.379,
    "end": 2602.142,
    "text": " or about like this Gaussian Gaussian model yeah a few questions how do you know that you aren't too confident or not confident enough with respect to the posterior like your precision or your attention what makes you not just how do you get confidence in your confidence level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.472,
    "end": 2611.65,
    "text": " such that you can draw a useful Bayesian credible interval rather than, for example, making it much wider or much tighter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.71,
    "end": 2612.833,
    "text": "I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.294,
    "end": 2613.535,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.635,
    "end": 2618.646,
    "text": "In other words, how do we test that we're actually drawing from the right posterior kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.098,
    "end": 2624.327,
    "text": " Yeah, if you can compare it with the exact compute, then you've already done that computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.367,
    "end": 2634.424,
    "text": "So then when do you feel like it's okay to get out without the guide rails and take the thermodynamic estimate as it is without doing secondary calibrations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.332,
    "end": 2636.514,
    "text": " Yeah, so that's a good question, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.794,
    "end": 2644.125,
    "text": "So one of the nice things about the Gaussian Gaussian model is it is one of these very few cases where there is an analytical solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.225,
    "end": 2655.321,
    "text": "So you can compute exactly what the posterior, like the posterior is a Gaussian again, and you can compute exactly what the mean and covariance matrix of that Gaussian are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2655.702,
    "end": 2657.104,
    "text": "And so we can compare them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.084,
    "end": 2670.551,
    "text": " But I think you're also alluding to the fact that eventually we aren't going to have that guardrail and we're just going to say, we're now confident enough that this system can sample from the true posterior and we're kind of done with testing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.153,
    "end": 2675.802,
    "text": "And yeah, I think the question of like, when exactly do we become confident enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.782,
    "end": 2680.909,
    "text": " that it gets the right posterior is maybe not completely solved yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.67,
    "end": 2694.906,
    "text": "But I would say that because in the Gaussian-Gaussian case, there's an analytical solution, I feel pretty confident that we can do enough testing even at pretty high dimensions that we'll be able to assure ourselves basically that it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.247,
    "end": 2696.929,
    "text": "But where that becomes more difficult,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.909,
    "end": 2705.962,
    "text": " is for cases where there is no analytical solution to compare to, like in the case of the Bayesian logistic regression, which we also do here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.002,
    "end": 2718.36,
    "text": "And in that case, the best thing you can do is just kind of run a Monte Carlo simulation digitally and compare that to the results that we would predict with SPICE or compared to experimental results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.34,
    "end": 2722.746,
    "text": " which also works, it's just much, much more expensive computationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.008,
    "end": 2730.578,
    "text": "But on the other hand, the fact that it's much more expensive computationally means that we're solving a really hard problem, which is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.958,
    "end": 2747.802,
    "text": "But yeah, I guess, yeah, to make a long story short, that's still kind of something we're going to have to figure out, you know, in complete detail is like, how do we do enough tests and what tests we have to do to assure ourselves that it gets to the right posterior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.163,
    "end": 2748.263,
    "text": "Yeah."
  },
  {
    "start": 2748.952,
    "end": 2759.67,
    "text": " Another interesting piece was that changing differential between the equilibrium free energy and the non-equilibrium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.14,
    "end": 2787.514,
    "text": " so do you experiment with like different speeds and find a trade-off between moving it too fast but taking you too far out of equilibrium but then is there any downside to just moving it super fast or do you uh get better accuracy or performance in the kind of infinitesimal movement case keeping it close to equilibrium all along the way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.405,
    "end": 2788.745,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.785,
    "end": 2790.167,
    "text": "So that's a that's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.227,
    "end": 2803.141,
    "text": "And actually something that we're probably that that's a focus like a current kind of research focus is like, what is the given that we have this freedom of like how quickly we want to turn on the potential, how quickly we want to turn on the interactions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.022,
    "end": 2805.624,
    "text": "What should we do with that freedom, basically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.205,
    "end": 2811.29,
    "text": "And there's like this really interesting literature on like energy time tradeoffs in stochastic thermo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.691,
    "end": 2813.653,
    "text": "So let me see if real quick I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.633,
    "end": 2839.692,
    "text": " pull up this paper um wasterstein uh statistical um well just while you're looking for it you mentioned probably approximately correct that's leslie valiant that's right leslie valiant that's right exactly yeah um thanks um yeah so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.823,
    "end": 2852.981,
    "text": " Okay, so I can't find exactly the reference I'm looking for, but basically what it says is that, so I talked about the KL divergence, which is one way of quantifying the difference between two probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.481,
    "end": 2858.608,
    "text": "Another way of quantifying the difference between two distributions is the Wasserstein distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.588,
    "end": 2865.943,
    "text": " which kind of has this very deep and elegant theory in kind of optimal transport theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.243,
    "end": 2878.909,
    "text": "And where Wasserstein distance came from originally was optimal transport problems, and in particular, how do I transform one configuration of some material, say, into another configuration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.889,
    "end": 2905.318,
    "text": " or if i have like a mound of dirt and i want to move the amount of dirt and also reshape it uh how how many shovels full of dirt am i going to have to take basically and that's kind of the classical um kantorovich problem uh or there's there's another guy who well i think it's the other guy the problem i'm thinking of but there are these two dual optimal transport problems that are basically the same thing that are that problem of transforming one mound of dirt into another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.298,
    "end": 2912.41,
    "text": " And the Wasserstein distance is the amount of shovels of dirt you need basically to carry to transform one distribution into another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.211,
    "end": 2921.265,
    "text": "So you can think of it as like accounting for, it accounts for like not just assigning low probability to high probability events,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.245,
    "end": 2941.752,
    "text": " with one distribution versus the other but also like if the mean of one distribution is very different than the other then you can think of it as like having to move a lot of mass from one place to another and the kind of cool result that there is in statistical mechanics and in particular like stochastic thermo around this washerstein distance is that if you want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.732,
    "end": 2959.032,
    "text": " change a system state um over time then there's like this trade-off you need to pay between the amount of work that you dissipate and the amount of time that you take and it ends up the form of that trade-off is that the product of the dissipated work and the time duration of your protocol",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.282,
    "end": 2964.531,
    "text": " is lower bounded by something times the Wasserstein distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.551,
    "end": 2978.353,
    "text": "So I guess you can think of that as like, given that I have two distributions that are a certain distance away from each other, I can either transform from one to the other really quickly, but dissipating a lot of work, in other words, paying a lot of energy, or I can do it really slowly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.333,
    "end": 2980.796,
    "text": " without paying really any work at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.157,
    "end": 2987.866,
    "text": "Or I can take some trade-off, do something in between where I slowly change from one to the other and spend a medium amount of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.467,
    "end": 2999.802,
    "text": "What we're interested in doing is applying this formulation, this theory of Wasserstein distance and trade-off between energy and time to solving problems like this one, like doing Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.782,
    "end": 3025.62,
    "text": " and kind of saying there's like this optimal frontier of there's not just one optimal solution because you might be in a situation where you care more about speed than you care about energy or you might be in a situation where you care more about energy than about speed but there is a set of solutions that are optimal with respect to kind of your disposition towards and how you value energy and time and i think it's basically related to these like energy time trade-offs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.377,
    "end": 3043.322,
    "text": " that's kind of a classic pure slash meta bayesian approach anytime you have a free parameter treat that as another kind of variable to do inference on um what is the work reservoir as we're not exactly picking up weights and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.673,
    "end": 3063.994,
    "text": " lifting them to a higher elevation or anything so the heat reservoir makes sense in terms of standard thermodynamics heat bath and all that but what's happening with the work reservoir and what is it touching or doing with the device yeah yeah that's a great great question too so if i go back to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.565,
    "end": 3072.755,
    "text": " to this picture for a second here, you can visualize these systems, again, as a collection of masses coupled together on springs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.136,
    "end": 3078.763,
    "text": "And then what we're doing when we're changing the potential energy is we're changing the spring constants of some of these springs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.164,
    "end": 3086.473,
    "text": "So maybe each of these springs has a little screw on it that you can turn with a screwdriver to make it more or less stretchy, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.274,
    "end": 3091.519,
    "text": "But you need to draw a boundary between the system and what's outside the system somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.9,
    "end": 3094.403,
    "text": "And where we draw that boundary is that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.383,
    "end": 3101.015,
    "text": " whatever is turning that screw that's tightening, that's changing the spring constant is not part of our system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.416,
    "end": 3108.269,
    "text": "And so if you need to do work, if it costs energy in order to turn the screw, then that needs to come from somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.729,
    "end": 3110.653,
    "text": "And we're calling that a work reservoir.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.633,
    "end": 3119.727,
    "text": " And so we might actually be lifting weights up and down if that's where the energy comes from in order to change the parameters of the potential energy function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.127,
    "end": 3128.7,
    "text": "We're just kind of saying that wherever that energy comes from, if we have some battery or some flywheel or whatever, that's kind of outside of our system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.72,
    "end": 3136.692,
    "text": "And we're not really going to worry about it beyond just quantifying how much energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.975,
    "end": 3165.885,
    "text": " interchanges with the system basically yeah it's interesting that the device almost has these dual reservoirs it's like one of those toothpastes with a dividing line in the middle and squirting out both kinds because on one hand it's interfacing with heat defined as that which does not do work just the thermal dissipative and then on the other hand it's connected into the work reservoir which is sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.085,
    "end": 3182.963,
    "text": " the complement of heat and then the device is is interfacing with both of them and as you described seeking to find a path or a trajectory for itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.365,
    "end": 3203.787,
    "text": " that isn't leave that's not either dissipating extra heat unnecessarily or leaving work convertible work on the table either because it's sort of able to interface or or mediate between the work and the heat here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.408,
    "end": 3204.789,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.029,
    "end": 3205.19,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.23,
    "end": 3205.37,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.39,
    "end": 3207.414,
    "text": "And there's a really a nice interpretation of that, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.454,
    "end": 3215.43,
    "text": "I think I the way you put it as like a toothpaste tube where you can come in one in and out the other or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.833,
    "end": 3223.125,
    "text": "And it is it's it's we see a lot of diagrams like this where you have a heat, you know, you have your interchanging both heat and work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.105,
    "end": 3226.39,
    "text": " with an environment in the context of like heat engines, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.67,
    "end": 3231.438,
    "text": "Because you have a heat engine that, well, often there'll be three reservoirs in that case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.558,
    "end": 3236.906,
    "text": "Like you'll take in heat from a hot reservoir, dump out heat to a cold reservoir and then do work or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.167,
    "end": 3238.228,
    "text": "But here we have two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.268,
    "end": 3240.672,
    "text": "We just have a heat reservoir and a work reservoir.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.952,
    "end": 3247.703,
    "text": "But there is a way of thinking about this as a kind of heat engine like thing, but it's more of a refrigerator than a heat engine, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.023,
    "end": 3251.188,
    "text": "Because the goal of a heat engine is to take heat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.168,
    "end": 3252.831,
    "text": " and then output work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.851,
    "end": 3254.495,
    "text": "Of course, you also have to output heat somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.876,
    "end": 3258.223,
    "text": "But that's that's the goal is to use heat as a resource in order to output work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.583,
    "end": 3262.712,
    "text": "But what we want to do here is we're actually going to input work and then we're going to output heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.133,
    "end": 3265.919,
    "text": "And as a result, the entropy of our system decreases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.54,
    "end": 3271.911,
    "text": "And this is just kind of a general thing that happens when you condition one random variable on another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.33,
    "end": 3279.788,
    "text": " the entropy, on average, of the variable you conditioned decreases because the mutual information has to be positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.169,
    "end": 3282.736,
    "text": "So this is just one of these fundamental information theory things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.116,
    "end": 3288.229,
    "text": "Because of the positivity of the mutual information, conditioning on a random variable decreases the entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.209,
    "end": 3300.624,
    "text": " And you can think of in some sense, like decreasing the entropy of your system as as the operation of a refrigerator, even though it's not necessarily decreasing the temperature, per se, but it is decreasing the entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.764,
    "end": 3310.335,
    "text": "And so there's kind of this nice way of looking at this as like a heat engine, but really a refrigerator where you have this flow of work in and heat out and decreasing the entropy basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.075,
    "end": 3312.84,
    "text": " But just one quick note on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.9,
    "end": 3315.127,
    "text": "Of course, you can't decrease the entropy of the whole universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.548,
    "end": 3319.098,
    "text": "So the entropy has to be increased somewhere to compensate for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.399,
    "end": 3322.789,
    "text": "And that's what's happening where we have heat flowing out into the heat reservoir.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.13,
    "end": 3325.978,
    "text": "So the entropy of the heat reservoir is increasing to compensate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.143,
    "end": 3340.443,
    "text": " Could you maybe give a little detail, how do real empirical measures, Y1, Y2, etc., come in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.764,
    "end": 3349.261,
    "text": "Like in active inference, we're often thinking about perception as inference or action selection as inference, but just on the perception side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.762,
    "end": 3351.325,
    "text": "So some...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.305,
    "end": 3373.178,
    "text": " perceptual prior new observation comes in new photon hits the retina or whatever it may be new thermometer reading comes in for the IoT and how does that feed into this and how do you schedule or bring that empirical measurement in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.12,
    "end": 3374.421,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.842,
    "end": 3375.122,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.182,
    "end": 3384.803,
    "text": "So we think of the measured data, these observations, Y1, Y2, Yn, as representing constraints on the system somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.264,
    "end": 3391.538,
    "text": "And so when you get new data, you introduce kind of another one of these constraints by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.518,
    "end": 3402.632,
    "text": " writing down your observation and then coupling those physical degrees of freedom that store the observation then get coupled to your subsystem theta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.992,
    "end": 3406.136,
    "text": "But just to make it kind of concrete of like, yeah, how does that actually happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.496,
    "end": 3415.247,
    "text": "So in this circuit here, the degrees of freedom that represent theta are the currents going through these inductors L1 and L2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.362,
    "end": 3426.278,
    "text": " And the degrees of freedom that represent an observed data point Y are the currents that are provided by these current sources, I1 prime and I2 prime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.679,
    "end": 3438.636,
    "text": "And so what you do when you get data is you turn on these current sources and set the current that they're programmed to output as equal to the components of the data that you got.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.616,
    "end": 3448.47,
    "text": " But you could also maybe, something you said actually I thought was really interesting, which was in terms of like thinking about observation as like perception or learning from perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.291,
    "end": 3460.928,
    "text": "And you maybe could even think of these, maybe if we got rid of these current sources and just had the environment kind of coupled to these wires, and somehow it's like taking a measurement of the environment directly more or less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.908,
    "end": 3477.465,
    "text": " and then conditioning on those i think that that's also like kind of a valid interpretation which hadn't really i hadn't really thought of before but i think that's an interesting way to think about this as being kind of having these perception inputs here that are coupled to the environment and then conditioning its internal state based on those somehow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.846,
    "end": 3479.206,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.346,
    "end": 3500.266,
    "text": "Yeah, I mean, a neurological analogy to these circuits are like there's some neural manifold and spiking patterns or neural electrical fields are traversing and they're itinerating around this manifold describing the pre-observation state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.766,
    "end": 3502.288,
    "text": "Then a new observation comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.708,
    "end": 3506.912,
    "text": "If it's not attended to, it's like an uncoupled oscillator, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.892,
    "end": 3536.46,
    "text": " the observation that isn't attended to it's as if it didn't happen tree falling in the forest and all that whereas if the observation is strongly attended to and there's a strong coupling between the observation and the resonating state of the the prior then it moves more to be influenced by that observation more strongly and then hierarchical systems just have series of layers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.558,
    "end": 3548.374,
    "text": " with possibly different attentions to layers with resonating information coming from the environment in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.438,
    "end": 3571.645,
    "text": " towards the deeper priors like of the organism and then and then more on the outbound action selection is when it opens up to well maybe the uh prior from the higher levels cascades out and gets reflected as action modifying the environment to be more like the priors of the organism that's the change the world direction of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.553,
    "end": 3579.019,
    "text": " ongoing with the change your mind direction, updating the priors to be more aligned with what the environment is giving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.075,
    "end": 3581.475,
    "text": " I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.495,
    "end": 3584.038,
    "text": "Yeah, I think that's a really cool way of looking at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.359,
    "end": 3600.877,
    "text": "Exactly as you said, if there's no coupling between the degrees of freedom representing the parameters you're estimating, if those are coupled to some source of information in the environment, then yeah, it's like you're paying attention to it in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.317,
    "end": 3609.546,
    "text": "Whereas if there's no coupling, it's for the purpose of your Bayesian inference, it didn't happen or the information just isn't there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.526,
    "end": 3625.611,
    "text": " And so somehow the conditioning on a piece of information is embodied physically as a physical coupling between your description of the latent variable and the actual physical encoding of the observed data, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.591,
    "end": 3638.228,
    "text": " And then the other thing, yeah, the other piece you mentioned about like, what about kind of some feedback effect where like you, as a result of your knowledge of this variable, you come up with some policy for like how to behave or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.669,
    "end": 3643.836,
    "text": "And then that will actually change, maybe that will have an influence on the next observations you get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.176,
    "end": 3645.838,
    "text": "And that's a really interesting direction as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.119,
    "end": 3650.805,
    "text": "I think like for the purpose of this paper, we've just assumed like all the observations are independent of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.785,
    "end": 3672.068,
    "text": " And that would kind of break down if you assume that like if you are using some kind of decision, you know, decision strategy or policy to make decisions based on the data you get and your estimate of the state, your estimate of the parameters data to inform your future decisions in like maybe like a reinforcement learning setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.048,
    "end": 3680.641,
    "text": " But definitely like figuring out how to use this hardware in that context is something of interest, current interest for us now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.681,
    "end": 3685.308,
    "text": "So I'll definitely keep people posted as that progresses for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.959,
    "end": 3699.27,
    "text": "Cool, feel free to keep going if there's any other pieces you wanna explore and then people watching live can write any questions in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.993,
    "end": 3700.554,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.574,
    "end": 3701.477,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.858,
    "end": 3715.572,
    "text": "So I think that, yeah, so one thing I haven't talked about yet with this paper is our results on complexity, which is, of course, is a really important part of it, because that's what motivates us in the end is like why we go to this effort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.552,
    "end": 3739.787,
    "text": " building this totally new kind of device in order to solve problems we already have a way to solve them um but it's just really hard it's you know intractable a lot of the time the sample from bayesian posteriors if you have to run some very long uh you know markov processor or you know some monte carlo simulation uh so we have some results um oh yeah and i also kind of hinted at this earlier that we expected that we might get better speed ups in this case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.767,
    "end": 3745.778,
    "text": " than in the case of the TLA, the thermo in your algebra algorithms, because in this case, we don't have to do moment estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.838,
    "end": 3747.16,
    "text": "We just want to output samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.922,
    "end": 3752.65,
    "text": "And so that did kind of turn out to be true that we got pretty significant, like predicted speed ups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.151,
    "end": 3754.654,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.815,
    "end": 3773.841,
    "text": " for this case of the gaussian gaussian model where we're given like a gaussian prior and a gaussian likelihood and some data and then we want a sample from the gaussian posterior we found that the amount of time that it takes that the amount of time you have to wait between when you inc when you input your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3773.821,
    "end": 3799.693,
    "text": " uh when you input the problem and when you output the samples scales logarithmically with the size of the matrices involved basically um which is pretty good time scaling because if you think about like what you would have to do digitally to accomplish this you would have to like get the inverse of a matrix you have to get the inverses of two matrices and like add those together and take an inverse again that's essentially the process you need to do when you want to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.673,
    "end": 3801.556,
    "text": " conditioning for Gaussians.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.596,
    "end": 3809.448,
    "text": "And so that's something that would basically be n cubed time, maybe somewhere between n squared and n cubed using state-of-the-art algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.849,
    "end": 3813.414,
    "text": "And so if we can do that in the amount of time that scales with log n, that sounds really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.875,
    "end": 3819.644,
    "text": "It almost sounds too good to be true in a way, because how is it that we went from polynomial to logarithmic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.664,
    "end": 3821.246,
    "text": "It almost sounds like an exponential speedup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.727,
    "end": 3827.115,
    "text": "And while I think that this result is really cool, it's not quite that cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.095,
    "end": 3833.1,
    "text": " in that it's not fundamentally changing a polynomial operation to a logarithmic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.441,
    "end": 3836.343,
    "text": "And the reason is because we also have to look at the energy cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.503,
    "end": 3844.451,
    "text": "And when you look at the amount of energy, the energy consumed by the algorithm basically scales linearly with the size of the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.751,
    "end": 3855.921,
    "text": "So we got this scaling where we have logarithmic time in dimension and linear energy in dimension, which is still a pretty significant improvement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.901,
    "end": 3865.932,
    "text": " And then we also did some analysis of the time complexity for the Bayesian logistic regression scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.272,
    "end": 3883.191,
    "text": "And we found there we were able to show that you also get logarithmic scaling with dimension, but we haven't yet figured out the energy scaling analysis for the logistic regression, because that circuit ended up being a bit more complicated, and it uses these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.171,
    "end": 3887.158,
    "text": " differential pairs of transistors to get logistic functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.839,
    "end": 3891.285,
    "text": "And it's a little bit involved to try to estimate all the energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.846,
    "end": 3901.263,
    "text": "But those were the two circuits we gave in the paper was this one for doing the Gaussian-Gaussian model and this one for doing the Bayesian logistic regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.283,
    "end": 3907.474,
    "text": "And we have some promising results on the time and energy complexity of those operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.454,
    "end": 3926.155,
    "text": " So I guess one other just kind of interesting note about the interpretation and that also informs like how we derive these scale results is that there's kind of this interesting literature on like Wasserstein gradient flows, which is basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.708,
    "end": 3937.129,
    "text": " You can think of when the probability distribution is changing over time here, you can think of that probability distribution as a vector in a very high dimensional space, or really an infinite dimensional space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3937.831,
    "end": 3944.464,
    "text": "And the dynamics of that vector can be thought of as actually a gradient descent on some objective function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.444,
    "end": 3972.493,
    "text": " uh and it turns out that what that objective function is is actually that callback library divergence or the difference in free energy between you know f and feq and then it's and then the distance that um kind of the step size of that gradient descent is measured in terms of the washerstein distance which is that distance between distributions i talked about earlier so you can think of this as um like the dynamics of the probability distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.473,
    "end": 3984.208,
    "text": " as like an ordinary differential equation in an infinite dimensional space where it's like going in the line of gradient of steepest descent in KL divergence with respect to changes in Wasserstein distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.25,
    "end": 3988.634,
    "text": "But yeah, so those are the main things I wanted to talk about in this paper, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.954,
    "end": 3992.92,
    "text": "And maybe at this point, we can see if there's any questions from the audience or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.261,
    "end": 3994.802,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.575,
    "end": 4023.102,
    "text": " yeah i think people will definitely be interested in that connection with free energy where the kl divergence comes up in both the variational free energy bounding the bayesian surprise and expected free energy which is when considering policy inference as a computation as a cognitive process and looking over expected observations asking what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.436,
    "end": 4053.409,
    "text": " see what policy dependent sequence of expected observations would have what epistemic and pragmatic value so these circuits aren't planning they're in the variational free energy kind of mode but it's interesting that again we see kl divergence popping up in both and and different divergences and distances between distributions being basically the crux of the question and which measurements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.659,
    "end": 4076.072,
    "text": " about which distributional distances and which properties of distributional distances and divergences can be enacted or how costly is it to emulate them when those are the calculations that it's important to know and the most classic of all being basically prior going to posterior how much should you update",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.284,
    "end": 4077.604,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.385,
    "end": 4082.731,
    "text": "Yeah, yeah, I really like what you were just saying because I think, yeah, I'm kind of aware of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.992,
    "end": 4104.0,
    "text": "I've read, I heard a little bit about like kind of these interpretations of KL divergence as like in terms of games and like how much do you expect to kind of lose or win if you have some assumption about the distribution of a parameter that if kind of your distribution for a parameter isn't the actual distribution or something like that and how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.98,
    "end": 4108.185,
    "text": " well or badly do you do in this game based on your kind of estimate of a distribution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.766,
    "end": 4115.595,
    "text": "And I think that I really like that characterization of it because it gets it kind of a more like end to end measure of quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.195,
    "end": 4132.536,
    "text": "Because if you yeah, if you if you use some system to accelerate the computations you need to power an agent and then you want to estimate like quantify how good is your system really doing, then what people will care more about at the end of the day isn't necessarily like what's the like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.516,
    "end": 4143.038,
    "text": " What's the relative error between these two matrices or vectors, but more like how often will I make the right decision or something like that, basically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.078,
    "end": 4145.563,
    "text": "Or what's my expected reward based on decisions I make?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.864,
    "end": 4153.68,
    "text": "And so I think that, yeah, if we can somehow introduce the KL divergence on that end as well, that'll be a really nice way to kind of formulate things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.533,
    "end": 4161.806,
    "text": " How do you see these elements playing a role in systems engineering and design?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.508,
    "end": 4169.783,
    "text": "Like is it something that gets brought in like another kind of GPU or CPU?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.864,
    "end": 4175.736,
    "text": "We've talked about processing, but not really about memory or storage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.716,
    "end": 4186.536,
    "text": " So how do you see this playing a role in whether specialized inference pipelines or consumer hardware or what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.292,
    "end": 4187.612,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.153,
    "end": 4189.255,
    "text": "Yeah, that's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.295,
    "end": 4191.138,
    "text": "I think there's really two ways to look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.318,
    "end": 4197.468,
    "text": "One is like, how do the theoretical results matter in terms of the future of computing hardware?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.948,
    "end": 4201.153,
    "text": "And I think that these theoretical results can be pretty influential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.233,
    "end": 4214.093,
    "text": "I think like scaling laws, like Moore's law and stuff like that, or like how Landauer's principle informs how people think about what's the minimum amount of energy that you can achieve with the computation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.073,
    "end": 4223.248,
    "text": " And I think that there's one like impact of, you know, these theoretical results is that it kind of gives you a bar to aim for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.308,
    "end": 4239.253,
    "text": "And that if we can say like, this is the energy time trade off for Bayesian inference, you can, you can do it this fast, if you pay this much energy, but if you go a little bit slower, then you can save some energy, then that kind of sets the benchmark for like what people should hope to achieve with new hardware, whether or not they're using our",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.233,
    "end": 4246.155,
    "text": " but then there's the other kind of way of looking at it, which is just a more kind of literal level is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.844,
    "end": 4255.156,
    "text": " What's the path from these designs we presented in this paper to actually building hardware and where would that hardware go and what will it do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.476,
    "end": 4264.69,
    "text": "So I guess the exciting news kind of on that front is that, yeah, we talked a little bit about on Twitter recently how we got funding from an agency in the UK called Aria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.03,
    "end": 4270.438,
    "text": "That's like their new more or less their version of DARPA kind of that they recently created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4270.722,
    "end": 4281.813,
    "text": " and is really interested in bringing down the costs of AI, like in terms of the hardware production costs and also like the energy and time costs of training and even in inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.314,
    "end": 4286.706,
    "text": "And so they've kind of funded our project on a timeline of, you know, let's say like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.686,
    "end": 4299.884,
    "text": " where we're aiming to have hardware in the next, you know, three, four or five years, basically at kind of varying level of kind of increasing the dimension that it'll increase in the size of the problems it'll be able to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.266,
    "end": 4309.497,
    "text": "But in terms of, yeah, like where exactly that hardware will go or who will end up using it, I think that there's still like, there's still some open questions around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.198,
    "end": 4315.545,
    "text": "And more like I'm more working on, yeah, the side of like designing the algorithms and trying to figure out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.525,
    "end": 4322.082,
    "text": " you know, what error mitigation or error correction techniques we can come up with to make it work better and make it more robust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.103,
    "end": 4327.958,
    "text": "But yeah, hopefully, you know, yeah, maybe next time, you know, I'll have more detailed answer on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.998,
    "end": 4331.307,
    "text": "But I think, yeah, at the moment, it's not totally set in stone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.822,
    "end": 4336.869,
    "text": " What else do you think is out there in terms of Landauer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.929,
    "end": 4355.32,
    "text": "What bounds are you scraping up against or what big patterns of information and work and heat do you think might be out there and touched upon by this line of inquiry?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.823,
    "end": 4356.824,
    "text": " Mm-hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4356.844,
    "end": 4357.024,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.305,
    "end": 4367.517,
    "text": "So I guess one kind of historical note is that for a long time, people have focused a lot on just Landauer's principle as the fundamental bound for computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.118,
    "end": 4381.915,
    "text": "And just for the audience and people who aren't necessarily familiar, what Landauer's principle says is that to erase a bit of information, you need to dissipate an amount of heat, which is log 2 times kT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.895,
    "end": 4407.447,
    "text": " so in other words if you can run your computer at a very low temperature then you don't have to display as much information but there's still you know amount of of work that i'm sorry did dissipate heat there's still amount of energy that you have to pay that's proportional to the amount of erasure that you have to do now the issue with land hours principle one issue is that it's something that we haven't really been able to achieve um there's a nice kind of plot on one of these slides about it like showing how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.017,
    "end": 4417.687,
    "text": " while we are still getting more and more efficiency, we're still well above this thermodynamic limit, which is Landauer's bound in terms of how much energy we pay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.187,
    "end": 4425.594,
    "text": "And so I think the trend more recently is to say, well, we need to also account for time because Landauer's principle doesn't really account for time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.055,
    "end": 4429.118,
    "text": "It assumes you can do what you're doing infinitely slow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.698,
    "end": 4432.741,
    "text": "And in reality, we don't want to do computations infinitely slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.062,
    "end": 4435.324,
    "text": "And so that's kind of the angle I'm thinking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.304,
    "end": 4446.46,
    "text": " about what I'm saying, like, let's try using these results from stochastic thermo that bound the product of energy and time using the Wasserstein distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.941,
    "end": 4458.898,
    "text": "But I think that I've just kind of dipped a finger into that literature, and there's a lot of work on that stuff in terms of speed limits, especially in quantum systems, quantum speed limits and classical speed limits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.878,
    "end": 4469.861,
    "text": " And so, yeah, that's like, I guess the line, the pattern I'm most excited about is using these bounds on like the product of energy and time in terms of, you know, distance measures between distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.483,
    "end": 4472.427,
    "text": "But there may be, you know, maybe other patterns as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.547,
    "end": 4476.576,
    "text": "So definitely curious to hear if any other ideas I think come to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.977,
    "end": 4477.157,
    "text": "But yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.5,
    "end": 4492.868,
    "text": " yeah that's exciting to bring time into the equation literally and and for for real embodied systems that have existence in space and time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.742,
    "end": 4518.872,
    "text": " that their material properties and the propagation maybe even coming down to speed of sound, speed of light, deformation, velocities and these sorts of things could become dominant in terms of whether the bulldozer moves a few large",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.46,
    "end": 4535.798,
    "text": " amounts of earth with great cost or whether it's very fine grains of sand which might be very efficient but then it might take so long that for for a practical situation it doesn't really have utility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.2,
    "end": 4561.245,
    "text": " yeah yeah absolutely and i think like one the one reason i'm i'm really excited about yeah as you put it like bringing time into the equation is kind of at a higher level like big picture i think that where things are going in terms of the theory is like some kind of unification between like computational complexity theory and stochastic thermo because like we've we've been approaching some of the same problems of like yeah how fundamentally",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.225,
    "end": 4568.644,
    "text": " Does your resource costs of energy and time scale with the size of a system as it scales?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.487,
    "end": 4574.72,
    "text": "But so far, we haven't, I think, fully broken through to see the shape that connection takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.302,
    "end": 4576.585,
    "text": "And yeah, the approach that I'm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.565,
    "end": 4580.675,
    "text": " that I kind of take to that is like, first go for the low hanging fruit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.815,
    "end": 4584.805,
    "text": "Like not, you know, we're not necessarily going to see it all at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.865,
    "end": 4588.815,
    "text": "Like what is this relationship between stochastic thermo and complexity theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.236,
    "end": 4594.168,
    "text": "But the more we can like build up these little results of like, well, you can,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.57,
    "end": 4608.384,
    "text": " by building, constructing kind of a thermodynamic system that you're going to change the parameters, do work on and see it as this kind of heat engine or refrigerator, you can achieve a certain computational complexity of this operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.724,
    "end": 4615.411,
    "text": "I think these smaller results are helping to bring those two fields a little closer together, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.891,
    "end": 4616.031,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.293,
    "end": 4617.953,
    "text": "Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.113,
    "end": 4620.696,
    "text": "Also with time, it's almost like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.553,
    "end": 4650.261,
    "text": " it's like with a body there's a baseline a basal metabolic rate and then exercise is doing extra activity on top of that so it's like if you have to pay the upkeep on the energy of the circuit even if it only is using a little bit of extra activity to do the target computation you're still paying for a large block of time the baseline level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.017,
    "end": 4666.479,
    "text": " And so when we get to the thermal limit, then the baseline is free because it's happening at an ambient temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.499,
    "end": 4673.228,
    "text": "So it's not needing to be powered to give some of the sampling dynamics in the same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.815,
    "end": 4696.6,
    "text": " the the the informative sampling and that's the part that that I think there's still so much learning and and interest in how how do these higher moments arise with with no extra work that seems like good information and yet it's falling out of what seems to be powered just from thermal vibration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.672,
    "end": 4703.441,
    "text": " Yeah, no, I definitely think about it in those terms as in like, what are the sources?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.461,
    "end": 4711.918,
    "text": "Like fundamentally, the sources of energy we have, energy takes the form of work or heat and heat is like cheap and work is expensive, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.938,
    "end": 4716.307,
    "text": "Because heat just kind of comes from a reservoir, come from anywhere and it's not organized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.387,
    "end": 4718.892,
    "text": "And yeah, in work, you have to you have to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4718.872,
    "end": 4730.097,
    "text": " go to some trouble to actually get a source of work so yeah i definitely think about like that like how can we optimize the computation so that more of the energy comes from heat as opposed to work basically but yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.051,
    "end": 4757.856,
    "text": " yes i think that's that's exactly it having having something rather than needing to add energy from the wall so that the energy gets pushed through a system does some computation and dissipates the extras heat it's almost like there's another avenue where the heat in the room",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.836,
    "end": 4786.358,
    "text": " vibrates the system to functionally implement that computation or cognitive process it's it's all about arbitraging he and work in new ways and seeing bayesian updating and equilibrium and far from equilibrium processes as happening as sort of a first principle of intelligent matter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.405,
    "end": 4809.139,
    "text": " yeah yeah yeah i think it's really cool really cool way to see it actually yeah absolutely um yeah and i guess yeah one one other thing i'll say i guess that i was thinking is um in terms of yeah like like how where where do we look for kind of fundamental constraints on computation in terms of the resource costs i think that a lot of people some some people have taken the view that like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.119,
    "end": 4814.584,
    "text": " really the Landauer's Principle is kind of what is the most fundamental thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.624,
    "end": 4818.828,
    "text": "And then the reason we aren't achieving it is just kind of practical considerations on some level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.168,
    "end": 4820.549,
    "text": "It's just that it's hard to engineer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.969,
    "end": 4827.015,
    "text": "But yeah, my outlook is more that like, well, maybe there's a fundamental reason that it is hard to engineer something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.395,
    "end": 4838.485,
    "text": "Maybe there's a fundamental trade-off that we just haven't discovered yet that if we knew about would actually very well explain why we're still a thousand or three or four orders of magnitude above Landauer's Principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.465,
    "end": 4842.051,
    "text": " So yeah, I'm hoping that maybe just considering time will get us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.412,
    "end": 4844.936,
    "text": "If not, then yeah, there's more to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.097,
    "end": 4847.902,
    "text": "But yeah, who knows, I guess, at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.745,
    "end": 4850.085,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4850.586,
    "end": 4856.136,
    "text": "Do you have any final riddles or thoughts or comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.314,
    "end": 4883.76,
    "text": " um yeah i can't think of anything else yeah i think this is i think i really covered everything that yeah i was hoping to get across i think so far it's been really good uh it's been really great um but uh yeah if there's any any questions from the audience we of course be happy to take those yeah okay no specific questions this was very informative max i think it's it's uh been a topic coming up again and again with these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.858,
    "end": 4906.845,
    "text": " not just similarities and differences and analogies but implementations of information geometries and information processes on embodiments on physical embodiments biological designed and all of this and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.197,
    "end": 4915.134,
    "text": " It certainly feels like there's a lot of threads swimming around and exciting opportunities for synthesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.235,
    "end": 4921.408,
    "text": "So thank you for this exciting research and the empirical connections and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.912,
    "end": 4922.493,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.553,
    "end": 4923.254,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.855,
    "end": 4939.217,
    "text": "And yeah, as I mentioned earlier, when we first started out on this research, we definitely had no idea or didn't anticipate at all that it would lead us to these things that can be interpreted in terms of active inference and connections to that and free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.317,
    "end": 4951.395,
    "text": "But yeah, it's just been really exciting for me to be working on something that I think is both a practical approach to improving our landscape of hardware for AI, but also has these interesting and deep thermodynamic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.375,
    "end": 4970.43,
    "text": " interpretations so yeah definitely i'm happy to come back anytime and chat more i thought this was really really fun cool let's check back in a couple months in a couple in a couple trillion oscillations of the cesium as they say all right thank you max farewell yeah bye have a good one",
    "speaker": "SPEAKER_01"
  }
]