[
  {
    "start": 4.537,
    "end": 5.218,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.799,
    "end": 7.081,
    "text": "And we're away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.461,
    "end": 7.722,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.162,
    "end": 16.315,
    "text": "So welcome everybody to the first episode of Active Inference Insights, brought to you by the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.936,
    "end": 31.017,
    "text": "I am your host, Darius Parvizi-Wayne, and today I have the privilege of speaking to Professor Carl Friston, one of the most revolutionary thinkers in the fields of neuroscience, cognitive science, theoretical biology, and dare I say, physics and philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.25,
    "end": 38.707,
    "text": " A leading authority in neuroimaging, he is the inventor of statistical parametric modeling and voxel-based morphometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.847,
    "end": 39.849,
    "text": "I hope I pronounced that correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.511,
    "end": 49.09,
    "text": "More recently, he has posited the free energy principle, which is technically a normative account of self-organization in terms of optimal Bayesian design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.12,
    "end": 52.945,
    "text": " or in other words, a description of how things continue to be things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.866,
    "end": 61.516,
    "text": "As such, his groundbreaking ideas hold profound implications, not only for biology and psychology, but also the very nature of reality itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.237,
    "end": 66.543,
    "text": "Ladies and gentlemen, it is my honor to introduce Professor Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.843,
    "end": 68.766,
    "text": "Professor Friston, thank you so much for joining us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.387,
    "end": 70.089,
    "text": " Well, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.249,
    "end": 72.273,
    "text": "Thank you for that lovely introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.755,
    "end": 76.303,
    "text": "What you can say is I just invented lots of three-letter acronyms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.363,
    "end": 78.748,
    "text": "That's much simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.768,
    "end": 79.39,
    "text": "So you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.191,
    "end": 84.802,
    "text": "And I sense a lot of three-letter acronyms have also spawned from a lot of your work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.267,
    "end": 87.708,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.829,
    "end": 88.51,
    "text": "Well...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.827,
    "end": 90.751,
    "text": " this podcast, this is the first episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.771,
    "end": 95.322,
    "text": "So as I was saying, sort of off camera, this is very exciting for me, hopefully very exciting for everyone tuning in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.382,
    "end": 106.988,
    "text": "The kind of the reason why it's come about is that we wanted the Active Inference Institute wanted a way to introduce the ideas of active inference, and the free energy principle, perhaps to an audience who were not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.238,
    "end": 118.732,
    "text": " PhD holders, scholars in the area, but had a kind of latent interest in psychology, neuroscience, maths, biology, whatever it is, and wanted to explore these ideas a little bit further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.132,
    "end": 123.998,
    "text": "So it's a non-specialized introduction to the ideas of active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.178,
    "end": 133.87,
    "text": "And as the author, inventor, discoverer of the free energy principle, we can have an interesting philosophical conversation about what that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.85,
    "end": 135.933,
    "text": " it's it's an absolute delight to have you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.153,
    "end": 150.653,
    "text": "So I guess my first question that I need to ask for everyone listening is, could you give us a very brief, or not very brief, but a very accessible definition of the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.934,
    "end": 152.856,
    "text": "What free energy is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.916,
    "end": 159.064,
    "text": "And how you know what this what this principle says about reality and ourselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.204,
    "end": 163.709,
    "text": " Yes, I'm not very good at giving brief answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.493,
    "end": 170.304,
    "text": "We have a while, so go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.925,
    "end": 179.905,
    "text": "So just to put things in context, the free energy principle is a principle as read by a physicist or engineer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.105,
    "end": 181.288,
    "text": "That means it's a method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.555,
    "end": 186.341,
    "text": " much like Hamilton's principle of least action that you can apply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.361,
    "end": 193.33,
    "text": "So one might ask, what are the most important applications of the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.591,
    "end": 195.994,
    "text": "I guess that would be active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.014,
    "end": 208.39,
    "text": "So I will answer your question and I will say what the free energy principle is, but that may have to be qualified by looking specifically at the application, which is active inference and what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.994,
    "end": 213.781,
    "text": " theologically, heuristically, what it brings to the table when you do apply the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.262,
    "end": 229.686,
    "text": "But the free energy principle itself is just a description of things that persist or exist, and it rests upon a careful specification of what you mean by a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.666,
    "end": 239.285,
    "text": " It starts with exactly the same assumptions that all of physics starts with, basically a random dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.746,
    "end": 244.435,
    "text": "Some people describe that in terms of stochastic differential equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.796,
    "end": 247.962,
    "text": "If you're not familiar with that kind of description, it's just saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.33,
    "end": 255.504,
    "text": " that you can describe the universe in terms of the way that states change as a function of themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.684,
    "end": 269.41,
    "text": "So it's a very generic description of any given universe that just commits to the notion that there is a state of the universe and it could be very high dimensional and that it has some dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.609,
    "end": 271.411,
    "text": " That's where the free energy principle starts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.451,
    "end": 294.696,
    "text": "But the special thing about the free energy principle that distinguishes it from other formulations in physics, for example, quantum, thermodynamics, statistical and classical mechanics, all of which can be, if you like, derived from this basic description of the world as a random dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.577,
    "end": 298.941,
    "text": "The thing that separates the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.225,
    "end": 323.089,
    "text": " um or gives it its particular flavor is a careful distinction between the states of something and everything else and the way that we do that is by inducing a separation you know technically a partition of all possible states into three kinds the states of something that are internal to the thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.508,
    "end": 342.708,
    "text": " everything else external to the thing and then crucially a set of states that separate the internal from the external states that allow and couple the inside to the outside and that's referred to as the blanket states or a Markov blanket or boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.909,
    "end": 350.055,
    "text": "So a lot of this rests upon this notion of a boundary that on the one hand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.626,
    "end": 358.141,
    "text": " separates the inside from the outside of something, and by a thing I mean anything from a small particle to a priest or a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.662,
    "end": 366.357,
    "text": "Anything that can be individuated and possesses characteristic states constitutes something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.742,
    "end": 374.891,
    "text": " And with tongue in cheek, you therefore have a theory of every space thing, not everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.374,
    "end": 391.99,
    "text": "So this Markov boundary or Markov blanket is a sort of crucial device in the sense that it allows you to individuate something from everything else, but at the same time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.97,
    "end": 396.641,
    "text": " it couples the internal to the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.183,
    "end": 404.34,
    "text": "So we're now talking about a special kind of physics, and probably a more ubiquitous kind of physics, which is the physics of open systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.343,
    "end": 409.894,
    "text": "Because the inside is now vicariously open to, in exchange with,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.874,
    "end": 412.677,
    "text": " the outside across the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.097,
    "end": 426.59,
    "text": "And just for interest, because this will be relevant later on for active inference, we usually divide the blanket states into active and sensory states that can be regarded very simply as the inputs and the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.391,
    "end": 439.662,
    "text": "Technically, the inputs of the sensory states are defined in the sense that the internal states don't influence the sensory states and conversely,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.642,
    "end": 445.073,
    "text": " the active states are defined such that the external states don't influence the active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.716,
    "end": 457.899,
    "text": "But more simply, what we're saying is that something can be defined in terms of the influences upon it and the influences that it exerts through the blanket states on the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.38,
    "end": 461.025,
    "text": "So just given that assumption,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.005,
    "end": 478.263,
    "text": " that entails existence in the sense that to define this Markov blanket, you need for the system to have some characteristic states, technically an attracting set of states that you'd find the thing in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.024,
    "end": 488.734,
    "text": "Just by assuming the existence of this attracting set of this random dynamical system that possesses this distinction between the inside and the outside,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.068,
    "end": 507.415,
    "text": " everything else follows and everything else simply put is you can read the internal and active states sometimes referred to as the autonomous states of a particle or a priest or a person as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.395,
    "end": 521.114,
    "text": " Either, if you're a physicist, conforming to a particular principle of least action, and that principle of least action is that it minimizes the path integral of the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.134,
    "end": 536.895,
    "text": "If you want to think of this more intuitively, because that free energy also stands in for, or is an approximation to, a bound upon model evidence, you can also say that it must be the case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.875,
    "end": 557.629,
    "text": " that the autonomous states of anything will look as if they are trying to maximize the evidence for what we would now consider the internal states to be a model of what's going on on the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.39,
    "end": 563.659,
    "text": "Some people refer to that as self-evidencing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.365,
    "end": 588.685,
    "text": " So if I just repeat that from the physicist's point of view, given the assumption that you've got this random dynamical system with an attracting set that has this partition that allows you to individuate something within this system, it has to be the case that the dynamics of the autonomous states of that system perform a gradient flow on a quantity called variation-free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.61,
    "end": 590.151,
    "text": " That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.672,
    "end": 591.433,
    "text": "Is that interesting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.653,
    "end": 605.997,
    "text": "Well, it becomes interesting if you realize that this variation of free energy has a particular meaning and a particular interpretation that gives you a teleology for this kind of dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.718,
    "end": 609.683,
    "text": "And that teleology is often referred to in terms of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.104,
    "end": 610.364,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.725,
    "end": 615.853,
    "text": "Well, because the free energy, the variation of free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.272,
    "end": 643.647,
    "text": " is the same quantity that measures the evidence for a generative model of the causes of some data if you're a statistician and in this instance the data that we're talking about are the impressions of the outside state on the on the markov blanket so what you're now in a position where you are now in a position you are now licensed to talk about anything that exists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.627,
    "end": 653.766,
    "text": " in some simple elemental sense, performing inference and possessing this, or evincing this kind of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.387,
    "end": 660.919,
    "text": "And in philosophy, people like Jacob Howey nicely summarizes as self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.939,
    "end": 664.926,
    "text": "So you can imagine that it looks as if anything that exists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.176,
    "end": 675.531,
    "text": " is basically moving in a way, sensing and acting upon its world in a way that's garnering evidence for its own existence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.232,
    "end": 683.623,
    "text": "So this is, if you like, a slight cheat in the sense of what we're doing is describing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.603,
    "end": 712.935,
    "text": " the dynamics of something that exists and then we're saying but it now looks as if in virtue of its existence it is now it can be described theologically as acting to gather evidence for its own existence its own its own structure and that structure entails a generative model of what's going on on the outside so how does that help well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.569,
    "end": 732.93,
    "text": " It doesn't really help in any fundamental way other than it's very pretty and it's nice to talk about Bayesian mechanics as being a sort of complement or another kind of physics that comes from the same stable as quantum mechanics and statistical mechanics and I repeat classical or Lagrangian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 733.991,
    "end": 738.636,
    "text": "However, there is a nice application at hand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.818,
    "end": 760.118,
    "text": " once you realize that this uh once you interpret um the variation free energy in terms of a um technically a a the logarithm of some modern heavens what that means is that you can now build things you can build things and you can simulate those things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.435,
    "end": 760.996,
    "text": " Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.036,
    "end": 767.925,
    "text": "Well, because you know that their dynamics must be conforming to this principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.666,
    "end": 783.945,
    "text": "Another way of thinking about this is that it does a gradient descent or a hill climbing on a particular functional, which is this variation of free energy or the negative variation of free energy, which is the log evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.347,
    "end": 810.925,
    "text": " So because this log evidence is a function of a model that just is a description of the characteristic states things occupy or things are found in, you can now write down the generative model, which is just a probability distribution over the characteristic states or defining the characteristic states you want your thing to be attracted to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.965,
    "end": 812.768,
    "text": "This is the attracting set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.389,
    "end": 822.939,
    "text": " And once you've written down your generative model, you can then work out the gradients of the free energy functional of that generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.659,
    "end": 831.588,
    "text": "And then you can simply integrate or mathematically solve for the dynamics, the flow, the motion, the movement of this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.068,
    "end": 838.975,
    "text": "So I know this isn't terribly accessible, but it's the way I think of these things that you are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.123,
    "end": 848.773,
    "text": " Now in a position, instead of just looking at something and saying, oh, I wonder what generative model would be fit for purpose to describe this particular thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.555,
    "end": 852.424,
    "text": "You can now turn that on its head and say, okay,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.995,
    "end": 858.081,
    "text": " I want this kind of thing, and I'm going to describe and define this kind of thing with a particular generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.141,
    "end": 871.697,
    "text": "I just have to write down the probability distribution over the causes and consequences from the point of view of the thing in question, namely the external states and its impressions upon the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.257,
    "end": 877.684,
    "text": "And once I've written that down, I can now simulate the autonomous states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.804,
    "end": 881.348,
    "text": "I can now create a little autonomous artifact, a little autonomous particle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.716,
    "end": 905.091,
    "text": " that behaves in exactly the same way as something that existed that had that kind of generative model so it's a very practical if you like um it's a principle that can be applied in a very practical way to simulate things and if you can then simulate things you can start to build things you can start to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.353,
    "end": 935.905,
    "text": " do computational neuroscience you can start to sort of naturalize cognitive neuroscience and possibly even sort of psychology in terms of the physics that is inherent in this basic mechanics that comes from the free energy principle and you can also start to ask questions about the beliefs of another person why well part of this generative model or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.914,
    "end": 950.672,
    "text": " The generative model can always be sort of split into two things, sort of priors before you see some data and the likelihood, the likelihood of that data given the causes of that data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.033,
    "end": 952.435,
    "text": "This would be the external state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.495,
    "end": 962.989,
    "text": "So you have prior belief over the causes, the external states, and you have a likelihood that maps the causes to the consequences, which are your observations, your sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 963.425,
    "end": 976.388,
    "text": " And therefore, you can now fiddle with, say, a synthetic subject or person who is being simulated in the computer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.874,
    "end": 1000.3,
    "text": " until their behavior their actions possibly their decisions matches that of any given cohort or any given subject or animal and then having adjusted the priors part of the generative model and possibly the likelihood you've now basically created a digital twin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.022,
    "end": 1023.84,
    "text": " that emulates the same kind of belief updating the same kind of basic mechanics that you can now infer is possessed by the thing in question so this is a um sort of quite a high-end application which which is um you know one of the the um the motivations for um for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.82,
    "end": 1052.427,
    "text": " developing the free energy principle and active influences and application that enables you to essentially phenotype another thing another person for example in terms of this belief updating in terms of this basing mechanics and that can be quite useful in context when you want to understand how people work and particularly how their belief updating works this becomes particularly interesting in the context of computational psychiatry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.761,
    "end": 1059.855,
    "text": " where you want to be able to explain people's behavior in terms of what do they believe about the world out there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.396,
    "end": 1063.242,
    "text": "How are they sense-making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.723,
    "end": 1069.234,
    "text": "How are they assimilating evidence for their world model, which you can read as the geriatric model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.535,
    "end": 1079.591,
    "text": " and under what priors are they doing this sort of Bayesian assimilation or evidence accumulation that underwrites their decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.112,
    "end": 1083.678,
    "text": "So that's one particular application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.818,
    "end": 1087.324,
    "text": "There'll be other applications if you want to make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.304,
    "end": 1112.733,
    "text": " intelligent artifacts or you want to understand the mechanisms of belief updating at different temporal scales, belief sharing between two things that are in communication or transacting across their shared Markov blanket or indeed looking at a shared world and then one can start to get into the world of distributed cognition and federated inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.753,
    "end": 1117.058,
    "text": "There are all sorts of things you can do once you start to apply active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.455,
    "end": 1121.739,
    "text": " Yeah, that was fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.94,
    "end": 1130.391,
    "text": "I mean, we have a lot to get our teeth into and probably some concepts there that are new to our audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.431,
    "end": 1142.286,
    "text": "So it might be worth sort of backtracking certain things and trying to find a kind of let's sort of dissect some of these concepts together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.295,
    "end": 1157.268,
    "text": " The first thing I want to speak about is this notion that the internal states in some sense embody the kind of desirable model given their attractor state, the desirable model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.989,
    "end": 1169.32,
    "text": "I think one of the questions that one has when one enters into the world of active inference is whether an organism is a model or whether an organism has a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.485,
    "end": 1181.385,
    "text": " And here we sort of have a backtrack to cybernetics and the good regulator theorem that all good regulatory systems have a model of their environment if we think about thermostats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.669,
    "end": 1182.931,
    "text": " anything alike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.451,
    "end": 1193.544,
    "text": "So maybe it's worth unpacking that because I think a lot of people might have this intuitive sense that there's a homunculus in the brain, which has a model of the world and it's very internalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.345,
    "end": 1206.36,
    "text": "But maybe from a more physics perspective, we can adopt a more externalist position where there isn't this little thing which has a sort of representative picture of the world, but actually is just enacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.34,
    "end": 1215.212,
    "text": " some model of itself, which in many ways is just some version of its external dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.494,
    "end": 1223.503,
    "text": "So let's start there, because I think that will feed nicely into maybe a conversation about internal and external dynamics and exactly what that looks like in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.785,
    "end": 1226.467,
    "text": "Yeah, that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.667,
    "end": 1230.112,
    "text": "And some deep issues unearthed by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.352,
    "end": 1235.419,
    "text": "And it's nice you've introduced cybernetics, the notion of the good regulator theorem, because in one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.31,
    "end": 1244.188,
    "text": " On one view, I think you can look at the free energy principle as just a 21st century version of that kind of cybernetic thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.349,
    "end": 1254.572,
    "text": "There are other things that the free energy principle inherits from James's maximum principle, lots of ideas in psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.907,
    "end": 1256.449,
    "text": " perception as hypothesis testing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.469,
    "end": 1267.603,
    "text": "There are lots of different roads that converge upon this formulation that is on offer in terms of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.504,
    "end": 1271.048,
    "text": "But that particular question is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.768,
    "end": 1280.6,
    "text": "I have to say that I usually try to elude that question by saying that the internal states entail a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.082,
    "end": 1283.243,
    "text": "However, I am",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.493,
    "end": 1297.083,
    "text": " If one was pressed upon it, then I would say very clearly that the internal states, the thing is a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.464,
    "end": 1299.949,
    "text": "It's not, if you like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.929,
    "end": 1308.39,
    "text": " a picture that you painted in terms of that homunculus looking at its virtual reality inside its head and trying to predict what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.091,
    "end": 1313.983,
    "text": "It is instantiated, it is realized in its physics, in its existence, in its dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.206,
    "end": 1317.111,
    "text": "The reason I use the word entailed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.496,
    "end": 1324.846,
    "text": " is that the generative model is technically just a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.108,
    "end": 1332.937,
    "text": "So you ask yourself, well, does a probability distribution exist in some physical sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.538,
    "end": 1335.12,
    "text": "And the answer is, well, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1335.701,
    "end": 1337.684,
    "text": "A probability distribution is what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.844,
    "end": 1340.027,
    "text": "It's a mathematical description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.007,
    "end": 1348.117,
    "text": " However, that probability distribution will have sufficient statistics that could exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.618,
    "end": 1353.143,
    "text": "So what I'm saying is that, for example, let's take a Gaussian distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.024,
    "end": 1364.697,
    "text": "I can express mathematically, I can write down the notation for a Gaussian, a bell-shaped distribution over some variable that goes from plus to minus infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.299,
    "end": 1369.423,
    "text": "Or I can say, I can characterize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.775,
    "end": 1388.357,
    "text": " or specify this Gaussian distribution in terms of its mean and its variance and those are two numbers that are not random variables they are sufficient statistics and it may be and in fact it is the case that the free energy principle associates the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.337,
    "end": 1402.498,
    "text": " physical internal states with the sufficient statistics of these Bayesian beliefs and there's a lovely story you know in mathematics that would take you down the path of information geometries and statistical manifolds and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.934,
    "end": 1412.328,
    "text": " belief updatings as movements in these geometries and trying to understand the metrics in these spaces and how that relates to uncertainty and precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.909,
    "end": 1414.712,
    "text": "That's a lovely story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.654,
    "end": 1419.88,
    "text": "We don't need to really pursue that at the moment, but the key point being made here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.079,
    "end": 1431.32,
    "text": " The generative model is not physically instantiated other than in terms of some sufficient statistics in any setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.241,
    "end": 1443.522,
    "text": "However, in the free energy principle, the generative model is in and of itself never actually instantiated in terms or realized in terms of its",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.788,
    "end": 1445.711,
    "text": " sufficient statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.731,
    "end": 1449.237,
    "text": "And that's because of something that we were talking about before, which is the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.738,
    "end": 1458.032,
    "text": "So the dynamics is a gradient flow, which means that all we need are the gradients of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.734,
    "end": 1460.717,
    "text": "So we don't need the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.697,
    "end": 1469.738,
    "text": " All we need is the gradients of this free energy function, or technically a function of a function of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.399,
    "end": 1478.959,
    "text": "So if I was building an artifact, I could certainly prescribe the right dynamics by writing down a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.479,
    "end": 1488.148,
    "text": " And then I could evaluate the gradients of that free energy function of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.708,
    "end": 1491.051,
    "text": "And then those gradients would actually drive the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.151,
    "end": 1493.073,
    "text": "I could simulate self-organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.193,
    "end": 1494.374,
    "text": "I could simulate active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.434,
    "end": 1497.497,
    "text": "I could simulate belief sharing, whatever I wanted to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.299,
    "end": 1504.845,
    "text": "But in that simulation, all I really needed were the gradients of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.825,
    "end": 1512.258,
    "text": " And we only need the generative model because the free energy is a function of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.939,
    "end": 1525.5,
    "text": "So in that sense, the generative model is really a teleological description that you would bring to the table to understand your sense-making of another thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.48,
    "end": 1529.466,
    "text": " The thing in and of itself just needs the free energy gradients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.566,
    "end": 1542.187,
    "text": "It just needs to self-evidence by moving in the direction of maximizing, on average, the log evidence for some abstraction, which is a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.188,
    "end": 1546.273,
    "text": "But it doesn't need to know that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.253,
    "end": 1548.396,
    "text": " just so we don't confuse people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.637,
    "end": 1573.273,
    "text": "So moving up those log evidence gradients very much like paradoxically moving up concentration gradients to sort of clump together to keep in this attracting set and to resist the dispersion of the random fluctuations inherent in these random dynamical systems is just the same as moving down the negative log evidence, which is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.979,
    "end": 1593.439,
    "text": " the uh the free energy itself it's it's it's it's the same thing so what does that mean well it um what it means is that the germative model is something that you bring to the table to endow the behavior of this thing with an explainable teleology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.655,
    "end": 1617.756,
    "text": " um of the kind it looks as if this thing is acting in a way to maximize the evidence or gather the evidence for its generative model and this is what i think its generative model is but notice the thinking of itself doesn't go through this process um it could of course so if i and now people things like you and me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.175,
    "end": 1633.962,
    "text": " we do have a model, and we communicate it and we talk about it, but most things would not possess that deep structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1634.222,
    "end": 1643.338,
    "text": "So you can invoke homunculi, you can invoke self-modelling, you can invoke",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.858,
    "end": 1663.779,
    "text": " the kind of, not homunculus in the sense that you would normally end up with an infinite regress, but the kind of metacognitive aspect that comes from any deeply structured hierarchical generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.281,
    "end": 1669.866,
    "text": "You can get that sort of homunculus-like detachment and metacognitive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.846,
    "end": 1671.171,
    "text": " perspective on things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.472,
    "end": 1677.917,
    "text": "But strictly speaking, the generative model is only entailed by the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.781,
    "end": 1680.126,
    "text": "And I should say that, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.646,
    "end": 1700.02,
    "text": " This is probably best to think about applications of the free energy principle as being limited to simulating and modeling and understanding other things as opposed to oneself, unless one's doing a lot of self-modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.403,
    "end": 1705.59,
    "text": "So in that sense, you are ascribing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.57,
    "end": 1714.924,
    "text": " a teleology, a purpose, that would explain the behavior of something that you're observing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.564,
    "end": 1725.939,
    "text": "But notice, because you are observing it from its point of view, you are an external state, and from your point of view, all you can see is the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.22,
    "end": 1728.884,
    "text": "You cannot see what's going on on the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.625,
    "end": 1734.632,
    "text": "So it would be mathematically impossible for you to ever know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.068,
    "end": 1750.576,
    "text": " whether what's going on on the inside is indeed describable as even a gradient flow on a free energy functional, let alone did it have its own internal model, did it have its own beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.056,
    "end": 1755.304,
    "text": "It just looks like that from your point of view, because you'll never ever know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.077,
    "end": 1766.374,
    "text": " By definition, if you knew, then you would, by definition, have breached the Markov blanket and that thing would cease to exist as the kind of thing that it was before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.394,
    "end": 1774.828,
    "text": "I mean, it may sound obvious or it may sound trivial, but I don't think it is if you just look at people like me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.808,
    "end": 1802.773,
    "text": " who spend our entire lives trying to peer through the Markov blanket using brain imaging, for example, or people doing comparative anatomy by dissecting dead things or by inventing new techniques to try and get, you can never get beneath the Markov blanket, but you can certainly sort of have certain perspectives on the Markov blanket that are closer and closer to the internal space, but you can never actually get in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.074,
    "end": 1806.417,
    "text": " I imagine a whole philosophy on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.877,
    "end": 1813.023,
    "text": "You couldn't see your own visual processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.704,
    "end": 1816.726,
    "text": "You couldn't hear your own cochlear dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.248,
    "end": 1830.499,
    "text": "You can't ever have access to the inside very much in the spirit that internalists would say you can never have direct access to the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.614,
    "end": 1841.367,
    "text": " So I think that also applies to these stories about generative models and the Bayesian mechanic interpretation that comes along with the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.684,
    "end": 1842.765,
    "text": " Does that help in some way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.126,
    "end": 1844.207,
    "text": "It's a little bit subtle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.468,
    "end": 1850.877,
    "text": "And I can just imagine a lot of my friends tearing their hair out because they have very particular views about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.377,
    "end": 1854.221,
    "text": "Some people think it's a model of a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.281,
    "end": 1856.504,
    "text": "Some people think it's taken very internally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.544,
    "end": 1858.006,
    "text": "Some people are externalists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1858.347,
    "end": 1863.955,
    "text": "But mathematically, it's not the model which drives us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.216,
    "end": 1867.439,
    "text": "It is the dynamics which drives us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.499,
    "end": 1869.362,
    "text": "And that dynamics can be interpreted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.342,
    "end": 1872.113,
    "text": " in relation to a generative model, should you want to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.207,
    "end": 1873.768,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.848,
    "end": 1877.291,
    "text": "Well, I'm going to follow that philosophical line of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.272,
    "end": 1902.133,
    "text": "And what I want to ask is, this is an interesting point that the notion that we can get to a closer approximation of what the internal states of ourselves are, for example, but it's always going to be an approximation because piercing the Markov blanket would constitute self disintegration under the under the rules of all the principle for energy principle per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.092,
    "end": 1917.492,
    "text": " How, in a sense, therefore, do we know, or how much can we even make the claim, therefore, that there is such a thing as an external dynamic that goes beyond anything, goes beyond our sensory inputs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.014,
    "end": 1932.913,
    "text": "It may seem like a deeply non-scientific question, but the way you were speaking, I couldn't help but think of people like George Berkeley and even Kant and this phenomenal noumenal distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.231,
    "end": 1954.041,
    "text": " If we don't ever have direct access to so-called external dynamics, because that is part and parcel of the physical game that we're in, why can't we just say that there are no hidden states and all we get are probability distributions over sensory appearances, but we don't need something like a likelihood mapping to something that's latent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.704,
    "end": 1986.323,
    "text": " um well you you you could say that and a lot of my friends do say that um and i think in the sense that um the the notion of direct access means that um you will never know in some sort of heuristic sense um what the external states are if they exist at all and um on the other hand you could also argue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.303,
    "end": 1995.88,
    "text": " that there is profound access and existentially meaningful access to the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.98,
    "end": 2002.933,
    "text": "It's just organized in such a way that it has to be transacted by the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.674,
    "end": 2010.927,
    "text": "I haven't had this conversation for several years",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.907,
    "end": 2017.994,
    "text": " I used to have lots of pat answers, depending on who I was talking to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.074,
    "end": 2026.102,
    "text": "But the way that you phrased the question, which was very clever, just made me think, well, what is the internalist argument?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.163,
    "end": 2035.252,
    "text": "Does it mean that because I don't have direct access, that the external states don't directly influence me, that means that they don't exist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.034,
    "end": 2040.357,
    "text": "Is that the argument that an internalist would make?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.522,
    "end": 2057.535,
    "text": " Well, might it be the case that we don't need to invoke a kind of further realm, a further causal realm, an underlying ontological realm, if all we have are just the streams of sensory input and seemingly some regularities, some patterned regularities in them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.515,
    "end": 2064.651,
    "text": " Why, at least in terms of doing the Bayesian modeling, do we need to invoke a hidden state, an underlying cause?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.653,
    "end": 2075.355,
    "text": "For example, if we just take that, if we look at the low road to active inference, we talk about how human, we talk about how cognitive creatures like ourselves predict the world, let's say a very simple level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.23,
    "end": 2086.807,
    "text": " A question that I've always had is why does the claims of predictive processing or predictive coding more generally, why does it make claims about hidden states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.227,
    "end": 2091.334,
    "text": "Why doesn't it make claims just about regularities within streams of appearances?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.075,
    "end": 2093.597,
    "text": "That's the way that I would pose that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.701,
    "end": 2096.021,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.148,
    "end": 2103.553,
    "text": "I'm just mindful you've introduced predictive coding and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.55,
    "end": 2117.179,
    "text": " Just for those people who may not know the intimate relationship between all these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.219,
    "end": 2122.284,
    "text": "So another way of looking at free energy is the amount of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.304,
    "end": 2134.755,
    "text": "And more specifically, if you're talking to some people, it would be the total amount of precision weighted prediction error, which means that there's another reading of minimizing free energy, which is not the maximizing the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.735,
    "end": 2146.172,
    "text": " model evidence, but minimizing surprise where surprise is the implausibility of some sensory data given your model of that data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.713,
    "end": 2154.364,
    "text": "So in exactly the same way that if I go around gathering data that I find continuously surprising,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.344,
    "end": 2172.133,
    "text": " then that's basically evidence I haven't got the right kind of model to be to be able to explain ie predict those those data so again we have one of these sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.113,
    "end": 2191.877,
    "text": " completely equivalent descriptions but you know they have very different flavors that to maximize model evidence is to minimize surprise which is to minimize a prediction error which is to maximize predictability which is to minimize variation free energy and so and so forth they're all the same they're all the same thing so when you're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.857,
    "end": 2203.822,
    "text": " productive coding as a particular algorithm for minimizing free energy, technically a variational scheme, which is known in engineering as a Kalman filter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.644,
    "end": 2207.149,
    "text": "What you're saying is I'm making certain assumptions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.129,
    "end": 2213.622,
    "text": " about my generative model that means I can write down these free energy gradients as prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.642,
    "end": 2223.18,
    "text": "So literally the prediction error, my apologies, the precision weighted prediction error literally is mathematically exactly the gradient that we were talking about before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.16,
    "end": 2226.347,
    "text": " So just to join the dots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.349,
    "end": 2237.811,
    "text": "So to answer your question, why is it that I need to invoke latent states in order to make sense of data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.263,
    "end": 2246.937,
    "text": " I would argue that the sense-making is just explaining data in terms of latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.899,
    "end": 2253.808,
    "text": "Those latent states are often referred to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.788,
    "end": 2256.613,
    "text": " in the technical literature as hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.673,
    "end": 2257.494,
    "text": "And what do you mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.534,
    "end": 2263.063,
    "text": "Well, it just means they're unobservable from the point of view of the phoenix, but they are hidden behind the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.684,
    "end": 2276.185,
    "text": "So I would say that detecting patterns simply is invoking latent states that organize and structure those patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2276.165,
    "end": 2279.489,
    "text": " I don't think there's anything magical about latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.569,
    "end": 2290.162,
    "text": "So the latent states that are, if you like, entertained by your internal dynamics and your sense-making are not the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.223,
    "end": 2304.619,
    "text": "They are descriptions that are only relevant to the generative model that you need in order to define the prediction errors or the free energy gradients in order to simulate or describe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.599,
    "end": 2311.128,
    "text": " your sense making in terms of your neuronal dynamics or your internal dynamics or the operations of say a thermostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.829,
    "end": 2312.87,
    "text": "But there's a twist here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.112,
    "end": 2317.757,
    "text": "There's a reason it's called active inference because it's got a big active at the front.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.878,
    "end": 2325.527,
    "text": "So it's not good enough just to say, oh, I can understand psychology just as making lots of sense of my sensory impressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.216,
    "end": 2347.334,
    "text": " That's not good enough because you are coupled to the world reciprocally, which means that you actually are not only are you exposed to the world, but the world is exposed to you in an exactly symmetrical way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.374,
    "end": 2348.376,
    "text": "And what would that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.356,
    "end": 2350.94,
    "text": " how could one describe that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.96,
    "end": 2363.259,
    "text": "And then we come back to where we started with this partition of blanket states into sensory and active states, into the inputs and the outputs, which means that sense-making is quintessentially active.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.72,
    "end": 2374.296,
    "text": "So one way of phrasing that is that, yes, I'm making sense of all this sensory data and all the patterns, but at the same time, I'm actually in charge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.276,
    "end": 2379.583,
    "text": " of actively soliciting those data, causing those patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.864,
    "end": 2396.824,
    "text": "So I think once you bring that sort of inactive aspect to the table, so I notice that you treated predictive coding as a sort of generalization of predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.445,
    "end": 2417.968,
    "text": " it might be easier if you did the other way around because then you have the grace to um accommodate action in predictive processing its most general sense and if you don't then predictive processing you know i think is an incomplete story and you have to have um as part of the processing the active solicitation the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.455,
    "end": 2437.223,
    "text": " the garnering and the structuring and queering the world in a way that reciprocates with the right kind of information that allows you to do the good sense-making in terms of the latent states that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.203,
    "end": 2445.65,
    "text": " I mean, formally, and this takes us into another part of the story, which we didn't previously unpack about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.131,
    "end": 2450.605,
    "text": "So somebody might ask, well, okay, so we've got this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.226,
    "end": 2478.246,
    "text": " application of a free entry principle that a physicist might be quite comfortable with to behavior that entails some kind of sense-making cheekily with you know I like to call this sentient behavior then I get told off for that but so so how does this differ from reinforcement learning you know how your behavioral psychology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.648,
    "end": 2491.044,
    "text": " It differs in a quite fundamental way because the big thing that active inference brings to the table is that, first of all, it says you are in charge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.625,
    "end": 2494.108,
    "text": "You are actively sensing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.569,
    "end": 2505.263,
    "text": "This is active vision, active perception, active inference in this most general sense, which means now what are the imperatives for generating your own data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.817,
    "end": 2517.151,
    "text": " Now, you could, if you were doing behavioral psychology of a behaviorist sort in the 20th century, you could say, well, I just want to generate those sensations that I find rewarding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.613,
    "end": 2532.01,
    "text": "And so I've got some privileged sensory channels that I'm going to label as reward, and I'm just going to act in a way that maximizes the reward that comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.293,
    "end": 2536.261,
    "text": " From the point of view of the free energy principle, that's not what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.361,
    "end": 2548.564,
    "text": "What happens is I want to find those data that resolve the expected surprise or the expected free energy consequent on acting, soliciting those data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.017,
    "end": 2550.539,
    "text": " So what's expected surprise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.859,
    "end": 2554.724,
    "text": "Well, technically it's an entropy, it's just a mathematical measure of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.125,
    "end": 2575.21,
    "text": "So what that means is that the description of things that persist or exist over some particular period of time reduces now to a kind of Bayesian mechanics in which the behavior will look as if it is information seeking and uncertainty resolving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.443,
    "end": 2598.261,
    "text": " um it will look as if it is responding to these epistemic affordances under constraints and it is those constraints that um um if you like would be the homologue of the reward um they are literally the constraints endowed by the priors on the generator model the kind of um sensory states that constitute this attracting set you know to which i am attracted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.241,
    "end": 2614.798,
    "text": " But the vast majority of the drives for good behaviour, or behaviour that things that exist would evince, is this resolution of uncertainty, this information seeking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.778,
    "end": 2633.355,
    "text": " And indeed, that leads you into considerations, well, how would you describe that kind of information, that optimal information-seeking behaviour, if you were a scientist or if you were an engineer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.835,
    "end": 2644.245,
    "text": "And if you were a scientist, you'd be looking at the principle of optimal Bayesian design, articulated by people like Dennis Lindley in the middle of the last century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2644.225,
    "end": 2656.344,
    "text": " where you measure the quality of an action in terms of the information gain afforded by the data that you secure by acting in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.085,
    "end": 2663.235,
    "text": "Exactly the same idea emerged in the context of active learning in machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.637,
    "end": 2665.358,
    "text": "This is the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.36,
    "end": 2668.984,
    "text": "If getting data is costly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.605,
    "end": 2678.196,
    "text": " What data point would I need to resolve the greatest uncertainty about my beliefs about the latent causes of those data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.558,
    "end": 2687.708,
    "text": "So active learning, again, notice active's an explicit part of this process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.569,
    "end": 2696.76,
    "text": "So in answer to your question about would it be sufficient just to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.331,
    "end": 2701.958,
    "text": " sentience in its most basic or elemental form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.271,
    "end": 2731.287,
    "text": " as discovering patterns in data i would say no um because that denies the openness of any given system immersed in her world um in two directions you know the world influencing you and you influencing the world and so you put that into the mix i think it's very difficult to conceive of any construct um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.267,
    "end": 2752.532,
    "text": " Possibly not in philosophy, but certainly any construct in computer science or physics that would permit a complete description of sentient behaviour just in terms of sensing patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.744,
    "end": 2755.045,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.065,
    "end": 2756.206,
    "text": "Yeah, yeah, that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.226,
    "end": 2756.747,
    "text": "That makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.508,
    "end": 2758.048,
    "text": "Makes sense to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.611,
    "end": 2779.009,
    "text": "Yes, I want to stay on action for a second, because I think the notion of the minimization of free energy or the maximization of model 11s makes some could make some intuitive sense for an agent like ourselves, in the sense that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.423,
    "end": 2790.717,
    "text": " We have our sensory inputs which are divergent from our priors and we act to change the world to make those sensory outcomes more in line with our expectations, our preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.979,
    "end": 2802.053,
    "text": "However, at a more fundamental level, one definition that we spoke about, the free energy principle, is that the internal and external states look like they're tracking one another across a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.014,
    "end": 2807.781,
    "text": "Now, a question that comes to my mind when I see a definition like that is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.879,
    "end": 2814.389,
    "text": " which is, that makes sense for me, for a sentient, conscious human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.25,
    "end": 2817.393,
    "text": "But what would a stone be tracking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.694,
    "end": 2822.501,
    "text": "Or what would a drop of oil be tracking, to use an example that you've used before?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.422,
    "end": 2835.54,
    "text": "I think going to something a bit more less animate, and I presume the answer lies in animacy, I think would be a really interesting avenue to go down because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.993,
    "end": 2841.982,
    "text": " It gets to these fundamental questions of how does something as minimal as a particle retain its particle-ness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.124,
    "end": 2847.651,
    "text": "And what does that really look like when we presume that they're not conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.671,
    "end": 2851.297,
    "text": "Unless we're panpsychists, but we won't go just down that route just yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.162,
    "end": 2857.647,
    "text": "Well, that's where you were taking us, which isn't...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.167,
    "end": 2859.089,
    "text": " A fun place to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.871,
    "end": 2865.579,
    "text": "How does one elude panpsychism in the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.78,
    "end": 2876.918,
    "text": "Well, I think you've just answered your own question there, so perhaps we will just unpack that a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.898,
    "end": 2886.131,
    "text": " What's the difference between a stone and a thermostat and me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.912,
    "end": 2898.147,
    "text": "And I think what you're now asking is, are there what I will call natural kinds, but I wasn't allowed to because that has a lot of philosophical baggage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.187,
    "end": 2902.213,
    "text": "But for the purpose of this conversation, I'll just say, are there natural kinds of things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.565,
    "end": 2910.521,
    "text": " that display different kinds of behaviour that can be equipped with different kinds of teleology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.802,
    "end": 2911.904,
    "text": "And I would say absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.305,
    "end": 2916.052,
    "text": "And you've just rehearsed some of the key ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.733,
    "end": 2923.527,
    "text": "So as you noted, to be animate is a big thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.507,
    "end": 2931.275,
    "text": " in the sense that the stone is not animate, in the sense that it moves itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.616,
    "end": 2935.9,
    "text": "If stones started wandering uphill or flying around, that would be much more interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.921,
    "end": 2941.787,
    "text": "But they don't have that animacy that is characteristic of biotic self-organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.267,
    "end": 2947.773,
    "text": "So what does that mean in a deflationary sense of the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.793,
    "end": 2950.476,
    "text": "It just means that the active states are an empty set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.456,
    "end": 2956.982,
    "text": " And usually for stones, you might also argue the internal states are empty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.002,
    "end": 2957.703,
    "text": "We don't have to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.763,
    "end": 2966.772,
    "text": "The stone can be making sense of its world in terms of its latent states or can acquire that into interpretations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.792,
    "end": 2974.379,
    "text": "Perhaps that's a nice example of what we were trying to drill down on earlier on in terms of is there a generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.659,
    "end": 2977.662,
    "text": "I mean, one could argue that a stone,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.642,
    "end": 2982.008,
    "text": " has a generative model of external milieu in terms of the temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.729,
    "end": 2993.145,
    "text": "And the latent variable, which is a hidden state, it's a latent state, as well known in statistical thermodynamics, which is a sufficient statistic of the distribution of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.726,
    "end": 3002.198,
    "text": "And the temperature could well be inferred by the interior of a stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.431,
    "end": 3029.417,
    "text": " and therefore it is making sense of the pattern of its sensory exchanges with the world on the surface of the stone simply because it's warming and cooling and therefore tracking the ambient environmental temperature so that's perfectly free energy principle consistent um it's a very boring kind of uh of sense making but you know and it is that boring kind of sense making that i had in mind when talking about if you preclude the active part",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.397,
    "end": 3056.653,
    "text": " active inference and just think about some perceptual inference then you're sort of missing the point really but I think a stone is a good example of that now would you say the stone has a generative model you could you could argue that it but you know it's you trying to if I explain the behavior of a stone but the stone that doesn't have very much behavior but you could you could start to think well now I can test a hypothesis it is actually registering a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.633,
    "end": 3059.576,
    "text": " the temperature on the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.957,
    "end": 3068.066,
    "text": "And again, just to rehearse the argument, the fundamental argument we were talking about before, you will never know, though, until you break the stone, because once you break the stone, it's no longer a stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.506,
    "end": 3069.587,
    "text": "It's just a broken stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.388,
    "end": 3075.053,
    "text": "So exactly the same problems or issues confront you, even with the stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.434,
    "end": 3083.923,
    "text": "But focusing on that sort of big move from things with and without active states, I think then you're talking about things that are animate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.903,
    "end": 3089.288,
    "text": " things that have animacy and act upon the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.81,
    "end": 3111.21,
    "text": "Is that sufficient to get the kind of behaviour that we've been talking about, which is the kernel of active inference in terms of what active inference brings to the table in terms of information seeking and having a variety of different affordances, particularly epistemic affordances,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.19,
    "end": 3118.424,
    "text": " as an explanation for behaviour, you could argue no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.207,
    "end": 3120.272,
    "text": "A thermostat,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.927,
    "end": 3122.048,
    "text": " can act upon the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.108,
    "end": 3127.553,
    "text": "It can switch heating elements on or off, and it senses things by its thermoreceptors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.334,
    "end": 3130.316,
    "text": "You could say like a Watts governor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.597,
    "end": 3134.0,
    "text": "It now has active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.02,
    "end": 3136.823,
    "text": "It has inputs and outputs, and it has internal dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.923,
    "end": 3147.073,
    "text": "And in one sense, the Watts governor is a good regulator and therefore conforms to the cybernetic view of a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.593,
    "end": 3149.635,
    "text": "And it's acting in the right kind of way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.615,
    "end": 3161.09,
    "text": " So does this kind of system have the curiosity that would be associated with information seeking and resolving uncertainty?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.671,
    "end": 3163.673,
    "text": "And you would argue, well, no, it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.274,
    "end": 3168.74,
    "text": "So now you've got another kind of natural kind which does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.1,
    "end": 3178.272,
    "text": "So what's the difference between what's governor or a thermostat or possibly a virus and me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.252,
    "end": 3199.703,
    "text": " I think the key difference is a particular kind of self-modelling that just comes from being very big and a bit structurally complicated in the sense that there are certain parts inside my body and inside my brain that are so distant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.037,
    "end": 3213.329,
    "text": " from the active states that are actually moving my arms, my actuators, or are engaging my autonomic reflexes, that I cannot see them directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.35,
    "end": 3221.978,
    "text": "And if that is the case, the only way that I now can sense the consequences of my action is vicariously through the sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.598,
    "end": 3227.783,
    "text": "Now this introduces a really interesting distinction between me and a virus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.472,
    "end": 3238.005,
    "text": " It means that I now will start to treat my own action as a hidden or latent cause of my sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.508,
    "end": 3251.104,
    "text": "And that brings to the table, okay, well, if now my own action is being inferred as a random variable, then that was a separation between what I think I'm doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.371,
    "end": 3265.093,
    "text": " or what my active inference would allow me to talk about in terms of what I'm planning to do or what I'm inferring to do in the spirit of planning as inference and what I'm actually doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.495,
    "end": 3288.482,
    "text": " So this brings you to an even more different kind of thing, which would be something like me, that now has beliefs about its own action, which is distinct from the actual real variables that constitute the active states of the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.614,
    "end": 3314.068,
    "text": " And as soon as I have beliefs about my own action, I have to ask myself, well, as a physicist, I would ask, well, what are the probability distributions over my active states, those states that actually change the causes or the external states generating my sensations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.729,
    "end": 3316.191,
    "text": "And when you write that down,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.407,
    "end": 3335.936,
    "text": " what you get is exactly what we were talking about before, which is this mixture of expected information gain, basically expected free energy, that can be decomposed into this information-seeking part and the constraints afforded by the prior part of your generative model, the things that you find very surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3336.377,
    "end": 3341.925,
    "text": "Plus, just to unpack that intuitively,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.749,
    "end": 3352.821,
    "text": " Let's take the predictive processing surprise minimization view of self-organization and an active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.322,
    "end": 3359.87,
    "text": "And that means that I am the kind of creature that exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.05,
    "end": 3363.093,
    "text": "Therefore, I must be minimizing my surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.514,
    "end": 3366.277,
    "text": "Furthermore, I now have beliefs about my actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.738,
    "end": 3367.519,
    "text": "I have prior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.559,
    "end": 3369.381,
    "text": "I must have prior beliefs about my actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.238,
    "end": 3371.68,
    "text": " Of course, this is all sub-personal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.061,
    "end": 3375.886,
    "text": "So what kind of priors would I have about my own actions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3376.206,
    "end": 3389.966,
    "text": "Well, I'm going to, because I exist and I'm a free energy surprise minimizing kind of thing because I exist, then I must choose those actions that minimize the surprise I expect following that action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.647,
    "end": 3392.81,
    "text": "So that means I'm going to minimize my expected surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.691,
    "end": 3395.794,
    "text": "Now, there are two ways in which I can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.814,
    "end": 3398.878,
    "text": "And we've already spoken explicitly about the two ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3399.415,
    "end": 3408.593,
    "text": " One way is just to notice that the average surprise, the expected surprise is just uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.993,
    "end": 3417.61,
    "text": "So I can reduce my expected surprise or my anticipated or my average surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.59,
    "end": 3425.459,
    "text": " by getting to grips and knowing what would happen if I did that with greater precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.759,
    "end": 3427.301,
    "text": "So this is information seeking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.341,
    "end": 3429.183,
    "text": "This is the sort of the curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.964,
    "end": 3431.866,
    "text": "It's the novelty seeking part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.247,
    "end": 3445.842,
    "text": "It is exactly the part that underwrites the principles of optimum Bayesian design, getting the data that minimize my uncertainty because uncertainty just is expected surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.822,
    "end": 3448.767,
    "text": " But there's another way of doing minimising expected surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.187,
    "end": 3464.691,
    "text": "If I know what is very surprising, by being at very, very low temperatures or being very poor or being snubbed socially, everything that is, if you like, not characteristic of me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.38,
    "end": 3475.287,
    "text": " given that I exist in a particular way, then any deviations from that basically can be thought of as surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.307,
    "end": 3477.313,
    "text": "So if I stray beyond",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.698,
    "end": 3507.587,
    "text": " very much in the spirit of homeostasis, although now we're talking about anastasis because we're talking about the future, then I'm going to choose those actions that don't just do the information-seeking, responding to the epistemic affordances, but also will elude those kinds of surprising states that are very uncharacteristic of me, being very poor, missing out on that opportunity, being embarrassed, being in pain, although pain is probably a bad example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.567,
    "end": 3511.817,
    "text": " We're talking about the sensations that we want to avoid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.837,
    "end": 3523.365,
    "text": "So that would speak to the prior cost or the prior surprise, the negative, which was the preferences you mentioned before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.345,
    "end": 3531.415,
    "text": " So you can look at these constraints afforded by the priors, the pragmatic part, if you like, of these affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.775,
    "end": 3533.057,
    "text": "Some people call them instrumental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3533.077,
    "end": 3545.633,
    "text": "So you've got epistemic and instrumental affordances that just are the expected information gain and the negative expected cost, which would be the manifestation of the constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.673,
    "end": 3553.302,
    "text": "You can look at the complement of constraints in terms of where I don't go in my sensory state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.518,
    "end": 3560.204,
    "text": " as where I do go, which are my preferences, my preferred characteristic attracting sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.245,
    "end": 3570.112,
    "text": "So just to remind myself and you and people who are listening still at this stage, why are we going through all this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.713,
    "end": 3582.563,
    "text": "Well, because this is what comes out of a consideration of beliefs, prior beliefs about the way active state should unfold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.083,
    "end": 3593.299,
    "text": " and that becomes very pertinent when now I have to actually embody those beliefs in my generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.759,
    "end": 3605.918,
    "text": "So suddenly now I become something that is very distinct from a thermostat or a virus because now I have a generative model of the consequences of my action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.235,
    "end": 3626.168,
    "text": " and that generative model is very simple it just says a priori I will a priori think that the action that maximizes information gain and maximizes this instrumental value are going to be the most likely policies that and this you know could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.148,
    "end": 3649.017,
    "text": " could be construed as a high-end kind of planning as inference it's not as trivial or simple as a sort of KL control because we've got this epistemic part of it but it still has a spirit of planning of inference so what I'm saying quite simply is there are certain things that plan and there are certain kinds of things that don't plan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.823,
    "end": 3660.556,
    "text": " virus doesn't plan, the weather doesn't plan, evolution doesn't plan, the stone doesn't plan, and you could argue that many smaller insects don't plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.897,
    "end": 3664.481,
    "text": "But as you get bigger things, then they start to plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.262,
    "end": 3670.549,
    "text": "And I think you move from non-planning to planning, at which point, by definition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.12,
    "end": 3693.634,
    "text": " You are ascribing to these bigger things like you and me, ascribing a teleology to our behavior that rests upon a generative model that includes the consequences of its own action, which crucially equips it with a temporal depth because the consequences are in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.103,
    "end": 3704.897,
    "text": " So unlike the thermostat that doesn't need to look very far into the future, things that plan are so big that they lose contact with their actual actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.219,
    "end": 3723.081,
    "text": "Now, look as if they have this sort of temporal depth, this temporal thickness to their generative models, specifically enabling them to plan their actions into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3723.061,
    "end": 3726.827,
    "text": " So that's how I would get out of the panpsychism argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.765,
    "end": 3734.595,
    "text": " Okay, I've never heard that argument before about the distance from the actuators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.236,
    "end": 3736.097,
    "text": "That's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.74,
    "end": 3746.555,
    "text": "Because it seems in that sense that the temporal depth is downstream on size, in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.117,
    "end": 3750.221,
    "text": "Is that a correct reading?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.762,
    "end": 3754.468,
    "text": "And is there a reading of your argument that you've just laid out there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.769,
    "end": 3769.748,
    "text": " in which you can have deep temporal modeling, planning as inference, and allostasis as well as a sense of retrospective inference without being a large thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.79,
    "end": 3784.506,
    "text": "Or is this notion of being far from your actuators so that you have to start disambiguating what is your action and what is the action of the world or other people, is that fundamental?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.486,
    "end": 3790.182,
    "text": " Yeah, I mean, this is a really interesting notion, because I've actually never heard it really be elucidated like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.202,
    "end": 3796.099,
    "text": "So I'd love to know whether there is a way that a virus could be doing deep temporal modeling despite its minimal size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.767,
    "end": 3808.122,
    "text": " I mean, to be honest, I don't know, but an intuitive answer would be no, size really does matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.662,
    "end": 3809.564,
    "text": "It really does matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.904,
    "end": 3815.472,
    "text": "So by size, I'm implicitly talking about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.452,
    "end": 3823.56,
    "text": " the sparse coupling that underwrites the conditional dependencies in modern dynamical systems that give rise to Markov blankets and blankets and blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.14,
    "end": 3841.037,
    "text": "So I'm not literally talking about how wide something is in terms of millimetres, I'm talking about the sort of the hierarchical depth of conditional dependencies and being secluded behind Markov blanket after Markov blanket after Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.338,
    "end": 3859.828,
    "text": " So if you're comfortable associating physical size with that hierarchical depth in terms of what a thing is, in terms of having this internal hierarchical structure, internal Markov blankets, then I think the answer is very clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.888,
    "end": 3862.793,
    "text": "No, you have to be sufficiently big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.194,
    "end": 3864.836,
    "text": "So I'd be extremely surprised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.758,
    "end": 3867.801,
    "text": "So, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.118,
    "end": 3895.408,
    "text": " said this before but you know i would imagine very very small insects can't plan whereas something the size of a bee might be able to plant so i'd imagine that a drosophila couldn't plan but i i would imagine a bee might just be able to get there and it and it it starts um you know first of all that that that immediately speaks as a philosophical vagueness in terms of that temporal thickness which which is interesting i mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.675,
    "end": 3897.477,
    "text": " Is it categorical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.898,
    "end": 3921.97,
    "text": "Can I say this kind of artefact can be explained in terms of a generative model that does not cover its own action because it has direct access to its actuators because it's sufficiently simple and small and there are no Markov blankets that intervene between effectively the sense-making part",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.95,
    "end": 3927.878,
    "text": " For example, sending predictions in the predictive processing spirit down to the actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.1,
    "end": 3943.941,
    "text": "Whereas this thing is so big that there are inevitably, with probability one, so many Markov blankets that intervene, there is no now direct access to action upon the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.693,
    "end": 3948.437,
    "text": " That might be a bright line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.477,
    "end": 3958.391,
    "text": "It might be a qualitative distinction between things that do and do not have a representation of their own actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.532,
    "end": 3966.722,
    "text": "On the other hand, the counter argument, I think, would be this more vague notion that even a thermostat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.377,
    "end": 3990.516,
    "text": " could be construed as having a little glimpse of the future simply because it could be um cast as say a pid controller which basically um invokes now rates of change and as soon as you invoke rates of change you've got sort of you know a mathematical image of a little trajectory into the future so it could be a great it could be a graded thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3991.373,
    "end": 3994.086,
    "text": " I've lost the importance of your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.367,
    "end": 3996.357,
    "text": "I'll ask you a question again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.397,
    "end": 3998.447,
    "text": "It was probably unimportant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.811,
    "end": 4024.165,
    "text": " but this is really sorry i'll go again this is a very interesting line i'd love to i'd love to dive down into so what so my interpretation of this my my reading of this is that in a sense having bundles of markov blankets embedded in markov blankets leads to the inevitable inference that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.955,
    "end": 4032.469,
    "text": " There is something like me which is doing something and there is something that's not like me which is also causing sensory data that I'm receiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.192,
    "end": 4033.935,
    "text": "That makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.367,
    "end": 4040.273,
    "text": " Now, let's tie in temporality to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.255,
    "end": 4055.653,
    "text": "Does this mean that in a sense, temporality is a corollary of selfhood, in the sense that the selfhood is almost more fundamental than the temporality because it comes from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.633,
    "end": 4078.975,
    "text": " the dimensionality of the things that are mark of blankets upon mark of blankets and how can we integrate temporality and temporal thickness or depth into this picture right that's absolutely right and um you could tell the story in a number of different ways you know if you're talking to um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.579,
    "end": 4095.259,
    "text": " for example, Chris Fields or Maxwell Ramstad, they might start talking about irreducible Markov blankets that necessarily require the notion of nested Markov blankets and that there is some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.239,
    "end": 4117.146,
    "text": " one or more core irreducible Markov blankets that would have this aspect of looking at one's own inference processes and acting internally and you get the notion of mental action and you can then start to work towards qualitative experiences in terms of self-modelling and what that might look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.126,
    "end": 4134.713,
    "text": " The other way that you could tell this story is to invoke the renormalization group if you were a physicist and just know that when you're talking about any hierarchical generative model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.693,
    "end": 4151.689,
    "text": " there is inevitably a coarse graining that includes time in that depth, which means very simply that the deeper parts of my generative model and indeed of viruses are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4152.175,
    "end": 4162.289,
    "text": " on a free energy principle view, encoding beliefs about things that change more and more slowly as you go deeper and deeper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.329,
    "end": 4164.312,
    "text": "So this is separation temporal scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.513,
    "end": 4177.93,
    "text": "So a commonsensical view of this is that the neuronal representations down near my primary auditory cortex or indeed in the brain stem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.91,
    "end": 4196.155,
    "text": " are representing very, very fast fluctuations in pressure and frequencies and sort of scenographic-like representations that are changing possibly even in fractions of a millisecond if you're an owl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4196.135,
    "end": 4216.067,
    "text": " um uh but certainly over over 100 milliseconds then i move up to sort of you know uh primary auditory cortex and i may be in the realm of some um hundreds of milliseconds and sort of frequency glides that defined phonemes and i move up to secondary auditory cortices and then through the auditory hierarchy getting to the level of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.047,
    "end": 4239.726,
    "text": " words right up to say you know some parts of prefrontal cortex where we've got entire semantics and syntax and narratives and stories start to emerge and as every time we go deeper into the hierarchy we slow down or we extend the temporal compass thereby providing a context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.128,
    "end": 4244.293,
    "text": " for the faster influences and fluctuations at the level below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.333,
    "end": 4266.321,
    "text": "So again we come to this notion of size entailing a certain kind of depth, in this instance a hierarchical depth in the generative model, that, as you say, necessarily goes hand in hand with a temporal depth and a separation of temporal scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.301,
    "end": 4267.683,
    "text": " So I think you're absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.703,
    "end": 4271.949,
    "text": "There has to be a temporal aspect to deep generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.35,
    "end": 4276.256,
    "text": "And by deep, I just mean that there are nested Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4276.576,
    "end": 4289.575,
    "text": "So to define a hierarchy is only defined in terms of the conditional independences and implicitly the Markov blankets of one level in the hierarchy that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.723,
    "end": 4291.934,
    "text": " defines it as a level in the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.954,
    "end": 4295.149,
    "text": "Without the Markov blanket the hierarchy would not be there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.551,
    "end": 4298.586,
    "text": "So that's another example of this sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.384,
    "end": 4321.084,
    "text": " being open but being closed and being able to individuate something from something else and this is the thing is just the level of a hierarchical generative model that we're ascribing to the dynamics of some internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.145,
    "end": 4330.834,
    "text": "I think there's a third story you could tell which is possibly where you're going which is how it relates to consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.725,
    "end": 4348.857,
    "text": " In the sense, and this is a very simple story, that if I am forming beliefs and doing basing belief updating as prescribed by active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.512,
    "end": 4374.338,
    "text": " about the consequences of my actions then that has to be in the future as we've just said and perhaps certain things think deeper into the future than other things but notice what we've done here it's about my actions so not only have you committed to temporality and temporal depth and temporal thickness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.672,
    "end": 4380.307,
    "text": " as an attribute of things that plan and are more like you and me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.009,
    "end": 4383.034,
    "text": "But you've also committed to agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.716,
    "end": 4389.07,
    "text": "So now you've created from something that was previously not an agent into an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.32,
    "end": 4405.928,
    "text": " When I'm using agency in the sense that one would not say that a thermostat had agency, but you would say that I have agency in the sense that I have beliefs about the consequences of my action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.908,
    "end": 4414.523,
    "text": " And I will or can be described as using those beliefs to select a particular action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.924,
    "end": 4428.287,
    "text": "And coming back to predictive coding formulations, that selection would basically, I'm going to predict the state of my motor plant or my autonomic nervous system and provide the right set points and then the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.267,
    "end": 4442.361,
    "text": " the active stage will actually reflexively fulfill those prophecies, those predictions, and everything is working properly, I'll be a good allostat, or in Roshbi's terms, a good homestat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.628,
    "end": 4462.577,
    "text": " what what you've done there is is bring agency into the game um and i think that again this speaks to the inactive part that you know you now because you've got beliefs about the future and specifically the future that you have caused that you have authored you have now become an agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.557,
    "end": 4480.009,
    "text": " So we have, I think, got this stage to consciousness and self-awareness, but I think we've got the necessary foundation that there are only certain things that have to be agents, I think, to be conscious of themselves as agents, as doing things, as things that exist and exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4479.989,
    "end": 4489.603,
    "text": " in a world in the sense that their existence is manifest in terms of the consequences of the way that they act upon that world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.904,
    "end": 4491.646,
    "text": "If it wasn't, you wouldn't need any of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4491.726,
    "end": 4493.489,
    "text": "You wouldn't need this temporal thickness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.89,
    "end": 4500.9,
    "text": "You'd just need the apparatus of a stone or a thermostat to do your sense-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.88,
    "end": 4527.377,
    "text": " but as soon as you've got agency in the game i think then you've got you've got something which takes a step closer to um having a very deep and possibly it's this irreducible mark off blanket um um there of the generative model or level of a deep generative model which actually now starts to entertain the hypothesis i am an agent um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4527.847,
    "end": 4548.91,
    "text": " you don't need but you could and you have to ask yourself why would you ever want to entertain that hypothesis i am an agent um so this would be minimal selfhood just a representation um that i can be in different states of mind when it uh that and those states of mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.89,
    "end": 4555.276,
    "text": " are something that underwrite or I can condition on in terms of what I'm going to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.656,
    "end": 4557.638,
    "text": "And that doing could be internal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.678,
    "end": 4562.242,
    "text": "It could be how I deploy attention in terms of precision weighting in predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.183,
    "end": 4565.965,
    "text": "So it could be covert action or it could be overt action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.045,
    "end": 4578.897,
    "text": "I could now select certain plans at a lower level that would be then enacted by my motor system or my autonomic system if I was that kind of creature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.877,
    "end": 4580.721,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.164,
    "end": 4582.645,
    "text": "It makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.665,
    "end": 4585.711,
    "text": "And it's opened up a can of worms in my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.152,
    "end": 4594.709,
    "text": "Well, inevitably, because we brought in lots of concepts here and I want to try and unpick them for people at home and for myself, but it's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4595.09,
    "end": 4595.711,
    "text": "So I'm loving it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.112,
    "end": 4599.298,
    "text": "So let's keep going along this, along this road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.278,
    "end": 4608.8,
    "text": " We've got agency, consciousness, and temporality as these three things I want to have a little look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.163,
    "end": 4615.836,
    "text": "Starting with the first thing you mentioned as a response to my question about temporality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.828,
    "end": 4633.732,
    "text": " that we have a deep hierarchy in which deeper levels of the hierarchy are tracking slower fluctuations in the external dynamics and therefore contextualize and constrain the higher order faster dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.415,
    "end": 4637.858,
    "text": "Are we, in this model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.243,
    "end": 4643.134,
    "text": " we invoking time as a fundamental aspect of those external dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.154,
    "end": 4652.995,
    "text": "Or is it an inference that the organism is making about the nature of reality that it's experiencing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.185,
    "end": 4657.848,
    "text": " Well, that's again an excellent question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.168,
    "end": 4669.4,
    "text": "It certainly does not address time perception in terms of the psychophysics of time perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.961,
    "end": 4674.506,
    "text": "Does it address time in a more fundamental sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.326,
    "end": 4684.416,
    "text": "I don't think it does in a sort of folk psychological sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.396,
    "end": 4695.173,
    "text": " So the answer to that question normally is framed in terms of relative movements in a belief space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.014,
    "end": 4709.475,
    "text": "And so if you think of time as part of some metric space time, then what you're talking about is time as something that can be measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.164,
    "end": 4722.908,
    "text": " time that has a distance say milliseconds or seconds up and the like um could me um could me as a generative model um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.812,
    "end": 4730.481,
    "text": " ever have access to or build hypotheses of time as a metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.521,
    "end": 4731.843,
    "text": "Yes, we certainly could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.905,
    "end": 4739.535,
    "text": "However, it would be very difficult, you know, ignoring sort of internal clocks and the like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.655,
    "end": 4742.5,
    "text": "Well, naturally, no, you have to ignore internal clocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.7,
    "end": 4744.243,
    "text": "You then ask, how do you do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.723,
    "end": 4748.389,
    "text": "And normally what the story is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.369,
    "end": 4755.544,
    "text": " It's the number of moves you make at one level relative to another level of a deep generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.929,
    "end": 4760.373,
    "text": " And the number of moves is quite crucial here in terms of tying that down mathematically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.994,
    "end": 4766.78,
    "text": "And my favorite way of thinking about the number of moves is basically something called the information length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.801,
    "end": 4774.167,
    "text": "And the information length refers back to something we've mentioned before, which is information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4774.708,
    "end": 4783.236,
    "text": "So as if you think of our so one picture of the free energy principle is quite a technical picture, but I think it's quite useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.672,
    "end": 4805.875,
    "text": " is that our internal, say, brain states or the internal states of a thermostat encode a probability distribution, a Bayesian belief, a conditional belief about some latent states, which means that for every state of the brain, there is, if you like, a point in the state space of all the physical states of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.335,
    "end": 4810.219,
    "text": "But each point in that space now stands in for a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.144,
    "end": 4818.012,
    "text": " And that means that this is a special kind of space because it is equipped with a metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.193,
    "end": 4819.494,
    "text": "What is that metric?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.514,
    "end": 4821.837,
    "text": "Well, it's the KL divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.857,
    "end": 4828.265,
    "text": "Well, the path integral of infinitesimally small KL divergences as I move through this space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.725,
    "end": 4831.869,
    "text": "So this is what defines information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.67,
    "end": 4839.278,
    "text": "The information geometry is a very particular bit of mathematics or theorizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4839.258,
    "end": 4852.93,
    "text": " that applies to very very special state spaces or manifolds where every point in that on that manifold corresponds to a belief or a probability distribution so now what if the metric",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.112,
    "end": 4865.324,
    "text": " is the KL divergence or the information length which is related to the accumulated KL divergences as I move from one point to another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.325,
    "end": 4883.001,
    "text": "What we are saying is that the number of moves I make, the number of units as measured with this kind of metric, this information geometric measure, which actually technically is this Fisher information,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.981,
    "end": 4894.9,
    "text": " is basically a description of the precision by which I measure whether I've changed my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.761,
    "end": 4901.31,
    "text": "So if we say that I've made n moves, that means I've changed my mind n times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.881,
    "end": 4923.613,
    "text": " And I know that because I can measure the information length and I've actually moved by a measure that is large simply because it is large in relation to the precision that provides the distance between any two points on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.194,
    "end": 4928.58,
    "text": "So what that means, to put it very simply, is that time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4928.915,
    "end": 4942.649,
    "text": " can be measured by the number of times I change my mind at level n in my hierarchy, divided by the number of times I change my mind at the lower level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4943.229,
    "end": 4956.002,
    "text": "So now you've got a relational, you can gauge time by the relative degrees of belief updating, the information rate, which is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4955.982,
    "end": 4981.281,
    "text": " confusingly the rate of change of the length with time but where time is now contextualized by the level above or by the level below so you have this very relativistic view of time and you could have different levels of you know I would imagine if you you know attempt different levels of your hierarchy you could get a very different kind of time perception indeed we know that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.261,
    "end": 5007.673,
    "text": " attentional set and in conditions where say taking psychedelics or in things like Parkinson's disease where you get changes in the neurobiological encoding of uncertainty and therefore this Fisher information metric you can get distortions and different senses of time so what I'm saying is there were probably as many different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5007.653,
    "end": 5011.821,
    "text": " senses of time as there are levels in a hierarchical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.362,
    "end": 5023.603,
    "text": "And it can only really be measured in a relative sense in terms of how many moves do I make at one level for any given move at another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.866,
    "end": 5043.82,
    "text": " So what we've done now is, if you like, take temporality off the table to the extent now that we're now just talking about movements in an information space or a belief space that has this kind of information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.795,
    "end": 5067.411,
    "text": " these are really fascinating issues uh i think yet to be fully explored um my my friend zaf um um has done probably some of the best work in in in this area um but you know it is it is to my mind um a really interesting issue because you know it really forces you to think about the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5067.391,
    "end": 5081.545,
    "text": " what you mean by separation temporal scales and what kind of course grading over time is implicit in this kind of move from one level to the next level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.326,
    "end": 5089.674,
    "text": "Does that address what you were... Yeah, I mean, as I was saying, this is all really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.974,
    "end": 5095.98,
    "text": "And again, something I hadn't thought of before in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5097.108,
    "end": 5112.096,
    "text": " in terms of this in terms of this contextualization process being about moves, which implies to me that there has to be like this sense of time is contingent on these moves that are being done at the different levels of the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.527,
    "end": 5118.02,
    "text": " does that process itself not imply some temporal dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.06,
    "end": 5127.267,
    "text": "How can one distinguish a move of 10 relative to a move of five without having segmented moves in some kind of space-time geometry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5127.989,
    "end": 5134.42,
    "text": " Yes, and it is exactly that segmentation that appeals to the information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.321,
    "end": 5139.448,
    "text": "So how would you actually do that segmentation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.528,
    "end": 5145.458,
    "text": "How would you measure the amount of belief updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.438,
    "end": 5150.468,
    "text": " in universal or clock time at one level of a hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.949,
    "end": 5153.594,
    "text": "And this is where the information geometry comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5153.614,
    "end": 5167.041,
    "text": "It's basically the number of different brain states that you have entertained during your movement on this statistical manifold, which is also, I think, very nicely articulated in terms of belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.021,
    "end": 5181.62,
    "text": " So you can literally think of this as the space that would be traced out if I were to plot the activity of all my neurons on every axis of some very high dimensional state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.081,
    "end": 5183.603,
    "text": "That would be a statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.003,
    "end": 5187.848,
    "text": "My belief updating, which is a continuous process, my gradient flow,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.047,
    "end": 5214.072,
    "text": " um is literally moving on this manifold the distance i move is the information length that literally scores the degree to which i change my mind it's also mathematically the information gain um as measured well closely related to the information gain as measured by the kl divergence between my prior and my posterior after i do my belief updating i'm moving on this manifold and the question is you know how far have i moved",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.406,
    "end": 5217.232,
    "text": " And can I segment that into units?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.312,
    "end": 5222.163,
    "text": "And that's basically what the information length allows you to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.684,
    "end": 5234.49,
    "text": "So I love this picture because if you just think about what kind of flows on this manifold would be prescribed by the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.348,
    "end": 5250.532,
    "text": " Because the free energy is a functional of the beliefs encoded at each point, then the free energy is a landscape on the statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5251.053,
    "end": 5254.759,
    "text": "So we are perpetually falling downhill on this manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.52,
    "end": 5259.887,
    "text": "The free energy gradients are themselves and the free energy is itself changing because my beliefs are changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5260.323,
    "end": 5268.057,
    "text": " So I've got this lovely itinerant model or picture in mind where I've got a statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5268.658,
    "end": 5282.803,
    "text": "It is now where I have gradient flows, where I'm flowing on this manifold using a gradient flow on free energy, where the free energy now provides a Waddington-like landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.155,
    "end": 5309.044,
    "text": " chasing minima all the time and of course that chasing reflects the fact that the free energy itself changes as you move around the manifold because your beliefs are changing and the free energy is a function of belief and then you introduce this uh this notion which i think is really important um the notion that the higher level of a deep model um provides the context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5309.024,
    "end": 5330.509,
    "text": " and what would the context look like in terms of this free energy landscape well it means that the landscape would change so you know i've got this gradient flow which is um um from um on a fast time scale just flowing down the landscape down the landscape but at the slow level the landscape is itself now changing all the time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5330.692,
    "end": 5340.473,
    "text": " So I'm perpetually chasing minima and moving minima because the gradients themselves are contextualized and are changing slowly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5340.794,
    "end": 5347.829,
    "text": "So you get this deep structure to the temporal dynamics, which has this very non-Markovian aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5348.31,
    "end": 5350.354,
    "text": "So now we've got this interesting picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.925,
    "end": 5367.061,
    "text": " where things like you and me that are big, where big just means that there are lots of Markov blankets that constitute my deep generative model that enable this separation of time scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.963,
    "end": 5377.692,
    "text": "You've got this picture where each level is now providing the landscape for the level below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.992,
    "end": 5393.477,
    "text": " with very, very fast changes, but of course these are now changing, the landscape is itself changing, so that now you've got a non-Markovian model of a universe that we know is Markovian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5394.539,
    "end": 5399.747,
    "text": "So we know because we started, if you remember right at the beginning with this notion of a random dynamical system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.503,
    "end": 5407.031,
    "text": " that is usually associated with things like a Langevin equation or a Markovian process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.192,
    "end": 5414.96,
    "text": "So we're starting from a Markovian universe with effectively no memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.861,
    "end": 5426.393,
    "text": "And now we've found things inside this universe that look as if they found a non-Markovian explanation, a coarse-grained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.812,
    "end": 5439.41,
    "text": " sensible and sense-making explanation for their sensory impressions that is quintessentially non-Markovian, that has this deep temporal structure of the kind you find in language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5440.211,
    "end": 5456.515,
    "text": "The whole point of, say, for example, hierarchical Dirichlet process models of natural language right through to the current focus on transformer architectures in large language models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5456.495,
    "end": 5459.38,
    "text": " They're all about breaking the Markovian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.543,
    "end": 5470.581,
    "text": "They're all about finding non-Markovian explanations for what, at the end of the day, must be a Markovian process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5471.062,
    "end": 5472.725,
    "text": "And you may ask, where does that come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5473.026,
    "end": 5479.077,
    "text": "Well, if we spend most of our time trying to model input",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5479.478,
    "end": 5498.095,
    "text": " where that input is generated by things like us and we are complex deep things that generate non-Markovian actions and in fact our universe now becomes non-Markovian simply because we have other things in it that are sufficiently big to have these deep generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.188,
    "end": 5505.716,
    "text": " And then you get into language and communication and the itinerancy, which is, I think, quite unique to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.758,
    "end": 5510.402,
    "text": "I don't think you'll find this kind of dynamics if you get too big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.422,
    "end": 5516.05,
    "text": "And certainly, as we've already discussed, it can't exist at a very microscopic scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5516.07,
    "end": 5526.463,
    "text": "So even in your head, your macromolecules in the 16th dendrite in the CA1 field of your left hippocampus, that doesn't do any planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.483,
    "end": 5527.204,
    "text": "It's too small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.741,
    "end": 5549.479,
    "text": " uh it doesn't have that requisite depth of or nesting of markov blankets um uh so small stuff can't do can't have this separation temporal scales and this particular deep itinerancy and um sort of um you know markovian breaking like property but interestingly when you get too big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.459,
    "end": 5552.085,
    "text": " you also can't do it either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.145,
    "end": 5559.623,
    "text": "So the motion of the heavenly bodies, the moon and the sun and the like, they don't plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5560.825,
    "end": 5562.529,
    "text": "And it's interesting to ask, well, why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5562.59,
    "end": 5565.797,
    "text": "Well, because they don't have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5565.997,
    "end": 5578.242,
    "text": " because they're so big, all the random fluctuations in their world have gone away, and you now are left with classical mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.823,
    "end": 5585.136,
    "text": "So you could sort of get Thomistic chaos in n-body problems, but there wouldn't be a description",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5585.116,
    "end": 5606.5,
    "text": " um that would um be usefully interpreted in terms of planning as inference or active inference in the way that we've been talking about so i think there's a golden locks regime you've got to be big enough but not too big uh to do this to do this kind of planning wow amazing yeah i mean it's um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5607.374,
    "end": 5624.269,
    "text": " it's bringing up all of these existential, potentially fluffy questions in my mind, which I would like to sort of ask at least one, which is, we could ask why, let's take the macro structures, the celestial bodies,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.772,
    "end": 5636.032,
    "text": " black hole universe itself, we could ask why in a mechanistic mathematical sense do they not have this kind of non-Markovian temporal horizon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.874,
    "end": 5645.008,
    "text": "So there's a mathematical answer to that, or a physical in the sense of being explained by physicists, there's an answer to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.203,
    "end": 5648.286,
    "text": " There isn't necessarily an existential answer to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5649.127,
    "end": 5665.989,
    "text": "And I guess I do not expect a concrete answer because I'm sure there isn't one, but millennia has been dedicated to the question of the human condition and why maybe that itinerancy is so fundamentally defining of our nature, which is that we can't seem to kind of sit still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5666.77,
    "end": 5671.857,
    "text": "We are open and the world is affecting us and we're affecting the world, as you said, and we're in this constantly dynamic coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5673.035,
    "end": 5682.426,
    "text": " I guess I would love to just hear intuitive thoughts you might have on why the universe would unfold in such a way that you do have a Goldilocks zone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.048,
    "end": 5700.949,
    "text": "Why is it the case that things like us have this wandering openness, rather than just being either in the soup, or being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.283,
    "end": 5704.888,
    "text": " firmly rigid forever, if you have any thoughts on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.452,
    "end": 5713.981,
    "text": "Not well-formed thoughts, but I mean it is a fascinating thing to reflect upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5714.001,
    "end": 5726.498,
    "text": "I think the answers that someone like me would give you would inherit from a sort of a classical view of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.478,
    "end": 5745.735,
    "text": " physics as opposed to a quantum information theoretic view so you may get a very different answer if you ask somebody like Carlo Rovelli or Stephen Wolfram or you know my friend Chris Fields but if you're happy with a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5745.715,
    "end": 5749.239,
    "text": " 101 physicists' response to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5750.22,
    "end": 5766.66,
    "text": "The way that I would look at that is through the lens of the renormalization group, which just says that things exist at different scales and there is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.64,
    "end": 5784.295,
    "text": " you are looking for explanations of that scale-free behavior in terms of laws that are dynamics or Lagrangians, technically, that are conserved over different levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5784.635,
    "end": 5796.225,
    "text": "And for the free energy principle, that is just the dynamics, the gradient flow on the free energy defined at each level or each scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.205,
    "end": 5801.507,
    "text": " and that leads you to then a view of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5802.162,
    "end": 5828.305,
    "text": " the same kind of things sorry the same kind of processes and the same principles applying at each and every scale of the universe so that you would add a very very fine time scale and a very very fine um spatial scale say the quantum scale you would have lots of very very fast hot stones moving around where the random fluctuations predominate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5828.285,
    "end": 5834.151,
    "text": " and there is very little of this kind of long-term itinerancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5834.191,
    "end": 5846.544,
    "text": "Now, technically, that results from a certain aspect of the way that you can always decompose any dynamics, any gradient flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5847.045,
    "end": 5853.972,
    "text": "So I've spoken about the dynamics exclusively in terms of gradient flows flowing down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5853.952,
    "end": 5861.364,
    "text": " the flowing down the free energy landscape, say on a cisco manifold, being my favourite picture of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.007,
    "end": 5874.306,
    "text": "That denies another really important aspect of the flow, which is the flow orthogonal to that gradient flow, known as solenoidal flow or divergence free flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.286,
    "end": 5891.721,
    "text": " So the way that I look at this through the lens of a sort of classical physicist that would predicate everything on this random dynamical system or Langevin approach is that you've got a continuum between the very small and the very big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5892.022,
    "end": 5904.821,
    "text": " where now we're not talking so much about the degree of nesting of Markov blankets, but simply the contribution of random fluctuations to the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.562,
    "end": 5921.826,
    "text": "And the important thing to bear in mind is that any dynamics, any flow, has this solenoidal part, this conservative part, and this dissipative part that inherits from the random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5922.093,
    "end": 5923.699,
    "text": " If you're very, very small,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5924.978,
    "end": 5952.589,
    "text": " then all the random fluctuations have not yet been averaged away and the dissipative part predominates over the conservative part the solenoidal part which means that at the very very small scales you are effectively in the world of thermodynamics where you're effectively ignoring the solenoidal part",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5952.569,
    "end": 5954.753,
    "text": " So everything is dissipative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5954.773,
    "end": 5966.955,
    "text": "You get fluctuation dissipation theorems, integral fluctuation theorems, and then you can drive generalizations in the second law and all of that good stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.779,
    "end": 5971.624,
    "text": "And then as we get bigger and bigger and bigger,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5971.604,
    "end": 5983.544,
    "text": " The coarse graining implicit in what's known as an RG operator in the renormalization group, I look at it as a grouping and dimension reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5983.764,
    "end": 5991.076,
    "text": "A coarse graining entails an averaging, and as you average, the random fluctuations average out to zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5991.677,
    "end": 5996.565,
    "text": "So now the dissipative part disappears, and you're just left with this solenoidal flow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5996.917,
    "end": 6002.062,
    "text": " which is just the conservative dynamics of Newtonian mechanics and Lagrangian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.543,
    "end": 6010.45,
    "text": "And the solenoidal aspect is just a description of like the Moon going around the Earth and the Earth going around the Sun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6010.931,
    "end": 6022.502,
    "text": "It's things that have orbits, stable orbits or quasi-periodic orbits that are approaching deterministic simply because they are very, very big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6022.482,
    "end": 6031.058,
    "text": " So the interesting thing happens in the middle, where you've got a mixture of dissipative dynamics and conservative dynamics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6031.325,
    "end": 6033.668,
    "text": " What would the conservative dynamics look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.169,
    "end": 6041.579,
    "text": "Well, they would look like this sort of itinerant oscillation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6041.88,
    "end": 6049.43,
    "text": "It would look like the same kind of classical conservative oscillation that the moon does, but it will be much more itinerant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6049.73,
    "end": 6053.235,
    "text": "It'll look like a biorhythm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6053.716,
    "end": 6055.418,
    "text": "It will look like a life cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6055.839,
    "end": 6061.146,
    "text": "It will have that property that we associate with living movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6061.126,
    "end": 6070.642,
    "text": " So, we talked before about the fact to be autonomous is to move, it is to have active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6071.183,
    "end": 6075.17,
    "text": "One would also argue that movement in and of itself is not sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6075.41,
    "end": 6079.998,
    "text": "The moon moves, the oceans move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.341,
    "end": 6083.665,
    "text": "Are they biotic in their self-organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.065,
    "end": 6085.648,
    "text": "I think you'd be looking now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6085.628,
    "end": 6096.592,
    "text": " for a special kind of movement which emphasizes this mixture of solenoidal and dissipative dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6097.194,
    "end": 6102.726,
    "text": "So sandwiched in between the very big and the very small is a Goldilocks regime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6103.077,
    "end": 6123.195,
    "text": " where indeed you do have this opportunity for the biotic kind of self-organization that characterizes our existence, that is not only manifest in terms of delicately crafted solenoidal diversion 3 dynamics, but also nested at different time scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.175,
    "end": 6146.871,
    "text": " so just think about all the different time scales that your body entertains solenoidal dynamics rotational dynamics from the fast gamma oscillations again in that uh hippocampal neuron through to um your um cardiac cycle through to your respiratory cycle through to the your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6146.851,
    "end": 6161.856,
    "text": " diurnal cycles through to your slower cycles right through to your life cycle and so on and so forth and then you take it up to any scale you want but the key thing the point being made here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6162.275,
    "end": 6183.372,
    "text": " is that not only do you have this admixture of dissipative gradient flows that underwrite self-evidencing this is in the context of this solenoidal flow at multiple scales at nested scales so again we come back to this deep nesting so on that view there will be a golden locks regime",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.773,
    "end": 6213.73,
    "text": " and of course it is only at that in that regime will you ever get systems that start to self-model and communicate and co-construct their their niches will you get cultural niche construction will you get the kind of will you get language will you have conversations like this it's not going to happen at the level of macromolecules or cells and it's not going to happen at the level of heavenly bodies but it will happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6213.71,
    "end": 6214.731,
    "text": " at our level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6215.432,
    "end": 6220.62,
    "text": "And clearly has happened, if I can believe my senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6222.702,
    "end": 6236.882,
    "text": "Yeah, I guess the Yes, I guess the I mean, my follow up my my inevitable follow up would be why are there these different sizes, but I don't I don't want to get into that because it's just turtles all the way down about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6237.031,
    "end": 6254.972,
    "text": " why i don't know i mean we can bring it to close very quickly but that's it it is turtles all the way down that's i i think a fundamental insight uh and once you once you commit to that everything starts to make a lot more sense so um you know just in terms of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6255.509,
    "end": 6284.807,
    "text": " know how long will my markov blanket last well it will last you know for a long time at my temporal scale but the um the scale above um will last much longer so i have an environment and a niche that lasts longer than i do and my body lasts longer than anyone's cell and my cell less lasts longer than any one intercellular component and you know that component will last longer than any particular macromolecular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6284.787,
    "end": 6285.928,
    "text": " configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6286.429,
    "end": 6291.435,
    "text": "So it is all the way down and you need it at each level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6291.495,
    "end": 6306.371,
    "text": "You have to have the context being a thing, having its own Markov blanket at its scale in order to provide the context for the faster coming and going of Markov blankets at the lower scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6306.391,
    "end": 6312.178,
    "text": "But in the same sense, because the larger scale inherits from the dynamics of the lower scale,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.158,
    "end": 6318.129,
    "text": " There's a circular causality, which people like George Ellis would cast in terms of top-down and bottom-up causation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6319.331,
    "end": 6322.236,
    "text": "Put simply, what that means is I cannot exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6322.877,
    "end": 6323.939,
    "text": "Well, let's put it another way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6324.5,
    "end": 6329.509,
    "text": "My hippocampal cell cannot exist unless my brain is in good shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6329.725,
    "end": 6336.455,
    "text": " My brain cannot be in good shape unless I'm doing good active inference and relating correctly within my family and my conspecifics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6336.956,
    "end": 6344.327,
    "text": "My conspecifics cannot work, exist, unless there is a biosphere that sustains that kind of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.567,
    "end": 6349.735,
    "text": "The biosphere cannot exist, and so on and so forth, all the way up and all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6350.055,
    "end": 6353.961,
    "text": "At every level there are things, and those things have to have Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6353.941,
    "end": 6382.834,
    "text": " and at every level they can be construed as doing some kind of elemental inference or self-evidencing um the story we're telling though is the special kind of self-evidencing that comes out at a particular scale but the existence of that scale requires exactly the same um i repeat from the perspective of the renormalization group it requires exactly the same dynamics or lagrangian or functional form of the dynamics um at you know at every level and you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6382.814,
    "end": 6405.548,
    "text": " on this view because the explanatory target of the free energy principle is basically relational it's trying to understand self-organization of a thing that can be individuated in this context and in terms of what it is contextualizing it's a very myopic ambition it doesn't describe you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6405.528,
    "end": 6410.257,
    "text": " cosmology or the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6410.477,
    "end": 6413.082,
    "text": "You're not going to get electromagnetism from the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6413.122,
    "end": 6421.217,
    "text": "And so it doesn't really have to worry about what is the largest scale or what is the smallest scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6421.237,
    "end": 6422.98,
    "text": "You can keep on going all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6423.837,
    "end": 6440.04,
    "text": " if you had to hedge your bets because i guess it is a hedge better bet hedger rather um does it stop does does the does is it or is it just it just goes on mark of blankets on mark of blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.172,
    "end": 6441.253,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6441.513,
    "end": 6443.175,
    "text": "Mathematically, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6443.255,
    "end": 6450.283,
    "text": "It's a little bit like you asked me, where's the edge of the earth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6450.403,
    "end": 6451.484,
    "text": "When does the earth stop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6452.485,
    "end": 6458.892,
    "text": "If you're committed to the renormalization group, now it just keeps on going forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6463.517,
    "end": 6466.72,
    "text": "I'm quite comfortable with that because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6467.088,
    "end": 6474.756,
    "text": " it emerges from a question, which is, what is a state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6475.656,
    "end": 6482.383,
    "text": "So we've been talking glibly about state spaces, statistical manifolds, and states of affairs, and hidden states and latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6483.664,
    "end": 6495.576,
    "text": "To have a state space, and specifically to have a state space that can be interpreted or construed as a statistical manifold,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6495.792,
    "end": 6499.097,
    "text": " You have to have states, but where do states come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6501.501,
    "end": 6504.345,
    "text": "And the argument, sorry, I shouldn't ask you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6505.507,
    "end": 6507.99,
    "text": "The argument is that they are the states of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6508.711,
    "end": 6509.733,
    "text": "Where do things come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6510.214,
    "end": 6512.016,
    "text": "We just said it's a partition of state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6512.778,
    "end": 6513.759,
    "text": "Where do the states come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6514.46,
    "end": 6516.383,
    "text": "If you try to answer that question,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6516.734,
    "end": 6527.112,
    "text": " then all you have to do is basically determine the mapping between things or particles and states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6527.192,
    "end": 6528.415,
    "text": "And the answer is quite simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6528.515,
    "end": 6539.434,
    "text": "It is basically one way of looking at this sort of, or using the apparatus of the renormalization group, that the state of a thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6539.414,
    "end": 6543.284,
    "text": " is the state of its Markov blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.166,
    "end": 6555.254,
    "text": "And then that state itself now has a Markovian or a partition into Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6555.274,
    "end": 6557.018,
    "text": "So you now get blankets and blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6556.998,
    "end": 6562.87,
    "text": " And so that you can resolve the paradox or the catch-22.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6563.932,
    "end": 6565.255,
    "text": "What's the state of something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6565.375,
    "end": 6566.157,
    "text": "Well, what's the thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6566.337,
    "end": 6571.127,
    "text": "Well, a thing is determined by conditional independence among the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6572.25,
    "end": 6577.2,
    "text": "You can resolve that infinite regress just by saying it is just a recursion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6577.417,
    "end": 6585.312,
    "text": " States at one level inherit the averages of the Markov blanket states of things at the next level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6585.612,
    "end": 6587.957,
    "text": "But at every level, there are things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6588.438,
    "end": 6591.664,
    "text": "So you have this, you just keep on going down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6592.045,
    "end": 6593.367,
    "text": "I should say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6593.347,
    "end": 6599.299,
    "text": " There are people who believe that there is a smaller scale or it is sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6599.66,
    "end": 6613.549,
    "text": "I'm not absolutely sure about this, but if you ever get the chance in later life, if you can talk to, again, people like Carlo Rovelli or Stephen Wolfram, from the point of view of quantum loop gravity and from the point of view of the Rulliad,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6613.529,
    "end": 6633.04,
    "text": " then there is this notion that there is some irreducible smallness scale beyond which you can't go, and then the game is how do you get a continuous world out of this sort of quantum, discrete, very, very small description of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6633.931,
    "end": 6634.231,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6634.933,
    "end": 6635.914,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6636.735,
    "end": 6643.045,
    "text": "Strange loops makes me think of Hofstadter and strange loops also makes me think slightly of the holographic principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6643.405,
    "end": 6647.111,
    "text": "Well, you just mentioned there about projections onto the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6648.773,
    "end": 6652.158,
    "text": "This notion of reading off the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6653.42,
    "end": 6656.385,
    "text": "You said something that I said, we had three things I wanted to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6656.605,
    "end": 6660.251,
    "text": "And we've covered temporality, albeit over a long temporal scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6660.651,
    "end": 6663.195,
    "text": "Once very quickly ask, you mentioned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6663.445,
    "end": 6671.335,
    "text": " in passing about celestial bodies being nearly deterministic and my ears pricked up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6674.94,
    "end": 6688.677,
    "text": "On an internalist model of the free energy principle, I sense that there's actually a kind of licensing for free will because we have this internal model and we act upon the world as to confirm the model that we wish to observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6688.96,
    "end": 6713.027,
    "text": " an externalist perspective where we really are no different from another physical entity except for the fact that we have the possibility of moving things and and acting to to self-evidence there isn't so much space for free will but my ears picked up when you spoke about agency and when you spoke about the celestial bodies being nearly deterministic because it makes me think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6713.227,
    "end": 6719.22,
    "text": " It seems to imply, at least heuristically, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.538,
    "end": 6743.929,
    "text": " being open to the environment, being an itinerant being licenses agents agency, but I want to make sure this is true metaphysical agency in the sense of not hard determinism, um, or whether this is agency in the sense of self conception as a free agent, because those are two different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6744.89,
    "end": 6745.09,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6745.762,
    "end": 6749.591,
    "text": " it's we won't be denying that we perceive ourselves to be free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6750.493,
    "end": 6753.82,
    "text": "I guess the fun, the more fundamental question there is whether that's an illusion or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6754.281,
    "end": 6763.241,
    "text": "And so I was wondering whether free energy principle has anything to say about a kind of libertarian versus deterministic perspective on free will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6764.945,
    "end": 6765.306,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6766.298,
    "end": 6775.549,
    "text": " Well, I mean, you could certainly use the free energy principle to tell stories that speak to those arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6776.913,
    "end": 6779.582,
    "text": "And I think you've picked up on some of the key",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6779.782,
    "end": 6802.161,
    "text": " parts of those stories um so you know deterministic chaos that you get with n-body problems when thinking about so massive bodies dancing around each other um you know there is still chaos in mix in the mix um so there's an unpredictability and sensitivity to initial conditions in in the good old-fashioned way of um non-linear dynamical system theory of a deterministic sort",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6802.141,
    "end": 6824.453,
    "text": " But once you get to things like you and me, you're really in the world of stochastic chaos, so the stochastic bit inheriting from the random fluctuations, where you've got two kinds of, if you like, two aspects of uncertainty, and implicitly then in modeling that uncertainty,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6824.433,
    "end": 6829.76,
    "text": " the opportunity to talk about free will and selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6830.781,
    "end": 6847.723,
    "text": "One interesting twist here is that if you want to apply the free energy principle as a principle of least action to things like you and me, what you have to imagine is that we are deterministic things in a stochastic and chaotic world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.703,
    "end": 6853.749,
    "text": " So in making sense of things, we only do so at a particular scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6853.789,
    "end": 6859.415,
    "text": "We're talking before about the averaging away, when I'm sufficiently big to average away my random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6860.476,
    "end": 6865.281,
    "text": "Under the free energy principle, that literally means you have to take the average of lots of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6865.821,
    "end": 6873.829,
    "text": "So the kind of sense making, the kind of dynamics that you would simulate under the free energy principle applies to and only to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6873.809,
    "end": 6893.185,
    "text": " the ensemble behavior where you can average away any of the stochastic aspects so you will not get you will not be able to deduce evidence or um solicit or find evidence for the free energy principle by looking at single neuron or single synaptic it has to be at the ensemble level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6893.165,
    "end": 6897.171,
    "text": " where there are all sorts of arguments why that has to be the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6897.191,
    "end": 6903.02,
    "text": "But from our point of view, it's when the random fluctuations are averaged away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6904.342,
    "end": 6906.666,
    "text": "So I'm disqualifying what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6906.826,
    "end": 6911.333,
    "text": "I'm not saying that the brain is stochastic or shows stochastic chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6911.914,
    "end": 6918.244,
    "text": "What I'm saying is that the brain has to provide an apt explanation or approximation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6918.224,
    "end": 6920.768,
    "text": " to explain stochastic chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6920.788,
    "end": 6931.003,
    "text": "And crucially, the stochastic chaos associated with our own behaviour, with the consequences of our own actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6931.363,
    "end": 6937.272,
    "text": "So you've got a deterministic system trying to now model a non-deterministic stochastic chaotic system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6937.732,
    "end": 6944.282,
    "text": "And in so doing, well, that's easy to do because, of course, we're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6944.262,
    "end": 6948.867,
    "text": " that modeling being in terms of belief or probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6949.147,
    "end": 6950.348,
    "text": "So that's absolutely no problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6951.61,
    "end": 6967.907,
    "text": "So on that view, I think you could easily motivate free will of a certain kind in the sense that when you're planning, you have effectively to select",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6968.174,
    "end": 6972.699,
    "text": " amongst different models of the future, technically based on model selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6973.3,
    "end": 6974.681,
    "text": "And selection is an act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6975.382,
    "end": 6995.004,
    "text": "And so again, we have a different kind of agency here, but it's a kind of agency inherent in the selection amongst competing plans or policies, narratives, paths into the future that I think has all the space to say that this, and it's you doing the choosing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6995.204,
    "end": 6996.325,
    "text": "Remember, you can't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6996.777,
    "end": 7002.564,
    "text": " There's nothing on the outside that can influence directly that choice on the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7003.066,
    "end": 7005.859,
    "text": "So from your point of view, you certainly have free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7006.447,
    "end": 7009.351,
    "text": " Would it look like you have free will from the outside?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7009.371,
    "end": 7013.117,
    "text": "I think that's a more vexed question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7013.738,
    "end": 7027.898,
    "text": "Of course, you'll never know, but I think you'd probably be in the game of, again, practically how I spend most of my day job, is inferring to what extent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7027.878,
    "end": 7036.155,
    "text": " is this artifact or this person doing good planning as inference, good planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7037.658,
    "end": 7047.237,
    "text": "For example, if somebody is in a coma or asleep or has a psychiatric disorder, you need to know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7047.217,
    "end": 7054.171,
    "text": " to what extent they are and in what way they are self-modelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7057.278,
    "end": 7065.174,
    "text": "This is a slightly sort of clinical and abstract example, but it illustrates the point that you will never know whether something has free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7065.655,
    "end": 7068.06,
    "text": "All you can do is infer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7068.462,
    "end": 7091.263,
    "text": " that they are behaving as if they had a generative model that entailed a self-model and thereby a model of the consequences of action and therefore as if they were a true agent and possibly they may know they're a true agent they may not you know they may be again you know that would require another level of of the Markov blanket is that what you had in mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7091.8,
    "end": 7104.296,
    "text": " Yes, I mean, I think, I guess the kind of hardline determinist response would always be pushing you to say whether that organism or particle could have done otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7105.298,
    "end": 7118.695,
    "text": "So it may have this reflexive quality of okay, I'm doing Bayesian model selection, to my sense of self, and we will come to consciousness, because I think that's the kind of crux of this issue is why is any of this happening online anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7119.416,
    "end": 7120.137,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7120.741,
    "end": 7134.885,
    "text": " it might have this self reflexive notion of being a free agent, but the hard line determinists from the kind of external position of physics might always say, well, could that bundle of atoms ever have done otherwise, in terms of its Bayesian model selection?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7135.372,
    "end": 7142.539,
    "text": " But it's, again, it might just be one of these sort of loops that just keep spinning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7144.481,
    "end": 7147.684,
    "text": "Yeah, it's all fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7147.784,
    "end": 7158.876,
    "text": "I had a question that I've just popped out of my head when I was talking about free will, which was, I will come back to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7159.156,
    "end": 7160.397,
    "text": "It will come back to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7162.519,
    "end": 7163.32,
    "text": "Consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7165.274,
    "end": 7177.473,
    "text": " I don't know if we can call it a red herring yet in the academic world, because it's become a very hot topic and people are getting very heated about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7177.513,
    "end": 7182.14,
    "text": "And there's no need to bring up particular examples of when people have got heated about it, but people are very invested in their theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7184.063,
    "end": 7184.944,
    "text": "And I guess rightly so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7184.964,
    "end": 7193.357,
    "text": "It seems to be this one thing that people can't seem to couch within their theories of everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7193.692,
    "end": 7194.734,
    "text": " if they have one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7195.995,
    "end": 7200.963,
    "text": "Starting with a very simple question, do you consider it to be a real problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7201.303,
    "end": 7203.306,
    "text": "Do you take something like the hard problem seriously?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7203.346,
    "end": 7206.351,
    "text": "Or for you, is it more of a meta question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7206.411,
    "end": 7213.201,
    "text": "Or does a deflationary account just do the job in terms of the hard problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7216.205,
    "end": 7218.248,
    "text": "It really depends who I'm talking to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7218.464,
    "end": 7222.788,
    "text": " as my friend Jeff Beck would say, it depends which pants I'm wearing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7222.809,
    "end": 7237.103,
    "text": "I think very much it's a question of a conversation and you have to infer how much investment the person you're talking about has in this issue and what position they're taking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7237.824,
    "end": 7247.374,
    "text": "And I mean that just in terms of being polite and engaging with integrity in scientific debate or indeed philosophical debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7247.354,
    "end": 7254.222,
    "text": " but I also made it in a slightly more fundamental way that consciousness is an illusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7254.643,
    "end": 7258.287,
    "text": "And I think illusions are fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7258.468,
    "end": 7259.569,
    "text": "They're literally fantasies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7259.949,
    "end": 7262.492,
    "text": "And I think that's what makes our brains fantastic organs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7262.853,
    "end": 7263.994,
    "text": "I think they're hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7264.395,
    "end": 7270.702,
    "text": "I think that the illusion is the thing that we test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7270.742,
    "end": 7273.686,
    "text": "It is the thing that generates the predictions in predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7274.147,
    "end": 7276.99,
    "text": "So I think consciousness is another illusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7276.97,
    "end": 7306.504,
    "text": " very much along the lines that one reading of Andy Clark's basing qualia paper that even qualitative experience qualia are just illusions they're just things they're just constructs we bring to the table including selfhood they're just hypothesis illusions that are particularly apt at explaining everything that we sense and making good sense of it as a parsimonious hypothesis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7307.007,
    "end": 7321.949,
    "text": " Consciousness itself, I think, is exactly that, because it only applies, the hypothesis, is this thing conscious or not, only applies because there are other things in my universe that I have to model, like you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7322.751,
    "end": 7332.185,
    "text": "So the question is not whether I am conscious, the question is whether you are conscious, and of course we've already said that is unanswerable because you have a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7332.986,
    "end": 7335.63,
    "text": "So it's an unanswerable question,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7335.914,
    "end": 7341.277,
    "text": " but crucially it's a question about the things I observe that I'm trying to make sense of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7342.462,
    "end": 7344.49,
    "text": "It only becomes, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7345.533,
    "end": 7348.998,
    "text": " only in the spirit of the meta-hard problem or the meta-problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7350.039,
    "end": 7357.188,
    "text": "It only becomes vexed when you make the mistake of asking, am I conscious?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7357.729,
    "end": 7360.413,
    "text": "I don't think that's what the question is there for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7360.473,
    "end": 7362.936,
    "text": "The illusion is not for me, it's for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7363.957,
    "end": 7374.291,
    "text": "The illusion is the consciousness is a construct, a hypothesis, and a very plausible one, and all the evidence that I have at hand would suggest that you are conscious, and indeed,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7374.271,
    "end": 7399.198,
    "text": " literally because there is that evidence it is there in the sense of an evidence maximizing illusion hypothesis or component of my generative model so I go through that just to make it clear that you know the answer depends upon who you're talking to but also who you're trying to ascribe consciousness to so if I was talking to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7401.068,
    "end": 7413.041,
    "text": " Well, if I was talking to people like Jacob Hoey, the first thing he'd say is that the free energy principle is not a theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7413.521,
    "end": 7416.585,
    "text": "And in fact, he likes saying that at every opportunity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7417.045,
    "end": 7428.257,
    "text": "So there's nothing in the free energy principle that has anything explicit to say about consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7428.507,
    "end": 7433.939,
    "text": " On the other hand, people have used it in different ways to address the hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7436.384,
    "end": 7446.567,
    "text": "You could take the view that Andy Clark takes, that there isn't a hard problem, and perhaps even with David Chalmers' work recently on the meta-hard problem, that's probably a more interesting problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7446.547,
    "end": 7450.751,
    "text": " Or you could grasp the nettle and start to talk about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7451.492,
    "end": 7472.014,
    "text": "If you were talking to my colleagues, Chris Frith and Adam Saffron and Maxwell Ramstead, I think inspired by something that you mentioned earlier on, which was the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7471.994,
    "end": 7493.766,
    "text": " holographic principle in quantum information theory where the holographic screen now plays a role of the Markov blanket that separates the inside and the outside in terms of bulk reading and writing to the holographic screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7493.746,
    "end": 7521.897,
    "text": " If you're talking to him, then he would start to talk about these minimal screens, these minimal Markov blankets, and develop quite a nice argument that if you can't reduce, in the sense that we're talking about nested Markov blankets inside a Markov blanket, if there are no more reductions at hand, then the only way that the internal states of that irreducible Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7522.214,
    "end": 7540.374,
    "text": " can know about their own existences by acting upon lower levels and therefore there's something unique, there exists a unique Markov blanket that maybe have the attribute of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7541.135,
    "end": 7548.964,
    "text": "If you're talking to somebody like Vanier Weiss, he would tackle this in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7548.944,
    "end": 7561.644,
    "text": " trying to resolve a dualistic position by offering a dual aspect monism of a Markovian sort and that rests very heavily upon this information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7562.145,
    "end": 7574.665,
    "text": "So if you remember before we're talking about sort of a state space equipped with free energy functionals on it that plays a role of a syscal manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7574.645,
    "end": 7583.695,
    "text": " But there are two statistical manifolds that jointly sit in the same space of, say, neural activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7584.396,
    "end": 7594.127,
    "text": "One is that for any given point, there is a probability of being there from a point of view of neuronal activity and the thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7594.427,
    "end": 7599.032,
    "text": "So this would be a thermodynamic kind of information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7599.417,
    "end": 7607.826,
    "text": " And then the other one is what the free energy principle uses, which is using that point to encode beliefs about external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7608.507,
    "end": 7626.066,
    "text": "So you've got two information geometries, belief structures, if you like, that supervene on exactly the same material process, one of which pertains to probability distributions or beliefs about the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7626.333,
    "end": 7634.193,
    "text": " and the other one is probability distributions or beliefs encoded by the internal states about the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7634.794,
    "end": 7638.604,
    "text": "So you could construe one as being the mental and one as being the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7638.888,
    "end": 7654.306,
    "text": " And then you've got this dual aspect monism where you're now asking questions about, well, what are the lawful relationships between the thermodynamic free energy and the variational free energy that pertains to beliefs about things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7654.607,
    "end": 7663.377,
    "text": "So you've got now a mechanics that talks about beliefs, and that may well be one way of repairing that sort of dualistic approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7663.357,
    "end": 7692.739,
    "text": " There's another perspective which you would get if you were talking to people like Giulio Tononi and Cyril, well, my colleagues involved in one of the Templeton Foundation Abusera research collaborations, where you're trying to find bright lines between the free energy principle and integrated information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7692.719,
    "end": 7712.652,
    "text": " um which is not necessarily the best thing to do because a lot of integrated information theory is exactly consilient with the free energy principle however if you are going to get funded by trying to tease them apart then the thing that distinguishes those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7712.632,
    "end": 7720.303,
    "text": " approaches to consciousness is really the active part that we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7720.883,
    "end": 7730.877,
    "text": "So boiling this down in a way that somebody like, I repeat, Jacob Howie might articulate this is, it's the difference between seeing and looking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7731.177,
    "end": 7733.52,
    "text": " To be conscious, I have to look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7734.021,
    "end": 7735.002,
    "text": "It's not enough to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7736.484,
    "end": 7739.629,
    "text": "To be conscious, I have to listen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7739.929,
    "end": 7741.191,
    "text": "It's not enough to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7742.172,
    "end": 7744.015,
    "text": "So you're putting action into games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7744.035,
    "end": 7745.337,
    "text": "There's active sensing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7745.797,
    "end": 7749.743,
    "text": "There's sort of closing the loop between the inside and the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7749.723,
    "end": 7757.436,
    "text": " may be the thing that is necessary for consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7758.077,
    "end": 7767.752,
    "text": "And simply because you're saying that consciousness is an attribute of agents, and agents have to act, what do they act on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7767.993,
    "end": 7768.814,
    "text": "Their sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7769.315,
    "end": 7770.437,
    "text": "What does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7770.777,
    "end": 7772.159,
    "text": "They do active sensing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7772.56,
    "end": 7774.724,
    "text": "So to be an agent is to be an active sensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7775.064,
    "end": 7776.186,
    "text": "Yes, to do active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7776.571,
    "end": 7783.323,
    "text": " If you're saying that things that aren't agents can be conscious, then you wouldn't worry about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7783.584,
    "end": 7793.922,
    "text": "But if you are committed to the notion that to be conscious, to have a minimal selfhood,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7793.902,
    "end": 7797.446,
    "text": " then you have to have the notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7797.866,
    "end": 7800.329,
    "text": "If you have to have the notion of self, then you have to be an agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7800.389,
    "end": 7808.818,
    "text": "If you have to be an agent, you have to have generative models about the consequences of your agency, your actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7809.418,
    "end": 7816.846,
    "text": "And then we go through all of those nice links that we were talking about before with temporality and the like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7817.006,
    "end": 7823.233,
    "text": "And indeed, the hierarchical structure takes us back to the Crisfields irreducible idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7823.213,
    "end": 7849.288,
    "text": " holographic screen or um or markov blanket so that would be the way that i would um converse with that crowd uh uh i've run out yes i've run out of people that i might talk about it so i have to find out what you like and then i'd i'd tell a story that you like or let you tell a story that uh that you like well i guess my question to you would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7849.825,
    "end": 7855.295,
    "text": " Can you imagine a world of self evidencing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7855.415,
    "end": 7855.996,
    "text": "Can you imagine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7856.016,
    "end": 7857.158,
    "text": "Okay, let's put it another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7857.178,
    "end": 7864.531,
    "text": "Can you imagine a perfect replica world like ours, where the lights are turned off entirely, there is no consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7865.192,
    "end": 7867.817,
    "text": "Or is it Do you imagine it's a necessary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7868.776,
    "end": 7883.179,
    "text": " consequence of the way that creatures like us are structured, that to do deep temporal planning, to do planning as inference, whatever it is, or self-hooding, we need consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7884.421,
    "end": 7888.287,
    "text": "Could there have been another way that the universe would have unfolded without us being online?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7889.617,
    "end": 7891.26,
    "text": " I suspect not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7892.481,
    "end": 7911.591,
    "text": "Sorry, I'm torn between being taken by you down sort of your philosophical zombie routes versus another story that comes out in the Free Energy Principle about consciousness, which is the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7911.571,
    "end": 7922.392,
    "text": " the importance of self-modelling in relation to other modelling and the fact that we are actually living in a world of things like us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7923.073,
    "end": 7934.575,
    "text": "One story I didn't cover, which is a story you would tell if you were talking to my friend Chris Frith or people who are much more interested in the social neuroscience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7934.555,
    "end": 7946.347,
    "text": " or, say, attachment theory and neurodevelopmental issues that are induced by evolutionary psychology view or niche construction, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7947.028,
    "end": 7962.064,
    "text": "All of these views of consciousness means that consciousness is just there, which is where I started, to infer the state, the disposition, the intentions, state of mind of somebody else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7962.314,
    "end": 7964.177,
    "text": " Why and how can you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7964.458,
    "end": 7978.905,
    "text": "Well, you can only do that if that thing is sufficiently like you to be able to use your generative model of, say, your physical actions as a model of their physical actions to infer their intentions and the like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7978.885,
    "end": 7995.713,
    "text": " And when one takes that to its limit, then often what the real problem is is not in terms of inferring the content of some communication or some exchange of semiotic cues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7996.314,
    "end": 7998.378,
    "text": "It really is inference about agency again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7998.658,
    "end": 8001.022,
    "text": "It's did you do that or did I do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8001.042,
    "end": 8004.488,
    "text": "So that ambiguity now requires you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8004.468,
    "end": 8008.013,
    "text": " to have a model of self versus other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8008.073,
    "end": 8011.959,
    "text": "So it's a much more relational notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8011.979,
    "end": 8018.209,
    "text": "So, you know, sometimes I think people talk about minimal selfhood as something which is monolithic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8018.509,
    "end": 8020.452,
    "text": "I don't think that's necessary as part of a gender model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8020.472,
    "end": 8025.42,
    "text": "It certainly would be important to have different kinds of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8026.061,
    "end": 8027.162,
    "text": "You know, am I embarrassed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8027.262,
    "end": 8028.084,
    "text": "Am I in love?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8028.104,
    "end": 8030.948,
    "text": "You know, as we were talking about, you know, in the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8030.928,
    "end": 8033.271,
    "text": " TMB meeting a few days ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8033.291,
    "end": 8043.624,
    "text": "That would be an expressive and very necessary part of the generative model where I have to contextualise my own emotional and pro-social and autonomic and moteric behaviours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8044.605,
    "end": 8046.487,
    "text": "But there's no one self, it's a self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8047.709,
    "end": 8050.252,
    "text": "Self like this, like this and like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8050.272,
    "end": 8056.159,
    "text": "A more fundamental relationship, relational aspect of selfhood is in relation to otherhood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8056.139,
    "end": 8061.17,
    "text": " You know, versus me, and am I mum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8062.152,
    "end": 8064.336,
    "text": "Or is mum a thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8064.377,
    "end": 8065.278,
    "text": "Am I a thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8066.481,
    "end": 8067.463,
    "text": "I'm the same thing as mum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8067.984,
    "end": 8075.38,
    "text": "You know, he's going to sort of Kleinian sort of arguments there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8075.36,
    "end": 8090.603,
    "text": " Put simply, what that means is it may well be only in universes or worlds that are populated by ensembles of conspecifics that are sufficiently similar would you need selfhood, simply to distinguish self from other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8091.184,
    "end": 8095.09,
    "text": "In a universe where there's only me, I wouldn't need selfhood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8095.677,
    "end": 8104.432,
    "text": " So it would not pay its way in terms of model complexity or model evidence to have the notion of me being a self if there's only me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8104.852,
    "end": 8113.627,
    "text": "It only pays its way if I now have to entertain the hypothesis that either I caused that or you caused that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8114.128,
    "end": 8121.6,
    "text": "So the question now is, is it inevitable that you get a universe with lots of similar things emerging",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8121.58,
    "end": 8134.138,
    "text": " all disambiguating themselves or attributing agency to themselves in the golden in the golden zone i think it probably is i think that would be i think if you simulated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8134.827,
    "end": 8138.152,
    "text": " sufficiently accurately artificial life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8138.292,
    "end": 8157.578,
    "text": "I think you would get the emergence of populations of similar things and they would niche construct and they would thereby drive their own increasingly nested and structurally complicated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8157.558,
    "end": 8165.688,
    "text": " or sparsely structured organisations in terms of their Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8166.669,
    "end": 8180.005,
    "text": "And this at some point would inevitably invoke modelling of others and therefore almost by default,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8181.925,
    "end": 8198.771,
    "text": " of self of selfhood, I think that would be emergent, you know, but it would require being in the Goldilocks regime for a sufficient amount of time for this kind of niche construction, cultural niche construction to actually play out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8198.811,
    "end": 8207.665,
    "text": "So, you know, you'd have to have this very slow timescale, providing the right kind of context for this, this kind of thing to think to emerge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8208.507,
    "end": 8208.827,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8209.499,
    "end": 8220.707,
    "text": " Yeah, I think I have some sympathies to the argument that Chalmers did lay out in 95 in his original hard problem paper, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8221.312,
    "end": 8231.766,
    "text": " I think I can still ask the further question, which is, can systems like me make the functional distinction between myself and others without there being a sense of what it's like to be me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8232.787,
    "end": 8243.421,
    "text": "Can that just be an offline-ness, which is done purely in some algorithmic manner, which need not involve some qualia of myself-ness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8243.738,
    "end": 8251.389,
    "text": " So yeah, there's a point that there's an element in me where I don't want to say that that in a sense resolves a hard problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8252.31,
    "end": 8257.838,
    "text": "Because at least I can hypothetically envision that being done offline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8259.58,
    "end": 8267.451,
    "text": "I wonder whether you've given much thought to Mark Soames his idea, which is that consciousness might be rooted in affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8268.494,
    "end": 8273.782,
    "text": " Because this seems to me to be a bit more of a self-confirming idea, which is that feelings must be felt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8274.783,
    "end": 8284.577,
    "text": "Now, I think there's still an open question there, which is affect arises at the point of uncertainty and drives us to resolve uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8285.539,
    "end": 8287.341,
    "text": "And when we do so, we feel good about ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8287.602,
    "end": 8291.547,
    "text": "Now, again, I still think when I was reading his book, I still had this open question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8291.587,
    "end": 8294.572,
    "text": "Why would affect even emerge in that place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8294.592,
    "end": 8296.915,
    "text": "Why wouldn't we just have this drive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8296.979,
    "end": 8300.043,
    "text": " to resolve that uncertainty without there being the onlineness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8300.824,
    "end": 8316.965,
    "text": "So at least for me, although I may be wrong, and I'm very happy to be wrong, there is still no simple parsimonious explanation which can get around this point that Chalmers makes, which is you can give me the function, but you can't give me the explanatory power why it needs to be online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8318.607,
    "end": 8323.493,
    "text": "And I wonder if there ever will be some mechanism which is sufficiently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8323.827,
    "end": 8335.325,
    "text": " which isn't just purely tautological or invokes consciousness as some fundamental reality, which makes me wonder whether you've heard of Donald Hoffman, whether you're familiar with his work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8337.248,
    "end": 8349.987,
    "text": "Because I sense that in some ways it has some interesting implications maybe for the free energy principle in the sense of space and time not being fundamental units of reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8350.979,
    "end": 8355.965,
    "text": " we've been speaking a little bit about how, where do space and time come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8356.045,
    "end": 8371.264,
    "text": "How much do space and time overlap in the sense of generating, like we need expansive creatures like us with embedded Markov blankets inevitably have a sense of temporal modeling, and there's these interesting interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8372.045,
    "end": 8374.388,
    "text": "Does the idea of space and time being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8375.363,
    "end": 8377.994,
    "text": " what he would say applications on a desktop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8378.014,
    "end": 8383.257,
    "text": "Does that have any real do you sense has any real ontological implications for free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8383.277,
    "end": 8384.462,
    "text": "Or is it a red herring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8385.927,
    "end": 8388.432,
    "text": " Well, you've introduced two important things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8388.592,
    "end": 8392.138,
    "text": "I forgot to mention Mark Soames is another friend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8393.701,
    "end": 8400.093,
    "text": "I would say it's all about this irreducible Markov blanket that acts upon the rest of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8400.333,
    "end": 8401.215,
    "text": "Where is that action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8401.235,
    "end": 8405.843,
    "text": "It's going to be in the neuromodulator systems that set the precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8405.823,
    "end": 8410.89,
    "text": " The precision is exactly that Fisher metric, which tells you about how much you're updating your beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8411.311,
    "end": 8413.133,
    "text": "It is the way that you do mental action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8413.474,
    "end": 8422.727,
    "text": "It is, as you intimated, feeling in the sense that it is quintessentially balanced by increasing or decreasing the precision or uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8423.208,
    "end": 8426.312,
    "text": "So that's how I would...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8426.596,
    "end": 8436.471,
    "text": " tie in Mark's formulation, which I think is internally consistent with, say, Chris Field's formulation or Vanier's formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8436.731,
    "end": 8447.948,
    "text": "So Mark focuses on, I think, a key aspect of active inference, which is, if you're a psychologist, it will be attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8448.268,
    "end": 8452.114,
    "text": "It's basically acting in a way on the inside",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8452.094,
    "end": 8467.901,
    "text": " to get the estimate and deploy the right confidence or the right precision in mathematically the curvature of the free energy in and of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8468.823,
    "end": 8475.975,
    "text": "Getting that right and that has a lovely connection to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8476.478,
    "end": 8495.854,
    "text": " attention it means that you can't divorce um consciousness from attention you can't divorce it from agency in the sense of mental action or internal action you now have a deep connection to um thomas metzinger's um the distinction between your um opaque and phenomenal transparency",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8495.834,
    "end": 8505.026,
    "text": " And the way that Mark would tell the story would be that this is just feeling, and feeling is at the heart of any qualitative experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8506.428,
    "end": 8513.598,
    "text": "So, yeah, thank you for reminding me he was one person I forgot to cover.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8514.419,
    "end": 8518.965,
    "text": "The second thing, you know, the space and time being illusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8519.586,
    "end": 8524.272,
    "text": "I mean, yeah, I sort of start off there, so I'm not quite sure that it...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8524.252,
    "end": 8532.361,
    "text": " So if you're saying that Donald's, and I should say he's a friend, I think, I've never met him, but I think he's a friend of Chris Field and Mike Levin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8532.761,
    "end": 8536.105,
    "text": "So, you know, there's a small world here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8536.946,
    "end": 8547.998,
    "text": "But if you're just saying that space and time are illusions in the sense that we would talk about illusions as being fantastic and the thing that makes us into fantastic little beings and have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8547.978,
    "end": 8552.636,
    "text": " beings and our brain into a fantastic organ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8552.877,
    "end": 8553.761,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8553.962,
    "end": 8559.102,
    "text": "I mean, the question for me is why on earth would you, what, what,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8559.267,
    "end": 8565.494,
    "text": " what must be the case for us to have this illusion of space-time and that we are living in a metric space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8565.514,
    "end": 8566.916,
    "text": "And it's practically very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8566.976,
    "end": 8572.522,
    "text": "I mean, a lot of people spend a lot of time in machine learning embedding things in metric spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8573.463,
    "end": 8577.107,
    "text": "And sometimes it's very difficult to see what licenses is there to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8577.808,
    "end": 8582.153,
    "text": "You can certainly see how it would work in terms of projective geometries in metric spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8582.133,
    "end": 8605.997,
    "text": " um but the deep question is why you know you know i can't um i can't imagine a um you know uh an amoeba really having having a notion of of uh space um i may be wrong um and so knows um um you know if you listen to people like um um stephen wolfram um you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8605.977,
    "end": 8614.333,
    "text": " the notion of space-time itself may, the illusion of space-time itself may be just an artifact of the fact that our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8614.482,
    "end": 8644.017,
    "text": " sensory organs respond very very slowly in relation to the speed of light so if light traveled very very slowly we imagine a world in which um we saw with sound and sound was very very very slow um would that would that be would that give you the illusion of space um you know a distance as an action of the kind that you know we sort of implicitly assume when we're talking about sort of visual objects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8643.997,
    "end": 8655.795,
    "text": " So I think he has this nice notion that in this kind of world, with these kinds of sense organs, when something moves from here to here, is it the same thing anymore?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8656.316,
    "end": 8659.942,
    "text": "Because that's what you're saying when you have a metric space in which objects move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8661.724,
    "end": 8668.295,
    "text": "Certain symmetries or invariances inherit from the notion of movement in a metric space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8668.835,
    "end": 8671.86,
    "text": "But that may well just be a fantasy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8672.38,
    "end": 8675.102,
    "text": " We've gone off quality of experience and the hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8675.763,
    "end": 8675.983,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8676.243,
    "end": 8678.525,
    "text": "Well, it all ties back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8678.565,
    "end": 8684.991,
    "text": "It's a beautiful, it's a very good question, which is why would this, why would space and time be the interface for us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8685.592,
    "end": 8686.773,
    "text": "I guess that is the deep question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8687.553,
    "end": 8694.439,
    "text": "And yet it appears that at least it is something, at least in conscious awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8694.84,
    "end": 8700.885,
    "text": "I did remember my question and it actually feeds into the last couple of questions I will have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8701.085,
    "end": 8713.206,
    "text": " which is you mentioned that you spend a lot of your time inferring in the technical and layman sense, whether other people have, I think you said good generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8714.448,
    "end": 8726.248,
    "text": "There's an interesting question here, I think, which I may have had intuitively when I started reading about active inference, which is, is there any such thing as good self-evidencing in the sense that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8726.785,
    "end": 8739.581,
    "text": " I may, so a lot of, of course, you know, as you wrote a lot of the papers, a lot of psychiatric disorders and psychological disorders have been rooted in disruptions to precision weighting mechanisms, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8741.384,
    "end": 8748.893,
    "text": "Can we consider, are the words good, bad, optimal, suboptimal, are these useful terms in this context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8749.594,
    "end": 8754.16,
    "text": "Or is it that that individual has a set of priors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8754.393,
    "end": 8762.323,
    "text": " which are different from you and I and everyone else, and we all actually have a sense of, we all have kind of different priors, so we're all self-evidencing in unique ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8763.184,
    "end": 8766.449,
    "text": "And yet philosophical vagueness allows us to clump us together into a group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8767.63,
    "end": 8777.363,
    "text": "Is there such a thing as what it is to be a good self-evidencer as a human, beyond just a trivial point that we're not just dissipating into the heat bath?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8779.182,
    "end": 8780.585,
    "text": " Yeah, that's an excellent question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8781.407,
    "end": 8784.274,
    "text": "So I think the answer to that is yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8784.976,
    "end": 8791.572,
    "text": "But as you correctly pointed out, it should be qualified by the complete class theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8791.892,
    "end": 8794.238,
    "text": "So you're clearly referred to the complete class theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8794.258,
    "end": 8797.225,
    "text": "So it might be just wise to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8797.205,
    "end": 8804.319,
    "text": " define what that means and the implications for discussions of good and bad generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8805.08,
    "end": 8818.065,
    "text": "So the complete class theorem, the way I like to summarize it, is that for any given pair of behaviors and loss functions, there exists some priors that render your behavior Bayes optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8818.433,
    "end": 8824.928,
    "text": " which means that there is always a description of every behaviour as Bayes' optimal under some prize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8825.589,
    "end": 8835.953,
    "text": "So in that sense, you can't be good or bad where the thing is basically your decisions, because this inherits from Bayes' decision theory, so it's not quite...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8835.933,
    "end": 8842.78,
    "text": " full as active inference and accommodating information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8842.821,
    "end": 8849.768,
    "text": "But within the confines of basic decision theory, you can't be good or bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8849.788,
    "end": 8851.11,
    "text": "You just have different priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8851.53,
    "end": 8864.404,
    "text": "So my favorite example is that if we all went to live on Mars or a much heavier planet, people with Parkinson's disease would probably be much better, have better priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8864.384,
    "end": 8871.24,
    "text": " sub-personal prize in terms of dopamine deficits because they move more slowly and more cautiously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8872.523,
    "end": 8876.272,
    "text": "So I think from the point of view of the complete cluster, I think it's important to bear that in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8876.332,
    "end": 8878.397,
    "text": "There are just different prizes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8878.417,
    "end": 8881.785,
    "text": "But I do think, though, that you can sort of just say, well, hang on a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8882.778,
    "end": 8885.081,
    "text": " What about, well, a good and bad prize?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8886.023,
    "end": 8893.874,
    "text": "And I think then we get into this, again, this hierarchical story, because, of course, as soon as you have a hierarchical generative model, there are no prize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8894.075,
    "end": 8895.557,
    "text": "Everything's an empirical prize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8895.937,
    "end": 8897.219,
    "text": "Everything can be contextualized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8897.259,
    "end": 8900.004,
    "text": "Everything is conditioned for everything else, including your prize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8900.464,
    "end": 8904.41,
    "text": "And then you're just back into the game of self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8904.731,
    "end": 8906.093,
    "text": "What is good self-evidencing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8906.393,
    "end": 8909.798,
    "text": "It's achieving a higher marginal likelihood on model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8909.778,
    "end": 8911.46,
    "text": " How would you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8911.481,
    "end": 8913.021,
    "text": "By finding the right prize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8913.237,
    "end": 8913.978,
    "text": " How would you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8914.298,
    "end": 8914.839,
    "text": "By learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8915.239,
    "end": 8915.9,
    "text": "How would you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8916.26,
    "end": 8919.264,
    "text": "By changing your model with basic model selection or structural learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8919.985,
    "end": 8921.506,
    "text": "How would you do that at an evolutionary scale?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8921.727,
    "end": 8923.629,
    "text": "You do basic model selection with natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8923.989,
    "end": 8937.365,
    "text": "So yeah, on that view, the log evidence, as bounded by the free energy, is just adaptive fitness, is how well your priors are adapted to this world you are trying to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8937.725,
    "end": 8942.991,
    "text": "So I think, yes, absolutely, you can be a good self-evidencer, you can be a bad self-evidencer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8943.106,
    "end": 8953.077,
    "text": " If you're natural selection, that matters because if you're a bad self evidencer, that means you won't be around in the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8953.458,
    "end": 8958.243,
    "text": "So the marginal likelihood of you existing at an evolutionary time scale is low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8958.644,
    "end": 8965.972,
    "text": "So your evidence is also the probability that you will be found, you will exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8966.352,
    "end": 8968.675,
    "text": "So it's quite important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8969.195,
    "end": 8975.644,
    "text": " to be a good self-evidencer because that's your marginal likelihood of existing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8976.204,
    "end": 8991.545,
    "text": "And I've now slipped in another synonym for free energy beyond prediction weighted prediction errors or beyond surprise or surprise or self-information, beyond log evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8991.585,
    "end": 8994.949,
    "text": "It's also, it's just, it's called the log marginal likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8994.929,
    "end": 9011.571,
    "text": " It's the likelihood of your sensory exchanges with your world, your eco-niche, having marginalized out or averaged away all the unknowns, which in this context are all the states out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9011.551,
    "end": 9018.899,
    "text": " the hidden causes or the external states which you model in terms of hidden causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9019.88,
    "end": 9023.625,
    "text": "So yeah, I think it's very important to be good at evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9023.645,
    "end": 9028.65,
    "text": "The measure of goodness and badness is just the marginal likelihood of the model evidence of the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9028.991,
    "end": 9029.731,
    "text": "There is nothing else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9032.014,
    "end": 9039.162,
    "text": "If you're saying, does that speak to some creatures that will be able to actually assess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9039.597,
    "end": 9061.453,
    "text": " how good they are at self-evidencing then i would say absolutely um people like uh matthias joffily looked at this specifically from the point of view of emotion and developed a whole taxonomy of emotion in terms of um rates of change of free energy and you get into stories of slope chasing uh um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9061.889,
    "end": 9079.341,
    "text": " looking for gradients and gradients and gradients of uh self-evidencing on the measurement of the goodness of self-evidence which is uh which is which is the free energy um more refined stories more recent stories um would basically be looking at certain kinds of uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9079.321,
    "end": 9090.46,
    "text": " being encoded explicitly in your generative model as underlying affect, particularly the certainty about what you're going to do next, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9090.48,
    "end": 9098.494,
    "text": "Then we get back to the story that Mark Soames would like to tell, which is the precision of your beliefs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9098.474,
    "end": 9109.972,
    "text": " is the most important attribute that defines its valence that you're feeling at this sort of minimal effective level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9110.833,
    "end": 9111.053,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9112.175,
    "end": 9118.845,
    "text": "The complete class theorem is an interesting one because I think it leads one into these potential strange conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9119.095,
    "end": 9124.001,
    "text": " It makes me think of animals that commit suicide, oddly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9124.582,
    "end": 9131.371,
    "text": "So I think sort of aphids might explode themselves in the context of a predator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9133.493,
    "end": 9136.958,
    "text": "It ultimately comes back down to your model evidence, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9136.998,
    "end": 9142.064,
    "text": "So I am the type of creature that will commit suicide if I'm in the presence of a ladybug, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9143.006,
    "end": 9147.972,
    "text": "But then those kinds of examples I sense for me show that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9148.289,
    "end": 9151.574,
    "text": " the words good or bad, I'm just pushing a little bit back just intuitively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9152.014,
    "end": 9159.505,
    "text": "The words good or back in the form of continued existence slightly put the cart before the horse, because who said that that's the imperative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9160.466,
    "end": 9175.528,
    "text": "So if I existed in the world and everyone's imperative was to no longer exist, God forbid, then I would be doing bad self-evidencing on that standard if I didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9175.627,
    "end": 9176.749,
    "text": " if I continue to persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9177.732,
    "end": 9185.869,
    "text": "So is there a point at which even the, yeah, like, do you see how, well, do you see that argument holding any water?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9185.929,
    "end": 9190.479,
    "text": "Or is it just now we're just, sorry, dissolving into semantics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9191.682,
    "end": 9195.61,
    "text": "Well, no, no, I think it's an interesting thing to contemplate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9195.961,
    "end": 9207.056,
    "text": " You're basically, I think, undermining that particular argument by a proof abductor absurdum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9208.058,
    "end": 9218.532,
    "text": "So if you think you are the kind of thing that will self-destruct, auto-vitiate or commit suicide, then you can't exist because you've killed yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9220.515,
    "end": 9220.635,
    "text": "Right."
  },
  {
    "start": 9220.615,
    "end": 9232.712,
    "text": " So I would be extremely surprised if there were any common natural subhuman artefacts that kill themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9232.752,
    "end": 9234.134,
    "text": "I didn't know about the aphid example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9234.174,
    "end": 9242.365,
    "text": "I mean, obviously lemmings is the sort of popular culture one, but I think they would be extremely rare.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9242.425,
    "end": 9249.795,
    "text": "And then you have to understand the selection at an evolutionary or transgenerational level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9249.775,
    "end": 9252.178,
    "text": " in order to apply the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9253.139,
    "end": 9256.142,
    "text": "I think you're absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9256.863,
    "end": 9263.611,
    "text": "I'm very mindful that a couple of weeks ago I was asked to review a paper applying active influence to suicide and it was a very artful paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9265.794,
    "end": 9271.26,
    "text": "I do remember thinking, I'm not sure whether the point was made implicitly or explicitly in the paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9271.24,
    "end": 9285.381,
    "text": " It made me think in exactly the way that you were talking about the imperatives to survive and are they the right way to think about the causes of our behaviour?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9286.883,
    "end": 9288.566,
    "text": "I would say absolutely not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9289.027,
    "end": 9292.111,
    "text": "This is not about wanting to survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9292.532,
    "end": 9296.758,
    "text": "This is simply wanting to avoid uncharacteristic sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9297.413,
    "end": 9324.501,
    "text": " and then we put a post hoc hypothesis oh that's because i want to survive then right and that's a fantasy that's another illusion uh so you know we do not know what it is like to be dead so yes it cannot be hey but it can be surprising it certainly can't be the kind of surprise that you'd register in terms of a free energy so it's not that we're frightened of being dead um we are going to avoid by these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9324.481,
    "end": 9347.181,
    "text": " pragmatic constraints um states that we've have inherited that um for portend um cessation and dissipation and death definitely in all itself is not at all frightening we go to sleep every every um suspension of course we go to sleep every night um so you know i i i would i would um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9347.161,
    "end": 9377.134,
    "text": " sorry yeah and the final point i think is i think what you were doing though you were probably um creating a slightly vexed and self-defeating argument by saying uh by assuming that um we can understand things in terms of imperatives the whole point of the free energy principle is that there aren't any imperatives this is where it starts as things that exist must behave like this and part of that behaving like this means that you can interpret them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9377.485,
    "end": 9380.833,
    "text": " as optimizing something and complying with imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9381.173,
    "end": 9384.942,
    "text": "But that's just an interpretation that you'll bring to the table when you apply it to something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9385.503,
    "end": 9389.131,
    "text": "If you then apply it to yourself, then things might get interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9389.151,
    "end": 9390.234,
    "text": "You might have hard problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9390.675,
    "end": 9392.98,
    "text": "But there are no imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9392.96,
    "end": 9396.425,
    "text": " In fact, even minimizing free energy is not an imperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9396.826,
    "end": 9407.583,
    "text": "You can have the free energy principle applying to things that have very dissipated attracting sets that have very, very high entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9408.124,
    "end": 9415.295,
    "text": "All it's saying is that there has to be a certain gradient flow that counters the random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9416.357,
    "end": 9419.862,
    "text": "Then you ask yourself, well, hang on a second, so why does it look as if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9420.145,
    "end": 9424.07,
    "text": " were always trying to attain some very precise homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9424.971,
    "end": 9431.359,
    "text": "And the free energy principle would turn that on its head and say, well, look, okay, in some universes, there may be very precise things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9432.14,
    "end": 9435.044,
    "text": "And these precise things, what would they look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9435.224,
    "end": 9445.017,
    "text": "Oh, it would look as if they were trying, they had aspirations to evincing a very precise homeostasis and indeed hemostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9445.678,
    "end": 9449.663,
    "text": "So you get this notion of another kind of natural thing, which are precise things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9449.93,
    "end": 9460.32,
    "text": " And so if precise things exist, it would look as if they are compelled to comply to very specific imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9461.381,
    "end": 9466.486,
    "text": "But from a free agent's point of view, it's not saying they exist because they comply with the imperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9466.906,
    "end": 9470.85,
    "text": "It's saying existence implies that it looks as if they have this imperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9471.77,
    "end": 9475.094,
    "text": "Now, one final point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9475.294,
    "end": 9479.818,
    "text": "I'm aware that we're now approaching three hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9479.798,
    "end": 9481.621,
    "text": " Well, final point, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9481.661,
    "end": 9484.545,
    "text": "You introduced the word optimisation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9484.585,
    "end": 9507.46,
    "text": "I think that was the right and important thing to introduce because, you know, it's only when you bring free energy into the game as a bound on marginal likelihood or the negative lock marginal likelihood with the self-informational surprise or surprisal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9508.773,
    "end": 9515.351,
    "text": " do you convert an existential description into an optimization problem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9515.371,
    "end": 9519.863,
    "text": "So that's exactly the move that Richard Feynman made when he introduced variation-free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9520.214,
    "end": 9526.12,
    "text": " He had this impossible marginalization problem to actually evaluate the marginal likelihood of paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9526.501,
    "end": 9533.769,
    "text": "So exactly the same kind of problem that we're talking about in terms of what are my priors over policies and plans and paths into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9535.391,
    "end": 9538.374,
    "text": "You can't evaluate that exhaustively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9538.414,
    "end": 9541.898,
    "text": "It's analytically and practically, physically not realizable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9542.378,
    "end": 9546.643,
    "text": "So the marginalization problem, the true inference problem, if you like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9547.079,
    "end": 9552.969,
    "text": " the true existential problem, if there is one, cannot be solved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9553.51,
    "end": 9558.438,
    "text": "But what you can do is introduce this bound and turn it into an optimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9558.458,
    "end": 9573.323,
    "text": "So just by using free energy, just by appealing to this teleology that comes from predicating everything on this evidence-lower bound, you are actually saying that it looks as if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9574.13,
    "end": 9577.036,
    "text": " creatures that exist are optimizing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9578.399,
    "end": 9579.341,
    "text": "What are they optimizing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9579.361,
    "end": 9585.675,
    "text": "It looks as if they're optimizing a bound on their marginal likelihood or their adaptive fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9586.448,
    "end": 9587.53,
    "text": " What does that look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9587.55,
    "end": 9589.654,
    "text": "Well, it looks exactly like Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9590.456,
    "end": 9597.85,
    "text": "Or if you talk to somebody in machine learning, it would look as if you're optimising your negative variation of energy, which is known as an ELBO.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9598.29,
    "end": 9600.174,
    "text": "So this is an evidence lower bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9600.555,
    "end": 9607.528,
    "text": "It is exactly the objective function used in high end neural networks like variation autoencoders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9607.508,
    "end": 9615.397,
    "text": " So I think the distinction between just being and optimizing is quite crucial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9615.738,
    "end": 9632.617,
    "text": "And you're absolutely right that once you make the move of framing things in terms of variational bounds, using variational calculus or variational Bayes, then you have actually committed to an optimization narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9632.637,
    "end": 9633.498,
    "text": "You didn't have to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9633.879,
    "end": 9636.722,
    "text": "Just to exist, you could...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9637.597,
    "end": 9664.363,
    "text": " yes yeah i was gonna have this funky philosophical argument about needing to exist to predict but i won't go there i won't go there um because we are going to wrap up all of this philosophical mathematical thoughts as and consciousness thoughts has brought to my mind thomas nagel thomas nagel has this idea that death is bad because life is inherently good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9665.322,
    "end": 9678.37,
    "text": " we've been talking about life and being and what it is to be and what one needs to do to be and persist to be if we're going to wrap everything up is there a sense in which that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9679.261,
    "end": 9702.231,
    "text": " kind of related to what we were just talking about in terms of imperatives of course there is no imperative to be in any sense but you said it was an interesting thing you said there was it looks like we are all being anyway right even if we didn't have to it looks like we are there's no god granted plan for us to be but we seem to be doing it anyway does any of nagel's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9703.173,
    "end": 9720.996,
    "text": " romantic i philosophical idea that life is fundamentally good being is good does any of that resonate with you um yes it does because it's it's it's you know it's nice isn't it um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9721.718,
    "end": 9729.37,
    "text": " You'd probably sort of license that with phrases of the kind that, you know, to exist is to be curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9730.632,
    "end": 9737.562,
    "text": "So this speaks to this sort of, you know, the ability to respond to epistemic affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9738.223,
    "end": 9750.021,
    "text": "And certainly, you know, to exist as curious creatures is obviously the good way to exist in any given world and would be mandated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9750.001,
    "end": 9754.371,
    "text": " I can't resist saying, though, of course, that this only really applies to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9754.472,
    "end": 9755.394,
    "text": "It doesn't apply to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9755.975,
    "end": 9761.027,
    "text": "So you are good because you are curious and you exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9762.691,
    "end": 9765.418,
    "text": "I wish I could say the same for me, but I can't, strictly speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9765.438,
    "end": 9766.761,
    "text": "But you could if you wanted to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9767.517,
    "end": 9770.661,
    "text": " I could abstract to you in some degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9770.681,
    "end": 9772.403,
    "text": "I could infer that there is a you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9773.124,
    "end": 9773.404,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9773.924,
    "end": 9780.092,
    "text": "And then I guess we can wrap it up there with one more question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9780.392,
    "end": 9783.315,
    "text": "We've just spoken about life being good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9784.657,
    "end": 9786.139,
    "text": "I'll flip the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9786.159,
    "end": 9789.963,
    "text": "I don't know if I've ever heard you talk about death, although we briefly touched upon it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9792.366,
    "end": 9795.87,
    "text": "I won't make it too personal, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9796.745,
    "end": 9808.281,
    "text": " If life is kind of good in some sense because of the concomitant parts of living as we do as... I don't know if it's good to be a stone, but it's nice to be me having these conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9809.303,
    "end": 9811.546,
    "text": "Would that make death bad?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9814.53,
    "end": 9824.524,
    "text": "You said we fear dying because we fear, in an affective sense, the states we don't expect to embody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9825.162,
    "end": 9829.247,
    "text": " And in some sense, we don't expect to embody death because it doesn't fit in with our priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9829.888,
    "end": 9840.661,
    "text": "But beyond that free energy principle perspective, is there a broader position in which just returning back to the fabric of the universe is bad?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9841.102,
    "end": 9844.606,
    "text": "Is there something to say about reentering that Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9844.646,
    "end": 9846.829,
    "text": "Do my Markov blankets dissipate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9848.351,
    "end": 9849.893,
    "text": "What does that process look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9850.013,
    "end": 9853.397,
    "text": "And does that strike fear in you or strike awe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9854.828,
    "end": 9858.722,
    "text": " Well, more or, but I don't want to overstate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9861.894,
    "end": 9865.868,
    "text": "It is beautiful from a pure mathematical point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9866.287,
    "end": 9889.273,
    "text": " um so i i have a very sanguine view of this and we've already said you know you've never been dead i've never been dead so no one can tell me it's an unpleasant experience um so i i'm not particularly i i'm not gonna um avoid being dead i certainly think all of all the paths to being dead are probably probably very surprising and unpleasant so i'm going to avoid those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9889.253,
    "end": 9906.036,
    "text": " Death in and of itself I don't think is quintessentially bad in the same way that being curious and being engaged with the world is good while you exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9906.537,
    "end": 9909.321,
    "text": "I think that's perfectly okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9909.301,
    "end": 9920.514,
    "text": " But I think death is, you know, the life cycle, let's call it a life cycle, that it's slightly less imbued with morbidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9921.175,
    "end": 9938.835,
    "text": "The life cycle is quite important because if you just look at, if you just take this multi-scale view of self-organisation cast in terms of this basic mechanics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9938.815,
    "end": 9961.414,
    "text": " that you know for example natural selection being basic model selection then if you put that together with what we're talking about before about ecosystems and niche construction constantly changing the lived world then what you need to do is to do constant basic model selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9961.698,
    "end": 9973.598,
    "text": " in order to get the right structures, very much in the spirit that we talked about before, where there are good priors and there are bad priors in the sense of the marginal likelihood or adaptive fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9974.573,
    "end": 9980.963,
    "text": " To learn those good priors, you sometimes have to start from scratch again with a different structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9981.404,
    "end": 9988.375,
    "text": "And of course, this is exactly what Bayesian model selection does via structure learning at an evolutionary time scale will entail death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9988.736,
    "end": 9995.647,
    "text": "So that picture basically says that we have to keep refreshing, sometimes cast in terms of basal forgetting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9996.128,
    "end": 9998.151,
    "text": "So the fact that we die",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9998.452,
    "end": 10007.787,
    "text": " could be construed as a base optimal forgetting where we are the environment's memory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10008.121,
    "end": 10032.373,
    "text": " of what is good for this eco-niche but the environment on this natural selection knows that the environment is changing so what was good last generation will not necessarily be good for the subsequent generation so it has to forget in the same way that you learn by forgetting you have insights by dispensing with redundant information so in a sense death",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10032.353,
    "end": 10041.445,
    "text": " for in that life cycle is an essential part of the self-evidencing of the species.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10041.765,
    "end": 10055.003,
    "text": "So it may be bad for you, I suppose, in a Nagel-esque sense, in that it's denying the opportunity to be curious and engaged with your lived world, but it's certainly good for your children and your children's children.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10055.54,
    "end": 10056.421,
    "text": " Right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10056.601,
    "end": 10058.343,
    "text": "I'm a I'm a full warning for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10058.523,
    "end": 10058.943,
    "text": "That's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10059.204,
    "end": 10061.386,
    "text": "I'm glad to I'm glad to be that porn in that game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10061.907,
    "end": 10066.391,
    "text": "And I kind of cheery notes on which to end will be a slightly more morbid question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10066.952,
    "end": 10068.613,
    "text": "Carl, this was an absolute pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10069.715,
    "end": 10071.877,
    "text": "Despite the occasional Wi Fi hiccup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10072.037,
    "end": 10073.899,
    "text": "I think it's, it's gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10074.459,
    "end": 10076.762,
    "text": "And, you know, I've been incredibly happy with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10077.122,
    "end": 10078.684,
    "text": "Thank you so much for being our first guest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10079.525,
    "end": 10082.988,
    "text": "And answering my suite of sometimes bizarre questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10083.108,
    "end": 10084.77,
    "text": "It was a real joy on my part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10085.341,
    "end": 10104.953,
    "text": " right well it's been a real pleasure talking to you your questions were excellent i have no idea how long you're going to have to spend editing all this but i i thank you again for that opportunity to uh you know to talk about these wonderful issues and hopefully we'll do it again excellent thank you",
    "speaker": "SPEAKER_01"
  }
]