[
  {
    "start": 6.482,
    "end": 7.843,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.004,
    "end": 16.249,
    "text": "This is March 31st, 2023's quarterly roundtable number one from the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.89,
    "end": 19.671,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.592,
    "end": 26.416,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.976,
    "end": 28.897,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.078,
    "end": 35.242,
    "text": "This is a recorded and an archived live stream, so please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.385,
    "end": 41.456,
    "text": " All backgrounds and perspectives are welcome, and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.257,
    "end": 48.441,
    "text": " Today we're going to be checking in with our regular quarterly roundtable series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.082,
    "end": 53.505,
    "text": "We're going to first provide some updates from the Institute scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.266,
    "end": 64.394,
    "text": "Then we'll talk about ongoing education and research projects before concluding with some thoughts on the Institute's paths in the coming year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.075,
    "end": 65.775,
    "text": "So first...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.696,
    "end": 68.758,
    "text": " Would the two of you like to introduce yourself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.118,
    "end": 69.638,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.959,
    "end": 74.102,
    "text": "I'm a researcher in California and also the president of the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.725,
    "end": 78.965,
    "text": "Alex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.848,
    "end": 82.088,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.628,
    "end": 82.928,
    "text": "Hi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.089,
    "end": 84.83,
    "text": "My name is Alex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 85.13,
    "end": 93.276,
    "text": "I'm a vice president of the Institute and also an educator in systems thinking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.617,
    "end": 95.418,
    "text": "Leo, please go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.583,
    "end": 98.504,
    "text": " Hi, I'm Blue Knight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.584,
    "end": 104.592,
    "text": "I'm an independent research consultant in New Mexico and the secretary for the Active Influence Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.253,
    "end": 106.274,
    "text": "Back to you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.294,
    "end": 107.235,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.016,
    "end": 115.206,
    "text": "Well, let's begin with some views on the Institute at the organizational scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.633,
    "end": 120.658,
    "text": " First, just as a summary overview, put us off to the side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.321,
    "end": 128.308,
    "text": "We engage with our niche and provide services to it on multiple fronts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.813,
    "end": 147.806,
    "text": " here who we are and what we are is reflected visually at the institute scale we have several groups including the ones that we'll be describing in the coming slides the board of directors the officers and the scientific advisory board",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.09,
    "end": 152.813,
    "text": " We have two organizational units, somewhat like departments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.534,
    "end": 161.04,
    "text": "These organizational units help support a wide range of projects related to education and research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.721,
    "end": 164.143,
    "text": "Any general comments that you'd like to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.034,
    "end": 196.113,
    "text": " Let me add here that, yes, we are using this kind of simple schema, but it actually represents our vision to have this hierarchical structure explicit and representing our attempts to align with active inference approach or organizational side of our activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.276,
    "end": 207.9,
    "text": " So here we have connections to the niche and different scales of institution in general, units, projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.92,
    "end": 218.164,
    "text": "So we are having attention on keeping a structure alive and see which of all this provides us to development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.225,
    "end": 225.707,
    "text": "As we undergo morphological development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.526,
    "end": 237.735,
    "text": " And just to give a bit more information on the governance, the board of directors serves to implement Institute scale, formal strategy and governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.355,
    "end": 247.323,
    "text": "They specified and provide oversight for the officers who are closer to the day-to-day operations at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.003,
    "end": 251.546,
    "text": "And the board of directors applies active inference at the organizational scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.307,
    "end": 261.452,
    "text": " In contrast, and in compliment, the Scientific Advisory Board assists with a wide range of tasks to reflect their diverse backgrounds and approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.973,
    "end": 265.555,
    "text": "So let's talk a little bit more about the BOD and the SAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.165,
    "end": 276.03,
    "text": " First, as to the board of directors, our 2022 to 2023 board of directors are listed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.75,
    "end": 291.598,
    "text": "And we've recently confirmed three of us here on this stream as the officers, again, close to the day-to-day operations and who one is speaking with most likely when they email the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.779,
    "end": 293.159,
    "text": "Currently,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.632,
    "end": 300.518,
    "text": " We are working towards our nonprofit tax exemption status, 501c3 status for our nonprofit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.398,
    "end": 308.704,
    "text": "And we continue to highlight Bolt's dimensions, business, operational, legal, technical, and social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.665,
    "end": 313.728,
    "text": "Anything else that either of you would like to add about our formal organizational structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.632,
    "end": 320.814,
    "text": "Let me possibly add here that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.917,
    "end": 349.108,
    "text": " uh it's on the process of development it was like needed legally activities to have all these people in all these roles for the legal structure of institute and that's great so great people we have on board and uh like from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.745,
    "end": 364.274,
    "text": " From the side, as I see it, even having a team of this size, the process and structure became more complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 365.595,
    "end": 384.097,
    "text": " and all such changes took more time to restructuring and like for first quarter we started this process like last year and even first quarter i will need it to finalize these activities but it's great that we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.158,
    "end": 410.502,
    "text": " yeah now having people in our roles and having accordance to legal requirements and now we can make next steps possibly we took we will take again a lot of time but it's kind of new new form and the speed of such changes for institute scale is takes more time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.11,
    "end": 412.51,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.831,
    "end": 428.082,
    "text": "It was definitely a memorable moment when during a scientific advisory board meeting, one member suggested that this was stretching the upper limit of how complex and complicated our organization should be at our stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.843,
    "end": 435.848,
    "text": "And another contrasted that it was actually the minimal level of complexity required to pursue certain legal statuses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.268,
    "end": 440.992,
    "text": "And so, and another work, so we're kind of straddling that line riding forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.27,
    "end": 449.693,
    "text": " We have the second cohort of our scientific advisory board in full swing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.973,
    "end": 454.476,
    "text": "Already most have joined meetings or engaged in other activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.236,
    "end": 460.959,
    "text": "We have a healthy number of returning advisory board members and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.96,
    "end": 476.856,
    "text": " some great new advisory board members so thank you all for your work in the scientific advisory board and we're looking forward to bringing forth your engagements in the coming year in many many ways anything either of you would like to add here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.868,
    "end": 493.463,
    "text": " Maybe a dimension about kind of diversity in terms of people from different domains and it's growing in the number of participants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.006,
    "end": 496.548,
    "text": "Maybe it even looks like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 499.005,
    "end": 528.174,
    "text": " much more people when needed but having opportunity to discuss relevant questions for research different research fields and to have different insights it's totally valuable for us and provide us opportunities to make right steps in needed directions related to research site mostly for sure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 529.807,
    "end": 530.167,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.829,
    "end": 536.011,
    "text": "There are many ways to engage with the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.832,
    "end": 546.738,
    "text": "There's a lot of asynchronously available materials like the recordings of the live streams and other productions and the transcripts and so on, things we'll discuss more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.318,
    "end": 555.163,
    "text": "And also for those who want to get more involved, be active in for ANTS, there are multiple opportunities for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.204,
    "end": 568.89,
    "text": " In the volunteer program, by going to our website and under education, finding volunteer, you can support your engagement with one or as many projects and activities as you'd like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.77,
    "end": 575.472,
    "text": "By registering as a volunteer, we'll keep you in the loop about specific affordances for your participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.552,
    "end": 583.356,
    "text": "For example, registration opening for an upcoming learning group or some cool new update with a given project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.281,
    "end": 589.747,
    "text": " And for those who are looking for even more structure, we offer an internship program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.528,
    "end": 598.917,
    "text": "We have currently about 10 active interns from around the world who are engaging with different research and education affordances at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.938,
    "end": 616.341,
    "text": " In their own ways, reflective of their own situations, the interns engage in some element of learning and education, usually with textbook groups or other courses, some element of project-based learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.591,
    "end": 625.961,
    "text": " where they are going to be and are contributing to different projects, making translations in the ontology or developing some other kind of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.902,
    "end": 635.272,
    "text": "And the internship has a more active mentorship and peer facilitation aspect for whatever your educational and research journeys are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.554,
    "end": 637.275,
    "text": "Any comments on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.537,
    "end": 663.907,
    "text": " hope that this becomes a very important vector for people who want to catalyze their active inference journey we basically cannot imagine a better way for someone who wants to dedicate one hour per week 10 hours per week 30 hours per week whatever it may be we can find a kind of relationship that's going to be mutually beneficial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.23,
    "end": 680.773,
    "text": " Yeah, I think it was quite a smart mutation of our activities and having that format and having that actually active people in game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.653,
    "end": 695.016,
    "text": "It's the most valuable thing and having, organizing it as flexible as possible around specific people, specific situation and learning paths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.374,
    "end": 712.266,
    "text": " We can keep it and develop and hopefully it will bring more people who are interested in active inference to some actual activities and learning path in that direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.209,
    "end": 737.066,
    "text": " great with respect to what they call social media we have our main platforms and numbers noted here so it's been great to see continued growth on these fronts as to the big picture on our activities the above link",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.291,
    "end": 758.494,
    "text": " provides a always updated reference point for the activities that are ongoing and the times of their meeting and also links to those documents if you want to learn more and we're going to go through many of them today but first just the 30 000 foot view these are some of the active activities at the institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 759.455,
    "end": 780.685,
    "text": " all of which are participatory so if you're curious just wanting to know more or see a way for you to contribute or maybe even want to spin up your own project where you'd be a facilitator we can talk more about it as for learning groups we continue to have par at all textbook groups which will be discussed later",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.65,
    "end": 794.373,
    "text": " We have been active with Sanjeev Nemjoshi in the Fundamentals of Active Inference group, working on Sanjeev's book in progress and providing feedback, which will hopefully be surfaced more and throughout the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.533,
    "end": 800.595,
    "text": "And also to be addressed later, we're working on category theory as a learning group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.215,
    "end": 809.217,
    "text": "We organize and produce live streams and with the transcripts of those live streams, publish an archive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.413,
    "end": 812.417,
    "text": " and do other things with language processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.945,
    "end": 819.108,
    "text": " In Active Blockference Project, we're developing implementations for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.389,
    "end": 830.716,
    "text": "At this point, largely using approaches and code that are scattered elsewhere, bringing them together and help making it more coherent for people who want to engage in active inference modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.936,
    "end": 841.243,
    "text": "So people who want to engage with the actual code and see how it works in a script rather than from a mathematical or from a philosophical approach, this is a great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.963,
    "end": 843.685,
    "text": " project to add into your toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.827,
    "end": 857.042,
    "text": "In Robotics and Embodied, JF Cloutier continues to present us with progress on his work in symbolic active inference and engage participants in this very exciting area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.363,
    "end": 880.498,
    "text": " the active inference ontology we continue to develop translations definitions examples and counter examples and methodologies involving the active inference ontology and how it's used and we also have several open hours per week in our discord where we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.636,
    "end": 883.097,
    "text": " Wide-ranging conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.157,
    "end": 891.444,
    "text": "These are really great entry points if someone doesn't even find a specific project that they're curious about, but they just want to learn more in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.305,
    "end": 899.45,
    "text": "Joining any open discussion hour is a great option because we can field that conversation then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.697,
    "end": 910.809,
    "text": " And just to show a few of our seed or inactive projects, starting in May, we'll have a physics as information processing course by Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.829,
    "end": 912.571,
    "text": "We'll talk more about that in a few minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.673,
    "end": 918.478,
    "text": "Podcast continues to exist, albeit a little bit on the back burner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.938,
    "end": 935.121,
    "text": " In software, we have several software ideas and projects that have been sketched to some extent, but are not engaging regularly to meet, as well as the development of frameworks for cognitive agent modeling and course development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.421,
    "end": 946.943,
    "text": "So we have a good portfolio for those who choose to engage with one or more activity, and there are always burners that are on low or off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.646,
    "end": 954.77,
    "text": " Let's go into the educational project updates in the EduActive organizational unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.81,
    "end": 957.912,
    "text": "Yeah, let me add here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 957.932,
    "end": 977.324,
    "text": "Yeah, related to education, as we can see now, educational activities became more and more important and active, and we have different formats, and even on our planning, some creation and organization of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.812,
    "end": 988.108,
    "text": " education different educational courses and it's also a result result of transformation to institute when we consider is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 989.706,
    "end": 1015.602,
    "text": " educational function as specific for such type of organizations and for now we kind of i believe we've seen the results of implementing such strategies starting to think about education and starting to make actions to have education in place for in institute thank you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.099,
    "end": 1032.395,
    "text": " Currently, as one of our primary educational avenues, we are continuing with our textbook group centered around the Parr, Pizzullo and Friston 2022 textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.276,
    "end": 1037.06,
    "text": "So the first cohort has been completed last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.021,
    "end": 1045.605,
    "text": " And those who have completed the cohort are encouraged to join future cohorts and be participants again or be learning assistants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.646,
    "end": 1054.491,
    "text": "The second cohort, which began in the second half of last year, is about two weeks from finishing the whole textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.331,
    "end": 1063.155,
    "text": "And the third cohort, which begun in 2023, is now closing in on finishing the first half of the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.697,
    "end": 1091.956,
    "text": " cohort four will begin with the beginning of the textbook in the coming months so check out on our website the textbook group page if you want to register for the fourth cohort or if you have any other questions just to summarize it's a really exciting and inclusive experience to be in the textbook group people have all backgrounds different familiarities and angles of approach to active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.737,
    "end": 1102.904,
    "text": " Everybody has different familiarity with the active inference ontology and with equations, math, statistics, philosophy, all these threads that come together in the textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.544,
    "end": 1118.094,
    "text": "We have fun and we work together to improve our shared documents so that we can have a wide variety of tools and augmented learning approaches that we wouldn't be able to have alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.534,
    "end": 1122.157,
    "text": "So if you're planning to work on this textbook at all, or if you're curious about it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.038,
    "end": 1125.281,
    "text": " there couldn't be a better way to engage with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.42,
    "end": 1133.922,
    "text": " Moving to another educational project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.082,
    "end": 1140.546,
    "text": "With a small group of participants, we are working on a category theory group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.606,
    "end": 1152.173,
    "text": "This group is an extended dot zero preparation session for this draft dissertation thesis by Toby St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.213,
    "end": 1156.715,
    "text": "Clair Smith, Mathematical Foundations for a Compositional Account of the Bayesian Brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.936,
    "end": 1167.042,
    "text": " and in this group where we have many different backgrounds and familiarity with category theory ranging from none to some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.356,
    "end": 1192.993,
    "text": " We are preparing the dot zero background and context materials for upcoming live streams with Toby in the middle of 2023, where we're going to be discussing this incredible work, which brings together in some novel ways, the compositionality of category theory with the otherwise non-compositional Bayesian brain active inference type approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.714,
    "end": 1196.415,
    "text": "We're going to see how it all works together in the coming years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.276,
    "end": 1218.524,
    "text": " it's not the end with this dissertation it's really just the beginning and so it's been quite exciting to develop educational materials as a small group as well as some individuals within the group developing personal materials like blogs and syllabus to help learn at the intersection of active inference and category theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.491,
    "end": 1223.414,
    "text": " And everyone's welcome to get involved with this group, just as with all the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.355,
    "end": 1228.437,
    "text": "And this group is an example or a template of how we operate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.264,
    "end": 1231.966,
    "text": " deliverable-oriented learning groups at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.786,
    "end": 1234.608,
    "text": "Doesn't mean every person is going to have homework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.668,
    "end": 1258.704,
    "text": "It's just the way that, for example, shown here on the right, we structure meetings and set a pace where we know we could spend five years working on one page because that's what the PhD is like, but we also move quickly enough to get things done in reasonable timeframes and have a shared niche, many pages not shown, where we have notes, questions, discourse, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.744,
    "end": 1287.598,
    "text": " anything blue or alex on category theory maybe not only here but general for education and courses i think that we called value added services for education for course organization it's kind of unique because it's evolving and but it's evolving around some structure and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.358,
    "end": 1297.286,
    "text": " for ontological work and having it in place like a ground we can build a lot of really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.085,
    "end": 1326.285,
    "text": " valuable valuable services to provide additional information links connections between terms ideas questions and so on and i believe development and that direction and trying to apply the same approach for different educational activity will bring interesting results for everyone awesome agreed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.522,
    "end": 1338.908,
    "text": " We have recently been very happy to announce that in May 2023, we will be hosting a course taught by Chris Fields, Physics as Information Processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.549,
    "end": 1343.111,
    "text": "You can find out more in the education section on our site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.051,
    "end": 1354.237,
    "text": "It is going to consist of six lectures live streamed by Chris Fields and six live streamed but also participatory discussion sessions with Ander Aguirre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.858,
    "end": 1355.138,
    "text": "So if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.277,
    "end": 1366.401,
    "text": " you'll be able to access all materials, preparatory readings, associated topics, recordings of live streams, and so on, on this course coda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.181,
    "end": 1371.223,
    "text": "And look forward to learning more about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.363,
    "end": 1374.024,
    "text": "It's going to be a great course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.985,
    "end": 1376.905,
    "text": "Anything you want to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.816,
    "end": 1382.936,
    "text": " I'm really looking forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.996,
    "end": 1383.537,
    "text": "That's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.557,
    "end": 1384.537,
    "text": "I'm super excited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.917,
    "end": 1391.238,
    "text": "I think it's really awesome of Chris to put this forward and let us host this wonderful class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.618,
    "end": 1401.04,
    "text": "And yeah, we're going to be having discussions, sessions that are hopefully transcribed through the Active Influence Journal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.26,
    "end": 1405.941,
    "text": "So getting in touch and participating in these sessions is a good chance to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.943,
    "end": 1434.158,
    "text": " interact with the journal in that kind of way that's the only addition I would make maybe yes all the lectures and discussions and asynchronously submitted questions and answers will be compiled and published and citable so this we expect to be a multi-hundred page functionally landmark publication if you're interested in this area and you're in this moment in time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.765,
    "end": 1436.485,
    "text": " do what you can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.766,
    "end": 1438.026,
    "text": "Alex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.968,
    "end": 1453.255,
    "text": "I just want to add that it's great that we see that growing connections between quantum theory and quantum information theory to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.575,
    "end": 1457.457,
    "text": "And it's starting to grow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.917,
    "end": 1462.42,
    "text": "And it's bringing us more and more first principles",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.849,
    "end": 1476.554,
    "text": " into this framework basements so it's very cool agreed we've had a very exciting 2023 for live streams first just the ask",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.952,
    "end": 1490.739,
    "text": " With your contributions and assistance, we can co-create a special and engaging sequence of live streams for the rest of the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.579,
    "end": 1494.261,
    "text": "So everybody listening is welcome to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.281,
    "end": 1498.044,
    "text": "You're always welcome to comment and continue the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.145,
    "end": 1513.038,
    "text": " also you can join live streams while they occur you can self-nominate if you'd like to give a presentation or have your paper discussed please let us know or if you have a recommendation or even a warm introduction that could go a long way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.159,
    "end": 1541.069,
    "text": " if you'd like to bring some materials and perspectives really to the forefront you can collaborate on a dot zero background and context video and help lock in the ways that you might want to share background for a topic to preempt uncertainty or do any other kind of service in the epistemic niche and we meet weekly of course to discuss these issues just quickly to look at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.609,
    "end": 1570.811,
    "text": " some of the streams that we've had in this year 2023 so far um we had guest streams from adam peace alireza motor shanghi avil gwen and carlou jordan hall and matthew perkowski benjamin fallon days baba brinkman max berg shuji and vanya visa so these guest streams ran the gamut from consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.455,
    "end": 1598.766,
    "text": " to clinical psychiatric modeling with active inference improvisation in rap ecological psychology civics and governance physics of creation technical details on surprise definitions integration of large language models with neurosymbolic approaches and formal ontologies and later today there will be an org stream with stray jane on plural publics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.66,
    "end": 1606.643,
    "text": " Those are the guest streams, and we've also had a great set of other streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.604,
    "end": 1612.526,
    "text": "For paper-oriented live streams, we've had two series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.086,
    "end": 1629.835,
    "text": "In live stream 52, Geometric Methods for Sampling, Optimization, Inference, and Adaptive Agents, Lance DaCosta joined for both discussions and has incredible insights into that group's paper that brings together the topics in the title.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.775,
    "end": 1651.122,
    "text": " and in the recently concluded 53 sequence on a pair of papers snakes and ladders and paleoanthropology and to copy or not to copy in both of these live streams we had the authors michael walker hector manrique and carl friston joining and both were very special and illustrative discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.182,
    "end": 1659.865,
    "text": " We've had two model streams, one on PyMDP, a Python package for generative models of the Active Inference flavor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.625,
    "end": 1667.508,
    "text": "That was with Connor Hines and Carl Fristen, and Tom Ringstrom joined for a presentation, Reward is Not Necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.829,
    "end": 1676.552,
    "text": "We also enjoyed a sequence of book streams, and so I'll pass to Blue to say a little bit more about those book streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.925,
    "end": 1679.185,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.265,
    "end": 1686.27,
    "text": "So we have been going through this text and discussing the material presented in the first three parts of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.31,
    "end": 1694.035,
    "text": "And we're not going to do the interviews at the end section of the book, just because it's kind of beyond the scope of what we wanted to cover in the book streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.575,
    "end": 1703.941,
    "text": "But we have been going through week by week, chapter by chapter, examining this material, which is really the application of active inference to governance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.801,
    "end": 1717.628,
    "text": " Especially like with our own governance of the Institute, like being forming officers and a board of directors and how should we factor in the concept of active inference into our governance policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.708,
    "end": 1719.609,
    "text": "So this was a very interesting discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.089,
    "end": 1739.549,
    "text": " group of readings and discussions that we've had over the last few weeks and we are going to have a final discussion coming up in like the next three-ish weeks hopefully the author will join us again to discuss the material but also this discussion we would really love to have outside perspectives for people that have been engaging this with this material either through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.169,
    "end": 1762.747,
    "text": " watching the live streams or the book streams or have read the text so if you want to get in on these discussions of active inference and its application and governance please get in touch because we would really like to have some different perspectives in our final discussion session thank you blue and also to tyler for this great series and to kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.465,
    "end": 1771.408,
    "text": " Conclude on the live streams and bring in the journal, which is actually what happens in the work itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.429,
    "end": 1779.372,
    "text": "Every live stream that we do, which can be found at the Coda link shown here and posted in every video description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.124,
    "end": 1800.801,
    "text": " The slides are available where possible, but also we are developing a utilities pipeline that automatically downloads the audio from YouTube, uses artificial intelligence to do speech to text, outputs a markdown, and then uses rendering approaches to render that markdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.261,
    "end": 1805.084,
    "text": "And so there's a Git folder where you'll find all the transcripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.085,
    "end": 1825.315,
    "text": " and therefore be able to do some incredible natural language analysis ontology driven analysis of this corpus of several hundred videos and growing and we look forward to continuing to improve that pipeline as speech and text processing advance quite rapidly and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.987,
    "end": 1836.958,
    "text": " Techniques and methods that were outside of our capacity even weeks to months ago, day by day, draw nearer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.978,
    "end": 1846.53,
    "text": "So if you'd like a really open decentralized science, DeSci, open science project or corpus,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.782,
    "end": 1864.101,
    "text": " there are many many ways in the journal that we can improve the rigor accessibility and applicability of our live streams and therefore continue to add value in meaning even for live streams from the past anything to add",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.249,
    "end": 1871.05,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.19,
    "end": 1873.272,
    "text": "Maybe yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1874.793,
    "end": 1893.164,
    "text": "I want to support that it gives us a lot of opportunities to reuse in some way this transcription from our side as an institute, building some possible language tools or chats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.405,
    "end": 1907.775,
    "text": " to communicate about active inference and a lot and a lot of opportunities will arise like next months and years which is development of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.489,
    "end": 1929.397,
    "text": " language models in general as a domain so really we have like a main piece of for it a text and how we will use this text to how we can what services we can create which cases we can support",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.603,
    "end": 1954.666,
    "text": " it will be huge and hopefully people from community of institute could share some ideas how we can improve here and possibly participate in this project considering it as a technical heavy and like on the frontier of current language processing tools",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.486,
    "end": 1958.267,
    "text": " Thank you, Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.968,
    "end": 1968.8,
    "text": "Indeed, to watch all the videos may not be possible given limited time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.3,
    "end": 1977.09,
    "text": "It may not be preferable, but to engage in discourse and synthesize summaries with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.88,
    "end": 1987.944,
    "text": " a rich and articulate corpus where speakers are also known and we have connections with the speakers and the co-authors and all this other kind of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.344,
    "end": 1990.045,
    "text": "There are just going to be many, many opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.085,
    "end": 1997.229,
    "text": "So hopefully in a future round table, we can revisit this, go into a little bit more depth and show the status of our pipeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.209,
    "end": 2015.602,
    "text": " such that we can fulfill that vision of having a live stream and then rapidly within hours after the live stream have gotten the audio rendered into markdown rendered the markdown into a variety of accessibility oriented formats it's going to be amazing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.382,
    "end": 2021.724,
    "text": " In our last section, we'll talk about some research updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.844,
    "end": 2031.868,
    "text": "And so if you're watching live, please feel free to write a comment or share a favorite memory or do so in the comments after the video, but we'll go through just a few research updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.508,
    "end": 2037.411,
    "text": "And then if anyone has questions in the live chat, address those, and then that'll be it for the round table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.051,
    "end": 2040.852,
    "text": "So just a research overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.592,
    "end": 2044.194,
    "text": "We have a handful of ongoing research projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.242,
    "end": 2048.904,
    "text": " In the Active Inference Ontology, we are developing the Active Inference Ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.625,
    "end": 2058.45,
    "text": "In Active Blockference, we are developing a package that integrates and facilitates approaches for computational modeling with Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.23,
    "end": 2067.095,
    "text": "And in Robotics and Embodied, JF CloudShare is leading the way on some Lego robots that do symbolic Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.404,
    "end": 2081.717,
    "text": " We have several seed research projects for those who'd like to, for example, explore a graphical interface for active inference or look at the broader landscape of cognitive agent modeling approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.811,
    "end": 2103.959,
    "text": " and lastly although most ramified in their manifestations are the individual research projects so not all the work that people are engaged in is necessarily using the documents and the deliverables of the institute we also really honor and want to support",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.659,
    "end": 2128.011,
    "text": " the individual research journeys that many are on inside or outside of formal academic structures and so with our interns and others who aren't even interns there are so many exciting projects that everyone is engaged in they share during the open hours they post updates in our discord and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.432,
    "end": 2135.978,
    "text": " We do a lot when we work on our own projects and group projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.878,
    "end": 2138.76,
    "text": "Just to give two examples to highlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.081,
    "end": 2161.336,
    "text": " one of our interns Shohei Wakayama has updated his paper on active inference for autonomous decision making with contextual multi-armed bandits and this has recently been accepted to a relevant conference so congratulations Shohei also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.467,
    "end": 2176.641,
    "text": " a variational synthesis of evolutionary and developmental dynamics, a paper with both I and Blue as co-authors, and some other names that people may find familiar from the cast of livestream characters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.301,
    "end": 2182.406,
    "text": "So just a few that we wanted to draw together, but a little bit more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.459,
    "end": 2193.064,
    "text": " If you have any work that you'd like to share, please let us know and we'll make sure to highlight it in future newsletters and roundtables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.584,
    "end": 2206.071,
    "text": "It would be awesome to have that kind of an update system so that we could highlight like a collage or a mosaic of all the works that people are doing around the Institute and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.091,
    "end": 2208.011,
    "text": " It's just been great to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.452,
    "end": 2220.517,
    "text": "There were so many others that it was just hard to pick exactly what ones in our limited time to put here, but we saw many great developments over the past month, personally and organizationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.737,
    "end": 2223.998,
    "text": "So this is just a few of what the research side looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.359,
    "end": 2235.223,
    "text": "And in our last minutes, we can talk about whatever you fellows would like in terms of next steps or reflections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.837,
    "end": 2239.727,
    "text": " Perhaps Alex first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.123,
    "end": 2269.703,
    "text": " okay yeah i think we will continue structuring and improving activities related to education supporting interests from community and interest for people who who can produce educational materials we try to support in in all direction and provide affordances",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.591,
    "end": 2274.775,
    "text": " on organizational side and possibly on communications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.357,
    "end": 2286.79,
    "text": "And for research, I believe we will work on some kind of research strategy with our scientific advisory board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.286,
    "end": 2316.421,
    "text": " because for now we have like a few core research projects ongoing and that's great basics we support research of people who contacted us but having in place like a long-term strategy in research directions will be a great achievement if we can present something related on next round table related to it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2321.188,
    "end": 2322.454,
    "text": " Let's go from my side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.218,
    "end": 2324.142,
    "text": "Thank you, Alex Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.206,
    "end": 2328.848,
    "text": " So for me, I have kind of pulled back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.868,
    "end": 2341.418,
    "text": "If you're not seeing me around discussing Active Inference, it's because I have decided to prioritize building institutional infrastructure and institutional capacity for the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.458,
    "end": 2348.804,
    "text": "So my focus now is on getting grants for the Institute and pushing on the 501 status, 501 , whatever it is, the nonprofit status.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2353.468,
    "end": 2356.712,
    "text": " So that's my biggest priority and focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.732,
    "end": 2364.701,
    "text": "And I'm looking forward to kind of getting over a few of those hurdles and getting back into the material because I really do miss it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.741,
    "end": 2366.463,
    "text": "And I really miss like hanging out with everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.483,
    "end": 2373.651,
    "text": "But I can't I have to like focus my attention and effort so that I can continue to focus on active inference for many years to come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.931,
    "end": 2394.621,
    "text": " awesome great notes there indeed the organizational work is applying active inference it looks a little different than reading a paper joining a textbook group search this quarter has been um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.938,
    "end": 2421.193,
    "text": " very rewarding very developmental from what we can see it would be extremely helpful and requested slash appreciated for those who engaged a lot all the way on down through a little or not at all to provide their feedback directly or in the comments to this video or however they see fit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.054,
    "end": 2449.0,
    "text": " to let us know about how we can improve you are our niche and we act and first serve for you having that kind of closure with even your acknowledgement means a lot and it does help shape what we can and do offer on research alex i also look forward to what you suggested about developing more of a research program",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.623,
    "end": 2462.404,
    "text": " so that we can see where different things fit and we're kind of engineering that from the bottom up but increasingly being able to take a top-down view and about education",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.131,
    "end": 2476.359,
    "text": " Every textbook group, every dot zero, every course is rapidly becoming easier and easier to organize as we develop templates, expertise, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.32,
    "end": 2485.887,
    "text": "And right now, the rate limiting step in those who want to create or engage with educational material is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.687,
    "end": 2512.109,
    "text": " is the material itself and so that feels like a really good step in our active inference corner of the world prior there was a lack of content not saying that there's a sufficient amount now but hardly any casual conversations existed and hardly any technical discussions existed for especially this cutting edge active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.106,
    "end": 2516.016,
    "text": " developments that truly on a month by month basis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.247,
    "end": 2520.208,
    "text": " provide at least new views on older discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.088,
    "end": 2533.733,
    "text": "And so being able to develop that material and increasingly support others who want to teach their own courses like Chris Fields, as well as others that will be announced in upcoming in the rest of the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.753,
    "end": 2539.695,
    "text": "So those who want to teach or have a hosted course, get in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.915,
    "end": 2543.136,
    "text": "Those who want to learn more, we hope you're doing so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.176,
    "end": 2548.44,
    "text": " And again, we appreciate all of the engagements and feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.18,
    "end": 2551.823,
    "text": "It's how we actually make it happen together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.666,
    "end": 2556.487,
    "text": "Any closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.892,
    "end": 2572.3,
    "text": "Just to express gratitude for everybody engaging with the Institute, keeping us alive, and for you guys, because you're awesome to work with and hang out with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.423,
    "end": 2575.125,
    "text": " It's been fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.205,
    "end": 2575.887,
    "text": "Thank you, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.533,
    "end": 2579.776,
    "text": "Thank you, officers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.537,
    "end": 2581.52,
    "text": "Thank you, participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.981,
    "end": 2582.422,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.442,
    "end": 2583.805,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_03"
  }
]