[
  {
    "start": 0.031,
    "end": 27.81,
    "text": " when um man that's distracting okay i just watched your screen it's what's causing it where i was getting at was okay so on the one hand we we have this discretization and this continuity and on the other hand uh we can we have this embedding of the discreteness within the continuity or the continuity uh within the discreteness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.993,
    "end": 56.025,
    "text": " um or there's like nestedness right where you like you have like discreteness continuity continuity within the continuity and so on and so forth but also uh while we have the prioritization of what's happening there's also kind of like a tuning aspect right like the tune like there's tuning mechanics happening right like when you think of stuff like hyper planes or hyper parameterization um i think a beautiful paper to look at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.005,
    "end": 83.481,
    "text": " um is biological cognition by uh i think it's hubner and schulkin and um they bring up this term called heterarchical processing right and heterarchical has to do with like selective tuning or you think of like a like you're an audio engineer and you're mixing you have a you have a mixing board and you're trying to get the right trying to mix the channels and all that together the right way like this tuning or this adaptive tuning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 83.461,
    "end": 108.726,
    "text": " rather but it's like there's like a mix of there's layers of the hierarchical and then the tuning happening right so it's not even though i would argue it's mostly hierarchical you still have this tuning happening right you still have this sort of like this degrees of tuning happening but i'm not sure if that i like i'm i already am like about i'm on chapter five right now just chapter four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 108.959,
    "end": 117.995,
    "text": " but I'm not sure if the book really addresses like this hyper parameterization issue, but I guess you can kind of go over that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.195,
    "end": 118.576,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.818,
    "end": 120.339,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.439,
    "end": 124.025,
    "text": "That's I think that's a really interesting point too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.386,
    "end": 125.247,
    "text": "So whenever,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 126.34,
    "end": 128.282,
    "text": " I don't want to find the figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 128.322,
    "end": 134.728,
    "text": "I don't have it top of mind, but it's in the second half of the book, and it might be in the section on learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 135.208,
    "end": 147.259,
    "text": "But everything you're saying about tuning and hyperparameters, those are absolutely, those are directly components, not just figuratively in active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.779,
    "end": 154.305,
    "text": "And so what you can have is, like I mentioned precision earlier, that came up at the end of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 154.285,
    "end": 177.559,
    "text": " the chapter this chapter um but you can actually like precision can be modulated such that it impacts the rest of the model once you have a hierarchical model it's like it's not just you know every once in a while something happens here but most of the time it's over here it's like the whole model is integrated right and so you do have this really strong",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.349,
    "end": 183.195,
    "text": " constant interplay between the different layers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 184.076,
    "end": 195.491,
    "text": "So that hopefully at least figuratively gives you some sense of like the way you described like the continuous and the discrete and the discrete and the continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.571,
    "end": 204.643,
    "text": "It's like, well, as far as like coding a simulation, you do have to more clearly define one versus the other, at least at each layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 204.623,
    "end": 208.911,
    "text": " But then that said, they're so tightly integrated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.932,
    "end": 216.066,
    "text": "It's as if, you know, the discrete is impacting the continuous and then get involved in and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 216.086,
    "end": 216.907,
    "text": "And so that's there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 216.947,
    "end": 220.354,
    "text": "And then somewhere in the textbook,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.992,
    "end": 249.649,
    "text": " there's um there's another figure showing the pomdp we were looking at earlier but it also adds on hyper parameters and those very hyper parameters are what can be adjusted or tuned and they relate to precision for example you could have your agent learn its a matrix meaning the the likelihood matrix which figures in this chapter and so they might learn to you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 250.068,
    "end": 255.094,
    "text": " let's say we have our mouse in the T maze, the agent, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.414,
    "end": 265.906,
    "text": "Let's say they repeatedly go through the maze over and over and through trial and error end up learning that the stimulus is always on the left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.146,
    "end": 268.689,
    "text": "Let's say we're the experimenters, we could choose that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.709,
    "end": 270.471,
    "text": "Let's say the stimulus is always on the left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 270.871,
    "end": 275.957,
    "text": "For an agent who undertakes or engages in learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.393,
    "end": 294.587,
    "text": " It's not only going to try and minimize its free energy, its variational free energy, but it'll actually start to modify and change its beliefs within that A matrix to where it'll start to associate the cheese or the attractive stimulus with the location left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.922,
    "end": 322.026,
    "text": " in the maze right it's belief about that um and so that's that's how that plays in the kind of tweaking to the models and so on so we have we have learning that something like hyper parameters here in the case of precisions uh are directly implicated so all that all that is here but that's a really interesting paper that you you brought up um i almost feel like other",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.799,
    "end": 327.151,
    "text": " folks, other members of the Institute might find some interest in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 329.658,
    "end": 334.21,
    "text": "I found something, heterarchical control mechanisms in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.25,
    "end": 336.657,
    "text": "Does that sound right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.852,
    "end": 349.764,
    "text": " If there's any resources you have to suggest for me to look into, I'd love to take a look at it because I haven't really found something other than that one paper I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.826,
    "end": 352.908,
    "text": "It's Biological Cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.829,
    "end": 357.032,
    "text": "I think it's published through Cambridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.096,
    "end": 366.542,
    "text": "When you look it up, Biological Cognition, it's the Cambridge article.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.552,
    "end": 372.669,
    "text": " Um, it's paywalled, but, uh, I was able to get a copy of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.154,
    "end": 375.017,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.037,
    "end": 376.06,
    "text": "But, uh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.681,
    "end": 380.205,
    "text": " I hate when really nice papers are paywalled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.225,
    "end": 382.608,
    "text": "It's like, ugh, it's such a crime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.648,
    "end": 394.421,
    "text": "Anyway, yeah, I mean, I'm always looking for more papers that talk about this hyperparameterization stuff, because I feel like there's just not enough out there explaining that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 394.441,
    "end": 398.666,
    "text": "There's so much stuff talking about hierarchy and embedding things in hierarchies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.726,
    "end": 404.713,
    "text": "And even though I would say the hyperparameterization requires hierarchical stuff in order",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.693,
    "end": 409.799,
    "text": " to be effective, it's still not hierarchical in its nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 410.239,
    "end": 415.224,
    "text": "But yeah, I got, you know, definitely throw it at me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 415.405,
    "end": 418.168,
    "text": "I'm Katmandu on discord.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 418.208,
    "end": 429.82,
    "text": "So if you want to, if you want to DM me that those resources if you find them or even share it in one of the channels, I'll definitely I'm constantly eyeballing what's shared on server.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.84,
    "end": 432.203,
    "text": "So yeah, in a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.858,
    "end": 435.202,
    "text": " for the relationship between discrete and continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.903,
    "end": 453.752,
    "text": "In the machine learning paradigm, what they actually use is a mechanism called CLIP, which is simply going to take the energy relationship between this categorical and this discrete thing, and then just throw it in whatever's easier, which happens to be language in our case for large language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.188,
    "end": 458.993,
    "text": " So what you do is you find the most straightforward abstraction layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.713,
    "end": 463.817,
    "text": "This is going to be naturally hierarchical if we're talking about deep learning in this specific example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.838,
    "end": 468.922,
    "text": "You create that abstraction layer, and then you just keep it consistent through the entire thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.163,
    "end": 477.83,
    "text": "Two other things that might be related to what you're talking about is Anthropics' most recent paper, which I've forgotten the name of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.85,
    "end": 478.611,
    "text": "I'll have to find it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.372,
    "end": 483.756,
    "text": "But they essentially talk about not hyperparameters, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.546,
    "end": 491.254,
    "text": " the expectation of the actual state that you're putting into it, which they define as a feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.555,
    "end": 496.601,
    "text": "A feature is going to be deeply related to what we consider to be a concept, like a dog or a cat or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.282,
    "end": 505.913,
    "text": "And being able to take these concepts, which kind of create these little bubbles that you can create a context around, there is some situation that it's talking about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.893,
    "end": 508.658,
    "text": " which has some set of features which are going to be activated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.219,
    "end": 515.088,
    "text": "How much you activate these certain features are going to be deeper related to what you're saying about these hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.83,
    "end": 524.825,
    "text": "So deciding which hyperparameters to use is going to be found right now in machine learning through the creation of, do we make this feature really big?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.965,
    "end": 526.908,
    "text": "Do we shut these features down to be really small?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.429,
    "end": 532.137,
    "text": "And that's going to be how we control how these hierarchical mechanisms are actually going to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.18,
    "end": 536.183,
    "text": " consistently be able to produce the results that we're looking for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.223,
    "end": 548.557,
    "text": "One other slightly related thing is of the application of going through the network and having a kind of a meta network decide what inside of the network to actually create.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.778,
    "end": 562.512,
    "text": "This is going to be a very recent paper called, it gets into a bit of the weeds, but it's a mixture of a million experts, which essentially takes the entire hierarchical network that we're going to be dealing with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.099,
    "end": 571.596,
    "text": " And all of the variables are going to be encoded into these one layer MLPs, these one layer fully connected networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.518,
    "end": 578.17,
    "text": "And from there, we're going to find a way to create a meta network, which decides which ones to turn on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.851,
    "end": 583.1,
    "text": "And these ones that I'm talking about are going to be analogous to hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.561,
    "end": 584.803,
    "text": "And it's taking a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.986,
    "end": 599.953,
    "text": " large network, which again talks about the context that you're speaking of and being able to decide which ones are important, which facts are important inside of what we're talking about and only turning those on, which I think is deeply analogous to the hyperparameter thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.594,
    "end": 606.825,
    "text": "But that does lead me to a question of whenever we're talking about hierarchies in the active inference domain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.307,
    "end": 609.128,
    "text": " How much does it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.328,
    "end": 611.35,
    "text": "You guys were talking about system one earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.55,
    "end": 614.993,
    "text": "How much does it matter with respect to continuous or discrete variables?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.714,
    "end": 627.565,
    "text": "Once you get past the system one level of the direct input from the external environment that you're trying to understand, do you guys think that once you enter into a hierarchy, it's all just abstracted away?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.585,
    "end": 636.593,
    "text": "Or do you guys think that the discreteness or the continuousness of the actual input is going to have really deep ramifications as you go down the line?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.914,
    "end": 661.517,
    "text": " sorry that was a lot great great comment we'll each just give a short closing thoughts in these last minutes i mean shortest answer it's simply a hundred percent dictates it it's like asking about a transistor how would it matter what the composition of the metal is or how would it matter what the size of the plate or how closely these elements are it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.632,
    "end": 663.335,
    "text": " It simply determines it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.355,
    "end": 671.668,
    "text": "So then there might be some situations where you could discretize a continuous and get this or that performance retention or the other way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.449,
    "end": 677.016,
    "text": "But that's kind of the fun is the textbook is just showing us those fundamental motifs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.918,
    "end": 683.927,
    "text": "And Toby Smyth in the Structured Active Inference livestream earlier today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.907,
    "end": 694.185,
    "text": " showed that in a in a far more comprehensive way than the Markov blanket formalism with the broader applied category theory for interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.247,
    "end": 703.722,
    "text": "So it's like all about how it's specified like a physical transistor or Linux kernel deployment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.907,
    "end": 729.59,
    "text": " I don't know if this is a little too simple relative to what we were all just discussing, but I did drop a link to one paper into the chat there, and that is deep active inference and scene construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 730.331,
    "end": 740.644,
    "text": "And just given we have such little time left, I just wanted to drop something there as a kind of combination of things we're talking about, putting hierarchical modeling",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.248,
    "end": 755.563,
    "text": " And here, the idea of looking at particular features that, when combined, maybe allows for, let's say, classification or categorization of, in this case, the paper I shared, a visual stimuli.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 755.883,
    "end": 756.924,
    "text": "It's rather interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.944,
    "end": 763.471,
    "text": "They put together a two-layer model where it's like a saccade experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.511,
    "end": 767.155,
    "text": "So it's like someone is viewing a two-by-two grid",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 767.54,
    "end": 787.168,
    "text": " and then they make inferences based on particular things that they see in each of the coordinates of that two by two grid and then they from there have to infer certain aspects of what's going on in each of those two grids and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.486,
    "end": 816.531,
    "text": " that gets pushed up to a higher discrete level that allows them to uh to make an inference as to how they should categorize the entire uh scene the entire two by two grid like what is going on in there it's based on a previous experiment that's very similar but uh it would just be it it's it's a way to kind of simplify uh a lot of the principles we're sort of talking about here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 816.967,
    "end": 823.793,
    "text": " but also being able to see something like trying to theorize, like how does seed construction happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.315,
    "end": 825.981,
    "text": "If you look at a broader,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 826.417,
    "end": 852.036,
    "text": " uh expanse and you're trying to figure out like infer a belief about what is going on there well your eyes are limited and so they can only look at certain points so how do you start to construct a belief about what the overall scene is based on particular features that you look at and you have to make inferences about those individual features in the first place so you know for me to look at a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.421,
    "end": 872.191,
    "text": " you know, an overview of like a street, and I don't know exactly where, you know, that is in the city, I have to look at different parts of the overall image, I have to infer, oh, that's a particular sign, that's a particular building, so on, eventually to the higher order inference of where am I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.291,
    "end": 873.974,
    "text": "What is this location?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.054,
    "end": 876.477,
    "text": "So I just thought that one would be interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 877.419,
    "end": 878.26,
    "text": "I'll try to add",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.965,
    "end": 896.569,
    "text": " other things that that maybe come to mind uh in the coda um and uh yeah really really interesting talk today so thanks everyone thank you fellows see you yeah thank you so much bye guys bye",
    "speaker": "SPEAKER_03"
  }
]