[
  {
    "start": 2.697,
    "end": 3.779,
    "text": " Welcome, fellows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5.203,
    "end": 11.396,
    "text": "We're in the second discussion on Chapter 9 for Cohort 7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 12.358,
    "end": 20.436,
    "text": "So we could go to any part of Chapter 9 or jump in wherever you prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.363,
    "end": 35.818,
    "text": " What about the provocative first sentence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.838,
    "end": 41.04,
    "text": "Ultimately the models described in this book are only useful if they can answer scientific questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.716,
    "end": 59.975,
    "text": " Yeah, I liked this whole chapter because of its... Well, because of the way that it inverts everything for the sake of applying this to science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.035,
    "end": 71.55,
    "text": "I think that it's interesting, the cognizance of it all, to realize, like, maybe what's been done so far is helpful as a model, but that doesn't really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.391,
    "end": 79.308,
    "text": " That's not the same as, let's say, a scientific, I guess, result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.99,
    "end": 88.932,
    "text": "And so, but to turn it around and say it is quite impressive if you can do it backwards so that if you can, if I understood this correctly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.519,
    "end": 113.772,
    "text": " if you can suppose that there's this model in a subject or maybe a group of subjects and then you can um given that supposition then maybe figure out what the parameters should be um or what the what the results should be and then work back to say okay well if these are the results then what are the initial beliefs you know between different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.752,
    "end": 116.335,
    "text": " participants in a population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.896,
    "end": 136.861,
    "text": "And then if you can do that, then it's interesting, oh, that you have a, you know, potentially a scientific explanation of how these different individuals in a population differ and why and to be able to show the helpfulness of the model and as explanatory, and then you can correlate that with other information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.021,
    "end": 138.443,
    "text": "So that's how what I took from this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.945,
    "end": 148.108,
    "text": " Yeah, great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.208,
    "end": 156.77,
    "text": "It has a lot to do with what makes a scientific account like any, let alone a satisfying or useful one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.81,
    "end": 162.945,
    "text": "And what is the relationship between empirical observables",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.381,
    "end": 190.924,
    "text": " like the brute fact of the data points and inferred latent states like causal attributions or unobserved features which are derived from empirical data but derived from empirical data does a lot of work because you could derive in in so many different directions from empirical data you could say that this art piece was derived from the weather data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.377,
    "end": 203.536,
    "text": " And there's so many degrees of freedom with what weather data you took and what art piece you resulted in that somebody else might not be able to look at it and know that you used weather data at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 204.898,
    "end": 205.059,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.022,
    "end": 217.418,
    "text": "Now I'm interpreting this statement to mean, I'm interpreting answer scientific questions to mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.073,
    "end": 219.856,
    "text": " make testable predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.638,
    "end": 229.891,
    "text": "That may not be everyone's interpretation, but I always thought models are only useful if they can make testable predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.757,
    "end": 235.099,
    "text": "Yeah, that's a great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.119,
    "end": 238.444,
    "text": "That's related to, like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.217,
    "end": 268.566,
    "text": " falsificationism and the idea that we create secondary hypotheses that could then be either assessed to be true or false under the logic, like if what you learned from the answer didn't give any derivative product that could be deemed to be more or less valid, it was kind of a dead end answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.423,
    "end": 273.909,
    "text": " because it doesn't give any consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.689,
    "end": 278.374,
    "text": "And then testable predictions is like the empiricist way of framing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.215,
    "end": 290.048,
    "text": "And that can even be framed in staying within the active ontology, like answering scientific questions means reducing uncertainty about the scientific question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.71,
    "end": 293.072,
    "text": "I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.092,
    "end": 295.515,
    "text": "Now, alternatively,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.879,
    "end": 311.723,
    "text": " pointing at the first part of what you just said, it's still useful if we're moved forward in our investigations, even if it doesn't have explicitly testable predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.406,
    "end": 317.132,
    "text": "If we're still developing the field of inquiry, that's still valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.559,
    "end": 332.487,
    "text": " And when you say testable predictions, I think that that comes at it from both ends that are necessary in science, because you want to have things related to data that's observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.848,
    "end": 337.197,
    "text": "So if there's no data involved and there's no observations involved, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.177,
    "end": 338.341,
    "text": " That's a funky science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.943,
    "end": 340.709,
    "text": "But then also you want to have a theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.331,
    "end": 349.718,
    "text": "So you want to have a model that is meaningfully breaking down or decomposing or structuring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.985,
    "end": 353.831,
    "text": " These variables are questions or ideas and so that you can look at relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.412,
    "end": 360.0,
    "text": "And so if you have the testable prediction, it means that you have it from both ends and then you can apply it to a wider scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.04,
    "end": 361.823,
    "text": "You know, you can look at new examples, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.843,
    "end": 372.499,
    "text": "But I think in the case of this chapter, it's about predictions of predictions, which is very sophisticated because you're basically predicting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.8,
    "end": 393.627,
    "text": " um well that you can figure out what's in another organism's mind you know what they're predicting let's say and then and if you're if your prediction's correct you'll be able to do that for a whole variety of individuals to say well they're predicting these different things and you'll be able to confirm that and then so the confirmation can also happen on both levels that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.607,
    "end": 418.855,
    "text": " you can do that for more and more individuals but given an individual you can also get better and better validation for like well what exactly is that uh belief or prediction that they're making um so it's sophisticated again pointing to the process nature the dynamic nature the approach yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.189,
    "end": 429.775,
    "text": " And talking about it this way, with chapter nine being so grounded with empirical data, it's kind of like the mirror symmetry of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.178,
    "end": 433.825,
    "text": "Chapter one and 10 are like these overview chapters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 434.607,
    "end": 436.692,
    "text": "Chapter two is the low road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.228,
    "end": 445.26,
    "text": " So when we got on that on-ramp, it was about building the model and the joint distribution and Bayesian statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.981,
    "end": 454.994,
    "text": "And now we're kind of exiting on an empirical low road because it's again, reconnecting us back to the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.256,
    "end": 461.123,
    "text": "Like this is a setting that's very familiar to a behavioral scientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.144,
    "end": 466.29,
    "text": "And even when a paper doesn't, like a behavioral science paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.422,
    "end": 485.005,
    "text": " doesn't explicitly use these techniques doesn't use a palm dp doesn't calculate variational free energy still basically the setting of this meta bayesian um setup is there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.862,
    "end": 490.066,
    "text": " Like here, it's the temperature and the humidity in the laboratory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.086,
    "end": 502.459,
    "text": "And the experimenter is playing sequences of videos, or they're presenting symbols on cards, which are observations for the subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.3,
    "end": 508.886,
    "text": "And then they're receiving the action output of the subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.906,
    "end": 512.95,
    "text": "And then this just does so much interesting work with the subjective",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 514.162,
    "end": 521.914,
    "text": " because it is both subjective to them and it's the subject of the behavioral experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.939,
    "end": 527.984,
    "text": "And it's like, this is what a laboratory is like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.264,
    "end": 541.705,
    "text": "And then this solid box is like the kind of the veil of unknowing for the behavioral scientist in terms of they can set up what's in the room,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.427,
    "end": 551.962,
    "text": " They can pass the stimuli to the subject and they can observe what comes out with biometrics or with whatever kind of measure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.464,
    "end": 555.988,
    "text": "And then what's inside is proposed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.291,
    "end": 568.367,
    "text": "So this structure is a really parsimonious way to just look at the behavioral scientific setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.085,
    "end": 596.869,
    "text": " And it turns out it has a lot of structural congruence with the metacognitive phenomenology, like an observer observing within an organism, but that goes into a kind of a different direction than this like more behavioral laboratory scientific",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.055,
    "end": 629.758,
    "text": " very practical and and this and this does get really practical and the by number or by citation count most of friston's papers may be this kind of like this many subjects were put into the fmri for this many minutes exposed to these stimuli here was the statistical power here were the the um here was how the experiment happened um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.692,
    "end": 652.216,
    "text": " So this gets to the most practical statistical power calculation-like parts of doing behavioral science, which kind of, in the Skinnerian area, like B.F.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.236,
    "end": 656.18,
    "text": "Skinner, without going too much into this, that's kind of the whole debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.26,
    "end": 658.183,
    "text": "Does that deny minds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 658.343,
    "end": 661.787,
    "text": "Does behaviorism exclude minds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 662.864,
    "end": 690.475,
    "text": " and the the cover of the book told us that we were going to be in for mind brain and behavior and we saw a brain in chapter five with the difference neural systems chapter nine really goes after behavior because it's not making psychological assertions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.079,
    "end": 696.247,
    "text": " Um, or, or, um, philosophical assertions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 698.431,
    "end": 711.833,
    "text": "So mind is obviously a, a really complex and rich area with the first person and the second and the third person, all these, and all these different traditions and our own, uh, firsthand experiences of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.015,
    "end": 718.183,
    "text": "Uh, but nine zeros in on behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.885,
    "end": 723.168,
    "text": " which in a way gives the least contentious of the three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.588,
    "end": 739.783,
    "text": "That statement might be contentious to some, but the neural accounts, somebody might think, well, with molecular reductionism and genetics and systems biology and deep learning, we're doing better than chapter five on brain accounts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.686,
    "end": 748.17,
    "text": "But in terms of the structure of the behavioral environment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.108,
    "end": 753.334,
    "text": " this is really like a gem tucked in at the end of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.151,
    "end": 763.193,
    "text": "I like that perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.356,
    "end": 766.8,
    "text": "There are many traditions that say reality is what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.562,
    "end": 768.724,
    "text": "That's behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.788,
    "end": 791.32,
    "text": " Well, and I think for this chapter, I don't know if I entirely agree, but maybe I don't understand, but with Daniel, because a lot of these examples at the end have to do with psychological analyses, like, let's say, hallucinations, right, or delusions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.34,
    "end": 796.028,
    "text": "So that's partly behavioral, but that's partly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.295,
    "end": 807.334,
    "text": " their internal models right like and and i think one of the challenges with these experiments just thinking about uh what it would be like to do one is that with active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.567,
    "end": 815.254,
    "text": " in its full glory, it has two outcomes, you could be updating your environment, or you could be updating your belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.715,
    "end": 836.815,
    "text": "So then if you're doing an experiment, you want to capture that, I think that'd be like the whole glory of it, you know, you have to be on top of two different channels, you know, the external like the the behavior to be able to record Oh, you know, behavior updated the environment, let's say, but you also want to be able to capture well, oh, here, they updated their belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.655,
    "end": 841.661,
    "text": " So that already is kind of like a double thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.681,
    "end": 847.45,
    "text": "I don't know if that's... Yeah, great, great points and challenging ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.51,
    "end": 858.306,
    "text": "So yeah, from the first half of the book, we have this two ways to dissipate free energy with update behavior or update belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.326,
    "end": 865.317,
    "text": "Now, from the behavioral researcher's perspective, everything coming out of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.567,
    "end": 895.202,
    "text": " box is observed behavior whether it's an eeg trace um or whether it's a self-report or whether it's a motor behavior so from the outside everything that we're observing is behavioral and basically everything that is internal is being modeled as a belief that doesn't mean that it's like a um propositionally held sentiment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.402,
    "end": 899.528,
    "text": " but it's being modeled as a Bayesian belief, which undergoes updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.068,
    "end": 913.187,
    "text": "So you're totally right that if we want the full active inference account, we do want to be able to describe both the updating of behavior, but this is the updating of observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.749,
    "end": 922.86,
    "text": "So if we only wanted to describe behavioral updating, we could just do descriptive statistics on sequences of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.313,
    "end": 925.755,
    "text": " And there might be a situation where that's totally fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.796,
    "end": 950.94,
    "text": "But as soon as the behavioral researcher starts to suppose some latent factor that wasn't behaviorally observed, but is abduced to be relevant for the generation of behavioral sequences, they do start to kind of swim upstream into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.287,
    "end": 957.292,
    "text": " cognitive states, which do get into minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 958.433,
    "end": 977.974,
    "text": "Like, that's where this where those examples in the table, basically go from, they're grounded in self report, or I secade, or decision or game theory games, or trust games.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.591,
    "end": 993.229,
    "text": " And then latent states are proposed, which make their way kind of up the low road towards the psychological and the cognitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.048,
    "end": 1001.535,
    "text": " but maybe just to emphasize what I think is scientific about this chapter compared to what we've seen before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.056,
    "end": 1017.073,
    "text": "If somebody comes up with a computer model using active inference principles to explain how a hand reaches out and manages to gracefully pick up a chess piece and move it, so that there's this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.053,
    "end": 1045.086,
    "text": " model of how the muscles gracefully uh relax or or tense up and they do all that that model is uh interesting could be very slick uh it could be it would be it's always impressive but it's not convincing that that's scientifically you know really relevant in a sense because there could be many kind of slick ways to model that there could be many biological processes that explain that but like what this chapter is uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.348,
    "end": 1067.874,
    "text": " portraying, I think, or suggesting, it's saying, look, if you have, let's say, a group of individuals and you're able to model their behavior, but then you're able to show, look, some of these individuals are applying a different strategy, they're having different beliefs, they're getting different results, you know, because... See, so that's a very discrete difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.254,
    "end": 1070.837,
    "text": "You're able to say, like, in these cases, it's one way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.937,
    "end": 1072.859,
    "text": "In these cases, it's another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.879,
    "end": 1075.883,
    "text": "So scientifically, like, that becomes...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.863,
    "end": 1084.331,
    "text": " For somebody like me, that's very convincing that, oh, that may well be the right explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.391,
    "end": 1089.147,
    "text": "Maybe I'm gullible to things like that, but I find that more...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.7,
    "end": 1090.02,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.08,
    "end": 1094.346,
    "text": "Like, let's just say we do the rat and the teammates, like the chapter seven experiments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1095.207,
    "end": 1101.274,
    "text": "So if we just wanted to say, we run a hundred mice for a hundred replicates each.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1102.376,
    "end": 1107.642,
    "text": "So if we just wanted to say, okay, we're making a leaderboard, which one got the highest percentages?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.505,
    "end": 1113.75,
    "text": "We just have that raw data tabulatable from description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.916,
    "end": 1123.028,
    "text": " Or if we wanted to say just a simple correlation between the temperature in the room and the success rate, which mice did better when it was hot?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.809,
    "end": 1127.133,
    "text": "These are still basically you take two observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.614,
    "end": 1131.96,
    "text": "We have the observable temperature, observable successes, and we just basically there's our answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1132.681,
    "end": 1139.029,
    "text": "So that sort of doesn't appeal to any latent variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.178,
    "end": 1153.677,
    "text": " But then, like you're saying, if we were going to want to go beyond, so then we said, well, how likely do we feel that the leaderboard would be the same on the next replicates or if the conditions changed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1154.318,
    "end": 1159.144,
    "text": "Or we want to study transfer learning into a different setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1159.36,
    "end": 1177.464,
    "text": " That's where, I mean, why go through all this work of making it, specifying a generative model with cognitive states, doing model inversion to get error bars on unobservables when if we just have the observables, let's just tabulate them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.066,
    "end": 1183.492,
    "text": "And so again, that goes to sort of the depth and type of scientific account that one seeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.554,
    "end": 1186.296,
    "text": "If we just want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1187.373,
    "end": 1214.089,
    "text": " summarized observables this whole apparatus could be overkill like if we were just trying to say we just want to know which cars are breaking the speed limit it's just like okay it's going over the speed limit boom there's the rule-based observable but if you wanted to say we want to be inferring something about the attention level or the cognitive state of drivers mm-hmm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.626,
    "end": 1228.268,
    "text": " and maybe want to have one model that's just speed, one is just speed and exposition or something like, and they have whole portfolios of models, portfolios of cognitive states, noisy or patchy data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.95,
    "end": 1241.41,
    "text": "So it's a much more flexible modeling situation to be able to go from a custom sensor array to a custom cognitive unobservable suites",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.757,
    "end": 1269.253,
    "text": " and then treat those unobserved inferred variables as downstream as observations for a downstream process like this could be a risk factor but the but a risk factor is never going to be a measurable feature of the world there could be an observation that's a good proxy for risk or something like that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.432,
    "end": 1283.474,
    "text": " But any kind of summary statistic or risk estimator, there's just all kinds of stuff that seems pretty obvious to want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.596,
    "end": 1287.942,
    "text": "Like which one of these buildings is gonna be most likely to have this happen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.284,
    "end": 1295.595,
    "text": "But that will never be revealed from just munching the data from observables down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.436,
    "end": 1304.007,
    "text": " But even like with a risk factor, like risk factor is generally not a satisfactory causal explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.509,
    "end": 1310.676,
    "text": "Well, I mean, it's maybe helpful and practical in some ways, but if you really wanna know the cause, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.696,
    "end": 1313.781,
    "text": "Like there's usually something direct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.961,
    "end": 1323.895,
    "text": "And I think what this is offering is to say that like if different individuals have or organisms have different generative models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.263,
    "end": 1343.166,
    "text": " they're going to have different causes to their behavior yeah again to like what makes a scientific account what if we say well this person uh this building was a high risk of falling why did it fall it had a high risk of falling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.192,
    "end": 1347.217,
    "text": " It's like, well, that's not really an explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1347.798,
    "end": 1355.872,
    "text": "That might be very useful that you were able to have a calibrated risk assessments or which one of these cars is likeliest to speed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.554,
    "end": 1365.93,
    "text": "So that gets into the testable useful hypotheses, but it's kind of like, that's an account in the investigator's minds",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.855,
    "end": 1395.968,
    "text": " a utility oriented account but that's not even being proposed to be an actual natural account of like why the building fell right which might relate to like the total gravitational load and like the supportive ability or something like that but the design the design and the materials right also i guess i think you point to why uh active inference crops up in so much of the embodied and active",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.859,
    "end": 1424.487,
    "text": " mind literature whether the internal models are updated or inaction is the is what's being updated they can't be separated they they interact with each other yeah like the the moot or the trivial system is just behavioral",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.445,
    "end": 1427.748,
    "text": " So then there's no need to abduce a latent state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1427.768,
    "end": 1429.59,
    "text": "So it's kind of like it can't update beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.77,
    "end": 1431.332,
    "text": "It can only update its action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.653,
    "end": 1431.753,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1431.773,
    "end": 1442.626,
    "text": "But once you start getting into anything, another important piece is the introduction of the Bayesian approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.667,
    "end": 1450.255,
    "text": "So if we do the mice studies and like 75% of them succeed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1450.353,
    "end": 1453.498,
    "text": " And you say, well, what's your best estimate on mice succeeding?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.28,
    "end": 1467.022,
    "text": "Not how many mice succeeded in your experiment, but what is your best estimate on mice succeeding in this, if you were to run it next week, or if you were to have another student run it or something like that, the frequentist answer is 75.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.064,
    "end": 1470.949,
    "text": "You know, we flipped the coin 75, a hundred times, we got 75 heads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.989,
    "end": 1472.451,
    "text": "So our best estimate is 75.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.172,
    "end": 1475.837,
    "text": "And that's like the maximum likelihood estimator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.037,
    "end": 1487.139,
    "text": " Whereas with Bayesian statistics, we might have like a meta analysis of similar studies and say like, we have a pretty strong belief that it's about 50%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.562,
    "end": 1494.754,
    "text": "So then on a given day, when we get a run and it gets 75 with attention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.662,
    "end": 1500.269,
    "text": " full attention to the experimental results, we could say, we now believe that it is 75.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1501.351,
    "end": 1507.841,
    "text": "We believe the situation is rapidly changing and that now mice solve it 75% of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.983,
    "end": 1512.128,
    "text": "Or we can say, this is just this many sigma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1512.188,
    "end": 1513.389,
    "text": "It's a three sigma event.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.832,
    "end": 1517.276,
    "text": "One in 700 times, we expect to see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.077,
    "end": 1522.904,
    "text": "We have now seen it one in 700 times and we're not updating from 0.5 at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.926,
    "end": 1524.066,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.704,
    "end": 1531.513,
    "text": " Or it could be anywhere in between with like, yep, now our best posterior estimate is 52%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.853,
    "end": 1551.218,
    "text": "So that's the part of this whole work of specifying the Bayes graph and doing this bidirectionality of like generating synthetic data or receiving empirical data is so that we can explicitly include a prior belief term",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.923,
    "end": 1558.374,
    "text": " Because the, just the munch, the description, you know, munch, the data style describe the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.576,
    "end": 1562.44,
    "text": "You don't really get a chance to include your prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.442,
    "end": 1575.602,
    "text": "Whereas Bayesian statistics is basically just including your prior as an observable or the analyst, and then, then making choices about how much to wait the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1576.949,
    "end": 1592.589,
    "text": " versus the data coming in, which again is that kind of reflexive element because it's like, oh yeah, how much, how precision waiting on how much to do prior updating given the observation is the Bayesian statistics question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.416,
    "end": 1600.459,
    "text": "And descriptive statistics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.523,
    "end": 1630.26,
    "text": " lends itself you know not not not to weld things together too tightly but that lends itself to the p-value accept or reject falsification whereas the bayesian epistemology and and there's many like writings and explorations of this lends itself to more this continuous probability space updating style it's like well is the sun gonna rise tomorrow or not you know whatever will we come to see the sun tomorrow",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1630.595,
    "end": 1637.122,
    "text": " And the frequentist could just say, yes, or I failed to reject that it didn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.142,
    "end": 1644.069,
    "text": "It's like all those kinds of expressions, as opposed to just having a very high posterior belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.312,
    "end": 1652.839,
    "text": "And you could make a Bayesian model that does give a discrete answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.661,
    "end": 1660.467,
    "text": "But if you don't constrain it that way, it's going to stay in the continuous probability spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.649,
    "end": 1662.151,
    "text": " which have more agility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.613,
    "end": 1667.716,
    "text": "Because it's like, okay, well, we shut the door on that hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.836,
    "end": 1670.659,
    "text": "It was falsified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1672.061,
    "end": 1686.235,
    "text": "But then part of the sometimes fallacious nature of the frequentist test is you're presented with two hypotheses and then either there's a rejection or a failure to reject one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.48,
    "end": 1691.804,
    "text": " And then the failure to reject is not the same as the acceptance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.125,
    "end": 1703.495,
    "text": "And the rejection of one isn't the same as the acceptance of the other, because it can all be down this super contrived sequence of assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.118,
    "end": 1710.662,
    "text": "So it could be like, we tested to see whether eating eggs made a difference in cholesterol.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1711.964,
    "end": 1716.508,
    "text": "At this p-value, we didn't reject the null that it didn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.024,
    "end": 1723.392,
    "text": " But that's like, I don't know if it's like the contrapositive or something like that, but it's not the same as saying that it doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.976,
    "end": 1737.973,
    "text": "It's just saying that that study wasn't powered or sensitized to detect the rejection, which has a huge overlapping territory with it actually not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.915,
    "end": 1741.078,
    "text": " making a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.098,
    "end": 1746.404,
    "text": "So all of this is kind of like in practice, they might all give the same results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.864,
    "end": 1759.139,
    "text": "If you're just testing for the difference in temperature between two rooms and the difference is big enough and clean enough, probably a huge number of methods are gonna get you the right actionable information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1761.802,
    "end": 1766.087,
    "text": "But this is getting towards a more sophisticated accounting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.135,
    "end": 1771.984,
    "text": " that helps us embody all of these nuances that do come into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.024,
    "end": 1790.092,
    "text": "This brings us back to the great power necessitating careful model construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.833,
    "end": 1792.716,
    "text": "Sort of like in our other session,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.354,
    "end": 1794.335,
    "text": " It'd be worthwhile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.116,
    "end": 1801.304,
    "text": "I'm looking for a course on modeling, the philosophy of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.948,
    "end": 1807.992,
    "text": "Well, I would talk about the model I'm thinking of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.092,
    "end": 1815.581,
    "text": "This chapter kind of provoked me to think about, because I like to model human experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.902,
    "end": 1817.824,
    "text": "I've been working on that for decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.625,
    "end": 1822.77,
    "text": "And so our active inference is attractive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.628,
    "end": 1845.248,
    "text": " and um but and so active interest is quite universal but but maybe not completely so an example of the type of problem i thought i would do i would like to know what are the languages by which for a human being things come to matter or let's say a language for how does meaning arise or how does a person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.532,
    "end": 1847.219,
    "text": " believe like an event happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.319,
    "end": 1849.769,
    "text": "I think that there's maybe some basic cognitive language for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.789,
    "end": 1851.716,
    "text": "So I needed data for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.817,
    "end": 1855.17,
    "text": "So the data I thought I would study is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.572,
    "end": 1876.011,
    "text": " triangle geometry that you can have triangles of different shapes and then you have these concepts of triangle centers which could be the simplest one is what's called an in-center you draw a circle inside a triangle and you make the circle as big as possible the center of that circle will be called the in-center of the triangle but you could do it with a center on the outside and there's all these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.379,
    "end": 1905.846,
    "text": " ways that you could make points given a triangle like you know you look at the medians you you intersect them things so but there's not that many ways and i suspect if you if i study that and there's an encyclopedia of triangle centers and if you study how it builds it builds a language a language like this or maybe any language will probably have six underlying actions uh which relates to let's say six cases uh daniel gave a um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.484,
    "end": 1909.73,
    "text": " talk about cases in language, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.77,
    "end": 1918.085,
    "text": "So something like that, these type of prepositional ways of thinking that nouns are, let's say, used in a language like Lithuanian or Russian or so on, or Latin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.727,
    "end": 1926.501,
    "text": "So the point being that, okay, as far as active inference goes, it's kind of interesting that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.751,
    "end": 1932.933,
    "text": " it's possible to think of there is this kind of a coordination between two types of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.073,
    "end": 1937.368,
    "text": "One is, let's say, a physical continuous action like making a circle bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.872,
    "end": 1944.684,
    "text": " The other one is saying there's like a conceptual point to say, I want to have a center of a circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.704,
    "end": 1946.908,
    "text": "So you do actions like you make a circle bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.968,
    "end": 1948.03,
    "text": "It's not positioned well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.05,
    "end": 1949.072,
    "text": "You kind of bump it over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.112,
    "end": 1950.214,
    "text": "You keep doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.234,
    "end": 1951.336,
    "text": "You would do a chain of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.376,
    "end": 1953.44,
    "text": "You end up with something like that's a center.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.48,
    "end": 1957.467,
    "text": "Let's say that could make sense for a generative model saying this circle needs a center.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.447,
    "end": 1980.147,
    "text": " that i could focus on and maybe you can redo it for different triangle shapes um and do different types of triangles you get this whole kind of activity for language the problem with that based on this chapter is that yeah but is that ever going to be science you see like is that is that ever going to solve a scientific issue because you're just um studying um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.633,
    "end": 1987.722,
    "text": " you know, these triangles, it's not, in a certain sense, it's not really data from the real world in terms of experimental data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.543,
    "end": 1994.23,
    "text": "On the other hand, it kind of is because you have this whole, you know, encyclopedia of triangle centers people came up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.931,
    "end": 1998.916,
    "text": "What does active inference say about an encyclopedia like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.956,
    "end": 2000.078,
    "text": "Like how to make sense of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.098,
    "end": 2009.83,
    "text": "Like, so if there was a modeling language or approach that could go into that data and say, hey, this is how to, this is what to do to understand it as a language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.81,
    "end": 2029.29,
    "text": " Now, so the one thing I wanted to just conclude with is that what this chapter got me thinking, though, is that in order to make it to the next level where it's kind of more observable or it's more meaningful, you kind of need the system or the game to maybe like be communicating with another individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.45,
    "end": 2036.678,
    "text": "So, like, let's say there's two people playing this game of the triangle or maybe like, you know, you're just communicating with yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.658,
    "end": 2062.547,
    "text": " you're replaying you know you're trying to get good at this you're trying to make sense of you know what is a triangle uh what helps me understand triangles see so when you model that and how those games are related and i think the reason being that like in the science of this what's impressive is when you have two different people with two different generative models and they get different behavior so if you can do that in a single person like with this type of game saying well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.713,
    "end": 2072.262,
    "text": " you can go into different modes or have different beliefs or they can change, or you can do that in communicating with somebody else, then I think that becomes the kind of thing we're trying to be able to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.904,
    "end": 2076.266,
    "text": "Yeah, very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.346,
    "end": 2077.066,
    "text": "Yeah, Stephen, please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.167,
    "end": 2086.015,
    "text": "I think that's the essence of the human mind, that there are two generative models that are compared with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.436,
    "end": 2090.779,
    "text": "There's an online sensory input and then there's the internal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.704,
    "end": 2095.027,
    "text": " representation of that sensory input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.047,
    "end": 2096.609,
    "text": "And those get compared with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.47,
    "end": 2117.129,
    "text": "And it's that comparison, I think, in the higher level cortical areas that is this really complex motor behavior that we call thought, a sense of self and motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.149,
    "end": 2121.593,
    "text": "I wonder, so there's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.012,
    "end": 2133.023,
    "text": " I wanted to ask if you were using meaning in the sense of concept, like the formation of meaning is the formation of concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.123,
    "end": 2136.267,
    "text": "I think there's a whole literature in what concepts are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.287,
    "end": 2146.517,
    "text": "Well, of course there's a literature in what meaning is also, but I'm always approaching this from the standpoint of the actual architecture of the brain and the body and how this is implemented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.408,
    "end": 2155.796,
    "text": " Neurons are Bayesian units themselves, and then they form Bayesian circuits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.517,
    "end": 2176.335,
    "text": "It's the dynamic processes with these frequent rise and fall of these activations with different frequencies that allow signals to get through or not, that amplify or cancel signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.67,
    "end": 2188.047,
    "text": " You know, it's so hard for me to constantly translate Bayesian terminology like beliefs into a structural terminology like, you know, a circuit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.191,
    "end": 2196.403,
    "text": " So what I find very helpful, what you said was like that you see generative models at both levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.843,
    "end": 2199.668,
    "text": "And I really hadn't thought about that, but maybe that's the way to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.97,
    "end": 2204.235,
    "text": "I have this model of the three minds, I call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.576,
    "end": 2207.841,
    "text": "So there's a mind that knows the answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.428,
    "end": 2212.453,
    "text": " which would be what you call like the sensory, then it knows them unconsciously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.793,
    "end": 2217.779,
    "text": "But then you have a mind that does not know, but it consciously does not know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.88,
    "end": 2219.181,
    "text": "So it's just like full of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.241,
    "end": 2220.142,
    "text": "It's full of variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.162,
    "end": 2221.704,
    "text": "Like every word is a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.764,
    "end": 2224.748,
    "text": "So like the word horse really means like what is a horse?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.768,
    "end": 2227.191,
    "text": "And then the other mind gives you the answer what the horse is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.271,
    "end": 2228.773,
    "text": "Maybe it gives you an image or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.454,
    "end": 2234.38,
    "text": "So in terms of meaning arising, it's like basically you have these two minds on autopilot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.4,
    "end": 2236.242,
    "text": "You know, like one is just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.222,
    "end": 2240.651,
    "text": " One is just feeding you all kinds of imagery like you're watching television.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.711,
    "end": 2245.682,
    "text": "The other one's just kind of chattering away, you know, and they just do their own thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.704,
    "end": 2253.538,
    "text": "But you have a third mind that's investigatory that tries to connect them to, you know, with each other to kind of like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.518,
    "end": 2280.589,
    "text": " balance them so that the mind that knows and the mind that does not know they're able to say the same things in different ways because like the mind that knows it's like a hundred billion neurons are telling you one thing but there's like a hundred thousand concepts that that same information is being reduced and now so it's like this distinction between the brain and the mind you know like that is that neural well that's maybe not a very helpful way to look at it it's just some kind of conceptual structure out there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.569,
    "end": 2283.012,
    "text": " But they need to be linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.032,
    "end": 2291.702,
    "text": "So there's a third mind that kind of helps to punctuate or adjust ratios, parameters, whatever, to kind of emphasize, like to weave them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.483,
    "end": 2301.974,
    "text": "So on the one point of view, like with the conceptual mind, there's a certain point where like it's babbling and obviously, yeah, but this is meaningful and that is meaningful for this reason and for that reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.555,
    "end": 2307.741,
    "text": "Like, for example, this point at this circle is going to be meaningful that we're building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.227,
    "end": 2329.29,
    "text": " whereas like the the points on the circle aren't meaningful at all but in terms of mattering like it's it matters to get the circle to the maximal size that matters that's a test to perform so i like that little language because you can see the difference between the two yeah i think the third mind falls out of the other two it's a consequence of the interaction between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.063,
    "end": 2358.147,
    "text": " i really like your framing there yeah and so it's both a consequence but then maybe it's steering it you see so like we have a will it's deliberate it's cognizant so it's a it's ambiguous it's ambiguous right like which is it in the process it changes one could say it changes the synaptic weights but the uh there's nothing static everything is constantly changing and when they meet",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.088,
    "end": 2363.414,
    "text": " the interaction changes itself in the process of interacting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.794,
    "end": 2373.427,
    "text": "I always think of it in terms of a synapse changes itself in the very action of transferring neurotransmitters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.487,
    "end": 2380.236,
    "text": "The vesicles have proteins on them that merge with the synaptic membrane and now it's different than it was before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.79,
    "end": 2390.483,
    "text": " So is that a helpful way to look at neuro... Is active inference and generative model... I mean, generative models, are they a helpful way of looking at the neural systems themselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.344,
    "end": 2394.869,
    "text": "It's rich enough to apply to the neural systems themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.089,
    "end": 2396.011,
    "text": "Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.031,
    "end": 2401.158,
    "text": "Yeah, it's quite appropriate, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.258,
    "end": 2408.788,
    "text": "I think that's where it's really helpful to look at the SPM work, which is a whole toolkit ranging from like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.663,
    "end": 2437.122,
    "text": " spike and fire models of single neurons to neural mass probability models to dynamic causal modeling all within this like ultra chapter nine empiricism with the sensor fusion of the eeg fmri data um so this and then in a way the the behavioral scientists model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2437.726,
    "end": 2445.854,
    "text": " can be seen as like a symbolic second mind of the primary embodiment of the mouse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2446.434,
    "end": 2454.762,
    "text": "But let's say it was like an alien creature, or it's an unknown creature, but it has an embodiment, it has a firstness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.104,
    "end": 2466.754,
    "text": "And then this is a symbolic projection onto that firstness from a pretty small diagrammatically defined perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.342,
    "end": 2468.484,
    "text": " graphical toolkit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.428,
    "end": 2475.016,
    "text": "And then there's a, to your point about the communication, then there's a two agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.778,
    "end": 2476.299,
    "text": "It's kind of like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.319,
    "end": 2480.086,
    "text": "Then the minds is kind of like the experimental setup and the experimenter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.126,
    "end": 2484.274,
    "text": "And then there's the investigation is in the interplay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.314,
    "end": 2488.903,
    "text": "And then you talked about communication of generative models across agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.943,
    "end": 2490.666,
    "text": "That's like the synchronic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.338,
    "end": 2518.797,
    "text": " like joint that's that's like the space between two at or or more at once and then there's um replay and and pre-play which is like diachronic but that so that's like one self but but it's like is it a different self right if it's a di but you know just legally speaking it's the same person",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.131,
    "end": 2535.086,
    "text": " But then that's also kind of like a space between some extant actuality, which is like the 100 million neurons, and then some symbolic condensation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.126,
    "end": 2547.298,
    "text": "And then something happens in the space between, which in the Bayesian updating moment is given a causal power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.46,
    "end": 2577.927,
    "text": " or you could just take the the bayesian posterior and just it could be treated as epiphenomenal like you could just continue to to collide streams of priors and observations and then just slough off the posteriors what do you mean by epiphenomenal what does that mean like you'd calculate a posterior and discard it like the the posterior is never given a causal re-entry into the system okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2578.21,
    "end": 2587.062,
    "text": " Like what people arguing that consciousness is epiphenomenal, which is to say like it arises, but there's no causal arrow back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.142,
    "end": 2590.607,
    "text": "It's like a side effect, but not really relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.627,
    "end": 2591.287,
    "text": "It's a view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.488,
    "end": 2592.549,
    "text": "It's not a participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.43,
    "end": 2599.879,
    "text": "And then the question is like, you know, without, you know, Descartes and all that, but how do you have something that reenters causally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.899,
    "end": 2606.007,
    "text": "Is the third mind just like the sparks flying from interplay?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2606.257,
    "end": 2608.141,
    "text": " But then but do those sparks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.923,
    "end": 2623.455,
    "text": "You know, can they or you know, you know, if whether it's at all those things that you know, do they re answer to modify either neural activity, or symbolic activity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.482,
    "end": 2633.259,
    "text": " And so I'm writing this paper about this model and some of the things I write about, and I quote the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.699,
    "end": 2641.153,
    "text": "But, for example, there's an interesting paper about a window that says, you know, you have a stimulation of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.193,
    "end": 2643.638,
    "text": "Let's say you have preconscious...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.618,
    "end": 2672.68,
    "text": " uh time but let's say from 250 milliseconds to 700 milliseconds there's this rather long window of conscious access what they call and what the what they noted with the paper they did different situations where you could do task related or uh task free uh you know you're listening to music let's say maybe you're supposed to be hearing looking for something or maybe you're not but but they they look at the conscious access and what they notice is that the window stays open",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.862,
    "end": 2701.502,
    "text": " for longer than you would think like there's room for playing around of the signal there's room for it to settle down so with regard to the three minds then that's very compatible in the sense that your first mind these this pre-conscious stage can suggest candidate action uh sensations it can give you it can give you information like that then your conscious mind is globally trying to figure out you know how to integrate this what to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.803,
    "end": 2704.767,
    "text": " But the third mind, it's like acting as a break.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.787,
    "end": 2706.91,
    "text": "It's saying, wait, wait, you know, don't rush, don't rush.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.97,
    "end": 2708.913,
    "text": "I'll tell you when to hardwire when it's all right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.594,
    "end": 2721.331,
    "text": "So the point being that the prolongation suggests that there could be something that's prolonging this, you know, like that's, you know, fighting against early resolve, the resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.871,
    "end": 2728.521,
    "text": "But furthermore, you can have an idea go into your brain before you're conscious of it, of what you're going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.821,
    "end": 2731.405,
    "text": "It's just a candidate, you know, decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.773,
    "end": 2753.393,
    "text": " so you get this paradoxical thing that oh what you thought you were going to do you already knew quote unquote before you but actually it was just a candidate you know that got confirmed i think that's the way to read it which then is affected by experience the more that happens the more likely yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.25,
    "end": 2757.595,
    "text": " But all three zones, like the meaning changes as you go through those three zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.115,
    "end": 2762.321,
    "text": "It was a candidate, it got kind of like worked out, and then it was affirmed, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.461,
    "end": 2781.608,
    "text": "And I think that points to a threshold effect, where if there is this practiced development of openness to intention, then if consciousness can ever be considered as anything other than epiphenomenon, it is in the realm of intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.512,
    "end": 2801.908,
    "text": " creating as you say uh a bias toward a particular candidate class yeah you can have a biased right and so that's a way of self affecting yourself is to have biases and so so i quote uh chapter five uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.26,
    "end": 2823.795,
    "text": " about the basal ganglia because i say there's a lot of evidence uh i think mcgilchrist uh ian mcgilchrist wrote a book about left hemisphere versus right hemisphere so you get a lot of this you know a champion for both but i'm saying it's deeper than that if you go to chapter five about the basal ganglia uh even in arthropods uh you have this uh uh distinction between um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.518,
    "end": 2849.192,
    "text": " releasing and allowing the action as opposed to not allowing it there's this you know you have to play with both and i think that that's a sign of consciousness that uh you know you're able to do that uh and so dopamine is what triggers that and dopamine goes way back so that's just a mechanism another one i cite is uh immune systems you have two versions you have um the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.1,
    "end": 2876.26,
    "text": " the one that's like inborn innate i guess they call it then the one that is able to learn and so the question is how do they not conflict so i think there's got to be some kind of harmony between them harmonizer between those two immune systems you talk about another principle of biological function uh the the best control system is one that is both",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.134,
    "end": 2879.96,
    "text": " excitatory and inhibitory in constant tension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.222,
    "end": 2882.725,
    "text": "Right, you want both, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.547,
    "end": 2892.384,
    "text": "So I have this quote, I said this thing, the second mind, it avoids the territory, because there's things you can't learn from, you know, you'll just die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.925,
    "end": 2896.392,
    "text": "So you want to avoid the territory and embrace the matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.372,
    "end": 2913.773,
    "text": " uh and so that's why you want to for things you don't know you you know like the unlucky mind there's a mind when things are unlucky you don't want to try your luck we have a lucky mind and an unlucky mind so okay thank you and that they're awesome see you soon",
    "speaker": "SPEAKER_00"
  }
]