[
  {
    "start": 7.439,
    "end": 9.503,
    "text": " Alright, hello, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.926,
    "end": 17.299,
    "text": "It is June 27th, 2025, and this is the second quarterly roundtable of the year of 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.38,
    "end": 20.065,
    "text": "So, here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.344,
    "end": 23.187,
    "text": " Welcome to Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.008,
    "end": 29.557,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.378,
    "end": 35.626,
    "text": "This is a recorded and an archived live stream, so provide any feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.588,
    "end": 42.998,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for live streams and see if anyone joins along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.227,
    "end": 54.557,
    "text": " Here's a slide you can screenshot if you want to have some short links that will stay good forever even though their referent may change and ways to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.102,
    "end": 58.764,
    "text": " Here's what's on the agenda today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.804,
    "end": 74.846,
    "text": "First, we will go over some Institute scale updates, then talk about some project scale updates, look a little bit towards the second half of the year, then have a view from the desk of why Active Inference and why the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.667,
    "end": 81.996,
    "text": "And then I will look at the live chat to see if there are any comments or questions that can be addressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.275,
    "end": 86.861,
    "text": " So here we go, starting with some updates at the Institute scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.863,
    "end": 95.737,
    "text": "If you go to 2025.activeinference.institute, you will find a living entry point for the year as it happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.699,
    "end": 101.487,
    "text": "And ecosystem.activeinference.institute is the entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.467,
    "end": 124.521,
    "text": " so one piece that'll be fun and new today is there will be this red shaded box with specific requests or opportunities so if you're looking for ways to contribute ways to get involved these are just specific ways that you can pick up on some slide that you find interesting and take it from there so if that's interesting jump on in to the ecosystem document and learn a lot more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.501,
    "end": 142.543,
    "text": " Okay, today we have a special announcement, which is that the Institute has been awarded a $270,000 grant from the Survival and Flourishing Fund to support work on the AI Capabilities and Alignment Consensus Project, AICICP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.097,
    "end": 168.717,
    "text": " ai cicp is a multi-year initiative designed to reshape the conversation around ai capabilities alignment and regulation by combining high-impact journal collections in-person discussion oriented workshops and academic media content for public outreach the project aims to bridge the divide between ai doomers and accelerationists through deeply exploring the meaning of world models and agency and what these concepts mean for ai developments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.625,
    "end": 178.04,
    "text": " Adam Saffron at the Allen Discovery Center at Tufts University is the creator, principal investigator, and organizing editor for this project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.982,
    "end": 189.24,
    "text": "The grant supports also an expanded team to assist with efforts to manage the special issues and workshops, including these contributors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.661,
    "end": 192.426,
    "text": "Lead Assistant Editor, Victoria Clamage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.473,
    "end": 195.746,
    "text": " Media Lead and Workshop Organizer, Michael Garfield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.669,
    "end": 199.5,
    "text": "Workshop Project Supervisor, Amelia Thomley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.163,
    "end": 203.074,
    "text": "And Workshop Experience Designer, Caitlin Lynch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.358,
    "end": 206.923,
    "text": " Email Adam if you have any thoughts or questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.704,
    "end": 218.119,
    "text": "And moving from that project scale announcement to what it means for the Institute, today we are happy to announce that grant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.06,
    "end": 221.444,
    "text": "And there are many more grants to come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.345,
    "end": 228.133,
    "text": "So consider proposing or funding a grant with or for us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.113,
    "end": 251.725,
    "text": " There's going to be a lot of ways that this single grant helps us develop the administrative ability to, for example, receive and disperse grants, the oversight that we need and look to have, and the wisdom in choosing different kinds of ways to allocate our resources, financial, attentional, otherwise, and with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.093,
    "end": 267.925,
    "text": " taking a small to zero overhead on different grants and different philanthropic pathways i hope that people can see some exciting possibilities for ways that we can host all kinds of work so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.905,
    "end": 292.9,
    "text": " looking forward to the ai cacp project and what they all get done over the coming year and also ways that we can turn that n equals one today into an n equals question mark exclamation point and plus tomorrow with all that can happen when we work together this way so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.926,
    "end": 300.536,
    "text": " Thank you also to the team, to Adam Saffron and colleagues, and of course to the funders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.357,
    "end": 302.739,
    "text": "This is an exciting opportunity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.759,
    "end": 320.305,
    "text": "It brings the first taste of funded project scale work, not yet funded administrative work, but some project level work that is again really critical and appreciated for building our capacities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.968,
    "end": 347.743,
    "text": " okay moving on in the second quarter of 2025 we continue to receive excellent engagement from our scientific advisory board which is our informal research and education guidance group many of them joined meetings a lot of them also engaged in different ways at the project scale showing up in discord showing up in the documents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.314,
    "end": 376.971,
    "text": " mentoring and if you want to learn more or engage on this topic check out the cool work that they are all doing as individuals and consider applying for the sab for 2026 if this sounds like something that you might like to be engaged in providing strategic guidance informally mentorship all these different ways that sab members can be our advocates some of whom i see in the chat even now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.6,
    "end": 384.463,
    "text": " About our formal, organizational, and strategic aspects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.899,
    "end": 402.377,
    "text": " It has been great to work with Dr. Vice President and Secretary Alexandra, and we've had good times thinking a lot about how to improve the administration of what we do at the Institute scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.258,
    "end": 412.527,
    "text": "This quarter, we also engaged with DANA, which is a professionalization group for Delaware registered nonprofits, of which we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.507,
    "end": 418.474,
    "text": " And working with Earl from Dana, we had a training with a board of directors joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.075,
    "end": 424.641,
    "text": "That was a great milestone in the improvement process for our board of directors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.422,
    "end": 433.452,
    "text": "It spurred many important conversations and gave us a lot of ideas about how we can improve and professionalize the board of directors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.432,
    "end": 441.892,
    "text": " So thank you to the BOD and to Alexandra for the institute scale work that they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.932,
    "end": 448.286,
    "text": "And it isn't too early to think about being an officer or a BOD member in a future year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.507,
    "end": 452.436,
    "text": "So look into everything more if that sounds exciting to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.171,
    "end": 455.553,
    "text": " All right, research fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.475,
    "end": 458.438,
    "text": "We currently have five research fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.958,
    "end": 461.262,
    "text": "They are individuals affiliated with the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.903,
    "end": 465.629,
    "text": "We do what we can to support and accelerate their research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.771,
    "end": 477.327,
    "text": "If you want to learn a bit more about their research specifically, you can go to this link on the page and I will share updates from JF and John.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.56,
    "end": 480.724,
    "text": " later in this roundtable that they presented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.545,
    "end": 490.217,
    "text": "If you're looking for other ways to get involved with this research fellows program, first you could donate to make targeted donations to their projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.318,
    "end": 494.864,
    "text": "Those are funds that can only be spent for a donor-advised purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.884,
    "end": 497.287,
    "text": "Consider applying to be a research fellow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.848,
    "end": 505.238,
    "text": "We're also going to think about what other types of fellows make sense to add in the future, like education and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.218,
    "end": 510.03,
    "text": " And if you're just interested in this program in any other way, get in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.255,
    "end": 516.04,
    "text": " Partnerships, we did not add any new partnerships this quarter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.76,
    "end": 522.648,
    "text": "However, we advanced some discussions meaningfully with other partners that we will announce when the time is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.549,
    "end": 538.026,
    "text": "Partnerships are structured relationships between the Institute and other organizations who are looking to make meaningful, visible, custom, impactful contributions to Active Inference and the open source ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.006,
    "end": 543.571,
    "text": " It really means and helps a lot in terms of our sustainability and reach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.612,
    "end": 551.858,
    "text": "And there are a variety of ways that value is created and added on both sides of that partnership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.479,
    "end": 566.511,
    "text": "So if you're interested in being an advocate for your organization and exploring what it might mean to create some type of partnership, check out the link at the top of the page or get in touch otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.297,
    "end": 594.574,
    "text": " just about philanthropy and support overall we're in our fifth year of operations and as always but especially we're at a critical juncture in terms of how we proceed what do we really do at the institute scale what do we offer we're a 501c3 tax-exempt non-profit and providing financial and in-kind support really is making differences for what we do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.554,
    "end": 599.248,
    "text": " So the donate.activeinference.institute link will always be good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.11,
    "end": 605.205,
    "text": "And the request is provide a donation if, as, when, how, the time is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.316,
    "end": 608.219,
    "text": " Absolutely no worries otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.38,
    "end": 616.07,
    "text": "Personal and organizational commitment is that activities and materials remain available without financial barrier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.571,
    "end": 625.944,
    "text": "So what's priceless is that which doesn't have price, which is to engage and support the Institute through your engagement and many other ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.266,
    "end": 630.13,
    "text": "Okay, onto the project scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.531,
    "end": 644.786,
    "text": " We continued several Educational Institute-hosted projects, the Active Inference Ontology, the Audiovisual Production, the Textbook Group, and the Journal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.346,
    "end": 647.009,
    "text": "So just to give a few highlights from these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.791,
    "end": 659.847,
    "text": "The Textbook Group, during this past quarter, we finished up with Cohort 7, got to the halfway point in Cohort 8,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.265,
    "end": 669.619,
    "text": " And when we pick back up in probably August with the textbook group, we will resume with Chapter 8, we will pick up with Chapter 9.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.52,
    "end": 681.776,
    "text": "I'd like to give a special appreciation to Andrew Pachea, who facilitated half of the meetings for the last phase of activity with Cohort 7 and 8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.858,
    "end": 685.041,
    "text": "Andrew brings a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.021,
    "end": 702.591,
    "text": " hands-on expertise in the modeling and also an increasingly deep knowledge of the textbook and related topics and and a variety of fields so it was epic to sit back and watch that facilitation unfold and thank you again andrew",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.571,
    "end": 706.818,
    "text": " If you're interested in the textbook group, there's a few ways to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.958,
    "end": 710.844,
    "text": "First, you could participate in this coming phase of activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.185,
    "end": 728.072,
    "text": "If you've been looking at that golden ring and sort of lavender-esque cover from 2022 and wondering if there was a way to have community and have engagement around reading that book and working through it, this is a good opportunity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.12,
    "end": 750.586,
    "text": " Also, you could volunteer further to facilitate or scribe at live meetings or do a variety of asynchronous contributions like adding and updating questions, developing examples computationally, mathematical unpacking, background materials, so many different ways that we can work asynchronously to make these materials more available and useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.627,
    "end": 757.013,
    "text": "And now three years on from this textbook group's continuation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.993,
    "end": 761.061,
    "text": " It's also a possibility to propose facilitating another book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.602,
    "end": 763.986,
    "text": "That could be Knave's recent book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.327,
    "end": 768.134,
    "text": "It could be Sanjeev Namjoshi's upcoming book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.154,
    "end": 770.338,
    "text": "It could be some other book, but we have the format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.359,
    "end": 771.08,
    "text": "We have a template.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.481,
    "end": 772.703,
    "text": "We have the communication channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.783,
    "end": 777.432,
    "text": "So as with so many activities, it just takes one person to raise their hand and say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.412,
    "end": 788.788,
    "text": " this time once a week or once a month i could do this or i could see who would come to that strange attractor so if that's you and you want to facilitate a textbook group then let's uh explore that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.148,
    "end": 810.237,
    "text": " All right, in terms of audio visual production, we continue to produce open source audio visual materials and release them into the Active Inference ecosystem where they take on lives of their own, speaking to different people, training AI, all those kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.217,
    "end": 819.149,
    "text": " There were 36 streams in the past quarter, and now we are up to 624 overall, which does include the textbook groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.01,
    "end": 823.054,
    "text": "However, several hundred of other kinds of streams as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.937,
    "end": 828.141,
    "text": "Let's look at which streams happened this quarter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.523,
    "end": 831.425,
    "text": "See if anybody has any favorites.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.168,
    "end": 838.755,
    "text": "Video.ActiveInference.Institute is the table for all the videos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.553,
    "end": 853.842,
    "text": " okay guest streams we had 101 up to 113 a variety of topics just giving a single word for each one of these topics there was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.53,
    "end": 883.103,
    "text": " autonomous vehicle navigation, scientific explanation and agency, computers and consciousness, cognitive transitions, collective predictive coding, systemic deviation, foundation agents, affective states, semantic information communications, free energy, attentional narrowing, and cognitive rigidity, the triple equivalence,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.517,
    "end": 887.355,
    "text": " amongst neural networks, Bayesian graphs, and Turing machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.968,
    "end": 896.214,
    "text": " dynamic systems out of thermodynamic equilibrium, brain-like variational inference, and the Bayesian mechanics of economic choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.394,
    "end": 902.26,
    "text": "So the guest streams are sort of the grab bag with many different topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.28,
    "end": 905.563,
    "text": "Some are right down the middle with the active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.683,
    "end": 908.045,
    "text": "Others are a little bit adjacent, but very relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.726,
    "end": 912.489,
    "text": "So a lot that could be said, some of which was said during those streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.65,
    "end": 915.753,
    "text": "Other things could be said in the comment section or otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.934,
    "end": 918.355,
    "text": "Great guest streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.335,
    "end": 938.031,
    "text": " and then there were also looks like i pasted in the same screenshot twice but there was other streams too that you could find at videos link",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.508,
    "end": 958.534,
    "text": " if any of these topics like video or multimedia production transmedia production education communication awareness all these different topics it would be awesome to have some people get involved in the project there's a variety of ways that one can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.514,
    "end": 973.823,
    "text": " contribute behind or in front of a microphone or a keyboard ways that someone can help contribute to the well-developed pipeline we have for inviting guests and carrying out streams as we do or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.803,
    "end": 1000.435,
    "text": " like Shanna Dobson or Darius PW did to step up and propose a new series so different ways at different levels but it doesn't require expertise in these topics it's almost quite literally the opposite of that with so many of these projects that the person who is curious and motivated jumps in the person with expertise or not who isn't doesn't into the research section",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.541,
    "end": 1011.895,
    "text": " There were several Institute hosted research projects, RxInfer Learning and Development Group, Knowledge Engineering, Active Blockference and Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.917,
    "end": 1025.055,
    "text": "So in the RxInfer group, we continued to support open source development and documentation around the RxInfer ecosystem with this quarter,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.035,
    "end": 1033.669,
    "text": " several packages sprouting off within that ecosystem, a server API and all these other different pieces of the puzzle that they're working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.931,
    "end": 1048.714,
    "text": "At ReactiveBase, the GitHub username where the core RxInfer methods are hosted, and also at LazyDynamics, and also personal GitHub repos and other open source blogs like Kobus's blog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.2,
    "end": 1057.177,
    "text": " We are, as always, developing our CODA documents to have all kinds of information, rabbit holes, links in and out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.758,
    "end": 1061.927,
    "text": "And we continue to weekly meetings up on through the end of this month.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.105,
    "end": 1074.899,
    "text": " If you are curious about ways to implement statistical models that are Bayesian, active inference, and otherwise, check out rxinfer.jl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.42,
    "end": 1085.071,
    "text": "There's a variety of open source repos and examples, and the team and the community want to see where people hit blocks and frictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.091,
    "end": 1090.918,
    "text": "So see if you can clone the repo, or even if you don't get that far,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.898,
    "end": 1094.263,
    "text": " What stopped or prevented you along that step?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.303,
    "end": 1100.732,
    "text": "And let's work to make these packages more available and useful because software is non-trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.633,
    "end": 1108.403,
    "text": "RxInfer is a big package, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.463,
    "end": 1110.045,
    "text": "It does a lot of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.105,
    "end": 1111.748,
    "text": "It has a lot of possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.828,
    "end": 1114.391,
    "text": "And so that can make it a little bit hard to get into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.411,
    "end": 1119.859,
    "text": "And that's something that has improved over the almost two years that we've been working with the package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.088,
    "end": 1129.755,
    "text": " check out the engineering channel in Discord, where a lot of the RxInfer devs and people using the package are chatting, so you can ask questions in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.516,
    "end": 1145.829,
    "text": "And if you want to facilitate some of these open meetings around RxInfer very specifically, or a related project, like more about software or systems engineering, as with other projects, just email in to proposal time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.45,
    "end": 1150.133,
    "text": "You may be that zero to one person who offers that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.113,
    "end": 1171.058,
    "text": " ability for others to rally around that time and it just gives visibility to even the learning so you don't need to know every aspect to wait to get started just jump in wherever you're at work on it privately work on it openly all right we are in planning for the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.303,
    "end": 1174.229,
    "text": " fifth Applied Active Inference Symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.571,
    "end": 1180.39,
    "text": "So some people may remember in November, 2024, we had a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.146,
    "end": 1208.318,
    "text": " very fun symposium we had about 30 presenters and they gave a variety of inputs into different aspects of how they were applying active inference that year and we are looking right now towards a November 12th to 14th uh date for the 2025 symposium so still about four or five months away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.445,
    "end": 1224.208,
    "text": " At this point, we are seeking presenters who would like to present their work or lead an interactive workshop, as well as sponsoring organizations who would like to support this work or get involved at the symposium in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.889,
    "end": 1230.037,
    "text": "So check out the symposium short link, and I hope that you will find something useful here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.818,
    "end": 1237.528,
    "text": "It's been cool year after year to see as the field and the ecosystem grow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.745,
    "end": 1267.448,
    "text": " what does it mean to apply active inference continues to develop and take on some new uh features let's say and the focus for this uh symposium we're still writing a lot of the the positioning and it will partially depend on which presenters and sponsoring organizations get involved but we're going to focus a lot on industry and different ways that active inference is being applied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.997,
    "end": 1272.5,
    "text": " All right, into the ecosystem projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.582,
    "end": 1281.81,
    "text": "So there are two forms that we point to again and again and again and again, which are the prepare and the measure forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.63,
    "end": 1292.52,
    "text": "And if you wanna learn more about the first principles grounding of prepare and measure, check out Chris Fields' 2023 course on the physics as information processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.161,
    "end": 1297.485,
    "text": "But big picture, these are like two inboxes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.465,
    "end": 1319.44,
    "text": " stable links that will always be good where you can say what you're preparing to do it's like preparing to go out into the fields where are you heading out and that could be a project that you just want to let us know that you're going to head out upon or maybe you could ask for some kind of visibility or support like having the project listed at the projects page",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.639,
    "end": 1329.818,
    "text": " having some other requests like is this something you're going to go out on either way or is this something that if you had funding you would do or if you had a collaborator you would do so whether it's a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.557,
    "end": 1356.109,
    "text": " all systems go or a conditional proposal that's what the prepare form is for and then there's measure which is like you're back now what so what did you measure did you see a bird did you write software did you publish a paper did you do a podcast is there a blog did you learn something these are all different kinds of measurements that you can make and that's that two-stroke engine of preparing to make a measurement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.089,
    "end": 1371.533,
    "text": " setting up your quantum reference frame, and then making that measurement, the sense-making on the inbound, and then those measurements form what we put into the quarterly roundtables and also the monthly newsletters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.513,
    "end": 1388.526,
    "text": " so we exhort people towards the end of the month but of course the measure link is open 24 7 and we really look to continue to develop these streamlined gradients of reporting and information flows in the ecosystem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.232,
    "end": 1399.301,
    "text": " to ground those flows in active inference and the free energy principle cognitive systems concepts and think about how do we design and make that modular and effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.943,
    "end": 1402.33,
    "text": "So let's jump into some of these updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.807,
    "end": 1421.713,
    "text": " Okay, so the Theoretical Neurobiology Group, TNB group, is a long-standing research meeting group that Professor Carl Friston hosted at UCL, and the TNB has now been hosted at the Institute for several months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.534,
    "end": 1431.287,
    "text": "We work with the chairs of the TNB to support their work and make the participation more available and the proceedings more accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.638,
    "end": 1442.543,
    "text": " if you're interested in the tnb first off this short link is awesome and gives information on how you can get involved in the live meetings but also whether you join those live meetings or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.08,
    "end": 1472.226,
    "text": " there will be some efforts in the coming quarter to add and check metadata on public recordings in order to integrate the tnb videos that are publicly available with the broader videos database so that we can do the transcription and the indexing and the retrieval augmented generation and all the different kinds of conversations all these different things that we do for the journal and bring the tnb into that fold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.206,
    "end": 1492.695,
    "text": " so this is an example of like if you're just learning or you're an intern or you're just wanting to see a little bit broadly what is happening then this is a way to integrate your epistemic drive with a huge contribution which would be to go through these videos",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.047,
    "end": 1495.65,
    "text": " Watch the ones you like, but just check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.75,
    "end": 1501.537,
    "text": "Do we have the date, the person, the title, all these kinds of things curate that metadata.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.197,
    "end": 1505.521,
    "text": "These are things where it seems like someone else is going to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.102,
    "end": 1509.005,
    "text": "And yet it just takes one person to step up and do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.566,
    "end": 1510.507,
    "text": "We know that it can be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.148,
    "end": 1518.937,
    "text": "It's a way where if someone wants a task to do that has permanent impact, great way to enter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.957,
    "end": 1519.257,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.502,
    "end": 1530.512,
    "text": " here and the images that are on the side were generated through perplexity based upon the text of the person's update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.049,
    "end": 1538.777,
    "text": " So research fellow JF Cloutier reports in the symbolic cognitive robotics project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.538,
    "end": 1545.925,
    "text": "He updated his published paper on the implementation of the app reception engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.945,
    "end": 1557.377,
    "text": "He split his sprawling agency repo into separate prologue repos for implementation of the app reception engine, the actor framework and the utilities and the agency itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.365,
    "end": 1567.844,
    "text": " Currently, he is coding the ground level of society of mind, which is the collective intelligence system, with sensor and effector cognition actors, CA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.826,
    "end": 1572.835,
    "text": "Coding brings clarity, which is a very JF statement to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.118,
    "end": 1581.988,
    "text": " He writes, I think I have a good handle on the life cycles of sensor and effector cognitive actors and how they interact within the CA's one layer up in the agent's society of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.729,
    "end": 1586.092,
    "text": "I'm also iterating on the actor framework whenever I find it to be lacking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.793,
    "end": 1589.977,
    "text": "A detailed function design of artificial agency was completed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.457,
    "end": 1596.704,
    "text": "Implementation is underway and the project is advised by SAB members, Elliot Hauser and Aval Gwinnon-Cullin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.207,
    "end": 1599.447,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.283,
    "end": 1625.62,
    "text": " from the active inference account of belief updating in ptsd project andrew peshea jeremy cooper helen sun and angelos cryptos report we repaired we prepared based upon our current draft work and preliminary model results extended abstract and then anonymously submitted it to the sixth international workshop on active inference iy 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.709,
    "end": 1645.903,
    "text": " Ian Tennant, who's been on several live streams and is on the SAB, reports, Following the fourth Applied Active Inference Symposium, I discovered that one of the presenters, Leonardo Muller, works here at ARU at the Cambridge Institute for Music Therapy Research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.883,
    "end": 1658.451,
    "text": " We discussed our shared interest in active inference and collaborated to record interviews for each other's YouTube channels, Intersense for Ian's and Music Minded for Leonardo's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.471,
    "end": 1660.495,
    "text": "They are now discussing a paper on archetypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.916,
    "end": 1665.546,
    "text": "We have met two milestones so far recording the interviews and have unmet milestones for writing a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.525,
    "end": 1672.289,
    "text": " Okay, some updates from interns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.21,
    "end": 1677.275,
    "text": "Satyaki Mitra and Harshal Shah report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.295,
    "end": 1687.107,
    "text": "Over the course of the project, we have slowly crafted and improved an implementation of an active inference model deployed in a Microsoft AirSim drone with a goal of eventual real-world implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.848,
    "end": 1696.259,
    "text": "With a newly implemented sensor fusion and final improvements to the model, we have the tools necessary to begin moving to a real drone and will begin this new phase of the project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.86,
    "end": 1698.722,
    "text": "Here's a brief summary of the project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.107,
    "end": 1707.538,
    "text": " We developed a hierarchical active inference framework in AirSim that uses LIDAR and or depth camera data to infer latent suitability maps for navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.68,
    "end": 1723.28,
    "text": "The drone minimizes expected free energy to select feasible adaptive trajectories in complex environments, achieving high simulation success rates in GNSS-denied scenarios, GPS-denied scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.3,
    "end": 1728.827,
    "text": "Michelle Venucci, intern, reports, with Peter Blum as thesis supervisor,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.326,
    "end": 1746.779,
    "text": " After an initial thesis proposal, which focused on studying active inference in an agent whose internal states and dynamics are defined by a cellular automaton, we pivoted the research to a more theoretical discussion on intrinsic motivation as surprise minimization or knowledge shaking within the AI-XI model setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.641,
    "end": 1751.288,
    "text": "Updated versions of the thesis draft can be found at this website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.048,
    "end": 1756.309,
    "text": " This is a report that I made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.07,
    "end": 1762.776,
    "text": "There have been major updates to the Open Source Generalized Notation Notation repository.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.697,
    "end": 1784.059,
    "text": "Some of these updates were covered in Active Inference Stream 14.2, GNN for Generative Model Supply Chains, A Golden Spike Moment for Multi-Agent Trajectory Planning with rxinfer.jl, and Inference Stream 14.3, The Sound of Uncertainty, Auditory Rendering of Generative Models in the Field of Streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.009,
    "end": 1794.681,
    "text": " Research Fellow John Boyk reports from the Cognar Ecosystem Facilitating Group Cognition at Scale project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.603,
    "end": 1808.924,
    "text": "There have been group meetings and development with John, Tim L., Jesse, Jeff S., Lee E., and Michael L. Updates include reading project materials, participating in group discussions, co-drafting, follow-on plans, and analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.665,
    "end": 1814.232,
    "text": "Dissemination of project materials, group discussion, development, and implementation planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.022,
    "end": 1834.431,
    "text": " drafting and sharing of project technology development and implementation plans in PDF form to inform and invite others regarding contribution and opportunities for Cognar project impact application, refined scope and operational definition of stick figure implementation prototype.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.52,
    "end": 1842.224,
    "text": " Alright, next project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.166,
    "end": 1844.348,
    "text": "Measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.368,
    "end": 1857.617,
    "text": "In the project, The Einstein Model of a Solid as a Model of the Mental Apparatus from the Economic Perspective of Psychoanalytic Theory, Theodorus Aliferis, along with Dr. Tisano Kalabazi,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.597,
    "end": 1868.296,
    "text": " a clinical professor of psychiatry at Columbia University, and Professor Konstantinos Agnostopoulos, NTUA, report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.078,
    "end": 1875.349,
    "text": "They are engaged in continuous collaboration and exchange of ideas for manuscripts to be published to reputable journals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.493,
    "end": 1880.398,
    "text": "Intern Allegra Grunberg reports,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.982,
    "end": 1897.468,
    "text": " This research presents a novel theoretical framework for transforming the employment ecosystem through the integration of the free energy principle, collective intelligence methodologies, and the adaptive socioeconomic system framework, operationalized via the SenseMaker tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.149,
    "end": 1907.905,
    "text": "The study addresses critical misalignments between education provision, labor market demands, graduate preparedness, and recruitment processes within the UK employment ecosystem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.885,
    "end": 1926.383,
    "text": " utilizing ucl ste app as a paradigmatic case study the proposed framework employs fep-based modeling to minimize stakeholder uncertainty optimize goal alignment and enhance job matching and skill development processes through systematic collection and analysis of micro narratives from 100 participants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.633,
    "end": 1934.826,
    "text": " Comprising students, alumni, faculty, and employers, the research establishes a continuous feedback mechanism that identifies emergent properties within the employment system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.908,
    "end": 1943.06,
    "text": "This approach enables both reactive adaptation to current economic conditions and proactive anticipation of future labor market demand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.525,
    "end": 1946.886,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.49,
    "end": 1951.273,
    "text": "I'm going to pause there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.958,
    "end": 1976.856,
    "text": " to read the existing comments just to get here so i'll put a horizontal line in the live chat i'll read all the comments above there and then we'll carry on with the next section mouth for wisdom says great and congratulations thank you andreas haptivist bravo thank you haptivist aka michael glia maximalist 46 47 thank you for the emoji",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.747,
    "end": 1980.878,
    "text": " Akshat writes, how to find the NAVE 2025 book?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.898,
    "end": 1981.58,
    "text": "Thank you, Andreas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.641,
    "end": 1983.266,
    "text": "The book is called A Drive to Survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.487,
    "end": 1984.872,
    "text": "It's at MIT Press.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.742,
    "end": 1990.786,
    "text": " Akshat writes, do we still have early access to Sanjeev Namjosi's upcoming book?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.326,
    "end": 1996.071,
    "text": "As far as I know, the book is in its final editing stages, the first of the two books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.511,
    "end": 2002.197,
    "text": "So I don't think that there's further access provided to the earlier draft.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.817,
    "end": 2014.909,
    "text": "But as soon as we can start arranging the textbook group and the availability of the book in its published form, you can expect that we will eagerly work with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.475,
    "end": 2019.578,
    "text": " Upcycle Club provides a super chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.219,
    "end": 2021.16,
    "text": "Congratulations to all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.52,
    "end": 2024.544,
    "text": "Thank you, Upcycle Club, for all the support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.085,
    "end": 2028.328,
    "text": "And Sachiaki says, thanks for the spotlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.388,
    "end": 2029.329,
    "text": "Thank you, Sachiaki.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.11,
    "end": 2030.37,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.952,
    "end": 2036.337,
    "text": "A few speculative directions now for the second half of 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.778,
    "end": 2040.341,
    "text": "So what was before is now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.402,
    "end": 2043.124,
    "text": "So how to what if?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.589,
    "end": 2049.84,
    "text": " These are directions that are known unknowns, we could say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.98,
    "end": 2053.608,
    "text": "Of course, the unknowns unknowns always take us by surprise and delight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.47,
    "end": 2060.202,
    "text": "But these are directions that are conditional upon people's interests, their resourcing needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.182,
    "end": 2076.064,
    "text": " emergence that is yet to happen different volunteer contributions and resourcing funding or grants that might come in everyone's intentional regime developments in the ecosystem all these kinds of things that can happen and change so as these are presented and there's just a few of them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.715,
    "end": 2080.9,
    "text": " What would be of epistemic and pragmatic value for you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.661,
    "end": 2083.884,
    "text": "What else should we consider and co-explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.225,
    "end": 2090.995,
    "text": "And that could be something like that you want to put into the suggestion box, so to speak, or maybe you are that co-explorer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.54,
    "end": 2107.519,
    "text": "So first in the DeSci, decentralized science and publishing area, we have a page that currently is just a stub on the DeSci nodes platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.292,
    "end": 2124.023,
    "text": " If you would like to help as a editor or platform use designer here, kind of blaze a trail into the DeSci publishing, there could be amazing opportunities to use this platform and or other DeSci and nanoPublishing affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.087,
    "end": 2139.706,
    "text": " to support durable, accessible, modern publishing, credentialing, cryptographic attestation, DeSci integrations, peer review, valuing peer review, all these kinds of topics that we've been talking about in DeSci for years and ways to make it applicable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.726,
    "end": 2144.712,
    "text": "This is one way that people can look into those topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.548,
    "end": 2147.851,
    "text": " and in knowledge engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.693,
    "end": 2155.89,
    "text": "So from 2022 with Blue and RJ, we did a systematic meta analysis of the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.91,
    "end": 2158.937,
    "text": "There's an interactive front end, there's open source code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.018,
    "end": 2167.21,
    "text": " And we look to develop that knowledge engineering resource with some volunteer effort and with some partnerships and further resourcing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.711,
    "end": 2169.634,
    "text": "There's a lot of ways that we could develop this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.215,
    "end": 2173.98,
    "text": "We could curate resources better across different documents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.401,
    "end": 2178.186,
    "text": "People have sort of semi-independently prepared different reading lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.206,
    "end": 2179.328,
    "text": "We have Zotero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.348,
    "end": 2183.454,
    "text": "We have all these different sources of bibliographic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.175,
    "end": 2186.038,
    "text": "And this could be integrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.018,
    "end": 2199.617,
    "text": " Sanjeev, as part of the process of writing his textbook, has also made a open source repo AIFFEPDB, which scrapes literature databases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.717,
    "end": 2200.899,
    "text": "I've played with this a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.82,
    "end": 2214.658,
    "text": "We could develop on what Sanjeev has put out there as his milestone and work to better pull from databases for keywords, filters, all those kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.638,
    "end": 2236.107,
    "text": " basically advance the state of the bibliographic services that we provide to the ecosystem so that finding good applicable research finding papers with code being able to use the ontology to search and filter all these kinds of things that we could offer would be great and provide services to research and to partners and all around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.42,
    "end": 2240.088,
    "text": " Okay, those are the only two speculative directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.031,
    "end": 2246.949,
    "text": "The next section will be the view from the president's desk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.451,
    "end": 2251.463,
    "text": "So I guess I'm like here, kind of looking out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.978,
    "end": 2270.278,
    "text": " looking out as the world the physics of the world sort of melt and perspectives fuse these are just some loose thoughts from the drawers and there's a lot more where this comes from so wherever people find this relevant these are just like a few little snippets from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.596,
    "end": 2298.915,
    "text": " what happens in the officer and board of directors room could be interesting i just thought why not give a little exposure to some of these things that i'm writing anyway and await people's live chats but give a few kind of just personal not even necessarily organizational or fully formed thoughts but go through a few of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.072,
    "end": 2308.524,
    "text": " And to call back to the agenda, the motivator was, why active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.945,
    "end": 2314.734,
    "text": "I mean, why not just say, we're doing statistics on computers, or why have an institute?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.275,
    "end": 2320.744,
    "text": "Why is it not enough just to say, well, people should really look at this method?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.667,
    "end": 2322.827,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.288,
    "end": 2337.265,
    "text": " Open science means that the Active Inference Institute disseminates products and provides services intentionally, respectfully, and professionally with a focus on the accessibility, rigor, and applicability of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.527,
    "end": 2343.233,
    "text": "We seek to raise up and activate the available, the rigorous, and the applicable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.675,
    "end": 2347.92,
    "text": "Please enjoy nested scales of agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.01,
    "end": 2359.176,
    "text": " the ecosystem, the subset of the ecosystem that we curate, and of course, all that's out there far, far beyond what even we know we don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.287,
    "end": 2384.303,
    "text": " population our peer and partner organizations the colony scale the organizational scale that's our organizational active and static elements the task group the projects the products the services that are offered and the people the the humans out there the nest mates the ai agents all of that so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.211,
    "end": 2391.521,
    "text": " In this nested systems conceptualization, we're just one thread through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.427,
    "end": 2403.94,
    "text": "To join in, to be part of the underground slash inside, to be part of the production, act, infer, serve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.262,
    "end": 2405.923,
    "text": "What does that really mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.003,
    "end": 2410.29,
    "text": "Well, I can give one take here, but it's up to each in their own way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.485,
    "end": 2412.146,
    "text": " First, act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.067,
    "end": 2414.689,
    "text": "Start and lead with action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.95,
    "end": 2415.19,
    "text": "Do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.011,
    "end": 2417.033,
    "text": "Interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.633,
    "end": 2418.575,
    "text": "It could be privately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.576,
    "end": 2420.878,
    "text": "It could be in an online space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.619,
    "end": 2423.421,
    "text": "It could be with an informational artifact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.521,
    "end": 2425.304,
    "text": "It could be with an active element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.245,
    "end": 2427.627,
    "text": "Start wherever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.129,
    "end": 2429.49,
    "text": "Infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.331,
    "end": 2431.492,
    "text": "Update and go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.773,
    "end": 2434.236,
    "text": "Change your mind and or change the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.216,
    "end": 2435.798,
    "text": " how you know it and how you don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.899,
    "end": 2450.276,
    "text": "And with that two-stroke engine, serve on slash in slash with your own alignment trajectory across internal, blanket, and external states in that interplay of act and infer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.177,
    "end": 2452.919,
    "text": "Quote, this is not a third step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.259,
    "end": 2455.342,
    "text": "And that's sort of the Magritte crossover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.402,
    "end": 2462.13,
    "text": "So why active inference and why the institute?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.832,
    "end": 2491.29,
    "text": " attending the case everything slash distribution has a precision estimation whether it is modeled or not the buck stops somewhere the precision stops somewhere in the trivial simple or tautological case which is ultimately essentially omnipresent which is to say things ultimately trivially no matter how partially known are how they are it is a derock delta a point mass distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.047,
    "end": 2496.151,
    "text": " Distributions could change with respect to time, dynamic or updating, or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.372,
    "end": 2498.454,
    "text": "It could be static or fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.895,
    "end": 2506.462,
    "text": "So even things that change how they change, how they change, how they change, with respect to that, are fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.724,
    "end": 2515.692,
    "text": "The implication, it ultimately is as it is, which includes how it changes and how it is known and interacted with by any agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.975,
    "end": 2528.413,
    "text": " So in specific cases, and of course this is the cerebrum pun, cases can be both specific situations, like case management, or it could be categorical linguistic semantics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.136,
    "end": 2539.73,
    "text": "In specific cases, there can be any kind of distribution, like awareness of, awareness of, awareness of itself, and other compositional scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.531,
    "end": 2545.138,
    "text": "More information on that is to be found in the cerebrum paper and repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.57,
    "end": 2562.472,
    "text": " Even outside of considering this nested case as metacognitive, or even further for those who dabble into the phenomenological, instrumentally, cough cough, we can think of this A arrow B relational kernel in terms of Bayesian hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.993,
    "end": 2563.914,
    "text": "Priors over priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.275,
    "end": 2566.959,
    "text": "There's always an arrow pointing to something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.979,
    "end": 2570.704,
    "text": "Or, in a more generic causal Bayesian graph setting, blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.578,
    "end": 2575.43,
    "text": " So what does this case sensitivity bring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.571,
    "end": 2578.921,
    "text": "What does organizing around it have to do with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.807,
    "end": 2582.432,
    "text": "With this modeling commitment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.053,
    "end": 2589.721,
    "text": " Two, the particular partition of the free energy principle and the predilection for precision in generative modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.262,
    "end": 2601.316,
    "text": "There's a tremendous expressiveness and openness to describe cognitive ecosystems, sometimes summarized as the framework says less so that we can say more, do more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.297,
    "end": 2609.466,
    "text": "The specific generative model, the particular case as it were, is an instance of a more general category of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.239,
    "end": 2615.132,
    "text": " which is to say that all that is the case is a subset of all that could have been the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.676,
    "end": 2619.603,
    "text": "All that could have been the case includes what actually was the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.689,
    "end": 2627.083,
    "text": "Active inference modeling, at least in our case sensitive synthetic intelligence posture,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.198,
    "end": 2638.954,
    "text": " gives analytical coherence across cognitive phenomena, also known as the whole iguana or the neat side of the equation, specifically in terms of unified notation for arbitrary systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.655,
    "end": 2653.915,
    "text": "So talking about unification of cognitive phenomena within the human system or the ant system, attention, memory, anticipation, all these different kinds of properties of systems can be unified in aspiration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.435,
    "end": 2656.942,
    "text": " and in notation and execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.527,
    "end": 2669.558,
    "text": "Importantly, these case-sensitive notational representations and methods, which take account of both generalities as well as the Blakeian minute particulars, they are not uncacheable checks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.668,
    "end": 2684.989,
    "text": " With this two eyes open structured representation, both as parameterized, that's in particular, and parameterizable, that's the all moves perspective, allows an operational semantics of generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.509,
    "end": 2689.335,
    "text": "These are models that do stuff, models that we do stuff with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.239,
    "end": 2698.826,
    "text": " Examples of the kinds of stuff that can be done with generative models are incipiently described by the modules associated with the generalized notation notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.847,
    "end": 2721.128,
    "text": "Execution as a simulation, use as a descriptive statistical model, transformation into category theory representation, type checking, resource estimation, use it as input for generative AI, service provisioning, use in ontological analysis, rendering in different computational settings, visualization of model structure outputs,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.795,
    "end": 2745.495,
    "text": " audio representation and more and more so now thinking and to say we support the open education and research on these topics now a little bit about roads and notation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.859,
    "end": 2755.196,
    "text": " This is the figure 1.2 from the 2022 textbook, which summarizes the low road and the high road to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.96,
    "end": 2765.577,
    "text": "We want to have notation systems and deployment methods for generative models with expressive methods for and nested addressable spaces of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.687,
    "end": 2772.914,
    "text": " So these are going to be spaces starting from the largest space on through smaller spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.895,
    "end": 2782.665,
    "text": "Describe, design, render, simulate, analyze, fit, assess performance of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.387,
    "end": 2791.935,
    "text": "That's to say there's a larger set of models that we can describe than we can render.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.928,
    "end": 2796.612,
    "text": " There's a larger set that we can render than the ones that we can actually simulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.693,
    "end": 2800.336,
    "text": "There's a larger set, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.356,
    "end": 2806.422,
    "text": "That's to say, we can describe recipes we cannot cook, and that's a good thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.442,
    "end": 2814.23,
    "text": "So it's great that we have the high road, that we can describe systems that we can't necessarily take along every step of this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.071,
    "end": 2819.796,
    "text": "And some of the things on the low road, they're already out there in the world, like biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.333,
    "end": 2822.796,
    "text": " other things out there are remaining to be built.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.598,
    "end": 2829.926,
    "text": "But with this top-down view, we have the ability to describe in a unified framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.768,
    "end": 2834.633,
    "text": "So performance is about specific generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.714,
    "end": 2839.44,
    "text": "Performance is like whether it's a category models or it's always situational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.84,
    "end": 2845.348,
    "text": "What is the performance of this model with this dataset in this situation on that assessment, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.368,
    "end": 2848.332,
    "text": "And performance on one benchmark",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.396,
    "end": 2869.189,
    "text": " like the high jump let's say or a suite of measures like the decathlon like are you interested in the precision and the recall and you're also looking at resource use it's relational measurement or assessment or characterization that is just a view upon the primary phenotype of that model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.16,
    "end": 2876.95,
    "text": " Thinking about projects that are in and around the ecosystem, they have these fitness and performance wants and needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.371,
    "end": 2879.414,
    "text": "Like thinking about some of the projects mentioned earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.695,
    "end": 2891.295,
    "text": "It's like a self-driving car that is safe in this condition, or a drone that is effective under these circumstances, or a model of PTSD that is useful for this person in this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.22,
    "end": 2904.15,
    "text": " And all of that, all of those useful little nuggets of parameterized models, as parameterized, as structured, as built, that's all happening within this larger space of the models that could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.832,
    "end": 2908.12,
    "text": "Like, all it is is a subset of what could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.387,
    "end": 2924.564,
    "text": " And those generative models of what could be include the baroque, the absurd, the tiny, the useful, the cute, funny, interesting, healthy, tasty, generous, small, large, educational, perplexing, all the above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.584,
    "end": 2928.929,
    "text": "So, we have free energy principle coming from the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.67,
    "end": 2932.993,
    "text": "That's the particular partition, path of least action, all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.8,
    "end": 2938.566,
    "text": " And we have an increasing portfolio of engineering methods on the low road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.287,
    "end": 2942.631,
    "text": "And we meet in the middle with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.452,
    "end": 2947.597,
    "text": "So now getting to the institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.617,
    "end": 2954.466,
    "text": "Consider that we have pairwise information or distance measures in terms of software 1.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.906,
    "end": 2959.652,
    "text": "So we could take a syntactic way to look at differences between strings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.433,
    "end": 2962.035,
    "text": "We have software 2.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.302,
    "end": 2976.329,
    "text": " We could look at the compressive or the semantic distances, like the model information geometry, looking at the statistical differences within some trained information geometry space of two inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.49,
    "end": 2980.277,
    "text": "That's kind of like vector embeddings, cosine similarities, and all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.938,
    "end": 2984.445,
    "text": "But what isn't out there yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.813,
    "end": 3014.601,
    "text": " that's software 3.0 the numbers don't really matter but it's cognitive computing distances so does that cup of coffee taste the same to those two people or do these two things appear differently in light of this to that for a true perspectival cognitive information theory these are the differences that make differences for sophisticated cognitive agents we need to cover diverse and unknown",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.133,
    "end": 3043.39,
    "text": " cognitive phenomena we're talking about systems that we don't even know what they are as well as the ones that we know well what they are we need to address disparate systems from a first principles perspective which is the high road and that by specification includes systems that we designed as well as built that's the low road so it's like there's the recipes that we can cook and we should be able to describe those but then also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.673,
    "end": 3047.982,
    "text": " We want that description method to be able to describe recipes we can't cook, but we can dream up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.167,
    "end": 3057.082,
    "text": "The Active Inference Institute supports reliable and effective applications of cognitive computing and active inference across domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.766,
    "end": 3062.053,
    "text": "By providing key services such as open source software,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.337,
    "end": 3076.644,
    "text": " whether inference libraries, the ontology, the generalized notation, notation, cerebrum, et cetera, the repos that we host, as well as the ones that we just curate and give pathways to, like RxInfer, as well as education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.267,
    "end": 3080.271,
    "text": "Mega exclamation point for that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.577,
    "end": 3084.278,
    "text": "Text trees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.27,
    "end": 3093.784,
    "text": " professional training, symposia, internships, in-person educational programs, increasingly all these different things and more to come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.848,
    "end": 3102.819,
    "text": "The metal rails of the physical supply chain have their own supply chain leading into education and the mind of the engineer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.622,
    "end": 3111.193,
    "text": "Just like dirt and asphalt roads, low roads are built basically only where and as needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.983,
    "end": 3122.579,
    "text": " lest there be a bridge to nowhere, which is wasteful at best, or lest something natural and beautiful and wild be covered up with a parking lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.599,
    "end": 3126.745,
    "text": "So even when we're talking about physical roads, they're not built everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.346,
    "end": 3128.227,
    "text": "They're built as useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.088,
    "end": 3139.223,
    "text": "So when we're talking about statistical probabilistic models, we're talking about building what's useful within a larger space of what could be described.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.278,
    "end": 3148.005,
    "text": " Already there are many applications of variational cybernetics, which is to say, active inference by another name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.506,
    "end": 3167.886,
    "text": "So whether you call it evidence lower bound like ELBO, or whether you call it a free energy functional or energy-based model, if we're talking about systems that include the sensory, cognitive, and output action-oriented components, and we're fitting a variational bound, it's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.907,
    "end": 3169.328,
    "text": "And that's even considered narrowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.759,
    "end": 3172.301,
    "text": " We have the curated implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.403,
    "end": 3181.754,
    "text": "We have various agent models, variational autoencoders, and far, far beyond, especially if you take up that triple equivalence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.116,
    "end": 3199.078,
    "text": "If you take this triple equivalence between neural networks, Bayes graphs, and Turing machines seriously, as Takuya Isamura presents in the guest stream 110.1, then the scope of the high road is amazing in total.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.37,
    "end": 3219.673,
    "text": " Consider this cognitive research, education, tech, and infrastructure situation to be analogous to the metallurgy and the alchemy of high precision calipers, which can be used to describe or measure machine parts during the material industrial revolutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.934,
    "end": 3229.605,
    "text": "Hence, our organizational focus on accessibility, rigor, applicability, on education, sovereignty, supply chains, and security.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.733,
    "end": 3256.605,
    "text": " this light and way the active inference method tradition and the Institute is at the articulation gap or blanket of syntax semantics and the specific and the general think the center that holds the eye of the storm the strange attractor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.632,
    "end": 3265.186,
    "text": " The information supply chain is the spine or the railroad built on the rails of GNN and other notation systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.148,
    "end": 3279.954,
    "text": "And the institute, the pie, is the golden spike meeting at the middle of the high road and the low road, or coast-to-coast am, which is just like the ephemeralized version of the golden spike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.974,
    "end": 3280.315,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.746,
    "end": 3307.315,
    "text": " showing here alexandra's beautiful ceramics we give her the last word on this section everything was half baked at some point all right all right i'm going to now look at the live chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.835,
    "end": 3332.138,
    "text": " so i'm gonna go to the horizontal line i will read these so if you have any uh comments or questions write them in the chat and i'll get to them all right alexander hemming writes is there an option towards more philosophical integration into the research fellowship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.641,
    "end": 3358.986,
    "text": " yes yes it could be more philosophical or it could be more technical you could look at the uh application page for some more information but sort of to use the legacy system it's kind of like postdoc level research that might be done by high schooler or somebody who's far far outside of academia so it's not to say that you need a phd at all there's no required degree but it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.966,
    "end": 3387.96,
    "text": " you're proposing a program that includes the possibility of open source dissemination inclusion all these different kinds of aspects that would make it relevant for being hosted here and it integrates with your research inquiry at that kind of a big level and opens up these channels and provides email address affiliation etc and if it were philosophical in nature wonderful andreas thank you for the comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.21,
    "end": 3400.579,
    "text": " Andreas writes, I'm seeking help to find users who would be interested in also modelers and developers in regards to the grant that's being discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.102,
    "end": 3405.564,
    "text": "And also consider and how to develop this ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.445,
    "end": 3413.452,
    "text": "And also consider what other software like rxinferred.jl and pyMDP and active inference.jl what would be good for our ecosystem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3414.874,
    "end": 3418.318,
    "text": "Great, you know, ask not what the ecosystem can do for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.639,
    "end": 3420.58,
    "text": "Haptivist writes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.91,
    "end": 3425.695,
    "text": " What is the basis of the collective units, group, colony, et cetera?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.52,
    "end": 3432.304,
    "text": "Is there formal quantitatively described definitions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.689,
    "end": 3436.009,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.09,
    "end": 3438.012,
    "text": "Descriptions, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.195,
    "end": 3443.319,
    "text": "So this is kind of like what the tech tree looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.679,
    "end": 3448.626,
    "text": "It's like for a given scale of analysis, let's say we're talking about online teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.293,
    "end": 3459.728,
    "text": " First, you know, awareness, pre-descriptive awareness, then metacognitive awareness, descriptive awareness, on through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.589,
    "end": 3469.483,
    "text": "So do we have executable simulations of multi-agent online open science participatory ecosystems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.463,
    "end": 3493.176,
    "text": " i don't maybe someone does but here's the tech tree here's the path towards moving from dreaming up what that party looks like what's being served at the party on through the operational constraint definitions of that recipe on through dispatching that catering request to your own kitchen or to another kitchen and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.898,
    "end": 3501.345,
    "text": " It's easy at the beginning to say, well, I want there to be 500 people and I want them to think that the soup is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.365,
    "end": 3505.68,
    "text": "The soup being awesome is the assessment at the end of that model, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.947,
    "end": 3534.908,
    "text": " Yes, we have some formal descriptions of nested systems, and part of the work is to move those descriptions and keep them all integrated on through just the description, like AOS for agentic ontologies or just the variational synthesis paper for using the renormalization group, on through being able to cache that check, cook that recipe, and use it in play and assess its performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.385,
    "end": 3563.73,
    "text": " pi 5549 writes do you guys do regular discord open chats yes we have had uh weekly open hours so if uh the projects seem a little bit too specific or you're not sure if some topic or or mode of engagement is right for a project as listed there is an open hour",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.098,
    "end": 3568.888,
    "text": " We're about to go on this sort of break for July, as we also will in December.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.15,
    "end": 3577.164,
    "text": "And when we come back, there's no time set yet for the open hour, but if someone just, one person raises their hand and says, I will be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.384,
    "end": 3579.188,
    "text": "Tuesdays at this time, UTC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.826,
    "end": 3585.354,
    "text": " And then if no one joins, no one finds out, and you get to hang out and study or do whatever, or maybe a bunch of people join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.514,
    "end": 3590.982,
    "text": "So whoever wants to facilitate that kind of an open session, just say so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.302,
    "end": 3594.547,
    "text": "It could be whatever frequency, whatever hour UTC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.207,
    "end": 3595.969,
    "text": "It's not awkward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.67,
    "end": 3597.751,
    "text": "People are all over the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.931,
    "end": 3600.555,
    "text": "People have different sleep-wake schedules, different availabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.675,
    "end": 3608.466,
    "text": "So just put out when you want it to be and say, I would go if it were at this time, or I will be the one to make it happen at this time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.382,
    "end": 3616.643,
    "text": " Active Bloomology, hi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.466,
    "end": 3623.77,
    "text": "Paradoxical AP3 says, I know how to build AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.351,
    "end": 3624.811,
    "text": "No cap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.133,
    "end": 3627.894,
    "text": "Sweating emoji.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.515,
    "end": 3628.815,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.436,
    "end": 3630.917,
    "text": "If you can put it in the live chat, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.017,
    "end": 3633.4,
    "text": "Otherwise, thanks for sharing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.404,
    "end": 3638.685,
    "text": "Alright.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.485,
    "end": 3641.007,
    "text": "I'll wait just another minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.107,
    "end": 3642.148,
    "text": "If anyone has any...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.989,
    "end": 3648.293,
    "text": " comments briefly just for screenshotting and our vision model colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.434,
    "end": 3650.282,
    "text": "I'll just look back through all the slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.263,
    "end": 3681.558,
    "text": " So, if you've gotten this far, any of these links will take you where you need to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.84,
    "end": 3687.688,
    "text": "Blanket at ActiveInference.Institute is the inbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.47,
    "end": 3690.654,
    "text": "You can send anything, any questions there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.056,
    "end": 3695.963,
    "text": "So, have some fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.871,
    "end": 3724.566,
    "text": " uh i hope this has been a uh exciting quarterly roundtable bringing the lab meeting format to live streams genre and delivery uh look forward to a relaxing july and to picking back up in this second interval of activities where we'll have the symposium we'll have other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.715,
    "end": 3737.712,
    "text": " fun topics and projects we're going to have what people propose and during july we will prune off the projects that have gone inactive so that the projects link always reflects what's actually living",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.586,
    "end": 3757.557,
    "text": " and we will check in with the interns see who still is in the game we will open the doors they're always open but point to them again for new interns people who want that structure that mentoring possibility and uh hopefully a few new research fellows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.414,
    "end": 3770.854,
    "text": " lot will be happening in the second half of the year so i'll leave it on alexandra ceramics to close thank you everybody in the live chat see you next time",
    "speaker": "SPEAKER_00"
  }
]