[
  {
    "start": 9.278,
    "end": 30.814,
    "text": " hello welcome everyone it is may 2nd 2025 we're in active guest stream 105.1 with paula de mayo discussing systemic deviation from systemic failures to systemic aberration we will first be playing a pre-recorded",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.794,
    "end": 51.688,
    "text": " lecture and then follow that with a discussion with paula and jeff shulman here so looking forward to everyone's comments in the live chat and here we go with the pre-recorded video annual at the active inference institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.816,
    "end": 75.307,
    "text": " and friends, Daniel and friends, to talk a little bit about my work and they picked a topic from one of my papers called systemic deviation and I've taken the opportunity to remind myself how this systemic deviation thing I wrote about some time ago applies today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 75.487,
    "end": 78.992,
    "text": "So in the process of reviewing the paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.546,
    "end": 82.931,
    "text": " which I wrote a few years ago on the topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 83.131,
    "end": 100.677,
    "text": "Actually, I have updated it and realized that it's not only relevant, it also has this concept of systemic deviation has got like profound implication in helping us to understand a number of things which are going on today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.638,
    "end": 107.747,
    "text": "And so the new title for the topic systemic deviation is from systemic failures to systemic aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 108.52,
    "end": 129.263,
    "text": " it's a huge topic so thank you so much for bearing with me and uh the it's about 50 slides and i will try to go through them as quickly as possible but um because i don't like to hurry too much and speaking too fast although i've got so much to say in such a little time i think i recommend",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.087,
    "end": 141.658,
    "text": " The people listening to the talk will replay it at 1.5 speed so that all this pausing that I do while I'm reading doesn't slow you down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 143.98,
    "end": 151.127,
    "text": "So, systemic deviation refers to a behavioral and functional shift of a system from its intended purpose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.888,
    "end": 156.972,
    "text": "And it's particularly relevant in the context of intelligent and autonomous systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.88,
    "end": 159.302,
    "text": " So what is systemic deviation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 159.523,
    "end": 161.846,
    "text": "A theory, a lens, a paradigm, a framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.292,
    "end": 168.837,
    "text": "Just could be anything that you want it to be in a way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.098,
    "end": 174.587,
    "text": "And let's take it as a book concept at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 176.089,
    "end": 179.955,
    "text": "So roughly, this is going to be the content of the talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 180.556,
    "end": 184.242,
    "text": "Introduction, background, examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 186.01,
    "end": 188.773,
    "text": " mitigation measures, systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.234,
    "end": 196.82,
    "text": "And this table of contents, in fact, was written up before I finalized the slides, so we may deviate a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.84,
    "end": 197.721,
    "text": "This is just indicative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 199.363,
    "end": 210.493,
    "text": "And about me, I'm a teacher, writer, traveler, interested in nature, complementary health, systems, metaphysics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.654,
    "end": 213.756,
    "text": "I'm asking myself the big questions all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.04,
    "end": 226.328,
    "text": " and eventually it wasn't easy for me to focus on an academic life because of my diversity of interest but then luckily in these recent years it's okay to be multidisciplinary",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 227.658,
    "end": 237.03,
    "text": " So my academic focus in the last 10 years after my PhD has been information technology, intelligent systems, knowledge representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 237.11,
    "end": 243.739,
    "text": "I've got lots to say about this topic, interfaces, neuroscience, neuromodulation, meta science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 243.759,
    "end": 251.91,
    "text": "So basically we are trying to follow and gather insights into every little topic that matters today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 251.97,
    "end": 254.593,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.16,
    "end": 268.367,
    "text": " There was a paper called Systemic Deviation the Evil in the Machine which can be found online easily and it was published by the International Society for Systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.269,
    "end": 276.244,
    "text": "It was a presentation I did at some conference and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.355,
    "end": 279.68,
    "text": " And it was a little bit like scratching the surface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.7,
    "end": 281.545,
    "text": "So this is a great opportunity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 281.605,
    "end": 294.013,
    "text": "Thank you, Daniel and Hector, who said, let's talk about this topic again, because it's really good to go back to it and see what does this tell us about what we are at really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 294.533,
    "end": 299.619,
    "text": " Then the other, if you want to know a little bit more, you go into psychological abuse and you say, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 299.739,
    "end": 300.58,
    "text": "Oh, I'll tell you later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 300.6,
    "end": 313.455,
    "text": "But basically there is an interesting direction for the systemic deviation into the cognition and psychology of what this does to people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.216,
    "end": 321.705,
    "text": "So thanks to another opportunity, unrelated a couple of years ago, into looking at the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.812,
    "end": 349.532,
    "text": " psychiatry rather it was but you know like there was something that system deviation does to people and so if you may be interested in that you can just click and eventually what we're getting at is systemic abuse institutional abuse is something that a systemic deviation can help us figure out what's happening so why psychological abuse and systemic abuse is because technical systems and socio-technical systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 349.917,
    "end": 352.159,
    "text": " can be designed to perpetrate systemic abuse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.58,
    "end": 353.961,
    "text": "Now, you never thought about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.001,
    "end": 361.569,
    "text": "When you sit down to write a system or design a system or implement a system, you don't think, what is it going to do to people?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 362.751,
    "end": 366.234,
    "text": "You think, does it do what it's supposed to do in terms of functionality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.456,
    "end": 369.157,
    "text": "You think of the engineering side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.618,
    "end": 378.287,
    "text": "But then ultimately, now that we are becoming so dependent on systems and we interact with systems at every level, every day,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.111,
    "end": 401.187,
    "text": " they can be quite invasive systems as we as we are realizing with ai pervasive but also invasive so systemic deviation uh can be turned into abuse when it's turned into abuse can lead to psychological impairment so ultimately this is why uh i am uh matching the systemic abuse the systemic deviation which is more like a technical",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 402.01,
    "end": 409.782,
    "text": " a technical thing in relation to how systems cannot do what they're supposed to do, but it becomes relevant to socio-technical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.225,
    "end": 418.696,
    "text": "More importantly and more worryingly is that we cannot see and cannot, we like users or individuals or stakeholders, cannot see and cannot understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.736,
    "end": 427.41,
    "text": "If we cannot understand the vision, we may not realize what is happening between the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.128,
    "end": 441.181,
    "text": " It's important to understand that systemic deviation actually can have some consequences on cognition and psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.763,
    "end": 448.309,
    "text": "So in the title, as you can see, I put the word systemic aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 448.329,
    "end": 457.819,
    "text": "It wasn't there in the original work, but now that I've had the chance to see how things are progressing, I definitely say systemic deviation will lead to systemic aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.491,
    "end": 460.753,
    "text": " what we mean, aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 460.793,
    "end": 474.585,
    "text": "So actually, in science, it comes from a term coming from optics, the field of optics, and it's described as the failure of rays to converge at one focus because of a defect in the lens of a mirror.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.366,
    "end": 478.508,
    "text": "We could say that systemic deviation is that defect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 478.708,
    "end": 487.536,
    "text": "If we use the optics analogy, systemic deviation is like some kind of defect that prevents us from getting the focus on whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 487.988,
    "end": 503.087,
    "text": " So, but also of course there is a systemic aberration, aberration is a term used in biology and more generically speaking is a departure from what is normal, usual or respected in a negative sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.049,
    "end": 509.395,
    "text": "So, and we're seeing now how systemic deviation can lead to systemic aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.516,
    "end": 514.342,
    "text": "It's not a chance, it's not a mistake, it's designed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.362,
    "end": 515.363,
    "text": "I can see that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 515.647,
    "end": 545.502,
    "text": " i've started seeing that and this is the main message that this presentation gives then i figured it out and i'm sharing with people who are interested in looking into this possibility that we are all conditioned by systemic deviation when we're another so before moving on focusing on systemic deviation with a bit more attention i'd like to share this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.022,
    "end": 558.76,
    "text": " table, which was in fact made by John and I, to which I'm grateful, that is comparing institutional abuse with systemic abuse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 560.603,
    "end": 564.649,
    "text": "So is this systemic deviation leading to some kind of aberration and abuse?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 565.45,
    "end": 569.996,
    "text": "Abuse is also not particularly well understood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.657,
    "end": 573.261,
    "text": "We don't understand how it happens and what it does to people, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 574.422,
    "end": 587.341,
    "text": " In my work, I've had the chance to distinguish between the two and Gemini did a wonderful job at distinguishing the two using some categories, level, source of harm, scope, focus, perpetrator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.401,
    "end": 593.25,
    "text": "I don't know if I necessarily agree with these distinctions here, but it's very helpful to start as a starting point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 593.31,
    "end": 603.585,
    "text": "So institutional abuse, the level is micromissile or macro in systemic abuse, source of harm,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 603.92,
    "end": 612.569,
    "text": " failures within the institutional abuse, the source of harm is failures within an institution, and systemic abuse is broader societal structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.189,
    "end": 615.632,
    "text": "And here I would put socio-technical systems as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 615.712,
    "end": 619.235,
    "text": "The source of harm is the poor system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 620.717,
    "end": 632.408,
    "text": "institutional abuse is localized, systemic abuse is widespread, focus on occurring inside the institution versus generated by the way the system is structured.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 633.046,
    "end": 636.491,
    "text": " This is where our systemic deviation comes in really very clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 636.511,
    "end": 637.052,
    "text": "Perpetrator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 637.673,
    "end": 639.515,
    "text": "Individuals versus system structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.555,
    "end": 645.244,
    "text": "So I think we're aiming, we're looking at this, but then very often the relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.284,
    "end": 652.995,
    "text": "So when the institution is a system or operates through a system, then the two overlap clearly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.418,
    "end": 666.193,
    "text": " So the purpose of this presentation is to identify and map issues critical to survival, ultimately to health or healthy survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 666.213,
    "end": 683.218,
    "text": "Within the foundations of the paper, which I mentioned earlier, to see how this notion of systemic deviation, which I identified in 2016, has evolved and how does it apply today, we identify further examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 683.823,
    "end": 687.947,
    "text": " So in this paper I gave you examples but things have moved on and we have a lot more examples today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.987,
    "end": 696.494,
    "text": "And to increase situation awareness analysis and find possible solutions and find some synergy with others who resonate with this topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 696.514,
    "end": 701.398,
    "text": "So systemic failure, in the title somewhere there is also systemic failure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 701.418,
    "end": 703.7,
    "text": "So systemic deviation will lead to systemic failure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 704.641,
    "end": 708.624,
    "text": "It is a failure that happens in a deterministic, non-random, predictable fashion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.105,
    "end": 712.868,
    "text": "This is taken from some dictionary or definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.185,
    "end": 714.126,
    "text": " a Google definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 714.146,
    "end": 726.479,
    "text": "Predictable fashion failure that happens in a deterministic non-random predictable fashion from a certain cause which can only be eliminated by modification of the design of the manufacturing process of the process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 726.619,
    "end": 728.641,
    "text": "Let's forget manufacturing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 728.661,
    "end": 731.985,
    "text": "Operational procedures, documentation or other relevant factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.045,
    "end": 738.552,
    "text": "So it's very important to understand that very often when things go wrong is that because they were designed like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 740.219,
    "end": 744.826,
    "text": " Systemic deviation can be a contributing factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.847,
    "end": 746.529,
    "text": "I'm not saying that every case is like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 747.671,
    "end": 756.846,
    "text": "And it results in a system not fulfilling its declared purpose or fulfilling opposing purpose, which is, you know, where the aberration takes place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.866,
    "end": 767.323,
    "text": "So to have a system that does not fit for purpose is kind of common, but to have a system that does exactly the opposite of what is designed to be is a blatant aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 768.012,
    "end": 770.035,
    "text": " Example of systemic failures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 771.757,
    "end": 773.8,
    "text": "In the paper, these examples are brought up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.021,
    "end": 781.612,
    "text": "I'm not going to spend too much time on it because you can read the paper, but basically, hospitals that kill patients by accident.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 782.854,
    "end": 783.815,
    "text": "Very common.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 785.117,
    "end": 787.06,
    "text": "Corruption in law enforcement agencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.721,
    "end": 789.143,
    "text": "Very common.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 789.163,
    "end": 790.725,
    "text": "States and governments run by insiders.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 792.387,
    "end": 793.489,
    "text": "I'm sure you know all about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 793.589,
    "end": 795.572,
    "text": "Democracies that are governed by or run by elites.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.75,
    "end": 798.452,
    "text": " You can't see that, but you know it's there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 799.153,
    "end": 800.634,
    "text": "Media disseminating disinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 802.636,
    "end": 803.557,
    "text": "I'm sure you've heard that one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 804.638,
    "end": 807.922,
    "text": "Seemingly progressive movements that are actually set up to stir and drive repression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.544,
    "end": 817.872,
    "text": "This is very interesting when you see that, especially in industry, you say, oh, I didn't realize it for a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.993,
    "end": 823.618,
    "text": "You know, as a young girl, I was going into trade, learning about trade and marketing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.83,
    "end": 830.381,
    "text": " And then I realized that the consumer association is actually driven by the industry or set up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.441,
    "end": 836.973,
    "text": "It's like these are set up to deceive and to distort the consumer's view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.735,
    "end": 843.987,
    "text": "But you need to evolve the thinking and the awareness to be able to see that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.427,
    "end": 845.59,
    "text": "I didn't see that for a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.97,
    "end": 846.872,
    "text": "And when I did,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.219,
    "end": 857.37,
    "text": " It did have a consequence on my ability to function, as in, you know, my psychology, really, on how do I perceive the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.932,
    "end": 861.575,
    "text": "Open data initiative masterminded by secretive individuals?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.236,
    "end": 862.656,
    "text": "I'm sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.676,
    "end": 863.637,
    "text": "I mean, I've seen that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 864.879,
    "end": 866.12,
    "text": "Especially the open science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 867.742,
    "end": 868.804,
    "text": "Ships designed to sink?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 870.426,
    "end": 876.713,
    "text": "I don't think that was the case with Titanic, but I don't think it was designed to sink, but it was definitely a design issue that sank it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.733,
    "end": 877.534,
    "text": "And how come?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.138,
    "end": 884.147,
    "text": " How come something like the Titanic was not, the flaws in the Titanic design was not spotted?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.309,
    "end": 885.609,
    "text": "You know?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 886.59,
    "end": 891.357,
    "text": "I'm not sure, I don't think it was intentional in that case, but it was a terrible, terrible accident.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 892.299,
    "end": 895.303,
    "text": "And probably there are more in the history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 897.607,
    "end": 904.256,
    "text": "And transparency initiatives designed and led by people and organizations who want to make transparent models fit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 904.917,
    "end": 906.66,
    "text": "That's very similar to the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 907.045,
    "end": 935.432,
    "text": " open data so they're saying oh we want transparency and then they put the label transparency on the initiative but actually the initiative itself is completely opaque and this conflict between the label and what the thing that the system does is cause of disorientation in anyone who's looking at it so when we talk about abuse we're looking at cause of harm psychological and emotional manipulation systemic unfairness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.268,
    "end": 942.074,
    "text": " Systemic unfairness is causing shifts in collective consciousness and possibly even genetic mutation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 942.134,
    "end": 945.278,
    "text": "This would be interesting to investigate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.298,
    "end": 955.611,
    "text": "Many levels, technical, socio-technical, organizational, societal, total misinformation, family, workplace, very complex multi-stakeholder scenarios.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 957.674,
    "end": 964.823,
    "text": "So, abuse is not understood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.843,
    "end": 966.685,
    "text": "There is a lack of societal awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.032,
    "end": 993.82,
    "text": " problem it's almost because as I say in the presentation about psychological abuse is historical so schools families parents children relationship religion institutions they're all designed to inflict some kind of abuse so where abuse is perceived as good for you like discipline",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.34,
    "end": 1022.828,
    "text": " very often abuse, discipline or good discipline is confused with abuse and therefore we are unable to distinguish this is abuse because we think that's the way things are and that's the way things work but I think we are trying to make progress towards a more compassionate and mindful society therefore we are becoming increasingly aware but at large in institutions it still ignores what abuse consists of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.103,
    "end": 1050.823,
    "text": " of harm are immense so what are we looking at again we're looking at shifting systems function behavior structure causing systemic failure where the system does not fulfill its declared goal purpose or becomes aberrated and it fulfills the opposing goal and then eventually will result in systemic abuse and aberration",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1053.807,
    "end": 1061.94,
    "text": " So we're going to be looking at the mechanism of how this is happening and a little bit at the outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.207,
    "end": 1078.026,
    "text": "So the main outcome that we should be afraid of is the existential risk and then of course we're going to try to see if we can by raising or increasing our awareness we can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.137,
    "end": 1104.115,
    "text": " attempt to mitigate this phenomenon so we have defined systemic deviation and in particular i want to remind although this presentation focuses on psychology and cognition ultimately its application is the design of autonomous systems as they become more complex this deviation is increasingly hidden",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1105.023,
    "end": 1123.167,
    "text": " And it's a little bit like what we discussed with explainability of AI, how do we make the black blocks transparent, more transparent, how do we know what's going on inside the system, how do we audit auditability, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1123.187,
    "end": 1126.491,
    "text": "So this systemic deviation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1126.893,
    "end": 1156.68,
    "text": " applied were built into hidden into autonomous systems is relevant to complex systems social technical systems and intelligence systems so why is this topic important finally we're getting to the central point i think i have having illustrated what i'm talking about i can tell you why we're talking about it today and why i think is appreciate you listening because people are not listening and that's you know a bit of a worry but why is this topic important because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1157.065,
    "end": 1158.527,
    "text": " Systemic deviation is invisible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1158.587,
    "end": 1162.892,
    "text": "You cannot see it at all unless you really look hard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.292,
    "end": 1163.813,
    "text": "It's covert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.893,
    "end": 1165.234,
    "text": "In fact, it's inconceivable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1165.254,
    "end": 1166.295,
    "text": "It's counterintuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1167.196,
    "end": 1169.899,
    "text": "And it's a mechanism that contributes to existential risks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1171.121,
    "end": 1174.565,
    "text": "Existential risks resulting in technical and socio-technical malfunctions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.206,
    "end": 1178.409,
    "text": "Loss of confidence in perception and judgment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1179.19,
    "end": 1180.471,
    "text": "Mental and physical conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1180.732,
    "end": 1183.815,
    "text": "So it actually makes people unwell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1184.285,
    "end": 1188.25,
    "text": " I think it can even cause cancer, in fact, but I don't have the data to back it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1188.83,
    "end": 1192.415,
    "text": "Lack of awareness, loss of cognition, widespread insanity, madness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1193.096,
    "end": 1194.117,
    "text": "You can see a lot of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1194.197,
    "end": 1196.54,
    "text": "Socio-economic crisis, depletion of resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1197.321,
    "end": 1204.289,
    "text": "So the resources are there, but they're used not to achieve the declared purpose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.669,
    "end": 1207.993,
    "text": "They're actually wasted so that the purpose is not achieved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.013,
    "end": 1211.858,
    "text": "And this is like, ah, aberration, screaming aberration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.898,
    "end": 1213.6,
    "text": "Yeah, depletion of resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.035,
    "end": 1217.019,
    "text": " ongoing conflicts, disagreements, wars, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1217.319,
    "end": 1227.15,
    "text": "So systemic deviation is contributing to existential risks in a number of ways which are very alarming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.612,
    "end": 1234.98,
    "text": "So when we talk about existential risks we think of the cosmic events like the asteroid is going to hit us, the black hole is going to swallow us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.3,
    "end": 1241.607,
    "text": "This is not what I'm talking about because this kind of existential risks are not something anyone can do about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1241.647,
    "end": 1243.89,
    "text": "Climate catastrophe we could",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1244.36,
    "end": 1272.055,
    "text": " if we i don't know it's a bit late now sorry but it can be mitigated or we can attempt to avoid accelerating it if the risks are understood talking about global warming and all of that engineered pandemics by weapons nuclear war uncontrolled back and so we still could try to figure something out here but i'm talking about um something which is a bit closer to each of us and it's the misuse of technology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.507,
    "end": 1277.635,
    "text": " So we have industry standards which are failing to address the risks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1278.496,
    "end": 1280.239,
    "text": "That is an existentialist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1280.52,
    "end": 1289.574,
    "text": "So if the standard body that is supposed to identify and address the risks fails to do that, that is a way of the systemic deviation and the civilization apathy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.594,
    "end": 1294.802,
    "text": "So people are actually becoming numb to this nonsense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.373,
    "end": 1299.861,
    "text": " People are learning how to accept the systemic deviation as a fact of life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1300.682,
    "end": 1302.766,
    "text": "And it will contribute to cognitive fog.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.687,
    "end": 1305.19,
    "text": "I don't have the time to go into this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.031,
    "end": 1311.019,
    "text": "We'll be touching on what we mean by cognitive fog, but I'm sure you must have heard the topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.24,
    "end": 1313.504,
    "text": "People aren't figuring it out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1313.524,
    "end": 1319.794,
    "text": "And eventually, possibly dementia, loss of cognition, misinformation, mastocytosis, brainwashing, all sorts of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1319.814,
    "end": 1321.397,
    "text": "So, existential risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1322.963,
    "end": 1338.545,
    "text": " not understanding, for me, the main closest existential risk to each of us is not understanding what is going on as a result of confounding, obfuscation, confusion, design, confusion by design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.565,
    "end": 1346.035,
    "text": "And it means that people cannot react or make decisions appropriately to prevent whatever escalation of risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.01,
    "end": 1353.917,
    "text": " So the closest level of existential risk is information, knowledge, emotion, cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1353.937,
    "end": 1363.706,
    "text": "What information we receive, how we process it, how we develop our knowledge and how that turns or stirs our emotions and impacts our cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.126,
    "end": 1373.575,
    "text": "And then, of course, there's a number of other levels here we don't have time to look at, but they will be resulting in suffering and harm or loss of cognition or even loss of life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.668,
    "end": 1381.3,
    "text": " So that existential risk is the reason why we're talking about systemic ideation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1381.32,
    "end": 1387.411,
    "text": "In the previous slide and in the paper, these are the main categories identified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1388.833,
    "end": 1392.76,
    "text": "We have already seen this in the paper and in the previous slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.363,
    "end": 1398.651,
    "text": "And now I'm picking up a few more examples that have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.711,
    "end": 1409.264,
    "text": " where systemic deviation has become applicable from the time the paper was written a few years ago to that, which is about 10 years almost now, 9 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1409.945,
    "end": 1420.799,
    "text": "But this is a figure which I wasn't sure about, but you know, we said hospital, you know, that you go to the hospital for it to be cured and then you die.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1422.281,
    "end": 1422.382,
    "text": "Okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1422.822,
    "end": 1424.264,
    "text": "So this is actually backed by figures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1424.464,
    "end": 1425.766,
    "text": "Medical, yearly death.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1425.886,
    "end": 1426.928,
    "text": "This is only the US.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.968,
    "end": 1427.929,
    "text": "I don't know, I...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1428.263,
    "end": 1455.216,
    "text": " horrified to think what if this happens in the US I wonder how big the problem is at global level but basically medical error people die of medical error misdiagnosis and adverse prescription reaction these are three categories all called by some kind of systemic deviation and in fact they all belong to the category medical error misdiagnosis adverse prescription reaction they're all medical errors",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1456.175,
    "end": 1472.665,
    "text": " but they don't receive attention so but when you there are measles like few cases for you they become like a big news people have died of measles these big news and this is a type of systemic negation there are two systemic negations here one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1473.353,
    "end": 1489.274,
    "text": " These figures show us that people are dying from the health system and it's showing us that information is misrepresenting the problem by putting a lot of attention on the small cases and not enough on the big causes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1490.195,
    "end": 1497.805,
    "text": "So in AI, we are looking at the machine learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1497.825,
    "end": 1501.47,
    "text": "I'm not talking about knowledge-based AI, I'm talking about machine learning which is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1502.125,
    "end": 1509.273,
    "text": " the biggest type of AI used at the moment, which is causing all this interest because it can be very powerful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1509.753,
    "end": 1517.601,
    "text": "But basically, the systemic deviation in machine learning happens when data is transformed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.222,
    "end": 1523.848,
    "text": "You know these transformers, you must have heard of the transformers algorithm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1524.048,
    "end": 1530.495,
    "text": "And the way the data is transformed can lead to the data become completely different from what it was at the beginning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.948,
    "end": 1532.19,
    "text": " in more than one way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1532.931,
    "end": 1545.009,
    "text": "So ultimately the AI may result in an outcome, the process carried out by machine learning can be false.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.029,
    "end": 1556.045,
    "text": "When we go and look at the standard to ensure that AI is operating safely, we see that the standard doesn't even contemplate truth maintenance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1556.065,
    "end": 1557.647,
    "text": "Truth maintenance is a concept",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.066,
    "end": 1561.558,
    "text": " in knowledge representation, which is one of the fields I'm working on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1563.163,
    "end": 1571.029,
    "text": "And I'm working on this and saying, how come the standard in AI safety doesn't mention the truth maintenance?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.583,
    "end": 1578.153,
    "text": " Well, at least this was, now we're in 1st of May, 2nd of May, and this was true in February.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.173,
    "end": 1579.595,
    "text": "So, and I have raised the alarm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.915,
    "end": 1581.077,
    "text": "I don't know if it has been taken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1581.117,
    "end": 1587.927,
    "text": "There is a chance that it has been looked into, but they're not attributing this to me because this is what happened, unfortunately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1587.947,
    "end": 1591.192,
    "text": "But I'm hoping somebody has picked up the message.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1591.913,
    "end": 1597.742,
    "text": "So the safety standards in AI are not adequately addressing the risks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1598.87,
    "end": 1604.299,
    "text": " So there is a proliferation of ICT standards that does not address critical concepts such as treatment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1604.319,
    "end": 1605.561,
    "text": "And then, of course, deepfakes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1606.142,
    "end": 1615.056,
    "text": "So here, deepfake is an interesting case because it's a case where the software is designed to deliberately misrepresent the fact or the truth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.559,
    "end": 1616.941,
    "text": " and it's built in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1617.402,
    "end": 1634.586,
    "text": "So systemic deviation is actually, deepfakes is when people, so the software will produce some output which is fake, which is not real at all, with a lot of examples and a lot of adverse consequences, and it's a type of systemic deviation of course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.828,
    "end": 1639.012,
    "text": "So in the moment, big drama here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1639.072,
    "end": 1643.018,
    "text": "So I didn't look at this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.993,
    "end": 1649.098,
    "text": " Green Deal in the Obama era for a long time, I heard that there was a problem with the biofuels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1649.959,
    "end": 1651.441,
    "text": "And I said, what's the problem with biofuels?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.862,
    "end": 1654.624,
    "text": "What problem can there be with biofuels?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1654.764,
    "end": 1666.376,
    "text": "And the problem is that they are, entire government programs are adopting biofuels which are clearly not right, not biofuels at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1666.676,
    "end": 1668.178,
    "text": "Like biofuels",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1669.036,
    "end": 1678.695,
    "text": " The process of generating biofuel is supposed to be environmental friendly and creating free energy or is like non-consuming fossil fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1679.236,
    "end": 1687.652,
    "text": "In some examples, and this was designed to happen like this, they made the biofuel dependent on fossil fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1688.206,
    "end": 1689.848,
    "text": " because they designed it wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.868,
    "end": 1714.433,
    "text": "And then they made the administration responsible for that, when the administration was actually probably a victim of an industry lobby that nominated the administration to sign off and accept a program which was clearly not working, because nobody in the program had control of what was happening, and nobody had enough competence to say this is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1715.138,
    "end": 1739.792,
    "text": " So the public could only see that it was wrong at the end, after billions were wasted, after biofuel became a joke, and after we realized that somebody in the system is making biofuel fail and is making the political administration, which is trying to go green, fail and make it look ridiculous, because they're really evil and they can do that, they have the power to do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1740.974,
    "end": 1743.778,
    "text": "And then this is another example of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1745.058,
    "end": 1750.705,
    "text": " the climate change conference in Brazil where they're cutting the trees down to make room for the climate change meeting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1750.725,
    "end": 1756.753,
    "text": "This is, I don't know if you've heard of this, but this is, I just thought, oh my God, you know, this is really happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.913,
    "end": 1762.481,
    "text": "So they have the climate change conference and they're taking down the forest to accommodate for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1762.501,
    "end": 1764.523,
    "text": "Isn't this a case of systemic deviation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1764.543,
    "end": 1765.344,
    "text": "For me, it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1765.484,
    "end": 1766.165,
    "text": "It's dramatic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1767.307,
    "end": 1771.352,
    "text": "And so this was an interesting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1774.1,
    "end": 1800.192,
    "text": " example i was reading the papers the other day the atlantic and i don't have uh personal quibbles with uh anyone but they were saying you know here with the people who are losing this ability to figure out what's happening they're not just the common folks like you and i they are the people who are supposed to be in charge of big decisions so this article was telling of uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.268,
    "end": 1829.757,
    "text": " you know the world's largest military was enveloped in a level of dysfunction that bordered with a comical now we have the top brass who is being misled so think of what happened with iraq one simple meeting by powell triggered years of war in the middle of war weapons of mass destruction that weren't there so here we have i'm not talking about i don't know about this guy i have no idea who this guy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1830.091,
    "end": 1832.694,
    "text": " whether it's fit for poster or nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1832.714,
    "end": 1852.794,
    "text": "But what I know is that people who are making the big decisions, these are supposed to be the most rational, best informed decision makers who have big power to destroy the universe, or not to destroy the universe, and they are confused.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.814,
    "end": 1855.957,
    "text": "They're dysfunctional, they're misled, they're taking for a ride.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.798,
    "end": 1858.9,
    "text": "This is existentialism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1861.293,
    "end": 1866.138,
    "text": " And then we're looking at psychological abuse in general and mind-wracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1866.158,
    "end": 1872.085,
    "text": "Now, when somebody told me this is mind-wracking, I couldn't figure out what we're talking about and then I figured it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1874.087,
    "end": 1889.224,
    "text": "When we are misinformed and when we are given two versions of the truth simultaneously, people, cognition and consciousness become split with a split mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1889.474,
    "end": 1894.601,
    "text": " we are not able to make the best decision at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1895.943,
    "end": 1900.109,
    "text": "And this psychological abuse, this is a form of psychological abuse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1902.313,
    "end": 1917.034,
    "text": "It's happening in the organization family schools, but it's happening at government level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.326,
    "end": 1931.418,
    "text": " So, if somebody figures it out and says, okay, I worked it out, this is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1931.698,
    "end": 1932.8,
    "text": "They're taking us for a ride.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1933.06,
    "end": 1934.541,
    "text": "This system is designed wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1934.561,
    "end": 1935.402,
    "text": "It's designed to fail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1936.083,
    "end": 1941.028,
    "text": "Now, when an expert will see it, they are psychologically abused.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1941.048,
    "end": 1947.274,
    "text": "So the people who identify the systemic deviation become harassed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.25,
    "end": 1954.74,
    "text": " At best, they become psychologically abused and harassed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1954.76,
    "end": 1955.381,
    "text": "At best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.562,
    "end": 1958.565,
    "text": "At worst, they get murdered.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1959.186,
    "end": 1962.211,
    "text": "So the systemic failures in Boeing 747 are historical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1963.092,
    "end": 1964.554,
    "text": "It's not secret.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.075,
    "end": 1966.377,
    "text": "There are a lot of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.863,
    "end": 1995.756,
    "text": " uh reports uh for decades there's been issues with some safety i'm saying boeing because it's the largest manufacturers but it could be that could be where there could be others so there are systemic failures in the safety of certain systems for example boeing seven percent and after seven for seven uh came running to in accidents safety caused by safety issues repeatedly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1996.141,
    "end": 2003.091,
    "text": " Increasingly, worryingly, systemically, the engineers, they started shouting, saying, I told you so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2003.111,
    "end": 2005.695,
    "text": "I have reported this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2006.296,
    "end": 2008.619,
    "text": "My report has been shoved under the carpet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2008.639,
    "end": 2016.71,
    "text": "So people may have noticed that, you know, there are safety issues or some systemic deviation taking place at system design level or system manufacturer in some cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.171,
    "end": 2018.193,
    "text": "And they're killed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.213,
    "end": 2020.636,
    "text": "Like this guy died accidentally by suicide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.437,
    "end": 2023.38,
    "text": "It's a very long story, but you have to read it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.732,
    "end": 2053.333,
    "text": " and it's unbelievable uh joan barnett joshua dean they're now suing but it's it's a dramatic so when we find out that there's something going on when we say it as a whistleblower or as a simple naive observer point the finger and say this is wrong and people become abused at best and they will become murdered and uh you know when the thing is when there is enough uh at stake",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2059.878,
    "end": 2062.101,
    "text": " And this, you know, there is some lots of stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.141,
    "end": 2063.082,
    "text": "There are some examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.063,
    "end": 2067.367,
    "text": "And then I'm looking at forensics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.387,
    "end": 2069.289,
    "text": "I have a paper out which I can share with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2069.329,
    "end": 2076.558,
    "text": "Interesting stuff, but ultimately we have forensics is sometimes used to lead to wrongful conviction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2078.04,
    "end": 2087.151,
    "text": "So we are using the most rigorous process for fact-finding to actually produce fabricated false.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.89,
    "end": 2090.473,
    "text": " false evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2091.674,
    "end": 2093.876,
    "text": "Very common.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2093.896,
    "end": 2095.818,
    "text": "So why is this happening?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2095.998,
    "end": 2101.224,
    "text": "Motivation for systemic deviation, systemic failure can be found in... So some of it are genuine errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2101.624,
    "end": 2107.711,
    "text": "Okay, we accept that humans are not perfect, that systems, organizations are prone to failure, so we're okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.731,
    "end": 2109.092,
    "text": "But they can also be systematic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2109.132,
    "end": 2115.619,
    "text": "So someone has figured out that they can play God",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.987,
    "end": 2129.133,
    "text": " By injecting a systemic deviation into a system, an organization, a program, a hospital or two, we make money out of it again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2129.153,
    "end": 2135.886,
    "text": "Which can mostly be money, but it could be a number of other things, including political power or personal power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2136.338,
    "end": 2137.38,
    "text": " Power, money, profit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.4,
    "end": 2145.553,
    "text": "So people are using some, you know, the more knowledgeable people who have figured out how to control a system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.573,
    "end": 2148.138,
    "text": "These are the system control people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.458,
    "end": 2152.585,
    "text": "They know how to control a system by designing it wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2154.929,
    "end": 2162.802,
    "text": "And then they gain control or wealth or other whatever from this failure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.334,
    "end": 2165.236,
    "text": " I would say so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.898,
    "end": 2166.68,
    "text": "How can it happen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2167.442,
    "end": 2171.813,
    "text": "Okay, so the mechanisms are misrepresentation, misalignment, and confounding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.873,
    "end": 2178.85,
    "text": "By confounding here, I don't mean the statistical confounding factors that you find in statistics, which are mathematical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2179.336,
    "end": 2185.506,
    "text": " confounding with data that doesn't belong and it makes the analysis of the data skewed, so the bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.047,
    "end": 2197.024,
    "text": "I'm talking about the tactics to confound, so deliberately seeding, misleading, decoying",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.32,
    "end": 2224.632,
    "text": " signals into a message so that it takes a lot more intelligence and processing ability to decode the truth to clean up the truth what's happening really poor system design accidental so sometimes it's accidental sometimes it's deliberate and we need to figure out or both we need to learn how to distinguish when is this happening by accident or where is someone actually doing it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.371,
    "end": 2229.728,
    "text": " It happens to cognitive dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.94,
    "end": 2237.249,
    "text": " So when it's injected, it's because someone is designing a response into the individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2237.769,
    "end": 2243.818,
    "text": "Very often these are the decision makers, the influencers, people who can call the shots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2243.918,
    "end": 2250.727,
    "text": "They are deliberately misled to have dissonant cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.27,
    "end": 2258.398,
    "text": "And this is where a lot of the people in power are actually psychopaths, which is kind of very worrying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2258.969,
    "end": 2282.174,
    "text": " leading to alienation, conflicting emotions, and then of course, more general level, these conflicts in society can lead to mental health issues, autism, depression, disengagement, people say, okay, sorry, I can't cope with this, and I see you all on the beach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.378,
    "end": 2287.66,
    "text": "Systematic aberration, so this is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2288.247,
    "end": 2316.28,
    "text": " day in day out everything that we see what we do what we perceive is leading or going the same way and then we become confounded and i suspect it can cause mutations i have reason to believe that so there is a paper there is at least one paper there are probably more but it's saying mutations in human accelerated um regions in the brain region",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2317.407,
    "end": 2325.515,
    "text": " So mutation in humans disrupt cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.456,
    "end": 2327.857,
    "text": "There is an article with study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2329.559,
    "end": 2332.642,
    "text": "So how mutation can impact cognition and social behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.843,
    "end": 2336.165,
    "text": "But what I'm looking at is the opposite.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2337.467,
    "end": 2342.892,
    "text": "How can cognition and social behavior disrupt",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2344.222,
    "end": 2346.224,
    "text": " cause or impact mutation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2346.904,
    "end": 2348.986,
    "text": "I think it can, but I don't have the data for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2349.006,
    "end": 2351.088,
    "text": "That's another possible direction for study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.029,
    "end": 2360.576,
    "text": "So, but what we know for a fact is that depression is leading to health decline, chronic stress and depressive-like behaviors associated with impairments of neuroplasticity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2360.916,
    "end": 2368.362,
    "text": "People lose their ability to think creatively or positively sometimes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2369.984,
    "end": 2373.807,
    "text": "Optimistically, people lose the ability to think altogether.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2374.681,
    "end": 2378.246,
    "text": " when they are stressed or depressed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.266,
    "end": 2386.8,
    "text": "So all of this systemic deviation, which is causing confusion, people are losing their ability to control their own mind, their own cognitive process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.84,
    "end": 2388.222,
    "text": "They don't understand what is going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2388.542,
    "end": 2392.588,
    "text": "We are all at the receiving end of someone doing something which obviously doesn't work or is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2393.089,
    "end": 2394.071,
    "text": "And that's very depressing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2394.511,
    "end": 2395.733,
    "text": "And this is happening quite a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.935,
    "end": 2403.405,
    "text": "It's a little bit what people are experiencing is cognitive fog and it's something that we should learn how to recognize a bit more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.178,
    "end": 2413.411,
    "text": " still dissonant consequences, dissonant psychological-emotional dissociation, general stress, dysfunctions, reduction of free will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.512,
    "end": 2422.844,
    "text": "We all become conditioned to function in a way that is reducing, minimizing harm and maximizing reward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.224,
    "end": 2426.309,
    "text": "So ultimately, we are back to where the conditioning is taking place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.031,
    "end": 2433.038,
    "text": "I have a presentation on free will, which I can share if people are interested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.659,
    "end": 2445.282,
    "text": " And then, of course, that's where people become manipulated and unable to realize that they are being misled into something, into being part of something bigger, which is definitely wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.302,
    "end": 2451.715,
    "text": "This is how people become like, you know, the horde behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.797,
    "end": 2453.338,
    "text": "Because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2453.757,
    "end": 2478.921,
    "text": " because of the uncertainties there is certain safety going where everyone else is going and individuals, very few people have this ability to call out this phenomena of wrong and when they do their risk they become ridiculed and they become abused and they even murder and their families so it is easier",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2479.407,
    "end": 2507.119,
    "text": " to say okay you know i've got children to think about uh i have heard so many times people are we want to worry about the end of the month paying the rent and sorry we cannot cope with this we have to just go with the flow so psychological and emotional trauma so this is where i think is happening that we are mutating this is all happening and we are mutating possibly cause of cancer and possibly we are becoming chimpanzees",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.145,
    "end": 2512.57,
    "text": " I mean, you are becoming sheep, but they are becoming sheep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.691,
    "end": 2520.46,
    "text": "I'm trying to develop my human discrimination at some cost.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.9,
    "end": 2532.074,
    "text": "So basically this trauma and this trauma are impacting evolution, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.094,
    "end": 2535.418,
    "text": "That's important thing to remember as existential risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.905,
    "end": 2536.706,
    "text": " So what can we do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2537.166,
    "end": 2553.942,
    "text": "We can first try to figure out what's going on, develop, raise awareness, recognize the risk of deviation, and become paranoid in the process, and become, how do you say, fairly petulant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.182,
    "end": 2561.229,
    "text": "Like, you know, we have to pay attention to every little detail because deviation can be very subtle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.249,
    "end": 2565.473,
    "text": "So you need to be able to look at the detail and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.921,
    "end": 2574.352,
    "text": " try to see is this little thing going to lead to a bigger problem later on down the line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2574.492,
    "end": 2577.417,
    "text": "Knowledge representation, I'm sure I've got more slides on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.917,
    "end": 2579.179,
    "text": "So how can it be mitigated?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.239,
    "end": 2581.422,
    "text": "Logical integrity, important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.503,
    "end": 2592.839,
    "text": "We need to be able to, we need to exercise our intellectual discrimination through logical integrity, whatever that is, whatever way you define.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2593.6,
    "end": 2596.725,
    "text": "Truth preservation, integrated systems design, causal loops,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2597.532,
    "end": 2622.223,
    "text": " stepping away this is more like a behavioral decision when things are wrong we cannot understand them walk walk as fast as you can walk away and sometimes we find ourselves into some desert you know into the jungle we say I had to walk away from this I had to walk away from that but eventually we will meet others who have walked away and develop better and maybe we have a chance to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.794,
    "end": 2634.255,
    "text": " reconsider and make an impact for the you know future and develop better systems obviously so they sort of cause loops for those of you it's a design way of somewhere here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2634.877,
    "end": 2644.392,
    "text": " there is a cause for the system to work as intended or the system to work not as intended, somewhere here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.692,
    "end": 2648.037,
    "text": "And here is where the systemic deviation will hide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.398,
    "end": 2653.686,
    "text": "As you can see, you need to apply a lot of attention to see where the deviation is taking place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.11,
    "end": 2658.353,
    "text": "So in a previous",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.328,
    "end": 2665.998,
    "text": " This is coming from other presentations, and basically, when I say knowledge presentation, it's important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2666.018,
    "end": 2684.526,
    "text": "I have reason to do so, I've done a lot of work, but ultimately, in order to understand what is going on, so how to maintain logical integrity, we need to be able to identify concepts, to have an idea of how everything sticks together, what things are called, glossaries, how the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.506,
    "end": 2688.812,
    "text": " these entities or things relate to each other in a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.252,
    "end": 2690.914,
    "text": "We use frame in AI.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2692.116,
    "end": 2711.02,
    "text": "So we have these and how they build a process or a function, algorithm, and how these are written up, so which syntax, notation, language, and then ultimately how these are encoded into a system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2712.113,
    "end": 2730.832,
    "text": " So we need to learn about knowledge presentation because this is how the system is going to... By using a correct, adequate, valid, transparent knowledge presentation, that's the only way to figure out how the system is going to play out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2730.872,
    "end": 2738.88,
    "text": "Then we have knowledge presentation as a shared mechanism to ensure...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2739.13,
    "end": 2745.58,
    "text": " the conceptualization of complexity, logical and functional integrity, risk reduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.6,
    "end": 2758.238,
    "text": "So we were looking at our risks and this is the only way we can ensure to reduce the risk is by understanding and implementing knowledge presentation correctly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.258,
    "end": 2766.15,
    "text": "So to address the black box and the opacity and to improve reproducibility and predictability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2766.923,
    "end": 2775.257,
    "text": " So mitigation, develop awareness, apply intelligent reasoning, devise better systems, develop cautionary measures, sometimes non-action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.719,
    "end": 2787.717,
    "text": "So whenever we see that whatever we do is misused or misinterpreted or twisted or mischaracterized or misrepresented, then it's better",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2787.95,
    "end": 2812.371,
    "text": " just to shut the heck up and walk away which is why many of us are ending up in some kind of monastery situation or retreats or isolation we need to collect ourselves and figure out if everything that we do is can be useful because there is a bigger evil out there then sometimes we take this spiritual",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2812.587,
    "end": 2821.197,
    "text": " You know, I'm going to go to the beach or become an artist or just rather not do anything, which is a lot of people actually are taking this path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2821.217,
    "end": 2822.178,
    "text": "And I understand why.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2823.78,
    "end": 2827.365,
    "text": "So, but of course, if we can, we should design properly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2827.385,
    "end": 2829.847,
    "text": "We should develop ethical principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.209,
    "end": 2837.076,
    "text": "We should overcome our cognitive limitations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2838.068,
    "end": 2840.291,
    "text": " understand and address systemic challenges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.371,
    "end": 2841.452,
    "text": "So this is the system level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2842.293,
    "end": 2843.475,
    "text": "I have a lot of papers on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.577,
    "end": 2851.965,
    "text": "We need to understand the system level and we need to do some joint optimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.985,
    "end": 2861.797,
    "text": "And I have a paper on that, which is something that happens naturally in functioning, how do you say, well-balanced ecosystems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2861.978,
    "end": 2866.303,
    "text": "Joint optimization is a natural function of a healthy ecosystem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.342,
    "end": 2880.2,
    "text": " But when this joint optimization is prevented by the wrong design, then equilibrium, self-equilibrium or self-correction cannot happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2880.941,
    "end": 2882.543,
    "text": "They're just discussing a different data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2884.106,
    "end": 2895.683,
    "text": "So measures, again, mitigation, refine design principles, strengthen protocols, enhance awareness, address misuse, risks of misuse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.772,
    "end": 2918.264,
    "text": " So the joint optimization is very important, because joint optimization means that the system should be designed to figure itself out, self-correct, but in the systemic deviated way, sometimes the ability to self-optimize is prevented completely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2920.147,
    "end": 2925.535,
    "text": "This is done sometimes by bureaucracy or rules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.19,
    "end": 2928.713,
    "text": " So very interesting stuff and a very big topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2931.376,
    "end": 2934.179,
    "text": "Purpose, structure, behavior, function, technical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2935.621,
    "end": 2940.567,
    "text": "Sociotechnical system has the human aspects like language, cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2943.03,
    "end": 2954.543,
    "text": "We can design technical systems in a deterministic way, but we cannot determine how humans are going to interpret or react or adapt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.113,
    "end": 2960.138,
    "text": " So, you know, we have some knowledge presentations somewhere in between there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.158,
    "end": 2964.862,
    "text": "This again, these are slides from other talks and bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2964.922,
    "end": 2982.859,
    "text": "So I think systemic deviation is currently seen as a form of bias where all of these factors, systemic bias, epistemology, cognition, algorithms, function, representation, they all come together to develop the functionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2983.396,
    "end": 2990.731,
    "text": " But they can also equally be used by those very smart phones to develop this function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.751,
    "end": 2995.04,
    "text": "And this is what we're seeing a lot, and this is what I'm trying to put across with the talk today mostly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.603,
    "end": 2998.367,
    "text": "So, logical chains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2999.191,
    "end": 3002.035,
    "text": " So now we're looking at, we're taking all this stuff together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3002.436,
    "end": 3009.846,
    "text": "We have misalignment, misrepresentation, cognitive dissonance, loss of cognition, disengagement, decline, inability to take corrective action, possibly leading to catastrophe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3010.527,
    "end": 3018.239,
    "text": "We are trying another way of looking at this, navigating all this information is looking at cognitive dissonance, psychological trauma, genetic mutation, leading to aberrations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.599,
    "end": 3021.043,
    "text": "Possibly we are becoming monkeys, humans becoming monkeys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3023.887,
    "end": 3026.11,
    "text": "Seeing that quite a lot and dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.917,
    "end": 3049.11,
    "text": " uh leading to dissociation and dysfunction uh some of it is visible very clearly in the health human social health poor system design can lead to logical disintegration big alert here alarm be careful let's be aware this is happening and this is a dual complexity again part of another",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3049.597,
    "end": 3053.863,
    "text": " piece of work I did, and we're trying to break down where is the complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.143,
    "end": 3056.387,
    "text": "People are saying things are becoming more complex, are they?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.427,
    "end": 3068.003,
    "text": "And here I was breaking down what is complexity made of, perceptual, cognitive, representational, epistemic, ontological, functional and systemic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.123,
    "end": 3072.649,
    "text": "So this is what makes up our complexity, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.13,
    "end": 3075.874,
    "text": "And I'm talking about this somewhere else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3077.17,
    "end": 3089.766,
    "text": " And again, I place some emphasis on knowledge presentation and I identify some levels of knowledge presentation corresponding to as many levels of other levels, implementation, logical, epistemic, conceptual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3090.707,
    "end": 3100.96,
    "text": "So system-level knowledge representation, you can look up the works, roughly consisting of cognitive and functional areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.741,
    "end": 3104.545,
    "text": "And I think systemic deviation is here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3106.955,
    "end": 3110.218,
    "text": " but it could possibly also relate to here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.238,
    "end": 3110.699,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.739,
    "end": 3113.101,
    "text": "I'm going to maybe redo this diagram.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3113.121,
    "end": 3118.886,
    "text": "I don't know where I got this tree from, but the systemic division could well be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.127,
    "end": 3119.607,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3120.808,
    "end": 3124.372,
    "text": "Research agenda, knowledge presentation more for the reasons that I discussed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3124.412,
    "end": 3129.777,
    "text": "Ethical models addressing systemic challenges and a lot to be discussed of where this is going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.098,
    "end": 3135.122,
    "text": "So misalignment between intent and action can be designed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.878,
    "end": 3139.642,
    "text": " It can be accidental, but it can be designed to trigger failure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.142,
    "end": 3142.885,
    "text": "This is what we should be very aware and very afraid of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.027,
    "end": 3149.051,
    "text": "Systematic misrepresentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.531,
    "end": 3153.355,
    "text": "Intentional misalignment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.395,
    "end": 3156.918,
    "text": "When designed and engineered properly, systems can be wonderful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.799,
    "end": 3161.042,
    "text": "Self-equilibrium, self-correction, evolution, intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3161.062,
    "end": 3162.484,
    "text": "We all love this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.504,
    "end": 3165.767,
    "text": "But then, when you leverage this ability to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3166.22,
    "end": 3175.133,
    "text": " pointed into the right direction of Han, then, you know, something to be obviously recognized and avoided.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.654,
    "end": 3183.866,
    "text": "And they're masked, when things are masked by misleading labels and false knowledge, so they're saying this is so and so, but actually you won't look and it ain't so at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3183.886,
    "end": 3188.953,
    "text": "And so this is where, unless people are paying full attention to the phenomenon, they will take",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.524,
    "end": 3214.468,
    "text": " the label for good I mean to because we don't have the ability to process unlimited amount of information we are tired we are busy we are our attention is elsewhere in most days on the children on the survival on the paying the bills on other things which are more rewarding and more attractive like even you know everything that makes us happy we are looking paying attention to and all these misleading labels ah you know it's a headache",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.967,
    "end": 3220.175,
    "text": " So to what extent can we actually go and check everything out and split every single hair?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.696,
    "end": 3224.483,
    "text": "And that's what I'm afraid we have to try to do more of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3225.626,
    "end": 3232.018,
    "text": "So because when that happens, there is the divergence between the label and actually the fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.623,
    "end": 3260.824,
    "text": " when the label doesn't correspond to what the label describes at all that's where systemic division takes place and it's using adversarial tactics so it is a weapon actually and it's a weapon and the first level of target for the weapon is people's cognition and consciousness and so it's even considered smart you know people say oh yeah you know weapons it can be good because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.209,
    "end": 3262.992,
    "text": " you can win with them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3263.012,
    "end": 3268.32,
    "text": "But when there is this disintegration of consciousness, then nobody wins, really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3268.34,
    "end": 3269.782,
    "text": "I mean, a lot of people have worked it out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.565,
    "end": 3282.02,
    "text": "So that's where I think we should be making the moral argument for, no, it's not smart to make people stupid or create disinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3282.922,
    "end": 3286.527,
    "text": "Although there could be some short-term gains, in the long term, everybody's going to lose out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3287.288,
    "end": 3289.191,
    "text": "And then, of course, this is another...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.964,
    "end": 3291.848,
    "text": " Big topic, deviated intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3291.948,
    "end": 3308.823,
    "text": "So we are using entire systems, organizations, rule sets, connections, networks to produce intelligence which is actually designed to mislead and dysfunction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3309.164,
    "end": 3309.685,
    "text": "It's wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.447,
    "end": 3311.128,
    "text": "Deeply wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3311.581,
    "end": 3317.812,
    "text": " the paper on Forensics, which is going to come out shortly with Taylor Francis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.232,
    "end": 3319.214,
    "text": "It was chapter of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.795,
    "end": 3328.851,
    "text": "I have the opportunity to delve into Deviative Intelligence from a Forensics perspective, and I'd be happy to share the paper with anyone interested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.973,
    "end": 3332.256,
    "text": "So we're looking at evil, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3332.296,
    "end": 3337.285,
    "text": "If someone was wondering, or couldn't see, I couldn't see evil for a long time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.619,
    "end": 3359.323,
    "text": " i thought everything was good you know and now i can see it and i see if you're asking me what is evil made of it's this is the stuff that evil is made of uh and there is probably a bit more but this is more or less so there is no right or wrong but there is systemic deviation we've looked at the examples mitigation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3360.67,
    "end": 3364.279,
    "text": " ethical considerations and research directions and thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.126,
    "end": 3369.331,
    "text": "So yeah, I haven't managed to put in all the references.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3369.371,
    "end": 3370.955,
    "text": "I'm struggling to meet my deadline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3370.975,
    "end": 3373.702,
    "text": "The deadline was let's try to get this done by the 2nd of May.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.424,
    "end": 3375.346,
    "text": "Today is the 1st of May.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3375.907,
    "end": 3377.852,
    "text": "Putting together the recording just to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3379.132,
    "end": 3385.219,
    "text": " make sure we've got something to talk about tomorrow, and I hope this thing has been recorded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.239,
    "end": 3407.586,
    "text": "I want to thank Michael Walker who introduced me to Hector, Hector introduced me to Daniel, and now I think there is another guy here whose name I don't remember, who just came on board yesterday, and I hope everyone is going to look at this talk on YouTube, on the Active Inference Institute, and I am also trying to do a couple more slides specifically on the Active Inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.768,
    "end": 3435.852,
    "text": " um before the second so thank you so much for listening to get in touch let's talk about this stuff let's talk more about this and see what can we do all right thank you for the recorded presentation paula are you back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3442.987,
    "end": 3445.956,
    "text": " Yes, I am.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3446.076,
    "end": 3447.36,
    "text": "Thank you so much for listening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3447.38,
    "end": 3447.701,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.202,
    "end": 3451.793,
    "text": "So what did you do wrong about the slides not being very visible?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3451.813,
    "end": 3455.564,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.005,
    "end": 3457.249,
    "text": "They seemed fine to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.659,
    "end": 3471.351,
    "text": " You say fine because when I when I looked through the YouTube channel The slides were out of focus, but Jeff did you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.691,
    "end": 3473.873,
    "text": "Could you manage to read the slide?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.034,
    "end": 3479.719,
    "text": "From YouTube from the live stream Yes, I was able to just fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.381,
    "end": 3489.008,
    "text": "Oh That's great for some reason my YouTube isn't showing but thank you so much for listening and I have I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3489.46,
    "end": 3514.945,
    "text": " uh i would like to perhaps suggest that we also link the original slides or recording to the youtube so that anyone having difficulties like i did they can watch um the original recording which seemed to be clear enough so thank you so much for listening cool yes um what do you make what do you make of all this what do you make of this tell me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.675,
    "end": 3519.217,
    "text": " Jeff, want to go first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.237,
    "end": 3519.918,
    "text": "Or I can go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.261,
    "end": 3522.962,
    "text": "Yeah, I can start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.583,
    "end": 3530.712,
    "text": "Um, my first thought is about perspective and triangulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.474,
    "end": 3539.364,
    "text": "I'm looking at looking at the first bit of slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.424,
    "end": 3540.866,
    "text": "Actually, I took some notes here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.886,
    "end": 3541.186,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.889,
    "end": 3544.29,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.317,
    "end": 3567.457,
    "text": " You know, from the first point of view, we have, you talked about explainability, and, you know, there are some tools that are out there from a modeling perspective that we can look at using, like SHAP and LIME for smaller, or for certain data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.5,
    "end": 3574.564,
    "text": "I think the conversation about deepfakes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.628,
    "end": 3578.553,
    "text": " definitely warrants expanding on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.573,
    "end": 3604.028,
    "text": "One of my research areas is dark patterns, which are deceptive user interface designs that people who create interactive systems intentionally place in these systems in order to take advantage of their users, primarily for monetary profit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.312,
    "end": 3605.695,
    "text": " but for other reasons as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.238,
    "end": 3610.164,
    "text": "Um, how about we start with that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.65,
    "end": 3614.373,
    "text": "Yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.714,
    "end": 3615.796,
    "text": "Do you want to talk about it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.798,
    "end": 3618.442,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.462,
    "end": 3620.166,
    "text": "Um, so dark patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.729,
    "end": 3623.232,
    "text": "Dark patterns are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.038,
    "end": 3625.54,
    "text": " very, very widely used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.521,
    "end": 3629.865,
    "text": "They have significant economic impact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3629.966,
    "end": 3638.276,
    "text": "There's an FBI report that came out of billions of dollars that are lost and time lost as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.476,
    "end": 3650.772,
    "text": "So the dilutive effect of people's attention being split is very corrupting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.87,
    "end": 3679.847,
    "text": " in terms of people's ability to engender meaning in their lives and that's you know we we're working on a a user study right now to see how dark patterns affect the elderly population uh you know retirement age adults um i hear some clicking some keyboard clicking daniel is that you no paula please mute paula please mute when you're typing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3680.418,
    "end": 3702.038,
    "text": " got some morse code coming through um yeah so dark patterns um they divert your attention away from what you could be optimizing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.338,
    "end": 3728.7,
    "text": " and we see dark patterns all around us and we see deception in nature all around us as well and it's not unusual uh deception is can often be a feature uh in survival zebras have stripes um you know many insects uh use mimicry and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.794,
    "end": 3734.621,
    "text": " Deception necessarily isn't a good or bad thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.681,
    "end": 3743.573,
    "text": "It has to do with the intent and the will of the participants in that behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.855,
    "end": 3758.113,
    "text": "That being said, we should absolutely optimize for wellbeing and wholesomeness and restoration wherever we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.713,
    "end": 3767.883,
    "text": " Another thing that I just took as a note here was your integration of optics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3768.464,
    "end": 3771.047,
    "text": "That is very interesting to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.087,
    "end": 3788.168,
    "text": "I've also been considering how the evolution of language and sight are essential to our embodied experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.857,
    "end": 3815.995,
    "text": " and how gravity curves space-time for example and how sound you know travels at a different speed of light and how we evolved you know like as life on earth we evolved um touch and then sight or that's excuse me and then and then hearing um and then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.713,
    "end": 3831.891,
    "text": " know smell and taste and then finally sight so that is that is i think something where there might be a correlation that can be explored",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.356,
    "end": 3852.114,
    "text": " Um, from the perspective of, uh, control systems and, um, deliberate sabotage within a system, uh, we, I just submitted a paper, actually 24 of us just submitted a paper, uh, to a venue that's exploring that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.495,
    "end": 3859.642,
    "text": "Um, and I believe that there is a way forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.743,
    "end": 3860.983,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.393,
    "end": 3873.529,
    "text": " And it's going to be very Kahnian in how we experience it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.931,
    "end": 3877.174,
    "text": "But I'm very hopeful because it's a bright future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3880.88,
    "end": 3886.228,
    "text": "Something else that I wrote down was that, you know, crucibles have dual functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3886.394,
    "end": 3896.591,
    "text": " And, um, you know, they both, they both provide the form and the heat and they burn off, uh, the, the, the dross of the re in the refinement process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.912,
    "end": 3903.222,
    "text": "So reframing some of these things as a more of a, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3904.552,
    "end": 3932.905,
    "text": " distillation uh could provide another perspective that might open up the door for uh alternative considerations um systemic aberrations um you know just like with cognitive pruning we have we have we must model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3933.205,
    "end": 3941.856,
    "text": " and embody and enact our experiences so we can make optimized choices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.419,
    "end": 3959.119,
    "text": "Um, so having, you know, having a system where you're allowed to make mistakes, um, or, um, perceived mistakes that are really just, um, life lessons, uh, with guard rails is healthy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3961.603,
    "end": 3961.963,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.943,
    "end": 3994.009,
    "text": " do you think paula or daniel i i just laid out a couple of things there for the last 15 minutes or so thank you i i appreciate and agree and would like to look more into everything that you said but i didn't understand about the last point the healthy guardrails could you explain what you mean there a bit more so that i understand you properly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3994.495,
    "end": 3995.276,
    "text": " Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.296,
    "end": 4008.44,
    "text": "So I think this goes in line with the POMDPs, the partially observable Markov decision processes that we use to model agents in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.782,
    "end": 4019.119,
    "text": "And when you're in a domain, an environment, and oh, you're clicking again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.078,
    "end": 4022.241,
    "text": " And Paula, we're getting some more work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.521,
    "end": 4023.723,
    "text": "You're sending secret signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.35,
    "end": 4030.752,
    "text": "Excuse me, Daniel, where was I at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.053,
    "end": 4033.755,
    "text": "palm dp in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.416,
    "end": 4035.898,
    "text": "Oh, palm dp is an active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.918,
    "end": 4036.158,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.879,
    "end": 4041.485,
    "text": "So partially observable Markov decision processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4043.107,
    "end": 4049.275,
    "text": "When you situate yourself in a domain, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.976,
    "end": 4062.028,
    "text": " you have a boundary that you're doing an information exchange on with that environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.229,
    "end": 4069.016,
    "text": "You are not aware of the environment that that domain is nested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.076,
    "end": 4080.409,
    "text": "So when you have a second order connection, it can cause confusion if you don't have a translation mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.659,
    "end": 4089.842,
    "text": " to be able to exchange information with a domain that you're not primarily connected to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.881,
    "end": 4120.504,
    "text": " okay but why okay this is like this i understand that um i would like to um argue so to say that a user of a system who has a second order connection with it should be made aware of this hierarchy as a matter of ethics and transparency so that's that is a compression problem",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.311,
    "end": 4145.327,
    "text": " um mathematically if i'm nested in a domain that uh for example i i'm a domain of of one and um i nest myself in a grid of uh 10 by 10 right and then i nest myself in a grid of a million by a million",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.214,
    "end": 4158.472,
    "text": " If I extend into that second domain without first completely solving or sufficiently solving that first domain, it's going to disorient me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.373,
    "end": 4160.916,
    "text": "And I'm going to be confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.016,
    "end": 4164.742,
    "text": "And I wonder if that maybe isn't the cause of some mental illness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.863,
    "end": 4170.15,
    "text": "Is that you don't have a... Oh, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.729,
    "end": 4173.89,
    "text": " It surely is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4174.35,
    "end": 4181.577,
    "text": "So I can see why you're framing this challenge, so to speak, mathematically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4183.098,
    "end": 4201.335,
    "text": "But from a systems design viewpoint, it needs to be, for me, the way I stand, unless it's adversarial, unless it's designed to confuse the user for whatever reason, then the setup should be declared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4201.754,
    "end": 4211.205,
    "text": " It should be saying, okay, you're here, and these are the levels you're operating in, and now what you're looking at is a level one, and that's where you are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.866,
    "end": 4217.272,
    "text": "And then you see, if you don't do that, you're, I think, abusing psychologically the user.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4217.332,
    "end": 4219.875,
    "text": "And so this is exactly the point that I insist on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.915,
    "end": 4228.065,
    "text": "I'm not necessarily expect you or others agree, depending what kind of system you're designing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4228.045,
    "end": 4232.892,
    "text": " But I'm glad you're picking up on the point exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4233.073,
    "end": 4239.122,
    "text": "And that is where I think there is a difference in the sense of what kind of system you're designing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4239.142,
    "end": 4245.191,
    "text": "Are you designing an adversarial system that you want to figure out how the user is moving, how they're thinking?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4245.211,
    "end": 4246.493,
    "text": "You're trying to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4246.81,
    "end": 4260.448,
    "text": " what process is going into the user's brain by putting them into a grid that they don't know anything about and they have to figure it out and that you can see how the user is moving and how they're thinking or perceiving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4260.949,
    "end": 4264.794,
    "text": "But that is absolutely not on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4264.914,
    "end": 4273.425,
    "text": "For me, when I get into a system, unless you're telling me beforehand, I'm experimenting, I'm testing things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.7,
    "end": 4284.39,
    "text": " the way your brain works, then I would say that is psychological abuse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.41,
    "end": 4297.446,
    "text": "Well, I absolutely agree with you that the experience, the embodied experience should be commensurate with your capabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4298.667,
    "end": 4300.189,
    "text": "May I ask a question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.03,
    "end": 4327.223,
    "text": " of course let me just say for me it should be commensurate to the terms of engagement okay so you to trick a user to use a system without telling them what the system does and how it does it is not on please go ahead with your question are you currently um an instructor uh for a class yeah sometimes i at the moment i am and i this is one of the things i do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.953,
    "end": 4331.695,
    "text": " Do you use multiple-choice tests?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.36,
    "end": 4342.067,
    "text": "It's not my favorite way of testing, not at all, for a number of reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4342.147,
    "end": 4347.013,
    "text": "But I know what you're suggesting, that could be a way of testing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.173,
    "end": 4350.797,
    "text": "It could be sometimes, but it's not my favorite at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4352.419,
    "end": 4357.345,
    "text": "How do you design your curriculum?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.025,
    "end": 4364.55,
    "text": " It depends on what the goal of the class is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.631,
    "end": 4374.362,
    "text": "Normally I set the intentions of what is this class for?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4374.422,
    "end": 4375.363,
    "text": "What is it trying to teach?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4375.383,
    "end": 4377.206,
    "text": "I'm very transparent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4377.606,
    "end": 4381.03,
    "text": "In fact, my tests are very intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4381.511,
    "end": 4385.796,
    "text": "I tell the students beforehand what I'm going to test them on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4386.282,
    "end": 4395.651,
    "text": " I said, this is the stuff you've got to learn, and this is the stuff I'm going to ask you to show me that you've understood or learned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4396.036,
    "end": 4401.122,
    "text": " And that is because that's because I'm, you know, some people told me that I'm a little bit vanilla.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4401.223,
    "end": 4402.564,
    "text": "And I am in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4402.584,
    "end": 4404.647,
    "text": "Yeah, I think that's essential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4405.408,
    "end": 4413.258,
    "text": "And I know that, you know, for example, those trick questions that people ask, I think they're like, designed to confuse the students.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4413.278,
    "end": 4416.782,
    "text": "They're really, I would not, I don't like them at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.685,
    "end": 4419.526,
    "text": "What classes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.626,
    "end": 4423.01,
    "text": "What classes do you normally teach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4423.03,
    "end": 4425.874,
    "text": "Mostly software engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.103,
    "end": 4452.57,
    "text": " and now i'm doing i'm doing some machine learning and algorithms so um would you like to give me an example of um what an expectation is for a student when they um complete one of your classes not now no i wouldn't okay um may i offer one as an example um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.36,
    "end": 4482.962,
    "text": " if i am taking a class and uh i'm expected to know basic commands in the linux shell right touch yeah uh things like that uh would you would you expect a student in your class uh after they finish your class to be able to um right right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.246,
    "end": 4485.871,
    "text": " right assembly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.891,
    "end": 4487.935,
    "text": "It depends who they are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4487.995,
    "end": 4503.465,
    "text": "If they're not the kind of classes I teach, I would hand them the cheat sheet and I would say, um, this is, these are the commands that you're supposed to be using and this is what they do and this is how they use them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4504.357,
    "end": 4506.599,
    "text": " Okay, so let's consider it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.919,
    "end": 4508.561,
    "text": "Are you familiar with the OSI model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.101,
    "end": 4511.163,
    "text": "Or maybe the internet model would be easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.203,
    "end": 4512.204,
    "text": "We can use either or.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4512.524,
    "end": 4516.387,
    "text": "No, but I would like you to go back to the original question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4517.308,
    "end": 4528.998,
    "text": "So I, you know, I'd like you to... I don't understand why you're asking me these questions in relation to the presentation, to the deviation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4530.659,
    "end": 4532.08,
    "text": "Perhaps you could clarify that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.301,
    "end": 4534.262,
    "text": "Well, it's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.445,
    "end": 4537.649,
    "text": " Consider this, if you will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.171,
    "end": 4546.742,
    "text": "We're talking about confusion and deliberately deceptive design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.666,
    "end": 4551.488,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.035,
    "end": 4558.478,
    "text": "If I am a parent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.635,
    "end": 4567.328,
    "text": " Am I going to give my child who has not yet gone through driver education keys to a car?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.553,
    "end": 4571.837,
    "text": "I don't know, but I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4571.857,
    "end": 4577.428,
    "text": "That depends on you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4577.989,
    "end": 4580.955,
    "text": "I give my five-year-old child keys to a car and let them drive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.285,
    "end": 4591.944,
    "text": " No, but I don't understand how that relates to the systemic deviation issues that we've been discussing in the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4591.964,
    "end": 4596.552,
    "text": "I don't understand why you're asking that question and how does it relate to systemic deviation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4597.715,
    "end": 4602.083,
    "text": "Daniel, could you help maybe provide some of your thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.725,
    "end": 4632.357,
    "text": " Yeah, I'm hearing a lot of pieces here like the stated intent of a system and then direct and indirect consequences of the system in an environment of nested interacting different cognitive systems and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.72,
    "end": 4657.635,
    "text": " cognitive deterioration but deterioration implies like some sort of prior more effective state so it's not always a simple deterioration just change in function leading to externalities and risks and all kinds of dangers and abuses which were brought up in the presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.615,
    "end": 4684.247,
    "text": " so then what i was just hearing in this sort of pedagogical direction is like from the micro to the macro like the multiple choice question or whatever you assess what you choose to say the intent of this course is to learn this like here's the level or the core screening at which the learning is is intended to happen at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.227,
    "end": 4703.586,
    "text": " and then there's the micro on down through the question and the way that it's presented on the page ordering of the test and all that on up through like the syllabus design and these higher order questions and so that's kind of like a scenario where we can explore systemic deviation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.123,
    "end": 4730.974,
    "text": " and think about how there's like educational experiences not not saying this what either of you said but where this all takes me is just there's uh a course archetype that could be imagined where the topic is presented and on all levels of analysis for the students in their own context it doesn't deviate from that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4730.954,
    "end": 4760.877,
    "text": " on through educational experiences that can be putting people back and putting them down and leaving them in a in a worse situation for any number of reasons thank you thank you daniel let me just say that i appreciate because i think you're contextualizing jeff's questions so so that i can understand what he was getting at better and i must say that i haven't um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4761.717,
    "end": 4768.849,
    "text": " analyzed in depth how systemic deviation applies to education and learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4768.869,
    "end": 4772.655,
    "text": "But it's something that you're putting ideas into my head, I can look at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4774.278,
    "end": 4786.999,
    "text": "But to your last point, the consequence is very often can be that the student is put off the subject for good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4787.57,
    "end": 4813.982,
    "text": " so you may have um so i can see how it's a first it depends on the education style what kind of teacher are you and i have had what i consider a good teacher is the one that leads me to the love and the appreciation of the subject and they do so by providing me with the self-confidence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.536,
    "end": 4817.623,
    "text": " Yes, it's a constructivist approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.064,
    "end": 4820.37,
    "text": "You can tell the student, yes, you can understand this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4820.751,
    "end": 4824.159,
    "text": "If you don't understand it this way, I can explain it to you another way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4824.941,
    "end": 4827.106,
    "text": "And if you cannot understand it, it doesn't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.146,
    "end": 4829.592,
    "text": "You can always understand the next thing or another thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4829.652,
    "end": 4831.937,
    "text": "And you can still figure out the subject in the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4832.879,
    "end": 4839.452,
    "text": " But there's also teachers who will just throw you at the deep end of the subject and let you swim out of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.532,
    "end": 4843.56,
    "text": "Either you survive and pass the test or you fail the subject.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4844.582,
    "end": 4852.858,
    "text": "And that's the kind of teachers that I don't consider good teachers at all because let me as well not go to that class.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4852.938,
    "end": 4855.343,
    "text": "I'm not learning anything other than",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4855.323,
    "end": 4858.749,
    "text": " survive to the subject without any help.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4859.47,
    "end": 4862.115,
    "text": "In fact, it can be a traumatic experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4862.135,
    "end": 4873.896,
    "text": "And I don't know if this is addressing your point, Daniel, but a lot of learning experiences can be traumatic psychologically and impair the learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4874.517,
    "end": 4878.765,
    "text": "I don't know if you agree or if you have experienced that, but I have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4880.078,
    "end": 4899.353,
    "text": " Yeah, that speaks to these sort of first and second order consequences and also to the disentangling and the sort of challenges of intentionality, which is like deviation or aberrance implies that there would be some non-deviated...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.333,
    "end": 4913.292,
    "text": " non-aberrant form so it's like what is the true form of something what how does intention what are situations when when natural systems just are the way they are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.824,
    "end": 4936.815,
    "text": " And then that takes on a special relevance when moving from just the consideration of some sort of morphological phenotype into cognitive phenotype and social systems design where the degrees of freedom and the updating can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.15,
    "end": 4948.29,
    "text": " wildly fast and with these current ai synthetic intelligence systems etc there's the possibility for systems that have opaqueness like we've never seen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.439,
    "end": 4978.429,
    "text": " and rule updating, pattern updating that could for example like accelerate language change to a pace and a tempo and a mode that would be unrecognizable or lock in language to an attractor from some specific past and even those modes could be switching so it's like the control levers are so powerful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.848,
    "end": 5008.163,
    "text": " and they can be moved very quickly with very little notice all presented in the case of technology like that pretty cleanly through a trusted device so that opens up really important considerations yes and to that you see language for me it's uh must be explicit how do you say you must communicate okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.97,
    "end": 5031.298,
    "text": " The moment it becomes, it mutates, it's transformed into a new formalism that only the speaker or the system understands and the other people because they don't have the code or they haven't evolved the understanding and cognition in the same way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.616,
    "end": 5057.455,
    "text": " um they don't understand it then it fails that's the system where the systemic failures occurs right so unless you if you're designing if you're speaking a language uh if you're sending out information uh in me for a purpose of communicating it then it needs to be very clear and uh unfortunately because it is technologically so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5057.857,
    "end": 5061.862,
    "text": " interesting to see how it can actually happen otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5062.403,
    "end": 5066.128,
    "text": "How can you design a system to start speaking in its own language?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5066.168,
    "end": 5074.639,
    "text": "It's very interesting and it's fascinating and it's pushing the technology boundary, but does it still communicate the original concept?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.859,
    "end": 5079.446,
    "text": "And at some point, nobody knows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5080.026,
    "end": 5083.611,
    "text": "Certainly, there is no way of verifying that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5083.591,
    "end": 5086.117,
    "text": " And for me, that is a critical failure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.838,
    "end": 5089.825,
    "text": "That's where the critical failure can happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5089.865,
    "end": 5092.931,
    "text": "And as you said, we need to be careful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5093.312,
    "end": 5094.194,
    "text": "Is that what we want?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5094.835,
    "end": 5097.381,
    "text": "Or is that what we want to be guarded against?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5098.492,
    "end": 5120.77,
    "text": " yeah and i know that you are continuing to explore active inference and think about different ways it connects but that notion of a free energy measure which bounds surprise where surprise is like the information theory converted value of the prediction error or the deviation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5120.75,
    "end": 5149.761,
    "text": " so it's like rather than training some reward function and taking system state mapping it to a reward function like some ranked score and saying better or worse and then that reward function how did you get it is it out of date etc rather than going through that intermediary accessory ranking system it's possible to work directly on the information space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5149.96,
    "end": 5177.267,
    "text": " of the expected behavior of the system like working on body temperature and reducing surprise about going out of your homeostatic body temperature range rather than needing to translate body temperature to a reward distribution and then map back to a behavior choices so it's it's interesting to think like what are the green light yellow light and red light for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.247,
    "end": 5199.627,
    "text": " systemic deviation and you in the presentation laid out many many social and technical domains where people sort of people um bring things up and they and at the very least they deserve to be heard and considered",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.184,
    "end": 5217.247,
    "text": " Now, I have to admit that as I have in a shorter video that I have very limited understanding of active influence and free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5217.949,
    "end": 5225.461,
    "text": "But as I interact with you guys, I'm kind of learning more and taking the chance to read more and listen more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5226.042,
    "end": 5228.466,
    "text": "And so this surprise thing, you see,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.003,
    "end": 5237.772,
    "text": " I don't know how many of you maybe not like surprises at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5238.293,
    "end": 5251.186,
    "text": "There is a whole section of the population which they have to create a category called autistic and they now go around wearing the labels and say, hey guys, I'm autistic, I don't like surprises.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5251.766,
    "end": 5255.23,
    "text": "Okay, surprises is gonna throw me off",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5255.918,
    "end": 5281.234,
    "text": " my balance and it's going to make me reject the whatever is being proposed because it creates an emotional imbalance so uh some of us like to um follow be able to predict or at least cope or how do you say modulate our internal responses and i don't understand this thing about mechanism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5281.872,
    "end": 5283.114,
    "text": " surprise mechanism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5283.595,
    "end": 5296.716,
    "text": "Is it supposed to be, in the free energy principle, is surprise something that is, is it describing something that you think happens in everyone?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5296.736,
    "end": 5299.601,
    "text": "Or is it supposed to be good?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5299.901,
    "end": 5303.246,
    "text": "Or could you want to say a few words about this surprise thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5303.287,
    "end": 5306.091,
    "text": "Because surprise doesn't sound good to me, you know?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.51,
    "end": 5335.909,
    "text": " sure yeah there's a ton ton to say on this a sort of contextualizing historical note is a lot of terms from psychology made their way into statistics like belief learning surprise and now statistics is being used to map back onto computational cognitive science and so we get into this situation that's like surprise as a general concept",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5336.007,
    "end": 5355.366,
    "text": " in the information theoretic sense does not need to apply to a given human's experienced or conversational everyday sense of like that was a surprising event though that's a case of surprise when we're talking about the information theory quantity of surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5355.835,
    "end": 5377.607,
    "text": " it's more about how likely or unlikely a given observation is and so if somebody says like just to give an example i'm the kind of person who loves being surprised and they're talking about what they have for dinner then at a sensory level there's a surprise associated with that new dinner",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.722,
    "end": 5382.488,
    "text": " But at the level of narrative or self-identity, they're confirming their identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5383.289,
    "end": 5393.741,
    "text": "So it gets a bit specific and multi-layered when applying concepts to human psychological constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.762,
    "end": 5401.35,
    "text": "But in the general case, no, surprise has nothing to do with the felt sense of any given person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.798,
    "end": 5409.453,
    "text": " But in terms of cognition, this is more like a request or suggestion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5409.573,
    "end": 5419.896,
    "text": "So as I look into active influence and free energy, a lot of the constructs I come across when I do the reading",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5420.77,
    "end": 5449.191,
    "text": " they seem to be kind of given you know and here there is a surprise factor but they're not really explained for me for for the people who don't have the background i mean i don't really understand what you're talking about so and a number of other things which for me are not very clearly or not simply enough so to speak exemplified as you're doing now with examples with the example of the dinner now when you talk about a simple example of the dinner",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5450.487,
    "end": 5478.655,
    "text": " it's like i don't mind being surprised at dinner i don't care i'm happy to be surprised where i there are certain situations however where surprise is not on um like so i mean there's looking at the surprise factor i i i am right about it in terms of cognition so where does your how does your brain respond to certain um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5480.255,
    "end": 5509.148,
    "text": " cognitive events and then I didn't quite grasp where did the surprise come in so and how and I'm afraid in terms of psychological abuse that surprise is used as a tactic to disorient that what worries me most so I don't know exactly how surprise is fit into the whole of the active influence and free energy thing and I haven't looked at it enough but as I managed to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5510.579,
    "end": 5529.364,
    "text": " to probably hopefully summarize enough in a few lines saying if i don't think the brain can be um i don't think the mind rather can be represented by a model of base and brain then everything else",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5529.783,
    "end": 5532.326,
    "text": " is a speculation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5532.526,
    "end": 5550.286,
    "text": "So I mean it's interesting that you see it that way and that you can work with things that I'm not particularly understanding but maybe that doesn't explain or explore the cognitive models that I am interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5550.346,
    "end": 5559.756,
    "text": "So I don't know whether I should be putting too much time trying to understand something that from what I see is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5559.736,
    "end": 5582.082,
    "text": " has not not not sufficiently meaningful for for what i'm looking at however if you decide that you wanna explain the surprise in active influence for everyone else to understand uh and then i think you know maybe i can help you because i am the kind that i can probably help you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5582.686,
    "end": 5612.592,
    "text": " make it very clear what is it that is not clear uh so and maybe that could help others i don't know but this surprise thing and this free energy um uh from the materials that i've read it's it's a little bit like you know you're throwing the the river or the the newcomer into the deep end of something that they don't understand you know what what's going on in that thing so um uh how many people are using active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5615.086,
    "end": 5622.784,
    "text": " Are there any expectations or projections as to where active influence and free energy are going?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5623.557,
    "end": 5648.772,
    "text": " yeah these are all good questions i don't have some specific number but but yeah i think if you keep exploring and there's different kinds of prospectuses that are written for different domains like robotics neuroscience etc and then there's sort of our prospectus from an open science and participation angle what we've done in the space and how people are getting involved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5651.232,
    "end": 5666.322,
    "text": " so yeah i mean if i if you for example had to say paula i want you to pass an exam in active inference okay the minimum entry level for active input and free energy i want you to be able to understand what it is and answer my questions okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5667.01,
    "end": 5670.978,
    "text": " And I don't have unlimited resources to read everything about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5672.0,
    "end": 5677.09,
    "text": "So I will have to go and search for the main concepts in the resources that you give me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5677.671,
    "end": 5683.202,
    "text": "What I think I haven't seen yet is the cheat sheet for active influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5683.843,
    "end": 5685.486,
    "text": "And that's what I would like to see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5685.506,
    "end": 5688.512,
    "text": "If you want me to speak more intelligently about it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5688.88,
    "end": 5700.46,
    "text": " and and if you don't have one and if you would think it could be useful i'd be happy to help devise a cheat sheet for active insurance energy but i don't know whether what i produce would",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5700.811,
    "end": 5706.381,
    "text": " satisfy the entire universe of this field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5707.042,
    "end": 5709.767,
    "text": "And in fact, I don't understand where is it going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5710.047,
    "end": 5719.123,
    "text": "So for example, from an engineering viewpoint, I would like, I've seen these equations, okay, these equations, and I looked at the equations and I said, okay, what does it do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5719.728,
    "end": 5722.954,
    "text": " What problem does it solve?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5723.255,
    "end": 5731.651,
    "text": "What does it do that if I didn't use active inference, if I didn't use this equation, how would the outcome of the system be different?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5732.132,
    "end": 5742.192,
    "text": "So this is what you may want to, if you want to speak to people like me, you may want to simplify the field to answer more pragmatic questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5744.011,
    "end": 5761.75,
    "text": " yeah question paula yeah sorry just yeah jeff go for it and just sort of in our last closing section go for it though when was the last time you sneezed or me you yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5762.05,
    "end": 5788.277,
    "text": " me i remember i'm funny enough i remember because i don't sneeze that often and i mean i don't remember precisely whether it was today or yesterday but definitely today or yesterday i sneezed do you know what made you sneeze",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5788.898,
    "end": 5813.927,
    "text": " so sneeze is another one of those complex things but i think it was a slight exposure to a temperature colder temperature than the what was in the room like a little current or drops i mean i always know why i'm sneezing i'm not sneezing because there is a cold draft",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5814.059,
    "end": 5828.136,
    "text": " or because there is some uh irritant agent in the in the that i'm breathing in there is one of the two what about you jeff when did you sneeze last uh yesterday",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5828.757,
    "end": 5851.255,
    "text": " um i sneeze when i when i get when i get interesting ideas uh it's called the photon whenever i see the sun when i are a change in in light temperature i sneeze um my point being is that you know there's all these all these um embodied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.488,
    "end": 5875.42,
    "text": " reactions that we have that are surprise right when you get goosebumps when you sneeze when you have muscle soreness when somebody tickles you when you laugh when you cough when you itch when you have a stomach ache when you have diarrhea when you pass gas right all these things are signals that we don't we are not primary causal observers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.822,
    "end": 5878.224,
    "text": " they have to be translated through a mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5878.304,
    "end": 5887.192,
    "text": "And we have this embodied agency to be able to understand that there is signal, even if we can't interpret it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.835,
    "end": 5891.255,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5895.039,
    "end": 5901.444,
    "text": "And I think that's a good place to leave it at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5901.604,
    "end": 5904.867,
    "text": "I think that's a very human...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.977,
    "end": 5934.567,
    "text": " explanation of surprise surprisal and active inference daniel thank you both for the discussion paula thanks for the the sharing of your learnings and perspectives i look forward to continuing to explore systems and deviations thank you very much for the opportunity to share nice meeting you guys nice to meet you",
    "speaker": "SPEAKER_00"
  }
]