[
  {
    "start": 7.017,
    "end": 31.725,
    "text": " hello and welcome it's september 9th 2024 this is active inference art stream number 3.1 with diana omegi talking about curious sounds prediction and the human drive to engage with music there will be a presentation and then we'll read some comments and questions from the live chat so thank you diana for joining and looking forward to your presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.595,
    "end": 36.782,
    "text": " Thank you, Daniel, for the invitation and to everyone who's joined today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.843,
    "end": 42.716,
    "text": "I'm a senior lecturer and researcher at the University of London.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.756,
    "end": 51.216,
    "text": "And today I'll be talking, giving a talk that's entitled Curious Sounds, Prediction and the Human Drive to Engage with Music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.415,
    "end": 57.264,
    "text": " And the reason I chose this title was because I recently came across this statistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.466,
    "end": 66.718,
    "text": "The International Federation of the Phonographic Industry do a report every year where they say how much the average person listens to music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.938,
    "end": 70.103,
    "text": "And it turns out it's about 20.7 hours a week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.305,
    "end": 80.038,
    "text": "So if we assume that people get about eight hours of sleep a night, then we're looking at about a fifth of our waking hours that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.018,
    "end": 82.023,
    "text": " the average person is listening to music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.103,
    "end": 91.125,
    "text": "And it struck me that there's a really interesting question here, which is what is behind this drive to engage with music at this scale?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.185,
    "end": 97.099,
    "text": "And so what I'd like to do in today's talk, partly because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.079,
    "end": 102.206,
    "text": " I wasn't quite sure who would be attending, but I assumed it would be people with lots of different backgrounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.366,
    "end": 114.103,
    "text": "And yeah, what I decided to do was just present a little bit about what neuroscientists have been finding out about the neural substrates of music perception and pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.603,
    "end": 118.208,
    "text": "We might assume that has something to do with why we choose to listen to music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.49,
    "end": 126.58,
    "text": "I then want to talk for a few minutes about what the predictive processing framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.56,
    "end": 137.818,
    "text": " could explain to us or tell us about why it is that our attention towards stimuli might change over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.052,
    "end": 151.793,
    "text": " and finally use what we've learned from neuroscience, from the predictive processing coding framework to present a model basically of the dynamics of extended engagement with music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.314,
    "end": 161.528,
    "text": "So that's a piece of work that was published earlier this year and which I'm keen to share with interested parties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.508,
    "end": 171.197,
    "text": " Let's think about music perception and the things that we do without even realizing how powerful these things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.457,
    "end": 174.94,
    "text": "So we can spot wrong notes in music that we're hearing for the first time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.0,
    "end": 181.686,
    "text": "By wrong, I mean notes that were clearly not intended by the performer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.726,
    "end": 184.949,
    "text": "We can say whether two melodies are the same or different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.029,
    "end": 191.515,
    "text": "Again, hold pieces of sequences of pitches and rhythms in our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.495,
    "end": 193.119,
    "text": " memory and compare them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.448,
    "end": 201.255,
    "text": " We can recognize familiar pieces, even if they've been played differently, different lyrics, different instruments, and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.756,
    "end": 206.36,
    "text": "And we can correctly predict how a piece of music we've never heard before might unfold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.38,
    "end": 209.944,
    "text": "We might be able to sing along to it, even if we're hearing it for the first time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.984,
    "end": 217.873,
    "text": "And naturally, people have come up with ideas as to what's going on, why this is all possible, how this is all possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.473,
    "end": 222.177,
    "text": "For example, in this model published in 2018,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.157,
    "end": 249.43,
    "text": " 03 the idea was this acoustic input comes in undergoes some analysis inevitably gets separated out and so it's sort of pitch components and temporal components that you know undergo further processing these interface with some store of musical phrases and patterns that we've experienced in the past and so on and so forth but of course this is a sort of box and arrow model of what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.827,
    "end": 273.223,
    "text": " make sense as you know series of processes when we look at the brain we're looking at a network of connections between subcortical structures the auditory cortex so-called belt and power belt areas around the auditory cortex and we're looking beyond that we're looking at sort of more frontal parts of the brain that we know are involved in some of the more complex functions that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.203,
    "end": 302.35,
    "text": " um we're able to do as humans and what's interesting is that when it comes to something like pitch perception which um is obviously a very important part of processing music in lots and lots of different cultures we see that the electrophysiological responses to pitch in this case measured intracranially are very much in line with the principles of predictive coding in other words it's been shown that early tonotopic structures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.33,
    "end": 312.26,
    "text": " feed information about frequency to later areas where we seem to have this abstract model of pitch being formed and predictive signals being sent back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.3,
    "end": 315.964,
    "text": "So we're seeing something as fundamental as just determining what pitch we're hearing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.984,
    "end": 329.518,
    "text": "Not something as fundamental, not surprising, something as fundamental as pitch perception seeming to have this, follow this predictive coding principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.928,
    "end": 337.736,
    "text": " Most of us can do lots of things with music, recognize it, discriminate pieces of music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.057,
    "end": 343.124,
    "text": "Not everybody is able to do these everyday tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.305,
    "end": 355.202,
    "text": "So for over now 200 years or almost 200 years, there have been reports or just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 355.182,
    "end": 383.991,
    "text": " papers about what we now call congenital amusement sort of difficulty making sense of music that can manifest as difficulty discriminating melodies and recognizing um melodies that should be familiar all those things i said we do so naturally um and it's not surprising that when this was begun to be researched in the early 2000s that um that it was considered perhaps a disorder of fine-grained pitch discrimination some of the tasks suggested that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.971,
    "end": 404.41,
    "text": " um the individuals who had it um were struggling to say whether a pitch had you know changed if it was not a very large interval that was being presented however as more work came out suggesting that this could um that people with generally musia may also have difficulties um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.39,
    "end": 419.803,
    "text": " for pitch memory or with pitch memory, the question that arose is whether there might be a more general mechanism that's sort of compromised or in this condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 420.344,
    "end": 424.272,
    "text": "And so that was one of the questions I was asking during my PhD",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.252,
    "end": 438.745,
    "text": " in the late 2000s, where I was lucky to be at the same institution as Marcus Pearce, who'd developed this statistical learning model of musical expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.265,
    "end": 454.258,
    "text": "So it's a statistical learning model, which means that it learns from the regularities in the corpus of music you give it, and a piece of music as it unfolds, and is able to spit out these values for any given event in that piece of music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.238,
    "end": 463.258,
    "text": " information content, how surprising an event, a note should be to a listener, about what that incoming note will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.298,
    "end": 469.311,
    "text": "And using this model was able to sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.291,
    "end": 487.812,
    "text": " quantify the surprise in every single note that we were presenting, in the melodies that we were presenting to our participants with Amusea and participants without, and were able to show that Amusex were showing less evidence of sort of prediction error signalling in response to the notes in these melodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.955,
    "end": 497.323,
    "text": "Further work later on from different labs corroborated this using",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.303,
    "end": 504.251,
    "text": " dynamic causal modeling on MEG data showing that there was indeed this abnormal prediction error from auditory to frontal areas in those with amusia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.312,
    "end": 514.582,
    "text": "It was shown that if you looked at resting state activity, the degree of connectivity between frontal and temporal areas was much reduced in those with amusia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.263,
    "end": 523.412,
    "text": "And again, around this time, it was coming out that if you look to the structural connectivity, the bundle of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.392,
    "end": 549.973,
    "text": " axons that binds the temporal and parietal cortex to inferior frontal areas then there was also this there was a compromise in the structure or integrity of um of this bundle of axons suggesting that there was um some sort of under connectivity between the frontal and temporal areas um superior temporal and frontal areas of the brain and in musics and that this might be materializing or manifesting um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.953,
    "end": 553.619,
    "text": " in abnormal prediction error signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.659,
    "end": 556.523,
    "text": "This is work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.704,
    "end": 571.186,
    "text": "I mean, this idea of STG and IFG needing to communicate for predictions and prediction error signaling was something that was being more and more supported than just typical listeners in the range of electrophysiology and also fMRI studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.949,
    "end": 575.353,
    "text": "But since, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.333,
    "end": 583.301,
    "text": " those 20 years ago, there's been yet more studies showing that it's not just those areas that seem to be tracking prediction error or showing prediction error-like responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.082,
    "end": 601.999,
    "text": "We see that areas like the insular cingulate gyrus and insula are also tracking the information content or surprise of musical events, which is a nice explanation for why these kinds of events, surprising events, can lead to physiological arousal and more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.705,
    "end": 606.17,
    "text": " and more visceral engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.891,
    "end": 618.588,
    "text": "And yeah, in other work that we've done, we've shown that, again, the size of the prediction error response is reflected, in this case, reflected in pupil dilation response, is even modulated by the entropy of the musical context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.668,
    "end": 625.377,
    "text": "So it mattered whether or not what someone was listening to was very predictable or not, whether they would show a prediction error response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.838,
    "end": 627.16,
    "text": "And those of you who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.14,
    "end": 633.093,
    "text": " into active inference will know that this sounds a lot like sort of precision waiting happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.759,
    "end": 638.124,
    "text": "Just a couple more words about music perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.164,
    "end": 642.093,
    "text": "When we're listening, we come with lots of different backgrounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.113,
    "end": 645.3,
    "text": "Some of us or some people have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.546,
    "end": 672.739,
    "text": " know musical training and therefore sort of musical expertise they may or may not even have know how to play the piece that they're listening to and in this study for example it was shown that when a musician was listening to a piece that they'd just learned compared to when they hadn't learned it before or compared to when someone who didn't know how to play the piece was listening you saw this frontal parietal motor related network being activated just speaking to the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.719,
    "end": 681.273,
    "text": " musical perception isn't just the processing of the acoustic information, but seems to implicate or recruit areas involved in movement and motor planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.874,
    "end": 693.512,
    "text": "And just to point out that, yes, it's always the case, or is very often the case, that musicians will show more of this activity, but most listeners, when they are listening to a piece of music, will show engagement with these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.492,
    "end": 696.282,
    "text": " sensory motor areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.764,
    "end": 704.413,
    "text": "And that was just to prepare you for this idea that's coming out or has been around for a while even.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.608,
    "end": 725.254,
    "text": " that music perception involves two pathways, much like speech and language perception involves two pathways, a so-called ventral stream or pathway, where core auditory areas move their information towards more and through frontal areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.723,
    "end": 750.162,
    "text": " allowing the formation and storage of sound patterns that can then allow the registration of expectation violations and a more dorsal stream involving the parietal and premotor dorsal-lateral prefrontal cortices allowing the temporal and motor manipulation of information that's been stored in working memory and allowing predictions but not about what one is going to hear but rather about when one is going to hear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.142,
    "end": 751.083,
    "text": " to hear it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.163,
    "end": 752.745,
    "text": "So it was a bit more temporal predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.626,
    "end": 767.003,
    "text": "And now just switching to, you know, to say a few words about musical pleasure and what the sort of body of neuroscientific literature is saying about this, what it's, you know, what people have done in this area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.043,
    "end": 776.875,
    "text": "I'd say most of the work has come from the lab of Robert Sartore and McGill University in Canada, where in a very important and seminal study,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.855,
    "end": 804.533,
    "text": " a PhD student named Valerie Salenpour, they showed that when we experience chills, these very pleasurable physiological arousing experiences of pleasure during music listening, when we experience them, we see activation of the so-called ventral striatum of the dopaminergic network, whereby the sort of anticipation of this chills",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.513,
    "end": 831.904,
    "text": " um sorry whereas the anticipation of the chills experience recruits this um other part of the striatum which is the dorsal sprays and so in effect showing that um that the experience of chills is um or pleasure during music um is recruiting in rewarding areas but in actually quite nuanced ways and that separates out the anticipation from the actual experience um so those were that was a study where they got people to say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.884,
    "end": 839.652,
    "text": " what moments and what pieces of music they experienced these very pleasurable and physiologically arousing moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.732,
    "end": 860.153,
    "text": "But in yet another study where they presented people with music that they'd never heard before, they were still able to show that the pleasure people reported in response to that music was explainable by how much connectivity they were seeing between the superior temporal gyrus and the ventral striatum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.133,
    "end": 867.362,
    "text": " And so they really stress the importance of this connectivity when we're talking about musical pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.402,
    "end": 879.556,
    "text": "One way to see whether this holds true is, of course, to find people who really don't experience pleasure in response to music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 880.097,
    "end": 883.081,
    "text": "And hedonia means lack of pleasure and not experiencing pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.101,
    "end": 890.089,
    "text": "And it's associated with depression and other sort of conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.137,
    "end": 904.22,
    "text": " around the early 2010s, these colleagues showed that there might be some people out there who have normal reward responses or find lots of things in life rewarding, but just not music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.961,
    "end": 914.136,
    "text": "And so these people with so-called music-specific anhedonia seem to be able to recognize and understand music, discriminate melodies, predict what's going to happen next, but they fail to enjoy it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.116,
    "end": 924.547,
    "text": " And what they were able to show was that, indeed, these individuals would show normal responses to secondary rewards, physiological arousal to secondary rewards like money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.167,
    "end": 942.705,
    "text": "But indeed, when they were exposed to moments in music that should, for most people, be experienced as very chillsy and very pleasurable and quite arousing, they were able to show that Anne Hedonia just didn't show those kinds of responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.867,
    "end": 964.457,
    "text": " And importantly, they were able to show that when they looked at connectivity between the STG and ventral striatum, that indeed this connectivity was much reduced for those with anhedonia compared to those with regular listening levels of pleasure and those who really love music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.513,
    "end": 993.263,
    "text": " Just to say that in one case study published a year after this functional connectivity study, they showed that someone with severe case of musical anhedonia showed much reduced connectivity between the superior temporal diuresis and the NACC, corroborating this idea that the connectivity between these areas is important for reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.378,
    "end": 1017.36,
    "text": " last but not least on the topic of pleasure um you know and yes another way of um testing whether um this you know this network or you know that i've been describing is is important for music listening um is to show that within a given individual you can kind of turn off and on the pleasure they experience from music and again work from um the very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.34,
    "end": 1031.097,
    "text": " productive tutorial lab showed that if you stimulated the LPFC, which is believed to stimulate the striatum, then you'll show, then, yeah,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1031.853,
    "end": 1054.974,
    "text": " the excitation of this, the excitatory sort of protocol would lead to greater liking, willingness to buy a piece of music that's just been heard and increase in the arousal demonstrated, where conversely inhibiting that pathway to reducing striatal activity seems to reduce pleasure and willingness to buy that piece of music you just heard and the physiological responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.655,
    "end": 1061.1,
    "text": "They were also able to show that when you put people in the scanner immediately after sort of, or around the time they'd",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.08,
    "end": 1067.727,
    "text": " just had this transcranial magnetic stimulation applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.787,
    "end": 1086.468,
    "text": "Yes, it was the way to show that the degree of connectivity between right auditory cortex and ventral striatum, again, just this auditory cortex reward area connectivity predicted the extent to which they had shown enhancement of pleasure from TMS excitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.488,
    "end": 1088.59,
    "text": "In other words, showing this link between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.447,
    "end": 1102.884,
    "text": " confirming that the LPFC was probably stimulating striatum, which was leading to more or less connectivity with the STG, which was leading to more or less pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.904,
    "end": 1116.501,
    "text": "But just to round this section of my talk up, what I've tried to do is show that when we're listening to music, the acoustic input is going through a series of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.481,
    "end": 1121.458,
    "text": " areas that are carrying out processing at very different stages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.619,
    "end": 1128.583,
    "text": "And especially when we get to sort of the inferior frontal gyrus and superior temporal gyrus, we're looking at, we're seeing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.897,
    "end": 1146.792,
    "text": " um the neural substrates of prediction um predictions and prediction error signaling and this seems to be compromised in those within musia and that might explain the wide-ranging difficulties with music when we come to speaking about pleasure um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.772,
    "end": 1154.543,
    "text": " Inevitably, people speak about the role of the auditory system and its capacity for prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.563,
    "end": 1171.588,
    "text": "But they point out that most important is more important, say, even than the STG and the frontal area connectivity is the temporal areas involved in auditory processing and the reward areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.648,
    "end": 1175.293,
    "text": "And this seems to be compromised in those who report much reduced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.273,
    "end": 1176.759,
    "text": " pleasure from music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1177.603,
    "end": 1181.098,
    "text": "And I can really recommend a book called",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.939,
    "end": 1208.335,
    "text": " what it's called but it was published by Satoru in 2024 where he does a really lovely overview of the work that's come lots of work has come out of his lab and several labs around the world trying to understand you know put together what we know about music perception how that sort of interfaces with pleasure and beginning to tell us a story around the role of prediction here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.315,
    "end": 1219.735,
    "text": " But just to say that my interest has always been trying to think about music listening as more than just emotions or pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.775,
    "end": 1225.885,
    "text": "These are obviously things that are very important to us, but I've always had this desire to understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.865,
    "end": 1227.988,
    "text": " the temporal dynamics of our engagement with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.168,
    "end": 1244.032,
    "text": "And studies have shown, and these have only come out since I've been pondering this, that as with many activities, we will mind-wander a large proportion of the time that we think we're doing that activity, in this case music, listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.192,
    "end": 1253.526,
    "text": "And for most tracks, our engagement with a piece of music will wane or just drop by quite a bit within a few seconds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.506,
    "end": 1257.733,
    "text": " it's clear that music can attract our attention, it can keep us listening, but it can also lose us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.535,
    "end": 1260.699,
    "text": "Sometimes it will attract our attention again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.799,
    "end": 1265.667,
    "text": "And the question is, when and why are we listening and when and why are we not listening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1265.687,
    "end": 1273.962,
    "text": "And I thought this is where predictive coding framework and active inference could maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.942,
    "end": 1277.409,
    "text": " help us, you know, further our thinking on this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.809,
    "end": 1289.031,
    "text": "And so just to sort of talk about music listening and the dynamics of, well, talk about the dynamics of potential engagement in these terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.011,
    "end": 1305.528,
    "text": " If we think about the auditory system and engagement in the auditory realm, then, well, in general, predictions in the predictive coding framework are set to ascend this hierarchy that make for better models that in turn allow us to make better predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.028,
    "end": 1319.001,
    "text": "And the auditory system, this is, you know, prediction errors ascending from the thalamus to the auditory cortex, where posterior expectations, you know, are influenced by prediction errors and send predictions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.981,
    "end": 1321.706,
    "text": " that further inform these prediction errors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.187,
    "end": 1332.124,
    "text": "So there's this sort of low-level processing of the information that's coming in as we listen to anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.265,
    "end": 1341.04,
    "text": "But I think what's nice is that the predictive processing framework acknowledges that we're not, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.083,
    "end": 1348.977,
    "text": " always providing that same amount of attention to every incoming stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.078,
    "end": 1356.874,
    "text": "And in this framework, there's an explanation of where and how attention happens, why it's deployed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.914,
    "end": 1359.72,
    "text": "And the idea is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.7,
    "end": 1372.934,
    "text": " any agent will look at how reliable the data that's coming in is in order to see whether they should use that data in their inferential processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.635,
    "end": 1375.817,
    "text": "This is known as precision weighting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.937,
    "end": 1385.067,
    "text": "It's meant to be carried out by these neuromodulatory cells that are different from the cells that are carrying out the actual transmission of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.215,
    "end": 1405.057,
    "text": " predictions and prediction errors but simply put attention is seen as this sort of deployment of high precision or confidence in the beliefs about how observations are related to our actual states and it's said to enable us and what we hear to more greatly influence our predictions and the interpretation of the heard sounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.138,
    "end": 1414.547,
    "text": "People have begun to look at this idea of precision weighting and the extent of a prediction error and the extent to which it can be seen in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.152,
    "end": 1442.745,
    "text": " uh neural data when people are listening when people have varying levels of expertise and therefore with different generative models of the music they're hearing when you know when they're listening um what's happening when they're listening to pieces of music that are very predictable versus less predictable and they begin begun to be able to show that indeed the connectivity within the auditory cortices within stg um are reflecting um this idea of precision waiting where you're able to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.725,
    "end": 1450.174,
    "text": " basically upweigh or provide more gain on the neurons that are processing incoming information or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.457,
    "end": 1456.322,
    "text": "Of course, there are moments we're attending, but there are moments where we're not attending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.362,
    "end": 1462.891,
    "text": "And here as well, the literature coming out is suggesting that there are ways to account for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.971,
    "end": 1472.563,
    "text": "So the role of opaqueness has been suggested to be quite important in the meta-awareness of our attentional states, where a status has to be opaque.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.543,
    "end": 1488.595,
    "text": " when its underlying processes can be attended to or is visible to conscious awareness as such if you talk about opaqueness and attention and meta-awareness so attentional states are the second order states that allow first order states to become opaque whereas meta-awareness and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.115,
    "end": 1495.265,
    "text": " is the sort of third or state above attention that allows us to, allows attentional states to become opaque.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.786,
    "end": 1511.072,
    "text": "But generally the idea is that meta-awareness is possible thanks to sort of more deep generative models where you have this higher level that's modulating the opaqueness of our attentional states and allowing us to distinguish when we're attending to the sensory stimulus or compared to when we're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.052,
    "end": 1516.524,
    "text": " And if we realize that we're not attending, we might want to take mental action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.306,
    "end": 1530.715,
    "text": "And this has been described as possible or inevitable, thanks to this imperative, active inference imperative, to choose actions that will bring us closer to our preferred state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.695,
    "end": 1543.636,
    "text": " So if the task we're carrying out or what we're meant to be doing at that moment is listening to the music or we've decided that's what we should be doing, then the idea is our generative model's preferred state is the state of attending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.656,
    "end": 1550.466,
    "text": "And so if we notice that we are attending while we're attending, this shouldn't cause any surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.486,
    "end": 1555.875,
    "text": "But if we notice that we're not attending, if we notice we're mind wandering, this should result in a surprise that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.855,
    "end": 1562.006,
    "text": " under the free energy principle, should mean that we need to minimize the surprising, which means that we therefore attend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.647,
    "end": 1574.167,
    "text": "So this basically, we're seeing how being able to have meta-awareness can lead to mental action that can lead us to continue this process of attending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.509,
    "end": 1577.593,
    "text": "But there's some situations where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.788,
    "end": 1602.602,
    "text": " we want to actually take action, however small to, to, to, that we will take action, however small to, to really, um, engage with, you know, stimulate in the case of, in the, in the visual domain and maybe, um, eye movements in the case of hearing, it's not always easy to see, but it could be, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.19,
    "end": 1626.244,
    "text": " know ear or you know head movements to to to ensure that we're getting the signal as best possible um and basically here as well we see an account of you know how so-called curiosity what i'm calling curiosity related behaviors may come about so the idea is that these curiosity related behaviors uh are able to resolve uncertainty um through the choice of policies and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.224,
    "end": 1629.368,
    "text": " through us choosing policies that can reduce uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.428,
    "end": 1635.076,
    "text": "So if the main aim is to reduce uncertainty, then sometimes we need to choose actions that will get us there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.938,
    "end": 1655.725,
    "text": "And in this paper, they carried out some simulations where they showed that, you know, a given agent will choose, sometimes choose policies that by exposing them to novel combinations of states and outcomes could, on the long run, allow discovery of how outcomes are generated and improve our models in the long run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.705,
    "end": 1670.136,
    "text": " Of course, curiosity is usually described as a feeling, and it's been suggested that curiosity could be seen as what it feels like when we recognize that there is uncertainty out there that we can resolve by taking action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.601,
    "end": 1698.705,
    "text": " Just to point out that in this study, in this paper rather, they suggested that evaluation of policies may be taking place in areas like the quarter computing, which I think is quite interesting given how these have been involved or implicated in the anticipation of sort of pleasure that people have also linked to some extent to that wanting or an event or a given experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.322,
    "end": 1710.898,
    "text": " And last but not least, I think no account of music listening is complete without sort of speaking to its capacity to provide pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.938,
    "end": 1727.562,
    "text": "And the work coming out of the predictive coding framework suggests that affect isn't related just to the magnitude of reward, but to learning dynamics where it's the result of agents tracking fluctuations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.542,
    "end": 1749.55,
    "text": " in how certain their models are and it's been put forward that you know if curiosity is the expected rate of reducing or minimizing prediction error then affect could be seen as the actual rate at which we're able to minimize error where this could be faster than expected and lead to this sort of more positive feelings that we can experience in different contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.943,
    "end": 1772.486,
    "text": " So suffice it to say that the predictive coding framework, you know, for very long, we've used it to sort of account for prediction errors, which was a real priority for us in music listening because they're very easy to measure, or at least we see these responses that we can pick up very easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.546,
    "end": 1779.874,
    "text": "And yes, we have these overarching theories about musical expectancy and the role that plays in our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.854,
    "end": 1783.838,
    "text": " perception and ability to derive emotion and meaning from music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.858,
    "end": 1790.666,
    "text": "So predictive coding frameworks have been very influential as neuroscientists of music thought about sort of music and perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.507,
    "end": 1802.419,
    "text": "But I think what's exciting is how it's beginning to give accounts of what's happening when we're attending or, you know, distracted or mind-wandering how meta-awareness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.399,
    "end": 1826.888,
    "text": " can emerge or could take place within this framework allowing mental action allows us to re-attend if we realize we weren't attending and so on and so forth how we might um why how and why um not how and why but how um again curiosity related behaviors could look in in this framework and and why positive effect might emerge and that suggests that all of these um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.353,
    "end": 1833.98,
    "text": " in some ways are as relevant when we want to answer the question, what is behind this human drive to engage with music?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.04,
    "end": 1841.789,
    "text": "So we could talk about pleasure, which is what we've tended to do in the sort of neuroscience of music world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.809,
    "end": 1849.939,
    "text": "But I would argue that there's all these other reasons which are very much shared with information processing and other domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.919,
    "end": 1853.628,
    "text": " And just as an aside, if anyone's wondering, curious about music, how is that possible?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.989,
    "end": 1865.177,
    "text": "Just to say that we, just as a proof of concept, we did a few studies to see whether people's self-reports of curiosity made any sense in relation to what was going on in the music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.157,
    "end": 1872.972,
    "text": " And sure enough, whenever they perceived, often when they perceived change, people would also report being a bit more curious about what they were hearing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.854,
    "end": 1884.094,
    "text": "We were able to show that people's curiosity ratings when we probed them at different points in an unfolding piece of music was explainable by information content, how surprising that event was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.074,
    "end": 1903.703,
    "text": " this further was interacting with entropy again to explain the sort of feelings of curiosity suggesting that there was also this precision weighting mechanism going on there and just because those two studies were looking only at self-reported music linking that of curiosity linking that to the music",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.683,
    "end": 1917.539,
    "text": " But because it would be nice to have another behaviour that isn't sort of self-report, we looked at whether we would see what we thought would be a negative relationship between mind-wandering and curiosity in the context of music listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.579,
    "end": 1927.291,
    "text": "And sure enough, we showed that when people reported high levels of curiosity about what they were hearing, they were less likely to report mind-wandering at those moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.531,
    "end": 1929.133,
    "text": "I can describe the paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.113,
    "end": 1955.509,
    "text": " if anyone's interested but yes indeed we're able to show that you're more likely to be mind-wandering when you're less curious about when you report being less curious about the music that you're hearing you're more likely to be mind-wandering if you're less expert otherwise in other words have more sorry less musical training you're more likely to be mind-wandering if music at that moment is quite complex or more entropic but we saw that this association between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.489,
    "end": 1973.515,
    "text": " mind wandering and this tendency to mind wander more at high entropy was reduced with expertise so the more you had musical training or the more you seemed able to deal with the complexity and not mind wander when you heard such complexity in music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.558,
    "end": 2001.375,
    "text": " now just to finish with um short presentation of this model or theoretical framework that we put forward with regard to how engagement with music might look over time and again this was just because um after doing sort of some the only thing i do but when i do music neuroscience studies um there's a tendency to use quite short and um quite um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.954,
    "end": 2019.803,
    "text": " I don't know, reduced stimuli as pieces of stimuli, mostly because we have very clear hypotheses and ideally the stimuli are very easy to, you know, they don't have too many confounding things going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.272,
    "end": 2021.653,
    "text": " That was tended to be the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.753,
    "end": 2022.975,
    "text": "It's getting better now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.995,
    "end": 2026.718,
    "text": "We listen to sort of be used to be more naturalistic that go on for minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.219,
    "end": 2039.832,
    "text": "But in that sort of in that spirit of what's happening when we listen to a piece of music or several pieces of music back to back over several minutes in that spirit of what's happening, we decided to sort of put forward this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.552,
    "end": 2045.217,
    "text": "But just to say what has been said about music engagement and the literature,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.5,
    "end": 2048.985,
    "text": " Fairly new term, hasn't really been used much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.126,
    "end": 2061.681,
    "text": "But when people have talked about this idea of being engaged with a piece of music or engaged in the context of music listening, they have tended to emphasize this idea of being compelled or drawn in or interested in what will happen next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.823,
    "end": 2070.833,
    "text": "They've emphasized focused attention, so feelings of being actively immersed in the experience to the exclusion of extra musical stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.813,
    "end": 2074.859,
    "text": " And they've also pointed out that it seems to have temporal dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.019,
    "end": 2077.803,
    "text": "It's something that might change throughout the listening experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.203,
    "end": 2091.842,
    "text": "When we were looking a couple of years ago or a year ago, there wasn't, however, any sort of theoretical account of the factors that are contributing to this continuous experience over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.278,
    "end": 2102.457,
    "text": " when invited to contribute to this special issue, we wondered, well, can we build a useful framework of how things like curiosity and attention and mind-wandering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.791,
    "end": 2126.284,
    "text": " emerge and you know during the context of music listening in order to see if we could drive research in this area forward and just to sort of give a few fundamental claims that we make in this in this paper well we suggest for example for a start that our engagement with music is going is cyclical it's going through you know peaks and troughs we're not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.264,
    "end": 2130.792,
    "text": " always engaged, it's perfectly makes perfect sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.912,
    "end": 2135.801,
    "text": "We find it very difficult to not mind wonder in any context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.141,
    "end": 2137.924,
    "text": "So it's not surprising that's the case in music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.926,
    "end": 2142.973,
    "text": "But certainly we suggest that if there are moments of people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.953,
    "end": 2159.612,
    "text": " suddenly entering into heightened attention or engagement with music it might be because the music's just started so there's a capacity to see if there's anything to be learned or interesting a way to yeah but it could also be moments within the music that are moments of high surprise and what was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.487,
    "end": 2187.0,
    "text": " up to then a quite predictable context or even low surprise and sort of more unpredictable context because that can be just as um yeah interesting for an agent um we suggest that as i said if there's peaks there'll be troughs the moments of engagement these moments of engagements will be interspersed with mind wandering moments of mind wondering which could be explained by the redundancies in the music that preclude any sort of curiosity related behavior or attentional gain um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.111,
    "end": 2205.748,
    "text": " And then we, you know, I think one of the most crucial claims is that, you know, when we refocus on music after mind-wandering, it could be because of what's happening in the music, something that may have, you know, led to attention gain or sort of curiosity thanks to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.728,
    "end": 2219.957,
    "text": " yeah the novelty or the the fact that we there's something we don't quite understand uh but it could also be because um you know our capacity for meta awareness has allowed us to see that we're no longer attending and um it has allowed us to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.68,
    "end": 2223.807,
    "text": " you know, carry out this mental action where we re-attend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.848,
    "end": 2237.119,
    "text": "And last but not least, just to say that, again, a claim of ours is that, as is the case for most music listening experiences, the level of engagement will be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.099,
    "end": 2242.589,
    "text": " And changes in these levels of engagement over time will be modulated by complexity of what's being heard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.27,
    "end": 2253.167,
    "text": "So overall complexity will determine how engaged we are in the first place, but also within that, if we are in a very predictable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.345,
    "end": 2276.691,
    "text": " piece section of the music and suddenly something more complex happens you know that's likely to induce you know curiosity or sort of more attention compared to like conversely if something's very unpredictable and um you know something more simple and predict and um unsurprising maybe what actually triggers our uh interest and engagement so basically saying that um a bit like I alluded to earlier",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2276.671,
    "end": 2285.166,
    "text": " It's not as simple as complex or sort of surprising will always trigger interest and engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.206,
    "end": 2287.01,
    "text": "It can be quite nuanced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.991,
    "end": 2297.869,
    "text": "But yeah, also saying we also argued that expertise will of course play a role because everyone will have their own generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.849,
    "end": 2311.573,
    "text": " In the case of someone who has lots of musical expertise, this might be a very refined and sophisticated generative model that allows them to make better predictions and tolerate the uncertainty or entropy that might exist in a piece of music at that moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.334,
    "end": 2316.481,
    "text": "And last but not least, we'd argue that the listening situation and context really matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.501,
    "end": 2322.051,
    "text": "It tells us whether or not we have the capacity to deploy attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.031,
    "end": 2347.279,
    "text": " um to the music instead of say i don't know um announcements being made about the train that we are hoping to get on in the next five minutes or so um so just to summarize what i've said today um the question was what is behind this drive we seem to have as humans to engage with music and i gave a sort of an account that has come out of the work that's being done in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.259,
    "end": 2366.719,
    "text": " sort of the neurosciences of music where you know we started looking at you know music perception we looked at pleasure and we're beginning to or musical reward and we're beginning to tease or put together a story about how um pleasure is can be explained by these frontal temporal connection connections um that are interfacing with the reward network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.699,
    "end": 2386.294,
    "text": " I think what's quite nice is that we're sort of seeing the work that's been done in animal models showing that information can be a reward and beginning to try to conceptualize music a little bit in these times where perhaps a sensory prediction error is beginning to become",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.274,
    "end": 2400.52,
    "text": " something that can actually result in a reward prediction error, which would of course make it easier to interface our perceptual systems with our reward systems in a way that isn't always immediately obvious with music, a very abstract stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.281,
    "end": 2409.396,
    "text": "I've also reviewed some of the predictive coding literature or active inference literature that I found really compelling as I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.376,
    "end": 2418.778,
    "text": " try to understand what might drive changes in our engagement with music over time, try to see how using this one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.872,
    "end": 2442.538,
    "text": " principle you could explain lots of different behaviors we know are probably going on as we engage with a piece of music and just not so much suggesting that pleasure is a consequence but you know suggesting that it's part of several different processes it's not the only reason we choose to engage even though we might learn that music is pleasurable um but we engage with all these other reasons first",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.518,
    "end": 2459.082,
    "text": " And just to say that, you know, these are accounts that are very much increasingly converging lots of the work we do in the neurosciences, and when, for example, I'm doing it, it's not again, like I do, but when I'm doing it, I definitely have an eye on what's coming out of, you know, this literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.142,
    "end": 2466.012,
    "text": "And likewise, I think, you know, several people active in this are working together with neuroscientists, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.088,
    "end": 2469.532,
    "text": " there's clearly, you know, it's increasingly converging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.572,
    "end": 2486.436,
    "text": "I think there's still a lot of work that needs to be done to link some of the optimization processes we, you know, we hear talked about in that literature with the neural substrates and processes that we are able to, um, look at with, um, um, sort of neuroscience and music studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.117,
    "end": 2494.227,
    "text": "Um, but the hope is that if we, um, start putting forward some frameworks that, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.518,
    "end": 2516.023,
    "text": " are more closely informed by this literature, perhaps the more we can drive empirical work that can get us closer to these accounts really not just converging, but being really overlapping and helping us understand this question, which is what is behind the human drive to engage with music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.163,
    "end": 2517.384,
    "text": "So I'll stop talking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.404,
    "end": 2520.709,
    "text": "I don't know how long it's been, but I'm looking forward to thoughts and discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.132,
    "end": 2523.492,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.752,
    "end": 2524.213,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.948,
    "end": 2528.954,
    "text": " What is behind the human drive to engage with music?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.878,
    "end": 2539.637,
    "text": "So I think, um, a desire to, um, learn about the world that we're in, or is he a desire just, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.25,
    "end": 2545.773,
    "text": " a need to improve our model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.793,
    "end": 2548.135,
    "text": "I think this is rewarded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.155,
    "end": 2566.772,
    "text": "And music, we very quickly learned is a way to learn and be rewarded at the same time that became something that we do, you know, as much as, you know, an average, you know, a fifth of our waking hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.832,
    "end": 2569.675,
    "text": "Yeah, it's quite a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.022,
    "end": 2576.969,
    "text": " a lofty question, but I would argue it's at some point we learn that music is rewarding and that's why we turn it on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2577.37,
    "end": 2586.22,
    "text": "But I'll say ultimately so is food and there's lots of other rewards, something special about music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.561,
    "end": 2599.476,
    "text": "And I think it's this unfolding of abstract information that somehow, you know, can capture our attention, perhaps distract us from other concerns that are more basic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.878,
    "end": 2604.146,
    "text": " And yeah, still somehow reward us for that distraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.629,
    "end": 2605.929,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.13,
    "end": 2607.713,
    "text": "Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.174,
    "end": 2623.202,
    "text": "Like it has both a element of pragmatic value, especially like songs from our childhood or a period that we're familiar with listening to the same exact recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.604,
    "end": 2645.882,
    "text": " or to a cover song or to some other uh version or like a live version there's sort of a familiarity which can be like a pragmatism and or pragmatic value and then also you're you're really getting into the epistemic value and the fact it is learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.757,
    "end": 2650.466,
    "text": " And then there's so much variation, like what genre, what song?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.887,
    "end": 2652.331,
    "text": "Do you listen to new music?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.471,
    "end": 2656.361,
    "text": "Is it a playlist assembled by an algorithm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.481,
    "end": 2658.325,
    "text": "Is it something that somebody recommended to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.345,
    "end": 2664.681,
    "text": "There's like so many layers of learning, even if it's a simple sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.758,
    "end": 2667.14,
    "text": " Yeah, I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.18,
    "end": 2669.162,
    "text": "I think that's what's interesting about music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.202,
    "end": 2683.02,
    "text": "You can sort of study what's going on as people are listening, but you can also study their actions, their behaviours, what they go to see, what they choose to listen to, what they buy, what they're willing to spend their money on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.562,
    "end": 2690.55,
    "text": "With Curiosity as just an idea, we explored it also with regard to what people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.927,
    "end": 2709.788,
    "text": " we've sort of looked not just at curiosity as a state, but as a trait and shown that actually, yes, generally being someone who's trait curious, who will seek out new experiences, explains, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.033,
    "end": 2716.301,
    "text": " how much you'll report enjoying music that you've never heard before from a culture you've never heard before and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.922,
    "end": 2719.245,
    "text": "So I guess that was a bit of an aside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.285,
    "end": 2721.869,
    "text": "I guess there's a lot of individual differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.99,
    "end": 2731.202,
    "text": "And when we see people talk about, say, musical anhedonia, it's really not a disorder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.242,
    "end": 2734.107,
    "text": "They're very quick to stress that it's a sort of spectrum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.167,
    "end": 2736.45,
    "text": "You can derive a lot of pleasure from music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.43,
    "end": 2742.503,
    "text": " and be hyperhedonic, or you could be an anhedonic who derives none.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.686,
    "end": 2753.747,
    "text": "But I guess that's just an example of huge amounts of individual differences in our experiences and other more general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.727,
    "end": 2768.327,
    "text": " um traits and some people talk about personality traits like openness will also predict how much we will show these kinds of more exploratory behavior or how much we'll just exploit the music that we know really well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.636,
    "end": 2797.825,
    "text": " I was really struck by the definition of curiosity that you used, something like uncertainty we feel we can resolve with action, not just to know that we don't know is sort of a condition of curiosity or it's a relative of curiosity, but to know we don't know or to feel that we don't know and that we could do something active to epistemically forage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.906,
    "end": 2826.951,
    "text": " and then music is a special situation where the action that you can take it's like what will happen in this techno beat drop will it be two measures or will it be four but the action to take is to wait so it doesn't require another over body action or a mental attentional action other than just to attend and to let it unfold",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.032,
    "end": 2843.623,
    "text": " so it plays out in time with curiosity with sort of like a passive action choice choice not to act not to turn it off in a way that other information reducing situations that are they're modeled as like going out of your way to do something to resolve uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.886,
    "end": 2846.008,
    "text": " Yeah, that's a great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.048,
    "end": 2849.435,
    "text": "I think there's lots of paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.797,
    "end": 2861.477,
    "text": "Well, some of the best paradigms for looking at curiosity is how much you're willing to spend time to pay attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.744,
    "end": 2887.262,
    "text": " um to actually find out um what's going to happen to acquire that knowledge and exactly right i think um one could build and i just haven't got around to it paradigms where you're looking at just how much people are willing to keep listening um instead of switch over you know almost as though it's the radio um yeah people have also looked at exerting effort but those tend to be more artificial um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.242,
    "end": 2913.638,
    "text": " um yeah they've used these kinds of paradigms to see just how much you're willing to do to to get that information but i agree yeah we don't have many overt actions that are um observable with um listening to music other than just not turning it off um yeah and and that points towards this extended engagement like certainly from little snippets of sound and music",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.259,
    "end": 2927.931,
    "text": " certain aspects of listening and attention can be explored but then there'd be other dynamics that would only start to come into play like over multiple minutes like multiple songs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.063,
    "end": 2953.058,
    "text": " like I'm thinking about being at a concert we're curious what song they're gonna play late in the set or if they'll do an encore also though we prefer to go to bed early so there's more traffic it's getting late so then it's like that's a revealed stay or go of how much do we want to resolve the uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.561,
    "end": 2973.493,
    "text": " as another cost starts to another trade-off starts to build up so that's happening at a slower level than like rhythm detection over a three second sliding window yeah definitely and i think that's where it gets really interesting and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.334,
    "end": 2975.216,
    "text": " quite complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.66,
    "end": 2986.808,
    "text": "I like the literature coming out about how curiosity is contagious and this idea of the social aspects of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.003,
    "end": 2991.248,
    "text": " information foraging or caring about information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.308,
    "end": 3003.027,
    "text": "So with regards to why you stick around and don't leave, maybe it's so you have the complete picture of what that concert actually, how it's turned out and you want to be able to share that, or you certainly don't want to miss it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.47,
    "end": 3005.531,
    "text": "Other people are sticking around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.592,
    "end": 3008.797,
    "text": "So you're thinking, well, maybe they're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.117,
    "end": 3011.962,
    "text": "This is something to stick around for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.363,
    "end": 3015.107,
    "text": "And yeah, I think all of those different levels",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.087,
    "end": 3041.027,
    "text": " probably interacting i guess if you've got lots of boring tracks towards the end you might be more inclined to throw in the towel and leave before it gets really bad track to being yeah really bad traffic but um yeah ultimately it'll also depend on your your individual differences and that at that point aren't just sort of um need for cognition or you know knowing everything but also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.007,
    "end": 3053.363,
    "text": " yeah other other things how much you want to get your money's worth yeah another interesting piece was the the two streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.001,
    "end": 3065.323,
    "text": " So that had a lot of similarities in the presentation with the visual what and where, and it was almost like there was a what and a when.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.704,
    "end": 3075.283,
    "text": "So maybe could you restate that, or how does that when-ness come into play, or how is that separated out from an essentially temporal process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.888,
    "end": 3093.73,
    "text": " Yeah, it's very much borrowing from what had been put forward in the visual domain and lots of music neuroscience research has borrowed from what's gone on in the vision sciences or vision neurosciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.571,
    "end": 3103.161,
    "text": "And yeah, the sort of what pathway is this ventral pathway in the case of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.141,
    "end": 3121.318,
    "text": " the auditory system, it's the areas that house the auditory cortices feeding into the inferior frontal areas which are generally involved in sequencing and storing sequences and using those to make predictions as to what the next",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.298,
    "end": 3125.422,
    "text": " event in the sequence might be in any given sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.442,
    "end": 3134.55,
    "text": "So that's the what, predicting what's going to happen and, you know, sending predictions down the hierarchy about what, yeah, what that might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.59,
    "end": 3139.674,
    "text": "With the when, music isn't just, you know, what's happening, it's when it's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.915,
    "end": 3149.263,
    "text": "And so the when paradigm, this dorsal, sorry, the when pathway, this is the dorsal stream that's seeing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.695,
    "end": 3172.72,
    "text": " information travel between these again core auditory areas in the superior temporal gyrus and more motor and parietal areas that are involved have been shown to be involved in sort of temporal processing so lots I didn't show much work on rhythm for me to processing because I tend to work in pitch and that's why I meant by sometimes us then we can be very reduced it's because we just want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.7,
    "end": 3178.866,
    "text": " say, look at probabilities in the pitch domain before we complicate it by adding lots of temporal information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.946,
    "end": 3189.718,
    "text": "But yes, if someone were to review that literature with you, you'd see that motor areas are very much involved in our processing of time in music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.418,
    "end": 3200.749,
    "text": "And so this dorsal pathway is basically doing everything from helping us predict when something might happen in a piece of music to helping us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.889,
    "end": 3229.96,
    "text": " yeah well yeah predict when something might happen but even helping us make transformations or auditory motor um or experience sort of the motoric actions that could be seen to be attached to that listening experience so if you're a musician knowing exactly um it underlies um a sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.21,
    "end": 3233.835,
    "text": " bodily experiences of the movements you might make, even though you're not making those movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.956,
    "end": 3238.783,
    "text": "So the action, you know, observation, literature and their neuron system and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.223,
    "end": 3247.556,
    "text": "So these two streams are clearly very important for just processing sound as musical sounds as they evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.616,
    "end": 3251.982,
    "text": "But interestingly, in this book I mentioned,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.962,
    "end": 3255.156,
    "text": " where Roberto Torre is trying to put lots of things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.216,
    "end": 3260.318,
    "text": "He makes this interesting observation, which is that the dorsal stream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.631,
    "end": 3290.862,
    "text": " might be talking more to the dorsal striatum which is involved in the anticipation of chills which again is this kind of like you're waiting for something when am I going to get this extremely rewarding moment that is the modulation or the drop and that you know prediction about what that drop is going to be is meant to be subserved by the ventral system which he's you know they've shown in a number of lots of different studies is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.842,
    "end": 3314.352,
    "text": " almost related more to this ventral striatum so yeah it's i think it needs to be a little bit more carefully um yeah studied but um it's just another way in which um they're being people are making attempts to try to understand how the perceptual system might be interfacing with the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.327,
    "end": 3323.319,
    "text": " reward systems in a way that we, you know, we can see anatomically presented in our brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.362,
    "end": 3337.96,
    "text": "How are you seeing AI analysis and generation of music, changing our understandings and habits and behaviors and listenings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.458,
    "end": 3340.699,
    "text": " I don't know, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.999,
    "end": 3341.98,
    "text": "I don't know much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.302,
    "end": 3351.629,
    "text": "I spot more and more, not surprisingly, papers or talks around this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.909,
    "end": 3354.452,
    "text": "I mean, AI is impacting so many aspects of our lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.212,
    "end": 3359.456,
    "text": "I think even before AI, there was streaming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.496,
    "end": 3364.821,
    "text": "There was lots and lots of music that we could expose ourselves to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.881,
    "end": 3367.744,
    "text": "It could just play the whole day compared to when we would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.724,
    "end": 3386.29,
    "text": " to buy cds and i don't know turn them on and so on so i think there's some interesting behaviors perhaps that have already begun to emerge as we had more and more access to music i think you know what's interesting about ai is that you know it might in some cases",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.333,
    "end": 3390.256,
    "text": " very little humans, very few humans involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.976,
    "end": 3413.678,
    "text": "And I think, you know, there's some papers out there already published, I want to say 2007, but it could be 14, at least 10, if not 15 years ago, that have shown that if you thought you were listening to a piece of music that had been composed by an algorithm, you showed a lot less",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.248,
    "end": 3420.439,
    "text": " activity in the theory of mind network as if you thought this piece of music had been composed by a composer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.479,
    "end": 3430.857,
    "text": "So the stimuli there were sort of atonal, sort of serialist compositions, which seemed plausible, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.837,
    "end": 3455.005,
    "text": " um composed by an algorithm um and also by a composer now of course ai is very convincing and it'll be interesting i think it'll be harder maybe to detect or tell whether or not a human was involved very hard indeed but i think um my suggestion is that once we recognize that um there wasn't really a human involved we might show",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.402,
    "end": 3472.47,
    "text": " drop in engagement with and that in that sort of social way that music can be engaging where we try to understand what the artist is trying to tell us where we want to feel with the performer and the emotions they're expressing um without that recognition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.277,
    "end": 3496.888,
    "text": " i you know i think we're just listening to music and we'll engage you know to the extent that we find it interesting or stimulating or pleasurable regardless of yeah where it came from yeah that's interesting it's almost like the ability to generate images sounds etc",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.105,
    "end": 3517.189,
    "text": " is helping to to articulate out what are the aspects of this image that have a primary saliency like whether for pragmatic value aligning with what we'd like to see or hear or the epistemic the learning and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.169,
    "end": 3541.675,
    "text": " separating or factoring that off from the social and the relational like this drawing was made by this person so I like to look at it it has a saliency and also those pragmatic and epistemic elements not only from its actual composition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.207,
    "end": 3563.562,
    "text": " but because there's like more knowledge about the generative process that led to to its construction so then that those paths may diverge more and more as like new genres of very salient music like i thought about on your plot with affect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.706,
    "end": 3574.209,
    "text": " Are there genres or subcultures in their listening of genres that it's just like it stacks all the positive affects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.791,
    "end": 3580.605,
    "text": "And then that made me think a little bit about the sped up mashup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.193,
    "end": 3598.948,
    "text": " remixes that change songs and they're it's like songs and nostalgia at a very very fast rate and so it's like it's just like a few notes to invoke something and then on to the next one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.907,
    "end": 3621.493,
    "text": " and it's just this kind of moving on through novelty and nostalgia and what you do and don't know and it's kind of like it's so compressed and trying to have every part be really hyped up and then other pieces that maybe like consider from the album composition might have like a slow song",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.216,
    "end": 3631.602,
    "text": " that's not trying to be so salient even or it's giving a contrast that sets something else up more deeply",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.729,
    "end": 3633.089,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.79,
    "end": 3636.132,
    "text": "Yeah, no, I, yeah, it's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.152,
    "end": 3636.612,
    "text": "I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.633,
    "end": 3637.673,
    "text": "I love the sort of mashups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.894,
    "end": 3640.096,
    "text": "I was like, yeah, feed me all this nostalgia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.136,
    "end": 3656.35,
    "text": "I think that's, so there's our interest in feeling with the other and feeling empathy that's meant to, you know, it's suggested that actually it's a fact that the word for empathy came out of how we described our experiences of the arts with sort of feeling into the arts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3656.37,
    "end": 3659.213,
    "text": "So there's this social aspect to listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.494,
    "end": 3662.736,
    "text": "People talk about surrogate,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.716,
    "end": 3675.865,
    "text": " um or just this idea even if we don't there isn't anyone there if it's just a recording we're listening with our headphones on on the tube um we still imagine this person there's that but i think the nostalgia is really interesting because it almost like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3678.646,
    "end": 3695.109,
    "text": " empathizing with our previous selves and our feelings and emotions there, which have been so, which music is so able to bring back to us, you know, what our priorities and our values were in those, you know, those stages when we were listening or just, you know, what fun times or who we were hanging out with at those moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.129,
    "end": 3696.351,
    "text": "So I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.331,
    "end": 3717.124,
    "text": " yeah that's that's really interesting i mean and like you said is really trying to do is trying to really tap into this desire we have to use music to connect with ourselves yeah and then yes something that's really slow going you know very minimalist really does set you up then to find the most",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.673,
    "end": 3725.264,
    "text": " tiny deviation, extremely salient and interesting and worthy of pondering or just exploring that experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.126,
    "end": 3727.168,
    "text": "And they're very different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.248,
    "end": 3736.424,
    "text": "And I think we'll seek these kinds of music out at different moments in our day, in our lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.666,
    "end": 3741.913,
    "text": "Some of the music will just constantly, will completely",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.18,
    "end": 3744.928,
    "text": " will capture and hold your attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.55,
    "end": 3757.624,
    "text": "We've seen with this idea of the attention economy where we only have so much attention to share amongst the things that might compete for our attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.633,
    "end": 3777.008,
    "text": " people use that to look at how that might have been influencing, how this principle might be influencing how music is composed and has been composed popular music in the last 50 or so years and showing music is louder, the hook comes in quicker and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.669,
    "end": 3779.292,
    "text": "So that's an example of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.043,
    "end": 3798.175,
    "text": " this tendency for some composers to try to hold, to capture and hold our attention because it's so easy to just click next on Spotify where, yeah, others conversely probably are trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.661,
    "end": 3823.285,
    "text": " react against that or their aesthetic values are that music should never be that engaging and there should be time to ruminate or just to follow the form you know for as long as you know um you'd like without having to process the next thing and then the next thing and then the next thing um yeah different affordances I guess that music has for any any listener",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.311,
    "end": 3848.867,
    "text": " yeah that's very like media is the message for a record to begin with 10 or 30 seconds of silence or the slow build-up when there's already like the few extra seconds of just the record tracking it's not like you're gonna switch the song but then if there is a way if it's a playlist having 10 or 30 seconds in the song at the beginning of the end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.269,
    "end": 3873.032,
    "text": " it might not be played like in a public space or on a run where you might be expecting continuous music and then that changes the the technical culture of listening and and again that's related to this extended engagement building on the pitch and the rhythm identification there's still these questions about longer term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.991,
    "end": 3903.137,
    "text": " listening it's kind of like the dark room how well okay if we're bounding surprise why not the dark room etc not to go into this but it's like but what about the movie theater room or what about the uh sound listening room it's a nut it's like a little bit of an it's a uh enlivened room it has stimuli and then those are the situations that the extended engagement is looking into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.353,
    "end": 3911.565,
    "text": " But how long do you stay playing video game or listening to music or playing music when other things could happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.407,
    "end": 3915.812,
    "text": "And then it's not just an inner analysis of music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.573,
    "end": 3922.842,
    "text": "It does start to invoke like, well, you can't just do this for 24 hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.023,
    "end": 3930.694,
    "text": "So there has to be some stopping time where even the most passionate person is still going to like take a break or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.822,
    "end": 3932.204,
    "text": " Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.989,
    "end": 3933.23,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.115,
    "end": 3934.276,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.296,
    "end": 3937.495,
    "text": "And I think what's interesting is, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.504,
    "end": 3947.875,
    "text": " Most times we hope we have that ability to decide when to stop and maybe we can prepare ourselves or tell ourselves we can do this tomorrow as well or savour the experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.116,
    "end": 3960.571,
    "text": "So, you know, whenever I've watched a moving movie in the theatre, most times I'll just sit and watch the credits and listen and just kind of reflect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.493,
    "end": 3964.275,
    "text": "It's very...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.795,
    "end": 3986.061,
    "text": " annoying when you watch a movie on some of these Netflix and before they've even done a few seconds of the closing credits they're advertising the next I think we probably have learned to you know this savoring of what we've just experienced and you know letting it tail off in a way that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.632,
    "end": 3992.541,
    "text": " yeah, we can manage as opposed to it suddenly being rudely interrupted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.601,
    "end": 3999.07,
    "text": "And I think that's probably why we can, you know, even the most passionate listeners able to turn it off and be like, Okay, now I actually have to get some work done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.17,
    "end": 4006.581,
    "text": "Or now I have to, you know, go to bed, because we can manage that and tailing off most times if we're lucky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.405,
    "end": 4033.075,
    "text": " yeah and the space within and at the end as a kind of enculturation like in classical music there'll be a pause nobody will clap or you'll hear one person clap it's like oh no but then at the end and then clapping it's a motor a joint motor activity that signals okay it's really the end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.624,
    "end": 4057.847,
    "text": " so then that there's like you you mentioned um the expertise increased the focus and the the epistemic component possibly if for nothing else like i want to see how this book ends i want to see how i want to see how the structural elements and what i've heard so far relate to how it ends",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.502,
    "end": 4079.143,
    "text": " So it's like, because of knowledge of the structural form or the genre of the murder mystery or this kind of song, that kind of song, there can be a structural curiosity that keeps one engaged, even separate from any other kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.528,
    "end": 4096.862,
    "text": " curiosity just like as a craft how will the author do this how did the composer bring this all to a close and then that gives this epistemic um arc that that is informed by the genre yeah i'm reminded that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.125,
    "end": 4115.728,
    "text": " the study where, sorry, I keep saying study, maybe it's empirical work, or the paper where Kristen and colleagues talk about sort of acts of inference and curiosity, and they actually talk about insights as well and talk about sort of how, even without extra information, sort of just restructuring what you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4115.708,
    "end": 4119.997,
    "text": " what you've acquired, what you've learned can lead to these moments of insight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4120.077,
    "end": 4133.785,
    "text": "And I guess when I'm sitting there taking in everything I've just read, nothing worse than reading a book and then having to go off and do something, not having that moment to sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4133.765,
    "end": 4160.903,
    "text": " think some more and i think it's because there's probably insights to be gained only after you've come to that final end which i'm sure was carefully crafted by whoever um you know created the work and yeah just time to process further and you know gain some further insights um there is that yeah what's happening during the artwork but there's time that's needed to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.165,
    "end": 4168.114,
    "text": " to establish what was actually learned, you know, once everything had come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.174,
    "end": 4182.537,
    "text": "And it makes me think about the John Cage type concepts of music being time bound, whereas a painting or visual art",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.103,
    "end": 4206.533,
    "text": " it doesn't have a constraint so much or so similar on time the museum observer could be there for a split second or for a long time but then there's a time boundness so it's sort of like well there's um a canvas of just one color and then that is like the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.103,
    "end": 4210.788,
    "text": " 433 song that's a duration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.808,
    "end": 4212.31,
    "text": "Oh, there's nothing there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.33,
    "end": 4226.931,
    "text": "Oh, well there's the ambient sound and there's the structural elements voided of traditional contents, just like the canvas kind of cleared of its traditional content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.932,
    "end": 4233.2,
    "text": "And then how, how those cut works like explore limits of art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.901,
    "end": 4234.782,
    "text": "However,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.584,
    "end": 4238.327,
    "text": " I don't have blank canvases around me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.667,
    "end": 4243.855,
    "text": "Most people don't listen to 433 when they're going for a run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.915,
    "end": 4249.323,
    "text": "So there still is preference distributions overlaid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.383,
    "end": 4255.993,
    "text": "It's not just about having this genre defining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.378,
    "end": 4281.677,
    "text": " meta art piece there's also just like the normal day-to-day um yeah yeah i mean i think that's where people talk about the context so um yeah you need that work needs to be in a museum or a gallery um or in a concert um as a case maybe um people talk about the aesthetic attitude and like distance or um i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.21,
    "end": 4293.841,
    "text": " there's that element of, yeah, the extent to which you can deploy cognitive resources to this not extremely urgent problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.362,
    "end": 4303.631,
    "text": "And there are very few situations or circumstances where you can just, sorry, in daily life where you have that time to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.732,
    "end": 4312.761,
    "text": "And so assessing is so important in addition to these individual differences and, you know, how much we want to spend our time doing that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.648,
    "end": 4315.029,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.25,
    "end": 4322.171,
    "text": "Well, what are your next moves or what are your directions for research with music or for anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.936,
    "end": 4324.337,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.359,
    "end": 4336.55,
    "text": " I've always, I, yeah, I got to sort of work in very neuroscience places and other places that were do neuroscience, but we care about these lofty questions around this experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.971,
    "end": 4353.008,
    "text": "Um, so, and I, I, at some point I got interested in, I think, starting with surprise and, you know, just electrophysiological responses to those, how that, you know, could lead to curiosity, this, you know, extended engagement, but I, I guess I've been interested in other, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.405,
    "end": 4355.688,
    "text": " fairly epistemic emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.949,
    "end": 4364.93,
    "text": "So awe is one that we've been exploring recently with students.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.711,
    "end": 4369.36,
    "text": "And the reason is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4370.251,
    "end": 4374.596,
    "text": " well, it's one of those emotions that are very hard to pin down as an experimenter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.718,
    "end": 4393.099,
    "text": "We're going to try to use, we've been trying to use VR to create more naturalistic settings that people might hear music or, and even then begin to compare what awe induced by music might look like compared to awe induced by, I don't know, nature or the visual world and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4394.741,
    "end": 4398.165,
    "text": "And yeah, trying to understand a little bit more about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.175,
    "end": 4420.693,
    "text": " our desire for learning or understanding how you know experiences like wonder can come out of abstract stimuli like um music and yeah i really bridge this link or better understand this link between knowledge seeking and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.922,
    "end": 4425.505,
    "text": " aesthetic, transcendental experiences that we can have with the arts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.585,
    "end": 4427.107,
    "text": "So there's that kind of work being done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.127,
    "end": 4432.632,
    "text": "And yeah, in other work, we sort of look at the images that music can conjure up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.652,
    "end": 4438.037,
    "text": "And I'm really interested in, you know, predictions or engagement at those levels as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.057,
    "end": 4444.362,
    "text": "So in a way, some of the accounts I've given today are very much like, oh, and you care about the next note and what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.823,
    "end": 4451.929,
    "text": "But sometimes you're imagining yourself and others and personal memories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4451.909,
    "end": 4478.473,
    "text": " mixed up with all of these you know um thoughts that are more related to the music as it evolves and inevitably um it'll be interesting to understand a bit more about that level of engagement with music so we can see how it's either explainable by some of these principles or at least um needs to be considered um alongside um yeah i think that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4479.213,
    "end": 4494.555,
    "text": " most relevant work that i'm doing planning on doing to the work i presented today cool well thank you very much for joining super interesting and look forward to talking again thank you so much daniel thanks bye",
    "speaker": "SPEAKER_00"
  }
]