[
  {
    "start": 1.34,
    "end": 12.604,
    "text": " hello everyone it's the active inference textbook group welcome to everyone who's joining it is cohort twos meeting one on september 2nd 2022 so welcome everybody",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 18.9,
    "end": 41.758,
    "text": " um just to mention gather features and then let's just have a few minutes to say hello if we would like um on the bottom bar is where you can mute yourself or turn off your video so that's helpful for people um on the bottom bar also there's a smiley face where you can see a raised hand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 42.754,
    "end": 58.73,
    "text": " and the hand raise which you can also reach with just hitting six is how you have to lower it manually but that's how we'll know that people want to speak which is like super helpful um and movings with the arrow keys but everyone's figured out if they're here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 59.651,
    "end": 61.993,
    "text": " The main asynchronous tool is going to be the coda.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 62.514,
    "end": 72.882,
    "text": "But first, before we go through the coda, let's just take a few minutes and anybody who wants to can just say hello if they want.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 79.067,
    "end": 85.273,
    "text": "I want to ask Neil to make a few steps from the entrance to make it open.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 92.549,
    "end": 94.69,
    "text": " Okay, Neil, yeah, oh, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 95.471,
    "end": 96.252,
    "text": "All right, nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 97.212,
    "end": 99.394,
    "text": "Does anybody wanna just say anything?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 99.774,
    "end": 111.862,
    "text": "Anyone returning from the previous cohort who would just wanna say anything or anything else before we launch into more of like the overview of the CODA?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 114.464,
    "end": 116.245,
    "text": "Someone can just speak up, they don't need to raise their hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 116.325,
    "end": 117.426,
    "text": "Ali, and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 121.345,
    "end": 122.246,
    "text": " Hi, I'm Ali.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 122.446,
    "end": 125.428,
    "text": "I'm an independent researcher from Iran.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 125.828,
    "end": 130.092,
    "text": "This is the second time I'm joining the textbook cohort.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 131.072,
    "end": 147.045,
    "text": "The previous cohort was fascinating, in my opinion, and I hope to meet a lot more people on this cohort as well, and looking forward to another fascinating journey together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 147.065,
    "end": 147.445,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 150.868,
    "end": 151.388,
    "text": " Thank you, Ali.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 151.609,
    "end": 155.612,
    "text": "Anyone else can raise their hand or give any thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.473,
    "end": 157.073,
    "text": "I can say hi.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 158.194,
    "end": 158.734,
    "text": "I'm blue.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 158.895,
    "end": 168.262,
    "text": "I'm also joining from the first cohort, and I will be helping sometimes when Daniel's not around.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 168.943,
    "end": 172.866,
    "text": "So it's nice to meet all of you guys, and I'm excited to get deeper into the material.",
    "speaker": "SPEAKER_11"
  },
  {
    "start": 177.867,
    "end": 178.067,
    "text": " All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 178.407,
    "end": 178.707,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 178.887,
    "end": 181.068,
    "text": "Ragnor, and then anyone else who wants to raise their hand?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 181.929,
    "end": 182.109,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.129,
    "end": 182.669,
    "text": "Hey, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.229,
    "end": 186.551,
    "text": "That's my first cohort, but really excited to be joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.291,
    "end": 191.133,
    "text": "I'm currently like a data scientist at QBio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.193,
    "end": 196.815,
    "text": "It's a startup in San Francisco, building like a digital twin of the human body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.835,
    "end": 207.34,
    "text": "But I've always been very fascinated by Active Inference, also read the new book, but excited to be joining the cohort and meeting other people who are passionate about a topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.109,
    "end": 211.389,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.451,
    "end": 214.751,
    "text": "Ivan?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 215.311,
    "end": 216.592,
    "text": "And then anyone else who wants to raise their hand?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 219.513,
    "end": 220.094,
    "text": "Yeah, hello.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 220.114,
    "end": 221.554,
    "text": "My name is Ivan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 221.694,
    "end": 223.796,
    "text": "I'm based in Yerevan.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 224.436,
    "end": 234.661,
    "text": "And in Act-Inf Institute, I direct another education program.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 235.081,
    "end": 238.103,
    "text": "And here, I'm in a student role.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 243.953,
    "end": 272.877,
    "text": " all right um well this is the second cohort and there's some people who are also either rejoining this first part of the book or and or in cohort two uh or in cohort one part two and the meetings are following so if you want to stick around or if you're in both that's totally cool i think we're we're obviously just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 274.301,
    "end": 276.242,
    "text": " learning by doing with even the structuring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 277.202,
    "end": 286.266,
    "text": "So hopefully people can start to think about active inference and how it applies to our processes and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 287.443,
    "end": 306.947,
    "text": " iterate and improve even within cohorts within these next several months together so anyone can also write questions in the chat which is the second um set of button next to the people um all right the first part of this onboarding is going to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 308.579,
    "end": 333.309,
    "text": " in the main single source of truth which is posted in the nearby chat so this is the document to bookmark and use and contribute to as well as any other ways that you want to be contributing um like in the institute or just in your own work it's all good however you're being engaged and this is like our shared information environment",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 334.829,
    "end": 338.076,
    "text": " Everyone should have edit access, but this is fine time to check.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 340.381,
    "end": 344.469,
    "text": "We're going to go through some of the pages and how they've",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 345.506,
    "end": 350.728,
    "text": " been used in the previous cohort, it's also extremely rearrangeable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 351.969,
    "end": 354.75,
    "text": "And people can make copies of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 354.81,
    "end": 361.073,
    "text": "And we'll go through some features and so on and just talk about how we'll use these different pages and everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 361.533,
    "end": 370.978,
    "text": "And if anybody from the previous cohort or who has a question about something, you can just raise your hand or use the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 375.177,
    "end": 376.878,
    "text": " It's just good to clarify things as we go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 377.578,
    "end": 383.221,
    "text": "So the first page, the top page here, is an overview of this textbook group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 384.001,
    "end": 387.503,
    "text": "And you can right click and download the textbook PDF itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 388.063,
    "end": 389.384,
    "text": "It's an open source textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 389.884,
    "end": 395.647,
    "text": "It's the March 2022 Active Inference textbook with Parr, Pizzulo, and Friston.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 396.287,
    "end": 400.849,
    "text": "Some people have probably already completed scanning it over or reading it deeply.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 401.049,
    "end": 403.511,
    "text": "Others are probably going to go download it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 404.588,
    "end": 408.972,
    "text": " The directory page gives some information about what these different Coda pages are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 410.854,
    "end": 413.056,
    "text": "Participation rules and guidelines.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.537,
    "end": 437.008,
    "text": " this is something to note and also provide your feedback on which is the synchronous and asynchronous aspects of this textbook group which is to say what we discuss in recorded and or active institute synchronous conversations um and what we put into our shared knowledge repository",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.913,
    "end": 460.087,
    "text": " unless it's signaled otherwise can be considered as having this creative commons attribution status which is citation open source with attribution so just kind of keep that in mind and as we explore um learning and decide decentralized science together it will be important to have people's feedback",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 460.899,
    "end": 474.605,
    "text": " but just wanted to note that because it's kind of an important aspect of doing work and it helps structure what kinds of contributions you want to be making in this shared document where truly all contributions and questions are really important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 475.046,
    "end": 481.369,
    "text": "The most basic, most speculative, which we'll talk about, but this is what the status of those contributions are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 482.649,
    "end": 487.892,
    "text": "And we're here as students and individuals who are learning and applying active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 488.925,
    "end": 493.308,
    "text": " especially in the second half of the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 494.188,
    "end": 503.073,
    "text": "And of course, probably in all of our thinking on active inference or even day-to-day work, we're very interested in applying active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 504.794,
    "end": 511.398,
    "text": "Also, this is a textbook group that has a learning and a student basis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 513.288,
    "end": 537.271,
    "text": " that's going to be happening in new ways inside and outside the group and so again something to kind of just consider and give feedback on so engagement will look different for different aspects even with planning we still may not know like what the synchronous and asynchronous availabilities are for your engagement with a textbook and with the group",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 538.422,
    "end": 562.082,
    "text": " all the meetings are recorded which we'll talk about but mainly it's going to be about your asynchronous engagement with the textbook itself and some different practices around that also anything else that you see as part of your learning journey here could be contacting people who you're connecting with participating in the discord",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 563.283,
    "end": 580.792,
    "text": " getting involved in some other projects or activities that we have looking more at projects with other participants so it it's not all just about reading and and um we'll try to unpack that um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 582.99,
    "end": 607.472,
    "text": " you all have access to this coda document some pages are are a little bit fixed and the ones especially with tables are there to be like expanded upon and we'll get through that we um have two ongoing cohorts so if people would like in the cohort two which is how we are here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 608.939,
    "end": 612.863,
    "text": " by your name, or let us know if you're not added.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.003,
    "end": 614.184,
    "text": "We might just need to sync something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 615.245,
    "end": 620.311,
    "text": "You could note whether you've downloaded the textbook, made time in your calendar,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 621.271,
    "end": 629.621,
    "text": " For these synchronous meetings, if it works or like making time to rewatch it or just making time to be paying attention to this area.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 629.641,
    "end": 639.933,
    "text": "And then if you're like wanting to share some blogging or potentially to do some writing around your blog,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 640.814,
    "end": 663.365,
    "text": " work and if you want to place a link to your site and contact email so people can get in touch with you so you can click those check boxes when you've done those steps if you want to so you're on boarded you have the downloaded textbook you're making time to participate in different ways what is actually going to be the participation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 665.245,
    "end": 689.952,
    "text": " there's many ways to learn and people are coming from a lot of different backgrounds which is part of what our group is um about oh sorry i just for the recording like wasn't fully sharing my own screen um but here are the learning practices that we've just sketched and we can add more to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 691.172,
    "end": 702.962,
    "text": " So when you feel like contributing or paying attention to this textbook group, here are some practices that might be interesting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 703.868,
    "end": 730.096,
    "text": " for you to check out and also comment on or improve like what are you doing when you're working with a textbook and that's going to range from peripheral reading and viewing could be experiential it could be computational especially as we move into the second half of the textbook where there's a lot more like model building so there's also some",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 732.29,
    "end": 738.858,
    "text": " templates, which you can also in Coda copy out to your own space if you'd like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 739.859,
    "end": 747.348,
    "text": "And there's some templates that are around tracking your practices in terms of your allocation of time and like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 749.008,
    "end": 755.053,
    "text": " keeping different accounting of your engagement or your commitment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 755.433,
    "end": 757.114,
    "text": "There's no rubrics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 757.735,
    "end": 766.181,
    "text": "This is an aside document that only you have other things you can bring in there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 767.082,
    "end": 775.548,
    "text": "But that's just to say you can use some practices and accounting if you like, just how you see fit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 777.424,
    "end": 793.369,
    "text": " And then the live meetings themselves, you can see the live meetings from cohort one because they also were under the same open sourced with attribution approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 794.509,
    "end": 800.151,
    "text": "And then here after this meeting, this will be a link that is rewatchable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 801.3,
    "end": 803.802,
    "text": " and future meetings will be recorded as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 804.843,
    "end": 808.926,
    "text": "But you can also see some discussions from earlier cohorts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 810.987,
    "end": 814.83,
    "text": "So that's a lot of the logistics and onboarding.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 816.211,
    "end": 819.994,
    "text": "We can see it goes through November.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 822.075,
    "end": 823.176,
    "text": "That's the rough timing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 823.777,
    "end": 830.602,
    "text": "It's variable time commitment of different types through November",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 832.839,
    "end": 841.565,
    "text": " strongly influenced by like what your availability is and what you're coming to and where you want to go and all of that, what happens along the way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 843.426,
    "end": 849.47,
    "text": "Are there any like logistical questions or advice or things that were missed?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 874.304,
    "end": 888.202,
    "text": " right um jessica and then anyone else and then maybe like alex or someone can mention the overview um yes it's gonna fail so i'm jessica i'm also a returning um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 889.96,
    "end": 914.157,
    "text": " student participant for the course and I guess I just wanted to add like something that was really really useful last time around was engaging in the discord with the different participants and kind of like learning from each other so also like the live informal chats and you know and kind of",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 915.45,
    "end": 919.974,
    "text": " asking questions of each other in real time and to learn.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 920.515,
    "end": 922.257,
    "text": "So those were like really helpful.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 922.617,
    "end": 936.13,
    "text": "In addition to the ones, you know, asking the questions in the quota and going over them here, but it was also like that extra level of interaction that I really enjoyed last time.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 937.131,
    "end": 939.473,
    "text": "So I just wanted to add that part.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 940.113,
    "end": 940.494,
    "text": "Thank you.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 941.889,
    "end": 942.489,
    "text": " Thanks, Jessica.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 942.809,
    "end": 945.55,
    "text": "I added the Discord link in the chat if anybody's not in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 946.25,
    "end": 946.47,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 946.89,
    "end": 949.671,
    "text": "Any other, like, just logistical comments?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 950.051,
    "end": 958.874,
    "text": "Does anyone want to mention a practice or pattern that was relevant or that they didn't or didn't expect?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 959.754,
    "end": 971.157,
    "text": "Before we look at the pages where a lot of our shared work for people who choose to engage in the reading and writing this way, before we even jump into any of it, does anyone have an overview",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 971.926,
    "end": 976.487,
    "text": " comment about the practice or a way that they felt like they were learning a lot?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 980.928,
    "end": 985.09,
    "text": "For me, the translation of the math into English was mind-blowing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.79,
    "end": 995.372,
    "text": "Actually, it wasn't so much the translation as how much I learned in the process and how much I learned about what I wasn't really understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.212,
    "end": 1001.714,
    "text": "I think that that was a practice that was super instrumental to helping learn the material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.734,
    "end": 1005.954,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1007.234,
    "end": 1009.015,
    "text": "And it's not dumb, like not even close.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1011.515,
    "end": 1011.775,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1012.055,
    "end": 1023.558,
    "text": "So in the next 35 minutes, there's three big areas to look at that are all part of the same function of us learning and collaborating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1024.038,
    "end": 1025.518,
    "text": "They're also distinct though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1026.618,
    "end": 1031.239,
    "text": "There's going to be some tables which are used as reference in Coda.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1031.899,
    "end": 1034.34,
    "text": "So in Coda, where you can edit at,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1035.467,
    "end": 1061.373,
    "text": " is able to call like various types of things it can reference a page at which point that becomes a link to the page or it can link like what we'll explore in just a few seconds it can link a term like if you want to talk about variational free energy and then that on mouse over can be used to look at a lot of things like um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1063.399,
    "end": 1080.394,
    "text": " the definitions and a lot of other aspects that we'll continue to have built so what is it um that these kinds of references are often too first let's look at the tables and then into the descriptions of the textbook and then the way that the discourses range so it's not about like any importance or precedence it's just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1081.775,
    "end": 1103.046,
    "text": " going through it in this order the ontology is a project that has been scaffolded at the institute since the beginning which is the development of term lists as well as their translations into multiple languages so here's like a public face this link on the ontology page",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1103.991,
    "end": 1112.637,
    "text": " This is a public facing version where you can see definitions and then also the translation into these current languages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1113.297,
    "end": 1119.421,
    "text": "So if anyone has a language also that they are not seeing here that they're familiar with, that is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1120.413,
    "end": 1141.285,
    "text": " there's 74 core terms and it can be an awesome contribution these ontology terms allow us to do a lot of things like again encoder referencing when we're using a term specifically which is going to facilitate like cross-linking as well as translation and a lot of other aspects",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1142.525,
    "end": 1147.987,
    "text": " So we'll see how the ontology comes into play in the sections above that are more about the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1148.027,
    "end": 1153.65,
    "text": "But these are kind of static tables, semi-static tables that will be used in a lot of other parts above.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1156.111,
    "end": 1159.972,
    "text": "The live streams are a table of live streams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1161.093,
    "end": 1165.454,
    "text": "The live stream series itself is paper driven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1166.295,
    "end": 1171.137,
    "text": "And so if you're curious about a given topic like communication, you may find that there are several ways",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1171.98,
    "end": 1174.221,
    "text": " live streams and relevant papers there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.822,
    "end": 1199.131,
    "text": "In active inference research, we have a table of some citations, and this is work from some knowledge engineering projects that are also always in progress and an area for people to be involved in with ways of aggregating resources and bringing their accessibility into working documents like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1200.322,
    "end": 1203.663,
    "text": " Um, and then there's just a list that's referenced elsewhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1203.863,
    "end": 1212.865,
    "text": "So those are kind of the static tables, which are just some live streams that people may enjoy or are often brought up to contextualize other papers that we might mention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1214.126,
    "end": 1226.029,
    "text": "Um, and then the ontology table, the ontology structures, a lot of the technical discussions in the active inference field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1228.237,
    "end": 1232.84,
    "text": " First, the textbook, and then the discourse that we'll have more on the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1233.06,
    "end": 1237.743,
    "text": "This section textbook is, the textbook is open source.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1238.764,
    "end": 1241.645,
    "text": "Hey, Giuseppe, do you have a question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1242.226,
    "end": 1247.269,
    "text": "Hi, no, I just managed to connect right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.349,
    "end": 1249.73,
    "text": "I'm not very familiar with the interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.712,
    "end": 1252.032,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1252.252,
    "end": 1252.552,
    "text": "Welcome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1253.032,
    "end": 1253.313,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1255.089,
    "end": 1265.476,
    "text": " The textbook section itself is going to contain many tables, and the table is going to be of the type that is described in the page.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1266.236,
    "end": 1270.459,
    "text": "So you can peruse these, but they're used for multiple reasons.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1270.699,
    "end": 1273.901,
    "text": "First, it's all enabled because the textbook is open source.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1275.794,
    "end": 1301.18,
    "text": " what the um kind of aliquoting of the textbook into these formats which is a lot of the work that was done in the first iteration of the first part for the first five chapters then we'll do that for the second having a field that's callable as like equation 2.1 means that anywhere you can just do at equation 2.1 and then okay okay that's what 2.1 looks like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1304.724,
    "end": 1307.286,
    "text": " And so these can also be tagged.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1308.087,
    "end": 1315.433,
    "text": "And these are contributions that are incredibly valuable for people to make if they feel moved to want to do these types of contributions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1316.453,
    "end": 1324.62,
    "text": "So that like when people type in a term like Bayesian, a bunch of equations that are relevant come up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1325.441,
    "end": 1334.368,
    "text": "Then Blue, maybe do you want to describe what these descriptions are of the equations?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1339.235,
    "end": 1339.615,
    "text": " If you're there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1341.196,
    "end": 1341.416,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1342.737,
    "end": 1345.978,
    "text": "These descriptions of you or Ali, do you want to describe?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1345.998,
    "end": 1351.861,
    "text": "Sorry, I was muted and I'm driving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.881,
    "end": 1352.381,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.521,
    "end": 1353.962,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.002,
    "end": 1355.363,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.703,
    "end": 1357.484,
    "text": "I can describe really quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.504,
    "end": 1363.606,
    "text": "They are, the descriptions are like literally how you would read the math equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.646,
    "end": 1364.527,
    "text": "So if you like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.764,
    "end": 1384.998,
    "text": " You read like y equals mx plus b. This is like the y-intercept is equal to the slope times the x-intercept plus the y-coordinate equals the slope times the x-coordinate plus the y-intercept, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.419,
    "end": 1393.905,
    "text": "So it's like literally how you would read the equations in active inference using English words for the terms that they represent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.213,
    "end": 1395.714,
    "text": " Thank you, Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1396.215,
    "end": 1404.728,
    "text": "And those terms, because they're referencing terms in the active inference ontology, this is going to help contextualize the equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1404.808,
    "end": 1406.711,
    "text": "It's not the whole story on the equations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1406.871,
    "end": 1408.434,
    "text": "There's a ton of discourse below.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1409.472,
    "end": 1436.687,
    "text": " then when we get to questions in our discourse um you can ask open questions that reference or are stimulated by seeing formulas so as hopefully becomes clear all math backgrounds and preferences are welcome and everybody should be able to find uh meaning and again for the people who feel like doing these kinds of annotations",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1437.848,
    "end": 1450.045,
    "text": " Or work, like for example, Jakob, who showed some derivations and it was like, oh, the first one goes to the second and the first one goes to the third, but the second one doesn't go to the third.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1451.897,
    "end": 1463.204,
    "text": " Okay, well, that's a different understanding even without the equation of how all of these terms, which are natural everyday terms, are linked to the formalisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1463.344,
    "end": 1469.028,
    "text": "Because the formalisms are an infinite journey with math and everything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1469.808,
    "end": 1476.593,
    "text": "So that's why we're always looking to increase the accessibility of what is being related.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.822,
    "end": 1492.727,
    "text": " so that in the natural language use and in the settings where we're wanting to apply active inference, we can interact with these things grounded in the formalisms, but using regular ways of communicating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1493.107,
    "end": 1502.651,
    "text": "It's worth it because the equations are gonna be peppered in the book, as well as technical and difficult concepts or big questions that aren't equations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1502.751,
    "end": 1505.772,
    "text": "So the difficulty is not purely analytical,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1507.446,
    "end": 1535.049,
    "text": " it's also just um everybody will have areas they're like familiar with and unfamiliar with okay figures is very similar the figure information on the figure and then the image is posted so that figure 2.2 again it can always be clicked so especially as these tables gain completeness and also we can even copy the whole text of the book to github or to pages",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.581,
    "end": 1542.684,
    "text": " So we can make, and this is all on the road of developing interfaces for learning and applying active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1544.504,
    "end": 1546.645,
    "text": "Boxes and tables, again, similar to figures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1547.606,
    "end": 1551.728,
    "text": "It just has images and allows you to call box 2.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1552.448,
    "end": 1552.748,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1553.188,
    "end": 1554.089,
    "text": "That was what box 2.1 was.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1557.658,
    "end": 1562.984,
    "text": " So this is going to come into play, especially for people who have this background or would like to learn more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1564.125,
    "end": 1570.112,
    "text": "And also in the second half of the book, which is about model building.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1571.074,
    "end": 1575.278,
    "text": "And here we'll be developing, I know Ali and Brock and Jakob,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1576.713,
    "end": 1598.546,
    "text": " many people are interested in this kind of notebook driven development so again if somebody is familiar with like git and notebook development and hopefully there'll be many opportunities there um in the chapters these are just uh this is a filtered view by chapter of the questions asked regarding that chapter",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1599.617,
    "end": 1628.675,
    "text": " if somebody wants to really focus on one section and also these are editable pages or comment or if they're not where you can just add just anything you want on the chapters these are the sections of the book there's 10 chapters and there's three appendices chapters one through five constitute like an epistemic slash learning component of the of the book and then chapters six through ten are about building models and about applying",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1629.85,
    "end": 1656.507,
    "text": " still perhaps more theoretical than some would imagine applying to mean but relative to the first five it begins to get applied so these are just sections of the book there are the equations in a way that they're going to be referenceable in the discourse same for the figures boxes and tables and code is something that people can be developing more especially in the second part of the book all right now to the discourse itself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1657.529,
    "end": 1681.625,
    "text": " and the collapsing in the coda can start helping a lot so just to go over these pages so a really important page especially for the live meetings is the questions so this questions page is going to be all the questions that have been asked however you can also go into cohort 2 questions to develop your own",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1682.338,
    "end": 1710.481,
    "text": " cohort specific so it's all referenceable like the underlying questions are all retained so if you don't want to like have your priors updated by what previous people have asked then don't look however if you want to see and even improve the kinds of questions and discourse and the way that the live meetings work is that the questions that are for that week's topic",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1711.949,
    "end": 1741.233,
    "text": " we will look at like we'll go okay chapter one we're discussing today this one has the most up votes and then we'll just try to go through that list we're not going to address every possible one to the possible most possible especially written level of detail however before any time including after it's been discussed one time people can continue to come back and give thoughts and discourse",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1742.819,
    "end": 1749.945,
    "text": " One thing about the book structurally is there aren't any questions or cases provided.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1751.505,
    "end": 1772.263,
    "text": " so there's a large opportunity to develop really quality and interesting questions from the very very basics of a chapter's gist or context or anything to really just open-ended questions where there isn't even an answer per se just kind of people",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1773.325,
    "end": 1780.051,
    "text": " can just work on some unsolvable problem or solvable problem or something just at the end of chapter one, because kind of why not?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1781.992,
    "end": 1793.162,
    "text": "So we go through the interesting ones and clicking on this kind of an icon in a Coda table will open up that where it's easier instead of having a text box that just becomes out of control.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1793.743,
    "end": 1796.605,
    "text": "This is like allowing a lot of discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1797.306,
    "end": 1799.788,
    "text": "People are bringing in different resources.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1801.758,
    "end": 1806.901,
    "text": " We can ask questions about using terms in the ontology, all these kinds of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1807.481,
    "end": 1813.444,
    "text": "Again, the questions can be, and also the questions can reference parts of the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1813.924,
    "end": 1816.405,
    "text": "So, oh, this is about chapter one and figure 1.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.485,
    "end": 1816.986,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1820.808,
    "end": 1823.949,
    "text": "So that is how we'll do the live meetings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1824.63,
    "end": 1831.013,
    "text": "And so adding as many questions as you would like is great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1832.182,
    "end": 1853.987,
    "text": " just truly if whether it's something you think is very simple and you just want to add it as something that somebody could be asked or something that is like okay just checking what is the difference between this and that that's a great or it can be open-ended or it can be anything that you're asking",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1855.82,
    "end": 1883.355,
    "text": " then we'll just try to discuss them and continue to develop the discourse on them so that is because so just it's worth spending a lot of time on because the questions structure the live meetings which is just the tip of the iceberg hopefully you would get a lot just from one hour per week of the discussions and seeing how people have updated the coda and their own notes however arguably you'll be developing a lot more if you're also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1885.529,
    "end": 1889.973,
    "text": " asking questions and writing them down to yourself, or at least adding some here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1890.533,
    "end": 1891.634,
    "text": "So that's the questions aspect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1893.455,
    "end": 1908.648,
    "text": "Ideas and insights don't have to be framed as questions, but people can just add anything that they were thinking or reflecting on, just like different ideas and insights from the book, if they'd like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1910.561,
    "end": 1913.463,
    "text": " Um, then we have, uh, several other aspects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1914.284,
    "end": 1923.071,
    "text": "So next is the math learning group, which was a great, um, innovation by several of the participants here who were really active.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1923.111,
    "end": 1935.741,
    "text": "So they know who they are and they all like helped stewarding and template a really accessible and inclusive approach to math discussions and, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1937.386,
    "end": 1945.129,
    "text": " This is an area for people on any side of some perceived math comprehension situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1945.629,
    "end": 1947.83,
    "text": "They can be in this group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1948.77,
    "end": 1953.532,
    "text": "And we'll set some times amongst the people who want to commit to a certain set of times.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1954.312,
    "end": 1956.293,
    "text": "But it doesn't have to be recorded.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1959.085,
    "end": 1960.446,
    "text": " It was not previously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1961.207,
    "end": 1965.611,
    "text": "And here are just several pages within the math learning group, which is really everyone, but that was kind of like the joke.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1967.373,
    "end": 1969.535,
    "text": "First, there are several overviews written",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1971.789,
    "end": 1973.55,
    "text": " There was one table update.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1973.59,
    "end": 1976.052,
    "text": "So here, if you see a strange sign, these can be fixed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1976.132,
    "end": 1978.093,
    "text": "It's just like, okay, you just have to replace it with that word.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1978.834,
    "end": 1980.355,
    "text": "But it was a previous table that was being referenced.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1980.495,
    "end": 1982.376,
    "text": "But there's a few little cases like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1983.837,
    "end": 1989.622,
    "text": "These math overviews can be collaboratively improved to be like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.422,
    "end": 1995.266,
    "text": " So they introduced section 2.2, this equation, because it's going to show this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1995.826,
    "end": 2001.211,
    "text": "Just try to walk through some of, give overviews of the book with the technical eye.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2003.055,
    "end": 2026.407,
    "text": " there are math learning resources that are just describing some of the resources people have found relevant for learning a lot of the background materials which have been named differently in different um settings and there's also a lot of change even in the fundamentals of active inference and free energy principle recently so it's not like an um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2027.839,
    "end": 2050.687,
    "text": " absolute or total claim about what the bases or backgrounds are that being said certain areas like linear algebra and stochastic processes and statistics can be helpful anyone else can add more of course but i'm just mentioning a few areas and what the appendices are mentioning notation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2051.67,
    "end": 2080.518,
    "text": " here is connecting some of the natural language ontology terms to the notation used in discrete time active inference and continuous time active inference so that we can then kind of keep some of the formalisms in mind and get familiar with some of the notation as we're talking about like affordances or observations because that is the structure of the relationship of the ontology",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2081.4,
    "end": 2086.484,
    "text": " also not in its final form, but at least there is a specific thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2088.485,
    "end": 2089.866,
    "text": "Here's some math learning questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2089.906,
    "end": 2095.049,
    "text": "So it's just a separate section for questions if people don't want to put them in the main table.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2095.089,
    "end": 2102.535,
    "text": "But of course, math questions, again, of the most confirmatory to the most difficult are also welcome in the questions table.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2103.075,
    "end": 2104.456,
    "text": "But these are some questions about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2106.109,
    "end": 2125.227,
    "text": " conversations to have around learning and approaching the math and there'll be some experimentation with math typewriting okay I'll mention the other sections before project ideas",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2126.885,
    "end": 2127.365,
    "text": " resources.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2127.446,
    "end": 2132.108,
    "text": "So here's some resources that people have found are as relevant, also searchable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2133.689,
    "end": 2142.013,
    "text": "Here are some, here's a feedback form, which we'll update later in the cohort, and a link for people who want to join a future cohort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2143.494,
    "end": 2152.038,
    "text": "And then here's just some ideation on what you would tell future participants, different written feedback,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2154.281,
    "end": 2179.436,
    "text": " different ideas people have had about how to be involved in structuring the textbook group differently and better which should and will happen in the coming cohorts and then errata is uh just like some random stuff random thoughts people have and a few little typos or uncertainties in the book those kinds of things",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2182.119,
    "end": 2210.67,
    "text": " so just to kind of return to the overview and then we can have the rest of the time with any like discussions or thoughts people are having we are finishing our uh onboarding for this cohort two and then we're gonna take two weeks per chapter and we're gonna go through the first five chapters",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2212.878,
    "end": 2237.996,
    "text": " the chapters are not extremely extremely long in terms of page but there will be paragraphs where they're just inscrutable or like you could also think about them for a long time and so that's where the practices come into play to whatever extent is possible",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2239.028,
    "end": 2248.935,
    "text": " having at least read through, or listened, if you prefer audio form, to the chapter would be the best.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2249.952,
    "end": 2270.428,
    "text": " before a session on that chapter like ideally these are not motivating you to then check out chapter one it's the most helpful to have read the section before chapter one is a very overview so it will spur many questions and it's non-technical and then all the equations and so on start beginning in chapter two",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2272.828,
    "end": 2285.211,
    "text": " So try to pace things so that you are prepared for the discussion, at least having read or listened to those pages and just looked at what the figures were.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2287.391,
    "end": 2297.153,
    "text": "And ideally also having contributed some questions and even some discourse on the questions or thoughts on it so that in the live meeting, it's not like, okay, here, we've read the question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2298.873,
    "end": 2299.554,
    "text": "Who has a thought on it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2300.154,
    "end": 2301.174,
    "text": "It could be like, well, here's two...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2302.315,
    "end": 2331.785,
    "text": " perspectives people have shared is there any other thought on how that could happen so well in chapter one which again is very overview styled these will be pretty open discussions about the context of active inference maybe even ongoing changes in active inference one overall note is this mod this textbook",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2333.226,
    "end": 2358.895,
    "text": " there's of course many ways to think about it but it's like describing the kernel of a framework which is the action perception Loop and some formalisms and approaches towards formalisms for the action perception Loop the papers conferences literature at a very rapid pace is elaborating in a ton of directions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2360.481,
    "end": 2364.806,
    "text": " which actually I will leave to Ali to describe because I think you have a lot to say on this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2368.206,
    "end": 2382.452,
    "text": " Well, yeah, actually on resources page, I curated a collection of 17 papers and I've put them roughly in the order of increasing technicalities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2383.973,
    "end": 2389.435,
    "text": "And I think these papers might come in handy as we go through the textbook, because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2392.437,
    "end": 2417.01,
    "text": " i mean the textbook is especially some chapters are really dense and will definitely need some additional resources so feel free to add any other papers or articles articles you came across or reorder them in any way you see fit but yeah this is uh this page might um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2418.37,
    "end": 2428.719,
    "text": " be useful for some people if they want to gain a little bit more deeper understanding in terms of the essential concepts and so on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2431.021,
    "end": 2431.301,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2433.863,
    "end": 2434.544,
    "text": "Yes, Jessica?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2437.883,
    "end": 2447.948,
    "text": " Yeah, I guess I wanted to build up on Lee's comment because I found there were a lot of the papers that he suggested that were very helpful.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2448.008,
    "end": 2452.11,
    "text": "I'm a pretty much beginner in this space and also with a lot of the math.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2453.13,
    "end": 2461.894,
    "text": "And a lot of the papers that he added, which was sort of like straddling between statistics and also...",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2463.735,
    "end": 2467.836,
    "text": " what the book is talking about.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2469.897,
    "end": 2485.222,
    "text": "Just, I guess, to back up a little bit, one of the challenges that I found is in the textbook, a lot of the statistical material and some of the math is framed from the active inference, obviously, approach.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2486.451,
    "end": 2491.295,
    "text": " And the link back to some of the basics in statistics might be lost.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2491.995,
    "end": 2502.282,
    "text": "And there were like some references that Ali suggested and mentioned that allowed me to be able to make the connections to understand like, okay, so...",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2503.383,
    "end": 2520.081,
    "text": " in active inference one is looking at this term that's normally used in statistic in this other way this is how you know it connects and and be able to learn a little bit of the foundation for that and then be able to um",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2521.149,
    "end": 2528.895,
    "text": " make the transition to how it's used in an active inference framework or more in this approach.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2529.315,
    "end": 2545.748,
    "text": "And so, yeah, so that's what I wanted to like build up because they were like, you know, very like useful connection to kind of go from more foundational aspect to then connecting it to active inference and how they are applied in this sense.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2548.61,
    "end": 2549.251,
    "text": "Thank you, Jessica.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2552.834,
    "end": 2576.671,
    "text": " um yeah i i think it's great that the math group opened up a lot of that discussion in space because this is a textbook and to kind of return to that idea of it being a kernel this is going to be focusing on a didactic slash exemplar",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2578.653,
    "end": 2603.503,
    "text": " single agent case one entity involved in an action perception loop and it's going to describe that process it also doesn't describe the um every aspect from every possible perspective it's a short book overall and the step by step which is probably linked in ali's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2607.972,
    "end": 2612.373,
    "text": " The step-by-step guide, for example, is also almost book length.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2612.413,
    "end": 2619.416,
    "text": "You'll find other almost book length approaches to learning, including ones that take very different approaches.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2620.996,
    "end": 2626.318,
    "text": "Like the path that they take in a step-by-step guide with even some of the same authors is not the same as the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2627.158,
    "end": 2632.22,
    "text": "And the textbook structure is not without uncertainties and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2632.88,
    "end": 2636.041,
    "text": "There's like from the fundamental mathematical perspective,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2636.482,
    "end": 2646.864,
    "text": " to especially chapter five when the neuroscience is going to get connected broader discussions around systems and complexity and cybernetics control theory",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2648.971,
    "end": 2675.823,
    "text": " philosophy and especially the introduction of the 4e etc embedded extended things like nested communicating cyber physical systems are not going to be in the middle of chapter two except potentially by just mention so the research has a huge amount of these cases and like ramifications of active inference",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2677.082,
    "end": 2681.465,
    "text": " which often you'll see with an adjective before, like deep active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2681.505,
    "end": 2684.407,
    "text": "Now it's considering something about temporal depth or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2686.828,
    "end": 2696.155,
    "text": "So again, it's all to say the textbook is a lot and yet there's more, especially in application.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2697.222,
    "end": 2717.354,
    "text": " So that again, just returns us to the practices and thinking about this as learning the kernel of active inference or a kernel or a distilled representation by some of the people who have been working in this area for a long time, like Carl Friston and those who are bringing a sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2720.854,
    "end": 2746.02,
    "text": " computational view that and physics based view which is mainly explored in recent literature but also not in the textbook anyone can have more thoughts on that but or just general thoughts on the practices or the the way to approach the textbook",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2748.422,
    "end": 2762.675,
    "text": " Even though published in March or April this year, still, it feels like a lot has changed in active inference, or what do people think?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2763.055,
    "end": 2764.617,
    "text": "What is the way to approach the textbook?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2768.26,
    "end": 2770.002,
    "text": "Ali, and then anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2773.038,
    "end": 2793.981,
    "text": " Well, just one thing that I think might be helpful to keep in mind is that if people want to go through the additional resources and the other papers in the literature, it would be helpful to keep in mind that the notations used in the book",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2794.902,
    "end": 2799.648,
    "text": " is mostly different from most of the notations used in the rest of the literature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2800.169,
    "end": 2804.895,
    "text": "So this might be confusing at the initial stages.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2804.995,
    "end": 2809.681,
    "text": "So yeah, that's one caveat that I wanted to mention.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2811.345,
    "end": 2833.377,
    "text": " thanks for mentioning it um it's one reason why we have this language ontology driven approach because we'll be able to make columns for different papers this is written down elsewhere just want to note that for people who like do want to really parse through a paper where there is alignment in what the papers are discussing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2835.104,
    "end": 2850.312,
    "text": " or disagreement or ambiguity or all of the above, but is about the terms and the concepts, which is also what connects the formalisms, whether the math analytical equation formalisms or the computational coding implementations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2851.738,
    "end": 2858.56,
    "text": " Whatever formalisms are being used when they're being discussed outside of formalisms, it's with these kinds of terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2859.641,
    "end": 2865.503,
    "text": "So decision-making and policy selection, affordances, capacities for action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2866.203,
    "end": 2868.744,
    "text": "And then that's represented a certain way in equations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2870.02,
    "end": 2896.656,
    "text": " maybe as a bold letter, or maybe as a vector, or there's just, that is where there's heterogeneity, is the ways that certain terms are represented, because people are coming at this from many threads, which we'll be learning about, but in statistics, maybe they're used to talking about, like, y is a predictor of x, but then in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2898.356,
    "end": 2922.513,
    "text": " Bayesian models of perception and cognition maybe O is used for observation and S is for a hidden state but that might be an analogous situation in the actual topics and how they're related and um yeah any other thoughts on this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2938.559,
    "end": 2960.085,
    "text": " oh the last section which of here is the project ideas jessica or anyone want to give an overview on the project ideas um yes um i guess like in general the idea is if you have an",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2961.152,
    "end": 2969.203,
    "text": " specific way that you want to practice like learning by doing an active inference or like a project in mind.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2970.645,
    "end": 2981.532,
    "text": " and to share it with the community to see if there's other people who are interested in joining you and exploring it in that manner.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2983.153,
    "end": 2993.66,
    "text": "And so yeah, so you share the idea, you put in your name so that other people can contact you and also tag themselves saying that they're interested.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2994.96,
    "end": 3007.624,
    "text": " And then, you know, you can also like organize yourself to create like a separate study group or like, you know, project group to do this together.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3008.184,
    "end": 3012.365,
    "text": "And then there's already like some projects idea that are already like in motion.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3013.025,
    "end": 3014.906,
    "text": " and that you can also learn by doing.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3014.946,
    "end": 3031.731,
    "text": "So, like, Black Friends, which is also part of, like, the institute itself, it's a project, but then there are other ones that are also, like, more independent from other previous participants in the, you know, study group.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3032.171,
    "end": 3032.391,
    "text": "Yeah.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3032.631,
    "end": 3034.671,
    "text": "So it's very informal.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3035.492,
    "end": 3039.213,
    "text": "Just, you know, pose a flag and see...",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 3041.084,
    "end": 3065.009,
    "text": " know what momentum generates and you know what feedback you get out of it yeah thank you jessica yeah there's just people can continue to add and it looks like some people even are adding things but it ranges from audio recordings of the book going into various aspects of the rigor and accessibility of the textbook",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3066.833,
    "end": 3085.584,
    "text": " um uh acting foundations course which i know brock and ali have worked on and other types of textbook enrichment um people interested in domain specific cases many of which we can scaffold really well in active block friends",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3087.23,
    "end": 3114.598,
    "text": " all the meetings this meeting is in gather so we can be a little bit more like face to face also potentially use breakout spatially but also be not related to the discord if people don't want to be that way it's not that it always will maybe we can you know see how things evolve in platforms but we're here so that we can have a really focal study and connection time and the project meetings are in our discord",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3116.314,
    "end": 3143.419,
    "text": " those or or they can be arranged as people see fit but by default in the Discord like for active block for instance for others and that helps provide some visibility for your project even if someone's not in the textbook group and um as the months go by hopefully people see a lot of ways to want to apply active inference the book will make several comments to that effect too um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3149.724,
    "end": 3151.365,
    "text": " Does anyone have any other comments?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3151.405,
    "end": 3155.487,
    "text": "Otherwise, we'll end this first discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3164.372,
    "end": 3165.653,
    "text": "Neil, and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3167.526,
    "end": 3170.189,
    "text": " Yeah, I mean, this all looks absolutely fantastic.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3170.569,
    "end": 3178.418,
    "text": "I was just wondering, what is it that ACT-INF, what's the objective for the ACT-INF group?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3178.558,
    "end": 3185.545,
    "text": "What are you trying to get out of this, and what might we help to achieve that?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3188.128,
    "end": 3189.369,
    "text": "Well, appreciate that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3189.449,
    "end": 3189.91,
    "text": "I hope we can...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3191.564,
    "end": 3201.651,
    "text": " find out and co-create how, but in general, our mission at the Institute is to address education and research.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3202.432,
    "end": 3209.597,
    "text": "So those are the two sections of the textbook and these types of groups and people's engagement in them and the projects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3211.017,
    "end": 3219.699,
    "text": " and other facilitations of the Institute as they see relevance in a changing ecosystem, they're all helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3221.34,
    "end": 3221.64,
    "text": "Bronwyn?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3227.341,
    "end": 3234.623,
    "text": "Yes, I just wanted a very simple question in regards to the questions for the upcoming chapters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3235.323,
    "end": 3238.204,
    "text": "Are we able to put those questions in before the meeting?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3238.264,
    "end": 3239.264,
    "text": "Is that the aim?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3240.447,
    "end": 3247.111,
    "text": " as I'm reading the chapter and I've got a question, I can pop it in there and then that'll be answered during the session?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3248.132,
    "end": 3248.392,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3249.053,
    "end": 3255.477,
    "text": "So you could just click in which chapter you want the question to be in and then just hit enter, dot, dot, dot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3255.637,
    "end": 3257.819,
    "text": "Okay, new question, dot, dot, dot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3257.959,
    "end": 3266.344,
    "text": "And then you can add, if you want in this field, you can use the at and say, okay, at equation 2.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3266.825,
    "end": 3269.687,
    "text": "And then the question could be like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3271.024,
    "end": 3282.254,
    "text": " I saw equation one, dot, dot, dot, but yes, adding them before we'll make those discussions really rich and have some starting places for the discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3282.294,
    "end": 3289.78,
    "text": "And then if someone can't make the discussion, that's also fine because then there are questions will be addressed and be given visibility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3289.8,
    "end": 3291.241,
    "text": "So we can continue to address it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3291.261,
    "end": 3292.883,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3294.284,
    "end": 3294.464,
    "text": "Good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3294.804,
    "end": 3295.165,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3297.867,
    "end": 3298.067,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3298.127,
    "end": 3298.828,
    "text": "Any final comments?",
    "speaker": "SPEAKER_04"
  }
]