[
  {
    "start": 7.674,
    "end": 8.975,
    "text": " Hello and welcome, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.615,
    "end": 14.639,
    "text": "This is Physics as Information Processing, Session 4 on Communicating Observers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.02,
    "end": 17.341,
    "text": "It's the 10th of August, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.322,
    "end": 20.304,
    "text": "Chris, looking forward to this lecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.624,
    "end": 21.064,
    "text": "Off to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.686,
    "end": 26.408,
    "text": "Thank you, Daniel, and welcome to this session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.469,
    "end": 35.195,
    "text": "As Daniel said, this is about communicating observers and fasten your seatbelts because we have a lot to cover in the next hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.076,
    "end": 55.501,
    "text": " So just to do a quick review, we've been talking about quantum information theory, and we've been talking about it in the simplest possible setting of two systems, Alice and Bob, that exchange information through their mutual boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.701,
    "end": 64.723,
    "text": "And we've assumed that everything is finite dimensional, so we don't need to worry about infinite energy transfer across this boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.116,
    "end": 73.621,
    "text": " And of course, we assume conservation of energy, so there are no sources or sinks in either of the systems, Alice and Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.501,
    "end": 79.904,
    "text": "And we emphasize that this way of depicting things is topological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.964,
    "end": 86.809,
    "text": "We're not assuming any background geometry, no sort of spatial embedding, which is going to become very important in this session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.97,
    "end": 95.294,
    "text": "In the last session, we talked about how the boundary, which I'll always call B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.69,
    "end": 102.433,
    "text": " It can be thought of as a channel that comprises n qubits that are independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.993,
    "end": 107.756,
    "text": "And Alice and Bob each can prepare and measure those qubits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.736,
    "end": 113.399,
    "text": "And they can always choose independently their reference frames for doing so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.519,
    "end": 124.004,
    "text": "So how they define up and down when they're measuring a spin with effectively a z-spin operator to interact with these qubits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.97,
    "end": 130.432,
    "text": " We talked a little bit about the free energy principle and its quantum formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.872,
    "end": 138.295,
    "text": "And the principle basically says that interacting systems will behave in a way that aligns their reference frames",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.949,
    "end": 142.851,
    "text": " and that they therefore asymptotically approach entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.551,
    "end": 160.841,
    "text": "So the FEP is a classical limit of the principle of unitarity, and that's one reason for studying quantum information to learn more about the FEP, and so to learn more about active inference and what the theory of active inference says about agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.297,
    "end": 172.681,
    "text": " And last time, we talked a lot about the constraints that are imposed by a limited free energy supply on any agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.222,
    "end": 182.766,
    "text": "Recall that we talked about the fact that in the absence of sources of free energy within an agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.934,
    "end": 191.48,
    "text": " So as long as you conserve energy globally, that the free energy that each agent uses has to come from its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.86,
    "end": 193.562,
    "text": "That's clearly true for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.702,
    "end": 199.026,
    "text": "We have to consume oxygen and eat food and things like that to keep running as systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.789,
    "end": 217.062,
    "text": " And we discussed a little bit this theorem that if two reference frames or quantum processes, Q1 and Q2, don't commute, they have to be implemented by compartments that communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.102,
    "end": 219.284,
    "text": "And we'll use this extensively today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.716,
    "end": 233.642,
    "text": " But the bottom line last time was that physics alone gives us compartmentalization in systems whenever the systems are complex enough to have multiple kinds of measurements that they can't deploy simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.643,
    "end": 239.084,
    "text": "So where we're going, today we're going to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.037,
    "end": 254.301,
    "text": " I'll start from this place we left off last time of the possibility of agents that are compartmentalized and into compartments that have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.261,
    "end": 270.506,
    "text": "So we're going to talk about agents that can be compartmentalized into multiple sub-agents that share an environment, the environment consisting of Bob, and how those agents talk about that shared environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.772,
    "end": 273.695,
    "text": " So the motivation for this is simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.716,
    "end": 278.221,
    "text": "It's that what we do all the time is a group activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.482,
    "end": 286.553,
    "text": "And what we're doing right now is a group activity that involves sharing an environment, what's shown on this screen, and talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.683,
    "end": 296.447,
    "text": " And the whole post-session discussion process will be another example of just that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.288,
    "end": 312.715,
    "text": "So to talk about science at all, or to talk about any kind of social relations, or to talk about anything other than solipsism, we have to be able to talk about how multiple agents communicate about some shared environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.863,
    "end": 317.705,
    "text": " And so that's what we're going to develop a formal way of talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.966,
    "end": 323.529,
    "text": "And there are two things to notice right off the top about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.95,
    "end": 331.033,
    "text": "One is that the way we've defined interactions at boundaries, they're effectively instantaneous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.634,
    "end": 333.255,
    "text": "So each agent, remember,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.198,
    "end": 337.539,
    "text": " interacts with its boundary with some set of operators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.039,
    "end": 344.741,
    "text": "And what those operators do is effectively measure, each operator effectively measures the spin of a qubit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.741,
    "end": 347.781,
    "text": "So this is a very fast process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.602,
    "end": 361.925,
    "text": "The other thing that we then need to notice is that if we have two agents and they're communicating with each other classically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.874,
    "end": 370.396,
    "text": " then they're going to be using degrees of freedom of their shared environment in order to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.077,
    "end": 373.117,
    "text": "And that's exactly what we're doing right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.398,
    "end": 379.28,
    "text": "For example, we're using degrees of freedom of the internet to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.18,
    "end": 384.702,
    "text": "I'm using degrees of freedom of the local atmosphere to talk to my microphone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.742,
    "end": 390.804,
    "text": "And I'm using degrees of freedom of the local photon field to see my screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.265,
    "end": 403.147,
    "text": " So all communication between agents, and certainly all classical communication between agents, uses degrees of freedom of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.287,
    "end": 409.688,
    "text": "And the environment, remember, is the other system, Bob, that's on the other side of that shared boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.968,
    "end": 420.13,
    "text": "So we're going to be interested in how components of ALICE use Bob as a communication channel, and in fact, as multiple communication channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.147,
    "end": 429.05,
    "text": " And I just wanted to quote my colleague and friend Mike Levin in his statement that all intelligence is composite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.97,
    "end": 446.436,
    "text": "All of us, all organisms, even single cells, are composite systems that comprise many, many different agents that are able to make different kinds of measurements and execute different kinds of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.099,
    "end": 449.06,
    "text": " and so have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.241,
    "end": 458.265,
    "text": "So we're talking about all of life here as well as all of social systems and ecosystems and such things as that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.526,
    "end": 470.031,
    "text": "So the first thing I want to do today is simplify the notation so that we don't have to draw quite such complicated diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.791,
    "end": 474.113,
    "text": "So the picture on the left here is a picture from the last session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.046,
    "end": 494.743,
    "text": " It shows the structure of a very simple agent that makes some measurements using a reference frame called E and then writes some results of those measurements to memory using a reference frame called Y. And those two processes are connected by an internal clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.529,
    "end": 500.551,
    "text": " that ticks between the input process and the output process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.991,
    "end": 508.074,
    "text": "And the clock tick corresponds to the expenditure of free energy to write information irreversibly on the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.062,
    "end": 515.087,
    "text": " So the memories are actually written on the boundary because that's where classical information lives in this theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.827,
    "end": 530.539,
    "text": "So you can think of this whole process from E through the clock and back to Y as a single quantum process or as a quantum computation that maps some sector E of the boundary to some sector Y of the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.88,
    "end": 543.75,
    "text": " And so we can represent it in this much simpler way that's over on the right side as some process Q that maps some sector on the boundary to some other sector on the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.891,
    "end": 550.596,
    "text": "And formally, that process can be thought of as a topological quantum field theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.737,
    "end": 553.538,
    "text": " Topological here is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.618,
    "end": 554.758,
    "text": "It's not geometric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.958,
    "end": 561.18,
    "text": "It doesn't assume an embedding in space, and this will become critically important later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.24,
    "end": 573.323,
    "text": "And the operation of that TQFT requires a clock tick, or it incorporates a tick of this internal clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.656,
    "end": 592.105,
    "text": " And we can do this because we were able to prove, Jim Glazeburg and Tonino Marciano and I were able to prove last year, that we can always represent a quantum reference frame as a topological quantum field theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.946,
    "end": 599.649,
    "text": "And this just illustrates the two kinds of transformations between quantum reference frames that are important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.709,
    "end": 602.931,
    "text": "We can take one and divide it into two pieces that commute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.489,
    "end": 613.922,
    "text": " Or we can take a two-part reference frame and we can swap in another part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.052,
    "end": 622.556,
    "text": " that doesn't commute with the part that we've swapped it in for, but that does commute with the remainder of the reference frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.856,
    "end": 637.245,
    "text": "So here R is the reference component of some object identification system, and we can swap in some different way of looking at the object once we've identified it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.446,
    "end": 640.628,
    "text": "So for example, if the object that we're identifying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.408,
    "end": 661.145,
    "text": " is a box that can measure both Z-spin and X-spin, then P and Q can be the Z-spin and X-spin settings on that box that allow us to effectively rotate the filter from this way to that way so that we measure vertical spin versus horizontal spin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.347,
    "end": 663.468,
    "text": " And that's really it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.628,
    "end": 668.911,
    "text": "I mean, those are the ways that one can transform quantum reference frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.391,
    "end": 679.017,
    "text": "Of course, we could do arbitrarily many compositions of this kind of transformation and do something very complicated, but they map very simply to TQFTs with the structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.095,
    "end": 687.797,
    "text": " And you can construct categories out of this and find a functor that's well-defined that maps one category to another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.877,
    "end": 698.099,
    "text": "So it's an example of a nice use of categorical techniques for solving a problem that looks difficult, but in fact, it's very straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.519,
    "end": 707.361,
    "text": "So using this simplified notation, it becomes very easy to see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.403,
    "end": 727.995,
    "text": " that if we have two systems, Alice and Bob, on opposite sides of this boundary, and we perfectly align their quantum reference frames, which is what the FEP says they will tend to do, then they become entangled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.036,
    "end": 735.32,
    "text": "And you can see that they're entangled by seeing that once the reference frames are perfectly aligned,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.212,
    "end": 739.793,
    "text": " they jointly implement one quantum process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.914,
    "end": 746.156,
    "text": "And jointly implementing one quantum process just means you're entangled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.516,
    "end": 753.418,
    "text": "The two sides no longer have conditionally independent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.419,
    "end": 763.422,
    "text": "If one quantum process, which is time reversible, information preserving, is implemented jointly by the two systems,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.702,
    "end": 785.774,
    "text": " So a lot of things like this become very simple when we think of these processes as just quantum computations going on inside some system, implemented by some system, and how those processes relate across some boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.535,
    "end": 792.338,
    "text": "So that's what we're going to do for studying communication today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.562,
    "end": 812.389,
    "text": " Another thing to recall from a couple of sessions ago, or last session, is that if two reference frames, Q1 and Q2, commute, we can always join them together to form a single reference frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.589,
    "end": 818.172,
    "text": "And this is just a graphical depiction in this simpler language of how that works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.593,
    "end": 845.24,
    "text": " topologically there's no distinction between the left side and the right side what i've done is just squeeze the top two green circles together and the bottom two green circles together into one circle and that just makes a simple process connecting the top one to the bottom one so what we're going to be interested in is situations where this doesn't happen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.072,
    "end": 855.841,
    "text": " where Alice consists of two components that execute reference frames that don't commute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.982,
    "end": 862.769,
    "text": "And so the two components are conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.849,
    "end": 865.932,
    "text": "They do each have free choice of reference frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.339,
    "end": 869.941,
    "text": " And so they have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.261,
    "end": 876.706,
    "text": "They don't share a single quantum process, so they're not entangled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.448,
    "end": 881.89,
    "text": "And before we go ahead to do that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.748,
    "end": 907.483,
    "text": " I just wanted to remind you of some of the no-go theorems that follow from this situation depicted on the right, where we have a single agent executing a single reference frame, a single process, a single kind of measurement, any set of commuting measurements that can be combined into one measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.45,
    "end": 910.511,
    "text": " And here are some things Alice can't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.911,
    "end": 916.034,
    "text": "And we've talked about some of these previously, so this is basically a reminder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.214,
    "end": 927.179,
    "text": "But Alice can't, using just one measurement, measure the entanglement entropy across her own boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.999,
    "end": 931.201,
    "text": "So Alice can't know that she has an independent state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.721,
    "end": 935.123,
    "text": "She can't know that she's not entangled with Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.147,
    "end": 941.951,
    "text": " And that's a useful thing to think about philosophically, as it applies to you and me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.931,
    "end": 946.093,
    "text": "We can't actually know that we have independent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.934,
    "end": 957.38,
    "text": "Alice can't measure her own entanglement entropy, so she can't know whether she has components that have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.841,
    "end": 962.203,
    "text": "She can't measure Bob's entanglement entropy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.89,
    "end": 968.212,
    "text": " So she can't know whether Bob has compartments that have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.152,
    "end": 978.415,
    "text": "And if you think in terms of perception theory, this says Alice can't know whether Bob consists of separate objects that behave classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.396,
    "end": 992.659,
    "text": "Their behavior can look classical to her, but she's not able to determine that their behavior is classical because she can't measure Bob's entanglement entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.625,
    "end": 998.086,
    "text": " She can't measure the dimension of her own boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.546,
    "end": 1011.83,
    "text": "And recall from a couple of times ago that the boundary includes some sector that supplies free energy that Alice can't extract information from for further processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.01,
    "end": 1014.09,
    "text": "She can only extract free energy from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.151,
    "end": 1018.732,
    "text": "So she can't measure the dimension of that sector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.772,
    "end": 1023.113,
    "text": "And so she can't measure the dimension of the whole boundary itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.264,
    "end": 1027.487,
    "text": " And this, of course, means that she can't measure her own dimension either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.888,
    "end": 1036.316,
    "text": "And of course, she can't measure Bob's dimension because the only information she can get about Bob is the classical information that's encoded on this boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.436,
    "end": 1040.721,
    "text": "She can't reach past the boundary to see how large a system Bob is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.102,
    "end": 1057.209,
    "text": " And that's clearly connected to this first point that she can't measure the entanglement entropy across Bob, because the entanglement entropy can only be small if her dimension and Bob's dimension are both much larger than the dimension of the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.529,
    "end": 1059.39,
    "text": "So that's a condition she can't check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.471,
    "end": 1066.673,
    "text": "So all of these kind of no-go theorems lead off in interesting directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.893,
    "end": 1069.834,
    "text": "And the only one that we're really going to be interested in here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.353,
    "end": 1088.146,
    "text": " is the third one, the one about measuring Bob's entanglement entropy, because we want to talk specifically about how multiple agents, so multiple components of Alice, can access information about Bob's entanglement entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.29,
    "end": 1101.037,
    "text": "Okay, so recall from the end of the last session that the last thing we talked about was classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.316,
    "end": 1111.341,
    "text": " We talked about the fact that classical communication involves assumptions and pitfalls and that we have to be very careful whenever we talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.802,
    "end": 1117.044,
    "text": "What we're going to do today is standard practice in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.324,
    "end": 1120.126,
    "text": "We're simply going to stipulate that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.41,
    "end": 1127.392,
    "text": " these components A1 and A2, the separable components of Alice, communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.572,
    "end": 1129.153,
    "text": "And so we're going to draw it like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.213,
    "end": 1131.734,
    "text": "We're going to draw a classical channel between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.914,
    "end": 1135.195,
    "text": "And that classical channel passes through Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.575,
    "end": 1149.14,
    "text": "It uses degrees of freedom of the ambient photon field or the ambient atmosphere or pieces of paper or email or something like that that's out there in the environment to exchange classical messages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.831,
    "end": 1152.392,
    "text": " And there are a couple of things to note here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.412,
    "end": 1154.373,
    "text": "I haven't even written down here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.413,
    "end": 1159.355,
    "text": "We're assuming that A1 and A2 share some language for this classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.395,
    "end": 1161.896,
    "text": "That's a big assumption, as we talked about last time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.997,
    "end": 1168.099,
    "text": "But I will note explicitly that classical communication takes time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.679,
    "end": 1171.581,
    "text": "That's what defines classicality here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.641,
    "end": 1175.803,
    "text": "It's causal, so it can't work faster than the speed of light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.203,
    "end": 1179.124,
    "text": " This is a topological theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.245,
    "end": 1186.549,
    "text": "We don't have an embedding geometry, so we can't at this point talk about light, which is a relationship between space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.69,
    "end": 1190.952,
    "text": "Because we've got time, we've got clocks, but we don't have any space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.133,
    "end": 1201.639,
    "text": "But we can say that whatever passes through this classical channel requires at least one clock tick on Bob's side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.8,
    "end": 1205.982,
    "text": "So it's a process that Bob has to execute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.151,
    "end": 1210.073,
    "text": " and executing that process takes time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.273,
    "end": 1219.92,
    "text": "So getting the signal from me to you on the internet takes some time, so the environment's clock has to tick during that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.321,
    "end": 1234.851,
    "text": "And all of these assumptions bundled together turn out to be a fairly serious set of assumptions, and they involve assumptions about fine-tuning, about the universe being just right,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.656,
    "end": 1238.898,
    "text": " And they should make us nervous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.338,
    "end": 1241.219,
    "text": "And I just want to leave it at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.06,
    "end": 1249.345,
    "text": "We always assume with complete aplomb that agents can communicate classically, but it's not a straightforward assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.765,
    "end": 1258.511,
    "text": "And it's worth, any of you who are looking for interesting research projects can look into the nature of classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.611,
    "end": 1266.276,
    "text": "It's full of hidden assumptions and surprises and things that aren't at all straightforward, even though they look like they ought to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.256,
    "end": 1268.177,
    "text": " So there's a challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.158,
    "end": 1271.379,
    "text": "So why do we assume this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.439,
    "end": 1273.42,
    "text": "Why do we assume classical communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.14,
    "end": 1278.543,
    "text": "We do it because we have to if we're going to talk about detecting entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.284,
    "end": 1287.447,
    "text": "And most of you probably know the history of the notion of entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.968,
    "end": 1293.671,
    "text": "It was first noticed by Einstein, Podolsky, and Rosen, ever after called EPR.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.984,
    "end": 1309.037,
    "text": " in 1935, and they wrote a paper which is infamous and called the EPR paper, in which they argued that the phenomenon of entanglement made no sense and couldn't possibly be physical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.819,
    "end": 1319.647,
    "text": "Since quantum theory included this notion of entanglement, it couldn't possibly be a complete theory of what's going on in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.976,
    "end": 1331.243,
    "text": " And Schrodinger replied the same year with a very detailed paper where he introduces, among other things, Schrodinger's cat as a paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.484,
    "end": 1338.007,
    "text": "And he explains very clearly what entanglement is and why entanglement follows from quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.948,
    "end": 1347.274,
    "text": "And he uses that discussion to argue that the classical notion of a physical state is not actually applicable to the world as it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.374,
    "end": 1350.656,
    "text": "So he answers the EPR paper very directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.472,
    "end": 1373.364,
    "text": " And this discussion is currently mostly known as the Bohr-Einstein debate because, of course, Bohr already in 1928 had said in print that the classical notion of causality in space and time simply doesn't apply anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.785,
    "end": 1377.146,
    "text": "And Einstein objected to that vigorously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.208,
    "end": 1385.036,
    "text": " That was 1935, and it was almost 50 years later that entanglement was first observed in the laboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.156,
    "end": 1397.59,
    "text": "Here, the 1982 picture is a picture of the interior of Alan Aspat's laboratory when he performed the first entanglement experiment for which he finally won the Nobel Prize last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.049,
    "end": 1409.054,
    "text": " And these days, this kind of experiment is done all over the world and is even done with satellite-borne sources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.895,
    "end": 1427.903,
    "text": "...resource is the key to quantum security, quantum security communication, as we'll discuss in quantum cryptography and quantum banking, the quantum internet, all this other stuff that you may have heard of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.611,
    "end": 1440.277,
    "text": " So before talking more about these experiments, I just want to provide a definition of entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.518,
    "end": 1446.18,
    "text": "Entangled simply means not separable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.38,
    "end": 1447.541,
    "text": "That's the definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.441,
    "end": 1454.745,
    "text": "So a state, a joint state AB is entangled if and only if it does not factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.948,
    "end": 1459.089,
    "text": " into two separable states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.549,
    "end": 1461.13,
    "text": "And that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.65,
    "end": 1462.67,
    "text": "That's the definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.111,
    "end": 1484.137,
    "text": "And the literature, and especially the popular literature, is absolutely rife with hype and various kinds of mystification of entanglement and authors trying to convince you that entanglement is this amazing kind of woo-woo thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.587,
    "end": 1489.171,
    "text": " And whenever you run across that, go back to the definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.911,
    "end": 1500.261,
    "text": "I mean, entanglement simply means this simple mathematical condition of not separability or a state that isn't factorizable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.425,
    "end": 1505.887,
    "text": " And that means that the state does not display classical conditional independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.688,
    "end": 1508.929,
    "text": "So classically, that's the way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.229,
    "end": 1511.47,
    "text": "It's a failure of conditional independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.471,
    "end": 1519.274,
    "text": "And it's ubiquitous in quantum theory, even though it wasn't actually observed for almost 50 years after it was predicted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.335,
    "end": 1524.137,
    "text": "So here's what all these experiments look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.257,
    "end": 1527.138,
    "text": "They're called Bell EPR experiments after John Bell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.82,
    "end": 1544.287,
    "text": " who derived the statistical criterion for detecting entanglement, and EPR, Einstein, Podolsky, and Rosen, who did this as a thought experiment and said, if this occurs in the theory, it can't possibly be real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.507,
    "end": 1545.527,
    "text": "And of course it is real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.568,
    "end": 1549.089,
    "text": "It's now amply demonstrated by experimentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.269,
    "end": 1550.97,
    "text": "Here's how they work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.03,
    "end": 1551.75,
    "text": "There's a source,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.137,
    "end": 1557.238,
    "text": " The source produces a state that is entangled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.898,
    "end": 1561.759,
    "text": "And I've written the typical, what's called a Bell state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.459,
    "end": 1567.34,
    "text": "It's up plus or minus down divided by the square root of two, just to normalize it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.3,
    "end": 1573.301,
    "text": "But up plus or minus down is clearly not the same as up times down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.441,
    "end": 1575.401,
    "text": "So this is not a separable state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.881,
    "end": 1580.042,
    "text": "And this state propagates outward in space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.414,
    "end": 1594.22,
    "text": " to two observers who have independent laboratories, for example, on different continents in that space-based experiment that I showed you the picture of from the cover of Science a few years ago, 2017, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.781,
    "end": 1602.404,
    "text": "The two observers have freedom to choose their own reference frame, their own z-axis for measuring spin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.404,
    "end": 1607.566,
    "text": "They do a spin measurement, and they do this over and over and over again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.646,
    "end": 1609.127,
    "text": "They accumulate statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.242,
    "end": 1617.287,
    "text": " And they exchange their results so that they can analyze the joint statistics of their experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.968,
    "end": 1623.531,
    "text": "And they check to see whether that joint statistics is consistent with classical probability theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.372,
    "end": 1633.739,
    "text": "And if it isn't to a statistically significant level, then they've been able to detect entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.04,
    "end": 1639.703,
    "text": "Now, notice that this process requires classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.441,
    "end": 1647.123,
    "text": " They have to make their independent measurements in their own laboratories, and then they have to exchange results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.583,
    "end": 1653.145,
    "text": "Or one of them has to send results to the other one, or they both have to send their results to some third party.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.085,
    "end": 1658.787,
    "text": "But in all of these cases, they're exchanging some classical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.287,
    "end": 1669.33,
    "text": "And so we have the assumption that whoever gets that classical data knows the language it was recorded in, and so can do a joint analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.578,
    "end": 1676.683,
    "text": " So I'll just show you another picture of this experiment that's in a standard space-time diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.823,
    "end": 1679.466,
    "text": "Here, time is vertical, space is horizontal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.208,
    "end": 1684.63,
    "text": "The two observers are labeled Alice and Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.331,
    "end": 1691.576,
    "text": "They share a quantum channel that goes from Alice to the source to Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.696,
    "end": 1692.977,
    "text": "That's the entangled state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.377,
    "end": 1700.941,
    "text": " They do some processing and then one of them here, Bob, sends the results to Alice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.461,
    "end": 1703.663,
    "text": "And that's a classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.883,
    "end": 1707.405,
    "text": "It takes time and it traverses space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.866,
    "end": 1710.667,
    "text": "So this step is classical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.227,
    "end": 1718.872,
    "text": "So this is why we have to assume classical communication to talk about detecting or using entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.773,
    "end": 1723.295,
    "text": "So now I want to represent this in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.031,
    "end": 1727.811,
    "text": " using our little picture earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.831,
    "end": 1732.173,
    "text": "We're going to think of Alice again as two components, A1 and A2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.193,
    "end": 1736.674,
    "text": "They're separable, so they have to communicate classically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.395,
    "end": 1743.777,
    "text": "They have a classical channel that goes through Bob, and they also now share some quantum channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.057,
    "end": 1745.798,
    "text": "They share an entangled state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.918,
    "end": 1749.599,
    "text": "And the entangled state, of course, is produced by Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.699,
    "end": 1751.28,
    "text": "The source is part of Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.765,
    "end": 1774.522,
    "text": " And their detectors, if you want to think about it that way, are located on this boundary B, or their interface with the source is on this boundary B. And each of them executes a process that accumulates data from the quantum channel and communicates it to the other observer via the classical channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.22,
    "end": 1779.684,
    "text": " Now this picture illustrates what's called a LOC protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.124,
    "end": 1784.049,
    "text": "LOC means local operations and classical communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.07,
    "end": 1789.615,
    "text": "So A1 and A2 are each operating locally on their boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.016,
    "end": 1792.659,
    "text": "They're making measurements locally on their boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.581,
    "end": 1800.727,
    "text": " And they're communicating via actions locally on their boundary and observations locally on their boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.067,
    "end": 1806.391,
    "text": "So, for example, I'm communicating with my computer here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.651,
    "end": 1808.513,
    "text": "We can consider it my boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.373,
    "end": 1813.717,
    "text": "And stuff is happening in the environment that's implemented by the internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.758,
    "end": 1822.624,
    "text": "And you're receiving those communications locally on your boundary, on your laptop or whatever it is you're using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.516,
    "end": 1826.019,
    "text": " So that's what local operations means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.14,
    "end": 1834.508,
    "text": "And these protocols specifically involve classical communication, and so they're able to detect entanglement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.188,
    "end": 1839.032,
    "text": "And a Bell EPR experiment is just an example of a lock protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.861,
    "end": 1845.985,
    "text": " the observers exchange information about how they're going to do their experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.045,
    "end": 1847.886,
    "text": "They're both going to measure z-spin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.447,
    "end": 1854.691,
    "text": "They're going to use independently chosen reference frames, and they're going to look at the output from some agreed-upon source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.192,
    "end": 1858.014,
    "text": "So that's all classically set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.055,
    "end": 1864.098,
    "text": "Then they actually make their observations, and then they classically communicate their results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.419,
    "end": 1867.261,
    "text": "So classical communication front and back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.153,
    "end": 1877.078,
    "text": " Lock protocols are not limited to this sort of Bell EPR sort of setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.119,
    "end": 1882.281,
    "text": "We can also represent a scattering experiment as a lock protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.243,
    "end": 1889.586,
    "text": "So here's a representation of scattering as a lock protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.926,
    "end": 1895.81,
    "text": "And you can see all I've done is cut that previous boundary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.213,
    "end": 1913.866,
    "text": " at the division between A1 and A2, and I've then extended it in some external time, the time that is counted by Bob's clock, not by Alice's clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.187,
    "end": 1916.848,
    "text": "That's what's meant by external time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.163,
    "end": 1923.687,
    "text": " And I've relabeled Alice 2 as Alice 1 at a later time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.827,
    "end": 1932.254,
    "text": "So now what Alice is doing is communicating with her past self, or A1 is communicating with her future self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.855,
    "end": 1936.057,
    "text": "And they're each doing something different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.798,
    "end": 1944.183,
    "text": "A1 is executing a procedure that in the laboratory we call state preparation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.686,
    "end": 1953.408,
    "text": " She's preparing a state that we'll call N, which is just the initial state of some scattering experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.508,
    "end": 1964.812,
    "text": "So, for example, at the LHC, N is some state of two protons that are portaling around the ring at the LHC at close to the speed of light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.029,
    "end": 1975.536,
    "text": " And Alice then later on at T plus delta T is doing a different kind of quantum process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.717,
    "end": 1986.125,
    "text": "She's analyzing the data coming out of something like the Atlas detector, which is a multi-particle counter that's located at the LHC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.771,
    "end": 1996.779,
    "text": " So they share a quantum channel, which is the scattering channel that takes the incoming state and produces the outgoing state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.1,
    "end": 2014.235,
    "text": "And I recall from the very first session, as Feynman told us, to understand this transition from in to out, we have to integrate over all possible paths that are consistent with conservation of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.733,
    "end": 2019.555,
    "text": " spin-holicity, basically momentum plus spin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.237,
    "end": 2030.442,
    "text": "All the different spins that are relevant in a high-energy physics experiment, including things like lepton number, which is basically a spin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2032.683,
    "end": 2033.744,
    "text": "Now, how do we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.764,
    "end": 2035.885,
    "text": "How do we know what we have to conserve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.006,
    "end": 2043.31,
    "text": "We know what we have to conserve because Alice is doing the experiment, has a classical memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.414,
    "end": 2048.097,
    "text": " that allows her to remember what she prepared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.678,
    "end": 2056.945,
    "text": "She can remember that what she did back in the past was set two protons counter-rotating in the LHC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.066,
    "end": 2065.453,
    "text": "And they had certain energies, and so they had certain momenta, and they were protons, so they had certain spin variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.713,
    "end": 2071.298,
    "text": "All of that has to be remembered to make any sense of the output of the detectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.851,
    "end": 2078.994,
    "text": " and so to actually come up with a measured state that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.694,
    "end": 2086.977,
    "text": "And very often this memory channel is neglected by physicists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.317,
    "end": 2089.638,
    "text": "And I'm going to pause here and let Ander ask a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.295,
    "end": 2092.875,
    "text": " Thank you, Chris.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.235,
    "end": 2104.541,
    "text": "So does this imply that every time you have a log channel, the quantum part is like a scattering picture, like a unitary evolution, even in the earlier EPR picture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.081,
    "end": 2109.464,
    "text": "Is that quantum channel portion always a unitary evolution scattering picture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.564,
    "end": 2111.185,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2114.446,
    "end": 2118.948,
    "text": "Yes, for essentially the reason that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.252,
    "end": 2127.155,
    "text": " To find the classical channel, you're always assuming you have something that's protected from decoherence by the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.416,
    "end": 2140.382,
    "text": "So, yeah, if you're doing an EPR experiment, you have to assume that you don't have an environmental decoherence between the source and the detectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.883,
    "end": 2148.106,
    "text": "And similarly, when you're doing a scattering experiment, you have to make the assumption that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.252,
    "end": 2166.344,
    "text": " the environment is not reaching in there and messing with the outgoing state that you're going to see or reaching in and messing with the incoming state and changing it in some way that re-prepares it in a way that you don't know, that you have no knowledge of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.405,
    "end": 2175.23,
    "text": "So yes, you're making a fairly strong anti-decoherence assumption in any of these settings when you're talking about having a quantum channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.788,
    "end": 2179.328,
    "text": " Does that answer the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.849,
    "end": 2181.349,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.949,
    "end": 2185.289,
    "text": "Okay, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.309,
    "end": 2189.75,
    "text": "So we can think of Locke, we can think of scattering as Locke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.951,
    "end": 2203.793,
    "text": "And I just wanted to now emphasize that effectively what Locke is implementing is two parallel memories, a classical memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.219,
    "end": 2209.101,
    "text": " which, as we said in the case of scattering, is memory for preparation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.161,
    "end": 2219.605,
    "text": "In the PR case, it's memory for preparation, for what the experimental setup is, for what the instructions for doing the experiment are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.146,
    "end": 2226.708,
    "text": "And we also have a quantum channel, which is effectively another memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.429,
    "end": 2230.11,
    "text": "It's something that's extended through time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.24,
    "end": 2238.102,
    "text": " And again, it's implemented by the environment, implemented by Bob, and it involves Bob's clock ticking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.702,
    "end": 2248.124,
    "text": "So whenever we have two memories in parallel, we can construct an error-correcting code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.204,
    "end": 2251.485,
    "text": "So think of a simple classical error-correcting code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.805,
    "end": 2254.766,
    "text": "For example, the use of parity bits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.317,
    "end": 2257.878,
    "text": " in exchanging digital data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.258,
    "end": 2276.866,
    "text": "So if I send you a bit string, classically, and I send it to you two or three times, so there's some redundancy in my signal, and I send you a parity bit, I say, okay, add up your bit string and the result should be one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.506,
    "end": 2278.807,
    "text": "It's one on my side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.047,
    "end": 2283.369,
    "text": "If you add it up and you get zero, there's an error someplace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.454,
    "end": 2286.715,
    "text": " you can use that parity bit to detect errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.795,
    "end": 2302.339,
    "text": "So you can throw out the bit strings that you receive that have parity zero and say, oh, the environment interfered somehow with the signal or some eavesdropper interfered with the signal and made a mistake or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.499,
    "end": 2310.561,
    "text": "So this corresponds to environmental decoherence not being a good assumption, even though it's classical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.661,
    "end": 2313.742,
    "text": "Environmental interference is not a good assumption in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.737,
    "end": 2319.699,
    "text": " So a quantum error correct encode is basically the same idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.879,
    "end": 2333.484,
    "text": "I use some feature of the fact that I have two different memories and that I'm encoding something in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.005,
    "end": 2344.709,
    "text": "I'm encoding multiple replicates of something in time to provide a way of checking to make sure that I'm sending the correct message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.77,
    "end": 2361.301,
    "text": " So I can, for example, consider the message to be my classical memory and consider the quantum process as a process that tests that memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.402,
    "end": 2374.051,
    "text": "So I remember that I need to do experiment X and I will get result Y. I actually do experiment X on this quantum channel and see if I get result Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.293,
    "end": 2379.014,
    "text": " and if I don't get a result Y, then something's wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.314,
    "end": 2389.018,
    "text": "Either I can't trust the quantum channel, or I've remembered my preparation conditions incorrectly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.038,
    "end": 2393.86,
    "text": "So I'm using one memory to check the accuracy of the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.1,
    "end": 2396.681,
    "text": "And this problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.842,
    "end": 2407.645,
    "text": " using something about the environment, some channel in the environment, to check memory is absolutely ubiquitous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.485,
    "end": 2411.267,
    "text": "And we use it all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.507,
    "end": 2421.51,
    "text": "So, for example, look around your room, and your room hopefully looks more or less the same now that it did at the start of this session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.311,
    "end": 2425.572,
    "text": "And that's very reassuring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.968,
    "end": 2434.092,
    "text": " It reassures you that something's not happening in the environment that's dangerous and disturbing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.433,
    "end": 2447.499,
    "text": "And if you couldn't do that, if your environment was constantly changing and there was no familiarity about the environment, you wouldn't be able to check your memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.639,
    "end": 2450.3,
    "text": "You wouldn't be able to check your sanity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.601,
    "end": 2453.742,
    "text": "So even though we don't think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.046,
    "end": 2458.789,
    "text": " our local environments as effectively an error correcting code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.849,
    "end": 2460.35,
    "text": "That's exactly how we use it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.59,
    "end": 2469.918,
    "text": "We use Stigmergic memory or memory out there in the environment as a way of checking our own memories and assuring that our memory is OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.401,
    "end": 2476.623,
    "text": "So I talked a little bit about quantum security.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.604,
    "end": 2480.766,
    "text": "Here's how quantum security system works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.867,
    "end": 2482.148,
    "text": "Again, it's a lock protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.826,
    "end": 2498.23,
    "text": " We have some classical signal that can be thought of as a code or a key or a one-time pad, for example, that encodes a way of doing experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.631,
    "end": 2507.833,
    "text": "And once that's been exchanged, assuming it's secure, then we can use the quantum channel to communicate information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.773,
    "end": 2514.356,
    "text": " And the classical channel has told us what we have to do with that quantum channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.477,
    "end": 2528.445,
    "text": "We have to make certain kinds of measurements at, say, particular clock times as measured, and we'll get information sent from the past, from the sender.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.421,
    "end": 2552.754,
    "text": " The classical channel protects the quantum channel from adversarial agents because anything that an adversarial agent does to the quantum channel, if some agent tries to eavesdrop, for example, on the quantum channel, they'll disrupt the quantum channel and the results of our measurement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.082,
    "end": 2558.926,
    "text": " will not be what's expected given the protocol that we have run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.746,
    "end": 2571.014,
    "text": "So quantum communication is secured by the fact that interfering with some entangled state actually destroys the state, so it's detectable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.274,
    "end": 2579.839,
    "text": "We can always know if someone is trying to disrupt our communications, which isn't true if we just have two classical channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.18,
    "end": 2584.141,
    "text": " Charlie can always intercept a message and then recreate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.741,
    "end": 2587.721,
    "text": "And that's not possible with a quantum channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.942,
    "end": 2599.603,
    "text": "So let's refold this diagram so that we've taken the external time back out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.624,
    "end": 2610.005,
    "text": "And we have this picture where the two components of Alice are just interacting via their shared boundary with their environment, Bob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.633,
    "end": 2616.996,
    "text": " And now we can see that the source of redundancy is not time, it's the boundary itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.477,
    "end": 2634.465,
    "text": "Just sharing the boundary allows Alice's components, A1 and A2, to put copies of the same information on different places on the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.745,
    "end": 2640.468,
    "text": "So the boundary now becomes a resource for redundant storage of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.553,
    "end": 2657.699,
    "text": " So Alice 1 and Alice 2 can use different parts of the boundary to check what other parts of the boundary say, to check the information that's encoded on other parts of the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.899,
    "end": 2666.302,
    "text": "So they can define an error-correcting code on the boundary itself using this lock protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.494,
    "end": 2692.661,
    "text": " So I just want to leave you with this idea that using classical and quantum channels together allows us to define error-correcting codes on boundaries that we share as separate agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.842,
    "end": 2698.483,
    "text": "And leave you to think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.58,
    "end": 2710.545,
    "text": " What shared measurements, what shared quantum reference frames, let us as agents see the same things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.807,
    "end": 2718.449,
    "text": "And this is what we'll talk about next time in September.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.59,
    "end": 2726.433,
    "text": "We'll talk specifically about how space provides us with an error-correcting code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.044,
    "end": 2741.632,
    "text": " and try to understand why space is treated as emergent from something else, basically from communication, in most of quantum gravity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.633,
    "end": 2743.913,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.134,
    "end": 2752.338,
    "text": "I encourage you to use the interactive QA and to attend the discussion sessions, and we'll see you in September.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.099,
    "end": 2753.379,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.183,
    "end": 2760.604,
    "text": " Awesome, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.744,
    "end": 2763.425,
    "text": "Thank you for the lecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.585,
    "end": 2768.827,
    "text": "Andrew, do you have any remarks or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2770.228,
    "end": 2770.668,
    "text": "Not right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2770.988,
    "end": 2771.228,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2773.539,
    "end": 2777.801,
    "text": " I'll just ask a few quick questions, and if anyone has one, quickly end the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.361,
    "end": 2780.402,
    "text": "So you mentioned the tick of the clock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.182,
    "end": 2789.126,
    "text": "And in active inference, we often hold up side by side both the discrete time models and the continuous time models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.226,
    "end": 2792.287,
    "text": "So do clocks have to tick discreetly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.168,
    "end": 2796.009,
    "text": "Or how do we think about continuous time modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.27,
    "end": 2802.372,
    "text": "In this quantum setting, they do have to tick discreetly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.206,
    "end": 2815.777,
    "text": " because one has to be able to distinguish Alice's preparation of the qubits on her boundary from Bob's measurements of the qubits on the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.979,
    "end": 2826.767,
    "text": "And this process can be extremely fast with respect to any kind of sense of macroscopic time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.208,
    "end": 2835.55,
    "text": " Your eyes are responding to photons in, I think it's hundreds of femtoseconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.611,
    "end": 2853.475,
    "text": "So the discrete transitions that are effectively time measurements for you are at that very fast molecular timescale, much, much faster than our typical clocks are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.489,
    "end": 2861.494,
    "text": " Now, when we try to do very fast timing, we're constructing a faster clock than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.195,
    "end": 2865.458,
    "text": "But it's a clock that we can only observe indirectly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.891,
    "end": 2898.612,
    "text": " awesome okay now this one maybe connects a little bit to application but with all the developments happening in theory some of which you're reviewing here and also in practice with quantum computation and then keeping in mind this distinction sorry i've lost you back i've lost you daniel",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.068,
    "end": 2900.929,
    "text": " Okay, we'll wait until you're back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.849,
    "end": 2902.289,
    "text": "I can see you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.449,
    "end": 2902.629,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.189,
    "end": 2903.309,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.369,
    "end": 2903.729,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.069,
    "end": 2904.329,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.349,
    "end": 2906.59,
    "text": "Just repeat your question, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.89,
    "end": 2926.956,
    "text": "Yeah, so given these rapid and ongoing developments in theory and practice related to quantum information science and quantum information security, how are people using this distinction of the classical stigmergic memory and then the quantum cognitive process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.041,
    "end": 2937.003,
    "text": " to anticipate how to develop information systems that are reliable going forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.344,
    "end": 2952.806,
    "text": "I don't know of any instances in which thinking about quantum cognition has entered directly into any design of communication systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.078,
    "end": 2960.859,
    "text": " the ability of humans to interact with these systems is just assumed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.679,
    "end": 2976.661,
    "text": "So it's just assumed that the user can interact with, say, a computer interface, which is the sort of interface that will be provided or is provided to any quantum computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.302,
    "end": 2985.383,
    "text": "So if you think about a quantum computer, a practical quantum computer, it has classical interfaces front and back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.878,
    "end": 2999.169,
    "text": " So in thinking about interacting with the computer, I'm giving it some classical problem statement, for example, and asking for some classical answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.429,
    "end": 3003.033,
    "text": "And what it's going to give me is a probability distribution of classical answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.694,
    "end": 3011.1,
    "text": "But I can, by running the calculation many times, make that probability distribution fairly tight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.754,
    "end": 3019.915,
    "text": " So yeah, I don't know of anyone talking about quantum BCIs at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.935,
    "end": 3022.635,
    "text": "It would be an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.056,
    "end": 3036.298,
    "text": "And was it always understood, these sorts of blind spots and axioms associated with classical communication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.858,
    "end": 3043.819,
    "text": "Was it developed as kind of like a proposal or like a special case and, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.818,
    "end": 3063.23,
    "text": " more unpacking was left for later or are these blind spots things that we're now coming into awareness of given what we're learning in the quantum information sciences i think we're learning how serious they are but they were certainly recognized even by bohr in his 1928 paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.792,
    "end": 3069.874,
    "text": " And that's a very good paper too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.974,
    "end": 3075.056,
    "text": "It's called The Present State of Quantum Theory or something like that, and it's in Nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3076.657,
    "end": 3078.998,
    "text": "And it's available on the web somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.018,
    "end": 3082.179,
    "text": "I have a copy of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.9,
    "end": 3094.524,
    "text": "But it was written, in a sense, as Bohr's summary of the 1927 Solvay Conference, which was the conference at which everyone doing quantum theory at that time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.376,
    "end": 3097.618,
    "text": " got together to talk about their results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.259,
    "end": 3116.534,
    "text": "And in it, Bohr essentially presents what came to be the Copenhagen interpretation, which I think is probably unfairly called an interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.814,
    "end": 3122.459,
    "text": "It's sort of the Copenhagen pragmatic stance toward quantum theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.949,
    "end": 3145.827,
    "text": " and essentially what bohr says is that if we're going to do science we have to assume that people can talk to each other and if we're going to do science we have to assume that there are instruments that we can manipulate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.273,
    "end": 3151.958,
    "text": " and have reasonable confidence that we know what manipulation we've done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.158,
    "end": 3161.227,
    "text": "So if I turn a knob from one to two, I have to be reasonably confident that I'm making a particular change that I can understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.928,
    "end": 3170.816,
    "text": "And we have to have reasonable confidence that different laboratories can replicate the same experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.674,
    "end": 3181.139,
    "text": " And if we think about any of those assumptions in purely quantum theoretic terms, then all sorts of questions are raised, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.24,
    "end": 3183.781,
    "text": "Every quantum system is unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.562,
    "end": 3185.702,
    "text": "We have the no-cloning theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.383,
    "end": 3188.444,
    "text": "So every scientific instrument is unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.83,
    "end": 3195.693,
    "text": " So there's no such thing as exactly replicating an experiment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.494,
    "end": 3202.196,
    "text": "That's a coarse-grained description of what I've done with a completely unique quantum system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.217,
    "end": 3205.078,
    "text": "And my brain, of course, is unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.839,
    "end": 3208.9,
    "text": "And yours is too, and everyone else's is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.261,
    "end": 3216.544,
    "text": "So talking about sharing a language is essentially a coarse-grained assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.212,
    "end": 3225.394,
    "text": " And what the Copenhagen stance is all about is coarse-graining yielding effective classicality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.055,
    "end": 3234.737,
    "text": "Or what that really means is coarse-graining yielding a description that we can use in the language that we understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.038,
    "end": 3242.18,
    "text": "So these are very, very old issues that have been recognized for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.322,
    "end": 3251.928,
    "text": " But I think in part because of the disaster of shut up and calculate, they haven't really been talked about in the classroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.27,
    "end": 3255.651,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.731,
    "end": 3258.172,
    "text": "I'll just read short questions from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.113,
    "end": 3263.976,
    "text": "We can pass them to the discussion section, but there's a lot of great diverse questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3264.537,
    "end": 3267.299,
    "text": "So Alexi wrote... I think I've lost you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.319,
    "end": 3267.359,
    "text": "Oh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.646,
    "end": 3269.908,
    "text": " The revenge of Zoom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.549,
    "end": 3275.157,
    "text": "Well, we looked at the chart earlier where Bob was talking to Alice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.359,
    "end": 3277.862,
    "text": "The unidirectional communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.122,
    "end": 3278.483,
    "text": "Okay, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.253,
    "end": 3301.288,
    "text": " yeah okay okay okay the unidirectional the third party is recording it i'm sure um alexi wrote uh regarding the environment for uh being used for error correction a symptom of derealization in psychological trauma breakdown we don't recognize the environment around us and it's scary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.488,
    "end": 3331.023,
    "text": " makes sense makes sense all right from bala nice presentation i heard chris say entangled states are locc for a specific reference frame is this entanglement unitary or is it related to the numbers of degrees of freedom uh i i think the the quick answer would be both",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.213,
    "end": 3339.358,
    "text": " If you have a complex system with many degrees of freedom, some can be entangled while others aren't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.78,
    "end": 3345.063,
    "text": "It depends on what parts of the state are separable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.245,
    "end": 3357.053,
    "text": "So again, entanglement is just a statement about components of a joint state that factor or don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.952,
    "end": 3367.677,
    "text": " So you can have a joint state that looks, that looks separable along some dimensions, but other dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.737,
    "end": 3376.742,
    "text": "And the other big complication here is that whether a state looks entangled depends on the reference frames that you use to measure it with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.223,
    "end": 3388.389,
    "text": "And if you, if you pick entangled reference frames, then what we ordinarily think of as separable, as entangled states become separable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.366,
    "end": 3390.986,
    "text": " So you can move entanglement around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.027,
    "end": 3394.367,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.828,
    "end": 3395.148,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.368,
    "end": 3405.29,
    "text": "From Roland Rodriguez is the discrete temporality only within the context of a given holographic screen interface with time being bracketed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.41,
    "end": 3410.912,
    "text": "Otherwise beyond interface systems is continuity or discretion kept agnostic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.117,
    "end": 3419.421,
    "text": " I think if I understand the question correctly, it's yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.143,
    "end": 3428.931,
    "text": "If I don't draw any boundaries, I just have the joint state, then the evolution is unitary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.512,
    "end": 3433.836,
    "text": "And in a sense, time plays no role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.245,
    "end": 3443.569,
    "text": " And if unitary evolution is perfectly time-symmetric, so time actually drops out altogether.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.271,
    "end": 3448.312,
    "text": "So to talk about time, we have to draw boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.58,
    "end": 3449.86,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.92,
    "end": 3450.941,
    "text": "Time must have a stop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3451.621,
    "end": 3452.021,
    "text": "Huxley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.322,
    "end": 3459.624,
    "text": "And I'll ask one last question from the appropriately monikered question quandarer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.645,
    "end": 3466.527,
    "text": "All communication is abductive is a sentiment that I've been using to develop some arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.647,
    "end": 3467.687,
    "text": "Does that scan for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.668,
    "end": 3473.85,
    "text": "How do we connect what we're discussing here with quantum to abductive logic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.811,
    "end": 3478.932,
    "text": "Yeah, I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.099,
    "end": 3494.351,
    "text": " i i could go along with that i'd want a lot more detail uh all communication is is essentially analogical i i would agree with that yes andrew",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.577,
    "end": 3498.677,
    "text": " Yes, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.518,
    "end": 3503.079,
    "text": "So going back to the picture where the scattering picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.58,
    "end": 3512.742,
    "text": "So we have so far everything is topological and certainly induces breaking the boundary in different sectors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3512.762,
    "end": 3515.984,
    "text": "I suppose it induces a topology on the boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3516.804,
    "end": 3518.385,
    "text": "Now, I have a couple of questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.665,
    "end": 3521.246,
    "text": "As for the geometry, and this might be getting ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.675,
    "end": 3528.797,
    "text": " Is it an emergent property of those channels between different boundary sectors?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.417,
    "end": 3533.538,
    "text": "And if that's the case, then what does it mean to have a QRF for space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.779,
    "end": 3541.461,
    "text": "Yeah, this is really the topic for September.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.401,
    "end": 3548.603,
    "text": "But you do point out the fact that it's something of a chicken and egg situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.192,
    "end": 3570.548,
    "text": " The way I think of it is, I suppose, to choose the chicken side and think about what kind of reference frame does the agent have to implement to see space on their boundary?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.362,
    "end": 3578.928,
    "text": " And the reason I think about it that way is that's a question I want to be able to ask about biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.428,
    "end": 3584.373,
    "text": "And this actually gets into probably what won't be talked about until October.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.574,
    "end": 3599.626,
    "text": "But I want to be able to ask essentially a phylogenetic question of what sorts of organisms, where in the lineage from Luca—",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.454,
    "end": 3608.259,
    "text": " do we find systems that are able to assign spatial coordinates to their boundaries?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.779,
    "end": 3610.32,
    "text": "And what coordinates come first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.9,
    "end": 3629.633,
    "text": "And I suspect that sort of discrete location names with no metric come first, that a system can talk about, for example, this part of their membrane versus that part of their membrane,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.393,
    "end": 3633.695,
    "text": " without even having any ability to say how far apart they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.836,
    "end": 3640.379,
    "text": "That some sort of metric representation of this angular space comes later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.501,
    "end": 3647.203,
    "text": "And that a radial space comes even later than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.844,
    "end": 3649.865,
    "text": "That's, at this point, speculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.125,
    "end": 3655.969,
    "text": "But I think these are questions that we can end up asking, given the right kind of formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.162,
    "end": 3683.563,
    "text": " the right understanding of what it means to to to be able to make a spatial measurement so the conjecture is that uh the metric would emerge from a discrete network metric of counting ticks sort of thing yeah yeah i think that's i think that's correct and uh that the sort of the sort of symmetries of space that we see are very much tied up with object identity so if we think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.875,
    "end": 3687.636,
    "text": " something like rotational symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.957,
    "end": 3688.397,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.402,
    "end": 3695.783,
    "text": "I should stop screen sharing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.885,
    "end": 3701.227,
    "text": "So, you know, I've got this object, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.387,
    "end": 3706.911,
    "text": "And I can do this, and I say, oh, you know, space has this rotational symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.272,
    "end": 3712.536,
    "text": "But for me to say that, I have to recognize that this is the same object, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.096,
    "end": 3713.997,
    "text": "I have to implement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.989,
    "end": 3719.63,
    "text": " object persistence, which we all learn to do when we're nine months old or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.05,
    "end": 3732.072,
    "text": "But we tend to regard those as separate things, as we learn object persistence because space is rotationally symmetric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.012,
    "end": 3742.034,
    "text": "But we can view it the other way around, that space is rotationally symmetric for me because I implement these constraints that are called object persistence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.874,
    "end": 3743.014,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.257,
    "end": 3760.786,
    "text": " Do you think we can understand phylogenetics as a whole, as a kind of scattering experiment, like the high-energy LUCA event, and then dissipating and propagating in a very tangled bank?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.927,
    "end": 3769.471,
    "text": "Well, I do want to be able to understand phylogeny in exactly the same terms as embryology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.473,
    "end": 3781.638,
    "text": " And Mike Levin and I have published papers about that, that we should be able to view the lineage of LUCA in exactly the same way that we view the lineage of the zygote that produced us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.459,
    "end": 3794.925,
    "text": "So that's why it's no coincidence that during pregnancy, the development of the embryo mirrors evolution in terms of the parts that are developed first?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3797.077,
    "end": 3810.372,
    "text": " Yeah, this is the old idea that phylogeny and ontogeny are related in some way, which from an embryonic development point of view, they're certainly analogous in ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.597,
    "end": 3816.519,
    "text": " Sorry, if I may ask one last question, I think it should be very quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3817.82,
    "end": 3828.127,
    "text": "Regarding the weak rotation, I'm still a bit unsure how it ties to this diagrammatic notation that we had with quantum channels and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3829.848,
    "end": 3840.175,
    "text": "And there was a note in the second session, we briefly talked about the weak rotation being a reversal in the direction of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3840.395,
    "end": 3842.477,
    "text": "Is there any relation to today's session?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3846.034,
    "end": 3846.515,
    "text": " You know, I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.195,
    "end": 3869.551,
    "text": " Whenever we think about the flow of time as driven by the input-output cycle, the input-output cycle for agents separated by a boundary is always, there's always a sign change, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.651,
    "end": 3872.053,
    "text": "My input is your output and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.414,
    "end": 3877.257,
    "text": "So when we think about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.565,
    "end": 3894.242,
    "text": " Bob's clock ticking when Alice does something, his direction of time in a sense points with respect to the boundary opposite to hers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.042,
    "end": 3899.205,
    "text": " But that's only with respect to the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.525,
    "end": 3904.832,
    "text": "He sees information flowing in, and she sees information flowing in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.873,
    "end": 3912.702,
    "text": "That's the only point being made here about wick rotation as an operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.845,
    "end": 3915.085,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.803,
    "end": 3917.563,
    "text": " Thank you, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.664,
    "end": 3922.506,
    "text": "Very well appreciated by the viewers and by us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.866,
    "end": 3934.772,
    "text": "So we'll certainly look forward to reviewing the Q&A and everybody is welcome and encouraged to join for the participatory discussion in about two weeks on Saturday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.372,
    "end": 3937.913,
    "text": "So till next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.933,
    "end": 3939.374,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3939.534,
    "end": 3939.874,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.595,
    "end": 3940.795,
    "text": "Cheers.",
    "speaker": "SPEAKER_01"
  }
]