[
  {
    "start": 12.13,
    "end": 15.072,
    "text": " Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 15.232,
    "end": 17.873,
    "text": "This is the participatory online laboratory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 18.354,
    "end": 26.278,
    "text": "Today is Tuesday, September 13th, and we are here with MathStream 4.1 with David Spivak.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 26.719,
    "end": 30.361,
    "text": "And we are welcome to take any questions in the YouTube chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 30.381,
    "end": 37.205,
    "text": "So if you have any questions, please write them there, and we will have time to ask our presenter during the course of this discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 37.945,
    "end": 44.849,
    "text": " David is here to talk to us today about dynamic interfaces and arrangements and algebraic framework for interacting systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 45.449,
    "end": 46.269,
    "text": "Please take it away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 46.289,
    "end": 47.57,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.63,
    "end": 47.85,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.87,
    "end": 48.711,
    "text": "Thanks a lot for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.75,
    "end": 54.673,
    "text": " So I'm going to talk for around 40 minutes, or maybe almost an hour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.693,
    "end": 55.013,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.874,
    "end": 59.735,
    "text": "But feel free to interrupt with whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.855,
    "end": 66.078,
    "text": "And I wanted to say at the outset that I'm not really talking much about Active Inference itself here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.238,
    "end": 72.402,
    "text": "I'm mainly saying another perspective on interacting systems or systems that might learn or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.042,
    "end": 76.744,
    "text": "And I'm more waiting for the discussion time to find these links.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.404,
    "end": 78.865,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.784,
    "end": 87.526,
    "text": " Okay, so I want to talk about dynamic interfaces and arrangements and what that means and this applied category theory point of view on things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.65,
    "end": 90.931,
    "text": " So why am I here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.291,
    "end": 107.937,
    "text": "I'm here to seek a valuable exchange of ideas because active inference offers, first time I heard about it, it's compelling and most people apparently find it unusual, but for some reason it instantly meshed with my own intuition about things that I've gotten from applied category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.478,
    "end": 110.859,
    "text": "And so I think there's a lot we can learn from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.952,
    "end": 117.356,
    "text": " So applied category theory emphasizes structure rather than quantitative analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.796,
    "end": 121.599,
    "text": "So most of math and science today reduce all of our experience to plays of quantity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.999,
    "end": 129.526,
    "text": "So you have graphs and you have numbers and you measure things and numbers and you have probabilities and those are numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.086,
    "end": 131.267,
    "text": "And so everything is just a number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.367,
    "end": 133.169,
    "text": "But experience what's happening now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 133.229,
    "end": 134.61,
    "text": "I mean, what number would you put on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.424,
    "end": 142.186,
    "text": " you know, the sound of my voice or the, or what numbers you could put numbers on this slide, but would they tell you what the slide was about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.026,
    "end": 147.567,
    "text": "And so what category theory emphasizes is still math, but it emphasizes structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.147,
    "end": 158.23,
    "text": "It emphasizes relations between things like the relationship between what's on this slide and other things on the slide and what's on the rest of the talk, the relationships between that and me, the relationship between that and you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.826,
    "end": 160.669,
    "text": " and the kind of coherence between all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.709,
    "end": 161.931,
    "text": "Like, why are we really here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.011,
    "end": 163.673,
    "text": "How does it cohere?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.254,
    "end": 165.055,
    "text": "How does it come together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.476,
    "end": 170.202,
    "text": "So applied category theory aims to bring that math to relational disciplines outside of math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.199,
    "end": 179.184,
    "text": " So I want to tell you about applied category theory, specifically in reference to interfaces, because I'm going to say that we interact through our interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.564,
    "end": 181.886,
    "text": "And when you hear the word interface, you might think Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.307,
    "end": 185.169,
    "text": "I don't know enough to be sure that that's exactly what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.709,
    "end": 191.714,
    "text": "So that's kind of where this is fitting in maybe into an active inference framing, but I'd rather you just think about interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.115,
    "end": 199.68,
    "text": "So I'm asking in this talk, what sort of algebra could support us in thinking about interaction and stuff like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.118,
    "end": 204.561,
    "text": " I think of mathematical fields as accounting systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.242,
    "end": 210.368,
    "text": "So I like that the word count is in there and I like how kind of humble it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.408,
    "end": 211.869,
    "text": "It's like an accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.41,
    "end": 219.859,
    "text": "So if you want to, if you have arithmetic, that's a mathematical field and it accounts for the flow of quantities like in finance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.448,
    "end": 231.656,
    "text": " So if you want your accountant to help you say why you did what you did or what you did and how the quantities flowed, you would write something in an arithmetic account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.817,
    "end": 233.278,
    "text": "You'd write an arithmetic account of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.679,
    "end": 237.221,
    "text": "Someone could point that and say, what's this $12.83?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.801,
    "end": 238.682,
    "text": "And you could explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.002,
    "end": 241.905,
    "text": "So there's numbers and you can account for stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.505,
    "end": 244.006,
    "text": "What if you wanted to account for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.366,
    "end": 248.567,
    "text": " teleportation protocol of quantum mechanics or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.028,
    "end": 259.251,
    "text": "So Hilbert spaces is a branch of math and it helps you make accounts for the sorts of things that people do in quantum computing or quantum mechanics or generally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 260.251,
    "end": 264.452,
    "text": "Probability distributions is a mathematical field, but it helps you account for likelihoods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.512,
    "end": 266.573,
    "text": "Why is somebody winning at poker and somebody not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.914,
    "end": 272.075,
    "text": "If you want to give that account and you want to be careful about it, you'd use probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.286,
    "end": 276.009,
    "text": " So, but what is an account of phenomena?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.47,
    "end": 286.167,
    "text": "Like we're already kind of talking and somebody might give an account of their finances or something and just written in English, but you can't really be that careful with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.207,
    "end": 287.028,
    "text": "You can't track it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.055,
    "end": 290.857,
    "text": " you can't be sure you know what they're saying and that you can point at something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.478,
    "end": 299.605,
    "text": "So the language, the accounting system has to articulate the relevant type differences and provide operations that correspond with their interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.625,
    "end": 301.266,
    "text": "And that's really a dense statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.806,
    "end": 304.849,
    "text": "I didn't mean to, I'm trying to keep things concise, but what do I mean there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.629,
    "end": 311.553,
    "text": " In accounting for dollars and financial stuff, there's dollars and there's numbers of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.633,
    "end": 313.854,
    "text": "And you can add and subtract dollars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.934,
    "end": 317.136,
    "text": "Like this was $5 and he paid $4, so there's $1 left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.156,
    "end": 318.657,
    "text": "So you can subtract them or add them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.057,
    "end": 320.878,
    "text": "But you can't multiply $2 figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.978,
    "end": 323.559,
    "text": "It doesn't mean anything to multiply $5 times $8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.18,
    "end": 326.521,
    "text": "But you can multiply $5 by eight things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.061,
    "end": 330.083,
    "text": "So I sold eight things of $5 each.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.663,
    "end": 332.404,
    "text": "So the operations that you're allowed to do...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.185,
    "end": 359.334,
    "text": " there are different type difference there's the number of widgets and then there's the price of the widgets and that's a difference in type and the operations make sense with plus you're allowed to add dollars and you're allowed to add numbers of widgets but you're not allowed to multiply uh numbers of dollars by numbers of dollars so that's kind of what i mean here an accounting system needs to tell you like hey that's not what dollars means what would it even mean to multiply five dollars by eight dollars",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.194,
    "end": 387.288,
    "text": " um is it in dollars squared now or something anyway so that's the sort of thing an accounting system does it gives you the um a way of knowing what you're allowed to do what the type differences are and what you can operate how you operate on them so category if every mathematical field is an accounting system then category theory is an accounting system so what is it accounting system for it's an accounting system for the fact that we see in the world coherent structures we see in the world flows of things we see in the world quantum mechanics we see in the world likelihoods",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.768,
    "end": 412.14,
    "text": " and we see in the world coherent structures so if we want to account for them we need some language and the one that's been invented is category theory and so it makes analogies which are similarities of structure with different content i've got one thing and another thing a is to b as c is to d that similarity is made into a formal object and category theory has been useful in math and computer science physics material science linguistics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.854,
    "end": 418.497,
    "text": " And moreover, one thing I didn't say on the slide is that category theory helps you invent new mathematical fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.917,
    "end": 421.439,
    "text": "They might not be big ones that are studied by a million people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.819,
    "end": 428.144,
    "text": "You might just have a micro custom built accounting system written in category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.544,
    "end": 430.825,
    "text": "So you make a new system of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.306,
    "end": 438.991,
    "text": "And what I'm interested in is what sort of system, accounting system, could we use to account for dynamic interaction, like things interacting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.352,
    "end": 441.733,
    "text": "So the driving question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 443.108,
    "end": 448.669,
    "text": " I really prefer to have a question that I can always be asking instead of one that I need very specific lab to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.149,
    "end": 450.79,
    "text": "So I want to know what we have right here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.03,
    "end": 457.831,
    "text": "I want to account for this incredible world that we have because on earth we have all these amazing forms of life from cells to humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.491,
    "end": 459.992,
    "text": "Like how did that come about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.472,
    "end": 464.052,
    "text": "And we have the built world where we have transportation systems and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.092,
    "end": 465.213,
    "text": "And we have computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.253,
    "end": 466.593,
    "text": "It's an amazing built world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.273,
    "end": 473.099,
    "text": " We have language, the ability to systematically present knowledge like a slideshow or a history book or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.939,
    "end": 477.283,
    "text": "We have morality with rules of thumb for living a good life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.383,
    "end": 478.183,
    "text": "How did that come about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.624,
    "end": 483.609,
    "text": "I think in each of these cases, they evolved through the push and pull and struggle of living.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.109,
    "end": 490.215,
    "text": "So language is refined by continually using language and the way we present knowledge or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.655,
    "end": 495.796,
    "text": " the built world, the way we architect things is continually evolving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.016,
    "end": 501.658,
    "text": "And even morality, like you have a bunch of societies that have to live together and they evolve a way to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.218,
    "end": 504.199,
    "text": "So I want to see all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.719,
    "end": 505.939,
    "text": "I want to account for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.559,
    "end": 512.081,
    "text": "So what are these systems and how do they develop and how do we talk about them all at once?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.381,
    "end": 517.082,
    "text": "What language is appropriate for giving accounts of this happening in action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.666,
    "end": 520.807,
    "text": " And can we use that language to engineer new systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.587,
    "end": 526.249,
    "text": "And then something we were talking about just before we started the talk today is like, what constitutes health or wisdom?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.709,
    "end": 540.315,
    "text": "What gives the system a sense of direction and how come it keeps finding good senses of direction in the sense that evolution, somehow our civilization is offering more today than it did in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.109,
    "end": 548.992,
    "text": " So the only part of this thing I'm going to discuss is the potential accounting system that I'm offering here or like the beginning of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.633,
    "end": 553.215,
    "text": "So in other words, I don't know how all this stuff happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.015,
    "end": 558.998,
    "text": "I just, and I don't want to be the one to figure out how all this stuff happened because obviously it's more than even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.262,
    "end": 578.282,
    "text": " then you know any group of people could really finish or even and i don't even have the capacity to really start but i think there are many people who do and already are doing that and all i'm trying to offer is a way we could put that into some sort of accounting system um okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.238,
    "end": 583.159,
    "text": " So this, this thing that we're doing now is the subject of the talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 583.239,
    "end": 598.263,
    "text": "It's dynamic interaction, morphology, the way that things form like topos Institute formed or a person forms, um, and behavior, all that stuff is about little systems that interact and this interaction structure itself changes through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.803,
    "end": 602.044,
    "text": "And I'll explain a mathematical language for working with that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.604,
    "end": 605.725,
    "text": "But on some level, much of this talk will be a case of its own subject matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.431,
    "end": 612.132,
    "text": " in the sense that I'm interested in the development of life's order, like how does this develop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.572,
    "end": 617.413,
    "text": "But in the science system, this takes place between the interaction between fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.854,
    "end": 624.035,
    "text": "So right now, you guys know much more about active inference and I know more about category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.135,
    "end": 633.257,
    "text": "And so we're participating in this science system where we're interacting and we're having dynamic interaction because after this, the part where I'm just talking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.797,
    "end": 657.703,
    "text": " i'm still looking at yeah blue as she's as she's looking at me and i'm seeing her nod and that that helps me decide what to say next and whether we're where um how this communication is working so we're experiencing the development the the ability for systems interacting to shape you know shape that interaction and become sent like sense make together um in real time here so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.576,
    "end": 665.3,
    "text": " The concepts discussed in this talk should describe the talk itself as an interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.36,
    "end": 671.004,
    "text": "So let me just pause for feedback and just kind of get someone else's voice into the space, if you're willing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.024,
    "end": 675.927,
    "text": "Do you see kind of what I'm saying, that the math I'm talking about here should be capable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.427,
    "end": 680.41,
    "text": "I'm not going to give the description because that would be like filling out the spreadsheet with all the facts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.831,
    "end": 685.534,
    "text": "But it's more like that the math could offer the sort of spreadsheet you would need to talk about this sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.247,
    "end": 698.436,
    "text": " So definitely like math related to interaction is really what active inference is all about and fundamentally describes like sense and perception and action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 699.477,
    "end": 700.758,
    "text": "Daniel joined us for a minute.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 700.818,
    "end": 702.319,
    "text": "Do you have any extra comments?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 702.379,
    "end": 703.94,
    "text": "I have a feeling you have something to say here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 704.761,
    "end": 704.941,
    "text": "No.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 704.961,
    "end": 715.69,
    "text": "I would just ask what can math describe and where do art, science and other things that are not math also play roles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.87,
    "end": 716.731,
    "text": "How do those interact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.029,
    "end": 718.289,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.349,
    "end": 720.01,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.791,
    "end": 721.731,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.751,
    "end": 727.796,
    "text": "So I'm suggesting that math gives you the accounting system and that science fills it in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.616,
    "end": 729.176,
    "text": "But let me...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.283,
    "end": 753.562,
    "text": " yeah yeah so i think i'm going to go into that a little more but so there's a self-reflective character where i'm saying that um you guys just actually participated in an interaction with me and like gave a kind of sense of direction for this talk a little bit or or at least um one thing we want to discuss which is what's what's the role of math and science and so we're kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.457,
    "end": 777.299,
    "text": " creating co-creating uh this sense making work that we're doing here through our interaction and so that's kind of what i'm saying is that there's a self-reflective thing that the talk itself if you want to you can always dive into this itself as a case um so that's kind of hanging around but i'm not going to push really into that the fact that we're building something together here too much more uh but it's here so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.316,
    "end": 785.721,
    "text": " I want to talk about how theory compresses information and there's elaboration and there's feedback from experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.641,
    "end": 790.304,
    "text": "So I think that compression and elaboration play a big role in this story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.805,
    "end": 793.967,
    "text": "We compress our past into a form that we elaborate in the present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.488,
    "end": 796.79,
    "text": "So we're constantly forming memories that are not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.39,
    "end": 802.294,
    "text": " as big as the thing that they're memory of, but they're compressions that we can elaborate in the present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.395,
    "end": 810.321,
    "text": "DNA, for example, compresses a record of who died and who thrived in some sense into a language of four nucleotides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.222,
    "end": 814.644,
    "text": "And theory, any theory is a compression of past experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.685,
    "end": 823.192,
    "text": "So the free energy principle is someone has compressed ideas about what they've seen over and over and over again into a very small form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.972,
    "end": 830.718,
    "text": " And then whether you're talking about DNA or memories or the free energy principle, these are elaborated in the present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.858,
    "end": 835.522,
    "text": "So as I speak this theory about compression or whatever, not very original, but it's here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.662,
    "end": 863.05,
    "text": " that is an elaboration of something that i've compressed into these slides in the past where dna is somehow read by messenger rna and i don't know there's a ribosome involved and stuff and it's elaborated those genes are producing proteins and those proteins are elaborated to are the elaborations that compressed code and they then create the living form of the thing so that seems really important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.49,
    "end": 872.199,
    "text": " And then similarly, experiment and theory, if theory is like compression and experiments like elaboration, these exist both in biological and mathematical fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.639,
    "end": 877.484,
    "text": "So almost everyone who knows what biology is knows that there is experiments involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.844,
    "end": 880.027,
    "text": "But maybe you wouldn't think that math has experimentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 880.507,
    "end": 898.846,
    "text": " and i think that it does but it's the attempts to articulate and compute things that's how you that's how you elaborate it you talk about things and you compute and we value a formalism f if it makes expression and computation easy so that's the experiment like how good is this thing well does it make it easy to say what i want it doesn't make it easy to compute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.466,
    "end": 906.354,
    "text": " So with Roman numerals here, I don't think this is very good at expressing, but I know it's really bad at computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.434,
    "end": 911.079,
    "text": "So if you want to multiply this Roman numeral by this Roman numeral, you're just kind of screwed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.452,
    "end": 914.353,
    "text": " there's no procedure you can go through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.754,
    "end": 924.08,
    "text": "The only procedure I know is to translate them into Hindi-Arabic numerals, 14 and 6, for example, and then use what these are built for, which is using the distributive law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.661,
    "end": 932.486,
    "text": "So 14 is 10 plus 4, and 10 times 6 is easy, and 4 times 6 is easy, so you get 84.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.846,
    "end": 938.931,
    "text": "And so you translate it back into LXXIV, but where that L came from or why there are three Xs, you'll never figure out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.751,
    "end": 940.051,
    "text": "It's just 84.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.576,
    "end": 944.297,
    "text": " So the Hindi Arabic numerals I'm saying are empirically better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.838,
    "end": 946.638,
    "text": "Like they just win games, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.678,
    "end": 957.083,
    "text": "Like Fibonacci not only came up with the one, one, two, three, five, eight sequence, but probably more importantly was the one who brought the Hindi Arabic numerals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.163,
    "end": 961.065,
    "text": "So the Hindus apparently invented them and the Arabs saved them for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.105,
    "end": 965.707,
    "text": "And then Fibonacci found them and brought them to the West and they're just better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.867,
    "end": 966.448,
    "text": "They just won.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.248,
    "end": 967.909,
    "text": " They just want out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.01,
    "end": 973.813,
    "text": "And that's the way that experiment exists in math, how easy it is to use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.514,
    "end": 979.878,
    "text": "And that's the sort of value claim I'm making about what I'm discussing today, that it's a single accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.219,
    "end": 986.904,
    "text": "You're not constantly changing what the notation means or changing how you're thinking about things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.964,
    "end": 991.688,
    "text": "It's all one system, and it just works really well with itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.203,
    "end": 995.844,
    "text": " So the plan for the talk is that it'll be in four parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.404,
    "end": 999.965,
    "text": "I'll give a presently available case of the thing I'm trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.446,
    "end": 1002.866,
    "text": "I'll give a whirlwind tour of what the math actually looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.487,
    "end": 1007.468,
    "text": "I'll talk about some existing applications and open questions, and then I'll conclude with a summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.959,
    "end": 1036.834,
    "text": " okay so the current dynamic arrangement so this zoom call that we're having right now and maybe with the youtube live stream and the people on the chat etc is a dynamic arrangement so how do we think about it i want to break it into three structures um interfaces dynamics and interactions so i'm going to have like i think overall six keywords and these are three of them and i'm sorry there's so many but they all are different um so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.217,
    "end": 1039.559,
    "text": " Each one of us has an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.639,
    "end": 1041.742,
    "text": "So it's what I can express and take in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.042,
    "end": 1046.007,
    "text": "I'm expressing through the changes of my vocal cords and the movement of my hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.548,
    "end": 1051.074,
    "text": "And I'm taking in information through the sensations in my body and my eyes and my ears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.199,
    "end": 1054.06,
    "text": " And then each one of us has dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.3,
    "end": 1062.802,
    "text": "So I have some internal state that you can't see exactly, but I'm in some mood and I'm expecting to read and all that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.902,
    "end": 1068.444,
    "text": "And then that's updated by what I see you guys doing or what I'm reading on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.144,
    "end": 1076.366,
    "text": "And then between us, there's interaction, which is how my outputs, my expression affects you and how your expression affects me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.066,
    "end": 1079.487,
    "text": "So those are what I think is going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.507,
    "end": 1081.828,
    "text": "A lot of what's going on in this dynamic arrangement between us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.348,
    "end": 1085.691,
    "text": " it's really useful to draw boundaries around things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.931,
    "end": 1089.135,
    "text": "So you modularize by nesting reference frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.976,
    "end": 1098.166,
    "text": "We have little, reference frames, all I mean by that, I don't necessarily mean the thing they mean in relativity theory, although I think that would be a case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.286,
    "end": 1099.368,
    "text": "A reference frame is just a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.822,
    "end": 1106.366,
    "text": " a box you put around things and you say, I can refer to this as Alice and this as Bob and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.486,
    "end": 1110.789,
    "text": "I want a frame where I get to have a notation or a way to refer to things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.389,
    "end": 1117.473,
    "text": "And we have littler systems interacting within bigger systems all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.573,
    "end": 1120.635,
    "text": "We could say that a atom with its, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.702,
    "end": 1128.624,
    "text": " electron orbitals or whatever is some kind of reference frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.044,
    "end": 1130.564,
    "text": "But atoms are even molecules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.584,
    "end": 1133.125,
    "text": "We could think of the molecules as a reference frame for all of its atoms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.625,
    "end": 1134.825,
    "text": "You can point to them and refer to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.446,
    "end": 1139.987,
    "text": "Organizations and societies, we modularize and we say, that's a thing, that's a thing, that's a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.527,
    "end": 1141.808,
    "text": " And we are putting things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.328,
    "end": 1144.549,
    "text": "And that's useful in evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.689,
    "end": 1154.133,
    "text": "So for example, according to Herbert Simon, like that's how evolution is so fast is because it modularizes our liver and our stomach and let them evolve independently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.134,
    "end": 1160.816,
    "text": "But also, or various systems, circulatory or nervous system, etc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.256,
    "end": 1164.638,
    "text": "But also, it's useful in the way we think humans think about things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.828,
    "end": 1169.349,
    "text": " I want to emphasize again that the map here will not be numerical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.409,
    "end": 1170.189,
    "text": "It'll be structural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.369,
    "end": 1173.55,
    "text": "So as we move into the map, you'll see how it manages these reference frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.19,
    "end": 1181.032,
    "text": "And so like geometry is about shapes, geometry doesn't have much number in it, but there are numbers a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.072,
    "end": 1186.433,
    "text": "There's like how big the angle is and how big the sides are, but it's really about the shapes and the congruences and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.114,
    "end": 1209.938,
    "text": " and similarly you can put numbers into category theory it accepts that but it's really about the structure of why you're using those numbers and which numbers can be added to other numbers or what the rules are about the numbers and really you don't need numbers at all the relationships that are happening here for example are not numerical but before we get there let's make sure we understand our principal subject because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.536,
    "end": 1217.52,
    "text": " We'd like this map to be able to describe things we work with, like cells or tadpoles or us or institutes or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.502,
    "end": 1223.785,
    "text": "And soon I'll define what I mean by interface as a mathematical object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.726,
    "end": 1227.708,
    "text": "But I want to ground this talk in something we can all think about together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.768,
    "end": 1231.331,
    "text": "And since we don't have cells or tadpoles here, we're the subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.232,
    "end": 1237.597,
    "text": " this Zoom call, let's say, with a live stream and all that is the subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.118,
    "end": 1239.299,
    "text": "How do we think about ourselves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.859,
    "end": 1242.763,
    "text": "Well, each one of us can do certain things and receive certain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.07,
    "end": 1245.831,
    "text": " Okay, so I can move and listen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.391,
    "end": 1253.694,
    "text": "We each outwardly express and take in what we do there with what I'm calling our interface, as I said before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.274,
    "end": 1258.376,
    "text": "And I'm going to call these things, the blue will always be the things we can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.816,
    "end": 1268.1,
    "text": "So it's like the positions of my body and the green will be what I can take in, kind of like what's the forces that act on me or the sensorium I have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.94,
    "end": 1288.894,
    "text": " um that acts on me so any expression whether it's a sound or attitude is a kind of position it's a position i'm taking and kind of popular like parlance or whatever someone's expressing themselves or taking a position but you could also imagine the position of my vocal cords uh moving around and that that movement of position is an expression that comes out as sound",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.535,
    "end": 1293.416,
    "text": " your inner states are reflected outwardly as these positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1293.856,
    "end": 1302.818,
    "text": "It's happening maybe faster than you can recognize in the case of vocal cords, but it's still an expression using the blue, the positions, the outward expression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.418,
    "end": 1307.739,
    "text": "And then the world impinges on you and me, and it directs me, and it moves me by forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1307.819,
    "end": 1308.38,
    "text": "So when I see...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.2,
    "end": 1326.048,
    "text": " you know there could be literal forces on me or you could just say hey would you mind passing the salt and that impinges on me it directs me to pass the salt it moves me maybe i don't do it but at least it changes my internal state to being uh being stubborn or something or to being helpful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.99,
    "end": 1331.072,
    "text": " So what your body can receive in a moment, this is a kind of weird one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.092,
    "end": 1335.555,
    "text": "I'm not going to emphasize it that much, especially later, but it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.216,
    "end": 1339.318,
    "text": "I think that what your body can receive in a moment depends on its position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.818,
    "end": 1345.382,
    "text": "So when your eyes are open, the type of thing you can get in through your eyes is bigger than when your eyes are closed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.963,
    "end": 1347.504,
    "text": "So more can act on you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.864,
    "end": 1350.266,
    "text": "If I close my eyes, I just won't know what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.266,
    "end": 1354.208,
    "text": "And when your car goes through a tunnel, the GPS stops receiving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.929,
    "end": 1356.37,
    "text": "And when you unplug your monitor,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1357.503,
    "end": 1363.106,
    "text": " from your computer, it's no longer, or your keyboard, it's no longer receiving things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.226,
    "end": 1367.008,
    "text": "So the position can affect what it can receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.089,
    "end": 1370.87,
    "text": "The monitor is no longer receiving from the computer if you disconnect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.011,
    "end": 1378.134,
    "text": "So the story so far is that you output blue positions and you, E-L-U-E,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.689,
    "end": 1380.952,
    "text": " and you input forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.953,
    "end": 1388.862,
    "text": "And so the force or sensation or input that you receive changes your internal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.935,
    "end": 1392.636,
    "text": " And then your state is reflected outwardly as a new position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.696,
    "end": 1397.096,
    "text": "I move my eyes or my head or my voice box and a new sensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.197,
    "end": 1409.679,
    "text": "And then if I close my eyes or open my eyes, I have this, whatever happens, it may be the same space of sensations or different, but I see new sensations and those change my internal state, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.979,
    "end": 1415.0,
    "text": "So this is repeat loops repeatedly, either discreetly if you want to model it that way or continuously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.46,
    "end": 1418.761,
    "text": "But then where do these forces inputs come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.808,
    "end": 1420.988,
    "text": " They come from this interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.228,
    "end": 1425.589,
    "text": "The way that we're arranged here, we're calling it an arrangement and that's going to be another keyword.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.549,
    "end": 1432.591,
    "text": "Zoom arranges it so that my outputs get to you as inputs so you can hear me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.851,
    "end": 1439.692,
    "text": "As you receive what I say, your body shifts and that's your output and that comes to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.612,
    "end": 1443.473,
    "text": "The way this works is based on the arrangement that we're calling Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.513,
    "end": 1448.014,
    "text": "Now we have another color, orange, and the program arranges it so we can input each other's outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.028,
    "end": 1452.029,
    "text": " And our interaction with the program may change the arrangement itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.609,
    "end": 1459.412,
    "text": "So if Daniel wanted to, he could spotlight me or mute me or change how the information is passed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.052,
    "end": 1468.475,
    "text": "And so the very things that you're doing, the outputs that Daniel is doing or me, I could ask him to do that, or I could mute myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.976,
    "end": 1472.937,
    "text": "The part of our outputs have the ability to change the arrangement between us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1473.737,
    "end": 1474.898,
    "text": "We can walk away or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1475.885,
    "end": 1476.986,
    "text": " You don't have to actually view me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.186,
    "end": 1480.627,
    "text": "I don't know why you're smiling, but I'm imagining you doing some practical jokers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.728,
    "end": 1482.988,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.008,
    "end": 1485.549,
    "text": "So I'm going to move into the math now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.569,
    "end": 1486.77,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.64,
    "end": 1495.505,
    "text": " Okay, so this algebraic theory of interfaces and arrangements, there's a bunch of keywords we're gonna use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1496.166,
    "end": 1497.287,
    "text": "And here are the six, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.547,
    "end": 1499.329,
    "text": "One, two, three, four, five, six, oh, seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.869,
    "end": 1505.275,
    "text": "Interfaces, positions, forces, states, arrangements, enclosures, nesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.375,
    "end": 1507.016,
    "text": "Okay, I don't think I've said all of them so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.817,
    "end": 1522.419,
    "text": " but they shouldn't be too bad at this point so we each have an interface it's what we can it's that through which we interact our interfaces allows ourselves to express ourselves outward through our position and given a position our interface allows us to receive certain forces or sensations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.42,
    "end": 1549.62,
    "text": " our state is changed by the by the received force and then our state is expressed as a position so our state changes based on what we see and then we express it and then multiple interfaces interact together via their current arrangement how we're arranged together it doesn't have to be spatial arrangement we are the three of us here on the zoom call are arranged i guess in space but really more importantly in terms of how zoom wants to arrange us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.495,
    "end": 1557.361,
    "text": " And we also interact with our enclosure, which is the thing outside is another interface and these arrangements can be nested hierarchically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.401,
    "end": 1559.903,
    "text": "So here's a picture and it's a kind of schematic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.943,
    "end": 1564.887,
    "text": "It's not supposed to be what we really are, but every box here is an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.087,
    "end": 1571.632,
    "text": "So I have one, two, three, four, five, but I also have Y1 as an interface, Y2 as an interface and Z as an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.193,
    "end": 1576.056,
    "text": "And the way I want to draw it is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.503,
    "end": 1582.888,
    "text": " The interfaces, each interface has on the right, I'm going to draw the positions, the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.189,
    "end": 1590.676,
    "text": "So this thing is pushing out stuff to the right and on the left it's inputting forces or directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.056,
    "end": 1593.619,
    "text": "So maybe this is me here and I'm,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.324,
    "end": 1617.813,
    "text": " seeing through my eyes and i'm outputting some visual signal and i'm outputting some auditory signal and then somebody else is receiving that auditory signal and seeing some other thing and that other person is saying something and doing something okay so each box will have the positions it can be on on the left on the right sorry and the inputs or sensations or forces on the left",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.553,
    "end": 1644.018,
    "text": " and my outputs become things that force you or direct you or push you or um our input to you if we're connected like this uh so inside of each box you could imagine there's a state and it's changing based on what's coming in from the left-hand wires so inside of each box is a state and it's it's being affected by what's on the left and it's pushing out data on the right and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.761,
    "end": 1648.083,
    "text": " the multiple interfaces are interacting together in this arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.483,
    "end": 1651.264,
    "text": "So Y1 is supposed to be the outer box here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.365,
    "end": 1653.406,
    "text": "This middle-sized red box is Y1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.066,
    "end": 1656.687,
    "text": "The arrangement is this formation of wires here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.628,
    "end": 1660.81,
    "text": "This Y1 thing is the enclosure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.93,
    "end": 1670.615,
    "text": "It is enclosing these three things, like Topos Institute encloses some workers inside of it, or I enclose some organs inside of me or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.365,
    "end": 1674.568,
    "text": " And then these arrangements finally can be nested hierarchically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.648,
    "end": 1679.453,
    "text": "So there's me and there's you, and then we're communicating, but inside of us is more stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.533,
    "end": 1681.115,
    "text": "And then we are forming this zoom call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.415,
    "end": 1681.676,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.798,
    "end": 1689.424,
    "text": "I hope all that terminology is making sense and feels natural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.506,
    "end": 1696.971,
    "text": " The thing I didn't say here and is very hard to draw is that the arrangements can change through time based on what flows within them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.331,
    "end": 1706.958,
    "text": "So if I say, hey, please mute me or something like that, it might change the arrangement so that you're no longer receiving from me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.319,
    "end": 1709.42,
    "text": "So the arrangement can change your time based on what flows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.901,
    "end": 1712.503,
    "text": "At the end of this call, when we say goodbye, it will change the arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.876,
    "end": 1717.418,
    "text": " Okay, so now we're really moving into the math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.458,
    "end": 1721.444,
    "text": "So as we said, an interface consists of two things, a set of positions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.361,
    "end": 1728.346,
    "text": " Maybe I can be in three positions, A, B, or C. Or maybe I have 44 real numbers worth of positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.886,
    "end": 1733.77,
    "text": "I'm just outputting this gigantic 44-dimensional vector constantly or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.33,
    "end": 1741.575,
    "text": "But the point is to make an accounting system so you can model what you think are what the positions are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.996,
    "end": 1748.821,
    "text": "Maybe you can decide for yourself what set of positions a being of type A could have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.129,
    "end": 1752.451,
    "text": " what set of positions being of type B could have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.271,
    "end": 1760.677,
    "text": "So secondly, for every position, there's a set of forces, F, F bracket I, or inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.039,
    "end": 1764.319,
    "text": "You could call it the sensorium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.8,
    "end": 1766.661,
    "text": "It's what can arrive when you're in that position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.761,
    "end": 1770.664,
    "text": "If you're a protein and you're folded up, maybe you just can't receive certain things on your interior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1771.084,
    "end": 1774.027,
    "text": "You don't receive charge, but when you're unfolded, you're receiving charge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.049,
    "end": 1781.575,
    "text": " or if you're a hedgehog, as Toby Smyth says, when you're folded up, you can't receive stuff on your belly or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.376,
    "end": 1790.223,
    "text": "Okay, so we'll encode this as a polynomial in a single variable Y. Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.243,
    "end": 1790.303,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.423,
    "end": 1795.788,
    "text": "Because it stands for Yoneta in category theory, and because it doesn't, I don't know, somehow it's kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.73,
    "end": 1798.911,
    "text": " makes you realize this isn't your standard polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.931,
    "end": 1800.552,
    "text": "It's not an x, but I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.652,
    "end": 1803.354,
    "text": "I just use y. It's traditional for me at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.954,
    "end": 1806.475,
    "text": "And this is going to be a polynomial with non-negative coefficients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.955,
    "end": 1812.839,
    "text": "When you think of polynomials, you might think about numbers and like x squared of 5 is 25 and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.859,
    "end": 1815.44,
    "text": "But I'm not going to be plugging in numbers into these polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.96,
    "end": 1821.843,
    "text": "They're really just ways of housing the data structure or like what we're going to want to work with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.364,
    "end": 1824.625,
    "text": "So I know it's strange, but it works really well and it's formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.285,
    "end": 1832.65,
    "text": " And I don't want you to freak out when you see the sum sign because even though I'm showing you the map, I'm not intending for you to completely follow it or need it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.131,
    "end": 1834.152,
    "text": "It's an accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.672,
    "end": 1839.455,
    "text": "But like Fibonacci coming to the West, you might not be able to use it right away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.555,
    "end": 1841.697,
    "text": "But if you're interested, you could learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1842.337,
    "end": 1845.34,
    "text": "So an interface might be that this would be the whole interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.06,
    "end": 1853.806,
    "text": "It'd be a set of positions p and this dummy variable y that's always just going to be there because it kind of holds the place for this exponent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.935,
    "end": 1865.043,
    "text": " And the exponent in the position i is the set of forces you can get in position i. So now we've made math for this interface thing, which has positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.524,
    "end": 1870.608,
    "text": "And for every position, a set of forces that can depend on the position, whether your eyes are closed or open, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.096,
    "end": 1880.42,
    "text": " So imagine the interface was the sum of y to the fifth, y cubed, y cubed, y cubed 62 times, y to the zero, y to the zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.74,
    "end": 1881.561,
    "text": "You add all those up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.241,
    "end": 1884.762,
    "text": "That would have one position that had five inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.263,
    "end": 1889.765,
    "text": "So this sensorium, when the person's in this position, would be five possible distinctions they could make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.717,
    "end": 1896.56,
    "text": " Whereas in these 62 positions, they could run around these 62 and you would watch them running around here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.66,
    "end": 1901.362,
    "text": "And every time you would know they're receiving three possible distinctions as inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.442,
    "end": 1903.302,
    "text": "Whereas when they're over here, they're receiving five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.743,
    "end": 1905.383,
    "text": "When they're over here, they're receiving zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.144,
    "end": 1908.184,
    "text": "They can't receive ever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.305,
    "end": 1908.925,
    "text": "They can't receive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.165,
    "end": 1913.487,
    "text": "Here's another polynomial, r cubed y to the r to the million.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.326,
    "end": 1916.628,
    "text": " it satisfies this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.648,
    "end": 1918.349,
    "text": "These don't have to be finite sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.79,
    "end": 1922.232,
    "text": "So in this thing, its positions, it runs around R3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.633,
    "end": 1929.899,
    "text": "So now it's running around not only on the surface of the Earth, but it's just running around wherever it wants to in some kind of fixed coordinate system of the world, of the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.479,
    "end": 1937.205,
    "text": " And at any point, no matter where it is, it's always receiving exactly a million inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.385,
    "end": 1940.548,
    "text": "So maybe it's receiving a thousand by thousand image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.249,
    "end": 1941.87,
    "text": "It's got some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.29,
    "end": 1943.551,
    "text": "So that's what it's receiving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.831,
    "end": 1944.792,
    "text": "But you just make your own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.032,
    "end": 1949.757,
    "text": "It's an accounting system for you to make your own thing, your own interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.439,
    "end": 1952.46,
    "text": " and you can make as many as you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.04,
    "end": 1955.261,
    "text": "So why do all this craziness with polynomials?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.341,
    "end": 1960.403,
    "text": "Because what's amazing to me is that the polynomial operations mean things in terms of interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.983,
    "end": 1962.044,
    "text": "We can add polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.364,
    "end": 1963.064,
    "text": "You know how to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.225,
    "end": 1965.465,
    "text": "You can multiply polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.485,
    "end": 1968.146,
    "text": "You might remember you do some kind of, people call it FOIL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.866,
    "end": 1971.267,
    "text": "You just kind of multiply the polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.667,
    "end": 1974.909,
    "text": "You can compose two polynomials, like P of Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.257,
    "end": 1980.278,
    "text": " But then there's some operations you probably haven't heard of like tensor and or and internal hum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.358,
    "end": 1988.6,
    "text": "And these are just, these are what are called monoidal structures and a monoidal closure on a category of polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.94,
    "end": 1990.421,
    "text": "And I'm not telling you what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.341,
    "end": 1996.903,
    "text": "If you know some category theory, you can look at it, you know already what it means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.383,
    "end": 2001.364,
    "text": "But they all mean something to us in terms of what you can do to interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.233,
    "end": 2003.694,
    "text": " And I'm just repeating this interface here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.734,
    "end": 2010.237,
    "text": "So if I had one of these called P and you had one of these called Q, you could add them, you could multiply them, you could compose them, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.979,
    "end": 2016.4,
    "text": "So suppose P and Q are polynomials representing two different interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.301,
    "end": 2020.162,
    "text": "Then what's P plus Q?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.603,
    "end": 2022.263,
    "text": "Well, it's another polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.323,
    "end": 2023.904,
    "text": "So it again represents an interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.765,
    "end": 2028.787,
    "text": "And it would be the interface that can output a position of P or of Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.263,
    "end": 2038.808,
    "text": " And its sensorium in a given position is whichever, if it's a position of P, it would be the sensorium of that thing or the forces there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.248,
    "end": 2043.651,
    "text": "And if it's a position of Q, it would be the sensorium or forces that you can get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.371,
    "end": 2053.637,
    "text": "So if P was this interface, this kind of thing that output these sorts of positions and input these sorts of forces, and Q is this one, then P plus Q is what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.757,
    "end": 2056.779,
    "text": "Nine Y to the fifth plus two Y to the fourth plus Y cubed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.26,
    "end": 2058.921,
    "text": "And that would be like a machine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.421,
    "end": 2085.024,
    "text": " that can be either in one of these three states or one of these three six states and sorry um positions and when they are they'd be inputting five possible distinctions or one of these two inputting four possible distinctions etc so um that's what p plus q represents it's somehow um making a new interface but p times q represents making a new interface in a different way uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.131,
    "end": 2088.012,
    "text": " something with this interface would output both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.412,
    "end": 2115.022,
    "text": "You have to remember how you multiply polynomials, but basically the sum ends of the product polynomial, a sum end of this thing is a sum end of P and a sum end of Q. So the positions of this thing would be a pair consisting of a position of P and a position of Q. But an input there or a sensation or a distinction you can make there would be one of either P or of Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.899,
    "end": 2126.804,
    "text": " Because just if you remember, what if p was 5y to the fourth, outputs five different things, and inputs four no matter what, and q is 6y cubed, outputting six and inputting three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2127.104,
    "end": 2130.286,
    "text": "Then when you multiply them, you would output 30.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.386,
    "end": 2132.907,
    "text": "I'm just multiplying straight across here, 30y to the seventh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.427,
    "end": 2139.33,
    "text": "So you output both a position in p and a position in q, a position in this 5 by 6 grid here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2141.769,
    "end": 2148.44,
    "text": " And then you'd input one of seven things, either something to P or something to Q. That's just what times does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.141,
    "end": 2151.425,
    "text": "You could say, well, I want to input to both of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.505,
    "end": 2153.048,
    "text": "I don't want to input to just one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.837,
    "end": 2156.199,
    "text": " then you're using a different operation called tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.62,
    "end": 2168.091,
    "text": "So p tensor q takes these two things and multiplies both the positions and the directions and the sensoria and lets you output both and input both all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.711,
    "end": 2172.995,
    "text": "So this operation does that, times operation does what I said, plus operation does that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.476,
    "end": 2174.777,
    "text": "Composition is an interesting one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.257,
    "end": 2178.66,
    "text": "When you compose polynomials what it would do is an output would be something that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.381,
    "end": 2188.498,
    "text": " output of P, and then also a strategy for no matter what the P input was and output of Q. It doesn't have to wait for you to tell it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.292,
    "end": 2195.279,
    "text": " what the input to P was, it'll just give you the strategy for automatically outputting a Q thing once you know an input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.14,
    "end": 2200.364,
    "text": "It runs P then Q in series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.404,
    "end": 2203.087,
    "text": "This thing outputs a protocol.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.468,
    "end": 2206.932,
    "text": "I think I'm going to say that on the next slide a little better or pretty soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.332,
    "end": 2210.656,
    "text": "The OR operation runs either P or Q or both in parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.192,
    "end": 2219.414,
    "text": " And then this bracket operation runs arrangements for wiring P and Q, if you remember what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.315,
    "end": 2228.857,
    "text": "I'll get into this a little more, but this one is going to output arrangements of P and Q and input what flows on the wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.677,
    "end": 2231.238,
    "text": "So that's going to be an interesting one for us later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.25,
    "end": 2237.153,
    "text": " All I'm really saying is that all these different operations take interfaces and make new interfaces out of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.753,
    "end": 2241.776,
    "text": "That allows you to build things up modularly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.135,
    "end": 2247.017,
    "text": " We can also formalize the notion of arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.137,
    "end": 2254.221,
    "text": "So we thought about ourselves in the Zoom call as an arrangement because Zoom lets my outputs be your inputs and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.702,
    "end": 2262.026,
    "text": "But you could also think about cells and organs or cell organs arranged in a cell or cells in a tissue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.967,
    "end": 2267.59,
    "text": "The arrangement is just how the information passes between those interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.97,
    "end": 2273.073,
    "text": "I'm not so concerned about the spatial arrangement except as it allows information to pass between the interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.195,
    "end": 2277.439,
    "text": " So here's a picture again, and the orange thing is the arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.862,
    "end": 2281.604,
    "text": "So two things about this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.304,
    "end": 2285.969,
    "text": "You can see that the arrangement is how information passes between interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.549,
    "end": 2287.971,
    "text": "You can kind of see it visually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.952,
    "end": 2290.474,
    "text": "But two things about this will be generalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.622,
    "end": 2294.984,
    "text": " First, the information sharing can be much messier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.364,
    "end": 2299.026,
    "text": "You don't, except in a circuit, you don't just have perfect wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.707,
    "end": 2302.068,
    "text": "The inputs here might be affected by all sorts of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.609,
    "end": 2306.971,
    "text": "And second, the information sharing can change, like the interfaces can change shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.432,
    "end": 2311.554,
    "text": "I might close my eyes, but also the thing I say to you might change our interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.654,
    "end": 2315.217,
    "text": "So that's contained in this notion of an arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.05,
    "end": 2325.996,
    "text": " So formally, if you do know category theory, then you've probably heard of categories, functors, and natural transformations, and polynomials are in fact functors from set to set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.576,
    "end": 2332.8,
    "text": "And an arrangement, it looks like this picture, but all I mean by it is a natural transformation of polynomials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.22,
    "end": 2337.903,
    "text": "So every one of these pictures can be translated into a natural transformation of polynomial functors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.304,
    "end": 2345.068,
    "text": "And what this picture would be is you take the little arrangement, little interfaces, P1, P2, P3, P4, P5,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.509,
    "end": 2357.875,
    "text": " You would tensor them together, and then the arrangement itself would be a natural transformation from P1 tensor P2 tensor P5 to Q, the outer interface here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.583,
    "end": 2361.284,
    "text": " Now what's happening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.344,
    "end": 2362.825,
    "text": "So brief interlude for meta stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.865,
    "end": 2367.988,
    "text": "I just told you that an arrangement is a natural transformation of polynomial functors and all that's category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.008,
    "end": 2369.809,
    "text": "And I'm not expecting you to know category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.829,
    "end": 2371.65,
    "text": "I'm not expecting the audience to know category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.071,
    "end": 2375.213,
    "text": "So what's up with, why would I even tell you that stuff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.713,
    "end": 2377.674,
    "text": "I'm just trying to show you what the math looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.914,
    "end": 2384.679,
    "text": "Let any technical person in the audience who does know category theory see what I'm talking about and kind of know where to look for what's next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.279,
    "end": 2390.662,
    "text": " But for everyone else, or everyone, I just want to show what the math looks like and what it's about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.203,
    "end": 2395.625,
    "text": "Because so much of math is quantitative, or maybe it's about shapes or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.825,
    "end": 2398.167,
    "text": "But this math is really different, so I want you to see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.187,
    "end": 2401.989,
    "text": "Because I want you to ask, how is this math, and what is it for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.589,
    "end": 2404.23,
    "text": "And the point is, it's about interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.33,
    "end": 2407.172,
    "text": "It's about how you manipulate them, how you arrange them, how you nest them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.799,
    "end": 2412.003,
    "text": " And interfaces have outputs and inputs, and they're captured that can depend on the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.443,
    "end": 2420.991,
    "text": "And that sort of structure is kind of hard to talk about cleanly, but it's really well captured with polynomials, not considered as functions, but as ways of holding structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.572,
    "end": 2427.036,
    "text": "And then you can do these operations to the polynomials, and they let you make new interfaces from old.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.99,
    "end": 2451.665,
    "text": " and we'll be talking about arrangements and dynamics next but again they'll just be in this category of polynomial functors that um it's all kind of the same story again and again we don't have to change our accounting system to move between interfaces arrangements nesting dynamics etc okay so dynamics let's look at this arrangement again what if every pi all these p's had a dynamical system running it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.233,
    "end": 2455.02,
    "text": " Well, then what I'm saying here is that Q therefore would too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.862,
    "end": 2458.749,
    "text": "So a dynamical system is a thing with states that evolve through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.801,
    "end": 2484.209,
    "text": " uh my current emotional state or the state of like where i think i am in the talk or whatever is my current state and then i look at you guys and i see what you're looking like or i'll read the slide and then it changes and then i um i output something so that's what a dynamical system is and then it can be formalized as a system of odes or or a discrete dynamical system or you can just think of it as a high level idea um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.072,
    "end": 2488.253,
    "text": " And I've said this so many times now, but I'll say it one more time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.293,
    "end": 2494.735,
    "text": "You're in a state that shows up as your position, in other words, your output, and then any possible input you get would change your state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.176,
    "end": 2499.397,
    "text": "And right, so the math could be discrete or continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.417,
    "end": 2501.917,
    "text": "It both works in this polynomial setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.738,
    "end": 2509.06,
    "text": "So mathematically, a dynamical system on P is a natural transformation, SY to the S to P.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.445,
    "end": 2512.645,
    "text": " where S is a set of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.125,
    "end": 2514.246,
    "text": "And again, why am I telling you this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.346,
    "end": 2515.766,
    "text": "Because all the math looks the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.006,
    "end": 2528.369,
    "text": "Whether you're talking about arrangements as natural transformations between polynomial functors, or you're talking about dynamical systems themselves inhabiting these interfaces, they're all just natural transformations between polynomial functors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.009,
    "end": 2539.331,
    "text": "And then, given the arrangement of all these P's inside of Q, which is natural transformation, and given this natural transformation here that puts dynamics in each of them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.134,
    "end": 2548.26,
    "text": " you get the dynamics in Q. So if each PI had a dynamical system in it, so would Q by composing natural transformations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.342,
    "end": 2553.964,
    "text": "So this is currently the last math slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.984,
    "end": 2557.406,
    "text": "I want to think about dynamics a bit more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2557.426,
    "end": 2563.63,
    "text": "So if you remember a few slides ago, I was talking about operations in a dynamical system on P plus Q.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.98,
    "end": 2567.481,
    "text": " would be one that can switch between P mode and Q mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2567.521,
    "end": 2573.564,
    "text": "So sometimes you're outputting P stuff and inputting from it, and sometimes you're outputting Q stuff and inputting from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.384,
    "end": 2577.965,
    "text": "Sorry, I'm a little bit sick, so my voice is not great today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.886,
    "end": 2583.728,
    "text": "A dynamical system on P times Q would output both simultaneously in any state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.408,
    "end": 2587.689,
    "text": "It's outputting both, but we can receive from just one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.87,
    "end": 2593.312,
    "text": "A dynamical system on P tensor Q would output both and receive from both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.386,
    "end": 2616.311,
    "text": " A dynamical system on P composed Q would be, would do the serial protocol where it outputs a P and outputs a strategy for taking any input on P and send and turning it into an output on Q. And then it would listen for an input on P and an input on Q. So kind of just tells you, here's what I'm going to do no matter what you, it gives you a serial protocol is what I'm saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.011,
    "end": 2619.251,
    "text": "And what about P inter hom Q?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.391,
    "end": 2622.772,
    "text": "This is the, in the category of polynomials functors, there is a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.368,
    "end": 2638.279,
    "text": " internal home for tensor you may have absolutely no idea what i'm talking about but it's something that comes with the math that no one created it it wasn't invented it just is part of the structure kind of like the complex numbers are miraculous in the sense that you um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.306,
    "end": 2661.296,
    "text": " you say you want algebraic closure and all of a sudden you get you get if i have one derivative then i have all derivatives and stuff like that so it's kind of the category of polynomial functions is kind of miraculous it has tons and tons of structure that no one asked it to have it just hasn't but what is this structure this internal hum well it's the sort of thing that runs arrangements for p and q so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.478,
    "end": 2670.504,
    "text": " A dynamical system on this thing, where I tensor P1, P2, P3, P4, P5, comma Q and put it in brackets, this internal hom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.204,
    "end": 2674.006,
    "text": "What it does, it's a dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.607,
    "end": 2678.549,
    "text": "This is a polynomial, even though it looks like a big expression, it's itself a polynomial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.45,
    "end": 2683.773,
    "text": "And this polynomial has outputs and has inputs as usual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.273,
    "end": 2687.816,
    "text": "And so what a dynamical system on this would do is would be output arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.316,
    "end": 2691.939,
    "text": "It output, okay, now I want you to wire to you and you to wire to you and you to wire to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.546,
    "end": 2700.89,
    "text": " So if you were forming an institute, you'd say, wow, let's have this guy report to that person and all that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.35,
    "end": 2702.811,
    "text": "And you would create some arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.57,
    "end": 2706.191,
    "text": " And then that's what you output as the CEO, say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.831,
    "end": 2713.032,
    "text": "And then you listen and you see what flows on the wires and you see how Alice is talking to Bob and how Bob is talking to Carla and all that stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.672,
    "end": 2714.592,
    "text": "And you'd listen to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.913,
    "end": 2720.554,
    "text": "And as you listen, you'd say, hey, actually, I want Bob to report to Carla instead of Alice or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.014,
    "end": 2722.994,
    "text": "And so you would change the arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.294,
    "end": 2730.756,
    "text": "Your internal state would be to listen and receive the stuff that's flowing on the wires and you'd be affected by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.156,
    "end": 2733.136,
    "text": " and then you'd output new arrangements for the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.716,
    "end": 2735.917,
    "text": "And I think that's kind of getting to this morphology thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.997,
    "end": 2748.539,
    "text": "Maybe there are systems that are monitoring the sorts of transmissions that are happening between subsystems and then outputting new ways that they should arrange each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.459,
    "end": 2751.92,
    "text": "Okay, so let me give some applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.8,
    "end": 2756.44,
    "text": "Digital circuits and control systems fit neatly here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.42,
    "end": 2760.121,
    "text": "So a computer is a nested arrangement of dynamical systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.761,
    "end": 2765.763,
    "text": " every transistor, the dynamical system, and two of them make up a NAND gate, not AND.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.204,
    "end": 2771.746,
    "text": "And then you can get an OR gate by wiring together three NAND gates like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.766,
    "end": 2779.069,
    "text": "So I've taken my inputs and I split them and I feed them to the NAND and to the NAND and then I put them together and I put them into the NAND and now I have OR.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.33,
    "end": 2788.134,
    "text": "And this whole thing is just like NAND has two inputs and one output, this whole thing has two inputs and one output, but it's got some internal structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.415,
    "end": 2790.395,
    "text": "And now we've got an OR gate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.984,
    "end": 2808.388,
    "text": " We could nest OR gates and AND gates and NAND gates, and we can get adder circuits and multiplying circuits and ALUs, arithmetic units, whatever, and CPUs and monitors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.728,
    "end": 2810.389,
    "text": "And they're all made just with transistors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.509,
    "end": 2818.292,
    "text": " Like the memory cells are all like flip-flops or just situated transistors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.813,
    "end": 2824.596,
    "text": "And so we can kind of make this nested system of transistors and get a computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.056,
    "end": 2827.318,
    "text": "And so the arrangement here is all really simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.278,
    "end": 2829.519,
    "text": "It's never changing in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.779,
    "end": 2830.6,
    "text": "It's soldered in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.18,
    "end": 2831.7,
    "text": "It's fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.781,
    "end": 2835.383,
    "text": "Unlike us on the Zoom call, its dynamics are simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2835.863,
    "end": 2837.784,
    "text": "Every state is just a function of the input only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.374,
    "end": 2841.996,
    "text": " And it just uses, there's no memory in the transistors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.597,
    "end": 2849.841,
    "text": "And yet because of loops in the wiring, in the arrangement, we get all possible things that the computer can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.661,
    "end": 2859.247,
    "text": "So with enough nesting and enough interesting arrangements, even though the arrangements internally are not that difficult, when you nest them, they get really,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.907,
    "end": 2886.018,
    "text": " amazing in the sense you get a computer and that is the dynamical system that is happening right now allowing for this zoom call to take place i guess there's some internet stuff too that i don't know how it's made but the computers are made this way control systems also have complicated dynamics let's say this is a power plant or something but again i'm i think they basically have fixed arrangement so your cruise control in your car isn't changing whether it's listening to the gas or the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.34,
    "end": 2900.864,
    "text": " Maybe for the battery in a hybrid car, there would be a changing arrangement, but at least old-fashioned control systems have a fixed arrangement of how the feedback is going to work to control the speed or whatever temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.844,
    "end": 2907.846,
    "text": "Deep learning also fits into the formalism of polynomial functors, but in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.186,
    "end": 2909.866,
    "text": "Here, the interfaces are all the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.946,
    "end": 2911.947,
    "text": "They're all outputting a real and inputting a real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.048,
    "end": 2915.869,
    "text": " Now, and the arrangements are all really simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.909,
    "end": 2917.229,
    "text": "They're activated weighted sums.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.71,
    "end": 2919.951,
    "text": "Now, I'm drawing this differently than most people would.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.051,
    "end": 2940.14,
    "text": "Most people would put these three boxes on the left of this big box and they'd wire the three things in and it would seem like this was a box taking R3 to R. The way I'm thinking about, because I want to put this into the context of this accounting system of polynomial functors, it works better to think about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.317,
    "end": 2951.506,
    "text": " a neuron listening to some neurons on its left or some predecessor things, so like a higher level thing listening to lower level things, it makes more sense in this formalism to put them inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.809,
    "end": 2959.093,
    "text": " And then the arrangement isn't just a fixed, isn't just a wiring diagram, but it has more structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.113,
    "end": 2961.894,
    "text": "As I said, those wiring diagrams were just easy cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.875,
    "end": 2968.359,
    "text": "Often it's more complex, but they're still arrangements in the sense of natural transformations of polynomial functors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.079,
    "end": 2981.768,
    "text": "And what this arrangement would do is it take the output of these subguys and weight them, maybe multiply this one by 3.2, et cetera, add them up and then do an activation function and output that to the higher level, bigger thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.699,
    "end": 2998.911,
    "text": " Then when it gets a loss in, it would take the gradient and pass the components of that gradient to the three, or pass the components of that loss to the three things, and then take the gradient and change the wiring diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2999.011,
    "end": 3000.592,
    "text": "Not the wiring, but the interaction pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.953,
    "end": 3002.334,
    "text": "So it would change these three numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.895,
    "end": 3009.439,
    "text": "So the information flowing out is the interbox's current guess about what's going on in the world, the current weighted sum,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.146,
    "end": 3020.532,
    "text": " These guys send out their guesses, we add them up, we send out our guess as the higher level manager here, and then we get some loss function, we distribute it to our sub units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.012,
    "end": 3024.374,
    "text": "We also use it to change the arrangement here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.834,
    "end": 3033.52,
    "text": "So the changing of weights in the training of a neural network is the changing arrangements that I've been kind of pushing this whole time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.117,
    "end": 3037.598,
    "text": " Right, so the arrangement is dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.738,
    "end": 3043.3,
    "text": "The loss not only is sent to little boxes, but is updating the arrangement, the collection of weights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.522,
    "end": 3058.846,
    "text": "So deep neural networks is one of four examples we currently have of a certain structure that a postdoc working with me named Brandon Shapiro and I are calling a dynamic organizational structure or dynamic operad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.767,
    "end": 3062.248,
    "text": "It's a fractal-like system of arrangements that change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.171,
    "end": 3073.036,
    "text": " where the arrangement decides how information flows through the system, just like I've been saying, and yet the flowing information contains the arrangement, just like I've been saying, and we formalize this using category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.396,
    "end": 3084.882,
    "text": "And the four examples we have are deep learning, like I was talking about on the previous slide, prediction markets, heavy in learning, so this is with Sophie Lipkind, and non-cooperative strategic games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.492,
    "end": 3089.053,
    "text": " So we have only four examples of this structure, but I'm guessing there are many more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.573,
    "end": 3094.615,
    "text": "So I'm guessing, for example, that active inference can be another one or maybe free energy minimization or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.976,
    "end": 3105.019,
    "text": "The point is that these are like very fractal structures where like a collection of deep learners or gradient descenders, if you put them together, you get another gradient descender.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.739,
    "end": 3110.081,
    "text": "If you take a bunch of predictors and make them into a single predictor, you get another predictor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.061,
    "end": 3113.682,
    "text": "So like the collection of predictors becomes a predictor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.986,
    "end": 3124.79,
    "text": " and the way that the way that predictors are, the way that wealth or trust is distributed between predictors is properly nested and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.23,
    "end": 3129.832,
    "text": "Can't really go into it, but I'm interested in whether, well, I'll say that on the next slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.292,
    "end": 3134.954,
    "text": "Okay, so wrapping up kind of, many people think of math about number, but it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.194,
    "end": 3138.155,
    "text": "A math subject is an accounting system to track certain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.675,
    "end": 3141.356,
    "text": "And what we're trying to track above is dynamic arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.974,
    "end": 3145.635,
    "text": " Math is called polynomial functors, and it's well-known and beloved in category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.115,
    "end": 3149.437,
    "text": "And it accounts for interfaces, dynamics, and arrangements in a really nice way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.457,
    "end": 3153.138,
    "text": "And it's about building a bigger system from littler parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.878,
    "end": 3158.239,
    "text": "It accounts for composing circuits and control systems and deep learning and prediction markets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.08,
    "end": 3162.461,
    "text": "And then you could combine these because they're all in one formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.761,
    "end": 3168.063,
    "text": "You could take your control system and hook it up to a deep learning system and put that in a prediction market.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.263,
    "end": 3171.484,
    "text": "And all of it's just polynomial functors all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.134,
    "end": 3183.983,
    "text": " I think it might have, maybe I should have said might have particular value in Active Inference because it lets us talk coherently and precisely about these things, like changing interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.063,
    "end": 3193.471,
    "text": "I might be wrong, but I don't know that that's a part of the formalism of Active Inference today in terms of changing the arrangement and stuff like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.831,
    "end": 3201.838,
    "text": "But I'm interested to hear more from you guys, changing how things communicate, change how the communication pattern itself changes as information is exchanged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.838,
    "end": 3214.623,
    "text": " But if we wanted to make active inference into a dynamic organizational structure, for example, you might dynamic organizational structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.703,
    "end": 3223.128,
    "text": "One person, when they saw that, they thought, oh, you should really call it multi-scale dynamic organizational structure in order to really clarify your particular brand here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.295,
    "end": 3225.515,
    "text": " But maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.076,
    "end": 3232.017,
    "text": "So what would we do if we wanted to make free energy minimization a dynamic organizational structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.537,
    "end": 3238.778,
    "text": "Well, we would specify all the interfaces that we're going to be talking about that would be used to house free energy minimizers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.818,
    "end": 3242.719,
    "text": "Like what is a free energy minimizer allowed to output and what are they allowed to input?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.559,
    "end": 3245.34,
    "text": "And you would get clear on that as step one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3245.88,
    "end": 3249.501,
    "text": "And then you would consider how free energy minimizers arrange themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.226,
    "end": 3260.151,
    "text": " like what an arrangement of free energy minimizers would be, where if you arrange them in that way, it would constitute a larger scale free energy minimizer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3260.971,
    "end": 3266.634,
    "text": "So that's the sort of thing you would have to ask to make this into a dynamic organizational structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.214,
    "end": 3273.677,
    "text": "And as long as they all cohere nicely, there's some formal check we would do, we would have a dynamic organizational structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.578,
    "end": 3276.639,
    "text": "So to summarize,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.79,
    "end": 3284.318,
    "text": " I feel like I've said it a million times now, but applied category theory is math for tracking interlocking structures, cohering structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.858,
    "end": 3288.242,
    "text": "It's not about how much of something there is, it's about how it's arranged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.364,
    "end": 3296.973,
    "text": "And it applies in quantum mechanics and computer science and math and material science and linguistics, but it focuses on structural questions in each one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.586,
    "end": 3308.593,
    "text": " It allows the content to be something that someone else handles later, and it's just telling you how you're going to be handling that content so that you don't kind of step on each other's toes as you use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.254,
    "end": 3316.639,
    "text": "So I'm interested in the structure of interacting dynamical systems, like how I want to be able to account for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.659,
    "end": 3324.644,
    "text": "I don't want to necessarily give the account, but I want to be able to account for this stuff that we're doing here together, how we change, how we're inputting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.171,
    "end": 3340.144,
    "text": " you know, I'm changing by turning the speaker off or disconnecting and therefore not inputting the same or how we're outputting, you know, muting or camera off and how all that affects what happens on this call or wherever we are and how we change and what we learn and how we make sense of things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.825,
    "end": 3347.611,
    "text": "So again, I don't have specifics, but what I'm offering is this accounting system, this category of polynomial functors to account for dynamic arrangements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3348.191,
    "end": 3352.095,
    "text": "And I'm hoping that it is helpful for thinking about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.901,
    "end": 3353.946,
    "text": " So that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.287,
    "end": 3355.533,
    "text": "Happy to talk about stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.588,
    "end": 3358.528,
    "text": " That's super awesome, David.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3358.548,
    "end": 3359.289,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3359.989,
    "end": 3366.371,
    "text": "I have a million questions, but I didn't want to interrupt because I was really enjoying just hearing you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3367.551,
    "end": 3370.812,
    "text": "Because it helps it gel more solidly in my brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3370.852,
    "end": 3376.674,
    "text": "If the interaction is like, give me all the things and then let me pick apart the little pieces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3376.754,
    "end": 3379.535,
    "text": "And maybe that works for hopefully the audience also.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3380.555,
    "end": 3382.396,
    "text": "Daniel, are you watching the YouTube chat?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3382.436,
    "end": 3383.096,
    "text": "Are there questions?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3383.156,
    "end": 3383.316,
    "text": "No?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3383.736,
    "end": 3384.996,
    "text": "Do you want to go before I go?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3385.036,
    "end": 3386.857,
    "text": "Because I'll interrogate him for a while.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3387.347,
    "end": 3389.11,
    "text": " Okay, and this doesn't block you, does it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.43,
    "end": 3390.071,
    "text": "This thing up here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.091,
    "end": 3391.973,
    "text": "No, it looks fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.434,
    "end": 3394.217,
    "text": "Okay, I moved my screen to be there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.198,
    "end": 3399.324,
    "text": "Luke, please begin the interrogation, and I'll be ready with the live questions soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.06,
    "end": 3400.16,
    "text": " Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3400.18,
    "end": 3400.6,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3401.4,
    "end": 3401.7,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3401.76,
    "end": 3404.461,
    "text": "So let me just go back to the beginning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3406.241,
    "end": 3411.642,
    "text": "So in the very beginning, you said that you feel like active inference kind of meshes with category theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3412.283,
    "end": 3429.126,
    "text": "And I just am curious, I mean, I think like I kind of got a really good idea through the course of your talk, but maybe you could articulate the why to maybe kind of help us understand where that basis is coming from on your question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3429.855,
    "end": 3430.155,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.215,
    "end": 3430.435,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.416,
    "end": 3438.359,
    "text": "When I, when I first heard it, it was one thing was like utility and prediction are melded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.159,
    "end": 3442.8,
    "text": "Like what I want is I'm just expecting the world to be a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.121,
    "end": 3444.901,
    "text": "And what I want is for it to be that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.301,
    "end": 3453.965,
    "text": "So if I want to, if I really, if I really intend to have something, it's because I know that I kind of deserve it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.405,
    "end": 3458.387,
    "text": "I can't actually, I think people might have fantasies where they think they can,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.144,
    "end": 3462.167,
    "text": " get things they don't deserve or something, but it doesn't work out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.527,
    "end": 3462.948,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.088,
    "end": 3470.475,
    "text": "I feel like I'm going into too much there, but I like this idea of melding those two things because utility never really made sense to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.116,
    "end": 3474.278,
    "text": "It's like, where do I get this utility function from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.059,
    "end": 3477.341,
    "text": "Well, but I really, what I somehow thought was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.533,
    "end": 3494.18,
    "text": " like what they're saying is like my knees are a certain way, they're a prediction of like the fact that gravity will be in a certain range or my lungs can take in this sort of, or this way because they're a prediction that my lineage has made about what sort of atmosphere I'm gonna be put into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.081,
    "end": 3503.525,
    "text": "And the things I'm saying to you right now, like utility, whatever I'm using to decide how good it is for me to say a thing is my prediction of what's actually wanted here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.42,
    "end": 3512.522,
    "text": " So I like that it was like reduce the number of variables there, like it's a number of entities in the universe or something from utility and prediction just to prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.742,
    "end": 3522.584,
    "text": "I don't remember like other things exactly, but I just remember kind of feeling like, oh, I also like that it's scale free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.024,
    "end": 3525.505,
    "text": "So free energy minimization, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3526.397,
    "end": 3532.023,
    "text": " or Bayesian, you know, updaty stuff, doesn't need you to be at a particular scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.143,
    "end": 3534.746,
    "text": "It's not about subatomic particles or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.347,
    "end": 3540.092,
    "text": "I like that it's scale-free, and that somehow it's a physics-y thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.173,
    "end": 3543.195,
    "text": "Like, I'm really looking for a scale-free thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.656,
    "end": 3546.959,
    "text": "You mentioned emergence, Blue, and I'm going to stop talking soon, because I know you'll last that thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.268,
    "end": 3557.774,
    "text": " I'm not a huge fan of the concept of emergence because I feel like it's usually talking, assuming we're going to start from a low level and then say, and then the next level is magic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.434,
    "end": 3560.816,
    "text": "And then they start from that level and they're like, and then the next level is magic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.896,
    "end": 3570.462,
    "text": "And I'm really looking for like the principles where the inductive step, the move from N to N plus one is the thing we're monitoring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.562,
    "end": 3574.464,
    "text": "So we're never like confused or like, whoa, where did this amazing thing happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.865,
    "end": 3577.606,
    "text": "We're always seeing, we're monitoring that part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.747,
    "end": 3578.027,
    "text": "And, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.959,
    "end": 3591.02,
    "text": " I really like that free energy minimization and entropy maximization and stuff like that is the sort of thing that I could imagine happening at all scales, no matter if you're a person or you're a cell or you're an atom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3595.555,
    "end": 3596.075,
    "text": " Cool, definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3596.115,
    "end": 3598.898,
    "text": "I have to apologize for this beeping that's going on in my background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3598.958,
    "end": 3600.119,
    "text": "I'll try to remember to mute.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3600.659,
    "end": 3607.785,
    "text": "But I do think that, yes, emergence is cool, but also there's this bi-directional information flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3608.726,
    "end": 3614.831,
    "text": "And when we had Mike Levin come onto the live stream, he really talked about it when he discussed his paper, The Computational Boundary of a Self.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3615.372,
    "end": 3629.55,
    "text": " So yes, like there are bottom up, there are emergent properties that happen in a collective, but there's also top down constraints on those emergent properties that come from the quote higher level or maybe like larger scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3629.631,
    "end": 3631.273,
    "text": "So like if we're building things up and down,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3631.793,
    "end": 3645.227,
    "text": " there's constraints that go down and information that comes up and, and you've got to have this bi-directional information flow to even start to think about drawing any kind of boundary or creating like an interface around like the thing itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3645.367,
    "end": 3652.755,
    "text": "Like the, like we, we, we talked about cognitive cones, Mike Levin, and I don't know if you're familiar with that paper, but yeah, it was cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3653.66,
    "end": 3654.28,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3654.901,
    "end": 3655.421,
    "text": "Something else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3655.481,
    "end": 3659.444,
    "text": "And so I know like you've talked with Mike a lot and also with Chris Fields.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3661.005,
    "end": 3674.135,
    "text": "And when Chris came, he really talked to us about contextuality and he started to get into some math that I think is maybe related to some of the things that you were talking about here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3674.635,
    "end": 3679.779,
    "text": "So you talked about operations that correspond to interactions between sets and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3681.12,
    "end": 3691.99,
    "text": " And Chris talked to us about two spaces and like channel theory, and as these like interactions that transform sets as infomorphisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3692.631,
    "end": 3698.756,
    "text": "So like, I don't know if the name that like language speaks to this or is like...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3700.004,
    "end": 3715.741,
    "text": " It's hard for me to tell what is the language of category theory and what is like the application of the category theory to something in real life or that's not just, you know, the set of X such that X is less than or equal to like these kinds of math words, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3716.897,
    "end": 3717.557,
    "text": " Right, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.897,
    "end": 3721.498,
    "text": "So the chew spaces stuff is definitely category theory and relates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.178,
    "end": 3730.179,
    "text": "There's a nice way of talking about the relationship between chew spaces and polynomial functors, although I don't have it on the tip of my tongue right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.96,
    "end": 3734.98,
    "text": "So these polynomial functors are kind of bi-directional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.2,
    "end": 3744.002,
    "text": "Because if you have these arrangements, which are maps of polynomial functors, this sort of thing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.684,
    "end": 3752.185,
    "text": " quote unquote higher level thing is talking to the lower level things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.685,
    "end": 3756.186,
    "text": "Lower level things are talking to each other and they're also talking to the higher level thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3756.346,
    "end": 3758.506,
    "text": "So there's this kind of bi-directional thing there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.666,
    "end": 3765.608,
    "text": "And so on that level, I'd say, yes, it does sound similar to what Chris Fields was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.168,
    "end": 3770.409,
    "text": "And then, but you also asked like, what is the application of category theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.509,
    "end": 3772.889,
    "text": "So once you have an accounting system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.795,
    "end": 3775.357,
    "text": " You can build a tool from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.417,
    "end": 3777.24,
    "text": "So if someone says, hey, I got this great idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.26,
    "end": 3781.486,
    "text": "It's all about plus and times and like dollars can be added, but not multiplied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.526,
    "end": 3784.49,
    "text": "And they can be multiplied by numbers, but not each other or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.891,
    "end": 3790.819,
    "text": "You make this rule and then someone could build a spreadsheet that program that incorporates that rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.662,
    "end": 3800.005,
    "text": " And maybe current spreadsheets don't allow you, don't keep you on the rails with respect to not multiplying $2 figures, but you could imagine that they did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.086,
    "end": 3801.946,
    "text": "So what's the application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.306,
    "end": 3810.329,
    "text": "The application is that once you have the accounting system, the mathematical accounting system, you can build tools from it, or you can just think through it on a whiteboard or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.809,
    "end": 3811.91,
    "text": "But if you build tools,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.563,
    "end": 3837.446,
    "text": " Let's that's a major way people use math Calculus or whatever they simulate things if you use category theory what it lets you do is if you say I have this monoidal thought category called poly and Then someone says, you know, they want to implement it Well instead of thinking about all the features they want from an interface language and they're like oh and let's have it print like this and let's have it publish the web like that and like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.995,
    "end": 3863.293,
    "text": " know they have all these features what it allows you to do is not look at any feature requests you just implement the accounting system you just put it in there just the map and you call it a day and then if somebody else wants to add stuff you do it later and you don't use that to influence kind of the basic code it allows you to write very very highly structured and very compressed code that does that does all of the major",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.939,
    "end": 3865.36,
    "text": " backend work of the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.86,
    "end": 3873.023,
    "text": "And then every other feature request is like, you know, that's kind of the gold plating or like the thing that makes a user interface for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3873.183,
    "end": 3876.864,
    "text": "But does that make sense as an application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.865,
    "end": 3882.686,
    "text": "Yeah, and like perfectly segues into my next question, actually.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3883.186,
    "end": 3884.407,
    "text": "So you talked about...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3885.168,
    "end": 3888.649,
    "text": " category theory as like a potential accounting system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3888.669,
    "end": 3908.035,
    "text": "And early on, even actually, I think you even mentioned morality in your talk, but even before we were talking about intelligence and like grounding and ethics and wisdom, and I'm now like in Kernel studying regenerative finance and potentially like new ways",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3908.715,
    "end": 3937.174,
    "text": " to develop like accounting systems that maybe involve like carbon credit or some kind of moral or ethical bound that's like a new system for like not just plus and minus dollars but maybe like a new system for accounting that like a ledger that allows for more thoughtful consideration into or of like the environment and just the world at large and humanity and our fate and future as a species.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3937.854,
    "end": 3946.398,
    "text": " Um, and I just wonder if you've thought about that or, um, and I definitely think like you definitely think that category theory can maybe jump in and rescue us here or just what are your thoughts on that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3947.119,
    "end": 3947.379,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.459,
    "end": 3954.202,
    "text": "So category theory, um, you have to do the work of deciding what your accounting system is in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.242,
    "end": 3963.306,
    "text": "Like it helps you decide what, what things, since it has talked about all of math, um, is it can be written in category theory at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.047,
    "end": 3966.868,
    "text": "Um, or at least all that I can think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.879,
    "end": 3971.941,
    "text": " It's got all of math is the stuff that people have used so far to think about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.401,
    "end": 3976.183,
    "text": "And so it's somehow getting all of that into a single system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.223,
    "end": 3986.769,
    "text": "So it's likely that whatever we're thinking about now with this regenerative finance, et cetera, if, you know, there would be some good way of putting it into category theory, but that still has to be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.889,
    "end": 3992.992,
    "text": "It won't rescue you, except it'll be there as like, yeah, I think I could, if I had an expert to work with, I could do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.583,
    "end": 4005.65,
    "text": " But then in terms of the question itself, regenerative finance and morality and stuff like that, I mean, I don't know if this is the sort of thing that jumps to mind, but one thing I think in our society,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.368,
    "end": 4025.63,
    "text": " that might be pretty bad um and it's in ourselves also or at least maybe it's good but it's good in a way i don't understand yet and that is um that in these big arrangements there's little things whose job it is to hide the intentions of the things inside and so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.173,
    "end": 4037.04,
    "text": " like I think of, I'm not sure I'm gonna name this person and it's almost a trigger, but Jeffrey Epstein, I think like, what was he good at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.18,
    "end": 4045.747,
    "text": "I kind of think, I know he was known for like making these financial derivative instruments that like hid the subprime mortgage stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.168,
    "end": 4053.732,
    "text": "And I feel like his whole island and all the stuff he was doing, like he just knew all the secrets and his, and I could imagine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.864,
    "end": 4061.051,
    "text": " backing away from him, but like also like the meat industry, there is secrets about how meat is produced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.231,
    "end": 4065.375,
    "text": "And when you go to the supermarket, their job is to make sure you don't think about that stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.161,
    "end": 4077.566,
    "text": " And so when you form these big arrangements or the financial system, like there's a lot of what goes on in the financial system that's hiding the almost slavery that takes place in various places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4078.947,
    "end": 4093.554,
    "text": "So, and then in myself, maybe the greed, I think all this is really coming from the need to survive at all costs or something like that, that seems like our cells in our body don't have, but we somehow have gotten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.889,
    "end": 4095.71,
    "text": " I'm not sure about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.85,
    "end": 4103.0,
    "text": "So anyway, one thing that comes to mind is like What's up with hiding intentions and do is there any place for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.825,
    "end": 4107.025,
    "text": "Wow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.523,
    "end": 4116.386,
    "text": " Also, just like from a very biological perspective, I do think that we have little things inside of us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4117.066,
    "end": 4128.431,
    "text": "Maybe it's not function, it is to hide things, but I definitely don't have access to all of the knowledge of every single cell in my body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4129.331,
    "end": 4130.451,
    "text": " Or every even organ.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4131.532,
    "end": 4134.832,
    "text": "So, I mean, like, survive at all costs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4134.912,
    "end": 4142.054,
    "text": "Like, yes, I could be, like, knock on wood, growing a little cancer tumor somewhere that's not known to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4142.754,
    "end": 4147.736,
    "text": "And, like, we have mechanisms that mask pain and that even mask, like, proprioception.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4147.756,
    "end": 4150.776,
    "text": "So there's a lot of things going on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4150.896,
    "end": 4157.158,
    "text": "Like, there's a lot of hiding, even in the biological system that happens between...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4158.158,
    "end": 4165.93,
    "text": " scales, which totally leads into my next question so perfectly, which was about compression and elaboration.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4165.95,
    "end": 4171.038,
    "text": "And so, like, what is hidden",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4172.623,
    "end": 4174.865,
    "text": " or what is compressed, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4175.085,
    "end": 4185.474,
    "text": "And what is the relationship or function or utility of category theory in elaborating compression and elaboration?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4185.714,
    "end": 4189.877,
    "text": "Like if I get the compressed version of like what the larger box container",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4190.898,
    "end": 4192.699,
    "text": " is what's happening with the larger box.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4192.779,
    "end": 4203.622,
    "text": "Can I elucidate the structure and what's happening in the smaller boxes or even the arrangement of the smaller boxes within the larger container, the larger scale, say?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4204.982,
    "end": 4208.844,
    "text": "And just, so how much, how good is this math?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4209.104,
    "end": 4213.285,
    "text": "How is it going to help me understand compression and elaboration across scales?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4214.025,
    "end": 4214.705,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.366,
    "end": 4219.627,
    "text": "I first want to say that I think of category theory as humanity's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.592,
    "end": 4224.493,
    "text": " best thought compression language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.934,
    "end": 4235.498,
    "text": "So for example, the category of polynomial functors is the whole subcategory of functors from set to set spanned by coproducts of representables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.438,
    "end": 4237.959,
    "text": "And now I've told you the entire definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.419,
    "end": 4239.779,
    "text": "And I don't expect you to understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.22,
    "end": 4242.921,
    "text": "And I wouldn't even expect a category theorist to understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4243.361,
    "end": 4245.562,
    "text": "But I would write that expression that I just said on the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.602,
    "end": 4246.962,
    "text": "And it would be, I don't know, 20 words or 30 words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.898,
    "end": 4252.159,
    "text": " And then that would be sitting there at the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.399,
    "end": 4255.081,
    "text": "And then I would go through, like, what do I mean by category?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.121,
    "end": 4256.081,
    "text": "What do I mean by set?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4256.121,
    "end": 4257.262,
    "text": "What do I mean by functor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.302,
    "end": 4259.443,
    "text": "What do I mean by spanned by?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.483,
    "end": 4261.745,
    "text": "What do I mean by coproduct?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.765,
    "end": 4262.925,
    "text": "And what do I mean by representable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.025,
    "end": 4267.928,
    "text": "And I would go through those words and I would explain whichever ones are those who didn't understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.448,
    "end": 4270.509,
    "text": " And then I would explain those in a compressed way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.529,
    "end": 4271.749,
    "text": "And then you'd say, yeah, I get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.809,
    "end": 4272.569,
    "text": "Or no, I don't get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.93,
    "end": 4274.21,
    "text": "And we could unpack this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.79,
    "end": 4293.196,
    "text": "So the category theory itself, before we get to your question about the interfaces and the arrangements, is this amazing thought compression language where all the stuff in this talk, all the math behind it, and the stuff is all an elaboration of this very, very compressed language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.456,
    "end": 4316.355,
    "text": " few words um because we really made this language for compressing big thoughts uh then there if i remember i hope i'm not missing the main part of the question but you're also talking about the um arrangements themselves as compressions and um and yeah like an an adder circuit is a compression of a bunch of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.561,
    "end": 4325.234,
    "text": " and or logic circuits that are themselves a compression of NAND gates, which are themselves transistors arranged in a certain way, a certain way, a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.465,
    "end": 4329.467,
    "text": " The NAND gate, if you think about it, why did you arrange those two transistors that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.967,
    "end": 4333.009,
    "text": "Because you knew that it would always act this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4333.049,
    "end": 4336.412,
    "text": "You can kind of like everyone's NANDing all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.572,
    "end": 4338.593,
    "text": "But OR is a pretty good thing to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.354,
    "end": 4340.915,
    "text": "And AND is a pretty good thing to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.955,
    "end": 4341.975,
    "text": "And PLUS is pretty good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4342.476,
    "end": 4347.059,
    "text": "And so these compressions, out of all the possible ways of arranging transistors,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.904,
    "end": 4353.346,
    "text": " into the number of transistors in an adder circuit that can add two, three digit numbers or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.966,
    "end": 4359.427,
    "text": "That might, I don't know, let's just pretend that took, let's just pretend that took a thousand transistors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.267,
    "end": 4365.509,
    "text": "If out of all the ways of arranging a thousand transistors, there's like a few that you would actually like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.55,
    "end": 4370.798,
    "text": " that where you're like, instead of adding two numbers and getting like some random thing, you get the actual sum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.5,
    "end": 4376.75,
    "text": "And so we compress into, for some reason, some compressions are useful because we can predict them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.312,
    "end": 4387.574,
    "text": " I can predict your behavior based on what I'm seeing on your face and what you need to know from me or what I can do to help and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.454,
    "end": 4396.936,
    "text": "That ability to compress all this stuff into just something you output on the interface is really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.976,
    "end": 4400.337,
    "text": "The same is happening in the OR gate and the outer circuit and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.997,
    "end": 4405.818,
    "text": "You create things that have a well-defined usefulness, even though I have no idea what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4407.975,
    "end": 4412.337,
    "text": " And I don't know, does that answer the question or did I miss a major part of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.359,
    "end": 4416.9,
    "text": "So let me just repeat a part of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4417.64,
    "end": 4422.943,
    "text": "So if I am a compression, say like, let me just do something really simple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4423.063,
    "end": 4428.346,
    "text": "I'm the number six and I'm a compression of, you know, three numbers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4428.987,
    "end": 4430.227,
    "text": "And it could be, so can I...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4433.123,
    "end": 4440.349,
    "text": " I guess what I compress is the set of the possible numbers that make up six, like the three, like that's what I compress.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4440.41,
    "end": 4440.59,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4440.69,
    "end": 4442.672,
    "text": "So that's what translates to the compression.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4442.692,
    "end": 4448.217,
    "text": "So you can never really go from the compression number six to figure out which of those three numbers were.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4448.998,
    "end": 4449.158,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.759,
    "end": 4450.94,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4451.16,
    "end": 4455.985,
    "text": "You can, what you do know is the remaining thing that sixness gives you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.31,
    "end": 4469.58,
    "text": " Um, there's lots of things that use six and they're all happy to know about six and same with, or like, I don't know how you made your, or you could have made it with 43,000 transistors and wasted a bunch of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.64,
    "end": 4473.223,
    "text": "But like the point is, I don't need to know all that stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4473.584,
    "end": 4478.768,
    "text": "All I need to know is that this thing's going to take two Booleans and produce a Boolean in a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.799,
    "end": 4485.582,
    "text": " And so the compression, this outer interface, is saying, I don't care about all your private methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.662,
    "end": 4487.444,
    "text": "Just tell me what can I expect from you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.386,
    "end": 4493.348,
    "text": "And I think part of our society, we have identities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.848,
    "end": 4501.453,
    "text": "I'm guessing that identity, which is such a major thing today, is this compression of what's expected from the person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.493,
    "end": 4510.615,
    "text": " we are working out like how those identities really do help us expect things from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.223,
    "end": 4517.987,
    "text": " So just on the topic of identity and like to follow up and maybe continue this train of thought a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4518.187,
    "end": 4521.33,
    "text": "So like, I am blue, I am a human, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4521.39,
    "end": 4531.819,
    "text": "Like I'm a human that's alive, that's here talking under the compression of, you know, math stream number 4.1, which all of this conversation will eventually compress to active institute math stream 4.1.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4532.84,
    "end": 4538.365,
    "text": "But like the fact that I am blue and I am human, like I am one among the set of many things that is all human.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4539.466,
    "end": 4543.551,
    "text": " And like we described the set like living human in a certain way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4543.571,
    "end": 4545.093,
    "text": "Like I have a certain number of cells",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4546.308,
    "end": 4549.01,
    "text": " but many of the cells are not human, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4549.07,
    "end": 4558.717,
    "text": "So more cells at some times of your digestive cycle than others, so more cells sometimes are not human than actually are human.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4559.217,
    "end": 4574.409,
    "text": "And so it's the set of things, like how many human cells, how many different E-coli, how many different types of bacteria and microorganisms, and all of these things compressed to the set of living human,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4575.993,
    "end": 4587.302,
    "text": " I would like to be able to unravel like what is like go from living human or like even just find the limits of like, okay, so now like too many E. coli was like some decomposing human that's not alive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4588.123,
    "end": 4596.369,
    "text": "So like, I would like to be able to really push the boundaries of, or even find the boundary of, of what makes the set of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4597.009,
    "end": 4602.932,
    "text": " cells that is a living human versus like, when do you, it's like the phase transition, like the critical point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4603.413,
    "end": 4608.836,
    "text": "At what critical point are so many of these microorganisms alive that I become not a living human anymore?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4609.702,
    "end": 4628.972,
    "text": " yeah yeah so in the same way like a an and gate is not made out of and gates it's made out of smaller things or you know a logic all right so we don't really expect the high level thing to be made out of little things but the reason i think you're saying that there are these things called human cells is because we share this dna and this the dna",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.552,
    "end": 4639.555,
    "text": " that you're tracking when you say that, hey, the E. coli is not me and the gut bacteria stuff is not me because it doesn't have our DNA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4639.995,
    "end": 4643.316,
    "text": "But it is you in the sense that it helps you as a pattern exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.356,
    "end": 4652.239,
    "text": "And so if I was putting an interface around you, I definitely wouldn't personally want to only use your DNA cells and call those you because you wouldn't be a very good you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4653.04,
    "end": 4662.381,
    "text": " um but uh yeah so what can happen is like these e coli or these cancers or whatever inside of you let's say you're this gigantic arrangement of stuff um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.993,
    "end": 4670.576,
    "text": " What can happen is that they can start to say things that start to mess with that arrangement and start to change the arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.656,
    "end": 4674.178,
    "text": "So remember, the arrangement is changing based on what's flowing through the wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.718,
    "end": 4680.64,
    "text": "So your E. coli things in there might be saying some stuff or spreading some stuff that's changing the arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.72,
    "end": 4684.082,
    "text": "And now this cell is no longer talking to that cell when it should have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.682,
    "end": 4692.887,
    "text": " And now that it's no longer talking to that cell, because the arrangement has changed, now that other cell is not receiving what it usually does, so it starts to say different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.428,
    "end": 4699.151,
    "text": "And slowly, this changes the arrangement so much that you're no longer a cohering whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.812,
    "end": 4706.456,
    "text": "And the things that we can expect from you, your identity has changed to one that's not as interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.322,
    "end": 4710.762,
    "text": " Definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4711.222,
    "end": 4737.53,
    "text": "And so can you see that in the, with the math, like where this maybe phase transition takes place or like at what level of rearrangement, like maybe it's 20% rearrangement or like, you know, 20% incoherent arrangement or measure like the information in the circuit transferring from one to like from one piece to another such that like when the information flow is so disrupted, then it like ceases to be a functional arrangement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4738.151,
    "end": 4738.491,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.151,
    "end": 4739.171,
    "text": "I,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4740.669,
    "end": 4747.733,
    "text": " I think that problem is as hard as like being able to look at a spreadsheet and seeing if there's corruption, like people can do it, but it's a judgment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4748.213,
    "end": 4753.476,
    "text": "It's like someone decides like, no, that's not, that's not real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.277,
    "end": 4758.219,
    "text": "Um, or yeah, it's like, I know it when I see it kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.379,
    "end": 4762.362,
    "text": "So there might be rules of thumb you could create in this accounting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.622,
    "end": 4764.783,
    "text": "Like, uh, but I doubt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.607,
    "end": 4771.332,
    "text": " I don't feel comfortable creating the definition of the faith transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4771.973,
    "end": 4777.679,
    "text": "And I wouldn't expect it to be any more than a judgment, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.821,
    "end": 4780.382,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4780.502,
    "end": 4783.245,
    "text": "And thanks for letting me ramble on a little bit there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4784.726,
    "end": 4787.95,
    "text": "So on this slide while we're here, this is totally changing the subject.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4790.467,
    "end": 4799.774,
    "text": " If you were Roman, like if you were ancient Roman using ancient Roman numerals, would Hindi Arabic numerals still be empirically better?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4799.794,
    "end": 4802.076,
    "text": "Or does that depend on context?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4802.637,
    "end": 4803.277,
    "text": "I think they would.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.918,
    "end": 4811.043,
    "text": "I know that it might not be in the current culture, but I think it, I think it is just empirically better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4812.584,
    "end": 4817.448,
    "text": "Like in a sense, like is a better baseball player better?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.469,
    "end": 4819.55,
    "text": "Well, they're better at baseball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.778,
    "end": 4845.219,
    "text": " um like i'm not saying that's better like maybe you just love these things and it makes you feel really good to see x's and stuff and then for you like it's great like use this thing but if you want to be a math person that multiplies things like you they apparently in rome like they were they knew about square root of two back then they figured out like 1.414 apparently i don't know i don't know if that's true but they were pythagoras was like back then like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.544,
    "end": 4849.087,
    "text": " Can you imagine taking square roots if this is what you're using?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4850.368,
    "end": 4851.389,
    "text": "You can barely multiply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4851.589,
    "end": 4853.391,
    "text": "How could you take e to a power and do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.012,
    "end": 4858.897,
    "text": "Could we do quantum mechanics today if we were having to do this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.898,
    "end": 4862.281,
    "text": "Could we do even compound interest with this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.242,
    "end": 4864.703,
    "text": "I would never, ever want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.723,
    "end": 4866.285,
    "text": "So it just wins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.635,
    "end": 4873.759,
    "text": " it's empirically better because those who decide to move to this system will out-compete these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4874.62,
    "end": 4878.623,
    "text": "And in life, there is some sort of competition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4878.643,
    "end": 4886.85,
    "text": "And so I do think that it's empirically better, but I'm happy to hear if you disagree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4888.764,
    "end": 4891.566,
    "text": " I mean, I do think, like, you know, survival of the fittest, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4891.906,
    "end": 4895.569,
    "text": "So clearly, like, the Hindi-Arabic numerals have won.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4896.609,
    "end": 4906.536,
    "text": "But also, I think that if I had never seen a Hindi-Arabic numeral before and was trying to multiply, that, like, I would prefer, because it's, like, just what I'm familiar with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4906.636,
    "end": 4909.778,
    "text": "It's part of my model is to use these Roman numerals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4909.858,
    "end": 4913.26,
    "text": "If I was in ancient Rome, and I would be like, what is this one for?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4913.281,
    "end": 4916.943,
    "text": "And so it's just whatever, I guess, that you're familiar with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4919.685,
    "end": 4942.217,
    "text": " need to hear your perspective also um i mean like if you were a moth and it was turning you know there this the everything was turning brown because of the new smoke you might be familiar with being a white moth but like any moth that changed to being a brown moth would win um i don't know yeah there's familiarity and that is a thing because we need that we need homeostasis and stuff but there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.375,
    "end": 4944.695,
    "text": " I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.755,
    "end": 4956.466,
    "text": "Yeah, I think that if someone was a more capable person in terms of being able to change, they would appreciate that faculty in themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.886,
    "end": 4961.85,
    "text": "They'd be like, ah, I'm glad I tried to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.01,
    "end": 4962.211,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.832,
    "end": 4967.235,
    "text": "Well, and so now I have a series of questions about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4969.028,
    "end": 4971.189,
    "text": " the interface and the dynamics and interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4971.249,
    "end": 4974.372,
    "text": "So I don't know if you want to skip forward to those slides.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4974.972,
    "end": 4982.757,
    "text": "So are these like terms, like you said, you had some key terms, interface, dynamics, interaction, arrangement, and I'm tracking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4984.918,
    "end": 4989.88,
    "text": " These terms, are they part of, like, the formalism of category theory?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4989.94,
    "end": 4993.141,
    "text": "Is this something that, like, everyone is a category theory study?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4993.161,
    "end": 4993.581,
    "text": "They're not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4993.701,
    "end": 4994.601,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4994.661,
    "end": 5004.945,
    "text": "So that was my question was, you know, because the way that you discussed these interfaces, positions, forces, states, arrangements, enclosures,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5005.965,
    "end": 5014.347,
    "text": " really spoke to active inference so much, which is why I really get why you're like, oh, yeah, that seems to kind of mesh with my current ideas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5015.407,
    "end": 5022.769,
    "text": "So we have the interface, which we talk about as like a Markov blanket, like a separation, a boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5023.229,
    "end": 5027.69,
    "text": "And in the Markov blanket are like the sense states and the action states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5028.03,
    "end": 5032.915,
    "text": " So like in the interface is like, you would call it positions and forces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5033.455,
    "end": 5038.74,
    "text": "Like that's where I act on the world and the world acts back on me, like in the Markov boundary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5039.34,
    "end": 5044.905,
    "text": "And so similarly, like you talked about like the dynamics of a system as being hidden and only like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5045.966,
    "end": 5049.689,
    "text": " internal to the system and we have like hidden states or internal states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5050.65,
    "end": 5056.195,
    "text": "And then, yeah, the interaction is like what I would refer to as like maybe a state update.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5057.395,
    "end": 5063.68,
    "text": "So there's like, you know, we interact and then I might change or it might just influence my future trajectory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5063.721,
    "end": 5072.708,
    "text": "So I just wanted to like highlight the great degree of similarity between what you talked about and like what we talk about very regularly in Active Inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5073.208,
    "end": 5073.448,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.768,
    "end": 5078.511,
    "text": "So what I did was I took, I started noticing polynomial functors wanted to do what I was trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.132,
    "end": 5082.814,
    "text": "And then I took the feeling of using them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.894,
    "end": 5087.877,
    "text": "Like when I, the intuition I get by asking myself what a map of polynomial functors is or whatever,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5088.723,
    "end": 5102.347,
    "text": " and came up with these words as the things that most intuitive English words that tracked how the math was changing, or how the math developed as I made a story about these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5102.667,
    "end": 5110.469,
    "text": "So these are really just the words that I found to most give me intuition for tracking what the math was doing automatically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5113.629,
    "end": 5115.71,
    "text": "It looks like Daniel has his hand raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.259,
    "end": 5117.739,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.779,
    "end": 5120.38,
    "text": "Well, just great questions, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5120.42,
    "end": 5123.882,
    "text": "And David, thanks for the very powerful and creative talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.042,
    "end": 5136.847,
    "text": "I think on this topic of the active inference ontology mapping, I think that was really quite well stated, which is this idea of an input-output system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.206,
    "end": 5163.703,
    "text": " or an interface and things that are on one side of the interface are shielded from that on the other side of the interface, otherwise, quite literally, it would be a different thing, is a really powerful idea and it comes up in computer science with APIs, it comes up in graphs and topology, and we can even think about things like the arithmetic operations, like order of operations or nested parentheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.743,
    "end": 5165.484,
    "text": "It's like, well, what happens in the parentheses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.064,
    "end": 5171.448,
    "text": " it stays in the parentheses until it's compressed and then it goes into some other area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.008,
    "end": 5191.601,
    "text": "And then also even how you described searching for intuitive words, and I'm sure actively inferring with many learners for terms that have a natural interpretation or a conversational interpretation and also point towards more technical words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.821,
    "end": 5211.014,
    "text": " usage, which I think in active inference, we see a lot about system delineation and partitioning from the environment, like such as the ones that you've brought up, nested systems and interacting systems, and also regarding some numerical quantities like surprise, attention, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.575,
    "end": 5232.311,
    "text": " Although also we have recently seen some symbolic active inference implementations from JF Clausier that are engaging in this action perception loop without sending statistical or numerical messages, but rather communicating about logic values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.372,
    "end": 5235.133,
    "text": "So just wanted to note that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.293,
    "end": 5239.697,
    "text": "And if you have any thoughts, otherwise I'll read a question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.619,
    "end": 5242.119,
    "text": "Yeah, quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5242.481,
    "end": 5267.225,
    "text": " thought is like somehow when i we take language for example math and we translate it into motion so like if you say please pass the salt then like 10 to the 15 atoms will move through space you know you just say this word in language and then 10 to the 15 atoms move through space and like some salt crystals land on your on your um food or whatever and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5268.809,
    "end": 5279.698,
    "text": " By having the math attached into intuitive ideas in our minds, we can then take the mathematical ideas and translate them into the movement of atoms, like me being able to talk or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.218,
    "end": 5291.508,
    "text": "And it's really important that we have intuitive ways of thinking about these things, because otherwise they won't translate down into the movement of atoms, the action that we see in the world that actually accomplishes anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.228,
    "end": 5299.052,
    "text": " So I'm worried about all the mathematicians that are doing math that they don't have any sense at all about how it could ever be used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.872,
    "end": 5305.815,
    "text": "And this is kind of the point of Tobos Institute is like, you can, I don't mind if you do, like, okay, you can do whatever you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.835,
    "end": 5314.5,
    "text": "But like, I don't see a point in doing math if you have no idea how that would ever be useful to anyone, even in a thousand years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5315.28,
    "end": 5315.681,
    "text": "And so I'm...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5316.892,
    "end": 5317.212,
    "text": " I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5317.232,
    "end": 5323.575,
    "text": "So yeah, to connect, the point is like to connect with the audience here, have this possibly be useful to anyone for real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.355,
    "end": 5331.838,
    "text": "I need to find the words that take the math and translate it into intuitive concepts so that they can come back to the math if they want to or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.879,
    "end": 5333.079,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.32,
    "end": 5337.441,
    "text": "Lou, anything to add on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.543,
    "end": 5344.044,
    "text": "Go ahead and read the chat questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5344.184,
    "end": 5344.364,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5345.182,
    "end": 5353.157,
    "text": " All right, so this will pull us back, generalize a little bit, and then I'm sure we could talk more active inference or institute talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5354.099,
    "end": 5355.261,
    "text": "So Ali wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.539,
    "end": 5361.601,
    "text": " It is said that category theory is the most abstract area of mathematics out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5362.141,
    "end": 5365.223,
    "text": "Perhaps we can even call it a kind of metamathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.003,
    "end": 5375.127,
    "text": "Daniel Dennett claims in Intuition Pumps and Other Tools for Thinking that we can theoretically go meta on every level of abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5375.887,
    "end": 5383.77,
    "text": "So is it possible to conceive a level of abstraction even more meta than category theory in mathematics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5384.91,
    "end": 5385.671,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5387.097,
    "end": 5391.698,
    "text": " So there is a category of all categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5392.979,
    "end": 5399.521,
    "text": "The thing is that when you have a category of all categories, first of all, it's like really big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.161,
    "end": 5406.142,
    "text": "And second of all, it has an even higher level structure than each category does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.343,
    "end": 5408.423,
    "text": "So it's called a two category of all categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.963,
    "end": 5411.384,
    "text": "And then there's a three category of all two categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5412.142,
    "end": 5419.951,
    "text": " And there, but there is amazingly a thing called infinity categories that finishes this thing where there's an infinity category of all infinity categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.331,
    "end": 5425.277,
    "text": "And I think that the abstract, like it's very hard to think about this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.024,
    "end": 5432.127,
    "text": " But, and it's still an active area of research to create like a nice infinity category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.768,
    "end": 5440.452,
    "text": "But yeah, people keep getting stuck on, hey, I've got all these categories and I want something more abstract in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5440.592,
    "end": 5442.653,
    "text": "And then I need a two category and I, ah, I'm done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5442.733,
    "end": 5444.874,
    "text": "I got the two category of all categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5445.515,
    "end": 5447.356,
    "text": "But then eventually someone wants the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.376,
    "end": 5453.279,
    "text": "And so, yeah, this is a great question and it's an active area of research right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.805,
    "end": 5474.543,
    "text": " okay interesting i'll ask one active inference related question that connects also to enclosures and nesting so we've in the generative models that we see in active inference they're bayesian graphs and they're describing control systems and action perception loops and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5475.68,
    "end": 5481.542,
    "text": " We've seen nested models be used in at least two different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.442,
    "end": 5502.128,
    "text": "One is to describe systems who are physically nested within one another, such as an organism and then the organs, the cells, the organelles, and those interfaces and what that nesting or enclosing can be interpreted as has a natural spatial interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5503.322,
    "end": 5509.868,
    "text": " However, there have also been nested models of cognitive modeling flavors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.996,
    "end": 5536.829,
    "text": " And in those cases, it's never been clear whether the nesting or enclosing that's happening is reflecting spatial boundaries in some cognitive space, if one chooses that direction of interpretation, or in fact, what that nesting entails, and then importantly, why it would have a structural isomorphism with the nesting of the matryoshka and just things that are physically nested inside of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.129,
    "end": 5540.171,
    "text": "So what does nesting and enclosure entail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.771,
    "end": 5568.469,
    "text": " mean here and is it referring to spatial boundaries or other conceptual boundaries yeah great so um this uh so like same with airplanes or something you have the physical airplane but then different parts of the airplane are really talking to each other that may not be like the the radio of the control tower and the radio of the airplane are in some sense more closely connected than the radio of the airplane and the engine of the airplane the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5568.956,
    "end": 5572.479,
    "text": " the radio of the airplane and the pilot are strongly connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5574.22,
    "end": 5581.266,
    "text": "And so, yeah, there's always this logical, what I would call physical arrangement and logical arrangement, and those might be different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5582.687,
    "end": 5597.079,
    "text": "But what they are from this point of view, or one thing you could do is just, so if you look at, I don't know, this X12 and X21, you might imagine that there's a logical way of arranging things where these really seem like they're quite close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5598.019,
    "end": 5598.38,
    "text": "And so,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5603.818,
    "end": 5606.76,
    "text": " I probably should have shown this, but that picture is the same as this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.081,
    "end": 5609.382,
    "text": "I've just undone the nesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5611.123,
    "end": 5612.624,
    "text": "Let's see if I can try to show that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.725,
    "end": 5616.326,
    "text": "So, yeah, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.907,
    "end": 5619.408,
    "text": "Oh, no, it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5619.428,
    "end": 5620.649,
    "text": "Darn it, I didn't take the same one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5620.929,
    "end": 5621.59,
    "text": "That's confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5623.111,
    "end": 5625.713,
    "text": "Okay, well, I think I added an extra loop on this thing or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.034,
    "end": 5627.214,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5628.618,
    "end": 5636.082,
    "text": " Anyway, my point is we can undo this nesting and have this one be closer to this one and some other nesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.163,
    "end": 5644.467,
    "text": "So you could use this organizational system called an operad to handle the fact that you might want to nest things differently for different purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.609,
    "end": 5651.732,
    "text": "This picture here is supposed to be either physical arrangement or logical arrangement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.832,
    "end": 5652.372,
    "text": "It doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.753,
    "end": 5655.654,
    "text": "And it's really just about who's talking to who.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5656.254,
    "end": 5657.255,
    "text": "That's the most important thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.725,
    "end": 5665.66,
    "text": " The thing is that in your liver, in your brain, in your cell, maybe the latency of communication is much better than across the boundaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.68,
    "end": 5669.487,
    "text": "Sorry for the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.128,
    "end": 5671.768,
    "text": " Voice issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5672.128,
    "end": 5674.249,
    "text": "Well, very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5674.429,
    "end": 5686.334,
    "text": "And in neuroscience, it speaks to the distinctions of structural, functional, and effective connectivity, which if only it was dominoes hitting each other and they were all identical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.454,
    "end": 5689.115,
    "text": "But even in that case, I don't think they would be identical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5689.355,
    "end": 5694.737,
    "text": "So we're dealing with something, and that's a great example, with the informational and the causal connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.177,
    "end": 5698.439,
    "text": "After all, the Bayesian causal graph architecture is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.659,
    "end": 5707.026,
    "text": " pointing towards something that is presenting itself as cause with a technical specific definition, although a natural word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.667,
    "end": 5715.014,
    "text": "And so it is interesting when the causal architecture may not reflect the physical architecture and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5716.035,
    "end": 5716.255,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.855,
    "end": 5722.381,
    "text": "And the operad, the notion of operad, which I never said during the talk, but this nesting thing is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.24,
    "end": 5740.252,
    "text": " is designed to allow you to rearrange how you want to consider inside and outside, or whether you want to consider physical or logical, to allow you to do that zooming on your own time or in your own way, without affecting what the thing is going to do as a whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5743.115,
    "end": 5743.415,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5743.495,
    "end": 5743.655,
    "text": "Luke?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5745.626,
    "end": 5752.59,
    "text": " So just to add on to the possible layers of nesting, there's also the layer of temporal nesting, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5752.61,
    "end": 5756.332,
    "text": "So things happen at like a very fast pace that we don't observe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5756.392,
    "end": 5759.894,
    "text": "Like the light is flickering as long as it's like greater than 60 hertz.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5760.094,
    "end": 5762.336,
    "text": "I don't see it flickering, but I know it's flickering.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5762.796,
    "end": 5769.099,
    "text": "And as long as it's like not in my perceptible range, then it doesn't really matter to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5769.42,
    "end": 5769.78,
    "text": "So there's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5771.261,
    "end": 5784.372,
    "text": " And just similarly, I don't think biological evolution maybe cares all that much about mass stream 4.1, but cares about how many children we each have and all these other things, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5784.472,
    "end": 5793.86,
    "text": "So the relevance, the salience, and across temporal scales is also something to think about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5794.581,
    "end": 5796.662,
    "text": "And we talked about the changing interface.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5796.722,
    "end": 5797.643,
    "text": "I think you mentioned that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5799.429,
    "end": 5804.234,
    "text": " and with the question of like, I don't know if active inference does this changing interface.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5804.274,
    "end": 5816.667,
    "text": "Well, so it does in the Markov kernel, which we just actually like learned about and talked about when we were talking about quantum systems with Chris and Mike and John.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5817.368,
    "end": 5819.61,
    "text": "So that was like, I think live stream number 40.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5822.149,
    "end": 5832.72,
    "text": " Also, on that technical note, I would suggest that the plain essence of the blanket definition does not entail any sort of dynamical rearrangement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.261,
    "end": 5843.291,
    "text": "However, recent work by Dalton S. and others has pointed towards a definition of a blanket index, which reflects a weakly mixing dynamical...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5844.472,
    "end": 5865.523,
    "text": " interface zone that is on a zero to one continuum and that may point towards um the kind of rearrangeable interfaces although not with the kind of um category theoretic nature as far as I know but again this is like a very interesting area um and I I can see many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.463,
    "end": 5870.706,
    "text": " applications in systems, including online teams and organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.167,
    "end": 5880.814,
    "text": "And so I really liked that you used what was at hand and at eye for making some of these connections clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.834,
    "end": 5883.336,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5886.35,
    "end": 5888.274,
    "text": " And just one last connection.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5888.674,
    "end": 5898.751,
    "text": "You had mentioned your applied trails that you're chasing right now, and you mentioned prediction markets.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5900.138,
    "end": 5908.683,
    "text": " And I do think that, well, first of all, you talked about, like, before you talked about that, you talked about the free energy minimizers, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5908.703,
    "end": 5915.107,
    "text": "Like, so if each little component in the system is a free energy minimizer and how, like, within the FEP, it can...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5916.267,
    "end": 5936.93,
    "text": " scale to form like a container free energy free energy minimizer so yes and that like will stay a free energy a free energy minimizer as long as it decreases the free energy of all of the components in the container for it to stay a container right like so that like speaks to self-assembly and perhaps morphogenesis um and and then in these uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5937.811,
    "end": 5940.433,
    "text": " So, yeah, consider how free energy minimizers arrange themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5940.473,
    "end": 5940.893,
    "text": "There we go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5941.233,
    "end": 5945.136,
    "text": "And how they constitute a larger scale free energy minimizer if it lowers the free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5945.956,
    "end": 5955.542,
    "text": "And then just in terms of application, prediction markets, I think, is a really good way to maybe align category theory with the FEP.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5955.662,
    "end": 5958.684,
    "text": "And I think some of that has been done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5959.805,
    "end": 5962.287,
    "text": "I want to say like the multi-armed bandit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5962.867,
    "end": 5966.59,
    "text": " problem is maybe like a rudimentary example of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5966.63,
    "end": 5968.371,
    "text": "And I don't remember which live stream that was.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5968.431,
    "end": 5969.292,
    "text": "It was a long time ago.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5969.732,
    "end": 5976.417,
    "text": "But we did have a paper dealing with the multi-armed bandit problem and using active inference to solve it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5976.457,
    "end": 5982.141,
    "text": "And that might be like a way to start to align more.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5982.201,
    "end": 5986.024,
    "text": "On the prediction market area, and then David, really curious to hear what you think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.744,
    "end": 5989.767,
    "text": "I see a lot of parallels with what you described about transistors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.859,
    "end": 5999.946,
    "text": " again, you said a thousand pieces, components in this transistor, the space of the a thousand PICN connections might be vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6000.526,
    "end": 6010.994,
    "text": "And so that's where like selective processes and abductive logic come into play with this two-stroke engine of like diversifying and exploring the space and pruning down based upon function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6011.514,
    "end": 6014.236,
    "text": "And so we could imagine prediction markets where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6015.117,
    "end": 6044.492,
    "text": " the nestmate level the the colony participant is making great predictions but then they're being compiled in a way that's actually inadequate we could also imagine the other extreme where no nestmate knows how much food the colony has or what the weather is outside etc but its natural actions still participate in a colony or in a market that makes adaptive decisions so in that structuring of multi-scale sense making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6045.822,
    "end": 6059.643,
    "text": " the composability and the ability to create systems that are valid across scales and don't enforce any kind of implausible constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6061.425,
    "end": 6067.026,
    "text": " it becomes essential because people point sometimes to wisdom of crowds and all these other related areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6068.126,
    "end": 6072.907,
    "text": "And there's probably some areas and some ways of doing it that are just incredibly effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6073.467,
    "end": 6080.329,
    "text": "And I'm sure we can think of crowds and ways of doing it and questions where it is just not that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.349,
    "end": 6081.629,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.829,
    "end": 6090.511,
    "text": "So in this work on dynamic organizational structures, there's a kind of fractal-like nature to it where the same thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6090.919,
    "end": 6092.621,
    "text": " like there's one formula for the whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6093.522,
    "end": 6106.355,
    "text": "And so in order to be one of these things, like in this technical sense that we wrote up, it can't have all sorts of crazy stuff at one level that doesn't exist at another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6106.375,
    "end": 6107.256,
    "text": "Like we,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6109.278,
    "end": 6123.467,
    "text": " This is not supposed to be an indictment of it, but we tried to make a more socialist example of a prediction market where the wealth, the updated wealth would be more evenly distributed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6123.888,
    "end": 6125.369,
    "text": "And it wasn't hierarchical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6125.469,
    "end": 6133.234,
    "text": "It didn't have the fractal-like property where what would happen at the high level was coherent with what was happening at the low level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6133.714,
    "end": 6138.137,
    "text": "And so it could have been because we weren't creative enough or whatever, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6138.607,
    "end": 6147.752,
    "text": " My main point is that there are rules to this system that say when it's going to kind of align across the entire structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6148.473,
    "end": 6153.055,
    "text": "And when it does, then you get a very short description that happens at all scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6154.196,
    "end": 6154.576,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6156.315,
    "end": 6164.44,
    "text": " what this kind of tracking system allows is to say, I mean, you don't have to trust that dynamic organizational structures are a good system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6164.94,
    "end": 6178.289,
    "text": "But if you were like, well, we need something to guide us here, then you could use it to say, well, this way of assembling predictions to make a higher level prediction just doesn't work as one of these dynamic organizational structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6178.329,
    "end": 6184.973,
    "text": "And therefore, we're going to deny it as the way we're going to do stuff because they're just not going to work when we do multiscale things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6187.727,
    "end": 6188.634,
    "text": " These four examples,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6190.956,
    "end": 6218.444,
    "text": " do so in heavy learning for example what we what we mean by that is um spike time dependent plasticity where like what happens if if i hear you say the same kind of valence as as me but you said it like one second ago whereas i'm saying it now then then i want to wire to you more strongly so this kind of like just you know this kind of time horizon where i'm listening for your you know your agreement with me and if you did before me then i want to wire to you more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6219.016,
    "end": 6223.757,
    "text": " That itself, there is a way of putting those together that has this kind of fractal-like structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6224.217,
    "end": 6225.778,
    "text": "But there's tons of ways of doing it that don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6226.618,
    "end": 6228.518,
    "text": "And so that's kind of what's going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6231.399,
    "end": 6243.622,
    "text": "In what you just said with a short description across scales, I see it reflected in that definition you wrote up on the chalkboard that could be uncompressed and in pass the salt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6244.723,
    "end": 6245.583,
    "text": "Pass the salt, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.069,
    "end": 6269.374,
    "text": " And then in the organizational setting, that kind of multi-scale decision-making and ability to address a kind of integrated stack of scales such that there is a compression, like I am running, which is describing a coherent set of actions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6270.433,
    "end": 6280.86,
    "text": " ranging all the way down to the cellular and molecular, that can be semantically compressed in a verbal or linguistic community in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6281.04,
    "end": 6285.403,
    "text": "And there's other people who you say, I'm running, and they're going to look at you like, what language are you speaking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6285.904,
    "end": 6290.767,
    "text": "So it still is contextual, yet we can have these multi-scale descriptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6292.523,
    "end": 6294.603,
    "text": " And then I have a note from Kevin in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6295.984,
    "end": 6306.926,
    "text": "In case it hasn't been noted, might be worth mentioning to David that Markov blankets in active inference are just a kind of Bayesian network directed acyclic graphs with probabilities assigned to the vertices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6307.406,
    "end": 6317.048,
    "text": "For all those who will be following this trail and working to build this relationship, hopefully, between category theory and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.148,
    "end": 6317.649,
    "text": "Thank you, Kevin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6319.149,
    "end": 6319.689,
    "text": "Cool, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6323.966,
    "end": 6324.507,
    "text": " Very cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6324.607,
    "end": 6326.108,
    "text": "I think we're coming up on time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6326.468,
    "end": 6333.815,
    "text": "David, do you want to tell us maybe a little bit about, or if you have any questions for us about active inference, we would be happy to maybe attempt to elaborate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6335.116,
    "end": 6345.524,
    "text": "Or also, if you want to tell us a little bit about Topos Institute and what your goal and function or how you came to self-assemble in that form, that would be great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6346.545,
    "end": 6347.366,
    "text": "Sure, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6349.368,
    "end": 6351.93,
    "text": "Basically, in academia, there's no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6354.531,
    "end": 6356.672,
    "text": " my co-founder, Brendan, and I wrote a textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6357.253,
    "end": 6362.216,
    "text": "There's no interest in textbook writing in academia, especially to help people learn a new subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6363.137,
    "end": 6364.278,
    "text": "There's no reward for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6364.838,
    "end": 6371.884,
    "text": "There's no reward in math for making tools out of the math or trying to help people either learn it or use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6372.584,
    "end": 6373.104,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6374.909,
    "end": 6377.171,
    "text": " Basically, I'd been at MIT for eight years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6377.211,
    "end": 6383.855,
    "text": "And then my department head said, we now have a new policy that you can only be here five years if you don't have tenure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6383.895,
    "end": 6384.655,
    "text": "And I didn't have tenure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6384.696,
    "end": 6385.696,
    "text": "I was a research scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6386.217,
    "end": 6389.979,
    "text": "And so he gave me two and a half years to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6390.78,
    "end": 6397.524,
    "text": "And so I was like, well, OK, that makes sense because academia doesn't care about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6399.289,
    "end": 6400.869,
    "text": " about the stuff that I'm really trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.41,
    "end": 6408.111,
    "text": "And so Brendan and I made Topos Institute because we actually want the stuff we're doing to help the world makes more sense of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6408.611,
    "end": 6416.213,
    "text": "We're a network of people, the world, that has to steer, that has to decide, is climate change real?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.333,
    "end": 6418.694,
    "text": "Is Obama a Muslim?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6418.734,
    "end": 6420.254,
    "text": "We don't know these answers, apparently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6420.314,
    "end": 6422.094,
    "text": "We can't figure these things out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6422.655,
    "end": 6425.975,
    "text": "And I think it's because we don't have the communication to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6429.696,
    "end": 6442.121,
    "text": " And so I just want, like, I think there's just, it's not because I think there is this greed thing in everyone or this need to survive or whatever it is, this hiding of information that like is probably causing problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6442.442,
    "end": 6443.342,
    "text": "And I don't really understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6443.402,
    "end": 6443.862,
    "text": "And you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6443.902,
    "end": 6449.825,
    "text": "Like we don't need everything out in the open, but mostly I think what's really causing problems is just lack of communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6450.936,
    "end": 6477.114,
    "text": " like my greed if i understood how it was affecting you maybe i wouldn't need to do this particular one and like if you understood how the scientists came to the idea of climate change and you could like track track that to the level you wanted to you could like actually you know understand these things then maybe you wouldn't question it it's just that like you haven't done the experiment for yourself and you're not trusting that it's done the right way and so i was hoping at least that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6478.191,
    "end": 6490.201,
    "text": " the more we can help people communicate and understand each other and have high fidelity accounting systems so we can like be accountable, the more we can solve problems together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6490.442,
    "end": 6501.711,
    "text": "And like, since that wasn't being rewarded in academia itself, we needed to go outside and position ourselves kind of between academia and industry and society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6503.693,
    "end": 6505.895,
    "text": "So that's how we decided to form Topos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6507.876,
    "end": 6533.345,
    "text": " that that notion of accountable communication is really powerful because we see cases where communications are accounted for with metadata logging and peer review and where are we accountable socially where is it a digital accountability and the accounting schemes are askew and so people are looking at their shred of the spreadsheet and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6534.245,
    "end": 6543.554,
    "text": " uncertain on how those numbers were derived whether it's the whole picture do you have all the sheets in that file like with a partial picture and yet the space of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6544.659,
    "end": 6549.8,
    "text": " communication strategies, just like that thousand part transistor board was vast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6550.08,
    "end": 6551.661,
    "text": "Well, there's more than a thousand people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6552.141,
    "end": 6570.546,
    "text": "And so the space of communication simply edges, let alone quality and tone and content is so vast that again, it emphasizes the need for a vocabulary and a grammar and a syntax of composable dynamic organizational structures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6571.366,
    "end": 6595.604,
    "text": " so we can even begin to be working not just in this one very local potentially reason in organizational space yeah i totally agree i mean in computers and the internet we have very composable things that you can write really make math out of and like at every scale in some sense there's like the same sort of thing happening and this allows computer scientists to talk to each other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6596.624,
    "end": 6603.285,
    "text": " And the guy working, someone working on like internet protocols and someone working on transistors, on some level they can kind of talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6603.885,
    "end": 6613.207,
    "text": "But like an urban planning person and a, you know, a biologist, geneticist and a mathematician and like, I don't know, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6613.287,
    "end": 6618.048,
    "text": "Like these people across society, they're like talking in wingdings at each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6618.628,
    "end": 6622.149,
    "text": "Like they're just like, you know, mailbox envelope people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6622.669,
    "end": 6644.29,
    "text": " ampersand and like they don't understand what each other is talking about and that there we're never gonna if we can't cohere like there's all these little languages and they're not coherent together and in category theory there's tons of languages there's a language of topology there's a language of algebra there's language of logic there's logic you know there's number theory there's tons and tons of languages and each one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6645.319,
    "end": 6669.158,
    "text": " needs to be an isolated like needs to have its own space so it can develop notation for itself so it can develop techniques for itself and not have to like ask anybody else's permission and what category theory and same with like urban planning and genetics like they don't the geneticist doesn't want to say like oh sorry i used the word you know structure and i know you're already using the word structure so we'll call it something else like they don't want to like have to do that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6670.034,
    "end": 6688.604,
    "text": " And yet in category theory, what it allows you to do in math is take topology and make an analogy with number theory or with algebra and actually send information that can lands intact because the functor tells you what you're expecting to keep and what you're expected to lose across this connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6689.264,
    "end": 6691.345,
    "text": "And anything you're expecting to keep, it keeps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6691.946,
    "end": 6694.647,
    "text": "And so what we're hoping for is that by creating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6695.339,
    "end": 6715.163,
    "text": " like finding languages that you can use across lots of disciplines from epidemiology to chemistry or whatever, we can create single languages and then connect them to other languages, database languages and physics languages and stuff like that, and allow them to each evolve independently",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6715.683,
    "end": 6728.506,
    "text": " and create their own independent notation and techniques, and yet be able to have that interface, that compressed thing, send something across the boundary to somebody else and have it arrive intact in a trustworthy and accountable way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6731.727,
    "end": 6732.027,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6732.648,
    "end": 6736.93,
    "text": "Well, David, thanks for hanging out with us and talking to us about category theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6736.95,
    "end": 6740.172,
    "text": "And maybe come back and talk to us some more about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6740.192,
    "end": 6746.596,
    "text": "And maybe we can align deeper on the relationship between the type of things that you're discussing and active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6746.616,
    "end": 6747.116,
    "text": "That'd be great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6747.477,
    "end": 6747.897,
    "text": "That's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6747.937,
    "end": 6748.077,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6748.157,
    "end": 6750.879,
    "text": "Thanks a lot for the invitation to be with you guys today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6751.459,
    "end": 6751.679,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6751.879,
    "end": 6752.139,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6752.62,
    "end": 6753.04,
    "text": "Thank you, David.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6753.06,
    "end": 6753.44,
    "text": "Goodbye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6754.341,
    "end": 6754.541,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]