[
  {
    "start": 11.052,
    "end": 23.031,
    "text": " hello everyone welcome to the active inference lab the active inference live stream this is active inference live stream number 14.0 and i'm looking forward to today's discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.373,
    "end": 27.935,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.616,
    "end": 34.64,
    "text": "We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.321,
    "end": 46.229,
    "text": "You can find us on our website, on Twitter, our email address, on our YouTube channel, our Keybase public team, and our shared username, Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.53,
    "end": 53.275,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve our work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.4,
    "end": 56.742,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.623,
    "end": 61.986,
    "text": "And as far as video etiquette for live streams, please mute if there's noise in the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.486,
    "end": 67.871,
    "text": "Raise your hand so we can hear from everybody who wants to speak, and we will use respectful speech behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.48,
    "end": 79.447,
    "text": " For the regularly scheduled Active Inference streams during 2021, all group discussions are going to be on Tuesdays from 7 to 9 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.687,
    "end": 85.451,
    "text": "Pacific Time, and that will be a regular weekly time slot, and we also do special sessions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.112,
    "end": 92.697,
    "text": "If you go to this link with the red text, you can see some information about participating in future streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.337,
    "end": 116.793,
    "text": " and definitely get in touch with us if you want to participate in 2021 or if you have an idea for an event or somebody we could invite for a live stream if you go to that spreadsheet you will see these um columns that cover the date of each active inference live stream that's scheduled and what we'll be reading and anything else about it we just finished up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.781,
    "end": 120.503,
    "text": " 13.1 and 13.2, which were really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.164,
    "end": 130.515,
    "text": "And this .0 video is heading into Active Inference Stream 14.1 and 14.2, Reading the Math is Not the Territory by Mel Andrews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.535,
    "end": 133.698,
    "text": "And Mel will be joining us for these discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.999,
    "end": 135.701,
    "text": "So we're really looking forward to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.708,
    "end": 146.57,
    "text": " Today in Active Inference Stream 14.0, the goal is to set the context for 14.1 and 14.2, which will be group discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.13,
    "end": 156.653,
    "text": "And the paper under consideration in all three of these live streams is The Math Is Not the Territory, Navigating the Free Energy Principle by Mel Andrews 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.073,
    "end": 162.774,
    "text": "The video is just an introduction to some of the ideas and some of the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.894,
    "end": 165.155,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.574,
    "end": 174.521,
    "text": " And a punchline for this paper is all models are wrong, but some are useful and some are the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.081,
    "end": 175.842,
    "text": "Which ones are which?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.142,
    "end": 177.503,
    "text": "That's what we're here to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.045,
    "end": 192.316,
    "text": "In the sections of 14.0 today, first we'll go through the aims and claims of the paper, talk about a little background represented by the keywords, go through the abstract and look over the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.191,
    "end": 218.685,
    "text": " then we'll pass through a few key topics and key quotations from the paper and end up with a couple questions that are remaining in 14.1 and in 14.2 we're going to be discussing this very same paper so save your questions post them as a comment on this video and definitely get in touch if you want to participate live in this conversation or in a future or different conversation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.413,
    "end": 235.497,
    "text": " Okay, here we are in the paper, which is The Math is Not the Territory, Navigating the Free Energy Principle by Mel Andrews, which was put up on a PhilSci Archive preprint server on October 8th, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.018,
    "end": 241.299,
    "text": "And the aims and the claims of the paper are as follows, quoting Mel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.352,
    "end": 251.385,
    "text": " With respect to the demarcation problem, I defend the position that the FEP, Free Energy Principle, can be taken to belong properly to the domain of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.066,
    "end": 258.676,
    "text": "And we're going to talk more about the demarcation problem in a few minutes, but that's the question of what is science and what is not science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.202,
    "end": 271.505,
    "text": " Mel writes, the FEP is certainly not anything like a theory, a law, a hypothesis, or a research program, as these have been classically understood in the history and philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.205,
    "end": 285.149,
    "text": "So this is a claim that what the FEP is or what it does, how it's enacted in the world is different than some of these classical history and philosophy of science terms like theory, law, hypothesis, or program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.438,
    "end": 298.564,
    "text": " In order to see how the literature on scientific models accords with the FEP, however, we will first need to establish a firm sense of what the FEP is and what it is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.565,
    "end": 304.027,
    "text": "This will require dispelling a number of false assumptions that have been made about the framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.828,
    "end": 313.973,
    "text": "I accomplish this first by tracing out the historical buildup to the FEP, illustrating where the formalism has been derived from and from what it has come to signify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.867,
    "end": 325.97,
    "text": " And continuing on that quote, this serves the purpose primarily of showing how much of the mechanics of the FEP had physical meanings in its initial form, but has since come into a strictly formal use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.551,
    "end": 336.994,
    "text": "Following this, I will demonstrate that the formalism is empty of any sort of facts or assertions about the state of nature that would allow it to draw taxonomical distinctions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.594,
    "end": 345.323,
    "text": " to differentiate classes of natural systems, to explain their behavior in terms of underlying mechanisms, or to bring forth testable hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.384,
    "end": 347.485,
    "text": "Strong claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.006,
    "end": 353.712,
    "text": "And that's what's going to be fun about this paper and this discussion is it's hopefully going to be...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.929,
    "end": 359.151,
    "text": " highlighting many different perspectives on what the FEP is or is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.372,
    "end": 370.538,
    "text": "So if you're watching live, if you're watching afterwards, if you want to participate in some way and you're curious about these questions, these are the kinds of questions that are being actively researched and debated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.738,
    "end": 371.739,
    "text": "So you're in the right place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.786,
    "end": 379.971,
    "text": " Let's see how we're going to set up the background to address these aims and claims of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.792,
    "end": 391.68,
    "text": "The keywords of the paper are as follows, free energy principle, Bayesian brain, life-mind continuity, scientific models, modeling and simulations, scientific theories,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.521,
    "end": 409.368,
    "text": " epistemic virtues falsification and the demarcation problem now as always for these keywords there's really so much to be said about each one you could study for your whole life going down just one detail of one of these keywords so it's not a review it's not a final word",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.288,
    "end": 437.079,
    "text": " my target with these keyword summaries is the construction of a bi-directional on-ramp it's a it's not an off-ramp it's actually an on-ramp for everyone and the on-ramp is going between this paper and broader communities so if you're in the active inference community i hope that this paper is an introduction or a reminder of some of the bigger philosophical and historical trends that the fep and active inference research is happening inside of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.22,
    "end": 451.397,
    "text": " And if you're outside of the active inference research community, then hopefully you're going to find a few points of contact with how you currently view the world, but also start to get excited and curious about this little thing called free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.098,
    "end": 453.941,
    "text": "What is the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.895,
    "end": 464.497,
    "text": " Well, on this slide, I've put up a couple of terms and these terms are all going to come together in the free energy principle and I'll read a couple quotes on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.937,
    "end": 468.458,
    "text": "But the terms up here are multi-scale systems from the left to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.818,
    "end": 473.539,
    "text": "So that means systems that exist across multiple spatial and temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.919,
    "end": 484.082,
    "text": "So something that exists over milliseconds and seconds and minutes, that's temporal scales and something that is existing or displaying orderliness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.722,
    "end": 487.465,
    "text": " over spatial scales that are small to big.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.765,
    "end": 494.431,
    "text": "So cells that are part of an organized tissue, that are part of an organism, part of a ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.651,
    "end": 495.692,
    "text": "That's multiscale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.065,
    "end": 503.711,
    "text": " Another key aspect of the free energy principle is a focus on ensembles, which is akin to talking about collective behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.232,
    "end": 508.055,
    "text": "So we're not going to be behavioral reductionists or essentialists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.476,
    "end": 519.286,
    "text": "We're not going to go to the smallest possible unit of motion and say that that's the most meaningful, nor are we going to simply go to the largest scale of phenotype and say that that's the most meaningful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.746,
    "end": 522.509,
    "text": "We're going to be using this multi-scale perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.089,
    "end": 532.854,
    "text": " and thinking about ensembles of collective systems and using that to move beyond internalism and externalism to integrate holism and reductionism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.783,
    "end": 537.986,
    "text": " We're also going to be taking a strong informational thermodynamic perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.426,
    "end": 543.709,
    "text": "And some of the history of this, we're gonna trace in this video and was so excellently traced by Mel during the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.67,
    "end": 548.833,
    "text": "And info thermodynamics is basically starting with thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.053,
    "end": 562.682,
    "text": "So about the vibrations of molecules and about heat and entropy, and then considering how, since information is something that has to be embodied or manifest in the real world, for example, on a hard drive or passing through a wire,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.542,
    "end": 583.91,
    "text": " we can actually think about thermodynamics and signal processing within a broader informational capacity and then this last point here action policy selection as so this first part is saying it's going to be a control theory or a cybernetic focused framework and the way that those policies are going to be obtained",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.99,
    "end": 590.995,
    "text": " is going to be through a type of variational multi-scale Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.456,
    "end": 597.823,
    "text": "So we're not gonna be using linear regression or we're not gonna be using some other type of machine learning algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.003,
    "end": 602.168,
    "text": "We're gonna be using derivatives on this variational Bayesian inference approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.988,
    "end": 605.972,
    "text": "How about this bug on the left side of this slide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.132,
    "end": 607.353,
    "text": "Why is there a little bug?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.174,
    "end": 623.702,
    "text": " Well, that comes from the title of an interview that I carried out with my colleague Martin and Carl Friston in 2018 that was entitled of Woodlice and Men, a Bayesian account of cognition, life, and consciousness at the URL here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.542,
    "end": 633.046,
    "text": "And we asked him early in the interview, we said, what is the free energy principle and how did you get to the place where you are at with it now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.867,
    "end": 634.567,
    "text": "And Carl wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.121,
    "end": 641.308,
    "text": " He was watching wood lice, which are these little bugs, watching them scurry around on the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.949,
    "end": 651.04,
    "text": "And he wrote, after half an hour of observation and innocent childlike contemplation, I realized that their scurrying had no purpose or intent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.601,
    "end": 664.318,
    "text": " They were simply moving faster in the sun and slower in the shade, which meant that they were spending most of their time in the shade from a population or ensemble perspective because they would go rapidly through the sun and then dwell in the shade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.358,
    "end": 667.402,
    "text": "So even if it was 50-50, you'd end up enriching them in the shade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.162,
    "end": 687.455,
    "text": " simplicity of this explanation for what one could artfully call biotic self-organization appealed to me then and appeals to me now it is exactly the same principle that underwrites the ensemble density dynamics of the free energy principle and all of its corollaries so that's a key piece there's going to be ensemble density dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.935,
    "end": 690.659,
    "text": " So it's going to change through time and it's going to be collective behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.14,
    "end": 697.909,
    "text": "And it's going to be related to not just the free energy principle, but some of its corollaries or some things that are adjacent to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.989,
    "end": 699.171,
    "text": "And we'll talk about what those are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.967,
    "end": 717.04,
    "text": " He then continued, over the subsequent 20 years, I learned enough mathematics to think about these shapes of wood lice in terms of density dynamics, namely the evolution of probability density distributions over ensembles of states, for example, swarms of wood lice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.68,
    "end": 723.865,
    "text": "Happily, people had been using this exact sort of framework both to model the world and analyze their data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.526,
    "end": 729.129,
    "text": "I came to know this as ensemble learning and in particular, variational Bayes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.85,
    "end": 733.071,
    "text": " This is how the free energy principle developed into the current framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.531,
    "end": 739.413,
    "text": "In brief, I was very lucky to meet the right people and work in an era when these ideas were in the air.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.414,
    "end": 743.815,
    "text": "So as always, humble and insightful, Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.034,
    "end": 746.374,
    "text": " What is the Bayesian brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.054,
    "end": 773.5,
    "text": "Let's draw from one of the questions that Martin and I asked in our interview, because we tried to be very clear about what the Bayesian brain was so that we could be very clear in distinguishing it, what the free energy principle was, and also just so that we don't end up confounding our uncertainty as we try to contrast different ideas, because it's really important to have a solid understanding of these terms that we're going to be talking about so that we don't accidentally make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.8,
    "end": 778.324,
    "text": " errors or misattributions or false positives or false negatives in our understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.805,
    "end": 790.475,
    "text": "We wrote, the Bayesian brain hypothesis, predictive coding, and the free energy principle are often equated with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.255,
    "end": 796.38,
    "text": "You have yourself suggested that these three frameworks are variation of the same basic mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.486,
    "end": 807.41,
    "text": " To be clear, what we call the Bayesian brain hypothesis is the idea that the brain performs inference according to Bayes' theorem, integrating new information in light of existing models of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.29,
    "end": 821.975,
    "text": "A perceptual or cognitive state can be modeled as being a posterior probability, so P of H given D, where P stands for probability, H, hypothesis, cause, and D, observed or available data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.075,
    "end": 825.797,
    "text": "So the probability of the hypothesis being the case given the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.858,
    "end": 851.213,
    "text": " posterior probability is the product of the likelihood p d given h the probability of the data given the hypothesis and the prior probability which is p of h or just the probability of a hypothesis being true in other words the probability of the model h being true is the likelihood of the model h given the observation d multiplied by the likelihood of a model h relative to other models under consideration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.52,
    "end": 855.641,
    "text": " To make these equations a bit more concrete, let us take the following example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.081,
    "end": 863.364,
    "text": "The brain is receiving scarce data, D, from the retina and must form a model, H, of how the world has caused this pattern on the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.024,
    "end": 880.791,
    "text": "In Bayesian terms, the problem to be solved is the following, P of H given D. No, not PHD, P of H given D. The Bayesian brain hypothesis implies that the posterior probability at time one, T1, provides the prior probability at time two, T2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.529,
    "end": 895.898,
    "text": " So this was our characterization of the Bayesian brain, and we're going through it because it's a key word in this paper, because it's very important to understand what exactly the Bayesian brain is or isn't so we can understand what the FEP is or isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.398,
    "end": 898.4,
    "text": "So that's the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.68,
    "end": 901.562,
    "text": "It's the idea that we're going to use Bayesian approaches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.162,
    "end": 912.904,
    "text": " Bayesian equations, formalisms to model the way that the brain as a statistical instrument in the world, yes, an evolved one, but we're going to focus on the process of inference for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.825,
    "end": 923.827,
    "text": "It's going to be generating hypotheses about latent causes of the world or about things in the world, given observations and updating its prior understandings or beliefs about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.267,
    "end": 929.609,
    "text": " We then asked if Carl agreed with that characterization of the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.269,
    "end": 939.812,
    "text": "And he wrote, even though he also improved the question as we had asked it, he wrote in his response, do I agree with this characterization of the Bayesian brain hypothesis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.972,
    "end": 941.673,
    "text": "Yes, I do, with a couple caveats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.173,
    "end": 945.975,
    "text": " I think it is useful to make a fundamental distinction at this point that we can appeal to later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.615,
    "end": 959.082,
    "text": "The distinction is between a state and a process theory, i.e., the difference between a normative principle that things may or may not conform to and a process theory or hypothesis about how that principle is realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.109,
    "end": 969.932,
    "text": " Under this distinction, the free energy principle, ergo it's a normative principle, stands in stark distinction to things like predictive coding and the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.552,
    "end": 971.572,
    "text": "So, critical point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.832,
    "end": 974.593,
    "text": "Principles are contrasted with hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.793,
    "end": 979.014,
    "text": "This is because the free energy principle is what it is, a principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.814,
    "end": 983.455,
    "text": "Like Hamilton's principle of stationary action, it cannot be falsified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.635,
    "end": 987.476,
    "text": "Key point, and this has resulted in a lot of discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.832,
    "end": 1004.451,
    "text": " cannot be disproven in fact there's not much you can do with a free energy principle unless you ask whether measurable systems conform to the principle on the other hand hypotheses that the brain performs some type of bayesian inference or predictive coding are what they are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.912,
    "end": 1028.268,
    "text": " hypotheses these hypotheses may or may not be supported by empirical evidence so in other words those hypotheses can be falsifiable they can be tested and rejected you can say if it's the case that the brain is doing bayesian inference it should have this observation in this brain region okay we measured it's consistent or it's not we rejected it so it's funny because even though we're talking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.108,
    "end": 1046.263,
    "text": " about Bayesian brain, which is a post-falsificationist idea in the sense of statistics, we're actually going to use the Popperian idea of falsification from the philosophy of science perspective to ask whether we could falsify the Bayesian brain idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.744,
    "end": 1051.028,
    "text": "So what does it look like to have hypotheses that are beyond falsificationism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.568,
    "end": 1079.078,
    "text": " does bayesian statistics or the bayesian turn actually move us away from simple falsification because it's not the case that there's just going to be some experiment in most situations that slam dunk disproves usually most evidence is actually ambiguous depending on how you weight the different possibilities for example a tree to an evolutionary biologist is an example of natural selection but to a creationist the very same tree is an example of creation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.518,
    "end": 1083.319,
    "text": " So that's how evidence is related to the generative model that someone has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.96,
    "end": 1095.743,
    "text": "In this view, the relationship between the free energy principle and predictive coding or the Bayesian brain or active inference is the relationship between a principle and a process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.743,
    "end": 1100.544,
    "text": "Crucially, there are lots of process theories that conform to the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.084,
    "end": 1105.605,
    "text": "Predictive coding is arguably the predominant process theory in cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.905,
    "end": 1107.426,
    "text": "However, there are other contenders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.237,
    "end": 1111.959,
    "text": " for example, based upon discrete as opposed to continuous state space models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.7,
    "end": 1116.322,
    "text": "These would include things like belief propagation and variational message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.822,
    "end": 1124.127,
    "text": "These schemes or processes serve as plausible metaphors for neuronal message passing that may or may not have the look and feel of predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.887,
    "end": 1130.009,
    "text": " it is important to note that there have been other process theories that have not fared so well in light of empirical evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.449,
    "end": 1138.612,
    "text": "For example, probabilistic population codes and attempts to understand ensemble dynamics in terms of sampling from the posterior, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.792,
    "end": 1140.713,
    "text": "Gibbs sampling and particle filtering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.133,
    "end": 1156.326,
    "text": " so in other words free energy principle is beyond or before empirical data however it lends itself to corollary hypotheses process theories that make specific testable predictions about how the fep is getting done",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.966,
    "end": 1162.991,
    "text": " And so you could predict that little tiny unicorns are doing it, and then you could go and measure and falsify that idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.352,
    "end": 1171.859,
    "text": "So again, we're using the Popperian idea of falsification of theories to discuss whether this Bayesian perspective on the brain is adequate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.814,
    "end": 1183.702,
    "text": " The Bayesian understanding of the brain, if we pull back a step, is related to what is called and what is keyworded as life-mind continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.403,
    "end": 1189.307,
    "text": "And this is what the definition of the inactive life-mind continuity thesis is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.608,
    "end": 1197.954,
    "text": "It's written as, any living system is ipso facto a cognitive system, or in other words, life is sufficient for mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.195,
    "end": 1201.778,
    "text": "So that's the claim, that living systems are mindful systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.728,
    "end": 1207.489,
    "text": " What makes a system living and therefore cognitive is its autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.929,
    "end": 1214.031,
    "text": "Now, this often ties me up because I think, okay, autonomous systems, does that mean they must be cognitive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.071,
    "end": 1223.313,
    "text": "So now we're working backwards from what appears to be cognitive, but isn't that hubris because we're putting our understanding of another system in front of its actual way of being in the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.893,
    "end": 1224.173,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.193,
    "end": 1231.715,
    "text": "And the last point here is understanding cognition requires understanding the principles of biological autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.685,
    "end": 1236.826,
    "text": " And this is just the simplest phrasing of that thesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.986,
    "end": 1241.288,
    "text": "So that's kind of like that claim, which is living systems are those with minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.728,
    "end": 1243.609,
    "text": "Now, where does awareness come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.709,
    "end": 1245.569,
    "text": "Free will, agency, autonomy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.33,
    "end": 1246.99,
    "text": "Great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.09,
    "end": 1253.752,
    "text": "If anyone knows, if anyone has suggestions, let's hear them in the live chat or come on and let's discuss it on a stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.632,
    "end": 1258.794,
    "text": "But this was something that I was just learning about when I was preparing for this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.554,
    "end": 1272.41,
    "text": " And another thing that I found that was pretty cool was a paper from 2017 in Progress in Biophysics and Molecular Biology, which sounds like it would be just about molecular biology of a journal, but actually it's an awesome journal with a lot...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.453,
    "end": 1274.534,
    "text": " other ideas happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.254,
    "end": 1278.937,
    "text": "And it's a paper by Hippolyto and Martins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.697,
    "end": 1283.259,
    "text": "And Hippolyto is also a free energy principle researcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.339,
    "end": 1298.95,
    "text": "So I thought it'd be cool to highlight this paper and this perspective because the inactive life-mind continuity thesis is not written about with the FEP in mind, whereas this paper may have been written at least a little bit more directly with FEP in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.83,
    "end": 1327.963,
    "text": " and it's called mind life continuity a qualitative study of conscious experience and the authors wrote according to the mind life continuity thesis there are three levels on the weak continuity view whatever has mind will have life although not all things that have life have mind so this is the weakest version of the claim which is it isn't the case that just being life makes you mindful however if you have mind you do have life so that's the weakest version of the claim",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.983,
    "end": 1347.118,
    "text": " on the strong continuity view life and mind have a common abstract model or set of basic organizational properties or things that lead to them so in this view the one-to-one overlap is strong there's a total venn diagram overlap living systems are mindful systems and that's one to one so you're either both or you're neither",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.675,
    "end": 1356.579,
    "text": " On the methodology continuity view, the understanding of mind requires further understanding the role that it plays within the whole living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.099,
    "end": 1367.265,
    "text": "So that's a little bit more like a meta or a wholist or an ecological perspective, because it's like saying, we need to understand autonomy and agency, which is the embeddedness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.57,
    "end": 1374.715,
    "text": " of the agent in the niche, we can't just look at the head and ask whether mind is inside of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.356,
    "end": 1379.599,
    "text": "It's actually a view that suggests that life and mind are relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.699,
    "end": 1380.5,
    "text": "So that's pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.441,
    "end": 1389.007,
    "text": "Each of these views within the life-mind continuity thesis share the perspective that cognition should be studied in the context of the whole organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.507,
    "end": 1397.394,
    "text": "So inactivism, holism, ecological psychology, a lot of these terms are coming into play with this life-mind continuity idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.888,
    "end": 1400.908,
    "text": " Let's talk about scientific models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.649,
    "end": 1404.809,
    "text": "So scientific models, it's a pretty big field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.889,
    "end": 1408.57,
    "text": "There's a lot of different types of models and science means a lot of different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.61,
    "end": 1418.832,
    "text": "We're gonna talk more about what science is or isn't in a couple minutes, but it's times like these when we can just go to the Simple English Wikipedia page and try to find the truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.812,
    "end": 1427.654,
    "text": "And on Simple English Wiki, it was written, a scientific model is a simplified abstract view of a complex reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.789,
    "end": 1448.604,
    "text": " to reality keyword if you want to find out what reality is i guess scientific models are used as a basis for scientific work they can be used to explain predict and test or to develop computer programs or mathematical equations or as i always thinking about it model explain predict design perturb control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.983,
    "end": 1455.785,
    "text": " A scientific model represents complex objects, events, and physical processes in a logical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.385,
    "end": 1459.807,
    "text": "They are an image of an original, which can be a model itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.107,
    "end": 1464.789,
    "text": "So this is kind of like simulacra theory or the work of Umberto Eco.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.749,
    "end": 1490.942,
    "text": " scientific models only have those details of the object or image model that are relevant i'd take a slight contention there it's not that they are only capturing the details of the object or the image that are relevant it's that they capture what they capture and whether what is captured is relevant or irrelevant that's perspectival or whether it's useful or not it's also up to the um the eye of the model viewer let's say and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.602,
    "end": 1496.343,
    "text": " And there is no strict mapping between a model and the original object it models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.863,
    "end": 1501.065,
    "text": "Models may only be valid for a given time interval, for a given object, or a given purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.425,
    "end": 1506.086,
    "text": "For example, there isn't necessarily going to be the one true Bitcoin price model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.446,
    "end": 1516.609,
    "text": "There might be different timescales of analysis or different kinds of trading systems that lend themselves to different kinds of models being utilized, and a model trained on year 1 through 5 might...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.189,
    "end": 1538.246,
    "text": " not be as good or might not even be adequate for a different time period so models are situational and that's also where we get this idea of science as something that's doing relevant and useful work utilitarian pragmatic work yet also is a social construct because it's enacted in a social setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.329,
    "end": 1548.657,
    "text": " Here's a couple flow charts that are just showing different aspects of the scientific process and the role that models play in the scientific process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.418,
    "end": 1554.982,
    "text": "Basically, starting from a real system, models are made and experiments can be carried out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.743,
    "end": 1558.566,
    "text": " Models lead to models of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.946,
    "end": 1572.378,
    "text": "Now, model system gets used a little bit confusingly, for example, to refer to fruit flies as a model system, as in they're a system that people study, but fruit flies are a real system and a model system would be like a simulation of a fruit fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.719,
    "end": 1578.684,
    "text": "But of course you get into these questions like, what if I'm really actually interested in studying the model of a fruit fly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.525,
    "end": 1588.29,
    "text": " But whether you're doing experiments in a so-called real system or simulations in a so-called model system, you're going to end up with observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.85,
    "end": 1600.777,
    "text": "And then even more abstract than simulation is actually doing analytical work or theory above the level of the model system to obtain theoretical predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.857,
    "end": 1604.82,
    "text": "Like for all temperatures, this variable is going to be greater than this variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.6,
    "end": 1621.263,
    "text": " And then by comparing and contrasting the empirical experimental results, the simulations and results that we observe, and theoretical predictions that we might get from a more a priori source, we're able to compare and improve our model and theory overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.763,
    "end": 1634.945,
    "text": "So this is not quite the scientific process that's on the wall of the elementary school, but it does capture how scientific modeling is about iterative improvements and about integrating across different kinds of experiments, different kinds of simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.158,
    "end": 1642.45,
    "text": " And just to give a point on the falsification, because falsification means in some situations to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.891,
    "end": 1655.455,
    "text": " to confabulate or maybe fabulate, to make up, to generate data that's false, like to basically commit scientific fraud is often called falsification of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.835,
    "end": 1661.117,
    "text": "So if someone says those documents were falsified, they don't mean that it was a hypothesis that got tested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.477,
    "end": 1665.278,
    "text": "Usually they mean somebody deep faked or disenforged those documents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.019,
    "end": 1669.68,
    "text": "But here is falsifiability from this Paparian perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.021,
    "end": 1680.692,
    "text": " In the philosophy of science, falsifiability or refutability is the capacity for a statement theory or hypothesis to be contradicted by evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.253,
    "end": 1688.201,
    "text": "For example, the statement, all swans are white is falsifiable because one could observe that black swans exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.266,
    "end": 1701.654,
    "text": " Falsifiability was introduced by the philosopher of science Karl Popper in his book Logic der Forschung from 1934, revised and translated into English in 1959 as The Logic of Scientific Discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.415,
    "end": 1709.7,
    "text": "He proposed it as the cornerstone, this idea of falsification, to both the problem of induction and the problem of demarcation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.3,
    "end": 1716.424,
    "text": "So induction is about generalizing from the specifics to the generals, but what is this problem of demarcation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.604,
    "end": 1718.866,
    "text": "We knew it's one of the keywords, so what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1719.946,
    "end": 1725.547,
    "text": " Another Wikipedia coming in to save the day for these last minute presentation makers like myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.487,
    "end": 1727.688,
    "text": "The demarcation problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.168,
    "end": 1742.17,
    "text": "In the philosophy of science and epistemology, which is the philosophical field about knowledge, STEM, knowledge, not just science, technology, engineering, and mathematics, but STEM means knowledge and epi means above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.35,
    "end": 1745.971,
    "text": "So the philosophical field that's above the question of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.799,
    "end": 1762.897,
    "text": " the philosophy of science in epistemology the demarcation problem is the question of how to distinguish between science and non-science it is it examines the lines between science pseudoscience and other products of human activity like art literature and beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.036,
    "end": 1770.759,
    "text": " The debate continues after over two millennia of dialogue among philosophers of science and scientists in various fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.399,
    "end": 1777.162,
    "text": "The debate has consequences for what can be called scientific in fields such as education and public policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.682,
    "end": 1791.388,
    "text": "So at the social level, this is why it's important because it will often be the case that somebody will say, well, we need a science driven policy or a science informed policy, or that's unscientific policy related to public health or education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.068,
    "end": 1799.833,
    "text": " And so who exactly gets to speak for science and who gets to demarcate or delineate or define science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.434,
    "end": 1804.857,
    "text": "And who gets to say whether science is all good and if people mess up, then they're not doing it right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.037,
    "end": 1809.94,
    "text": "Or is science all bad and all the good stuff comes from some other question of activity that humans do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.661,
    "end": 1814.323,
    "text": "So it's actually quite a big issue about this demarcation problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.763,
    "end": 1821.348,
    "text": "And that is resonant with the fact that people have been debating for a long, long time and not come to any simple conclusion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.509,
    "end": 1821.954,
    "text": " distinctions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.97,
    "end": 1832.056,
    "text": " Now with this paper in mind, we can look at the first lines of the introduction of the paper, which is a bold start by Mel, gotta love it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.616,
    "end": 1841.002,
    "text": "With respect to the demarcation problem, I defend the position that the free energy principle can be taken to belong properly to the domain of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.502,
    "end": 1847.786,
    "text": "So that's big and unique claim one, which is FEP is within the domain of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.127,
    "end": 1851.309,
    "text": "Now it might not be exactly like some of these things that we've seen before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.929,
    "end": 1855.012,
    "text": " but it's going to be taken to be within the domain of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.532,
    "end": 1859.175,
    "text": "So if you're listening to this and you think, well, I disagree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.195,
    "end": 1862.839,
    "text": "I don't think that FEP is within the realm of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.059,
    "end": 1864.58,
    "text": "Or maybe you have a yes and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.961,
    "end": 1870.185,
    "text": "Well, yes, I think it's in the domain of science and I think it's also in the domain of something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.686,
    "end": 1870.926,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.286,
    "end": 1882.85,
    "text": " So if you have a yes and or a disagreement or a question, put it in the live chat or come onto these group discussions and talk it out because Mel will probably be really happy to hear about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.15,
    "end": 1892.934,
    "text": "And we'll all learn so much by bringing out these different perspectives on science because we're going to some of the fundamental questions in philosophy and in science with these papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.914,
    "end": 1900.236,
    "text": " Let's talk about one way that this demarcation problem has been resolved or addressed in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.676,
    "end": 1911.94,
    "text": "And that's this NOMA idea or non-overlapping magisteria, which is the name of a paper by Stephen Jay Gould, who is a evolutionary biologist, I guess we could call him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.72,
    "end": 1921.063,
    "text": "And Gould wrote, the net or magisterium, it's kind of like the reign of science, covers the empirical realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.983,
    "end": 1926.267,
    "text": " What is the universe made of, fact, and why does it work that way, theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.088,
    "end": 1931.912,
    "text": "The magisterium of religion extends over questions of ultimate meaning and moral value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.652,
    "end": 1937.196,
    "text": "These two magisteria do not overlap, nor do they encompass all inquiry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.777,
    "end": 1941.24,
    "text": "Consider, for example, the magisterium of art and the meaning of beauty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.88,
    "end": 1967.361,
    "text": " now as always when quoting somebody or reading someone's paper we can really respect the author's view their perspective they set it out there how they wanted it to be said stephen jagul chose his words carefully when he wrote this but also we can ask whether we agree or disagree so here's this non-overlapping magisteria as a venn diagram they're so non-overlapping that they're just separate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.101,
    "end": 1982.79,
    "text": " circles so on the science side we get what is the universe made of that's what that's fact in gould's mind and why it works that way which is how or theory or potentially a scientist might call that mechanism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.65,
    "end": 1988.491,
    "text": " And then under the NOMA model, religion is what deals with morality and metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.911,
    "end": 2002.935,
    "text": "Now, interestingly, when some people think about non-overlapping magisteria, they'll say something like, well, science says what the world is, and implicitly they mean how as well, like what the world is, it's also a mechanism, and religion says why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.815,
    "end": 2008.297,
    "text": " And so that's a what, how versus why distinction for the demarcation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.677,
    "end": 2019.662,
    "text": "So these are questions that everyone can think of, whether you're just learning about these topics or whether you've been practicing in one field or another for a long time, it's an interesting thing to wonder about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.123,
    "end": 2021.023,
    "text": "What is science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.643,
    "end": 2022.744,
    "text": "What isn't science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.504,
    "end": 2025.586,
    "text": " Who decides and why does it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.247,
    "end": 2034.576,
    "text": "Is science one to one with technology or are there technologies that aren't science or are those two bound together more often than not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.096,
    "end": 2042.824,
    "text": "And when we really explore these maps of meaning that we have for these different fields, we start to get a better perspective on, oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.964,
    "end": 2045.687,
    "text": "So when somebody says that it's a science informed policy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.548,
    "end": 2048.228,
    "text": " They want me to think it's good, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.009,
    "end": 2054.63,
    "text": "They don't want me to think that it's faith-based policy because faith-based, then dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2054.97,
    "end": 2058.591,
    "text": "So it's always a cultural context that these terms are understood within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.931,
    "end": 2062.992,
    "text": "And it's sort of like a battlefield of meaning for who gets to control these different terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.352,
    "end": 2072.734,
    "text": "But anyways, I just really like that Mel led so clearly and strongly as a philosopher of science who's so embedded within our communities as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.414,
    "end": 2074.054,
    "text": "And it just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.848,
    "end": 2080.053,
    "text": " It rides the line with scientific understanding and philosophical depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.329,
    "end": 2104.858,
    "text": " speaking of philosophical depth and scientific understanding let's talk about epistemic virtues and yet another wiki um selection i believe it's our last one being an epistemically virtuous person is often equated with being a critical thinker and focuses on the human agent and the kind of practices that make it possible to arrive at the best accessible approximation of the truth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.498,
    "end": 2115.787,
    "text": " So I wasn't too familiar with this term epistemic virtues, but it's a little bit like saying, what are the good attributes or the adjectives that are good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.508,
    "end": 2118.069,
    "text": "You know, not the ones that aren't good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.409,
    "end": 2122.553,
    "text": "The ones that are good are the ones that are the epistemic virtues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.953,
    "end": 2124.735,
    "text": "And so a couple of them are written down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.075,
    "end": 2131.521,
    "text": "Conscientiousness, which is funny in light of our discussion on the big five personality traits in Act 13.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.842,
    "end": 2138.726,
    "text": " as well as a couple of these other ones that you see here, such as creativity, curiosity, humility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.348,
    "end": 2153.638,
    "text": "People can go into debates about what each of these terms mean or which ones are or aren't virtues, but the question I would leave us with, at least in this introduction section, is how do we facilitate epistemic virtue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.178,
    "end": 2163.962,
    "text": " given our own understanding, how do we not just develop it in ourselves, but make communities where epistemic virtue can thrive in an accessible fashion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.903,
    "end": 2168.124,
    "text": "All right, let's get to the abstract of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.352,
    "end": 2184.484,
    "text": " Mel wrote, the free energy principle or FEP has seen extensive philosophical engagement, both from a general philosophy of science perspective and from the perspective of philosophies of specific sciences, cognitive science, neuroscience, and biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.884,
    "end": 2186.605,
    "text": "So people are talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.626,
    "end": 2209.952,
    "text": " the literature on the fep has attempted to draw out specific philosophical commitments and entailments of the framework so what are the commitments that's leading up to this the ceremony right what's the commitment that you make leading up to the ceremony and then the entailment what follows from the ceremony so what leads one to be committed to fep and what is entailed by committing to the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.411,
    "end": 2217.119,
    "text": " But the most fundamental questions from the perspective of philosophy of science in general remain open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.519,
    "end": 2219.682,
    "text": "So this is a list of awesome questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.862,
    "end": 2225.87,
    "text": "So each one of these questions we could probably have a whole group conversation on and they're such wonderful questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.991,
    "end": 2228.394,
    "text": "So I really like how this paper was phrased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.375,
    "end": 2231.818,
    "text": " To what disciplines does the FEP belong?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.398,
    "end": 2234.04,
    "text": "Does it make falsifiable claims?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.761,
    "end": 2236.843,
    "text": "What sort of scientific object is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.443,
    "end": 2241.227,
    "text": "Is it to be taken as a representation of contingent states of affairs in nature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.165,
    "end": 2243.386,
    "text": " Does it constitute knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.986,
    "end": 2247.168,
    "text": "What role is it intended to play in relation to empirical research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.669,
    "end": 2251.291,
    "text": "And does the FEP even properly belong to the domain of science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.671,
    "end": 2254.914,
    "text": "But it seems like from the introduction that Mel's answer is yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.674,
    "end": 2262.119,
    "text": "I'm maybe going to put it in my five cents at the end of this talk, but it seems like it's good if it's in science, but I'm not too attached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.095,
    "end": 2263.475,
    "text": " Abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.295,
    "end": 2275.42,
    "text": "To the extent that it has engaged with these questions at all, the extant literature has begged, dodged, dismissed, and skirted around these questions without ever addressing them head on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.18,
    "end": 2279.761,
    "text": "Look at these spatial metaphors and social metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.841,
    "end": 2281.362,
    "text": "Begging, dodging, skirting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.242,
    "end": 2283.883,
    "text": " Head on, just wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.784,
    "end": 2292.848,
    "text": "These questions must, I urge, be answered satisfactorily before we can make any headway on the philosophical consequences of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.409,
    "end": 2301.793,
    "text": "So in other words, if we don't understand how we got here and where we're at, we won't be able to make headway as we move forward with the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.374,
    "end": 2307.717,
    "text": "So if we don't know the past and if we don't know the present, we're not going to be able to design effective policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.077,
    "end": 2309.498,
    "text": "Sounds like active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.658,
    "end": 2315.361,
    "text": " I take preliminary steps towards answering these questions in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.242,
    "end": 2333.095,
    "text": "First, by examining closely key formal elements of the framework and the implications they hold for its utility, and second, by highlighting potential modes of interpreting the FEP in light of an abundant philosophical literature on scientific modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.655,
    "end": 2340.34,
    "text": "So quite the prospectus for the paper, and let's see how we're gonna get from A to Z.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.161,
    "end": 2342.122,
    "text": " So here's the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.182,
    "end": 2355.471,
    "text": "And I had to even reformat the roadmap slide because there were so many subsections, but it really helped because it's a paper that doesn't have figures and appropriate enough for a paper called the math is not the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.771,
    "end": 2361.254,
    "text": "There isn't any math equations in the paper, but it references a lot of quite technical areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.715,
    "end": 2370.761,
    "text": "So it's kind of like this fractal overview because you could dive into the thermodynamics or dive into the Bayesian mechanics, but this is the overview and it's generalizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.702,
    "end": 2379.357,
    "text": " So it starts with an abstract, an introduction, and then begins with the sort of topic du jour, which is the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.373,
    "end": 2389.277,
    "text": " This being a philosophy and history of science paper, it's framing the free energy principle in terms of its history, and we're going to walk through the history in a couple of minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.197,
    "end": 2404.684,
    "text": "The history of the formalism of the free energy principle itself leads one to a consideration of Markov blankets, free energy, and generative models, which are things that specifically come into play when talking about the FEP as it's used and understood today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.922,
    "end": 2431.104,
    "text": " um reinterpreting the fep is sort of what we're here for today is to interpret and reinterpret i think and then the second or the last part of the paper ties many of the topics that were addressed in the first half of the paper on the left side of the roadmap to more general questions in the scientific modeling literature so for example the difference between normative and process models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.724,
    "end": 2442.671,
    "text": " the ideas that came out of mathematical psychology related to neuroscience and other fields, and then ideas about models that have targets or don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.991,
    "end": 2449.095,
    "text": "So a lot of different cool generative things that are happening with this paper, and it's a lot to cover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.155,
    "end": 2450.716,
    "text": "So let's just jump right in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.616,
    "end": 2467.269,
    "text": " so the only hint friston himself has given us to go on with respect to the meta theory or philosophy of science of the fep which is what we're here for today is that he labels it a normative theory or normative model contrasting that with what he terms process models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.157,
    "end": 2471.52,
    "text": " And then it continues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.98,
    "end": 2476.063,
    "text": "Three fundamental facts about the FEP follow from its status as a normative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.543,
    "end": 2481.187,
    "text": "So again, we have sort of two extremes types of things in the philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.527,
    "end": 2483.048,
    "text": "We have the hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.348,
    "end": 2484.129,
    "text": "Those are the theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.249,
    "end": 2485.71,
    "text": "They're empirically falsifiable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.85,
    "end": 2487.271,
    "text": "And then we have these principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.592,
    "end": 2491.915,
    "text": "They're the more normative, non-falsifiable, almost axiomatic aspects of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.884,
    "end": 2498.727,
    "text": " So three things are going to follow from the fact that the FEP is a normative model and not a hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.607,
    "end": 2505.891,
    "text": "One of them is that the FEP is not falsifiable and does not lend itself to the direct generation of predictions or hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.351,
    "end": 2507.651,
    "text": "So it's not a hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.752,
    "end": 2516.356,
    "text": "Two, the FEP does not cut at the joints of nature, which is to say that it does not illuminate the boundaries between natural kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.036,
    "end": 2520.598,
    "text": "And three, the FEP does not deliver mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.958,
    "end": 2522.259,
    "text": "So interesting claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.41,
    "end": 2530.539,
    "text": " The general questions that this brings me to wonder about is how do we categorize these kinds of scientific ideas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.059,
    "end": 2537.027,
    "text": "So for example, if someone says, well, that's a theory, gravity's a theory, evolution's a theory, that means dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.507,
    "end": 2541.412,
    "text": "So how do we classify what type of scientific thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.373,
    "end": 2560.995,
    "text": " ideas are whether it's a framework hypothesis uh idea more broadly just leaving it vague or whether it's a principle how do we map out the implications of different kinds of ideas and then very importantly how do our pre-existing assumptions influence how we judge ideas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.596,
    "end": 2563.777,
    "text": " So we're not the neutral arbiter of truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.277,
    "end": 2567.057,
    "text": "It's more like we have this culturally prepared field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.477,
    "end": 2572.459,
    "text": "And then the idea is like the stimulus or a seed that flowers or doesn't in a field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.919,
    "end": 2577.66,
    "text": "So how does the status of our field influence how we judge ideas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.42,
    "end": 2582.881,
    "text": "And as far as the cutting out the joints of nature, that's something that really fascinated me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.001,
    "end": 2585.522,
    "text": "And we're going to go into the joints of nature in a couple of minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.809,
    "end": 2589.991,
    "text": " So free energy principle part three in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.332,
    "end": 2593.574,
    "text": "And remember that these dot zero videos are kind of overviews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.854,
    "end": 2597.136,
    "text": "They're just the notes that I take as I go through reading the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.497,
    "end": 2605.602,
    "text": "I try to make that exoteric for those who might appreciate a scaffold, but really there's so many fun details and so many nice points inside of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.662,
    "end": 2609.285,
    "text": "So if you're curious or you want to learn more, the paper's the place to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.553,
    "end": 2613.856,
    "text": " Section 3.1, the history of the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.316,
    "end": 2615.237,
    "text": "So this is quite different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.318,
    "end": 2620.263,
    "text": "A scientist might not start by saying, well, the thing you need to know about this theory is here's the history of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.124,
    "end": 2627.892,
    "text": "They might say is the thing you need to know about this theory is this scientific attribute ABC, but this is a more historical perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.059,
    "end": 2634.224,
    "text": " The questions most frequently and fervently asked about the free energy principle are, is it true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.924,
    "end": 2635.825,
    "text": "What is it true of?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.506,
    "end": 2638.788,
    "text": "How do we empirically know that it is true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.448,
    "end": 2642.491,
    "text": "These questions, I argue, rest on a category mistake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.991,
    "end": 2644.613,
    "text": "So wrong kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.434,
    "end": 2647.776,
    "text": "You know, you ask how many miles per gallon does this thing get?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.956,
    "end": 2650.118,
    "text": "And someone's like, hey, this isn't a car, that's a pizza.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.462,
    "end": 2659.748,
    "text": " They presume that the FEP is the sort of thing that makes assertions about how things are, cuts at natural joints, and can be empirically verified or falsified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.209,
    "end": 2661.83,
    "text": "So it's the inverse of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.43,
    "end": 2670.817,
    "text": "It turns out that people are interpreting the FEP as if it's a falsifiable hypothesis that makes assertions about how things are and cuts at natural joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.337,
    "end": 2673.699,
    "text": "And it turns out that is not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.099,
    "end": 2676.301,
    "text": "In fact, all of those are the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.561,
    "end": 2676.821,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.202,
    "end": 2680.945,
    "text": "Because the FEP is more like a principle than it is a hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.505,
    "end": 2699.458,
    "text": " pretty cool so again what are these three points it's the idea that in a hypothesis does make assertions about how things are does cut unnatural joints and can be empirically verified or falsified and it turns out that mel argues the fep is not that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.559,
    "end": 2705.042,
    "text": " Let's talk a little bit about nature and its joints, specifically carving them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.943,
    "end": 2720.072,
    "text": "So just to quote from the abstract of a 1993 paper by Ali Khalidi, Carving Nature at the Joints, descriptive title, it's quite an interesting point, which is, this paper discusses a philosophical issue in taxonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.512,
    "end": 2725.856,
    "text": "At least one philosopher has suggested that the taxonomic principle that scientific kinds are disjoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.778,
    "end": 2736.12,
    "text": " So in other words, when we're doing taxonomy, classification, organizing of scientific kinds, are they disjoint or might they be overlapping?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.46,
    "end": 2748.642,
    "text": "For example, when we're doing a taxonomy of insects, there's some groups that are disjoint, like ants and cockroaches are a disjoint group, but ants and insects are non-disjoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.922,
    "end": 2752.103,
    "text": "Those are not disjoint groups because ants are nested with inside of insects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.613,
    "end": 2761.622,
    "text": " And an opposing position is defended here by marshalling examples of non-disjoint categories which belong to different coexisting classification schemes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.562,
    "end": 2769.35,
    "text": "This denial of the disjointedness principle can be recast as the claim that scientific classification is interest relative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.299,
    "end": 2774.482,
    "text": " but why would anyone have held that scientific categories are disjoint in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.223,
    "end": 2779.266,
    "text": "It is argued that this assumption is needed in one attempt to derive essentialism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.907,
    "end": 2784.21,
    "text": "This shows why the essentialist and interest relative approaches to classification are in conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.711,
    "end": 2787.433,
    "text": "So in other words, if we have an essentialist perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.933,
    "end": 2805.285,
    "text": " on scientific kinds then we can probably make them disjoint because if like you know the red cube is red and the green cube is green then we can separate them at the joint and the red will be red and the green will be green but if the red and the green are like ink molecules that are swirling around in solution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.945,
    "end": 2821.637,
    "text": " then it's more like it's relative to um it's interest relative we could say and in that case there's a non-disjointness between the redness and the greenness which makes it a little bit more difficult to be reductionist or essentialist and demands a relativist point of view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.228,
    "end": 2825.03,
    "text": " And that sounds a little complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.39,
    "end": 2826.471,
    "text": "It is a little interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.132,
    "end": 2830.835,
    "text": "And in 2011, there was a book called Carving Nature at Its Joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.215,
    "end": 2834.958,
    "text": "They just go with the same title because it's the same ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.739,
    "end": 2837.12,
    "text": "And in a review by P.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.16,
    "end": 2841.644,
    "text": "Magnus, I thought there was a couple of points that were just really crisply brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.425,
    "end": 2843.366,
    "text": "So P.D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.406,
    "end": 2849.851,
    "text": "Magnus wrote, to be fair, part of the problem with this book, I believe, is with natural kinds themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.552,
    "end": 2860.484,
    "text": " The phrase natural kind is too often used as a term of philosophical jargon with a presumption it has a precise meaning, even though there are a number of separate precise meanings it can have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.165,
    "end": 2865.63,
    "text": "First, natural kinds may refer to categories which will support inductive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.431,
    "end": 2880.943,
    "text": " second natural kinds may refer to whichever categories ought to appear in scientific accounts of the world third natural kinds may refer to metaphysically robust categories which are written in the fundament of being or which structure the space of possible worlds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.644,
    "end": 2886.346,
    "text": " Fourth, natural kinds may refer to categories which appear as predicates in the laws of nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.706,
    "end": 2891.088,
    "text": "Fifth, natural kind may refer to categories which anchor a special type of reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.848,
    "end": 2897.031,
    "text": "Although these five aspects do overlap somewhat, there are difficulties with each and tensions in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.631,
    "end": 2900.112,
    "text": "Essays in this volume document some of these difficulties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.612,
    "end": 2914.179,
    "text": " So when we're trying to understand this topic, this area, reduce our uncertainty, and we want to know about separating natural kinds, it's not quite so clear what these natural kinds are or what joints do or don't separate them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.459,
    "end": 2915.76,
    "text": "But that's what we want to pursue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.78,
    "end": 2917.061,
    "text": "And so that's why it's fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.141,
    "end": 2921.443,
    "text": " How could we go even deeper down this natural kind rabbit hole?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.623,
    "end": 2924.004,
    "text": "Well, we could go to the original text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.144,
    "end": 2924.905,
    "text": "It's what we're going to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.745,
    "end": 2928.887,
    "text": "This is from Plato's Phaedrus in 265.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.987,
    "end": 2929.707,
    "text": "So Socrates writes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.329,
    "end": 2941.471,
    "text": " We can think about dividing things by classes where the natural joints are and not trying to break any part after the manner of a bad carver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.991,
    "end": 2943.912,
    "text": "So that's this idea of carving at the joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.192,
    "end": 2949.153,
    "text": "If there are two things and you're not making a clean separation, then you're going to make this violent cut.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.433,
    "end": 2952.634,
    "text": "But if it's a perfect separation, then it's going to be a clean cut at the joint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.772,
    "end": 2958.437,
    "text": " As our two discourses just now assumed one common principle, unreason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.978,
    "end": 2963.623,
    "text": "So in other words, is it that reason is a principle and unreason is something disjoint?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.884,
    "end": 2968.569,
    "text": "Or are reason and unreason in a continuum, just like the red and the green from the previous example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.815,
    "end": 2971.955,
    "text": " So in other words, natural joint on the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.055,
    "end": 2977.057,
    "text": "Can we separate class A and class B perfectly, or are they gonna be a little bit more intercalated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.017,
    "end": 2990.339,
    "text": "Just as the body, which is one, is naturally divisible into two, right and left, with parts called by the same name, so are two discourses conceived of madness as naturally one principle within us and one discourse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.9,
    "end": 2997.321,
    "text": "Cutting off the left-hand part continued to divide this until it found among its parts a sort of left-handed love,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.901,
    "end": 2999.342,
    "text": " which it very justly reviled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.902,
    "end": 3006.266,
    "text": "But other discourse, leading us to the right-hand part of madness, found a love having the same name as the first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.786,
    "end": 3007.707,
    "text": "Quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.407,
    "end": 3013.01,
    "text": "But divine, which it held up to view and praised as the author of our greatest blessings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.47,
    "end": 3017.993,
    "text": "So are the left and the right two different natural kinds that we can just cut down the middle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.453,
    "end": 3020.735,
    "text": "Or are they a continuum on a type of thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.988,
    "end": 3023.409,
    "text": " Phaedrus says, very true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.069,
    "end": 3027.85,
    "text": "And then this last little quote from Socrates, even though I know we're quite far afield.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.571,
    "end": 3034.813,
    "text": "Now I myself, Phaedrus, am a lover of these processes of division and bringing together as aids to speech and thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.333,
    "end": 3040.896,
    "text": "So in other words, sometimes just separating things into natural kinds or continuums is useful for thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.96,
    "end": 3065.436,
    "text": " if i think any other man is able to see things that naturally can be collected into one and divided into many him i follow after and walk in his footsteps as if he were a god and i like this also because it's from tufts which is the institution of mel so i just loved grabbing the uh phaedrus text from mel's institution for this extremely interesting historical dive let's go back to the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.994,
    "end": 3089.358,
    "text": " order to understand the fep however and why it's closer to a statistical technique than it is to a falsifiable theory of biological self-organization it is important to see that there is a clear precedent for leveraging the maths of statistical mechanics as a method for bayesian inference so it's like whoa some people know about philosophy some about statistical mechanics other about bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.858,
    "end": 3114.827,
    "text": " we're going to bring them all together which means that we're all going to be learners here and that's why it's great to include everyone in the learning journey because no one is going to read a paragraph like this and just dust off their hands and go yeah i already finished learning about those topics i'm done learning about statistics or i'm done thinking about philosophy those who are awake and want to learn and want to find out other people's thoughts on these questions just come right ahead",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.44,
    "end": 3124.29,
    "text": " Section 3.1.1 is called the epistemic turn or the knowledge or the informational turn in statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.091,
    "end": 3129.236,
    "text": "So just a couple of key points because this history section really is quite critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.576,
    "end": 3135.183,
    "text": "So this is just in the order of these sections, a couple of memes or key themes that I pulled out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.064,
    "end": 3146.826,
    "text": " So what was happening in the 1900s in statistical physics and statistical mechanics is that information was getting physicalized and physics was getting informational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.286,
    "end": 3155.727,
    "text": "So all of a sudden, there was a little bit more of a recognition that physical things could be equated with information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.127,
    "end": 3165.329,
    "text": "For example, if you're talking about the surprise of reaching into an urn and pulling out different kinds of balls, that could be equated to the surprise that you might have of different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.629,
    "end": 3188.656,
    "text": " temperatured air molecules swirling around in a room so if all of the hot molecules went on one side it would be something that would be quite surprising just like if all the blue balls went to one side of the urn and all the green balls went to the other side of the urn so that would be something that you wouldn't expect and it's through analogies like that that people started to bring equivalency to the informational and the physical side of physics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.458,
    "end": 3196.8,
    "text": " The maximum entropy principle emerges as something like an Occam's razor for infothermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.2,
    "end": 3214.184,
    "text": "So again, if we're thinking about an urn with a different color balls or a room with a bunch of molecules of air, this maximum entropy theory is going to basically say, well, the air molecules are going to be maximally spread out and the distribution of their speeds is going to have such and such characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.944,
    "end": 3233.825,
    "text": " And it's almost like an Occam's razor principle because it's like saying, yes, it could be another way, but this way with the air molecules equally spread out, it turns out that's the most likely one because there's an increasing infinite number of ways that it could be an increasingly less likely ways of organizing around the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.045,
    "end": 3240.667,
    "text": " all in this corner, all in that corner, half in this corner, half in that corner, but the maximum entropy way is spread out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.267,
    "end": 3245.449,
    "text": "And there's more details in the paper, and of course, there's more to learn about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.55,
    "end": 3259.173,
    "text": "But the 3.1.1 is just to say that during the 1900s, maximum entropy and this info-physical nexus starts becoming a more important thread.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.193,
    "end": 3261.134,
    "text": "3.1.2, the mean field approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.894,
    "end": 3280.954,
    "text": " so the mean field we can think of is like as you get a field of vectors you can start to kind of blur your eyes and look at the mean field approximation and so one way to think about that is like the central limit theorem so if we have a distribution and we're just pulling out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.894,
    "end": 3290.62,
    "text": " with a Gaussian error out of this distribution, we're going to approximate a draw around the mean value of that distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.84,
    "end": 3294.322,
    "text": "So that's the central limit theorem, just from 30,000 feet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.302,
    "end": 3302.427,
    "text": "And the mean field approximation is kind of like the central limit theorem, because it's basically like saying in the mean limit,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.947,
    "end": 3309.072,
    "text": " there's gonna be this asymptotic approximation to collective behavior that might be comprehensible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.452,
    "end": 3316.537,
    "text": "So as we get to more and more and more cars, we can start to model them like they're a flow of a fluid, even though we know that they're discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.837,
    "end": 3321.0,
    "text": "And so you can't do a flow model with three cars, but maybe with 3 million cars you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.821,
    "end": 3326.304,
    "text": " And this is getting us to this point of idealized multi-agent systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.744,
    "end": 3339.111,
    "text": "So not just draws from a distribution, but potentially there could be multi-agent systems like lattices of electrons or chemical solutions that also have these mean field approximations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.067,
    "end": 3346.171,
    "text": " There's then this introduction of the variational methods and the variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.651,
    "end": 3349.573,
    "text": "It's brought up as a trick, but who's tricking who?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.294,
    "end": 3352.275,
    "text": "Are the mathematicians tricking everyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.836,
    "end": 3354.197,
    "text": "Are the scientists in on the trick?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.397,
    "end": 3356.358,
    "text": "Are the engineers also tricking everyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.719,
    "end": 3371.853,
    "text": " It's a joke, but the variational methods and the variational free energy are definitely a heuristic and an extremely useful tool that help us take something that might be intractable and then perform computation on it in a way that's good enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.312,
    "end": 3384.075,
    "text": " Free energy, which is a concept that, again, just like a lot of things in this paper, have a physical analog or a physical tether earlier in their history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.135,
    "end": 3389.457,
    "text": "Like temperature is related to the distribution of the air molecule speed in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.997,
    "end": 3390.818,
    "text": "But then temperature...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.718,
    "end": 3395.662,
    "text": " in a machine learning model is something like how fast it's trained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.782,
    "end": 3398.645,
    "text": "Like a high temperature model, it sort of never settles down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.705,
    "end": 3400.086,
    "text": "It's always just jumping around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.346,
    "end": 3409.995,
    "text": "Whereas a low temperature model is going to be trapped in a local region, but it might come to a higher sampling intervals in that local region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.056,
    "end": 3414.64,
    "text": " Mel in the live chat, mathematician, eyes go brr, so true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.56,
    "end": 3426.911,
    "text": "And the free energy in machine learning came in when machine learning researchers were asking themselves, how are we going to model multi-scale systems at the appropriate gain or bias?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.392,
    "end": 3430.575,
    "text": "So we don't want to have an outrageous false positive or false negative rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.135,
    "end": 3445.286,
    "text": " we also don't have the ability to go and do an atom level simulation even if we wanted to we couldn't do these atom level simulations so how are we going to coarse grain and make models that are useful but don't go into every single possible detail",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.292,
    "end": 3452.838,
    "text": " And one question or thought I had is, is this variational free energy physical for molecules?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.858,
    "end": 3463.928,
    "text": "So when we talk about Gibbs free energy and then about in a given reaction, a given chemical reaction, the free energy of that reaction, is that a physical reaction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.875,
    "end": 3467.257,
    "text": " thing or is it energetic or is it conceptual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.937,
    "end": 3472.12,
    "text": "And then when we're talking about the free energy of a neural network, is it physical or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.06,
    "end": 3479.565,
    "text": "But in this 3.1.3, we get a sort of grand connection between ensemble densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.665,
    "end": 3487.79,
    "text": "So the wood lice on the pavement, you know, the ants in the colony, that density of the ensemble is the Bayesian posterior density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.95,
    "end": 3491.873,
    "text": "So the updated prior is the posterior and the posterior is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.293,
    "end": 3502.908,
    "text": " the prior for the next time point but the updated prior is the posterior and that is going to be a mean field approximation and that's going to be governed by this expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.565,
    "end": 3510.107,
    "text": " In section 3.1.4, the variational Bayes or VB method is brought up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.628,
    "end": 3512.508,
    "text": "And here's where VB comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.209,
    "end": 3519.351,
    "text": "Analytical Bayesian methods are basically intractable and can be implausible to calculate exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.751,
    "end": 3531.216,
    "text": "For example, if you're doing Bayesian phylogenetics and you have a bunch of insect genomes and you're trying to infer the tree that is the most likely hypothesis about common ancestry amongst these insects,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.691,
    "end": 3536.236,
    "text": " To make an exact analytical Bayesian model for every base in the genome,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.827,
    "end": 3539.228,
    "text": " you're gonna be calculating a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.769,
    "end": 3548.556,
    "text": "However, we can empirically explore probabilistic graphical models in order to simplify that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.077,
    "end": 3553.08,
    "text": "And so graphical models are just relational models, nodes and edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.2,
    "end": 3555.222,
    "text": "That means a graph, that's graphical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.362,
    "end": 3556.503,
    "text": "So a network is a graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.683,
    "end": 3560.467,
    "text": "It doesn't always mean like X, Y axis, you know, quadratic line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.867,
    "end": 3562.448,
    "text": "Graphical just means relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.189,
    "end": 3581.1,
    "text": " we're talking about the relationships between observations and hidden causes or two hidden causes and those are probabilistic relationships whether it's probabilistic emission of an observation given a hidden state or a probabilistic relationship between two different hidden states they're both graphical models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.18,
    "end": 3609.596,
    "text": " and the idea is that we as investigators want to fit our model using monte carlo sampling and or metrics of distributional divergence so monte carlo sampling it comes from gambling because monte carlo is where a lot of gambling occurred i believe and the idea is if you want to ask a question like how likely am i to get a deck draw from this deck of cards that has such and such characteristic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.549,
    "end": 3613.972,
    "text": " There might be some that are really easy to calculate, like, okay, the chance of getting a 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.312,
    "end": 3617.595,
    "text": "Well, there's 4 out of 52 cards are a 2, so there's the probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3618.135,
    "end": 3623.079,
    "text": "But there might be another type of question you want to ask about that deck that's a little bit more nuanced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.42,
    "end": 3629.364,
    "text": "Like, what's the chance it's this card or that card, but not this one, and it's followed by this, and it has to do with this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.245,
    "end": 3642.25,
    "text": " What you can do is instead of even trying to specify out the formal or analytical probability, what you can do is just simulate thousands or millions of draws from a simulated deck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.69,
    "end": 3650.034,
    "text": "And then you can look and say, okay, 10 out of a million had this characteristic, ergo, that's my empirically derived probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.454,
    "end": 3654.936,
    "text": "So that's using Monte Carlo or Metropolis-Hastings coupled sampling to formulate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.856,
    "end": 3659.859,
    "text": " figure out the tractable way to do these Bayesian approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.519,
    "end": 3672.767,
    "text": "Another way that you can actually tractably deal with these Bayesian approaches is this variational Bayesian approach, which we're not gonna go into too many details here, but basically, unlike the sampling-based,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.547,
    "end": 3696.25,
    "text": " monte carlo bayesian methods the variational base uses the distributional divergence and it co-optimizes the accuracy minus the complexity just again first pass so that it tries to hone into the tightest distribution that actually covers the density of what you really want to estimate but doesn't get too tight it doesn't over fit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.318,
    "end": 3702.48,
    "text": " And then lastly, there's this section on the innovation in Friston's free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.7,
    "end": 3709.922,
    "text": "So if you're curious about what Carl has done and the Google Scholar is stretching on a little bit too long, that's a great section to check out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.582,
    "end": 3717.325,
    "text": "So let's pull together and just ask, where are we at with the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.985,
    "end": 3719.385,
    "text": "So what did Friston do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.706,
    "end": 3721.306,
    "text": "What is the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.786,
    "end": 3724.627,
    "text": "And how was it discussed in Mel's paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.607,
    "end": 3726.448,
    "text": "So the first...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.555,
    "end": 3728.576,
    "text": " is the Fokker-Planck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.397,
    "end": 3738.304,
    "text": "And Mel writes, in the context of the free energy principle, the Fokker-Planck equation describes the evolution of the probability density function of the state of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.744,
    "end": 3752.075,
    "text": "As such, it can be thought of as a trajectory through one abstract state space, which is a probabilistic representation of some lower order abstract state space representing what state a given system is in over some definite time window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.635,
    "end": 3761.479,
    "text": " So it's like it's a density evolution function that's a trajectory in an abstract probabilistic space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.319,
    "end": 3762.939,
    "text": "Very chill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3764.26,
    "end": 3768.261,
    "text": "To the Fokker plank, we can supplement the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.022,
    "end": 3774.124,
    "text": "So let's think about that definite time window from the Fokker plank and pick up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.956,
    "end": 3780.94,
    "text": " a three-dimensional vector field that satisfies the appropriate conditions for smoothness and decay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.02,
    "end": 3783.343,
    "text": "So smoothness means that it's not a rough path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.543,
    "end": 3793.872,
    "text": "In other words, you can take a ruler and just lay it on the hill and get a derivative, and you can kind of take that ruler and move it over the hill and get continuous derivatives everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.094,
    "end": 3807.439,
    "text": " If the appropriate conditions for smoothness and decay are met, then this vector field can be broken down into solenoidal, which is a curl, and irrotational, which is a divergence component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.44,
    "end": 3810.581,
    "text": "This is known as the Helmholtz decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.141,
    "end": 3816.786,
    "text": " The fact that we can perform the Helmholtz decomposition is then known as the fundamental theorem of vector calculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.326,
    "end": 3827.234,
    "text": "So in order to have fields of well-behaved vectors, you need to have this ability to kind of separate out and take the partial derivatives in a few different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.314,
    "end": 3828.335,
    "text": "That's the decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.155,
    "end": 3835.781,
    "text": "So we're going to be thinking about the time evolution of a trajectory in the abstract state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.981,
    "end": 3837.062,
    "text": "That's Fokker-Planck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.001,
    "end": 3840.883,
    "text": " What is that state space going to be decomposed into?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.103,
    "end": 3847.427,
    "text": "Well, it's going to be decomposed using the Helmholtz decomposition into a few different vectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.148,
    "end": 3850.289,
    "text": "Some of those vectors are going to be solenoidal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.589,
    "end": 3854.492,
    "text": "They're going to be like curling around the mountain at the exact same elevation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.552,
    "end": 3855.993,
    "text": "That's like an isocontour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.353,
    "end": 3863.018,
    "text": "And then there's also going to be a non-rotational divergent component, one which goes uphill and one which goes downhill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.658,
    "end": 3868.401,
    "text": " Now, we're going to be doing that on non-equilibrium steady state densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.082,
    "end": 3873.405,
    "text": "This is related to this idea of the Markov or post-Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.765,
    "end": 3875.226,
    "text": "I don't even know what to call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.127,
    "end": 3880.69,
    "text": "Mel and anyone else, let's clarify this when we're talking in our group discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.71,
    "end": 3884.533,
    "text": "A Friston blanket or a Yella blanket, what are we going to call them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.193,
    "end": 3892.118,
    "text": "But when it comes down to it, when we want to be maintaining this info-thermodynamic non-equilibrium steady states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.345,
    "end": 3901.482,
    "text": " it's required to have a relatively better, because you don't need to have the perfect one, you just need to have a relatively better model than other agents like you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.708,
    "end": 3905.89,
    "text": " You need to have a relatively better generative model of what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.33,
    "end": 3910.293,
    "text": "Of action, not necessarily just of accurate state estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.873,
    "end": 3914.676,
    "text": "So the bacteria isn't just doing estimate, oh boy, we're running out of sugar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.036,
    "end": 3916.998,
    "text": "I wonder if there's a sugar somewhere else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.518,
    "end": 3926.404,
    "text": "It's actually doing inference on its behavior, on policy, its actions, so that it can maintain that info thermodynamic barrier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.884,
    "end": 3929.666,
    "text": "Mel writes, Markov membrane, that's my contribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.246,
    "end": 3932.688,
    "text": "If only we could all make such a great contribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.95,
    "end": 3957.99,
    "text": " this need for a maintenance of an info thermo non-equilibrium of steady state and therefore a generative model of hidden causes the world entailing policy selection paths leads to this imperative to be self-evidencing or an information forger that takes this multi-scale cybernetic goal-seeking good regulator requisite diversity characteristics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.57,
    "end": 3967.036,
    "text": " So in other words, if you want to be staying alive, maintaining that asymmetry where you have more organization or more information, that's that info thermo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.496,
    "end": 3976.162,
    "text": "If you want to be maintaining that competitive strategic asymmetry, then you're going to be needing to have the ability to engage in effective policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.603,
    "end": 3982.187,
    "text": "Effective policy is only going to be happening if you have an effective generative model of the latent causes in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.887,
    "end": 3998.141,
    "text": " And that means that if you're gonna be a cybernetic agent that's able to have a generative model about the latent causes of the world and respond appropriately, you're going to be needing to be an information forger that has these good regulator and requisite diversity characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.821,
    "end": 4002.064,
    "text": "That is what's subsumed under the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.845,
    "end": 4023.319,
    "text": " now what are the corollaries so the corollary hypotheses or theories are those that are going to be making specific testable hypotheses or multiple and a couple of them that we've brought up today we didn't write the ones that according to the alias interview didn't fare so well like gibbs particle filtering or gibbs sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.119,
    "end": 4039.88,
    "text": " but we can write up here active inference predictive processing bayesian brain and what else so if you have any other ideas for what is a corollary to the free energy principle let's hear about it but that'd be fun and each of these three make specific predictions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.521,
    "end": 4046.804,
    "text": " about kinds of observable things you might observe or the implications of different kinds of perturbations into the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.525,
    "end": 4057.85,
    "text": "So these are a lot more axiomatic and background more foundational, whereas up to the top we see in the corollaries, these are more like theories that make specific testable hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.23,
    "end": 4067.635,
    "text": "For example, active inference could be falsified if somebody shows that external states are able to alter internal states without going through sensory states, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.193,
    "end": 4091.982,
    "text": " that's the free energy principle in this next section which is 4.1 we will turn to the implementational details of the fep which is where it will be demonstrated that the formalism does not latch onto any features of the real world systems of interest so we sort of built up how the fep draws in historical context from um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4092.742,
    "end": 4117.838,
    "text": " info and thermodynamics and then draws in the cybernetic thread to result in a panoply of these testable hypotheses so let's talk about section 4.1 but before we jump in just general questions and this is because it's easier for me to come up with questions than answers is what kinds of models do latch on to features of real world system of interest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.8,
    "end": 4144.289,
    "text": " and what is of interest what is of interest and how is it related to what is useful for basic and applied researcher or for the philosopher of science so for example if your friend says hey you might be interested in this well for the applied researcher or for the engineer maybe of interest would be this is useful hey you might want to learn about this software package it might be of interest to you because you might use it effectively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.109,
    "end": 4155.054,
    "text": " To a basic researcher, somebody who's working more in the theoretical or the abstract areas of interest might be like, you'll find some pattern in here that's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.094,
    "end": 4158.336,
    "text": "You might have some thought cascades that are exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.316,
    "end": 4161.458,
    "text": "And so it's a different interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.578,
    "end": 4164.659,
    "text": "And the philosopher of science, what is of interest for them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.879,
    "end": 4165.56,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.621,
    "end": 4170.464,
    "text": " Let's trace a little bit about this Markov blanket question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4171.184,
    "end": 4184.595,
    "text": "And the Markov blanket, we're going to return to it a lot more later on in the year when we are in April on this Emperor's New Markov Blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.915,
    "end": 4187.837,
    "text": "And in a few other cases, we're going to be talking about Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.598,
    "end": 4190.979,
    "text": "But again, we're always learning about these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.019,
    "end": 4194.122,
    "text": "So not too surprising we're going to come back to them multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.541,
    "end": 4216.294,
    "text": " this is what mel wrote i i love in the live chat people are coming up with all kinds of funny markov related terms markov train chains by marco just yes chains of metaphors metaphors for chains why not we come to the conclusion that within any non-trivial network any node ought to have a multitude of markov blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.874,
    "end": 4231.672,
    "text": " Friston's employment of the Markov blanket construct differs from Pearl's original 1988 construction in the subdivision of the blanket into sensory states, nodes whose influence is directed towards the blanket of nodes X, and active states, nodes influenced by X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.333,
    "end": 4239.377,
    "text": " Okay, so here's 1988's book by Judea Pearl, Probabilistic Reasoning in Intelligent Systems, Network of Plausible Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.958,
    "end": 4247.523,
    "text": "Now, this idea of Bayesian computation on graphical models or Bayes nets is discussed in this book and elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.243,
    "end": 4258.627,
    "text": " The Markov property, though there's a couple things that have Markov's name attached to it, and I wish there was often a clearer way than just invoking some person's name, but we'll just use it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.287,
    "end": 4266.71,
    "text": "The Markov property in probability theory and statistics refers to the memoryless property of a stochastic process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.511,
    "end": 4275.654,
    "text": "The term strong Markov property is similar to the Markov property, except that the meaning of present is defined in terms of a random variable known as the stopping time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.584,
    "end": 4284.827,
    "text": " And so the term Markov assumption is used to describe a model where the Markov property is assumed to hold such a hidden Markov systems, hidden Markov model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.487,
    "end": 4290.949,
    "text": "So for Markovian systems, we can think about a blanket that is insulating a node X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.829,
    "end": 4306.692,
    "text": " Now, as Mel pointed out, in Perl's original construction, it was in a graphical, general, abstract context, and the node X was insulated from the broader network by a blanket set of nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.492,
    "end": 4319.315,
    "text": "Fristen was going to do something a little different, which is the nodes that are incoming into the node of interest, so here mu is the internal state, that's like the X node from the Bayesian notation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.218,
    "end": 4345.208,
    "text": " the nodes that influence the node of interest are the sensory states that's like the incoming states but again it's it's whichever perspective is inside or outside so we're speaking from the point of view relationally of this internal state the sensory states are coming in and the action states are the ones that are downstream and so notice that the sensory states actually include",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.028,
    "end": 4374.902,
    "text": " states that don't directly impinge upon internal states of interest but actually relate just directly to active states and so that's this diagram we've seen as the the frist and markov blanket as a statistical boundary with the parents children and the parents of the children so it's kind of like your family for the person of interest includes this person who maybe they're not directly related because it could have it doesn't have to be every arrow on here but they're a parent of their child so it's important now again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.425,
    "end": 4385.616,
    "text": " would be awesome to have people who know better and have thought about it more to give their perspective but i just tried to make a little bit like a continuum of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.59,
    "end": 4410.925,
    "text": " markov blanket ideas so on the left side we have the actual markov our colleague from russia over here and maybe i'm kind of straw personing these arguments i'm just trying to throw them up there trying to understand where we're coming from and where we're going so markov stated it using mathematics pencil and paper and this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.966,
    "end": 4437.538,
    "text": " side of the spectrum is held down by the abstract the general and no need to appeal to computational bases pearl is somebody who had a computer not computers like we have today but good ones nonetheless i believe pearl's framework is based upon wanting to integrate empirical data in a way that mathematics isn't so that's one of the distinctions between statistics and mathematics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.022,
    "end": 4447.206,
    "text": " Because it's dealing with statistics and real data sets, potentially weaker assumptions might be in play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.767,
    "end": 4449.688,
    "text": "So this is sort of somewhere in the midpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.428,
    "end": 4453.81,
    "text": "And first is way on the other side of the Overton Markov window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.35,
    "end": 4460.914,
    "text": "And this is where we're getting the integration of ideas like the node consists of sense and action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.994,
    "end": 4462.455,
    "text": "It's not just insulating states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4462.535,
    "end": 4466.277,
    "text": "It's actually, there's this temporal nature where things that happen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.512,
    "end": 4488.319,
    "text": " before are like sense states coming in and things that happen afterwards are like actions heading out and that's like a bayesian directed graph that has a temporal component we also bring in these attributes like this cybernetic imperative to maintain the non-equilibrium steady state the idea of a generative model of non-local dependencies or latent causes in the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.219,
    "end": 4510.639,
    "text": " cybernetic model of the environment the good regulator or the requisite diversity ideas and also some of these other threads that might not be downstream of some qed proof from markov but nonetheless are important for understanding of markov blankets in the free energy principle like the inactive embodied and cultural embedded perspective so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.564,
    "end": 4518.19,
    "text": " Can the Markov blanket idea have interpretable parameters?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.551,
    "end": 4525.38,
    "text": "So do any kind of blanket capture what we think they're capturing or what should we think they're capturing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.201,
    "end": 4527.983,
    "text": "Is this implementation tractable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.484,
    "end": 4531.068,
    "text": "Will it be useful for different kinds of systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4532.378,
    "end": 4553.489,
    "text": " is there clear philosophical commitments or not and is narrative thermo cybernetics a metaphor or not just you know i'm curious about that um a few more quotes from the paper and thanks everybody who's watching and posting in the live chat it's pretty fun and a little hard to be responding to everything but it's fun times mel writes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.117,
    "end": 4558.62,
    "text": " This is how the Markov blanket construct is operationalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.0,
    "end": 4571.25,
    "text": "The upshot is that the power to select systematic boundaries rests at least in part on the researcher's intuition, which I would also say is true for regression coefficients, principal component analyses, t-SNE dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.41,
    "end": 4573.752,
    "text": "Okay, that's just what it's like being a scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.132,
    "end": 4579.156,
    "text": "We didn't sign up for this because we wanted objective, non-personalized recommendations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.236,
    "end": 4580.817,
    "text": "We wanted to be part of that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.838,
    "end": 4597.108,
    "text": " If the Markov blanket formalism were to independently track natural joints, we would need to equip it at least at the outset with some threshold value which would determine precisely the degree of conditional independencies that would count across the board for the possession of a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.628,
    "end": 4601.911,
    "text": " So that's like when you do principal component analysis on a real matrix of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.492,
    "end": 4607.495,
    "text": "Let's say principal component one explains 40% of the variance and then the next one's 30 and next one's 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.815,
    "end": 4612.939,
    "text": "And you get this long tail of hundreds and hundreds of principal components that explain less and less and less variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4613.68,
    "end": 4614.981,
    "text": "There's no clean line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.281,
    "end": 4620.705,
    "text": "You can't just say, well, if it's less than 1% of the variance, then it's not an important principal component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.145,
    "end": 4621.625,
    "text": "There isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.779,
    "end": 4630.329,
    "text": " measure or a value like that the threshold is always going to be in the details it's always going to be how it's enacted by the scientist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.974,
    "end": 4659.47,
    "text": " if such a threshold existed ask yourself if it could and were baked into the markov blanket formalism then we could consider markov blankets to be in some sense real features of real world systems so again like p values you can say i mean come on p value of zero point zero zero zero zero zero zero zero zero one come on let's just say that they're different but no you you can't do that because there's no natural kind with p values it's just a continuum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4660.331,
    "end": 4662.683,
    "text": " We might discover them, measure them, and count them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.312,
    "end": 4668.815,
    "text": " We might meaningfully ask whether some existing system does or does not possess a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.435,
    "end": 4675.159,
    "text": "So again, let's just say there's two tree species and one is 10 plus or minus one foot and the other one's three plus or minus one foot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.199,
    "end": 4676.3,
    "text": "There's no overlap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.62,
    "end": 4680.083,
    "text": "And you do the t-test and the p-value is just ridiculously low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.563,
    "end": 4684.485,
    "text": "And you say, come on, can't I just say it's a natural kind that they're naturally different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.946,
    "end": 4686.047,
    "text": "And so the answer is no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.887,
    "end": 4693.832,
    "text": "So this is a similar realization in the context of the empirical detection of Markov blankets potentially from empirical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.089,
    "end": 4703.031,
    "text": " If we can conceive of some thing as a discrete thing, as a coherent system, then it is possible to formally represent it as possessing a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.671,
    "end": 4709.352,
    "text": "There are no Markov blankets to be discovered in nature, and they are not in the business of illuminating natural joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.712,
    "end": 4714.354,
    "text": "So it's like there's no p-values in nature, there's no structural equations out there in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.874,
    "end": 4719.875,
    "text": "We're not discovering the structural equation model, we generate it in response to observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.535,
    "end": 4725.398,
    "text": " So that's why the FEP is not in the business of illuminating natural joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.139,
    "end": 4738.205,
    "text": "Finally, the thermodynamic entropy and the Shannon entropy are only equivalent under the generalized Boltzmann distribution, which it has been argued applies only at thermal equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.161,
    "end": 4743.364,
    "text": " Thus, in general, information entropy and physical entropy are distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.985,
    "end": 4747.327,
    "text": "Living systems are by definition far from equilibrium systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4747.928,
    "end": 4753.732,
    "text": "Thus, information entropy and thermodynamic entropy do not converge in the regimes of interest to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.173,
    "end": 4757.115,
    "text": "So just a couple general questions on this part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.496,
    "end": 4763.46,
    "text": " What are the formal axioms and the logic or ontology of the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.901,
    "end": 4773.609,
    "text": "This is what Mel has taken such an awesome effort and stab at with his paper is what are the commitments and entailments of FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.289,
    "end": 4776.331,
    "text": "What did we have to do to get here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.691,
    "end": 4779.694,
    "text": "Where are we and where are we going to go philosophically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4780.686,
    "end": 4785.228,
    "text": " which of the model assumptions of active inference or FEP are flexible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.808,
    "end": 4792.27,
    "text": "So where would we find that the model is still performant on datasets that might violate some expectation of the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.93,
    "end": 4799.653,
    "text": "So for example, a t-test might have the assumption that there's equal variances between the two groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.453,
    "end": 4802.274,
    "text": " You could do an in-equal variances t-test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.414,
    "end": 4811.159,
    "text": "It's a different kind of test, but for an equal variances t-test, it assumes that the variances are equal, but they don't have to be equal to the highest possible degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.559,
    "end": 4820.024,
    "text": "It turns out you can kind of fudge that one a little bit, or it might still give you directionally accurate findings, but with potentially a reduced or an inflated p-value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.364,
    "end": 4825.487,
    "text": "So in other words, what assumptions are we bringing to the table and what are the entailments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.007,
    "end": 4829.709,
    "text": "And then which one of these things bringing to the table are a little bit flexible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.064,
    "end": 4854.895,
    "text": " what are living systems doing and how do we think about living systems this is related to that life mind continuity it's related to schrodinger's question what is life from 1944 it's related to complexity theory it's related to so many discussions that we're having about agency autonomy individuality personality multi-scale systems there's so much happening here and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.615,
    "end": 4858.662,
    "text": " And what other questions do you have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.063,
    "end": 4864.895,
    "text": "Because the questions that all of the participants bring to the table are often the most exciting ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.051,
    "end": 4876.855,
    "text": " It might seem then that the FEP could perhaps be thrown at real-world systems and the degree of biological or cognitive complexity can be read off of features of the systems generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.716,
    "end": 4882.758,
    "text": "The FEP, however, does not dictate what we should write down for a given systems generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.258,
    "end": 4890.802,
    "text": "And once we have written down the generative model of the system under investigation, we have switched from the purview of the FEP to that of a process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.362,
    "end": 4892.983,
    "text": "So again, let's think about it with a t-test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.905,
    "end": 4900.652,
    "text": " The t-test by itself doesn't dictate which exact statistical test we should do for a given system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.252,
    "end": 4906.638,
    "text": "So the t-test framework doesn't say, yeah, this is what you measure about ant colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.118,
    "end": 4911.202,
    "text": "The t-test says, given what you give it, it's gonna give you a p-value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.103,
    "end": 4917.505,
    "text": " And so that's something that the FEP is analogously going to be providing us with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.905,
    "end": 4928.209,
    "text": "So as soon as we start asking about specific deployments of the FEP in situ, in an actual case, then we're talking about falsifiable process theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.709,
    "end": 4933.491,
    "text": "So it's almost like linear regression theory is in the background, that's abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.871,
    "end": 4938.413,
    "text": "And then you can ask in specific situations, whether you're using...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.813,
    "end": 4955.451,
    "text": " falsifiable model using a linear regression on a real data set but that's not at the level of talking about what linear regression is which might be an in principle discussion this i thought was an interesting part as well a single hydrogen atom at rest in a vacuum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.522,
    "end": 4961.325,
    "text": " is not meaningfully interpreted as performing approximate Bayesian inference over its environmental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.105,
    "end": 4972.911,
    "text": "A time series of mere abiotic self-organizing systems, say a whirlpool or a candle flame, would show it throwing off its Markov blanket and establishing a new one at every time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.226,
    "end": 4978.527,
    "text": " Critically, this does not entail the FEP cannot in principle apply to such systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.047,
    "end": 4982.288,
    "text": "It means only that we have no reason to apply it to such systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.728,
    "end": 4986.088,
    "text": "We have nothing to gain epistemically from applying it to such systems.\"",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.469,
    "end": 4991.65,
    "text": "So that will be quite interesting to hear Mel's perspective on and everyone else as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.07,
    "end": 5002.672,
    "text": "What is different about systems that seem to just kind of dissipate and don't have this autopoiesis characteristic, like a candle burning or a landslide or a lightning strike,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.052,
    "end": 5008.675,
    "text": " They're energy dissipating events, but they're a little different than living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5009.255,
    "end": 5017.74,
    "text": "And so it makes me think of Lavoisier working with oxygen and thinking about how, wow, humans are taking in oxygen and breathing out CO2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.14,
    "end": 5025.424,
    "text": "Candles are taking in oxygen, so to speak, releasing heat, breathing out CO2, kind of the reverse plant reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.844,
    "end": 5027.205,
    "text": "So are they similar?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.345,
    "end": 5027.945,
    "text": "Are they different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.025,
    "end": 5029.086,
    "text": "What's happening there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5031.031,
    "end": 5056.477,
    "text": " a couple more quotes this is really fun though we found that the framework accommodated certain things very well this is mel in review at the latter part of the paper the markov blanket does a very nice job of representing systemic boundaries the temporal depth of the trajectories being solved by the latent generative models postulated under the fep is a very elegant and informative representation of something like cognitive complexity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.057,
    "end": 5067.146,
    "text": " and the free energy parameter itself maps onto a system's attunement with its environmental context, its cohesion, and internal consistency, among other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.867,
    "end": 5078.177,
    "text": "We also found, however, that the FEP does not pick out or discover these aspects of natural systems, even in silico, but only provides a useful model of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.757,
    "end": 5088.94,
    "text": " So this is really awesome because it just is such a positive example of the yes and mindset that we want to be fostering with Active Inference and FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.38,
    "end": 5098.223,
    "text": "We're drawing from all these different areas, areas where we know we're gonna be learning for our whole life about information theory and cognitive complexity and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5098.623,
    "end": 5106.806,
    "text": "We're drawing hopefully together different ideas, leaving the door open for those who can contribute in ways that we don't even know or expect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.406,
    "end": 5109.909,
    "text": " building together, and then also just clarifying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.969,
    "end": 5111.992,
    "text": "The FEP is not doing everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.092,
    "end": 5117.498,
    "text": "It's not picking out or discovering aspects of natural systems, even in a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.039,
    "end": 5122.024,
    "text": "However, it may yet be something quite useful for us to deploy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.062,
    "end": 5128.386,
    "text": " And this is just a few more points from the modeling section on this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.626,
    "end": 5130.709,
    "text": "Yep, it's just, it's a Saturday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.829,
    "end": 5131.709,
    "text": "It's a fun paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.15,
    "end": 5133.471,
    "text": "We're looking forward to 14.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.492,
    "end": 5137.375,
    "text": "And so Mel writes, this comes in two forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.775,
    "end": 5146.043,
    "text": "First, the literature on scientific modeling has increasingly come to acknowledge the status of non-representational and non-target directed models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.784,
    "end": 5161.478,
    "text": " And second, even under the presumption that all models represent target systems, the utility of a model is generally understood to stem from idealizing, blackboxing, or coarse-graining away from inessential or distracting details of a target system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.299,
    "end": 5169.004,
    "text": " In other words, deliberate misrepresentations or omissions make a good model, not fidelity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5169.404,
    "end": 5170.805,
    "text": "So very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.366,
    "end": 5176.429,
    "text": "It's a semantic compression and this question of lossy or leaky compression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.27,
    "end": 5187.938,
    "text": "And in the context of scientific modeling, it's related to whether we're talking about representational models or non or target-directed or non-target-directed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.962,
    "end": 5197.79,
    "text": " So first point here, how are models, scientific models or other kinds of models, that's the demarcation problem, related to semantic compression?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.471,
    "end": 5201.894,
    "text": "How can we think about semantic compression as encryption?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.734,
    "end": 5204.956,
    "text": "And it could be encryption that's reversible or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.777,
    "end": 5208.12,
    "text": " How is semantic compression related to narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.541,
    "end": 5211.264,
    "text": "How are narratives semantic compression events?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.865,
    "end": 5219.916,
    "text": "How are narratives, the stories that we tell, able to compress vast swaths of syntax or even other semantics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.037,
    "end": 5222.379,
    "text": "How is coarse graining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.357,
    "end": 5239.538,
    "text": " or removing the inessential or distracting details of a target system, discarding irrelevancies as Bucky would say, how is this coarse graining related to the causal entropy of a system or maybe even its slow synergetic modes of operation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.485,
    "end": 5246.77,
    "text": " Good models live on this complexity accuracy trade-off in the philosophy of science space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.391,
    "end": 5249.913,
    "text": "So you want your model to be something more than nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5250.174,
    "end": 5256.04,
    "text": "If it's not reducing people's uncertainty at all, if it's not helping them get more accurate about something, it's nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.86,
    "end": 5261.805,
    "text": "But then there are model complexities that can outweigh how accurate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.991,
    "end": 5265.534,
    "text": " or how much it assists an agent's accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.974,
    "end": 5274.462,
    "text": "So if you have to carry around 100 things in your head and then it only helps you a little bit, maybe you could have had another thing in your head that would have reduced your uncertainty in a better way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5275.082,
    "end": 5278.686,
    "text": "So it's just so cool that we see this complexity accuracy trade-off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.366,
    "end": 5294.035,
    "text": " manifested in the actual formalisms of the fap but at the same time qualitatively it's long been understood in the philosophy of science that models have to ride this edge between being too complex and being accurate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.287,
    "end": 5299.951,
    "text": " can we separate these boxes at the joints for use and truth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.111,
    "end": 5312.621,
    "text": "And so I forget which discussion it was on or who said it, but it was maybe in eight with Blue or with Alec, how when we want transparent machine learning models, this idea we're gonna look inside the black box",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.402,
    "end": 5317.864,
    "text": " potentially might be a little bit misleading because you're going to look inside and there's going to be millions of parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5318.444,
    "end": 5324.727,
    "text": "So just looking inside of the box may not get semantically somebody to where they want to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.248,
    "end": 5331.911,
    "text": "However, could we cut up that box into specific structures of smaller boxes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5332.631,
    "end": 5343.864,
    "text": " And then we can look at how variables or information is passed between different boxes to be able to have a sense of what is almost like accountability or transparency in machine learning models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.364,
    "end": 5350.471,
    "text": "So just to give one example there, let's just say somebody has a data set with movement data and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.252,
    "end": 5356.554,
    "text": " pictures of people and there's a neural network that's predicting whether they're going to be committing a crime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5357.014,
    "end": 5360.716,
    "text": "And somebody says, hey, I think this is being used in a non equitable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5360.836,
    "end": 5362.637,
    "text": "I want to have increased transparency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.037,
    "end": 5364.778,
    "text": "I want to be able to see inside of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.038,
    "end": 5366.538,
    "text": "And someone goes, sure, here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.598,
    "end": 5367.839,
    "text": "Look at all the parameters yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.299,
    "end": 5369.7,
    "text": "But again, they're not interpretable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.98,
    "end": 5372.221,
    "text": "They're parameters inside of some neural network model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.921,
    "end": 5394.81,
    "text": " so would there be a way where we could separate the model into these specifically related boxes that are doing message passing passing information back and forth in a way where we can see oh yeah you know you told me that socioeconomic factors don't play into this part of the model and now i can actually look at that and see yes these variables are getting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.29,
    "end": 5414.567,
    "text": " concluded into a summary variable and that's getting combined with socioeconomic status in this way so it's not playing a role at this stage of the model it could be confounded because it's confounded in the real world but by breaking up the black box into smaller boxes that are a little bit more graspable a little bit more comprehensible we actually get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.248,
    "end": 5420.03,
    "text": " a level of understanding that isn't just peering inside of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.11,
    "end": 5422.931,
    "text": "Because again, do we really understand a linear regression?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.971,
    "end": 5424.252,
    "text": "Do we really understand addition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5424.732,
    "end": 5426.513,
    "text": "I mean, you can really go down the rabbit hole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.593,
    "end": 5428.414,
    "text": "Do we understand a sine or a cosine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5430.255,
    "end": 5431.975,
    "text": "Lots of fun stuff happening today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.155,
    "end": 5433.636,
    "text": "All right, we got a couple more slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.657,
    "end": 5437.578,
    "text": "Another quote from Mel in the latter half of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5438.783,
    "end": 5445.968,
    "text": " The organization and dynamics of the living organism, the functional architecture of the brain, and the structure of human social systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.469,
    "end": 5450.512,
    "text": "These are the most complex systems known to exist and they're nested inside of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5451.492,
    "end": 5462.24,
    "text": "The systems that study these systems, oh sorry, the sciences that study these systems are comparatively very young and may never reach the maturity of the sciences oriented towards far more simple systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.041,
    "end": 5470.795,
    "text": " The life, cognitive, neuro, and formal social sciences are still in many respects at the stage of trying to get a methodological foot in the door.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.9,
    "end": 5480.929,
    "text": " Highly idealized models such as normative or optimality models assist us in getting traction on otherwise intractable phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.469,
    "end": 5496.424,
    "text": "So we saw that a little bit with the scripts paper and the variational approach to scripts because that was a social science that was methodologically getting its foot in the door by borrowing from the legacy of the kinds of approaches we're discussing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5498.089,
    "end": 5504.334,
    "text": " Luce, 1995, introduces four distinctions to the mathematical modeling of cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.574,
    "end": 5510.558,
    "text": "So this is about the cognitive psychology, mathematical psychology, science modeling literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5511.519,
    "end": 5514.301,
    "text": "Process models are contrasted to phenomenological models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.416,
    "end": 5542.837,
    "text": " normative models differentiated from descriptive models dynamic models compared to static models and a distinction is drawn between noise and structure so that's another breakdown of models of kinds of scientific ideas not friston's breakdown but luce's breakdown and that also helps us understand a few more spectrums that exist in the space of the possible models another quote from the modeling section",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5543.866,
    "end": 5562.661,
    "text": " Under a normative model, which is again the kind that we are suspecting FEP is, it is presumed that reasoning should accord with formal logic induction and beliefs with Iggy Bayesian dictates for inference and credence belief or decision making with the results of optimizing a utility function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.422,
    "end": 5577.047,
    "text": " A descriptive model, or phenomenological model in contrast, represents the cognitive process of making choices, reasoning through subproblems, and drawing inference as it is observed to happen, messy, suboptimal, and irrational though it may be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.068,
    "end": 5582.77,
    "text": "What, then, is the significance of taking the FEP to be a normative model in Luce's sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5583.786,
    "end": 5588.59,
    "text": " Friston and colleagues stressed that the FEP as a process theory is not falsifiable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5589.191,
    "end": 5591.413,
    "text": "I'm not sure if this is intended.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.254,
    "end": 5605.766,
    "text": "It will not be possible to articulate a version of the FEP that can be held up against some real-world process in such a way as to undermine or legitimate the model because the FEP is the principle that specific process theories are drawn from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5606.627,
    "end": 5610.393,
    "text": " the FEP will not directly generate predictions, tests, or hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.813,
    "end": 5617.323,
    "text": "Well, I would wonder, what if it brings the group together and then they come up with predictions, tests, and hypotheses?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.423,
    "end": 5620.668,
    "text": "Could you say that the idea was the difference-making cause?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5621.429,
    "end": 5621.89,
    "text": "Just a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.297,
    "end": 5630.579,
    "text": " Another idea on this is the normativity here is presumed to be a logical normativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5631.019,
    "end": 5635.161,
    "text": "In other words, that the reasoning should accord with formal logic, induction, and belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.841,
    "end": 5637.782,
    "text": "But what if the normativity were cybernetic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.242,
    "end": 5642.983,
    "text": "For example, what if the normative claim were not that A can't equal not A?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5643.323,
    "end": 5647.465,
    "text": "So that's sort of one of the claims of, let's just say, normal Boolean logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.945,
    "end": 5650.866,
    "text": "But one of the claims is, the normative claim is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5652.086,
    "end": 5677.001,
    "text": " uh might is right for example so this describes cybernetic systems which might not be following formal logic or piano's axioms or any other inductive strategy that's consistent with truth they might be following normatively a power-centric approach now if that diverges too strong from what's actually there they're not going to exist in the niche but still that doesn't mean that the normativity has to be derivative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5677.381,
    "end": 5700.098,
    "text": " from this reality it means that it could be a normativity that arises from natural selection and also Marco thanks for that comment wrote I want to flag this part in my opinion FEP is a unique normative principle that doesn't prematurely assume sound reasoning so that will be great to unpack your understanding there and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.704,
    "end": 5702.564,
    "text": " Just a few more quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5703.265,
    "end": 5717.051,
    "text": "In the section that follows, the philosophical literature on adjacent sorts of models will be reviewed in the hopes that this will lend a sense of how it is that a highly abstracted, unfalsifiable formal model such as the FEP can have scientific utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.811,
    "end": 5723.797,
    "text": " Ultimately, of course, whether the FEP turns out to be useful in this way will be an empirical matter in both senses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.257,
    "end": 5725.418,
    "text": "Great puns here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5725.638,
    "end": 5731.624,
    "text": "It's like, if it's really true that the FEP is useful, then we'll find out because it will be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5732.365,
    "end": 5739.451,
    "text": "And how could it be that a highly abstracted, non-falsifiable formal model could be useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5739.891,
    "end": 5741.013,
    "text": "That's what we're finding out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5741.053,
    "end": 5742.094,
    "text": "We're learning by doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.294,
    "end": 5743.435,
    "text": "That's what we're enacting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.755,
    "end": 5756.444,
    "text": " The FEP is thus an umbrella framework out of which predictive processing, predictive coding, and a version of active inference, its process models, fall with decreasing abstraction and increasing granularity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5756.844,
    "end": 5757.665,
    "text": "Awesome sentence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.346,
    "end": 5766.152,
    "text": "As a normative model, the FEP is intended to aid in the generation of process models and to furnish constraints on viable process models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.812,
    "end": 5770.955,
    "text": " The FEP itself is, however, not beholden to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5771.375,
    "end": 5774.738,
    "text": "Its virtues are not in its very similitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5776.099,
    "end": 5777.14,
    "text": "Very similitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5777.16,
    "end": 5780.562,
    "text": "It reminds me of the Silmarillion, but maybe there's a better way to say that word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5780.642,
    "end": 5781.723,
    "text": "It means truthfulness, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5782.204,
    "end": 5783.545,
    "text": "So this is just really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.825,
    "end": 5791.791,
    "text": "It's kind of like by allowing reward learning to evolve into active inference, we saw how preference becomes baked into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5792.031,
    "end": 5795.554,
    "text": " So we don't separate from our values and preferences by focusing on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5795.975,
    "end": 5800.739,
    "text": "Actually focusing on policy is what allows us to be clear and define our values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.219,
    "end": 5807.685,
    "text": "And so similarly, by going to this highly abstracted, unfalsifiable formal models, such as the FEP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.706,
    "end": 5832.694,
    "text": " we're able to clarify where scientific utility is going to enter the picture where in specific situations task specific modeling or setting specific modeling and it's going to be developing falsifiable hypotheses but the fep itself there's no data set that comes along and knocks out the fep so it's kind of at the level of evolution rather than at the level of these process theories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.757,
    "end": 5854.195,
    "text": " right just the last couple few i feel like i said that a few times this is the field site where i did my aunt researching grad school in arizona but i like this because uh we'll see in a in a little bit weisberg has likewise laid out a useful taxonomy for scientific models he differentiates concrete mathematical and computational models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5854.775,
    "end": 5862.44,
    "text": " Cutting across this tripartite distinction is a division between what he calls target-directed modeling and modeling without a specific target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5863.16,
    "end": 5871.186,
    "text": "In this latter category of targetless modeling, we find generalized modeling, minimal modeling, hypothetical modeling, and targetless modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5872.006,
    "end": 5879.055,
    "text": " A target-directed model is one built for the purpose of predicting, controlling, and explaining the behavior of a specific system under specific conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.676,
    "end": 5887.106,
    "text": "For example, we might have data pertaining to the foraging behavior of a particular species of ant across...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5888.377,
    "end": 5912.229,
    "text": " number of colonies observed in the amazon rainforest and we might construct a model for the purpose of discovering something about the ethology and ecology of this particular ant species then again we might want to think about foraging behavior much more broadly and abstractly divorced from the minutia of particular minute particulars william blake populations of particular species in particular ecological settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5913.464,
    "end": 5927.016,
    "text": " Considering the problems posed by foraging in Apache habitat as faced by organisms in abstract terms, we might perceive a resonance between foraging and economic models that deal with optimizing decisions in scenarios in which we face diminishing returns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5927.617,
    "end": 5932.401,
    "text": "We might come up with a heavily idealized organism and context generic model of foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5932.861,
    "end": 5937.706,
    "text": "The latter approach is what Weisberg dubs modeling a generalized target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5938.226,
    "end": 5951.815,
    "text": " So at this field site for over 30 years, my PhD advisor, Professor Deborah Gordon, was observing exactly the specifics here, the minute particulars, the very specific behavior of ant colonies at this field site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5952.215,
    "end": 5954.877,
    "text": "Now there was other ants, other species at the field site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.217,
    "end": 5962.963,
    "text": "There was the same species in the next valley over, but we were really specific about this specific field site, these exact colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.023,
    "end": 5964.804,
    "text": "We'd have stones next to the colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.904,
    "end": 5966.045,
    "text": "Oh, here's colony 610.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.286,
    "end": 5986.369,
    "text": " that's specific at the same time it was through observing the specifics that one is able to abstract and generalize for example professor gordon's papers in 2014 on the ecology of collective behavior which draws links between the algorithms from computer science and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.849,
    "end": 6013.042,
    "text": " behavior across ants as well as swarm behavior in other systems so it's like by going into the specifics we can go into the abstraction and we can make it even more clear it's kind of like an electrical charge separation that we're polarizing it because it's clarifying and distilling the hypothesis and the specific ants on the ground as it were from these more general ideas about ants foraging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.082,
    "end": 6028.385,
    "text": " the live chat goes wild with the foraging behavior in ants models of this sort can also serve as an abstract or analogical touchstone or entry point into an unexplored domain so this is really exciting models as exploration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6029.306,
    "end": 6035.83,
    "text": " This will serve as the basis for more targeted, more fine-grained modeling work or empirical investigation later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.63,
    "end": 6050.799,
    "text": "Models in this genre also aid in the process of theory construction by allowing exploration of the nature and interrelation of conceptual objects and by inspiring theorists to draw connections and ask questions that would otherwise have gone undrawn or unasked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.579,
    "end": 6054.843,
    "text": " Such models offer leverage where other scientific methods stop short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.363,
    "end": 6059.688,
    "text": "Systems and dynamics far too complex or too new to be treated under standard approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6060.208,
    "end": 6070.799,
    "text": "So with the ant example, you're out there in the field, you're watching the ants forage, and you start to abstract and generalize and think about optimal foraging or think about general foraging processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6071.42,
    "end": 6090.034,
    "text": " but now we're stepping out even a level beyond the idealized process in nature are these abstract entry points into unexplored domains for example the game of life which is a cellular automata game it was like put out there as a toy as a game",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.774,
    "end": 6105.914,
    "text": " yes everyone is losing their mind in the chat Mel I hope that you can recover by the time we have this chat next Tuesday the game of life was just like saying hey what would happen if we had a grid with a certain rule set and that ended up going so much",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.409,
    "end": 6114.674,
    "text": " in detail, people making gliders and touring complete games of life and Steven Wolfram and all the research downstream of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6114.894,
    "end": 6118.156,
    "text": "So these models, it's just really nicely placed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6118.496,
    "end": 6121.078,
    "text": "You have the targeted versus the target list models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6121.698,
    "end": 6131.445,
    "text": "So the target models, ants on the ground in Arizona, we're doing linear aggressions, specific falsifiable predictions and hypotheses about this ant species on the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6132.045,
    "end": 6135.566,
    "text": " We're using that to abstract more general questions about foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.646,
    "end": 6145.869,
    "text": "Like, hey, I wonder if there's a patchy resource, then the ant species will probably try to recruit its nest mates to take advantage of a patchy resource that might not be around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6146.129,
    "end": 6151.35,
    "text": "But if it's a distributed resource that's not patchy, then maybe the ants will forage without pheromone trails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.85,
    "end": 6157.932,
    "text": "We're going a level even above that to this idea of like generators for ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6159.632,
    "end": 6161.353,
    "text": "Last quote from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6162.793,
    "end": 6169.656,
    "text": " Figuring out what the FEP is and what use it holds for scientists is a worthwhile project in and of itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6171.141,
    "end": 6185.589,
    "text": " How we come down on the matter, and what route we take in getting there, and who we include, and how we communicate about it, all these things and more, will have important implications for the philosophy of biology, philosophy of cognitive science, and the philosophy of science in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6186.169,
    "end": 6199.036,
    "text": "The dialogue unfolding in the literature on FEP raises important questions about the relationship between science and philosophy of science, between theory, model, and data, and about the scientific method and the aims of science, even",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.656,
    "end": 6203.459,
    "text": " perhaps most especially about what counts as science in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6203.94,
    "end": 6213.989,
    "text": "Taking us back to that first sentence in the introduction that with respect to the demarcation problem, Mel is gonna defend the claim that the FEP is scientific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.469,
    "end": 6223.057,
    "text": "And just by reading this paper and thinking through some of these topics, I feel like I learned a lot about science and about scientific modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.637,
    "end": 6225.118,
    "text": "So closing notes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6225.859,
    "end": 6231.081,
    "text": " This is a project in progress that will include many backgrounds and perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.802,
    "end": 6237.404,
    "text": "So let's have a participatory and an accessible conversation about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6237.924,
    "end": 6253.391,
    "text": "Sounds like it'd be a ton of fun because FEP and active inference is bringing us all to fundamental conversations from the philosophy of science, within philosophy of science, but also about how science is related to the philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6254.471,
    "end": 6281.464,
    "text": " it's also bringing up debates that are related to other fields of philosophy inactivism consciousness computationalism semiotics autopoiesis communication meaning evolution time space all of these fun general topics are being brought up through the work that hopefully we're all participating in so this was an awesome paper and i'm really looking forward to the next two weeks of discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.486,
    "end": 6311.676,
    "text": " can just throw up our general questions what would we enable for ourself or for our teams if we had a good understanding if we understood what the fep was if we understood that the as marco just put in chat the math is not the territory but the philosophy is the landmark if we come to understand that what will we enable what are the unique predictions and implications of different understandings that we could have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6312.771,
    "end": 6337.337,
    "text": " what are the next steps for free energy principle and active inference as research communities what are the goals of this research what is the goal of a philosopher of science who might be curious about this topic and perhaps most importantly what are you still curious about if you're listening to this video because this is a super fun topic it's so um excellent to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.717,
    "end": 6359.806,
    "text": " appreciative co-authors mel thanks so much dan this was fantastic well the paper was fantastic and really a learning catalyst for i know multiple of us so we're just starting off the two week uh period of this paper so everyone thanks for participating we're gonna provide follow-up forms for the live participant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6360.626,
    "end": 6376.223,
    "text": " we request feedback suggestions and questions as always and everyone just uh stay in touch it's been a nice stream and a nice conversation we're going to be having let's just get that calendar up again january 19th and 26th 2021",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6380.049,
    "end": 6408.078,
    "text": " going to be talking about this paper at 7 to 9 a.m pacific mel is going to be joining us for the stream and so check out this rb.gy kvn pyc link and uh yeah this is going to be an awesome discussion so any background any familiarity you have with the topics you're more than welcome to join our group discussions and i hope to see you all soon so have a good day and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6409.901,
    "end": 6410.144,
    "text": " Peace.",
    "speaker": "SPEAKER_00"
  }
]