[
  {
    "start": 28.675,
    "end": 29.056,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.676,
    "end": 30.658,
    "text": "Hello, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.699,
    "end": 36.906,
    "text": "This is the Act-Inf Lab Quarterly Roundtable number 20, number two in 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.426,
    "end": 37.727,
    "text": "It's June 29th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.807,
    "end": 39.649,
    "text": "So welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.609,
    "end": 51.834,
    "text": " We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.335,
    "end": 54.376,
    "text": "You can find us at the links on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.417,
    "end": 61.182,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.163,
    "end": 67.688,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.219,
    "end": 88.871,
    "text": " Today it's a quarterly roundtable lab meeting so we're going to have a lot of updates to share on some of the activities of the second quarter of 2022 and also share a lot of next steps at the project and at the organizational scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.151,
    "end": 93.794,
    "text": "So let's begin with an introduction slash warm-up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.5,
    "end": 111.288,
    "text": " we can say hello and maybe as if it were a paper, we were discussing what was just one memory or something that you learned this quarter or some participation that you just want to call out and highlight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.828,
    "end": 113.829,
    "text": "So I'll go first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.049,
    "end": 114.549,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.649,
    "end": 120.192,
    "text": "I'm a researcher in California and have a lot to add, but just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.468,
    "end": 126.93,
    "text": " saw so much amazing participation and development this quarter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.251,
    "end": 137.934,
    "text": "Like without having compiled these slides with everybody, so much would have just it all happened so fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.095,
    "end": 144.197,
    "text": "And so looking forward to catching up on this and also building structures so that we can even",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.004,
    "end": 150.05,
    "text": " have more clarity internally and externally about what we're working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.471,
    "end": 156.159,
    "text": "Like there's just quite a contrast with hopefully this lab meeting and even our previous five or six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.92,
    "end": 158.142,
    "text": "And I'll pass it to Bloop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.809,
    "end": 163.39,
    "text": " Yeah, this quarter was awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.451,
    "end": 167.975,
    "text": "I think the launch of the textbook group has been like pretty mind blowing for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.755,
    "end": 171.818,
    "text": "That's like a new thing that we've done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.938,
    "end": 178.804,
    "text": "And yeah, I am enjoying it and looking forward to future cohorts and part two of the textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.245,
    "end": 186.351,
    "text": "But that to me was kind of like a pivotal moment in this last three months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.372,
    "end": 188.213,
    "text": "And I'll pass to Jakob.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.713,
    "end": 193.235,
    "text": " Hi, I'm a student in the UK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.676,
    "end": 202.183,
    "text": "And the textbook group was also the highlight from this quarter for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.663,
    "end": 218.336,
    "text": "And I, one thing that I learned probably would have to be that multi agent active inference is a lot more interesting and harder than initially meets the eye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 219.64,
    "end": 221.381,
    "text": " and I'll pass it to Alex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.284,
    "end": 225.865,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 227.205,
    "end": 236.692,
    "text": "I'm Alex and I can agree that education as a service from the lab is the most important thing for this quarter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 237.313,
    "end": 248.721,
    "text": "So for study group as well as for our formats what we are planning and now preparing for participants and more broader community is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 250.88,
    "end": 254.102,
    "text": " most important thing for now, and I pass it to Ivan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 256.864,
    "end": 257.524,
    "text": "Thank you, Alex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.705,
    "end": 259.426,
    "text": "My name is Ivan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.566,
    "end": 261.387,
    "text": "I'm in Romania.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.787,
    "end": 264.549,
    "text": "I'm a researcher in Systems Management School.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.41,
    "end": 278.397,
    "text": "Last quarter, we, with our team, done a lot of work in case of education as well as in case of administration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.039,
    "end": 294.29,
    "text": " in the lab level, so I'm looking forward to development for all the directions we are going to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 296.551,
    "end": 299.273,
    "text": "Alright, let's get into the projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.171,
    "end": 305.195,
    "text": " So first we're going to provide some updates on the project scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.695,
    "end": 310.658,
    "text": "So these are things that happen during second quarter for a variety of projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.06,
    "end": 316.482,
    "text": "All right, first, as mentioned by several of us here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.523,
    "end": 325.166,
    "text": " We began the first cohort of the Active Inference Textbook Group in May 2022, and that'll go through July 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.667,
    "end": 336.071,
    "text": "And we are working on the first five chapters of this Active Inference Textbook by Thomas Parr, Giovanni Pizzulo, and Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.751,
    "end": 344.275,
    "text": "And just to give a little taste, though there's a few other pieces too that people who participate in future cohorts will get to experience,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.032,
    "end": 360.355,
    "text": " There's a collaborative questions and discourse affordance, which has allowed people to introduce basic clarifying questions, as well as questions about application and about philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.375,
    "end": 367.837,
    "text": "All different kinds of questions have been addressed in a way that really clearly references which part of the text it's about, which page or which figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.417,
    "end": 374.198,
    "text": "And in fact, all the tables, figures, equations, and so on have been annotated using Coda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.838,
    "end": 399.296,
    "text": " such that by just clicking on it you can see a pop-up of a figure and that allows a very interactive way of dealing with different terms and different objects of attention and then on the right we have some of the work by those engaged most in the math learning where for each equation we are aiming to have a natural language description",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.711,
    "end": 423.352,
    "text": " first just reading out the equation as it is and also here active inference ontology terms are in blue so this will facilitate the translation of equations across human languages as well as the development of multiple programming languages maybe that are representing a certain equation and giving a lot of continuity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.013,
    "end": 446.951,
    "text": " with the terms and the tools and the points of reference within the book and all of that is being threaded together really by the active inference ontology which has been in development since really the initial days of the lab so just awesome to see this new knowledge artifact come onto the scene new modification in the niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.651,
    "end": 454.955,
    "text": " New textbook has entered the chat and then be able to organize rapidly and have a bunch of participants get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.755,
    "end": 458.056,
    "text": "What would anybody else like to add about the textbook group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.022,
    "end": 470.963,
    "text": "It's different than a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.358,
    "end": 478.265,
    "text": " It has similarities with papers, but it is very different, so it's been a great experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.606,
    "end": 479.167,
    "text": "Anything else, though?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.407,
    "end": 479.847,
    "text": "Yeah, Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.209,
    "end": 489.479,
    "text": "Yeah, I think it was also an interesting experience how a subgroup for math learning was organized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 490.362,
    "end": 504.158,
    "text": " like my initiative of participants and how we started to work on like additional direction and provide more energy and more efforts to structure math side of the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 508.545,
    "end": 533.27,
    "text": " Yeah, this is our first attempt in such activity and as I see it, it has a lot of opportunities for learners and it really helps to acknowledge all the concepts and all the idea of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.994,
    "end": 548.226,
    "text": " great okay um moving on to another educational effort the internal systems thinking ongoing activity alex would you like to describe a little bit here or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.817,
    "end": 566.88,
    "text": " I can say that from the beginning it was part of our strategy to use system thinking and intelligent to organize work on projects and it is like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 568.425,
    "end": 587.78,
    "text": " requirement for lab participants to have an understanding of concepts of system thinking so having this educational activity for people who are willing to learn it and later to to take part in different roles in labs project for us it's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.161,
    "end": 612.017,
    "text": " like basements for all we're doing and we are also learning by doing this education and hopefully new version of textbook and the program which we're using here will help us to be more and more efficient in all projects that we are doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 616.24,
    "end": 617.241,
    "text": "Any other comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.158,
    "end": 630.803,
    "text": " Yeah, we launched this type of activity to have a common language for all of the participants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.823,
    "end": 634.525,
    "text": "And this course is providing such language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 636.145,
    "end": 639.347,
    "text": "And it is one of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.147,
    "end": 657.941,
    "text": " one of such activity and I hope we will continue with different types of educational formats.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 660.063,
    "end": 660.283,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.725,
    "end": 661.925,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.249,
    "end": 675.294,
    "text": " Continuing on, we have also in education, there was a lot of development in Q2 with our knowledge engineering and knowledge corpus project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.974,
    "end": 677.715,
    "text": "Blue, would you like to provide initial summary?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.717,
    "end": 680.977,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.297,
    "end": 694.364,
    "text": "So I think we've described this project before, but just briefly, we are taking the open source papers from PubMed that have active inference or free energy principle as keywords.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.124,
    "end": 703.949,
    "text": "And we've put all of these papers into a database and with all of the authors and all of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.105,
    "end": 715.768,
    "text": " we are then scraping them and parsing out the text for keywords from our ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.648,
    "end": 728.412,
    "text": "And this is shown here in the heat map, this top right figure, it shows all the different like ontology words and how they cluster per paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.031,
    "end": 735.953,
    "text": " So we've looked at keyword clustering and authorship, like this is first author papers by year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.233,
    "end": 750.516,
    "text": "So we can kind of see trends in active inference, but this will serve as then a way for our ontology to access the original data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.736,
    "end": 757.258,
    "text": "So if you're looking for words in the ontology, something you don't understand, like Markov blanket or something like this, you can actually find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.708,
    "end": 763.551,
    "text": " go straight to the horse's mouth, so to speak, and find papers that reference this, maybe that reference it a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.732,
    "end": 767.053,
    "text": "And so we're intending to publish this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.113,
    "end": 774.997,
    "text": "And then really we want to build a reflexive system and invite people to upload their own papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.897,
    "end": 778.959,
    "text": "And we're also starting to get papers from archive now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.739,
    "end": 786.763,
    "text": "And then we also will invite people to upload papers that maybe are not open access that they want to have cataloged in our database.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.358,
    "end": 794.991,
    "text": " So it's really a fun, interesting data science-y project that I've enjoyed working on with Daniel and our colleague RJ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.069,
    "end": 820.503,
    "text": " yeah just just to um show that that heat map again where the columns are the terms and the frequency of their use and the rows are different clusters of papers so this is like topic modeling it's identifying clusters of terms that have a similar co-expression pattern",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.323,
    "end": 840.248,
    "text": " And so it was really fun to apply this kind of heat mapping and clustering and some statistical techniques because both Blue and I have worked with gene expression analyses where the rows would be like the genes in the genome and the columns would be how much different genes are expressed in different samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.888,
    "end": 843.549,
    "text": "And so the ontology is kind of like the genome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.522,
    "end": 846.403,
    "text": " because there's one copy of every term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.683,
    "end": 847.543,
    "text": "It's like a dictionary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.264,
    "end": 857.168,
    "text": "And then some terms are used a lot or little or not at all in any given library, in any given sample of text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.928,
    "end": 863.151,
    "text": "And so it's showing how the expression of the ontology and of terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.051,
    "end": 884.489,
    "text": " relates to this in our case a reference genome of not just the whole language dictionary but specifically the active ontology as a versioning and developing artifact so then rhetorical and conceptual relationships can be drawn in principle amongst ontology terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.475,
    "end": 890.817,
    "text": " Like here's the relationship between Markov blanket and Friston blanket or whatever other terms are being linked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.357,
    "end": 903.122,
    "text": "And also that can be integrated with empirical results from the literature and also translated across different language to facilitate all kinds of education and research assistance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.423,
    "end": 905.363,
    "text": "So this will be really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.563,
    "end": 913.427,
    "text": "And as Blue mentioned, we're hoping to release the written paper and the tooling around this kind of a pipeline, which includes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.187,
    "end": 943.21,
    "text": " people being able to submit papers in annotate and update the information and then also have a rendering output and hopefully we'll provide an update on that soon but it was a fun quarter for this project any other comments on knowledge engineering okay all right in education we also had a great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.042,
    "end": 968.612,
    "text": " quarter of live streams so the two main series of live streams that we had this quarter we had some guest streams and we had our regular paper discussion live streams so in the guest streams we had uh mark of fashion adam saffron shannon procch anna lemke maxwell ramstead and dalton",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.372,
    "end": 973.734,
    "text": " Saktivya Devel, as well as just yesterday with Professor Steven Grossberg.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.234,
    "end": 992.28,
    "text": "So a lot of awesome guest streams, one-off presentations and discussions on active inference research, really like core and cutting edge work, as well as work that might not explicitly mention active inference, but is super consistent and of general interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.661,
    "end": 996.002,
    "text": "Like with Professor Lemke, it was a great discussion on dopamine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.54,
    "end": 1010.871,
    "text": " And in the paper live streams, we've had paper 41, 42, 43, 44, 45, and 46 working our way through the 40s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.891,
    "end": 1014.654,
    "text": "41 was on extended active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.674,
    "end": 1020.459,
    "text": "42 was on robotic navigation and the SLAM, simultaneous localization and mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.147,
    "end": 1027.111,
    "text": " 43 was a theoretical and experimental review related to predictive coding and ACT-INF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.272,
    "end": 1031.135,
    "text": "It was a mathematical review paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.155,
    "end": 1035.658,
    "text": "44 was Therapeutic Alliance as Active Inference, the role of therapeutic touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.719,
    "end": 1044.685,
    "text": "And there, Ian Tennant was really instrumental in coordinating those discussions and preparing, as was Sid in 42.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.798,
    "end": 1058.598,
    "text": " In 45, we talked about free energy principle made simpler, but not too simple, where Carl Friston and Thomas Parr joined for those discussions and provided some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.168,
    "end": 1089.153,
    "text": " great insights into this paper and we had a very cheerful time and there was a lot of surprises and a lot of bayesian surprise too and no surprise and bayesian surprise are not the same thing as we've been discussing in the textbook and then in the last two weeks we've just completed live stream number 46 on actif models do not contradict folk psychology which was great brought in some new people into live streaming had some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.373,
    "end": 1114.825,
    "text": " conversations of broad interest related to folk psychology and just the way that the academic, the lived, and the day-to-day perspectives on cognitive science and experience all come together and even uncovered some of the adjacencies there that go into philosophical and even theological angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.366,
    "end": 1134.743,
    "text": " awesome live streams by everyone who had joined and yeah a lot of learning happening within these streams any other comments or things that people want to know particularly fun stream that they watched or joined",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.748,
    "end": 1144.037,
    "text": " I had so much fun in 45.1, like where I was deferred to as like the expert on the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.938,
    "end": 1145.679,
    "text": "It's really funny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.079,
    "end": 1148.382,
    "text": "Like, like, like Carl was like, well, well, blue hat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.583,
    "end": 1149.143,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.665,
    "end": 1151.006,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.887,
    "end": 1153.85,
    "text": "That was, that was really like amusing and cute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.895,
    "end": 1175.281,
    "text": " yeah it was really a memorable experience was um beginning 45.1 i think and when we hit start streaming blue and i were the only people in the chat and we didn't um have confirmation that anyone else would join so we just trusted the plan",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.42,
    "end": 1199.756,
    "text": " and had authors join quickly and so it just was like it was very rapid um reduction of uncertainty and yes as tradition dictates the authors um passing to us and it's that kind of like participatory engagement where even though they wrote the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.377,
    "end": 1222.714,
    "text": " the expertise and the perspectives are still very distributed and hopefully it's striking a new and a reductive and also value aligned way to talk about research and to continue to develop research after artifacts are published in advance of other artifacts and just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.103,
    "end": 1250.359,
    "text": " Hope that we can continue to integrate in these discussions as like the tip of the iceberg, the best of all worlds in terms of having the rigor and the clarity and the conciseness where and as we need it, and also holding space for everything from basic questions, things that might not initially seem related, everything in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.879,
    "end": 1254.021,
    "text": "So any other comments on live streams?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.59,
    "end": 1271.355,
    "text": " All right, we didn't talk about this in the last quarterly lab meeting, but this was a paper from March 1st, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.715,
    "end": 1288.584,
    "text": "The authors were myself, Sean Applegate-Swanson, Arhan Chowdhury, RJ Corday, Shadee L. Dhammati, Avel aka Serval, Blue here, Yvonne here, Sid, Sid Code,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.603,
    "end": 1296.728,
    "text": " Amit Singh, Metameth, Jakob here, Caleb Tuttle, and Alex here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.088,
    "end": 1304.515,
    "text": "So a bunch of us and a bunch of other colleagues, we had a great time working on this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.435,
    "end": 1316.745,
    "text": "And what we did was we evaluated Web3 and blockchain technology in relationship to the emerging area of decentralized science, DeSci.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.376,
    "end": 1326.477,
    "text": " We also explored some opportunities for where Active Inference could interface with DSI in theory and in practice as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.589,
    "end": 1353.07,
    "text": " that highlighted some important conversations around dsi in its technological aspects what kind of technology is composing or moving the frontier of dsi in 2022 and then more in principle what does it mean for science to be decentralized decentralized in what way wasn't it always decentralized what kinds of failure modes across multiple scales",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.728,
    "end": 1377.746,
    "text": " decentralized systems present themselves with so we in the first part of this paper evaluated decentralized science dsi and just covered some historical threads that a lot of the co-authors just shared amazing views on we then presented an active entity ontology for science or eos",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.051,
    "end": 1384.736,
    "text": " and presented it in Coda tables, but we'll talk more about how we're continuing to develop it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.717,
    "end": 1393.724,
    "text": "It is a composable and versionable modeling system that uses the Active Inference Entity partition with the blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.242,
    "end": 1416.577,
    "text": " and the same ontology terms that we would use to describe particular entities partitioned states like affordances and policies and so on and separated types of entities into two main types active entities which are like adaptive active entities they're able to undertake actions and modify their niche and informational entities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.378,
    "end": 1422.082,
    "text": " which are also partitioned entities, but do not engage in action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.583,
    "end": 1429.229,
    "text": "So like a PDF of a paper, it's an informational entity, it's in the epistemic niche, but it's not taking actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.689,
    "end": 1444.122,
    "text": "Whereas active entities ranging from humans or programs, as well as organizational institutional type entities across multiple scales are engaging in communication and actions around their epistemic niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.375,
    "end": 1468.106,
    "text": " that is providing a foundation and a grounding for continued discussions that we're having about how to bring integrity and continuity amongst natural language representations visual representations and simulation type representations of complex digital and cyber physical systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.093,
    "end": 1480.476,
    "text": " So would any of the other authors like to share like anything that I missed or one part about this paper that they found useful or interesting to work on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.759,
    "end": 1491.739,
    "text": "So I'll share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.999,
    "end": 1497.081,
    "text": "I thought this paper was interesting because there was a, or there is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.177,
    "end": 1512.828,
    "text": " quite a bit of tension between decentralization in terms of like distributed effort and labor and also like DeSci as like a market based entity or idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.549,
    "end": 1521.555,
    "text": "And so resolving these two things or like the tension and juxtaposition of what is DeSci?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.595,
    "end": 1524.277,
    "text": "Is it just the distribution of knowledge and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.891,
    "end": 1529.832,
    "text": " resources, or is it more based on markets and blockchain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.692,
    "end": 1534.113,
    "text": "I think that that was one of the key insights brought upon by this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.714,
    "end": 1536.994,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.875,
    "end": 1545.317,
    "text": "And hopefully we'll have more spaces and times to explore and draw out some of these threads, maybe even a guest stream with these authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.957,
    "end": 1546.097,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.779,
    "end": 1555.427,
    "text": " What is today known as Web3 and blockchain is developing and growing out of and beyond financial technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.468,
    "end": 1568.921,
    "text": "And perhaps there's a sense or an argument in which financial technology are some of the sinews and connective tissues by which science occurs, like value and financial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.658,
    "end": 1574.522,
    "text": " actions occur in scientific and epistemic ecosystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.202,
    "end": 1577.705,
    "text": "But is that the common denominator?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.905,
    "end": 1589.916,
    "text": "Will we be financial reductionists with respect to how we model, for example, motivation and all these types of cognitive features in epistemic ecosystems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.807,
    "end": 1621.421,
    "text": " the same time there's many features of blockchain systems that make them a natural fit for scientific information so it's an ongoing discussion and and hopefully those with interest in dsi or these kinds of technologies overall will just stay tuned and get involved because we're just beginning this avenue of development okay any comments here or we'll continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.42,
    "end": 1626.7,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.861,
    "end": 1630.702,
    "text": "Next, we'll talk about some research and applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.222,
    "end": 1633.222,
    "text": "We'll talk about the Active Blockference project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.323,
    "end": 1637.904,
    "text": "Jakob, do you want to provide a little summary of Active Blockference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.065,
    "end": 1641.425,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.666,
    "end": 1653.67,
    "text": "Active Blockference is a work-in-progress Python package that connects the recent new library",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.531,
    "end": 1669.678,
    "text": " for modeling agents with active inference called PyMDP, and another library called CatCat, which is used a lot in economic and complex system simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.398,
    "end": 1681.324,
    "text": "So ActiveBlock, for instance, right now, the combination of the two active inference agents are modeled within CatCat,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.177,
    "end": 1688.781,
    "text": " and currently it's still very much work in progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.282,
    "end": 1695.448,
    "text": "The overall structure of the package is still being developed and we're working on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.566,
    "end": 1717.775,
    "text": " polishing the implementation of PyMDP and tailoring it more towards the CAD-CAD style of development and also working on problems, how to increase the complexity of the models with multi-agent modeling or different constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.636,
    "end": 1720.916,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.976,
    "end": 1724.858,
    "text": "PyMDP, just for context, is a Python",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.152,
    "end": 1729.353,
    "text": " package that has recently been developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.133,
    "end": 1745.458,
    "text": "And it provides a very simplified foothold for Python programming to be implementing the kinds of Markov decision processes, that's MDP, that are used in some formulations of Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.198,
    "end": 1750.42,
    "text": "And so it's an incredibly important package to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.36,
    "end": 1766.332,
    "text": " And also there are some other features that are requisite to use for systems engineering for the kinds of generative models and generative processes that we might want to implement in real applied active inference settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.592,
    "end": 1779.242,
    "text": "For example, parameter sweeping architectures and being able to specify execution orders and have some reproducibility around certain kinds of simulations, various features that the CAD-CAD framework provides for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.163,
    "end": 1785.828,
    "text": " So, as Jakub mentioned at the very beginning, the multi-agent case is quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.328,
    "end": 1794.174,
    "text": "Like, does each entity perceive and then act, and then we cascade through them in the same order, different order?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.775,
    "end": 1798.718,
    "text": "Or is there some other structures and execution orders?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.778,
    "end": 1802.001,
    "text": "How does that influence active inference simulations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.311,
    "end": 1810.755,
    "text": " With MetaMyth, I've been continuing to work on the next generation of the active InferAnt colony simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.775,
    "end": 1813.716,
    "text": "So I hope to share more specifics when we have it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.077,
    "end": 1821.06,
    "text": "But this is a continuation of the work that was done in 2021 with several colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.161,
    "end": 1825.643,
    "text": "We're working on various other aspects of the package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.69,
    "end": 1838.973,
    "text": " this last one here connecting to ethereum or other web3 ecosystems so just to kind of hinge on that look into the next slide or the active block prints project",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.932,
    "end": 1860.479,
    "text": " There was a ecosystem support program grant available from the Ethereum Foundation, and we proposed in a grant application about a month ago to expand our current simulations into multi-agent setting in order to explore cognition and behavior underlying DeSci and DeFi projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.239,
    "end": 1867.562,
    "text": "The grant was not funded, so the foraging continues, but it was a great learning experience and it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.048,
    "end": 1888.516,
    "text": " helped us sharpen and elaborate on everything from the substance of the package itself to the communications around it and have preliminary discussions on how do we balance in a distributed team retroactive funding proactive funding and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.816,
    "end": 1916.124,
    "text": " specifically we were proposing to develop multi-agent act some case studies and digital twins that already exist in the ethereum ecosystem porting those over into an active inference uh framework and helping characterize scenarios and phenomena that had previously been only approached from a top-down essentially macroeconomic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.253,
    "end": 1931.035,
    "text": " type of simulation like if the interest rate is this amount and this is the other parameter on this macro then here's how the system will evolve trying to complement that with a bottom-up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.854,
    "end": 1937.316,
    "text": " cognitive entity decision-making framework that could be used in a lot of interesting ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.997,
    "end": 1949.662,
    "text": "Specifically, we were interested about the possibility and still are of performing these kinds of cognitive audits, which is a terminology used in various artificial intelligence fields",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.322,
    "end": 1966.555,
    "text": " But a cognitive audit could provide insights into if potentially there was some smart contract or series of cyber physical relationships where from a computer security or network security perspective, it was airtight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.418,
    "end": 1974.507,
    "text": " However, in the cognitive niche, perhaps there were destabilizing forces or dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.449,
    "end": 1984.22,
    "text": "And although it wouldn't have been part of our initial work, we hope to eventually include cognitive features even like, for example, narrative and sentiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.821,
    "end": 1998.967,
    "text": " such that different kinds of information, natural language, reading and writing, all these kinds of features of real cognitive systems could be integrated into these increasingly actionable and coherent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.336,
    "end": 2002.296,
    "text": " digital twin site type simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.837,
    "end": 2016.479,
    "text": "So if anybody is interested to get more involved in active block prints, whether they have familiarity with Python, CAD, CAD, active, all or none of the above, everybody is welcome to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.04,
    "end": 2025.501,
    "text": "And also if anyone has insights into how such a project might receive some funding, we're also open to those thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.342,
    "end": 2028.322,
    "text": "Anything else on the grant application?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.726,
    "end": 2060.293,
    "text": " okay we on the engagement and outreach frontier continued connecting with new and returning participants on different platforms we saw growth across our discord twitter podcast channel and youtube channel so it was a good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.328,
    "end": 2089.86,
    "text": " quarter of activity on these fronts and of course always feel free to share our public information or invite other people who you think might want to get involved but we continue with the work and these are our active states in the epistemic niche any funny tweets any memorable emojis okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.567,
    "end": 2099.714,
    "text": " And then, closing out the project updates, staying on the engagement and outreach theme,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.629,
    "end": 2109.171,
    "text": " We have some directions that are coalescing relating to the engagement and outreach at ACT-INF Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.911,
    "end": 2128.495,
    "text": "So first we are developing an internship program that we'll share more details on, but we'll provide a much more scaffolded project specific way for individuals who want to on-ramp into the lab or to step up their activity and learn by doing that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.454,
    "end": 2141.304,
    "text": " We've written some letters of support for applications at university programs with more information should these applications of our colleagues be accepted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.245,
    "end": 2148.69,
    "text": "We believe that this kind of a institution to institution partnership is going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.316,
    "end": 2177.229,
    "text": " going to be a lot of affordances for win-win opportunities with different institutions reaching out to actinth lab and having a relationship where we can each contribute what we can do and be part of some joint action some generalized synchrony and also especially through the relentless work of dave douglas we've been improving our subtitles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.399,
    "end": 2185.305,
    "text": " and language translation progress, which we'll talk more about, but language translation includes math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.645,
    "end": 2198.696,
    "text": "So just at this first pass, it's raising attention to the way in which, whether it's audio content or textual content or morphing in between with speech to text and text to speech,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.901,
    "end": 2206.564,
    "text": " Annotation and translation is the basis of rigorous scholarship as well as accessible information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.264,
    "end": 2217.648,
    "text": "So making sure that whatever the initial artifact is, that it can be consumed and enjoyed in the sensory modality that's most accessible to a given person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.025,
    "end": 2242.223,
    "text": " and translated into the natural language computer languages and so on that are most familiar to somebody again also helps with accessibility and rigor so just like we looked at with the textbook group with the math as a language truly being translated into natural language using ontology terms that will facilitate translations amongst different languages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.044,
    "end": 2253.711,
    "text": " that will just make sure that from the first step to the 99th step of learning and applying Active Inference, that it's really a coherent and a comprehensive experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.391,
    "end": 2257.133,
    "text": "So really awesome directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.213,
    "end": 2266.819,
    "text": "And if anyone sees opportunities to join in engagement and outreach with us, of course, please feel free to just contact us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.82,
    "end": 2271.042,
    "text": "Any other comments on project updates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.375,
    "end": 2273.256,
    "text": " on this section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.62,
    "end": 2287.464,
    "text": "Okay, so the next section of this lab meeting will be about the next steps at the project scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.885,
    "end": 2291.446,
    "text": "Starting with the theme of education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.467,
    "end": 2299.811,
    "text": "As mentioned, we are completing the first cohort, first part of the Act-Inf textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.323,
    "end": 2326.515,
    "text": " after cohort one part one we'll finish up through chapter five in the end of july we're going to take august off and then we are going to pick back up with two parallel cohorts there's going to be cohort one continuing on with part two of the textbook so that those first cohort can finish the textbook at least a first pass on it during 2022",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.626,
    "end": 2352.243,
    "text": " will then also begin cohort two of part one so these will be a totally new batch of people who are coming in and starting on chapter one and people from cohort one who want to just take a second pass um i think we all do in a sense whether we take the plunge to be in cohort two or not is a different question but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.174,
    "end": 2375.899,
    "text": " all these materials are the kinds of things that we can just get many coats of paint on and learn and read again and again we're really excited for this second cohort because we'll be incorporating a lot of what we're learning from the first cohort into how we proceed with this second cohort as well as with part two in the first cohort",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.086,
    "end": 2385.453,
    "text": " And hopefully this is just the first few of many, many textbook group cohorts because it provides a very accessible on-ramp",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.078,
    "end": 2387.979,
    "text": " into learning and applying active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.639,
    "end": 2392.841,
    "text": "The textbook is written with that kind of learning and applying in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.701,
    "end": 2410.587,
    "text": "And hopefully these textbook groups are providing a service that makes that on-ramp even smoother and more fun and with more image memes and with more connecting the dots and more exercises to test, more opportunities to ask questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.558,
    "end": 2419.121,
    "text": " And I'll put the link in the YouTube chat for registering to participate in an upcoming cohort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.541,
    "end": 2424.283,
    "text": "Does anyone else want to add anything about this next steps on the textbook group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.225,
    "end": 2431.646,
    "text": "Just that it's a great opportunity to get involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.706,
    "end": 2440.79,
    "text": "If you want to learn more about active inference, or even if like you're starting at ground zero, we've had some people come in with like no idea about the math and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.172,
    "end": 2449.816,
    "text": " Yeah, it's been, I think, really useful to work with everyone from all levels to kind of try to make this field more accessible for everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.497,
    "end": 2453.818,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.478,
    "end": 2454.678,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.371,
    "end": 2477.082,
    "text": " also on the education theme so as suggested in some of the updates we're learning a lot from the textbook group and other educational projects that are occurring in the lab like the active inference ontology development and live streams and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.223,
    "end": 2480.585,
    "text": " with education and research as our mission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.906,
    "end": 2487.172,
    "text": "We've always been interested in developing some active inference courses and educational experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.715,
    "end": 2493.959,
    "text": "Alex, do you want to provide some updates on how we'll be continuing here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.325,
    "end": 2499.805,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2502.192,
    "end": 2519.185,
    "text": " This activity on creating an online course is also many hours of learning by doing for our own, for creating courses, because we understand that for different audiences, different courses need to be created.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2520.166,
    "end": 2525.07,
    "text": "And finally, we should have a bunch of different ones.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2525.73,
    "end": 2530.133,
    "text": "And this introductory course will be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2531.495,
    "end": 2542.267,
    "text": " example of organizing the team of different educational roles which you understand are needed to take part of creating a course which should be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2545.233,
    "end": 2549.155,
    "text": " have quality and have accessibility and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2550.356,
    "end": 2572.63,
    "text": "That's why based on experience and materials and results of textbook group including and developing different types of cases and examples into online forum which can be supported by online platform which we'll be using from Systems Management School.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2573.542,
    "end": 2585.966,
    "text": " It will be the first step to a broad set of educational materials for any new people who will start to learn Active Inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2586.166,
    "end": 2600.571,
    "text": "And we will create courses and improve a set of courses to make it accessible to as many people as possible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2602.982,
    "end": 2628.712,
    "text": " yes in the long arc of education and even just active inference education this is a modified curio card yes i right click saved it and now on the top of this pile of books is the active inference textbook and it's just reflecting like one more epistemic niche modification and it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.997,
    "end": 2650.593,
    "text": " coming after, of course, many papers and also other kinds of educational materials that have been prepared, ranging from short-form workshops that have been held in different locations to blogs and GitHub repositories, like famously at Barron Millage, of just informative links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.353,
    "end": 2653.915,
    "text": "And those are all very important educational formats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.736,
    "end": 2682.134,
    "text": " however there is nothing like an active inference course and for a course to be done right and versioned in our attentional situation and with our conceptual focus on active inference it's quite a challenge but there's also an amazing opportunity here so for those who would like to be learning more about how to participate this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.564,
    "end": 2698.888,
    "text": " one way to be getting involved at some stage with the team or with the feedback on the initial course, or of course, just as with the textbook group, the early cohorts who co-create in this participatory way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.488,
    "end": 2700.769,
    "text": "So this is super exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.209,
    "end": 2712.052,
    "text": "And also we've had a lot of great contributions from participants, from Dean, Jessica, Brock, so many others who've added and helped us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.035,
    "end": 2741.816,
    "text": " build um a lot of like a a garage of spare parts and motifs and considerations that when we formalize the course team will be able to be taken into account and implemented okay um all right on the education theme as well let's talk about the systems thinking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.768,
    "end": 2743.448,
    "text": " summer intensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.229,
    "end": 2748.291,
    "text": "Ivan or Alex want to describe what will be happening in August 22?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.672,
    "end": 2759.098,
    "text": "Yes, in August, we will launch a branch activity of system thinking course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.539,
    "end": 2761.94,
    "text": "And it will",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.522,
    "end": 2776.451,
    "text": " unpack the base concepts of the system, one of the base concepts of system thinking, its roles and role-based descriptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2780.455,
    "end": 2807.215,
    "text": " for four weeks we will define what the roles are and how we can use it to have common meaning with how we can see different things in a way to understand each other and that's it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2810.523,
    "end": 2810.723,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.243,
    "end": 2812.084,
    "text": "Alex, want to add anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.129,
    "end": 2822.349,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.549,
    "end": 2823.87,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.37,
    "end": 2824.51,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.465,
    "end": 2844.45,
    "text": " in educational activities we are announcing some of the early sketching around the internship program which perhaps by any other name would it smell so sweet it's really like um a learning by doing scaffolded affordance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.77,
    "end": 2854.576,
    "text": " It is a self-driven opportunity for individuals of all ages, larval stages, backgrounds, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.417,
    "end": 2864.363,
    "text": "to engage in personal learning and development that will be related in a large part to project-based contributions to ACNF Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.803,
    "end": 2866.884,
    "text": "So it'll be win-win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.585,
    "end": 2873.228,
    "text": "You'll be learning by doing and contributing to the Lab as well and helping projects develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.714,
    "end": 2898.235,
    "text": " um the duration and time commitment we're figuring out some details but we'll be able to make it work for people who want to be involved we'll find a way to make it happen for those who engage in this type of internship beyond the priceless value of learning and development and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.833,
    "end": 2903.655,
    "text": " being on the trajectory of acting, inferring, serving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.456,
    "end": 2916.303,
    "text": "The lab can also offer everything from letters of recommendation and guidance and mentorship, as well as increased access to the digital research architecture of the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.273,
    "end": 2938.252,
    "text": " and we also hope to provide more affordances as we gain resources and organizational complexity and these internships will be centered around a target project although there will also be curriculum of the internship that is not related to a project like related to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.639,
    "end": 2962.412,
    "text": " watching live streams or engaging in the textbook group cohorts but a lot of the contribution will be focused on a project that will be carried out in a structured way so it'll provide again great opportunities for people who have skills that they would like to apply skills they'd like to learn for now the best way to learn more about this internship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.274,
    "end": 2973.653,
    "text": " Whether you're interested or whether you know of somebody who might like to maybe get involved would be to contact us at ActiveInference at gmail.com",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.671,
    "end": 2999.124,
    "text": " and or to register for the systems thinking summer intensive because these projects will have role-based approaches to participating so the summer intensive is a couple weeks long a couple of hours per week and it will provide a nice uh warm-up for getting involved in a role-based internship program okay any other thoughts here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.054,
    "end": 3022.815,
    "text": " okay also in our next steps we are expanding and scaling the active inference journal so this is again uh work with several participants and especially dave we've been preparing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.409,
    "end": 3049.518,
    "text": " a sequence of work and practices and roles so that for our past catalog of live streams and other presentations and going forward we will be able to have a effective and automatable and also just documentable and reproducible approach for preparing the transcript of a speech event",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.856,
    "end": 3077.806,
    "text": " into an edited curated format that can then be rendered into on one hand a prose based format which can be published for indexing citing and searching and on the other hand into a subtitle format that will facilitate accessibility of the videos and also that can all be translated across different languages so it'll be really exciting to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.025,
    "end": 3102.403,
    "text": " really nailed down our practices and ways of working such that within several days, potentially after a live stream occurring, we could publish a very high quality annotated artifact that could leverage the impact of a lot of these very important conversations that are happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.265,
    "end": 3108.068,
    "text": "And anything else to add on the journal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.827,
    "end": 3115.107,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.768,
    "end": 3130.192,
    "text": "We will announce here that we are having a second applied active inference symposium on the theme of robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.337,
    "end": 3153.503,
    "text": " it will be held on July 31st 2022 from 4 to 8 and 16 to 20 UTC so all the dates and times are UTC it's a four hour first interval 12 hour break or sorry eight hour break and then another four hour interval",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.327,
    "end": 3161.233,
    "text": " Stay tuned on social media and our newsletter for more information, including presenters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.893,
    "end": 3170.361,
    "text": "We've been having a great time collaborating with the co-organizers, Matt Brown and Mark Miller, as well as some of us on this call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.382,
    "end": 3174.765,
    "text": "And in the last year or two, there have just been many,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.746,
    "end": 3201.959,
    "text": " important introductory works bridging active inference and robotics so for example here's an image from how active inference could revolutionize robotics of da costa et al recently as well as the paper that we discussed of katal et al in april in livestream 42 on the simultaneous localization and mapping so we hope to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.859,
    "end": 3219.516,
    "text": " hold this symposium where there will be presentations and roundtable type discussions that are live streamed as well as recorded and rewatchable and also with transcripts that will be published as proceedings to highlight some issues",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.675,
    "end": 3227.243,
    "text": " and opportunities in this increasingly important area of active inference and robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.403,
    "end": 3237.896,
    "text": "So we hope to be drawing on many perspectives, those who are coming at the active robotics intersection from the perspective of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.786,
    "end": 3249.811,
    "text": " Researchers, industries involved in robotics or active inference, those with curiosity, those with philosophical interest in these topics, ethics and the social implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.352,
    "end": 3253.713,
    "text": "There's going to be a lot of great discussions around this symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.873,
    "end": 3257.415,
    "text": "So just stay tuned and we'll have more information coming out soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.636,
    "end": 3263.338,
    "text": "Any other comments on the symposium or any other next steps for projects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.873,
    "end": 3295.901,
    "text": " okay so one new thing special announcement time as of June 2022 this month we are formalizing a transformation at the organizational scale from the active inference lab into the active inference Institute so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.835,
    "end": 3325.555,
    "text": " use those emojis but this has been a really exciting development and we'd like to just share a little bit about it now we've been working with freed frank in a pro bono law firm capacity and they've been helping guide this developmental process we're initiating some enterprise architecture development such as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.832,
    "end": 3351.167,
    "text": " updating and improving our governance structure obtaining funding and hiring for research and educational roles and identification of focal projects as affordances for onboarding more generally this move in generative model or markov blanket from the active lab to the active inference institute helps us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.13,
    "end": 3357.572,
    "text": " clarify and continue on with our strategy around education and research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.232,
    "end": 3363.214,
    "text": "And the time has come for something different and bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.774,
    "end": 3377.94,
    "text": "And so we hope that the AI organization will be able to represent that and scaffold that and provide those services to our niche in the best possible way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.878,
    "end": 3383.182,
    "text": " I guess there's a ton to share and ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.362,
    "end": 3386.846,
    "text": "And in the coming few slides, we'll talk a little bit about strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.926,
    "end": 3391.311,
    "text": "But what do people want to add here about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.791,
    "end": 3392.192,
    "text": "Just for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.941,
    "end": 3410.031,
    "text": " I want to say that these changes on organizational scale, from one hand, reflects the growing number of services that we are providing to the niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3411.072,
    "end": 3416.656,
    "text": "And from another hand, is an answer for growing complexity of activities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3417.157,
    "end": 3426.444,
    "text": "And I believe that after we are analyzing immigration projects before beginning of next semester,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3428.175,
    "end": 3451.467,
    "text": " we will be really ready for scaling of our activities and to include more people to participate and having that scale as an opportunity to grow and having the ability to grow with new",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3455.982,
    "end": 3466.245,
    "text": " scales and having new possibly group departments and different types of projects and support different types of collaborations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3469.225,
    "end": 3469.505,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.645,
    "end": 3474.487,
    "text": "Anyone else want to add before we talk about strategy a little bit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3477.367,
    "end": 3479.508,
    "text": "We just want to... Oh yeah, Blue, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.268,
    "end": 3483.749,
    "text": "I just wanted to add that I don't know, it's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.888,
    "end": 3505.673,
    "text": " a really involved process becoming a 5013C and thinking about governance structure and how that fits into our strategy and balancing the things we have to do like obligational commitments in order to further the success of the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.073,
    "end": 3511.714,
    "text": "And also like the fun things that we like to do like research and papers and textbook groups and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.734,
    "end": 3511.834,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.273,
    "end": 3518.058,
    "text": " So striking a balance has been interesting, challenging, and hopefully it'll be rewarding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.741,
    "end": 3521.941,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.527,
    "end": 3530.749,
    "text": " It's only 18 months ago when we began the lab in the beginning of 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.529,
    "end": 3538.99,
    "text": "And we very immediately afterwards began the process of formalizing as a nonprofit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.411,
    "end": 3542.951,
    "text": "We did end up doing that in a California nonprofit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.831,
    "end": 3545.532,
    "text": "And that was a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.496,
    "end": 3556.813,
    "text": " good step that helped us get a taste of the kinds of enterprise architecture that we would ultimately need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.754,
    "end": 3559.979,
    "text": "And now we're ready to face those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.297,
    "end": 3586.512,
    "text": " challenges and opportunities really directly with this new approach so it's super exciting and we just wanted to include it in this lab meeting as recent developments and more will be coming in the coming months in July of 22 we'll take kind of a summer break there won't be any live stream paper discussions and during that time we'll be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.295,
    "end": 3592.44,
    "text": " having a lot of migrations and updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.5,
    "end": 3601.055,
    "text": "So just stay tuned for things to be updating as they do in the ACT Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.793,
    "end": 3605.054,
    "text": " let's talk a little bit about strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.874,
    "end": 3621.18,
    "text": "So here we'll present a update on our strategy document that as we update this at the quarterly scale, we'll be helping to guide some of the next development steps in the Active Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.88,
    "end": 3629.623,
    "text": "So Active Inference Institute, AII, or you can use emojis with just an A and then the two I emoji.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.803,
    "end": 3632.124,
    "text": " is on the path of open-endedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.664,
    "end": 3638.726,
    "text": "Our strategy considers learning and applying active inference for changes in the niche over multiple nested scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.686,
    "end": 3647.269,
    "text": "Through time, we increase the degree of hierarchical organization complexity to overcome competing interactions and frustrated states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.27,
    "end": 3657.273,
    "text": "We engage in policy selection, reducing our uncertainty about realizing our expectations and preferences for epistemic values as a nonprofit organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.073,
    "end": 3658.754,
    "text": "At the same time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.639,
    "end": 3665.822,
    "text": " To ensure Institute development, we need to secure pragmatic financial sustainability with enabling activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.963,
    "end": 3677.928,
    "text": "And the three scales that the AII is modifying and interacting with are first the participant as an agent, the human participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.969,
    "end": 3685.392,
    "text": "The Institute provides affordances and updates participants generative models via providing them a modified niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.213,
    "end": 3688.574,
    "text": "With the Institute as an agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.0,
    "end": 3700.922,
    "text": " This level is where we can engage in institute level policy selection and evolve a shared generative model that goes beyond any one participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.762,
    "end": 3716.945,
    "text": "And then lastly, we are modifying and interacting with our communities and peer organizations in our epistemic niche, where we provide services and opportunities and engage in collaborations with community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.345,
    "end": 3719.646,
    "text": "So any overall thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.898,
    "end": 3731.164,
    "text": " Okay, to our first area of focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.125,
    "end": 3732.665,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.248,
    "end": 3738.23,
    "text": "Our first area of focus is education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.291,
    "end": 3745.357,
    "text": "At the participant scale, we approach the participants' active inference mastery as the system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.892,
    "end": 3767.564,
    "text": " reflect the plurality of individual priors expertise levels and preferences we develop different educational formats such as workshops discussion groups online courses project-based learning internships and more and our preference is to have up to a hundred participants involved in education by the end of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.285,
    "end": 3779.851,
    "text": " At the Institute scale, we're learning state-of-the-art ways of working and practices across functional domains to build and strengthen our organizational capacities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.832,
    "end": 3787.295,
    "text": "And at the Community scale, we work on education and reducing research debt for broad communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.356,
    "end": 3790.978,
    "text": "We develop public video and audio content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.008,
    "end": 3799.432,
    "text": " that spreads and we prefer to reach out to many dozens of thousands of people with the information that we create.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.413,
    "end": 3804.775,
    "text": "Any other thoughts or ideas on education?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.795,
    "end": 3819.163,
    "text": "I think it's exciting to explore what the future and the present of education are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.939,
    "end": 3830.303,
    "text": " We've seen only the early days of online education, even though there's been many effective or less effective approaches tried.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.584,
    "end": 3841.608,
    "text": "There's so much to develop around how we educate, especially for the active inference area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.809,
    "end": 3845.07,
    "text": "Two related to research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.601,
    "end": 3853.372,
    "text": " At the participant scale, we provide affordances to scaffold and launch research and development projects by participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.329,
    "end": 3861.736,
    "text": " Projects can be driven by participants inside or outside of our organization, and the Institute will provide relevant support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.817,
    "end": 3873.788,
    "text": "We expect to see dozens of research outcomes in the coming months and years, ranging from papers, workshop, and conference presentations, and from the basic to the applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.229,
    "end": 3876.23,
    "text": "At the Institute scale,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.288,
    "end": 3894.654,
    "text": " As an organization, we rearrange, we catalyze and participate in active inference research projects with long-term impact or public goods features like ontology development, knowledge engineering, and also events such as symposiums and conferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.414,
    "end": 3907.261,
    "text": " At the community scale, we recognize and seek to carry out, apply and improve upon research practices from open science, DeSci, beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.963,
    "end": 3912.104,
    "text": "So to be caught up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.982,
    "end": 3923.714,
    "text": " education, d.school, and then to go beyond and create novelty and discover on the frontier research like d.sci.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.015,
    "end": 3930.142,
    "text": "Those are the two key and first focuses of the ACT-INF Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.223,
    "end": 3933.085,
    "text": "The third is outreach and engagement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.846,
    "end": 3938.469,
    "text": " So at the participant scale, we think of participants as ambassadors of the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.049,
    "end": 3945.773,
    "text": "So we welcome and support their initiatives to share a voice about active inference in various situations and communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.574,
    "end": 3954.158,
    "text": "At the Institute scale, we aim to set up partnerships with other organizations from academia, industry and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.158,
    "end": 3962.563,
    "text": "This supports high quality science communication, education and collaborations around research topics such as active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.701,
    "end": 3987.658,
    "text": " at the community scale we acknowledge the diversity of people's initial conditions for example their familiarity with different languages science philosophy computation everything we develop projects of uh like the active inference online journal and create popular science content for different social media and we hope to provide uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.979,
    "end": 4004.498,
    "text": " portfolio of outreach and engagement opportunities again to meet those who are interested where and how they are any other thoughts or ideas on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.872,
    "end": 4018.722,
    "text": " So just a thought on the research strategy for people that might have projects that didn't start in the active inference lab or projects that they want to start and haven't yet started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.143,
    "end": 4022.866,
    "text": "We don't necessarily start projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.346,
    "end": 4024.807,
    "text": "Sometimes projects come to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.308,
    "end": 4030.152,
    "text": "So if you're looking for a network of people or maybe weekly meetings with feedback or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.772,
    "end": 4041.862,
    "text": " something else to scaffold your project, we can provide access to a big community of active inference researchers and like would welcome projects that have already taken off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.163,
    "end": 4055.375,
    "text": "So if you have a project that you want to bring into the lab, that is open science, that's, I think, one of the key things for the lab, we would just welcome that opportunity to work with anyone who wants to do an active inference based project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4057.179,
    "end": 4057.58,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.781,
    "end": 4063.157,
    "text": "And yeah, hopefully we can have more exemplars and clear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.594,
    "end": 4090.353,
    "text": " lanes and the uh mystery lanes for those that don't even yet exist but there's a continuum of ways to participate in project-based learning ranging from coming to an act institute scaffolded project where we will help with the rhythm the infrastructure the role assignment and everything it's kind of like a show up and enter the game type project",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.522,
    "end": 4115.17,
    "text": " there also might be projects that are totally off the radar of act institute it's just you are participating in a project or not but you're connecting with participants in in the organization and you find a latent interest and you collaborate that way with your own font formal documents ontologies narratives and tools",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.05,
    "end": 4124.693,
    "text": " Or something in the middle where you have a project that's at a stage where you're ready to get feedback from the active inference community or just from any interested people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.293,
    "end": 4136.397,
    "text": "Maybe there's opportunities to collaborate or maybe you're looking for just some help on tweaking it and fine tuning it as you prepare, for example, to submit a paper or develop the next version of something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4136.917,
    "end": 4138.658,
    "text": "So there's so many ways to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.378,
    "end": 4165.747,
    "text": " research and education that we will just have clarity around where is the projects that the institute is scaffolding and moving the needle on and those are the kind of massively collaborative projects where people who want to be involved can kind of get involved and check back in and out all the way to projects that are self-driven and you're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.707,
    "end": 4180.823,
    "text": " seeing the lab as again a niche that is modified for you to support those kinds of research efforts like one exciting opportunity there is for individuals who would like to be writing or building applications",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.884,
    "end": 4198.536,
    "text": " that use active inference to gain some familiarity with the ontology could go a long way and somebody could just hang out in the relevant meetings or read the relevant documents and publications and then that is like a way to close the feedback loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.036,
    "end": 4203.098,
    "text": " and to use these services that are being provided in the niche like the ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.618,
    "end": 4211.961,
    "text": "And so reduce research debt by promoting coherent and comprehensive use of active inference terms and concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.522,
    "end": 4224.306,
    "text": "And so there's many ways to learn and research and apply aligned with this overview strategy work in progress we're presenting here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.187,
    "end": 4227.808,
    "text": "And lastly, four methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.514,
    "end": 4235.456,
    "text": " At the participant scale, we educate participants so they grow their expertise level in different disciplines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.677,
    "end": 4246.541,
    "text": "As disciplinary expertise entails competency in various practices and tools, we take a holistic approach to participant professional development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4247.781,
    "end": 4249.042,
    "text": "At the institute scale,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.182,
    "end": 4255.286,
    "text": " Communication and organizational design are our fundamental effort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.966,
    "end": 4264.353,
    "text": "We apply active inference, systems thinking, and other first principles approaches to the Institute operations and at the community scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.993,
    "end": 4271.398,
    "text": "We share and promote methods we use throughout the community to increase the quality and efficiency of collaborations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.079,
    "end": 4277.203,
    "text": "And we're also open to recommendations for new methods and strategies to consider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.557,
    "end": 4290.186,
    "text": " So methods is a little bit of the how, just as if it were a scientific paper, and the what is education, research, outreach, and engagement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.507,
    "end": 4304.358,
    "text": "So this lab meeting has consisted a little bit of a introduction section, again, sticking with this scientific paper metaphor, an introduction of updates,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.888,
    "end": 4327.853,
    "text": " maybe also those are our results some discussions and next steps and now with this one new thing we are also pointing the way in which we are heading during this ongoing transformation into the Active Inference Institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.633,
    "end": 4342.474,
    "text": " And so it's a really exciting time for those who are involved and paying attention, we expect and prefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.057,
    "end": 4362.979,
    "text": " And there's many opportunities to be getting more involved in any number of ways, ranging from educational opportunities to joining the kinds of projects where you can be engaged in research, education development,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.94,
    "end": 4388.489,
    "text": " application many opportunities there and it's just the beginning for the Institute so much more will be happening as time flies what else would people like to address or ask or bring up in closing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.762,
    "end": 4407.451,
    "text": " I want to say that results and plans that we're having reflects our initiatives in a really long time scale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4407.771,
    "end": 4421.641,
    "text": "And we understand that we can evaluate results like in one or two decades and say that these first initial small steps were like a beginning on something big.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4422.506,
    "end": 4431.332,
    "text": " And as for strategy, and all that we have now is like applications of approaches that we choose in the beginning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4432.153,
    "end": 4448.724,
    "text": "And an example of strategy, which is like a process for us and that updates on quarterly base updates of the strategy is important because it provides a way to be adaptive and react on changes on...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4449.918,
    "end": 4478.668,
    "text": " information we are getting in the process of work and also consideration an institute and the strategy on at least three scales of that we are paying attention to and planning changes for free scales is also providing our to us a lot of opportunities to affect different aspects and niches which are related",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4479.634,
    "end": 4495.125,
    "text": " and that's why being from one hand have a very long time horizon in our planning and at the same time having that very flexible approach to development like this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4498.811,
    "end": 4512.945,
    "text": " cornerstones of first principles and kind of evolutionary and open-endedness approach, I believe, will bring us a very interesting result at the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4518.93,
    "end": 4522.534,
    "text": "Does anyone else want to add anything or I'll make a note we can continue discussing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.509,
    "end": 4540.002,
    "text": " So one conversation that Jakob and I and others were kind of developing and memeing out over the quarter was like, what if active inference only works for like one or two time steps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.143,
    "end": 4551.333,
    "text": "And as we consider deeper and deeper, even potentially two in the most extreme versions of the meme, that the combinatorics of decision-making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.095,
    "end": 4569.89,
    "text": " in principle and or in practice become challenging to evaluate and compute like the computational complexity grows potentially extremely rapidly considering even two moves deep so to speak",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.55,
    "end": 4574.534,
    "text": " We've seen several approaches to dealing with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.834,
    "end": 4582.923,
    "text": "Well, first is the continuous time approximation of active inference, where there is no explicit time series prediction of future time points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.264,
    "end": 4588.029,
    "text": "There's just like a Taylor series approximation based upon the generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.491,
    "end": 4604.644,
    "text": " Other approaches we've seen are deep active inference, just rolling out that prediction to deeper and deeper time points anyway, and then utilizing heuristics and other algorithmic approaches to ameliorate that combinatoric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.145,
    "end": 4605.925,
    "text": "And we've also seen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.966,
    "end": 4622.6,
    "text": " sophisticated or hierarchical active inference modeling where potentially at two or more hierarchically nested scales of the model, still only one or two time points or only a few time points have to be reflected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.121,
    "end": 4628.706,
    "text": "So it'd be like to predict out 100 years, one could have a model with a temporal depth of 100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.032,
    "end": 4637.074,
    "text": " or there could be 10 time points, each consisting of a decade of 10 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.814,
    "end": 4641.955,
    "text": "And so then that could even be broken down further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.935,
    "end": 4657.979,
    "text": "And so when Alex was talking about the way in which there's an imperative to act in an adaptive way, to not die and to live and to thrive and to serve, of course,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.602,
    "end": 4665.425,
    "text": " But in many cases, there are some challenges associated with decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.966,
    "end": 4675.611,
    "text": "We don't have the ability to do A-B testing or null hypothesis or even just alternatives over very long timescales over certain timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.051,
    "end": 4705.107,
    "text": " levels of organization it might be possible to do for an event that's rapid or has a lot of individuals engaging with it like a website a b testing might work super well if 100 people are looking at the website every day whereas in organizational design there isn't that much of the same affordance and it speaks to the way in which our multiple nested time scales of updating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.809,
    "end": 4715.456,
    "text": " hopefully provide clarity so that we don't need to be at the fast cycle trying to predict out 100 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.357,
    "end": 4724.864,
    "text": "But with increasingly deep hierarchical temporal models, we might be able to act adaptively in a multi-scale way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.365,
    "end": 4732.151,
    "text": "So for example, in 2021, we were planning heavily on the quarter timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.55,
    "end": 4739.753,
    "text": " we introduced and assembled our scientific advisory board, which began operating in 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.453,
    "end": 4748.177,
    "text": "And that was explicitly after one year of operations, expanding our temporal horizon to the one year timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.013,
    "end": 4769.285,
    "text": " now with the kind of architectural updates that the ACT Institute is providing and necessitating we're thinking beyond one year explicitly because questions like who can elect who in the organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.29,
    "end": 4773.211,
    "text": " they do play out over slower and slower timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.071,
    "end": 4792.715,
    "text": "So it's been quite interesting, even mostly qualitatively to be applying and transferring what we're learning about multi-scale decision-making under uncertainty from active inference, which is kind of what it's about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.153,
    "end": 4804.241,
    "text": " and apply it in the organizational multi-scale context with the participant and the projects and teams and the institute scale and the community and the niche scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.041,
    "end": 4812.067,
    "text": "And so it's already been very rewarding and we hope effective to in a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.213,
    "end": 4837.632,
    "text": " principled way bring our learnings and ideas about organizational design and the vast experience that so many participants do bring to the table on these issues and coordinate around carrying that out in the active inference ontology in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.559,
    "end": 4866.741,
    "text": " and using other pieces of the puzzle that aren't now or in the future even necessarily part of the active inference ontology a lot of those features we derive from systems thinking active inference isn't a project management approach so there's gonna have to be like more than just the active ontology to carry out effective team management but that's why we use multiple ways of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.038,
    "end": 4869.079,
    "text": " learning and researching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.94,
    "end": 4882.674,
    "text": "So it just was very interesting how some of the theoretical discussions that we were having literally about multi-scale planning in multi-agent act-inf simulations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.707,
    "end": 4889.311,
    "text": " and the kind of cognitive complexity that needs to happen on board the entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.892,
    "end": 4895.136,
    "text": "What is their actual cognitive complexity and awareness and affordances versus how are we going to simulate it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.697,
    "end": 4899.1,
    "text": "How do we prevent the simulation from like sneaking in extra information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.12,
    "end": 4910.971,
    "text": "How do we think about the role of stigmergy and the modifications of the niche and the cognitive offloading that could happen in a multi-agent setting or in a stigmergic context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.129,
    "end": 4932.311,
    "text": " that is in tight feedback with the ways in which we're also structuring our own niche and a lot of that really started to take an acceleration point in the last several months",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.43,
    "end": 4939.115,
    "text": " with Jakob's contribution of active block friends and other individuals' contributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.337,
    "end": 4949.103,
    "text": "And the seeds were planted in the work even before ActInfLab existed with Vyotkin et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4949.123,
    "end": 4953.928,
    "text": "2020 on active inference and behavior engineering, systems thinking and remote teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4954.708,
    "end": 4958.972,
    "text": "So it is a long game",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.319,
    "end": 4962.2,
    "text": " but then long compared to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.66,
    "end": 4982.751,
    "text": "it's just the game it is and multi-scale decision making with diverse perspectives over multiple spatial and temporal scales are not like the end point or some hot take that is our starting point for planning as inference and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.452,
    "end": 5002.285,
    "text": " I hope that all these threads can just continue to develop over the time scales that are appropriate and that we can connect with the participants who are interested for those who see that high quality engagement and relationship building and development",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.366,
    "end": 5027.152,
    "text": " are worthwhile in terms of epistemic and pragmatic value and sometimes that takes multiple years to approach this exciting and developing topic which is changing month by month as our guest streams just recently have been highlighting so for those who feel uncertain about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.837,
    "end": 5053.192,
    "text": " participating they feel some impulse to get involved now watching live stream or in the future yes it's easy and absolutely valid to feel busy and like it's an affordance that's not immediately preferable and i'm not saying drop everything and join act institute however again we hope that those who have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.343,
    "end": 5058.227,
    "text": " paid attention to what we've shared today and hopefully continue to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.148,
    "end": 5074.063,
    "text": "And for those who resonate with the approach that we're taking, adaptively resonate with the strategic vision and with the increasingly clear and numerous affordances for learning and researching,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.864,
    "end": 5086.534,
    "text": " We hope to connect with you, individuals, and create services that scale even beyond those who get very active in the Institute itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.815,
    "end": 5091.959,
    "text": "And so much more is to come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.559,
    "end": 5101.807,
    "text": "Again, it has been quite a ride in the last six quarters, and people can check our quarterly roundtable meetings, which are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.027,
    "end": 5124.401,
    "text": " slides are being modified up to the day basically and they're like an honest representation of how things are developing our uncertainties around different uh developments in the lab we have nothing if not honesty and clarity and vision so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.339,
    "end": 5132.782,
    "text": " There's no clean way to end it when one has walked this deep down the plank.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5133.062,
    "end": 5149.653,
    "text": "But I'll just again, you know, appreciate everyone who's helped in every way to get us to this point from the people who like first were enthusiastic about the idea of an active inference lab in the beginning of 2021 and end of 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.468,
    "end": 5170.371,
    "text": " more than a year before the textbook when it was and still to some extent is an assemblage of papers with partially overlapping focus and ontology uses and notation and amidst that uncertainty some people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.272,
    "end": 5193.647,
    "text": " did step up and they acted and they inferred and they served and now we're starting another chapter and the logo doesn't change and everything else is just continuing to develop so it's been a great ride and thanks again to everybody who even as just a listener for now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5194.69,
    "end": 5222.619,
    "text": " has been involved in some way in really being a part of the embodiment and the inaction of act inf lab slash act institute so just expect and prefer epistemic and pragmatic value and may the gradient be with you any last comments or we can end it there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5229.355,
    "end": 5229.596,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.239,
    "end": 5230.862,
    "text": "Thank you, fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.404,
    "end": 5231.806,
    "text": "See you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.132,
    "end": 5233.273,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]