[
  {
    "start": 8.459,
    "end": 38.299,
    "text": " hello and welcome everyone this is active inference guest stream number 55.1 it's august 30th 2023 today we are going to have a presentation followed by a discussion on geometric constraints on human brain function by james pang and alex fornito thank you again for joining really looking forward to the presentation and the discussion so please off to youtube to introduce yourself and continue however you like thank you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.859,
    "end": 40.96,
    "text": " Well, thanks very much, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.9,
    "end": 43.141,
    "text": "My name is Alex Fornita.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.281,
    "end": 49.623,
    "text": "I'm based in the School of Psychological Sciences and the Turner Institute for Brain and Mental Health at Monash University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.883,
    "end": 54.725,
    "text": "And I'm here with James Penn, who is a research fellow working in the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.805,
    "end": 61.047,
    "text": "And so the idea today was that we were going to talk a little bit about this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.387,
    "end": 67.909,
    "text": "I'll begin by providing a bit of a historical and theoretical background, and then James will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.624,
    "end": 73.309,
    "text": " take over and jump into the specifics of what we did and what we found.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.911,
    "end": 92.366,
    "text": "We're assuming some basic understanding of neuroscience and some elements of human brain imaging and we'll go through a little bit of maths but hopefully it'll be enough to give a picture and if there's any questions about it afterwards we'll be happy to try and answer them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.321,
    "end": 103.863,
    "text": " So a key motivating factor for this work is really trying to understand how the structure or anatomy of the brain constrains its function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.403,
    "end": 112.465,
    "text": "And if you look at a diverse range of systems found throughout nature, we know that the structure of the system constrains its dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.505,
    "end": 121.047,
    "text": "So for example, the shape of a racing car will influence its aerodynamics and how fast it can go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.766,
    "end": 131.007,
    "text": " folding patterns of a protein will influence the other proteins that it can interact with and have quite large effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.067,
    "end": 138.589,
    "text": "So here, for example, we've got an example of the hemoglobin protein in a healthy person and someone with sickle cell anemia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.009,
    "end": 143.69,
    "text": "And this change in the geometry of the protein leads to a 20 year difference in life expectancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.49,
    "end": 150.291,
    "text": "And here we've got the molecular structures of diamond and graphite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.571,
    "end": 151.691,
    "text": "So both of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.372,
    "end": 155.173,
    "text": " materials are made of the same atoms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.193,
    "end": 156.654,
    "text": "They're all purely carbon atoms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.774,
    "end": 159.216,
    "text": "It's just the bonds between them that are different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.876,
    "end": 166.459,
    "text": "And that difference is sufficient to create quite a variation in the properties of the material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.499,
    "end": 172.262,
    "text": "So diamond being one of the hardest substances on earth and valued at somewhere between 12 to $90 million per kilo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.07,
    "end": 178.451,
    "text": " whereas graphite is one of the most brittle and only cost you about $20 per kilo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.351,
    "end": 187.033,
    "text": "And so this is essentially the reason why we don't propose to people with a H2B pencil, we use diamond rings instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.874,
    "end": 191.694,
    "text": "Now, the brain is no different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.874,
    "end": 201.316,
    "text": "We think anatomy constraints function, but there has been a longstanding debate about the specific properties that are the most relevant and how we should best conceptualize them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.717,
    "end": 203.417,
    "text": "And this can be traced back to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.206,
    "end": 210.811,
    "text": " The days of Ramani Kahal and Kamila Golgi, two people considered to be some of the founding fathers of modern neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.431,
    "end": 217.095,
    "text": "Golgi developed a technique for staining neurons that allowed you to visualize their structure under the microscope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.715,
    "end": 229.644,
    "text": "And Kahal really perfected that technique and studied the nervous system in extensive detail and really laid down the foundations for what we think about the anatomy of the brain to this day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.365,
    "end": 236.49,
    "text": " Now, both of these men were recognized for their efforts in 1906 with a Nobel Prize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.051,
    "end": 243.457,
    "text": "But even at the award ceremony, when giving their lectures, they were in bitter disagreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.057,
    "end": 256.97,
    "text": "So if you actually look at the recordings of their lectures, Cahal says, we applied Golgi's method and our observations revealed, in my opinion, the terminal arrangement of the nerve fibers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.441,
    "end": 261.923,
    "text": " Nerve elements possess reciprocal relationships in contiguity, but not in continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.604,
    "end": 276.091,
    "text": "So here he's saying that cells are fundamentally discrete elements separated in physical space and that there's a gap between them at the synapse, the synaptic cleft, and signaling occurs through this gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.312,
    "end": 280.133,
    "text": "Golgi, on the other hand, didn't agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.594,
    "end": 286.737,
    "text": "He said, while I admire the brilliancy of the doctrine, which is a worthy product of the high intellect of my illustrious Spanish colleague,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.253,
    "end": 292.397,
    "text": " I cannot agree with him on some points of an anatomical nature which are for the theory of fundamental importance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.958,
    "end": 298.862,
    "text": "I found myself unable to follow the current of opinion because I was confronted by one concrete anatomical fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.643,
    "end": 304.327,
    "text": "This was the existence of the formation which I have called the diffuse nerve network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.187,
    "end": 308.41,
    "text": "And so for Golgi, all the cells were continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.45,
    "end": 310.311,
    "text": "They form one continuous network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.351,
    "end": 310.932,
    "text": "There was no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.391,
    "end": 317.397,
    "text": " point of separation between them and signaling occurred through this continuous network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.278,
    "end": 329.448,
    "text": "Now, ultimately, a growing body of evidence, and you can see it in Golgi's statements, was starting to favor Cahal's model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.154,
    "end": 341.022,
    "text": " But really it was only resolved in the 1940s with the advent of electron microscopy where people could actually resolve synapses and saw that they were spatially disjoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.063,
    "end": 350.309,
    "text": "And this ultimately established the neuron doctrine as the fundamental theory about how the nervous system is organized at a cellular level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.588,
    "end": 369.562,
    "text": " And this basic idea that we can divide the brain up into discrete units was then carried through to different scales, most famously by Corbinian-Brodman, who developed a parcellation of the cortex based on cytoarchitectonic grounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.283,
    "end": 381.432,
    "text": "His idea was that different parts of the cortex have different cellular properties, and so they define these discrete areas that are functionally specialised in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.924,
    "end": 388.166,
    "text": " And certainly this has been a very influential idea in neuroscience ever since.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.926,
    "end": 397.209,
    "text": "But around the same time, in fact, a couple of years earlier, the neurologist Alfred Campbell published his own cytoarchitectonic map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.069,
    "end": 411.774,
    "text": "And he agreed that you could identify discrete boundaries largely in primary zones, but then in the cortex in between, it was a lot more difficult to find sharp outlines or boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.324,
    "end": 417.708,
    "text": " And he suggested that actually the changes were more gradual or continuous in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.37,
    "end": 432.4,
    "text": "Brodmann's view became more popular and certainly became sort of the dominant theory in neuroscience, even though subsequent attempts to try to replicate it were different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.42,
    "end": 437.224,
    "text": "And so different anatomists would parcellate the brain in different ways, using different boundaries and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.785,
    "end": 439.926,
    "text": "But nonetheless, this kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.826,
    "end": 465.058,
    "text": " congruence between the discrete model of Cajal and the discrete model of Brodmann eventually led to the idea that you know essentially we can think about the brain as a multi-scale network where at the cellular level we can identify discrete cells that are connected by synapses then we can scale up at the population level at a mesoscale resolution and identify how population of cells are linked by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.178,
    "end": 467.078,
    "text": " bundles of axons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.759,
    "end": 479.001,
    "text": "And then all the way through to the macro scales, which is what you sort of see when you look at one of Brodmann's maps, you have these broad, roughly pseudo-architectonic areas connected by white matter bundles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.542,
    "end": 487.103,
    "text": "And in the last two or so decades, we've had the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.138,
    "end": 497.024,
    "text": " measurement techniques for characterizing these networks on a vast scale and there's been a pretty well established pipeline for mapping these networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.685,
    "end": 513.056,
    "text": "So the basic idea is that we have the brain, we divide it up into these discrete areas and they act as our network nodes and then for every pair of nodes we measure some aspect of structural or functional connectivity between them, functional connectivity being some aspect of coupling and activity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.11,
    "end": 517.612,
    "text": " And then we can represent that in the form of a connectivity matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.872,
    "end": 520.353,
    "text": "So each row and column represents a different region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.413,
    "end": 528.017,
    "text": "And each element tells you about the type and strength of connectivity between areas that can equivalently be represented as a graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.217,
    "end": 537.042,
    "text": "And then with that graph representation, we can apply all sorts of different analytic tools to understand different aspects about how the network is connected and organized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.905,
    "end": 546.409,
    "text": " And this basic approach has been used quite extensively to understand how the underlying anatomical properties of the network constrain function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.229,
    "end": 548.59,
    "text": "This is one of my favorite examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.63,
    "end": 552.852,
    "text": "This was a study of two different worms, C. elegans and P. pacificus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.913,
    "end": 557.715,
    "text": "Both of their nervous systems in the head have been mapped at the level of each cell and synapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.215,
    "end": 559.295,
    "text": "And they're actually identical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.335,
    "end": 560.076,
    "text": "So they've got the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.731,
    "end": 562.772,
    "text": " type of cells, the same number of cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.312,
    "end": 565.412,
    "text": "It's just the connectivity between them that's different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.432,
    "end": 569.214,
    "text": "And that's what you see in this network projection here, that the topology of the network's different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.034,
    "end": 583.918,
    "text": "And in this study, they showed that changes in the connectivity of just two hub neurons were sufficient to elicit a difference in the behavior of the animals such that P. pacificus is a predator of C. elegans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.958,
    "end": 587.459,
    "text": "And here you can see Pacificus eating poor C. elegans for lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.963,
    "end": 597.406,
    "text": " Now, we can't lock humans up in a room and see who eats who and try to understand how their anatomy constraints function in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.446,
    "end": 604.789,
    "text": "But we can do things like use MRI to measure anatomical connectivity and functional connectivity and correlate the two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.869,
    "end": 608.811,
    "text": "And that's pretty consistent finding that we generally find there is a correlation between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.141,
    "end": 619.247,
    "text": " We can run computational models where we have a structural network, we simulate the activity, then we apply, say, a lesion to that network and look at the effects on the activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.287,
    "end": 627.933,
    "text": "And we can show, for example, that if you lesion a hub area, you have quite a dramatic impact on brain function compared to if you lesion a more weakly connected non-hub area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.313,
    "end": 630.574,
    "text": "Or we could use clinical studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.614,
    "end": 636.258,
    "text": "We could look at cases where there are naturally arising lesions through stroke or some other form of brain damage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.08,
    "end": 640.241,
    "text": " and we can understand the functional impairments that result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.261,
    "end": 654.487,
    "text": "So for example, in this case, people with lesions to certain types of hub areas with diffuse connectivity showed much more generalized cognitive impairments than people with lesions to areas with more specific patterns of connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.55,
    "end": 657.23,
    "text": " So this is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.35,
    "end": 665.595,
    "text": "This has been really informative and great for understanding the role of individual brain regions or connections in brain function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.255,
    "end": 674.52,
    "text": "But it doesn't really give us a coherent, unified perspective about how dynamics emerge from the underlying structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.56,
    "end": 675.941,
    "text": "It's all a little bit piecemeal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.301,
    "end": 683.285,
    "text": "If we want to develop such a coherent understanding, we can draw some inspiration from different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.293,
    "end": 695.42,
    "text": " of physics and engineering, where typically the structural constraints on the dynamics of a system are studied by understanding the eigenmodes of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.176,
    "end": 702.597,
    "text": " Now the eigenvalues of a system are found by solving an eigenvalue problem such as this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.157,
    "end": 713.799,
    "text": "So an eigenvector we can think of as something that we measure about a system that doesn't change its direction if it's subjected to some kind of transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.459,
    "end": 717.5,
    "text": "So if that's the case, then this equality holds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.68,
    "end": 724.661,
    "text": "So the idea here is that psi is our vector, something we measure about the system, subjected to some transformation L,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.467,
    "end": 733.691,
    "text": " And if psi is an eigenvector, then the transformed eigenvector is equal to the eigenvector just scaled by some value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.931,
    "end": 739.173,
    "text": "So the transformation can scale the vector, but it doesn't change its direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.034,
    "end": 745.756,
    "text": "And so if that's the case, then this scaling factor lambda is what we call an eigenvalue and psi is an eigenvector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.197,
    "end": 751.899,
    "text": "This kind of equation is applied to a lot of different systems, a lot of different contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.469,
    "end": 769.854,
    "text": " But when we're studying the eigenmodes of a system, typically our L term here is an operator called the Laplacian operator, which essentially describes how smoothly some kind of structural property of the system varies through an appropriate spatial embedding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.495,
    "end": 780.938,
    "text": "So I'll come back a little bit to what that means, because we can make different choices for what we use in L, and that determines the specific anatomical properties that we prioritize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.23,
    "end": 788.992,
    "text": " But for now, I just want to emphasize that a key property of these eigenvectors is that they're orthogonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.572,
    "end": 797.874,
    "text": "And so then we can use them as a basis set for reconstructing different activity patterns that we might see in the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.695,
    "end": 805.116,
    "text": "So I guess the most famous example of a basis set that many people will be familiar with is a Fourier set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.683,
    "end": 814.751,
    "text": " So, for example, here we have some one dimensional signal and we can decompose that signal as a weighted sum of sine and cosine functions of varying frequencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.372,
    "end": 824.62,
    "text": "So here you've got the different functions, different frequencies, and here you've got some weighting factors and we can reconstruct this signal as a weighted sum of these functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.961,
    "end": 829.344,
    "text": "In a similar way, we can extract our eigenmodes of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.08,
    "end": 832.042,
    "text": " based on some particular anatomical property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.062,
    "end": 840.73,
    "text": "And we end up with these spatial patterns here that are organized, again, in terms of spatial frequency or the wavelength of fluctuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.77,
    "end": 848.218,
    "text": "So here you can see you've got a very low frequency fluctuation moving from back to front, top to bottom, medial, lateral.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.278,
    "end": 852.382,
    "text": "And then as you move up, you get these more high frequency fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.595,
    "end": 859.158,
    "text": " And so then we can use these patterns to reconstruct any spatial map that we observe on the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.178,
    "end": 863.52,
    "text": "So it could be a map of brain activity recorded during a particular task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.54,
    "end": 868.023,
    "text": "It could be, say, a map of cortical thickness variations or gray matter volume variations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.783,
    "end": 872.585,
    "text": "It's sufficiently general to allow you to reconstruct any type of map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.306,
    "end": 875.467,
    "text": "And so we can do that just as a weighted sum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.487,
    "end": 882.451,
    "text": "So here Y represents our map, and then we represent that as a weighted sum of our modes with the A coefficients representing the weights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.144,
    "end": 899.091,
    "text": " And people, oh, sorry, I should emphasize that that explanation can be a little bit abstract for people who aren't familiar with Eigenmodes, and it is always a bit of a challenge to get an intuition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.171,
    "end": 907.476,
    "text": "And so you can do what one of the people in the team did and ask ChatGPT to explain Eigenmodes to a 10-year-old, and it turns out that it does a pretty good job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.516,
    "end": 910.057,
    "text": "I was quite happy with this explanation, so I thought I'd share it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.218,
    "end": 915.54,
    "text": "So ChatGPT says, of course, let's imagine we have a wobbly, jiggly ball of jelly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.069,
    "end": 917.85,
    "text": " when you poke it, it wiggles and shakes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.631,
    "end": 922.413,
    "text": "Now imagine if you poke the jelly in different spots or with different amounts of force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.713,
    "end": 926.256,
    "text": "Each time you poke it differently, the jelly wiggles and shakes in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.276,
    "end": 930.859,
    "text": "Eigen modes are like those different ways the jelly wiggles and shakes when you poke it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.5,
    "end": 937.043,
    "text": "So essentially seeing this video here, the jelly is poked and it wobbles in a particular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.183,
    "end": 943.407,
    "text": "If you poke the jelly in a different spot or with a different amount of force, you'll trigger a different pattern of vibration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.266,
    "end": 949.35,
    "text": " And so commonly, eigenmodes are used in the context of systems that vibrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.95,
    "end": 955.574,
    "text": "And the idea is these eigenmodes correspond to preferred patterns of vibration when the system is perturbed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.175,
    "end": 960.258,
    "text": "And those preferred patterns are just dictated by the structural properties of that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.016,
    "end": 971.58,
    "text": " We can extend it more generally and think about it more as how a system responds to any type of excitation and how an excitation spreads through some connected system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.64,
    "end": 978.323,
    "text": "And the eigenmodes correspond to the preferred patterns of excitation, again, determined by the physical properties of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.584,
    "end": 990.327,
    "text": "So naturally, given everything we've been talking about and these ideas that the brain is a multi-scale network, we need to make a choice about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.992,
    "end": 997.197,
    "text": " how we define alloplastia and what specific anatomical properties are we going to extract our eigenmodes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.897,
    "end": 1001.6,
    "text": "And so a natural choice would be to extract them from brain connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.46,
    "end": 1005.402,
    "text": "And we can do this quite in a reasonably straightforward way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.462,
    "end": 1008.204,
    "text": "We get some map of the connections in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.725,
    "end": 1012.007,
    "text": "We map connectivity between every pair of nodes after we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.458,
    "end": 1013.88,
    "text": " apply some discretization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.92,
    "end": 1015.261,
    "text": "We define our discrete nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.301,
    "end": 1016.963,
    "text": "We map every pair of connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.784,
    "end": 1019.486,
    "text": "We represent that in the form of a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.766,
    "end": 1022.609,
    "text": "And then we extract this quantity here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.729,
    "end": 1024.251,
    "text": "It's called a graph Laplacian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.952,
    "end": 1028.436,
    "text": "The details are not so important, but that's essentially our L operator here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.956,
    "end": 1034.963,
    "text": "And it describes how smoothly connectivity varies as we move from node to node in the network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.131,
    "end": 1049.056,
    "text": " And when we do that, several studies have shown that you can use the eigenmodes extracted from this graphyloplasm to reconstruct kind of classic functional networks that you record with functional MRI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.236,
    "end": 1055.038,
    "text": "We can reconstruct different patterns of functional connectivity between pairs of areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.819,
    "end": 1059.0,
    "text": "You can use it to reconstruct different EEG signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.7,
    "end": 1066.743,
    "text": "And people have even shown that you can make predictions about the pattern of neurodegeneration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.247,
    "end": 1069.888,
    "text": " that you see in different forms of dementia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.488,
    "end": 1083.43,
    "text": "So this has been really fantastic, important work and a really important proof of principle that this Eigenmode framework can be used to understand how the structure of the system constrains its dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.031,
    "end": 1090.252,
    "text": "And in each case, the interpretation is that these dynamical patterns that we see with fMRI or EEG or so on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.445,
    "end": 1097.509,
    "text": " are reflecting excitations of these underlying eigenmodes or the resonant modes of the anatomy of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.19,
    "end": 1106.074,
    "text": "This view very much aligns with what we would think of as a classical view of brain organisation that I've just been discussing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.154,
    "end": 1120.682,
    "text": "So following from Cahal and Brodmann's work, the idea is that at lots of different scales, we can divide the brain up into discrete areas, they're connected in some way, and it's the signalling along these connections between these discrete areas that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.307,
    "end": 1122.167,
    "text": " drives activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.268,
    "end": 1138.932,
    "text": "But there are reasons to think that particularly at a coarser scale, so we know at the fundamental cellular scale, the network is discrete, but at coarser scales, perhaps a different set of approximations might be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.872,
    "end": 1146.414,
    "text": "So if you look at dense reconstructions of neuronal tissue, so this is say with electron microscopy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.93,
    "end": 1152.433,
    "text": " You find that cortical tissue is extremely dense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.473,
    "end": 1157.637,
    "text": "It's like a really rich, thick forest of cells and their processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.378,
    "end": 1174.208,
    "text": "And as we've talked about, there's been a lot of debate about where you can actually draw boundaries between discrete areas and how valid and reliable that is outside some kind of classic examples, say, in primary cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.429,
    "end": 1175.969,
    "text": "And if you look...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.71,
    "end": 1179.712,
    "text": " more deeply at the cellular organisation of specific regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.772,
    "end": 1184.835,
    "text": "Here on the left we've got the cellular organisation and on the right we've got a myelin stain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.435,
    "end": 1191.059,
    "text": "You see you get these deep penetrating fibres that are coming in from the white matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.279,
    "end": 1200.124,
    "text": "This is what this kind of classic graph approach will pick up because we define our nodes in the cortex and then we're mapping the connections that pass through the white matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.865,
    "end": 1204.527,
    "text": "But you can also see that there's a lot of connectivity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.148,
    "end": 1209.369,
    "text": " that's moving horizontally or tangential to the geometry of the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.01,
    "end": 1214.591,
    "text": "And so these horizontal connections allow for the continuous spread of activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.311,
    "end": 1222.293,
    "text": "So rather than activity jumping between discrete nodes, it can actually spread as a propagating wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.794,
    "end": 1229.656,
    "text": "And just to emphasize some of the limitations of the discrete model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.275,
    "end": 1239.757,
    "text": " Not long after Brodmann's work, just a couple of decades, the renowned physiologist, Lorente Deneau, was pretty emphatic about his concerns with the approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.257,
    "end": 1250.7,
    "text": "He said, the only really good cytoarchitectonic pictures are those of Campbell, who let me put in capital letters, as being the only cytoarchitectonist who has described facts and only facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.381,
    "end": 1258.402,
    "text": "The German cytoarchitectonist has mixed facts and theory in such a manner that nobody can tell where facts ends and theories begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.422,
    "end": 1258.462,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.856,
    "end": 1280.0,
    "text": " Again, this is just emphasizing the idea that while we might be able to define discrete areas that are mesoscopic or macroscopic resolutions in some cases, especially around the borders of primary sensory or motor areas, for large swathes of cortex, those distinctions become a little bit blurry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.06,
    "end": 1287.341,
    "text": "So an alternative approach has emerged out of neural field theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.987,
    "end": 1291.57,
    "text": " So neural field theory has been around for several decades now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.812,
    "end": 1296.995,
    "text": "And this is a different approach to thinking about cortical activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.256,
    "end": 1306.624,
    "text": "So the basic idea is that instead of dividing the brain into discrete specialised areas or nodes, we can treat the cortex as a continuous sheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.285,
    "end": 1310.608,
    "text": "And we're actually interested in trying to capture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.326,
    "end": 1315.007,
    "text": " how patterns of brain activity propagate through that continuous shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.708,
    "end": 1319.769,
    "text": "And so this is something that you can see in diverse types of electrophysiological recordings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.829,
    "end": 1326.211,
    "text": "So this, for example, this video is of the dynamics of voltage-sensitive dyes recorded in the mouse brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.811,
    "end": 1339.776,
    "text": "And you can see that you observe these propagating waves of excitation that move continuously through the cortex, rather than jumping from region to region, as would be implied by a kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.757,
    "end": 1341.978,
    "text": " strongly discrete model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.14,
    "end": 1350.303,
    "text": "So a big emphasis in neural field theory is on describing these wave-like propagation patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.584,
    "end": 1368.756,
    "text": "And it's been shown in recent theoretical work that if we accept that wave-like propagation drives neuronal activity, then really the eigenmodes that we should be extracting or prioritizing are those that are derived from the geometry of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.648,
    "end": 1383.094,
    "text": " So our eigenvalue becomes this problem here, where this operator here is called the Laplace-Beltrami operator, and it describes how smoothly the geometry or the shape or the curvature of the brain varies through space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.234,
    "end": 1395.459,
    "text": "And just to briefly explain why that's the case, here we've got the wave equation that's used in some forms of neural field theory, at least the versions that we've been focusing on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.159,
    "end": 1397.94,
    "text": "And so the basic idea is that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.493,
    "end": 1408.519,
    "text": " firing rate of a given population of neurons B at location R and T is given by the afferent field of incoming population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.539,
    "end": 1416.644,
    "text": "So other populations A. So we've got other populations providing this afferent field of activity that determines the firing rate of B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.264,
    "end": 1422.287,
    "text": " And obviously we then need to describe what this afferent field looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.687,
    "end": 1425.108,
    "text": "And that's given by this part of the equation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.128,
    "end": 1430.071,
    "text": "So on the left here, this set of terms describes how the field evolves through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.111,
    "end": 1431.412,
    "text": "We're not going to focus on that today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.432,
    "end": 1439.137,
    "text": "Over here, which is what we're interested in, where we've got how the field is evolving through space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.293,
    "end": 1446.697,
    "text": " And so here we can see our friend, the Laplace-Beltrami operator, which describes the geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.278,
    "end": 1450.72,
    "text": "And here we've got the length scale of axonal connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.74,
    "end": 1454.382,
    "text": "So in this model, we make a very simple assumption about connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.422,
    "end": 1459.846,
    "text": "We assume each point is connected to its neighbours in a distance-dependent and isotropic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.866,
    "end": 1463.028,
    "text": "And that distance dependence is roughly exponential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.148,
    "end": 1468.051,
    "text": "So the idea is that areas nearby to a given location R will have a strong influence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.632,
    "end": 1472.793,
    "text": " And that influence declines roughly exponentially as a function of distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.174,
    "end": 1478.475,
    "text": "And the speed of that decay is given by this R term here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.816,
    "end": 1483.177,
    "text": "You can see that geometry is firmly embedded in this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.557,
    "end": 1487.758,
    "text": "Now, I should point out this isn't something that's just been plucked out of thin air.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.818,
    "end": 1495.32,
    "text": "This is a damped wave equation that has been used for centuries to describe wave dynamics in all sorts of different media.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.901,
    "end": 1497.181,
    "text": "And so from that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.074,
    "end": 1504.336,
    "text": " we know very well that the geometry of the system constrains the spatial properties of wave propagation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.137,
    "end": 1508.898,
    "text": "And you can start from first principles of neuronal biophysics and derive this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.299,
    "end": 1520.962,
    "text": "And given all that work, we know that the eigenmodes of the Laplace Beltrami operator actually correspond to the standing waves of the dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.242,
    "end": 1522.242,
    "text": "So what are standing waves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.983,
    "end": 1526.484,
    "text": "So in this simple example, we've got two traveling waves here, a blue and a green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.421,
    "end": 1539.366,
    "text": " And as they interact with each other, you get these patterns of constructive and destructive interference represented by this red line here that cause these very large amplitude fluctuations that are fixed in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.226,
    "end": 1542.807,
    "text": "So they're not actually traveling like the original carrier waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.827,
    "end": 1543.827,
    "text": "They're fixed in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.047,
    "end": 1545.588,
    "text": "So that's why they're called standing waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.408,
    "end": 1548.069,
    "text": "And they're a nice example of resonance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.549,
    "end": 1555.972,
    "text": "So these fluctuations in the red trace are much larger in amplitude than the original carrier waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.36,
    "end": 1560.522,
    "text": " So it's an example of resonance where we're getting a larger response in the system than the energy that we put in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.562,
    "end": 1568.025,
    "text": "And just to convince you that this is something real, here, for example, we have a pool of water, a classic wave system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.565,
    "end": 1574.627,
    "text": "If you apply vibrations at a specific point in the pool, you see these waves that travel out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.067,
    "end": 1578.269,
    "text": "They hit the opposite wall, reflect back and start to interact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.709,
    "end": 1583.791,
    "text": "And then you see the emergence of these standing wave patterns that are fixed in space but show these very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.574,
    "end": 1587.776,
    "text": " large-scale amplitude fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.278,
    "end": 1592.76,
    "text": "Another classic example is the Chladni plate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.78,
    "end": 1602.566,
    "text": "So if you arrange dust particles on a plate and then you apply some vibration at a particular frequency, the dust particles will settle into these complex patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.487,
    "end": 1609.731,
    "text": "The pattern is determined by the specific frequency that you apply and specifically where you apply the vibration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.58,
    "end": 1614.381,
    "text": " and the pattern, the patterns correspond to the eigenmodes of the plate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.981,
    "end": 1623.103,
    "text": "And again, those patterns are determined by the physical properties of the plate, things like its stiffness, its geometry and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.203,
    "end": 1632.085,
    "text": "This is a little bit gratuitous, but you can extend the idea to three dimensions and you can actually cause the particles to levitate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.925,
    "end": 1633.705,
    "text": "Again, in this case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.509,
    "end": 1641.932,
    "text": " they're trapped within the nodal lines of sound waves that are being projected in three dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.493,
    "end": 1647.253,
    "text": "And this does have real world consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.653,
    "end": 1652.455,
    "text": "So this is a video of the Tacoma Narrows Bridge in the 1940s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.056,
    "end": 1657.837,
    "text": "The engineers didn't pay enough attention to eigenmodes and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.504,
    "end": 1665.389,
    "text": " on this particular day, crosswinds hit the bridge in just the right spots and at just the right frequencies to excite the eigenmodes of the bridge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.429,
    "end": 1672.714,
    "text": "So you trigger these resonant responses and create these large scale amplitude fluctuations that ultimately led to the collapse of the bridge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.697,
    "end": 1686.444,
    "text": "So hopefully that background has kind of illustrated that there's sort of two different views of thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.548,
    "end": 1694.432,
    "text": " which anatomical properties of the brain might be more important in constraining dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.033,
    "end": 1706.619,
    "text": "So on the one hand, we have the classical kind of connectome-centric view in which we view the cortex as comprising discrete areas, and dynamics are dominated by node-to-node transmission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.12,
    "end": 1716.245,
    "text": "The connectivity between areas is topologically complex and not homogeneous, and we very much think that that's very important, and so we prioritize measuring that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.43,
    "end": 1723.574,
    "text": " We don't really directly account for the spatial embedding of the network or its geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.714,
    "end": 1726.275,
    "text": "We can look at it secondarily, but it's not baked into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.876,
    "end": 1731.018,
    "text": "And because we're interested in connectivity, that means we need to measure it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.078,
    "end": 1741.885,
    "text": "So from a practical perspective, at least if you're dealing with mirror imaging data, you need a T1 weighted image to measure brain anatomy, but also diffusion MRI image to be able to measure brain connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.264,
    "end": 1753.226,
    "text": " The other perspective, which is a geometrically informed perspective that arises out of neural field theory, views the cortex as a continuous sheet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.306,
    "end": 1756.327,
    "text": "We're not making distinctions between different areas of the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.167,
    "end": 1763.708,
    "text": "We think dynamics are dominated by propagating waves of excitation, especially these mesoscopic and macroscopic scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.508,
    "end": 1770.31,
    "text": "We approximate connectivity between different points of the cortex as being homogeneous and distance dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.11,
    "end": 1771.91,
    "text": "So we know that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.52,
    "end": 1774.861,
    "text": " There is a strong distance dependent in connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.881,
    "end": 1776.521,
    "text": "It doesn't explain everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.601,
    "end": 1780.462,
    "text": "So some things are missed, but we know it's certainly an important feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.502,
    "end": 1783.283,
    "text": "So then the question is how far we can get with this approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.203,
    "end": 1793.485,
    "text": "And a nice feature of this approach is that we are directly accounting for spatial and geometric effects, the physical properties of the brain, which are overlooked by the connectome approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.625,
    "end": 1797.006,
    "text": "And a nice practical benefit of this approach is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.708,
    "end": 1801.472,
    "text": " Because we approximate connectivity in a simple way, we don't actually have to measure it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.012,
    "end": 1805.516,
    "text": "We can derive our basis set simply by looking at the geometry of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.556,
    "end": 1810.2,
    "text": "And so we only need a T1 weighted scan, which is very standard in MRI experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.262,
    "end": 1820.13,
    "text": "So hopefully that's set the scene for thinking about different anatomical constraints on the brain and which ones we might want to prioritise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.683,
    "end": 1830.19,
    "text": " I'll now hand over to James, who'll talk about how we went about testing these different ideas and try to understand which constraints might be more important for dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.892,
    "end": 1833.753,
    "text": "Thank you, Alex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1837.901,
    "end": 1843.223,
    "text": " I'm going to focus more on the things that we found in the paper that we recently published.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.303,
    "end": 1851.786,
    "text": "I think a lot of you have the link for it, but there's no, send us a message if you want us to forward the link.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.266,
    "end": 1861.249,
    "text": "So basically we start with, we try to answer and test the theory on which modes of the brain could best describe",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1862.071,
    "end": 1875.781,
    "text": " activity measured in fmi so we'll begin by how do we actually measure these modes so geometric modes are based on the t1 weighted image which is a standard imaging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1876.587,
    "end": 1899.996,
    "text": " tool that people use in the field and you can extract a model of the cortical surface here on the right and there's there are robust pipelines to do so and you can do that on a population average sense basically you get a group template of the surface or you can do that on an individual basis",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1902.392,
    "end": 1910.017,
    "text": " On the other hand, connector modes need diffusion MRI and structural MRI, but you need to kind of align the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1910.958,
    "end": 1915.641,
    "text": "And then we run a tractography pipeline, basically finding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.621,
    "end": 1936.773,
    "text": " connections between regions in the brain and then from there you can construct a vertex level or even region level connector matrix basically it's a matrix where each element represents the connection of one region or one vertex to another region or another vertex",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1938.138,
    "end": 1950.349,
    "text": " And you feed this cortical surface or this connector matrix in the eigenvalue problem equations that Alex has mentioned in the previous slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.471,
    "end": 1956.415,
    "text": "And then how do we test the performance of these geometric and connector modes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.715,
    "end": 1961.119,
    "text": "Basically, we focus a lot on fMI data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1962.188,
    "end": 1969.29,
    "text": " So there are several open access data sets that are available.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1970.09,
    "end": 1977.612,
    "text": "For example, the popular human connectome project, which roughly has about 1,200 participants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1977.632,
    "end": 1981.613,
    "text": "But we focus on the 155 participants who are completely unrelated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1981.673,
    "end": 1983.813,
    "text": "There are no twins and no siblings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.814,
    "end": 1987.975,
    "text": "And within the human connectome project data set,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1990.566,
    "end": 1995.248,
    "text": " For each subject, they have what we call task evoked data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.708,
    "end": 2007.852,
    "text": "Basically, these are functional activity that was recorded while each participant was performing a particular task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2007.932,
    "end": 2016.956,
    "text": "And HCP has a suite of seven different tasks, and within each task, several different contrasts within it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.956,
    "end": 2020.958,
    "text": " And then we also analyze resting state data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.098,
    "end": 2032.885,
    "text": "Basically resting state data is where the participant is just inside the scanner and just not doing anything and you just scan brain activity through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2033.445,
    "end": 2043.992,
    "text": "And you can construct a functional connectivity as well where each element of this matrix represents how correlated the activity is between two regions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.148,
    "end": 2050.149,
    "text": " We also analyze data from what we call NeuroVault.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.21,
    "end": 2056.691,
    "text": "It's an open access repository of thousands and thousands of different maps that people have contributed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2057.132,
    "end": 2063.213,
    "text": "And each map was acquired with distinct experimental protocols.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.334,
    "end": 2067.935,
    "text": "And we took about 10,000 of those from NeuroVault.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2069.355,
    "end": 2071.576,
    "text": "And again, it's a...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2072.691,
    "end": 2080.335,
    "text": " The level of heterogeneity in the different tasks is quite remarkable in the neuro board.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2080.535,
    "end": 2091.12,
    "text": "So we wanted to do our analysis on quite different tasks to make sure we are capturing something really meaningful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2092.634,
    "end": 2097.337,
    "text": " So just to remind yourselves of what we're going to do next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2097.417,
    "end": 2100.379,
    "text": "So basically, Alex already mentioned this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.899,
    "end": 2103.621,
    "text": "You extract, for example, the spatial map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.801,
    "end": 2105.242,
    "text": "Say that's the task evoked map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.702,
    "end": 2108.424,
    "text": "And we decompose that into different sets of eigenmodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.844,
    "end": 2113.668,
    "text": "So these patterns could be the geometric modes, or they could be the connective modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.808,
    "end": 2142.793,
    "text": " and it will be weighted by a coefficient a and the weights represent how each mode is expressed for that particular map and you can truncate the number of modes that you can that you want to use and then you can reconstruct back the uh the the data by just taking a linear sum of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2143.786,
    "end": 2147.373,
    "text": " the coefficient multiplied by the geometric or the connective modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.334,
    "end": 2152.161,
    "text": "So what did we find by doing these analyses?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.12,
    "end": 2159.907,
    "text": " So first, I'm going to show you this, how the spatial maps look like in terms of reconstruction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.568,
    "end": 2165.253,
    "text": "So on the left, I'm showing you the different tasks of spatial maps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.893,
    "end": 2170.138,
    "text": "And these are group average maps for the Human Connection Project dataset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.839,
    "end": 2173.481,
    "text": "And again, these are the seven tasks for the dataset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.62,
    "end": 2181.609,
    "text": " And then we asked, OK, if we use about 10 modes, how would the spatial map look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2181.689,
    "end": 2184.973,
    "text": "And for this result, we're focusing on the geometric modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.471,
    "end": 2188.713,
    "text": " So the reconstruction looks like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2189.393,
    "end": 2193.676,
    "text": "From afar, they look quite different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.856,
    "end": 2203.383,
    "text": "But if you actually look a bit closely, it already captures the kind of the large scale, core scale patterns that you can see from the data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2203.423,
    "end": 2208.007,
    "text": "For example, this relational map, you can clearly see the emergence of this big pattern.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.028,
    "end": 2212.431,
    "text": " Now, what happens if we incorporate more modes into it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.932,
    "end": 2214.894,
    "text": "So we increase the number of modes to 100.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2216.015,
    "end": 2222.261,
    "text": "And now you can see that the reconstruction almost looks like the empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.761,
    "end": 2231.069,
    "text": "But there are still subtle differences, especially in the more localized activity, for example, here in the arrows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.87,
    "end": 2251.093,
    "text": " and if we increase it further you can see that we can better capture those isolated localized patterns just by increasing it to 200 modes so you can see that the modes are actually really an efficient basis set for task of data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2251.914,
    "end": 2253.755,
    "text": " We do the same for resting state data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.775,
    "end": 2261.06,
    "text": "We increase the number of modes in here and compare the functional connectivity based from the empirical data and the reconstruction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.2,
    "end": 2266.983,
    "text": "And we see the same thing, that as you increase the number of modes to 200, we can capture the empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2267.804,
    "end": 2280.712,
    "text": "And you can do this in a more systematic way by calculating how well can we reconstruct the empirical data just by taking the correlation of the empirical and the reconstruction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2281.904,
    "end": 2308.22,
    "text": " in reconstructed maps as a function of an increasing number of modes and we see that indeed the reconstruction accuracy increases as we increase the number of modes and up to 200 we can get about you know 85 to 90 percent accuracy which is quite efficient given that we do the analysis on a but on a cortical surface",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2309.392,
    "end": 2328.612,
    "text": " with about 30 000 vertices so mathematically the maximum number of modes available to us is about 30 000 and using 200 out of the 30 000 we can already reconstruct the data quite uh efficiently and then we now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.658,
    "end": 2339.059,
    "text": " so we've shown that the modes are quite powerful and efficient in representing the data we now test the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2340.188,
    "end": 2351.314,
    "text": " hypotheses or the questions that Alex has laid a while ago, that are the geometric modes more parsimonious than the other anatomical modes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2351.994,
    "end": 2359.699,
    "text": "And when I say anatomical modes, again, we're focusing on the connector modes, which is based on the connectivity matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2360.339,
    "end": 2363.621,
    "text": "But we also test another anatomical mode based on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.697,
    "end": 2366.019,
    "text": " an EDR rule.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2366.26,
    "end": 2373.59,
    "text": "So an EDR rule is the exponential distance rule, which, as Alex has mentioned a while ago, which is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2375.689,
    "end": 2390.852,
    "text": " because the assumption of near-field theory is that the connections are very localized and also organized in a distance-dependent way, because specifically the connection weight changes exponentially as a function of distance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.312,
    "end": 2399.973,
    "text": "So we want to test that hypothesis on how dominant that exponential distance effect is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.253,
    "end": 2402.174,
    "text": "So for the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.852,
    "end": 2405.432,
    "text": " details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.893,
    "end": 2422.579,
    "text": "We just created a synthetic network based on a simple probability of connection following an exponential distance rule with a scaling factor or an exponent alpha, which we matched from empirical diffusion MRI data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.739,
    "end": 2447.82,
    "text": " and again there's a lot of uh empirical evidence of the existence of this exponential distance rule so it's not just a a hypothetical theoretical um kind of assumption we see the effect in macaques if you follow the weight uh as a function of distance from track tracing data and this is in uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.9,
    "end": 2456.664,
    "text": " logarithmic scale, you see this linear curve, which represents an exponential in linear coordinates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2457.305,
    "end": 2463.568,
    "text": "And we see the same with human diffusion MRI data, that the weight changes as a function of distance",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.067,
    "end": 2471.79,
    "text": " And even in other species like mouse, rats, marmosets, and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2471.81,
    "end": 2475.252,
    "text": "So this is a universal property found in a lot of different species.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.352,
    "end": 2486.378,
    "text": "So this exponential distance rule connectivity is actually empirically valid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2487.759,
    "end": 2498.372,
    "text": " So by using these three different anatomical properties, we can calculate the modes using the equations that Alexis mentioned a while ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2498.833,
    "end": 2506.982,
    "text": "You can get these geometric modes on the left, connector modes in the middle, and the modes from the exponential distance rule connectivity on the right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2507.924,
    "end": 2524.185,
    "text": " and again the modes are arranged in quite a unique way in that the first couple of modes will represent the lowest spatial frequency or patterns with very long special wavelengths and if you go further down you can get this high",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2524.786,
    "end": 2529.153,
    "text": " spatial frequency or short spatial wavelength patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.074,
    "end": 2537.567,
    "text": "So the basis set that the modes provide can capture different scales of the data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2539.13,
    "end": 2548.638,
    "text": " So how do these anatomical modes compare when we now reconstruct the different fMRI data that we have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.379,
    "end": 2559.367,
    "text": "So for resting state functional connectivity, we compared the three modes, again, by measuring the accuracy as a function of the number of modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.048,
    "end": 2564.211,
    "text": "And you can see that the geometric modes outperform both of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2565.492,
    "end": 2567.193,
    "text": " connectome and the EDR modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.794,
    "end": 2573.197,
    "text": "But you can see that the EDR modes are quite close to the geometric modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2573.857,
    "end": 2581.361,
    "text": "So again, suggesting that the fundamental effect that the EDR connectivity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.888,
    "end": 2586.11,
    "text": " that's in empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2586.15,
    "end": 2595.176,
    "text": "So it highlights the importance of this simple but important exponential distance through connectivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.816,
    "end": 2601.48,
    "text": "And we can see the same thing by reconstructing the different task activation maps that we have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.561,
    "end": 2632.201,
    "text": " i'm showing you here the difference so it's the geometric minus the connect them and geometric minus ddr reconstruction accuracies and red means the geometric modes are outperforming the the other anatomical modes so in all the data sets that we have the results are quite consistent so again it suggests that the geometric modes are more possible use than the other anatomical modes that we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2633.928,
    "end": 2647.109,
    "text": " And then we go a bit further on how do we actually use the concept of these modes in analyzing FMI activation maps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.379,
    "end": 2655.9,
    "text": " So I just want to explain a little bit of what traditional approach we have in brain mapping research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2656.44,
    "end": 2658.381,
    "text": "So for example, you do an experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2658.501,
    "end": 2664.622,
    "text": "You capture the activation map shown here for a particular task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.882,
    "end": 2676.564,
    "text": "And I'm showing you here the 1D version of that, so the value of the activation versus the vertex in this cortical surface.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2677.404,
    "end": 2693.639,
    "text": " so what traditionally what we do is to uh because we because we want to highlight we want people ask okay if a person does a particular task which regions of the brain are kind of driving those uh the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2696.445,
    "end": 2700.527,
    "text": " the behavioral performance that we have whilst performing a particular task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.547,
    "end": 2704.288,
    "text": "So what people usually do is to threshold these maps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.489,
    "end": 2709.71,
    "text": "And you can set threshold fairly arbitrarily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.451,
    "end": 2713.092,
    "text": "And then you can get these clusters of activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.972,
    "end": 2722.015,
    "text": "And we then make a conclusion that these clusters of activity are the ones kind of driving the behavioral",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2723.516,
    "end": 2734.414,
    "text": " effects that we see whilst performing a task and people can even go further and you know hone down exactly really really highly localized regions if you increase the threshold",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.506,
    "end": 2742.29,
    "text": " But if you go further back, we started from this whole brain activation map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2743.071,
    "end": 2755.98,
    "text": "You can clearly see that by thresholding, you're actually removing a lot of important, you know, activity patterns that are subthreshold, but they do exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.18,
    "end": 2760.302,
    "text": "So it's kind of like the analogy is, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2761.303,
    "end": 2780.749,
    "text": " by doing this this uh thresholding uh approach you're just looking just at the tip of the iceberg you're ignoring a lot of the important properties of the iceberg that are not seen by the threshold that you set so what we can do is to use the mode approach to actually look at um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.41,
    "end": 2790.591,
    "text": " and kind of look at the properties of all the activation maps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2791.332,
    "end": 2796.392,
    "text": "And here on the left, I'm showing you here the power of each mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.512,
    "end": 2802.914,
    "text": "So basically the weights that we obtained from the reconstructions that we had a while ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.834,
    "end": 2810.475,
    "text": "And this figure on the left shows you the results that we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2811.778,
    "end": 2815.222,
    "text": " on average for the Human Connecton Project dataset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.822,
    "end": 2819.546,
    "text": "And on the right is for the 10,000 maps from NeuroVol.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2820.367,
    "end": 2827.835,
    "text": "So what you can see here actually is most of the power is already contained within about 50 modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2828.676,
    "end": 2831.099,
    "text": "And if you remember, the modes represent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2832.631,
    "end": 2850.903,
    "text": " and each mode represents a different wavelength and they are arranged and that the first couple of modes represent this long spatial wavelength uh spatial structure so what this means is that actually in in fmi activation maps",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2852.026,
    "end": 2867.911,
    "text": " most of the power uh is is within those long wavelengths kind of suggesting that indeed but even by performing a particular task you you are actually activating this almost whole brain uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2869.268,
    "end": 2875.57,
    "text": " Yeah, so you can see this almost whole brain activity that, again, you will miss out if you do some thresholding effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2876.111,
    "end": 2890.236,
    "text": "And to further emphasize the importance of these long wavelength patterns, we did a simple experiment where we tried to remove, say, the first couple long wavelength modes, and that's the solid curve that you see in here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.076,
    "end": 2915.452,
    "text": " and by doing so if we start removing those long wavelength modes we the reconstruction accuracy completely drops even by just removing 25 of them but if we just remove the you know the short wavelength modes so starting from the right the effect on the reconstruction accuracy is not that uh significant so again alluding to the fact that these long wavelength nodes are really important",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2916.393,
    "end": 2924.547,
    "text": " uh and they describe uh the important structure found in the activation maps from fmi data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.576,
    "end": 2935.041,
    "text": " So again, we've shown how the modes can explain and represent spatial activation patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2935.682,
    "end": 2938.003,
    "text": "What happens with the dynamics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.984,
    "end": 2947.85,
    "text": "And the way we can do this is we go back to the crux of the neural field theory, which the geometric eigenmodes were based from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2948.81,
    "end": 2977.601,
    "text": " and your theory is very generalized you can you know construct different populations of excitatory inhibitory neurons and you can even connect the fellows and so on and so forth but the important bits to remember is that new field theory relies on the idea that activation propagates through space as waves and to simplify the the experiment that we want to do because we want to model the activity as a function of time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.062,
    "end": 2990.507,
    "text": " We just focus on the cortex and we simulate the equation based from the wave model and we tune the parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2991.247,
    "end": 2995.989,
    "text": "But if you look at the equation, there are only two parameters and we fixed one of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.229,
    "end": 3002.652,
    "text": "So basically the model is only relying on tuning one free parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.355,
    "end": 3009.926,
    "text": " And what we did was to compare that with a more sophisticated mirror mass model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3010.086,
    "end": 3013.252,
    "text": "So mirror mass models rely on the connectome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3013.493,
    "end": 3014.675,
    "text": "So basically you have regions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.629,
    "end": 3033.683,
    "text": " uh in the brain that they are connected and the connections are based from diffusion uh mri and each region will have its own dynamical properties so they evolve through uh through time uh so it relies a lot of this on this connection and again local dynamics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.823,
    "end": 3059.697,
    "text": " uh but it's important to highlight that this highly sophisticated model has about 19 parameters and we fix about 15 of those but we still need to kind of tune about four uh so in comparison to the wave model again don't wave model only has one and what we did was to how well can it recap recapitulate uh functional connectivity uh data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.542,
    "end": 3075.939,
    "text": " So here I'm showing you an example for the empirical functional connectivity that we have and the resulting model-based functional connectivity for both the wave and the mirror mass models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3077.1,
    "end": 3078.902,
    "text": "And we can kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3081.485,
    "end": 3108.907,
    "text": " quantify how well the the model based functional connectivity results uh stack up with respect to the empirical data in a in a variety of ways one can look at how well uh does the edge fc so basically each element of this matrix uh compares between the empirical and the model based data you can see that both models are you know performing quite similarly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.442,
    "end": 3133.34,
    "text": " can also look at the average connectivity within each region so basically you're taking the average of a row or a column and you can see that the wave model now outperforms the neuromass model by a bit and you can gain further because these properties the first two properties are based on static fc",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3134.381,
    "end": 3160.259,
    "text": " basically you're kind of averaging the effects across time but we also measured how well two models compare in capturing uh dynamical properties uh through time and you see that the wave model actually uh performs uh the neural mass model and so in summary for this is just to show that the simplicity of the wave model uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3161.462,
    "end": 3166.044,
    "text": " can capture a lot of these properties of functional data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.145,
    "end": 3180.152,
    "text": "Again, highlighting the idea that this wave evolving or traveling in space and time in the brain is probably a good approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3181.957,
    "end": 3188.482,
    "text": " We also simulated the effect if we stimulate, say, the visual cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.102,
    "end": 3196.968,
    "text": "So we just ping the visual cortex and allow the activity to propagate through space and time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3197.328,
    "end": 3199.169,
    "text": "And this will be the propagation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3199.189,
    "end": 3205.694,
    "text": "It starts from the visual cortex and then it goes to the frontal cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3206.555,
    "end": 3209.737,
    "text": "And I think I want to highlight one observation that we found is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3211.727,
    "end": 3231.742,
    "text": " we can see that when we started from the visual cortex the activity starts to separate into two and in the psychology and neuroscience literature people have actually found this effect and they call it the separation into the dorsal and ventral stream and each stream has important cognitive",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.763,
    "end": 3253.602,
    "text": " uh implications but people have uh tried to explain this separation by capturing the complex uh layer specific activities uh individual cortex but what this simple experiment that we have done has shown that maybe the geometry and the idea of waves propagating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3254.872,
    "end": 3265.175,
    "text": " could be sufficient in obtaining this kind of physiological effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3265.816,
    "end": 3275.759,
    "text": "And then we also tried to compare it with how well does it recapitulate the visual hierarchy that people have found in primates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3276.359,
    "end": 3280.06,
    "text": "For example, this work by in the last",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3282.915,
    "end": 3309.076,
    "text": " couple of years where they also did a simulation where they stimulated the visual cortex and what they found was if you followed regions along the visual hierarchy in the macaque cortex you see the activity patterns are kind of delayed in a hierarchical way so they follow the same kind of relationship as the visual hierarchy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3309.949,
    "end": 3310.93,
    "text": " So we did the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3311.19,
    "end": 3327.078,
    "text": "We compared the amplitude of the activity by matching the regions that people found in the visual hierarchy of the macaque cortex, and we tried to find the regions in the human brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.286,
    "end": 3330.567,
    "text": " And then we see the same effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3330.947,
    "end": 3342.255,
    "text": "And then when we compared it to a typical measure of hierarchy in the neuroimaging space by using the intracortical myelin map, which is just the ratio of T1 and T2,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3343.564,
    "end": 3366.214,
    "text": " we see the effect that the time to peak of these activation patterns well captures the rank of the infracortical myelin, again highlighting that indeed what we're getting is capturing this hierarchical kind of processing starting from the visual cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.795,
    "end": 3371.017,
    "text": "And I think the last result that I want to highlight is the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3372.895,
    "end": 3378.839,
    "text": " the subcortex, because again, the brain is not just the cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3379.299,
    "end": 3383.541,
    "text": "So what we did was to also calculate the modes from subcortical regions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.402,
    "end": 3388.004,
    "text": "And what we did was to mask the subcortical regions and perform the same",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.956,
    "end": 3414.03,
    "text": " solve the same equation using the low-plasmid primary operator and you can get these argument modes for the thalamus triatom and the hippocampus and we compared that to what we call in the field as functional gradients basically they are representations low dimensional representation of resting state fmi data so what we did was to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.407,
    "end": 3425.832,
    "text": " compare the geometric modes for the different subcortical structures and the different functional gradients based on fMRI data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3426.533,
    "end": 3429.094,
    "text": "And you can see that the modes are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3432.56,
    "end": 3439.866,
    "text": " almost in perfect correspondence with the functional gradients, and we see the same effect for the different structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3440.486,
    "end": 3452.676,
    "text": "Again, probably highlighting the idea that the geometric effects that we saw in the cortex are much more dominant in the subcortex, that geometry really constrains function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3456.359,
    "end": 3458.721,
    "text": "Just to tie things together,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.256,
    "end": 3462.818,
    "text": " what are the advantages of this approach that we found.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.239,
    "end": 3474.848,
    "text": "First, it's a more physical understanding of the relationship between structure and function based on ideas in physics engineering that has been used in the last century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.869,
    "end": 3478.991,
    "text": "The metric modes are only based on T1 rated images.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.712,
    "end": 3487.938,
    "text": "So it's very simple to perform and the analysis can be done by anyone with a structural T1 rated image.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3489.259,
    "end": 3511.199,
    "text": " and hence you can apply it in quite different experimental contexts in both humans other species health and disease and finally to summarize things i hopefully we've shown that geometric modes are indeed more parsimonious than other anatomical modes and this is confirming a lot of the predictions from theoretical",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3513.971,
    "end": 3525.493,
    "text": " calculations of near field theory and highlights the importance of treating the brain as this really physical system in correspondence with what people are doing in physics and engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3526.87,
    "end": 3551.218,
    "text": " uh but it also highlights the idea that the effects that we see in fmi might be dominated by the effect of the simple local and exponential distance rule connectivity however uh the the the contributions of long-range connections are still there but the what we're highlighting is maybe the uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3552.349,
    "end": 3558.171,
    "text": " their influence may not be observable with the resolution that we currently have with fMRI data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.891,
    "end": 3565.613,
    "text": "So it would be interesting to see and perform these experiments in a much more highly resolved, say, track tracing data from other species.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3567.953,
    "end": 3581.297,
    "text": "We found that evoked activity is dominated by these long wavelength modes, which challenges a lot of the traditional approach we have in the neuroimaging field, where we focus a lot on these focal activations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.401,
    "end": 3598.059,
    "text": " and that traveling waves shaped by geometry are sufficient to explain a lot of physiological phenomena by, you know, that they just emerged from the model and we didn't bake all these physiological phenomena into the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3599.12,
    "end": 3624.909,
    "text": " uh and finally the geometric constraints seem to be universally uh exist in both cortex and subcortex and that we can only we can use one single approach to study the you know the whole brain uh quite nicely and i just wanted both alex and i would like to thank all the other co-authors of the work it has been a truly multi-institute collaboration",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3626.039,
    "end": 3653.214,
    "text": " all the open access data set that we have used and if people are interested in doing our analyses we have written an open access uh software package uh repository in github you can access that in here so people can you know analyze modes in the brain in quite different contexts that they want to do and i think that's where we want to end thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3657.586,
    "end": 3657.966,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.106,
    "end": 3661.309,
    "text": "Well, thank you for the great presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3661.329,
    "end": 3664.231,
    "text": "A lot of places to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.932,
    "end": 3667.073,
    "text": "First, I'll pass to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.636,
    "end": 3671.476,
    "text": "Thank you, gentlemen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3673.198,
    "end": 3684.206,
    "text": "I first got wind of this paper through another individual in the active inference community, and I think I was the one that may have pounded the table that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3684.994,
    "end": 3687.834,
    "text": " We might want to do a guest stream on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.135,
    "end": 3691.655,
    "text": "And it's ticked the paper and really brought it to life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3692.195,
    "end": 3693.996,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.016,
    "end": 3697.956,
    "text": "I really appreciate it, especially some of the dynamic images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.616,
    "end": 3707.998,
    "text": "I think it really helps in terms of explaining what you guys were trying to do your work with and your subject matter on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3708.018,
    "end": 3708.998,
    "text": "So I'll just start with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.278,
    "end": 3711.079,
    "text": "I have some questions later on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3711.159,
    "end": 3713.039,
    "text": "But just first of all, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3714.872,
    "end": 3717.396,
    "text": " for a fantastic explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.459,
    "end": 3719.7,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.09,
    "end": 3729.013,
    "text": " When you present this in a neuroscience setting, what's a common response or reaction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.233,
    "end": 3739.658,
    "text": "From the introduction, I could really tell how careful you were to speak to the totality and the different threads in neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3739.698,
    "end": 3751.465,
    "text": "So after all that setup and all the statistical analysis that's presented, where does that put people in terms of their own understanding of the way that they've been doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.423,
    "end": 3756.265,
    "text": " complementary methodologies or orienting their research questions that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.706,
    "end": 3767.489,
    "text": "Yeah, I think generally people are, I mean, at least we found that people are quite interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.73,
    "end": 3778.734,
    "text": "I guess the approach is a bit different to how a neuroscientist would typically think about the brain, but kind of aligns with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.249,
    "end": 3784.77,
    "text": " how, say, you know, a physicist might now start approaching thinking about or modelling the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.33,
    "end": 3788.971,
    "text": "And so the work was really trying to bring those two kind of perspectives together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.691,
    "end": 3795.592,
    "text": "You know, I think, yeah, the reaction is usually kind of, yeah, this is really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3795.612,
    "end": 3801.193,
    "text": "You know, then how do I make sense of it or what I do practically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.213,
    "end": 3807.794,
    "text": "You know, there has been, I guess, there is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.747,
    "end": 3822.732,
    "text": " Some people might kind of split it artificially into this comparison of odd geometry versus connectivity, which is probably not the right way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.192,
    "end": 3834.436,
    "text": "The way we like to think about it is that we're sort of comparing two different models and each of those models makes certain approximations and prioritises different features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.896,
    "end": 3838.417,
    "text": "The approach we put forward in this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.201,
    "end": 3844.723,
    "text": " emphasises the role of geometry and it does have connectivity embedded in that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.003,
    "end": 3851.805,
    "text": "It's just a kind of simplified approximation of connectivity, this kind of homogeneous distance dependent kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.546,
    "end": 3856.347,
    "text": "Whereas, you know, typical connectome centric view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.025,
    "end": 3868.011,
    "text": " we'll try to capture all the complex connectivity, but we'll ignore also the horizontal connectivity that really is what drives activity spreading through the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.071,
    "end": 3869.192,
    "text": "That's completely ignored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.232,
    "end": 3881.879,
    "text": "And so really, you know, the idea behind this work was to kind of test in a way between these two approaches and, you know, see which one's approximations were kind of more useful in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.728,
    "end": 3887.83,
    "text": " Do you want to add something or I can make a comment there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3889.332,
    "end": 3892.516,
    "text": "No, finish this because then I'm going to ask my questions about the cello.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.157,
    "end": 3905.831,
    "text": "Yeah, well, the statistics was very clear and it was very interesting how with two different data sets, there were similar curves with also very different number of samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3906.914,
    "end": 3922.142,
    "text": " So it was almost like some of the statistical distributions were latched onto relatively early and then that like captured the big continent and a lot of the connections are local.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.242,
    "end": 3935.95,
    "text": "And this is of course a topic to explore about the molecular and the mechanistic electromagnetic basis and whether this, to what extent it represents traveling propagating electrochemical waves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.265,
    "end": 3961.891,
    "text": " and or loading heavily on simply diffuse local connections and and even the the blurry line between those two so it is really like a question about what is being captured because even the EDR with the spread captures a variance component related to local abundance direct fast acting connections",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.332,
    "end": 3985.974,
    "text": " in some regions and distant connections maybe over the days distal connections really do matter as as the the jello sets and things change but at the exact time scale that some of these patterns are happening at your work is showing new",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.027,
    "end": 4016.65,
    "text": " information and comparison with different ways it's been looked at yeah um i mean i think one of the things that it highlighted a lot even probably just in my head is we've been focusing a lot on trying to capture the effects of this complex connectivity right and we ignore",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4017.737,
    "end": 4022.16,
    "text": " all these lateral, horizontal, local, you know, diffusing connections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4023.541,
    "end": 4039.05,
    "text": "But what the work has now kind of shown, it highlighted the kind of maybe the issues that we have with fMRI, you know, because truly the both of these roles happen probably simultaneously, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4039.67,
    "end": 4041.772,
    "text": "But just the effects that we're seeing in fMRI,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4043.129,
    "end": 4068.257,
    "text": " is probably not the most efficient way to capture both worlds or it cannot hunt down the specifics of one world over the other uh in the results that we're getting is that the effects of this you know very localized connectivity probably dominates uh a lot of what we see there fmi uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.37,
    "end": 4096.64,
    "text": " time will tell if you know we improve the ways we capture brain activity that we can really kind of particularly focus on the different aspects or the approximations uh to me that's the kind of the beauty of the work it now highlighted these effects into the broader of our audience yeah I think that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4097.025,
    "end": 4103.21,
    "text": " The FM, I mean, you know, everything that we've presented is really addressing things that we were at measure with FMRI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.31,
    "end": 4106.213,
    "text": "So on pretty coarse spatial and temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.853,
    "end": 4119.964,
    "text": "There's some theoretical work suggesting that kind of, you know, the more complex aspects of connectivity that can't be explained by an EDR are playing an important role in supporting dynamic transitions between different brain states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.345,
    "end": 4125.969,
    "text": "But that would happen on a very rapid scale that could be missed with FMRI, or at least a typically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4126.556,
    "end": 4128.157,
    "text": " organized fMRI experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.877,
    "end": 4138.882,
    "text": "And so one thing we're interested in looking at further is trying to pick that apart a little bit and trying to isolate the functional contributions of those more complicated connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.504,
    "end": 4142.824,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.944,
    "end": 4143.264,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.425,
    "end": 4146.466,
    "text": "Can I ask about the metaphor of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4147.048,
    "end": 4149.53,
    "text": " the spoon tapping on the cello there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4150.651,
    "end": 4158.157,
    "text": "Metaphorically speaking, that seems like an external perturbation on something that can respond to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.239,
    "end": 4164.623,
    "text": "Now, you'll appreciate I'm asking from a very naive point of view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4165.163,
    "end": 4166.264,
    "text": "I'm comfortable with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4167.445,
    "end": 4170.268,
    "text": "Is there any difference then in terms of, say,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4171.101,
    "end": 4183.51,
    "text": " something that happens interoceptively, like something that's simply coming from within system, and does that show up in the same way as when there's a response to an external stimuli?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4185.772,
    "end": 4200.363,
    "text": "Yeah, so, you know, the actual underlying model, a key component that we haven't really talked about is that you have thalamocortical loops, and there's a driving input from the thalamus that influences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.035,
    "end": 4203.077,
    "text": " the wave activity in the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.097,
    "end": 4212.183,
    "text": "And, you know, they could be sensory thalamic nuclei or they could be interceptive inputs as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.844,
    "end": 4219.649,
    "text": "And they would be expected to drive cortical activity in different and, you know, spatially non-uniform ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4219.669,
    "end": 4226.314,
    "text": "You know, really distinguishing between those different types of inputs, as far as I'm aware, hasn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.806,
    "end": 4227.947,
    "text": " been modeled yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.127,
    "end": 4234.612,
    "text": "It's all been kind of at a simple level where you treat the cortex homogeneously and you have a single thalamic nucleus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.672,
    "end": 4236.393,
    "text": "I mean, some people have started to split them up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.894,
    "end": 4249.302,
    "text": "But, you know, that would be the underlying principle and the model could be extended in such a way that you could potentially distinguish between interoceptive and extraoceptive inputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.052,
    "end": 4253.772,
    "text": " Can I ask one more, Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4253.832,
    "end": 4259.774,
    "text": "I just want to add, for example, the visual cortex experiment that we performed, it's a really simple perturbation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4259.794,
    "end": 4263.214,
    "text": "But it could represent different types of perturbation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4263.674,
    "end": 4267.075,
    "text": "We just can't, you know, particularly capture at the moment, but it's like an overlying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4267.935,
    "end": 4271.236,
    "text": "If we perturb it in a certain way, this will be the effect that we see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4272.036,
    "end": 4272.496,
    "text": "But yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4273.016,
    "end": 4278.597,
    "text": "You must have known I was going to ask next thing because that was the direction I was going with that visual cortex example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4278.637,
    "end": 4278.777,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4279.817,
    "end": 4288.426,
    "text": " So from the active inference community, one of the things that we're always dealing with is surprise, say, versus sensory attenuation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4288.586,
    "end": 4297.695,
    "text": "And then on the third vertices, the seeming unawareness prior to the surprise or the attenuated state, but still available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4298.295,
    "end": 4303.06,
    "text": "And so I'm kind of curious, when you move away from the visual,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4304.912,
    "end": 4319.104,
    "text": " can you still have these sort of same waves going through the brain because other sensory uptake is causing that same, you get a surprising feeling like a sense of weightlessness perhaps, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.284,
    "end": 4326.29,
    "text": "Or you're, you're an astronaut and that's now something that you become attenuated to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.31,
    "end": 4326.391,
    "text": "What,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.331,
    "end": 4340.099,
    "text": " I know it kind of stuck with the fMRI, but it just seems so the possibilities in terms of what you guys are opening up just seems really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4340.639,
    "end": 4350.265,
    "text": "Is that something like the interoceptive thing where you can see this now opening up new areas of inquiry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4354.788,
    "end": 4357.07,
    "text": "Yeah, so I think there's some really interesting work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.177,
    "end": 4383.502,
    "text": " where people have looked at recursive neural nets structured in such a way that you can get wave-like propagation between the elements of the network and have shown that the systems that have that wave-like propagation, it actually facilitates their ability to predict what's happening in, say, a movie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.882,
    "end": 4385.483,
    "text": "So it improves their predictive performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.385,
    "end": 4400.148,
    "text": " physiologically, people have shown that, you know, just with simple visual stimulation, you get these back-to-front propagations, but there's also front-to-back propagations, which are presumably encoding the predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.808,
    "end": 4411.37,
    "text": "And so then the question is, how do the top-down predictions and the bottom-up sensory input get reconciled between the interactions of these waves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.911,
    "end": 4414.411,
    "text": "You know, I think these are kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4415.76,
    "end": 4420.262,
    "text": " really interesting ways forward that we're still coming to terms with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.322,
    "end": 4429.906,
    "text": "And we haven't really quite made sense of what the ways mean for computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.946,
    "end": 4439.049,
    "text": "I know that Peter Robinson, who's on the slide here, has written a couple of papers talking about how these fields can relate to predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.95,
    "end": 4442.891,
    "text": "But yeah, I think this is kind of a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.076,
    "end": 4471.846,
    "text": " very new exciting area that is worth exploring yeah one kind of connection there is like the standing wave that you showed in the physical water pool and so now when we're looking at a solid color visually there's some state and there's some stable non-equilibrium steady state or stable representation or stable population code or all these different things which which may not be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4474.221,
    "end": 4501.553,
    "text": " exhaustive or incompatible like at all but there's some standing wave now maybe that is component number 99 just like principal component 99 its amplitude might be small but there's like some mode that is that's ramping up and it's associated positively or it's ramping down it's associated negatively and and there's some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.916,
    "end": 4530.709,
    "text": " standing pattern that amidst the pelting of new sensory observations in like a bayesian updating setting it is remaining the same now the more inertia you have on the distribution the more stable it's going to be which is like equivalent to saying the less attention you pay to sensory stimuli the more stable your your priors are going to be it could be a prior about perception it could be a prior about action and there are descending motor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.23,
    "end": 4561.694,
    "text": " patterns as well and all these different modes are being played like in an apartment building and there's like different songs but they're happening at different frequencies spatial temporal and frequency bands so that we can tune in to different songs like different radio stations but with more spatial richness it's a total expansion of the palette that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.062,
    "end": 4590.677,
    "text": " recapitulates certain aspects of topology and helps us even identify residuals that are are most apt to be explained that way but it also opens up to like these big waves that get filtered out like by low pass potentially filtering in different data sets so that shorter term relationships can become more apparent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.564,
    "end": 4602.666,
    "text": " but that can be the ripple on the wave and so end up throwing out a huge amount just of the sheer information content of rich, dynamical datasets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4609.348,
    "end": 4611.688,
    "text": "Yeah, really interesting concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4612.369,
    "end": 4613.549,
    "text": "Trying to wrap my hair around it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4616.029,
    "end": 4618.13,
    "text": "Yeah, it's really cool because, again,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4619.734,
    "end": 4640.568,
    "text": " we still don't know what because what we found is that for example in a different task data that we have not all modes are equally excited certain modes are excited in quite different ways and we don't know what yet what these combinations mean truly uh behaviorally cognitively and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4642.193,
    "end": 4648.676,
    "text": " But yeah, we'll keep working on it, I suppose, and see what happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4648.736,
    "end": 4649.056,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.357,
    "end": 4652.818,
    "text": "Can I ask one more quick question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4652.878,
    "end": 4655.78,
    "text": "So I appreciate the geometry part of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.541,
    "end": 4664.444,
    "text": "So does any of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4666.241,
    "end": 4689.012,
    "text": " speak also to the the sort of the tunneling effects of the sort of that eigen value or eigen mode eigen value quantum piece where it's you know you can be riding the surface of this and appreciating that that the the parsimonious speaking speak to that surface effect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4690.163,
    "end": 4708.193,
    "text": " is there anything about this that also helps us understand better how something goes you know from through the wave like quite literally across from one one slope past the crown and on to the other side or is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.633,
    "end": 4712.717,
    "text": " Again, something that you guys weren't really spending a lot of time on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.358,
    "end": 4721.806,
    "text": "But I did notice, I pulled up the paper and I noticed on page 11, you were talking about some of the ways that you were analyzing the volumes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.347,
    "end": 4732.997,
    "text": "So that's the context that I was curious about, that sort of tunneling piece to go along with how we sort of follow the patterns on the surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4738.311,
    "end": 4741.412,
    "text": " Not quite sure I follow you asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.733,
    "end": 4745.714,
    "text": "Let me try to let me try to see where it comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.795,
    "end": 4746.415,
    "text": "As I see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.075,
    "end": 4750.077,
    "text": "Dean's a quantum tunneling connoisseur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.097,
    "end": 4759.341,
    "text": "Post even and with the basis set of the sine wave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.737,
    "end": 4780.571,
    "text": " it's like imposing this kind of oscillatory pattern and then you're you're up waiting or down waiting but is it possible to use a basis set or is it possible to detect modes in your analysis where there's like an effect locally and then there's like a then there's like a tunnel and there's like a region that the wave doesn't appear to pass through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4793.035,
    "end": 4794.135,
    "text": " By the way, thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4802.758,
    "end": 4803.519,
    "text": "We're stumped.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4804.439,
    "end": 4807.72,
    "text": "I guess it depends on what you mean by tunneling, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.74,
    "end": 4812.142,
    "text": "So like each mode, like if you look at the high frequency modes, they are quite patchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.182,
    "end": 4818.484,
    "text": "And so there'll be sort of disjointed areas of high amplitude and low amplitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.244,
    "end": 4820.585,
    "text": " But they fluctuate in time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.605,
    "end": 4821.926,
    "text": "Like they're standing waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.986,
    "end": 4824.688,
    "text": "And so they'll kind of alternate up and down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.208,
    "end": 4828.491,
    "text": "So in a sense, it looks like there's coupling over long distances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.493,
    "end": 4837.437,
    "text": "But that's just due to the standing wave dynamics, which is just driven by the interference pattern of the traveling waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.457,
    "end": 4839.378,
    "text": "So, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.394,
    "end": 4855.0,
    "text": " I'm not sure if that's kind of what you were getting at, but I guess, yeah, from a perspective of just, if you were just looking at the standing wave dynamics, it would look like things in spatially disjoint locations were kind of coupled in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.642,
    "end": 4868.627,
    "text": "It's like one jello, it stays put where you hit it, and it stays put one mile away, and it oscillates between like a jump rope,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.433,
    "end": 4878.199,
    "text": " Or it could be hit somewhere that's also very variable, then it'd be like the opposite of a jump rope with one mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.98,
    "end": 4884.444,
    "text": "And that's what's captured in the set of functions that are then parameterized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4884.484,
    "end": 4894.191,
    "text": "So then when you assemble them or when you superimpose them, you could get like kind of digitized looking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.125,
    "end": 4926.592,
    "text": " outcome patterns in terms of the real empirical correlations and it's map not territory and it's tempting to interpret these very literally as with many statistical tools when i think as we've discussed like there's there's multiple possible mechanisms and in your paper and in your work you've probably thought of many many mechanisms that lend themselves to like unique empirical predictions but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4928.191,
    "end": 4948.003,
    "text": " basis set decomposition is used like in spm which is kind of like the one of the precedents of active inference and and the work by carl frist and others it's using basis sets as well so yeah they used uh they used it everywhere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.223,
    "end": 4956.727,
    "text": " Do you have any closing or near-closing thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.807,
    "end": 4957.968,
    "text": "Or where does the work go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.988,
    "end": 4962.812,
    "text": "What data sets are salient, or questions, or cognitive phenomena?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.832,
    "end": 4966.074,
    "text": "Or what are you excited about for your lab and for the fields?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.237,
    "end": 4973.119,
    "text": "It's your lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.3,
    "end": 4978.123,
    "text": "There's a few different ways that we're interested in progressing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.918,
    "end": 5002.578,
    "text": " So one is, I guess, trying to reconcile this purely geometric approach that makes a very simple approximation with connectivity with the actual connectivity of the brain and trying to understand if the contributions of these kind of complex connections are not so easily revealed by a classic fMRI experiment, what are their contributions to dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.382,
    "end": 5012.945,
    "text": " And is there a way of kind of bringing some of that complex connectivity into the wave model and trying to get some traction on that question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.726,
    "end": 5020.907,
    "text": "Another aspect is we've done the simplest thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.947,
    "end": 5023.648,
    "text": "We treat all areas of the cortex as homogeneous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5024.874,
    "end": 5026.095,
    "text": " But we know that's not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.356,
    "end": 5034.402,
    "text": "Areas vary in terms of the cell density, degree of myelination, level of synaptic complexity and density and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.823,
    "end": 5041.387,
    "text": "And so that, in a sense, you could imagine that as changing the effective geometry of the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5041.427,
    "end": 5047.272,
    "text": "And so we're playing around with how do you introduce that heterogeneity and how does that change the mode structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.752,
    "end": 5051.435,
    "text": "And does that have an impact on your ability to reconstruct dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.898,
    "end": 5068.903,
    "text": " We're then also interested in sort of taking this forward to leverage these approaches for thinking about different ways in which we might be able to map brain changes in different disorders or variations across species and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.923,
    "end": 5079.386,
    "text": "And so kind of like classical SPM analyses, but making inference at the modal level and seeing if that can provide some useful insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.306,
    "end": 5082.707,
    "text": "So there's a few different strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.948,
    "end": 5090.229,
    "text": " Any other comments or thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.15,
    "end": 5092.35,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.57,
    "end": 5097.654,
    "text": "Dean, where do you go after this, Dean, in your own neuroimaging career?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.534,
    "end": 5099.415,
    "text": "No, stop it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5099.735,
    "end": 5115.685,
    "text": "I just think it was a very clear picture, and again, I really appreciated the paper itself, but today's presentation sort of brought it to life and made it a lot... I know that you guys were really trying to focus on making sure that you got all of your...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.031,
    "end": 5135.503,
    "text": " all your formalities in a row, but just the way you presented it today made it a lot, made it even more come alive in terms of the mechanisms that you use to sort of come up with a clearer picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5136.283,
    "end": 5137.965,
    "text": "That's what I came away with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5138.005,
    "end": 5139.686,
    "text": "So again, thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.836,
    "end": 5143.557,
    "text": " Thanks for the invitation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5143.677,
    "end": 5144.057,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5144.717,
    "end": 5148.438,
    "text": "We'll look forward to seeing the continuation of this trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.498,
    "end": 5149.999,
    "text": "You're always welcome back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.319,
    "end": 5151.98,
    "text": "So thank you both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5153.24,
    "end": 5153.52,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5153.54,
    "end": 5154.04,
    "text": "Thanks, guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.22,
    "end": 5154.52,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.661,
    "end": 5154.861,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]