[
  {
    "start": 7.247,
    "end": 8.228,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.828,
    "end": 9.969,
    "text": "It's March 31st, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.07,
    "end": 15.754,
    "text": "We're in Active Inference Org Stream number 4.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.635,
    "end": 23.521,
    "text": "And here today with Shrey Jain, one of the co-authors on the recent piece, Plural Publix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.342,
    "end": 27.325,
    "text": "So Shrey, thank you greatly for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.265,
    "end": 32.329,
    "text": "And we're going to start with a blank page here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.677,
    "end": 39.063,
    "text": " Please feel free to introduce yourself and the work, and let's go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.185,
    "end": 40.625,
    "text": "Sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.665,
    "end": 41.886,
    "text": "Yeah, thank you for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.008,
    "end": 45.991,
    "text": "I'm really excited to share some of the work that we recently put out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.151,
    "end": 50.897,
    "text": "It feels very timely, but before we get into it, let me just give a brief intro as to who I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.818,
    "end": 52.379,
    "text": "So I'm Shrey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.46,
    "end": 55.281,
    "text": " I currently work at Microsoft Research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.922,
    "end": 69.15,
    "text": "I sit in the special projects division of Microsoft Research and collaborate frequently with our team, who is known as the Plural Technology Collaboratory, or PTC for short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.23,
    "end": 76.114,
    "text": "And we intersect across various different labs at Microsoft, as well as external collaborators, including",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.455,
    "end": 87.759,
    "text": " the Harvard Safran Center for Ethics, the Berkeley decentralized research teams, decentralized blockchain research teams, and various different other partners that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.54,
    "end": 101.104,
    "text": "The reason why I'm on this podcast today is in reference to some work that I've been doing in collaboration with Glenn Weil and Divya Siddharth, which is called PluralPublics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.545,
    "end": 103.365,
    "text": "PluralPublics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.562,
    "end": 114.352,
    "text": " The way I'd like to introduce it is starting a bit more with what is the state of communication today and why is this paper especially important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.113,
    "end": 124.524,
    "text": "And to give a bit of context here, when we reference the internet as a communication tool, we often reference it to be the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.212,
    "end": 130.453,
    "text": " the most transformational tool that we've seen in human communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.493,
    "end": 133.334,
    "text": "And we referenced it for good reasons as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.394,
    "end": 143.757,
    "text": "We say that we're able to communicate basically with anyone across the world who has an internet connection at almost instantaneous speeds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.697,
    "end": 154.52,
    "text": "And that is something that humanity has never really experienced until the birth of the internet and the applications that allow us to communicate on top of it, which is very recent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.2,
    "end": 155.34,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.073,
    "end": 164.595,
    "text": " The reasons under which that has been actually quite harmful to human communication is due to the inability to preserve what's known as context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.255,
    "end": 174.878,
    "text": "And context is this term that is thrown around in academic language, and we want it to be very precise about its definition in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.918,
    "end": 182.8,
    "text": "And so the definition that we give to context is information that is common knowledge amongst a set of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.84,
    "end": 184.16,
    "text": "And so what I mean by that is it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.66,
    "end": 213.924,
    "text": " known to be known and it's known to it's known to be known it's known to known to be known and it's known to be known to be known to know it's like this like iterative loop of everyone knows that everyone knows that everyone knows everyone knows something and to give a bit to give a couple of examples of that is when if i'm a doctor and i've read medical textbooks when i walk into a room with other physicians who i know have practiced medicine in the country that i'm in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.85,
    "end": 221.694,
    "text": " it is common knowledge that they have a set of, they have this dictionary that we both share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.714,
    "end": 226.456,
    "text": "And this dictionary that we share allows us to communicate incredibly efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.017,
    "end": 237.623,
    "text": "As an example, if I had to walk into the operating room and had to explain to someone what some type of diagnosis meant every single time we walked into that room, it'd be incredibly inefficient to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.223,
    "end": 243.406,
    "text": "And so because we have this shared context, but also because that context is common knowledge,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.926,
    "end": 246.468,
    "text": " it allows us to communicate incredibly efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.508,
    "end": 251.032,
    "text": "And other examples we can see in our life are things like inside jokes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.232,
    "end": 253.594,
    "text": "It could be cultural milieus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.654,
    "end": 255.496,
    "text": "It could be religious traditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.576,
    "end": 257.838,
    "text": "It could be national memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.878,
    "end": 262.762,
    "text": "These are all things that play a big role in the way that we communicate with people around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.902,
    "end": 271.229,
    "text": "And some would argue that context actually is the necessary components to communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.249,
    "end": 272.63,
    "text": "Like if we didn't have context,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.371,
    "end": 279.914,
    "text": " even English itself would just be a set of symbols and words that didn't even make any sense to us, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.954,
    "end": 291.179,
    "text": "Like the only reason that you understand what I'm saying is because we have this shared context and symbols aren't just these like random pieces of ink on paper, but because we're in them, we're able to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.239,
    "end": 293.76,
    "text": "And so that's really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.84,
    "end": 301.043,
    "text": "Like we really want to protect context and to go back to why I brought up the internet and its inability to preserve context is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.179,
    "end": 311.202,
    "text": " When we share information online today, specifically on social platforms, we don't preserve the context under which information was created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.262,
    "end": 320.266,
    "text": "And like, as an example, if I post something on Twitter about the conversation we're having on our podcast today, maybe this is actually like not the best example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.286,
    "end": 325.727,
    "text": "Let's say I post something on Twitter about a conversation I have at dinner with like, um, family members.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.807,
    "end": 329.869,
    "text": "And it's like a joke that I thought was really funny and I wanted to post about, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.831,
    "end": 345.099,
    "text": " When I post that information on Twitter, not only do my family members, friends, or colleagues who are at the dinner table read that information, but the set of other people who read my Twitter content are interpreting that information with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.027,
    "end": 353.452,
    "text": " expectations, dispositions, and judgments that maybe that content wasn't initially intended to be communicated in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.013,
    "end": 357.595,
    "text": "And so context today is actually very hard to preserve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.615,
    "end": 370.104,
    "text": "Like if you message something in a group chat, it's actually very easy for someone to like screenshot and share that into another chat or forward it to another chat or share something from Instagram into iMessage or from WhatsApp into like another platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.184,
    "end": 373.727,
    "text": "And information is just flowing everywhere and it's just like going crazy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.747,
    "end": 375.028,
    "text": "And so we can't preserve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.541,
    "end": 391.043,
    "text": " integrity of where it came from and so as a result we see a lot of negative repercussions of this people's expectations around a certain community change when they don't interpret the information with maybe the way the community intended it to be communicated by or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.884,
    "end": 396.866,
    "text": " certain people who feel like they've become anxious or lonely as a result of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.926,
    "end": 406.032,
    "text": "And we can reference some of the work by Dana Boyd and Helen Nissenbaum, which talks about the effects of context collapse in the teenage age group in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.572,
    "end": 415.337,
    "text": "And so anyway, so far, like basically what we've said is like the internet itself has this ability to not preserve context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.377,
    "end": 421.581,
    "text": "And that has been very harmful to human communication because context is critical to the ways in which we communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.842,
    "end": 434.147,
    "text": " Um, well, maybe we can go into now is like why we're under even more severe threat in the era of large models or large foundation models in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.187,
    "end": 435.688,
    "text": "Does that feel fine with you, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.769,
    "end": 436.949,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.429,
    "end": 437.889,
    "text": "That was good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.97,
    "end": 446.373,
    "text": "So when I, when I, right now, I guess let's talk about what our foundation models, what are generative foundation models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.874,
    "end": 450.016,
    "text": " And what is going on in the world right now with all of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.536,
    "end": 458.682,
    "text": "So by now, if you're listening to this podcast, maybe there's a version of GPT that's not only GPT-4 or ChatGPT, but it's even crazier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.142,
    "end": 471.81,
    "text": "If you're listening to this podcast within the recent time of it coming out, you're already seeing the immense impact that ChatGPT and GPT-4 is having on probably you or people around you, depending on the ecosystems under which you live in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.331,
    "end": 474.132,
    "text": "If you have been on an academic...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.081,
    "end": 487.75,
    "text": " I've been at an academic institution or a college campus in the past three months, and you go to a library, I guarantee you that around 50% of the students in the library have a split screen open with ChatGPT and their actual coursework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.17,
    "end": 492.994,
    "text": "It's become a tool that is starting to impact the everyday work that everyone is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.455,
    "end": 499.798,
    "text": "And so this is both interesting as like a tool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 501.007,
    "end": 507.772,
    "text": " technological adoption framework, but also very scary as like, what are the repercussions that this is going to have on people?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.812,
    "end": 517.46,
    "text": "And like, the reason why it's interesting as like a technological adoption lens is because the adoption of ChatGBT has been higher than any other social platform ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.5,
    "end": 523.985,
    "text": "Like it had more users in Twitter, TikTok, Instagram, and all of these other platforms in the shortest amount of time possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.865,
    "end": 527.688,
    "text": "But it's also really scary because the ability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.717,
    "end": 538.466,
    "text": " that GPT-like models or generative foundation models have to decontextualize information even more puts our information integrity at threat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.526,
    "end": 539.747,
    "text": "And so, like, what do I mean by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.608,
    "end": 547.194,
    "text": "Well, first, it's because these models are able to create content in a very cheap way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.775,
    "end": 553.98,
    "text": "What I mean by that, you can create bodies of essays, you can create fake profiles, you can create fake Twitter threads that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.952,
    "end": 555.993,
    "text": " are seemingly real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.493,
    "end": 558.714,
    "text": "And what I mean by that is they're like very persuasive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.934,
    "end": 566.297,
    "text": "They look like they are coming from a real human being, but the cost of creating that fake content is so cheap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.278,
    "end": 571.84,
    "text": "You're able to spread a bunch of information on the internet in a decontextualized way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.86,
    "end": 573.28,
    "text": "Like you don't know where it came from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.32,
    "end": 574.661,
    "text": "Did it come from a model or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.081,
    "end": 577.122,
    "text": "Can we prove that it came from a model or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.708,
    "end": 586.773,
    "text": " And so there's going to be a lot of information polluting the internet that is going to cause people to look at information in a way that they can no longer trust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.714,
    "end": 592.237,
    "text": "And so what happens here is you start to operate in a low trust environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.817,
    "end": 593.458,
    "text": "And what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.518,
    "end": 605.665,
    "text": "It means when you look at information, when you look at a tweet, when you look at an Instagram post, maybe even when you look at an email or on a Zoom call with someone, you can no longer trust that that is in fact the authentic human version of themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.82,
    "end": 607.801,
    "text": " And so what does that lead to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.821,
    "end": 613.406,
    "text": "It leads to a place in which we are going to seek methods for verification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.886,
    "end": 620.852,
    "text": "We're going to seek methods under which people can actually communicate with one another and have confidence that that came from a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.692,
    "end": 626.436,
    "text": "But no longer do we have such confidence because those tools today don't actually exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.157,
    "end": 634.323,
    "text": "And so I guess to illustrate some further examples is like, how do we know where that like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.833,
    "end": 638.794,
    "text": " a given output came from even a language model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.874,
    "end": 643.816,
    "text": "If I'm even interacting with the language model, how do I know that that's the language model that I'm even interacting with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.856,
    "end": 650.158,
    "text": "Like, how do I know when I go to chat GPT website that it's actually going to be chat GPT?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.418,
    "end": 656.32,
    "text": "Well, today we have like some actually cryptographic primitives that allow for that to instill some confidence with like TLS certificates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.06,
    "end": 663.022,
    "text": "But in the future, as we maybe remove like website domains and think about it from social profiles,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.022,
    "end": 666.623,
    "text": " Doing proof of humanity becomes a very big problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.643,
    "end": 670.865,
    "text": "And the impacts of this are well discussed as it relates to deep fakes and misinformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.365,
    "end": 673.226,
    "text": "But we're not focusing on that problem here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.266,
    "end": 677.668,
    "text": "We're focusing more on the problem of preserving context and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.728,
    "end": 682.35,
    "text": "And for the reasons we described earlier, we want to be able to communicate effectively with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.831,
    "end": 687.412,
    "text": "So I'll pause there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.432,
    "end": 690.714,
    "text": "And Daniel, do you have any clarifying questions so far on anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.049,
    "end": 695.571,
    "text": " Well, very interesting questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.911,
    "end": 699.333,
    "text": "Continue a little bit, and then I'll definitely have a few things to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.254,
    "end": 700.474,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.975,
    "end": 704.737,
    "text": "So where we're at so far is the internet already doesn't preserve context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.917,
    "end": 711.502,
    "text": "We're scared of its ability to get exacerbated by large foundation models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.262,
    "end": 721.269,
    "text": "And so I've sounded very pessimistic in this opening of this podcast, but let me shed a little bit of optimism here as well, which is the internet...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.421,
    "end": 750.839,
    "text": " has there's this like there's this element of the internet that's um like identity standards and identity protocols and the internet wasn't born with an identity protocol like the the identity protocols today that the w3c is promoting like decentralized identifiers or verifiable credentials are actually very recent identity primitives relative to like the birth of the internet and privacy in general has always been this thing where it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.735,
    "end": 762.805,
    "text": " We would love to have privacy and we like are actually going to build infrastructure and cryptography and new primitives to enable such privacy because we recognize its importance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.645,
    "end": 771.792,
    "text": "But clearly given the way that we communicate today, it has not become something that is both a necessity for people to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.872,
    "end": 778.518,
    "text": "As an example, I still communicate today with like somewhat, maybe not me, but I'm saying like people in general with like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.979,
    "end": 790.023,
    "text": " weak passwords, maybe not always using two factor authentication and Twitter as a company may not even have hard requirements for me to authenticate that I'm in fact a human, because guess what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.423,
    "end": 794.264,
    "text": "They want to promote virality and have more content on their platform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.284,
    "end": 797.965,
    "text": "And so they're going to make it really easy to sign up and go and create an account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.426,
    "end": 802.647,
    "text": "And like the only thing you need to do to create an account today is have a Gmail account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.687,
    "end": 808.489,
    "text": "And to have a Gmail account, you need, I don't even, it's not, there's no strenuous requirements to prove your humanity today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.096,
    "end": 809.937,
    "text": " to get these accounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.077,
    "end": 818.903,
    "text": "And what's really exciting here is privacy has been always this, I guess, nice thing that we could strive for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.544,
    "end": 825.788,
    "text": "But the harms that foundation models pose to communication,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.647,
    "end": 839.375,
    "text": " And the harms that foundation models pose to the integrity of information to the internet may actually make it a necessity for us to care about these privacy-preserving tools because we won't be able to communicate otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.175,
    "end": 848.901,
    "text": "And so it's possible, it's actually almost exciting that the amount of noise, the amount of damage that these models can do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.977,
    "end": 854.139,
    "text": " could create these channels of communication on the internet that we've actually never had before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.439,
    "end": 869.004,
    "text": "Like maybe we will be able to preserve context and maybe we will be able to create common knowledge when we communicate with each other that we actually don't have today because context is clearly collapsing and context is clearly not being preserved when we communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.064,
    "end": 873.486,
    "text": "And so this is kind of where we now can start introducing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.127,
    "end": 887.309,
    "text": " plural publics and like what exactly is plural publics and like shedding a bit more light on the optimism to how we build towards such a future but before i go into plural publics i want to give you time to also ask any questions you have on the problems framing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.302,
    "end": 891.362,
    "text": " What is privacy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.382,
    "end": 904.328,
    "text": "I could easily imagine one saying, I was right with you on the context and I'll be the one to control that context or we'll have a context asymmetry where I know a lot more about you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.728,
    "end": 912.191,
    "text": "So how do we really think about privacy and in your mind, what ties it so closely with context?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.212,
    "end": 916.273,
    "text": "Yeah, so I want to reference here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.889,
    "end": 922.414,
    "text": " Helen Nissenbaum's work, which she has this book titled Privacy in Context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.435,
    "end": 933.624,
    "text": "And in her work, she argues how, what we really mean when we say privacy is actually, we mean contextual integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.425,
    "end": 936.627,
    "text": "And let me explain what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.107,
    "end": 940.41,
    "text": "It's like privacy today is this very, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.317,
    "end": 945.497,
    "text": " How do I say it's like it's either public or private.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.557,
    "end": 947.158,
    "text": "That is like our view of privacy today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.198,
    "end": 951.379,
    "text": "It's like things are either open to viewing or closed to viewing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.519,
    "end": 959.36,
    "text": "And there's this other framing we maybe want to take, which is that some things that are open to some people may be close to others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.42,
    "end": 962.141,
    "text": "And some things that are closed to some people may be open to others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.181,
    "end": 966.902,
    "text": "And that opening and closing is highly dependent on the relationships that we have with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.021,
    "end": 974.146,
    "text": " And this is kind of like Helen Asimov articulates this much more clearly than I am right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.226,
    "end": 982.071,
    "text": "But I want to basically try to frame it, which is that contextual integrity is what we mean when we say privacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.171,
    "end": 985.394,
    "text": "Privacy means that something I feel confident in communicating with you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.266,
    "end": 989.467,
    "text": " it may be private in this context, but I may not want to share it with someone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.567,
    "end": 994.589,
    "text": "And like how we decide what is private and what is not is going to depend on our social norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.689,
    "end": 999.67,
    "text": "It's going to depend on our prior relationship and our context that we have with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.15,
    "end": 1005.932,
    "text": "And so another author who's written about this is Georg Zimmel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.452,
    "end": 1012.714,
    "text": "And in 1906, he has this paper titled The Sociology of Secrecy and Secret Societies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.414,
    "end": 1014.515,
    "text": "And he writes a lot about how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.245,
    "end": 1018.166,
    "text": " secrets are formed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.386,
    "end": 1024.009,
    "text": "And secrets are something that I find fascinating that I want to find a way to tie into here in a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.27,
    "end": 1036.918,
    "text": "Because it's very possible that secrets could be the only thing that we have to be able to authenticate ourselves in the digital world now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.618,
    "end": 1045.163,
    "text": "In the sense that who I am to the public in terms of my physical atoms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.856,
    "end": 1062.999,
    "text": " And the way that I communicate through voice and the style in which I communicate, given that I have even a very small public presence in my local communities, but there exists content online about me, could be enough to convey who I am to another audience in a very persuasive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.579,
    "end": 1074.581,
    "text": "And if anyone else has content about them, as I think it's like a stat of like 80% of Gen Zs, I may be wrong about that stat, is also able to be replicated in a very persuasive way now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.609,
    "end": 1078.21,
    "text": " But and this is where I get very excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.75,
    "end": 1090.674,
    "text": "Our secrets can be the things that we can use to authenticate ourselves, because those are the things that only the person who shares that experience with us or shares that context with us will be able to authenticate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.194,
    "end": 1099.097,
    "text": "And what I mean by that here is like, let's say, Daniel, me and you on this call, assuming no one else was listening, had a secret about a water bottle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.154,
    "end": 1110.657,
    "text": " And this water bottle became a secret for some reason because either, I don't know, there was an interesting mixture that came in with something about this water bottle became a secret between us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.277,
    "end": 1115.918,
    "text": "And so if I get on a Zoom call with you, instead of doing CAPTCHA, are you a robot?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.458,
    "end": 1124.0,
    "text": "Or like all these standards of Turing tests we have today, which I argue in the paper, our Turing tests are going to be dependent on our secrets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.111,
    "end": 1128.133,
    "text": " is that our secrets are going to be the way we authenticate ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.534,
    "end": 1145.266,
    "text": "And this is also exciting in the sense of optimism, which is that I think for people who are able to, and also I can shed a bit of light on the fears I have about this, but because the internet may become unusable, maybe we'll actually live more in the physical world if we can and we're able to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.286,
    "end": 1145.346,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.248,
    "end": 1174.652,
    "text": " develop more secrets such that we can authenticate ourselves in the digital world like the more we just go on like picnics and like have experiences and like do things that cause immense heartbreak but also immense happiness will allow us to have more inside jokes and will allow us to have more memories that we can say and allude to when we want to authenticate ourselves digitally um but maybe yeah so that that gives a sketch of kind of how i was looking at your question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.497,
    "end": 1178.538,
    "text": " Oh, I'd love to hear a little more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.638,
    "end": 1184.34,
    "text": "And there's many active inference and cognitive science threads that speak to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.48,
    "end": 1188.822,
    "text": "So it's a cool to hear you go on a little more about the plural publics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.042,
    "end": 1190.262,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.282,
    "end": 1195.304,
    "text": "So why don't we get into like plural publics and I want to come back to the secret stuff after as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.765,
    "end": 1195.985,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.021,
    "end": 1204.105,
    "text": " First of all, maybe I'll give this framing of why I use the word plural and then I'll get to the word public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.125,
    "end": 1206.647,
    "text": "So we'll get very explicit here about both of these terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.288,
    "end": 1215.874,
    "text": "So plural is in reference to this broader community of people working on what's called plurality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.914,
    "end": 1220.737,
    "text": "And if you want to read more about plurality, I want to reference two people here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.837,
    "end": 1223.179,
    "text": "Audrey Tong, who is the digital minister of Taiwan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.874,
    "end": 1233.347,
    "text": " And Glenn Weil, who is my manager at Microsoft, but also more importantly, one of the leading figures embracing this movement of plurality with Audrey Tong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.048,
    "end": 1240.357,
    "text": "And they're co-authoring a book together on plurality that you can read about at plurality.net.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.394,
    "end": 1260.093,
    "text": " um and they're doing it in this like very interesting git format where everyone can basically write pull requests on the book and the chapters have these like the way that the chapters are developed they're done in this like very cool deliberative discussion way and anyways you can fanboy over that at another time but um plurality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.087,
    "end": 1272.898,
    "text": " it has many different axioms under which it is defined by, but the axiom that I think sat well with me is how we get collaboration or coordination across social differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.759,
    "end": 1277.842,
    "text": "And I think it's really powerful to think about that at each world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.862,
    "end": 1279.444,
    "text": "Like what, like how do you coordinate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.764,
    "end": 1280.445,
    "text": "How do you collaborate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.465,
    "end": 1282.046,
    "text": "Like what is like the ways in which we do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.506,
    "end": 1287.351,
    "text": "Communication often depends on, sorry, coordination and collaboration depends on communication and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.927,
    "end": 1307.389,
    "text": " communication often depends on context and there's like ways in which you can build up how this all comes back to plural publics um but now let me get to the word Publix here which is in reference to John Dewey John Dewey um has this book called the public and its problems and in 1927",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.631,
    "end": 1312.713,
    "text": " In the book, he references what are called emergent publics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.593,
    "end": 1327.92,
    "text": "And emergent publics are these groups of people who come together to be able to deliberate, to ideate and converse and discuss on shared issues that they have with one another and find a way to resolve those issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.892,
    "end": 1339.598,
    "text": " And it's the intersection of all these different publics that come together to form new knowledge and to form new solutions to problems that we're working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.379,
    "end": 1345.642,
    "text": "And so we reference this work, Plural Publics, as a way to allude to John Dewey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.162,
    "end": 1355.267,
    "text": "But before I even get to Plural Publics, actually, I miss someone who is, and I know I'm referencing a lot of people in this answer, but it's really important to do so properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.304,
    "end": 1360.427,
    "text": " And there's someone else I want to reference, which is J.C.R.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.467,
    "end": 1360.887,
    "text": "Licklider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.508,
    "end": 1361.888,
    "text": "J.C.R.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.928,
    "end": 1367.333,
    "text": "Licklider was one of the Internet pioneers who worked on what's called ARPANET.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.453,
    "end": 1376.4,
    "text": "ARPANET is the precursor to the modern day Internet and has this series of work that references",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.89,
    "end": 1391.922,
    "text": " a lot of the initial principles and ideologies of emergent publics and how the internet could be this global connectivity tool to basically connect people and create a more scalable form of emergent publics online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.183,
    "end": 1404.473,
    "text": "And John Dewey's initial vision, sorry, JCR Licklider's initial vision for the internet and how it could abide by some of the principles from John Dewey is really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.299,
    "end": 1415.081,
    "text": " But due to the ways in which the internet has been built and the applications on top of it, we've been unable to get the form of publics that Dewey once imagined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.701,
    "end": 1427.444,
    "text": "And what I mean by that is we're unable to coordinate and build this collaboration across social differences to the strength that we may want to, to solve some of the most pressing problems we have today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.204,
    "end": 1432.565,
    "text": "And the reasons for that are many fold, but one of which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.22,
    "end": 1435.861,
    "text": " due to this inability to preserve context online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.761,
    "end": 1456.689,
    "text": "And so Plural Publix aims at taking the vision that Dewey once imagined, along with the initial sketches that ARPANET took, and try to reformulate the problem into the understandings that we've had with this initial, I guess, trial run of the internet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.059,
    "end": 1467.427,
    "text": " and how we can like try to do it again under a new framing in the birth of this new technology, which is generative foundation models or AI, whatever you want to refer to as.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.828,
    "end": 1479.936,
    "text": "And so we have a real opportunity here to like actually build what, you know, our JCR Licklater wanted to do on Dewey's vision and try again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.956,
    "end": 1482.438,
    "text": "And we have the opportunity to do it well now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.498,
    "end": 1482.778,
    "text": "And we're,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.519,
    "end": 1486.301,
    "text": " alluding to how plural publics now can be that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.341,
    "end": 1500.949,
    "text": "And so plural publics in short are these digital spaces where we can produce common knowledge of context, meaning everyone knows that everyone knows something in this given space, and we can both protect and establish that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.83,
    "end": 1504.491,
    "text": "And so what I mean by that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.727,
    "end": 1512.612,
    "text": " When I speak online, I should both have the confidence that I have the context to communicate in that space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.112,
    "end": 1516.755,
    "text": "And that everyone who's listening to me has the context to communicate in that space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.316,
    "end": 1519.738,
    "text": "And that I know that they have that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.338,
    "end": 1522.72,
    "text": "They know, sorry, give me one second to take a sip of water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.98,
    "end": 1523.201,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.262,
    "end": 1525.883,
    "text": "The secret water.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.903,
    "end": 1526.443,
    "text": "They know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.024,
    "end": 1528.145,
    "text": "Oh, I think you were muted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.005,
    "end": 1529.966,
    "text": "The secret water bottle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.647,
    "end": 1531.307,
    "text": "Secret water bottle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.327,
    "end": 1531.728,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.648,
    "end": 1535.631,
    "text": "They know that I have that context, but more importantly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.306,
    "end": 1540.568,
    "text": " I know that they know that I know, and I know that they know that they are, they know that I know that they know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.648,
    "end": 1547.35,
    "text": "And it's what's this common knowledge of context that allows for such rich forms of communication to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.391,
    "end": 1555.794,
    "text": "And the way, the way I usually imagine it is today we have these social graphs in the world, which, um, leak information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.834,
    "end": 1557.535,
    "text": "Like someone might share information, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.928,
    "end": 1561.71,
    "text": " outside of a given context and information is very leaky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.19,
    "end": 1568.495,
    "text": "What we want to do is we want to build a social graph that has extremely high information integrity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.535,
    "end": 1578.301,
    "text": "And what I mean by that is both when I communicate, I have extremely high confidence in my communication because I know everyone else has the context to understand what it is that I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.942,
    "end": 1579.782,
    "text": "But secondly, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.159,
    "end": 1586.783,
    "text": " I know that when I communicate that information can't be leaked in a very persuasive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.524,
    "end": 1593.37,
    "text": "So let me explain both of these parts, because now is how we get to like the more interesting, like, how do we build that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.41,
    "end": 1594.09,
    "text": "What does that even mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.11,
    "end": 1597.393,
    "text": "These seem like visions that are not possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.334,
    "end": 1603.299,
    "text": "So the first part I want to communicate and have, I want to be able to establish",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.142,
    "end": 1606.344,
    "text": " I want to have confidence that everyone understands what I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.645,
    "end": 1607.465,
    "text": "How do we do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.986,
    "end": 1617.335,
    "text": "And so in this paper, we allude to like five different technological primitives that we believe could be very powerful in allowing us to achieve these goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.456,
    "end": 1627.285,
    "text": "And I'll walk through how some of these technologies can help with these two high-level goals, which is like both establishing context and preserving context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.86,
    "end": 1634.602,
    "text": " I don't remember the exact order in which we presented it in, but it was like, I'll go through each of the five tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.882,
    "end": 1636.522,
    "text": "One of which is identity certificates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.843,
    "end": 1658.349,
    "text": "So identity certificates today are, I guess there was like certain subsets of communities that do use identity certificates and probably the web three community is the most dominant form of like actually getting a comfortable understanding of the user experience and user interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.141,
    "end": 1669.673,
    "text": " for what that means, and in particular, instantiations of that look like NFTs, where in order to enter a group chat, I have to prove that I have a given certificate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.773,
    "end": 1673.097,
    "text": "And that certificate today may be through the issuance of a non-fundable token.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.977,
    "end": 1677.999,
    "text": " There's other examples of that in non-blockchain context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.039,
    "end": 1682.762,
    "text": "In particular, there exists verifiable credentials, anonymous credentials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.142,
    "end": 1691.687,
    "text": "There's also just very simple cryptography with like public key certificates that exist as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.108,
    "end": 1703.875,
    "text": "And so in general, what I'm trying to allude to here is there's a bunch of cryptographic certificates that can be used to verifiably prove someone has a certain property or attestation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.208,
    "end": 1708.431,
    "text": " The reason why that's important is let's say I want to communicate online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.392,
    "end": 1716.56,
    "text": "Maybe it might be helpful to prove that you have a set of properties, whether it be education, whether it be through shared experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.6,
    "end": 1721.305,
    "text": "Like you were at the dinner last night and therefore you know what I'm talking about when I'm saying this thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.738,
    "end": 1727.239,
    "text": " Or you went to that school for that year and took these courses and therefore you'll understand this set of terminology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.76,
    "end": 1735.321,
    "text": "Or you did X, Y, Z. And if you know the limits of this become proving that you have the context basically to be in this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.922,
    "end": 1741.703,
    "text": "Then we get to the second technology here, which is distributed ledgers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.682,
    "end": 1754.317,
    "text": " And so when you combine distributed ledgers with identity certificates, you're able to create common knowledge of the context under which something may exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.358,
    "end": 1756.761,
    "text": "And so as an example, sorry to rephrase, it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.973,
    "end": 1775.607,
    "text": " When I communicate on a distributed ledger and I prove that I have a certain attestation and you also prove that you have that attestation, then I know that you have that attestation because there's a ledger that we've globally agreed upon within this set of people that we both have that context to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.408,
    "end": 1784.555,
    "text": "And there's actually some really interesting work out of Cornell from Joseph Halpern and Raphael Pass that proves as to why distributed ledgers are actually...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.673,
    "end": 1799.1,
    "text": " capable of creating what's called common knowledge or actually in the paper it's called approximate common knowledge because of these properties of blockchains or non-blockchain type distributed ledgers that are capable of doing so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.54,
    "end": 1810.425,
    "text": "So now we basically through these two primitives are able to both prove that we have some context and both have the confidence to know that everyone else also has that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.286,
    "end": 1813.027,
    "text": "Now let's go to the second goal here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.706,
    "end": 1819.187,
    "text": " which is I want to make sure that when I communicate, it doesn't leave that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.568,
    "end": 1824.369,
    "text": "So not only have we now preserved it, or sorry, established it, I want to preserve the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.809,
    "end": 1826.589,
    "text": "So how do we preserve context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.25,
    "end": 1830.31,
    "text": "And so, again, I guess I want to make a quick caveat here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.451,
    "end": 1836.632,
    "text": "When we wrote this paper, we had an idea of the tools that could be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.639,
    "end": 1839.58,
    "text": " but by no means do we have the answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.64,
    "end": 1846.064,
    "text": "And in fact, everything I'm mentioning in a couple of years could undermine the exact goals that we're trying to achieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.544,
    "end": 1851.267,
    "text": "But to our knowledge, these are like the best tools to consider when thinking about this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.287,
    "end": 1854.529,
    "text": "So I wanna make that quick caveat here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.089,
    "end": 1863.514,
    "text": "But the first set of tools that I wanna reference for when we talk about preserving context is what's called deniable or disappearing messages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.693,
    "end": 1867.495,
    "text": " And so I guess I'll give an example today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.115,
    "end": 1874.86,
    "text": "When I go to a coffee shop, let's say Daniel and I go to a coffee shop and there's no technology in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.341,
    "end": 1877.481,
    "text": "We can make that assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.561,
    "end": 1879.402,
    "text": "It's just us and we're just having a chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.963,
    "end": 1892.651,
    "text": "And when I communicate with you, given that I know there's no technology and there's no phone recording in this conversation, anything I say to you is going to be only verified by you that I said it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.496,
    "end": 1901.54,
    "text": " Meaning you can't go tell Jimmy some other person that Shrey said this and Jimmy can prove that I said that because you have no proof that I even said it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.661,
    "end": 1904.962,
    "text": "Only you in this conversation know that I said that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.083,
    "end": 1909.145,
    "text": "And so this is what's known as deniable messaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.305,
    "end": 1917.069,
    "text": "Only the receiver of that conversation is capable of like proving the authenticity of the initial message from the sender.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.489,
    "end": 1922.292,
    "text": "And no third party is capable of proving the authenticity from the sender to the receivers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.14,
    "end": 1944.353,
    "text": " That is really powerful actually in information integrity, because if there exists a group chat on a distributed ledger with a bunch of people who've proven through their identity certificates that they have some context, then any message that is sent, but sent in a way that's done it through a deniable message, only that group of people will be able to prove its authenticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.253,
    "end": 1948.415,
    "text": "That is immensely powerful in a world where we don't believe anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.979,
    "end": 1971.492,
    "text": " we're going to seek verification on every piece of content that exists in the world because we're going to assume due to the nature of ai and foundation models and generated content that everything is fake until proven otherwise so given that given that i'm operating in this mindset that everything's fake and i'm seeking tools to verify the integrity and authenticity of information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.586,
    "end": 1983.056,
    "text": " Using deniable messaging techniques allows us to communicate in a way where only the people who can verify its authenticity are going to be able to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.116,
    "end": 1987.519,
    "text": "And so now I can basically preserve the context on which information is sent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.56,
    "end": 1996.948,
    "text": "And so a prime example of that today is if I try to forward a message to someone else through WhatsApp or whatever other platform you want to reference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.429,
    "end": 2005.654,
    "text": " If that person who I share it with is not part of the designated verifiers or the people who should be able to authenticate, they won't be able to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.294,
    "end": 2023.204,
    "text": "And the specific primitive that I've been working on here in collaboration with some other researchers at the Ethereum Foundation, Enrico Bottazzi, this is not like an Ethereum Foundation project, but just happens to be a project I'm working on with some people from there, is building the primitives to go out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.843,
    "end": 2033.027,
    "text": " and actually implement messaging techniques on Ethereum with a zero knowledge, soulbound tokens to send messages with designated verifier signatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.067,
    "end": 2038.569,
    "text": "And we've created a component, a JavaScript component that can be plugged into basically like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.116,
    "end": 2041.317,
    "text": " any application to allow people to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.877,
    "end": 2043.277,
    "text": "So these are tools that exist today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.297,
    "end": 2046.438,
    "text": "These are not just like hypothetical cryptographic construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2046.458,
    "end": 2049.979,
    "text": "These are things that can be battle tested and out in the wild today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.379,
    "end": 2060.661,
    "text": "So I guess I've alluded now to like various different technologies that could be helpful in both preserving and protecting context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.701,
    "end": 2063.262,
    "text": "And I want to now just like bring it back to PluralPublics, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.508,
    "end": 2084.034,
    "text": " If we're able to build a world where we can have confidence in communication because we can authenticate the integrity of that information and ensure that it also doesn't leave the context on which it was created, we're going to experience a form of digital communication that we've never been able to experience and I think is actually quite beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.236,
    "end": 2091.66,
    "text": " But if we're unable to do that in a successful way, it becomes quite concerning actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.44,
    "end": 2102.126,
    "text": "And we move into a world where there's immense amount of distrust seeking for verification and scams to the degree in which we've never seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.146,
    "end": 2108.15,
    "text": "I guess to make that very explicit, there was a recent scam that happened on March 5th where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.309,
    "end": 2134.165,
    "text": " someone took the audio snippet of someone on TikTok and they synthesized the voice from the girl on TikTok and called that girl's grandma as though they were the voice of that person and were able to use various different techniques through conversation to scam the grandmother because the grandmother thought that they were talking to the voice of a loved one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.08,
    "end": 2141.842,
    "text": " when in fact it was just a scammer using these different tools that already exist today to persuasively scam someone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.782,
    "end": 2154.725,
    "text": "And so I guess to what I'm saying here is if you can't even trust the voice of your loved ones, if you can't even trust the image of your loved ones, you're going to seek some set of tools to communicate or else you won't communicate at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.585,
    "end": 2158.886,
    "text": "And this is very scary actually, because if you become unaware",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.941,
    "end": 2166.784,
    "text": " of your ability to leak secrets about yourself, you become unaware of your ability to just leak information about yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.624,
    "end": 2186.391,
    "text": "I can only imagine a world where you now are unable to access your internet, your financial accounts and thereby your ability to interact with a lot of the physical world today because you're unable to authenticate yourself in the digital world because you've become so easily reproducible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.775,
    "end": 2213.311,
    "text": " So this is like where Plural Publix, hopefully we start to create a set of, we hope to provide a framework and a very high level framework, but be useful as individuals, as coauthors of this paper and people who are invested in building tech to help people go out and like build solutions to the types of problems we allude to and with the technologies we sketch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.412,
    "end": 2218.315,
    "text": "I'll pause there and maybe we can open it back up questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.192,
    "end": 2222.032,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.392,
    "end": 2224.893,
    "text": "Well, many... I think you're muted, Dan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.273,
    "end": 2225.553,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.773,
    "end": 2226.313,
    "text": "Only in the Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.593,
    "end": 2231.854,
    "text": "Many interesting topics and ways to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.874,
    "end": 2235.355,
    "text": "I'll just bring in one active inference idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.975,
    "end": 2239.696,
    "text": "And that's thinking through other minds or TTOM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.576,
    "end": 2247.178,
    "text": "And in TTOM, it's a lens to think about communication, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.776,
    "end": 2251.118,
    "text": " where individuals don't just have a theory of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.398,
    "end": 2261.083,
    "text": "It's not just that they have some belief about whether the entity that they're conversing with has an awareness, which is kind of an interesting philosophical point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.623,
    "end": 2271.249,
    "text": "But really more pragmatically, thinking through other minds points to the emulation of a conversant's perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.288,
    "end": 2280.353,
    "text": " And that being one of the critical aspects of communication overall, not like some edge recursive case like you brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.413,
    "end": 2284.955,
    "text": "It's not enough just that you know, it's that you know that they know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.416,
    "end": 2299.203,
    "text": "And that's what allows the low friction and high fluency, high bandwidth, high integrity communication is not needing to ask which of these English words do you understand or which one of these authors are you familiar with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.864,
    "end": 2300.864,
    "text": "And so it's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.105,
    "end": 2327.186,
    "text": " really interesting to see how what might be seen as kind of this esoteric or edge case where we're emulating or as if emulating each other's perspective, that's actually the crux of communicating across difference of which we are always doing just different kinds of differences that we might have a certain belief about which ones are not crossable or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.502,
    "end": 2329.003,
    "text": " Agreed, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.023,
    "end": 2345.597,
    "text": "And I'll just put this paper in the chat here, a preprint that came out by some faculty at Stanford around how theory of mind tasks have emerged through large language models, and they're capable of completing theory of mind tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.917,
    "end": 2351.682,
    "text": "And so I thought that might be an interesting read for the audience as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.949,
    "end": 2364.292,
    "text": " And one related area that you're, I think, pointing to with this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.893,
    "end": 2372.896,
    "text": "First, we care about the cognitive security and the well-being of ourselves and of humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.856,
    "end": 2380.259,
    "text": "However, increasingly, these conversions also can be understood as cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.195,
    "end": 2401.501,
    "text": " Yes, cognitive models that have a differential degrees of agencies or capacities in the world, but it's what merits what philosopher Daniel Dennett called the intentional stance, which is like interacting across that interface, that Turing test interface, instead of treating it like a test pass, no pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.506,
    "end": 2406.849,
    "text": " You can treat it from a game theory perspective in the intentional stance way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.929,
    "end": 2414.855,
    "text": "Like, I don't know whether it's a human underneath that mechanical Turk or whether it's a crowdsourced or this kind of model or that kind of model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.556,
    "end": 2424.223,
    "text": "However, there are ways that we can approach it that are basically the best way to approach it in a given setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.343,
    "end": 2428.246,
    "text": "And that intentional stance is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.349,
    "end": 2435.136,
    "text": " we've gotten by far and well with bootstrapping on local context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.777,
    "end": 2443.927,
    "text": "Like taking an intentional stance towards an embodied human in a given party is really easy, but when it's a chat room, it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.75,
    "end": 2457.438,
    "text": " And so it's almost like when the comic book character runs off the cliff and still runs for a little bit, like we're on that bootstrapped inertia of context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.518,
    "end": 2459.84,
    "text": "I have to say, I totally believe that it's really you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.76,
    "end": 2468.325,
    "text": "But again, how rapidly should that belief be updated downwards in the coming several months?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.326,
    "end": 2470.427,
    "text": "Maybe all the way to the floor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.187,
    "end": 2472.288,
    "text": "And that is going to be the issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.61,
    "end": 2493.182,
    "text": " It's very interesting you say that because part of me, when I read about information asymmetry in relationships, there's always been this sense of asymmetry in the sense that you don't know with 100% confidence what I'm thinking about, even if you're my partner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.141,
    "end": 2495.863,
    "text": " But that's been OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.023,
    "end": 2499.546,
    "text": "We've actually operated with some asymmetry in our relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.628,
    "end": 2502.589,
    "text": "We still make progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.769,
    "end": 2503.41,
    "text": "We still live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.45,
    "end": 2505.431,
    "text": "And the NFL game still plays at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.672,
    "end": 2506.593,
    "text": "Everything still happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.52,
    "end": 2526.337,
    "text": " But like, I think there's actually an interesting relationship here between information asymmetry and context collapse, which is that as we've increasingly communicated online, the asymmetry that exists between people's expectations of the world or the way that people themselves move or operate has grown to like a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.438,
    "end": 2552.135,
    "text": " delta whatever you want to call that asymmetry difference to be larger and larger and larger to the point where like as you're talking about here is like with large foundation models maybe become so big that we can't even communicate anymore and like what's worked for humanity of like asymmetry in the physical world like no longer becomes functional in the digital um and that's actually quite scary to think about too so anyways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.799,
    "end": 2572.57,
    "text": " yeah one really logistical example of that is time zones i mean in person you're always talking to somebody in the same time zone weather condition but the way in which in a video conversation it could be sunset it could be sunrise and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.147,
    "end": 2587.659,
    "text": " the kinds of practices that emerged even rapidly over the last several years to help at least reduce uncertainty, which is the imperative in active inference, not to maximize reward, but to bound or minimize our surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.279,
    "end": 2593.724,
    "text": "These practices can be understood as bounding surprise on these important axes of context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.085,
    "end": 2595.886,
    "text": "Like, oh, cool, I haven't seen you in this meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.906,
    "end": 2597.487,
    "text": "How long have you been in this organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.768,
    "end": 2599.529,
    "text": "Or, oh, what time is it where you're at?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.609,
    "end": 2599.649,
    "text": "Or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.55,
    "end": 2626.025,
    "text": " is the weather outside those help really rapidly dampen our uncertainty and that's what enables effective policy selection with uncertainty about the mapping between observations in the world or uncertainty about the consequences of action in the world yeah you can't act yeah yeah no i i really like that framing and it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.093,
    "end": 2632.635,
    "text": " Yeah, it's interesting, because I think there's almost, like, a negative connotation towards, like, people on Zoom calls asking, like, how's the weather outside?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.675,
    "end": 2656.285,
    "text": "Like, it's a waste of time to, like, ground the conversation in that, like, first two minutes, but, like, maybe there is actually something more important and subtle in that, that, like, maybe I haven't appreciated it as much, but maybe I should be more aware of as, like, yeah, like, it's snowing and raining outside where I am, and how does that affect the way I communicate as compared to someone who's looking outside and seeing a sunny beach and, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.815,
    "end": 2684.286,
    "text": " the small things and the context on which we're actually like sitting in a room and maybe like i have an issue in my apartment out here right now and like that's gonna affect the way i communicate here anyways yeah yeah and one other uh area or type of context and one that people have started to model within active inference framework is narrative context because i'm thinking about those two people face-to-face talking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.177,
    "end": 2688.08,
    "text": " So they're seeing entirely different landscapes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.3,
    "end": 2690.622,
    "text": "Maybe one is facing the mountain, one's facing away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.163,
    "end": 2698.309,
    "text": "So it's clearly not enough to have shared context at the level of exactly what one sees or hears.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.15,
    "end": 2702.513,
    "text": "But there is some level of coarse graining where...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.789,
    "end": 2721.358,
    "text": " The people will expect and prefer to have shared context and whether it's a micro narrative, like something very situational, Hey, in the next 30 minutes, we're here to do this or that, or whether it's a more broad or even open ended adventure type journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.813,
    "end": 2733.659,
    "text": " having tools to increase our bandwidth of communication around rhetorical and narrative context is going to set the stage for so much more to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.08,
    "end": 2745.386,
    "text": "But if we're scrambling with the pixels, while two people have different ideas about what genre of movie they're in, one's at a horror movie, one's at a rom-com, then you can't...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.647,
    "end": 2750.49,
    "text": " just pile sand onto that kind of a foundation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.931,
    "end": 2768.646,
    "text": "Whereas if you have a better overarching ways for communities to self-determine and build resilient systems, then we may see new kinds of flourishing that haven't been enabled in web one, two, or three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.653,
    "end": 2771.573,
    "text": " Yeah, I couldn't agree more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.254,
    "end": 2786.216,
    "text": "I think the feeling I get right now with everything coming out is we are at a point where we have an actual opportunity to fix communication in a way we never have been able to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.256,
    "end": 2799.519,
    "text": "We can get the properties of physical communication, of being in the same room and having this context of one another, but doing so in a way that we can also benefit from global instantaneous communication that maybe we've never actually had",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.526,
    "end": 2802.587,
    "text": " And that's really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.867,
    "end": 2803.748,
    "text": "That's really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.788,
    "end": 2829.106,
    "text": "And I think that we're at a point now where we're seeing claims from some of the world's smartest people who are building these technologies saying that like, oh, foundation models could be as revolutionary as the wheel or electricity, not even the internet, like as revolutionary as like some of these even more drastically important technologies that we should take this very seriously if we meet those words the way that they're being said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.947,
    "end": 2853.508,
    "text": " um and treat it as also an opportunity to build around it and and hopefully improve human communication but yeah so i think like that so like i think that's like wraps up like kind of the plural public framing and like it was very like nice to actually walk it through in the way that we did here it feels like we went through like at a good pace and feels nice yeah i guess just in our",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.835,
    "end": 2869.999,
    "text": " landing of the plane how do you and your colleagues move forward and how can people be included in their own ways in how things will develop yeah i guess a couple things so um do the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.597,
    "end": 2873.939,
    "text": " One is I, as an individual, am pretty accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.979,
    "end": 2887.548,
    "text": "If you want to reach out to me and find a way to collaborate on things, whether it's me and my affiliations with Microsoft, or even easier for me as an individual wanting to just promote and support any projects that I can, I will do my best to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.228,
    "end": 2893.472,
    "text": "Secondly, is that we at Microsoft Research have launched the Plural Technology Collaboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.052,
    "end": 2896.814,
    "text": "And you can read more about, I'll just put a link in the chat here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.092,
    "end": 2901.574,
    "text": " the work I'm leading at Microsoft research on plural publics in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.955,
    "end": 2907.518,
    "text": "And you can read more about that effort on this blog post we made about plural publics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.778,
    "end": 2916.263,
    "text": "And there's a bunch of different open source projects we have on behalf of Microsoft research that people can contribute to at a technical level as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.763,
    "end": 2922.146,
    "text": "Whether that be the go forget projects, which you can read more about or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.773,
    "end": 2923.893,
    "text": " the YouProof project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.953,
    "end": 2926.274,
    "text": "These are all projects that you can look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.755,
    "end": 2936.739,
    "text": "And lastly is I do think that there's a lot of reading and things that people can do to also get excited about themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.719,
    "end": 2951.945,
    "text": "If you can read the paper or read versions of the papers we reference in that paper, I think that you will change the way you even perceive sometimes the things that are going on with the large foundation models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.583,
    "end": 2961.215,
    "text": " movement right now, whatever you want to call it, because you may see it as either pessimism, depending on how you interact with these tools or great optimism, but you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.094,
    "end": 2977.561,
    "text": " I hope that when you read this work, you also see it with a great opportunity to be a contributor to it, whether you as an individual who is technically competent or you as an individual who can just embrace the way that you use these tools and take great care with how you and the people around you use it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.001,
    "end": 2982.464,
    "text": "And I think there's like various different ways in which plural public's involvement could take place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.544,
    "end": 2984.745,
    "text": "And also my Twitter, I'm pretty active on Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.945,
    "end": 2987.246,
    "text": "You can DM me there as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.366,
    "end": 2989.287,
    "text": "Shrejaneeth is my Twitter handle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.919,
    "end": 2999.743,
    "text": " few thoughts and angles that we could just sort of bring in near the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.624,
    "end": 3021.619,
    "text": "There are opportunities for technical contributions like you've brought up and maybe even what will dawn is the social competencies, being able to engage in perspective swaps and then prompt the kinds of technologies that would scaffold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.927,
    "end": 3038.494,
    "text": " those communications, it may be less about going into the for loop and more about really having the conversations and interactions that help shape inclusive conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.675,
    "end": 3043.017,
    "text": "And there isn't a script or an algorithm for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.153,
    "end": 3056.917,
    "text": " So as the ground shifts beneath our feet with what kinds of projects have what kind of technical hurdles for even small groups, that continues to evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.117,
    "end": 3061.038,
    "text": "So that's one very interesting angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.539,
    "end": 3063.479,
    "text": "For sure, for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.499,
    "end": 3064.219,
    "text": "I couldn't agree more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.28,
    "end": 3071.641,
    "text": "And then one angle to kind of connect to active inference and our area here is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.928,
    "end": 3097.467,
    "text": " the kinds of information ecosystems that are arguably always existed but today coming into our conscious design and control these ecosystems of communication have all kinds of cognitive entities they have true natural humans they have dows they have organizations they have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.576,
    "end": 3105.681,
    "text": " augmented entities, people who are using typos and spell check all the way on through people who are doing social engineering scams like you brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.322,
    "end": 3114.928,
    "text": "And there are also increasingly purely digital entities in these information ecosystems or ecosystems of shared intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.488,
    "end": 3117.33,
    "text": "And so from our community,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.91,
    "end": 3133.721,
    "text": " We see that an important technology will be composable and flexible graphical architectures, statistical models that help us describe communication patterns amongst and within different plural publics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.742,
    "end": 3140.03,
    "text": " So that instead of just saying, well, it's happened to turn out how it's happened to turn out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.531,
    "end": 3145.438,
    "text": "And here's how I'm feeling arbitrarily about whether we should go this way or go that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.458,
    "end": 3150.124,
    "text": "We can have something like a design suite that allows people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.885,
    "end": 3174.69,
    "text": " a visualized and executable conversation so people can say actually i'd like if the small teams were four people instead of three how could we do that how could we re-render our organization to do that differently and what might be some of the consequences and so again without going into technical details a policy that you similarly abided by hopefully in the coming years",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.35,
    "end": 3183.331,
    "text": " it'll be easier than ever to make those kinds of statistical analyses of cognitive entities more available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.172,
    "end": 3185.392,
    "text": "Yeah, no, I couldn't agree more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.432,
    "end": 3188.232,
    "text": "And I'm very supportive of the work active inference is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.272,
    "end": 3204.055,
    "text": "And yeah, no, I can't express the need for those types of research problems, but also building the tools to enable that kind of inference to make people actually take action on it too, in a way that doesn't detriment the decision-making that we have already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.274,
    "end": 3235.093,
    "text": " great well what are your closing words or thoughts or exhortations maybe like the last thing I'll say and I just like can't reiterate it anymore is like this is like a really cool time to like be working or thinking and having fun sparring with people in this space and like if you just engage even in the slightest way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.768,
    "end": 3243.652,
    "text": " and do it in a way with a bit of optimism and not too much of long-termism and the world's going to collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.692,
    "end": 3246.213,
    "text": "At least that's how I try to go about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.233,
    "end": 3248.194,
    "text": "It feels refreshing a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.703,
    "end": 3259.951,
    "text": " Cause there's like, if you can band together a group of people who want to do this properly, I think that it's, it's a lot of opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.971,
    "end": 3263.075,
    "text": "So find ways to like engage in a way with optimism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.116,
    "end": 3265.619,
    "text": "And I think that we can build some really cool stuff together if so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.331,
    "end": 3290.707,
    "text": " amazing well the body doesn't have a long-term plan it also only has a sequence of short-term plans and so that is absolutely the question and the positive approach to approach it expecting and preferring survival and flourishing and then enacting short-term actions so that we can really make it work long term",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.876,
    "end": 3296.92,
    "text": " And like we also may not have 10 years like we may only have like a year or two to like get this done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.94,
    "end": 3299.582,
    "text": "So it's also there is like urgency, I guess, in that as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.663,
    "end": 3311.791,
    "text": "And so it's like, yeah, like I just say start like get going if you're not already going or like just ramp it up because we like this is not something to like this is a short term need we need to start acting on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.448,
    "end": 3316.329,
    "text": " Thank you, Shrey, for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.349,
    "end": 3317.39,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3317.41,
    "end": 3321.513,
    "text": "Hope everybody checks out the paper and future developments of the work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.354,
    "end": 3323.715,
    "text": "Thank you, Daniel, and the Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.735,
    "end": 3324.396,
    "text": "Yeah, see you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.056,
    "end": 3325.596,
    "text": "Till next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.877,
    "end": 3326.197,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]