[
  {
    "start": 9.818,
    "end": 11.641,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 12.523,
    "end": 14.767,
    "text": "It is July 17th, 2025.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 14.847,
    "end": 26.428,
    "text": "We're in Active Inference Guest Stream 114.1 with several of the authors of How do Inner Screens enable imaginative experience?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 26.769,
    "end": 30.696,
    "text": "Applying the Free Energy Principle directly to the study of conscious experience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 31.469,
    "end": 36.918,
    "text": " Thank you to the authors who have joined and to Koya for precipitating this stream.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 37.859,
    "end": 47.735,
    "text": "So without further inner screen stream ado, Chris, please, however you'd like to take it and I'll scroll to wherever you need.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 50.059,
    "end": 51.541,
    "text": "Okay, thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.182,
    "end": 54.726,
    "text": "Thank you, Adam and Maxwell for being here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.993,
    "end": 82.958,
    "text": " and thanks to our other co-authors who are not here for whatever reason one of which is because we changed the schedule on this presentation by an hour at the very last moment so we just wanted to talk a little bit about this paper and then open it up to questions so it'll be it's good that that you have some questions prepared so what's the basic motivation here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 83.883,
    "end": 86.346,
    "text": " The basic motivation is simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.148,
    "end": 96.379,
    "text": "If one looks at any kind of standard active inference picture of what's going on, in the middle of that picture is a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.719,
    "end": 99.983,
    "text": "And in fact, we could look at figure one because that illustrates this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.605,
    "end": 105.17,
    "text": "And this is all very familiar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.21,
    "end": 110.937,
    "text": "One has some system that's interacting with some environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.575,
    "end": 114.039,
    "text": " And the interaction is mediated by a boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.62,
    "end": 121.49,
    "text": "And the boundary is what keeps the states of the system conditionally independent from the states of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 121.51,
    "end": 122.852,
    "text": "It's called a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.114,
    "end": 127.78,
    "text": "In the quantum formulation of the FEP, it's a holographic screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.0,
    "end": 129.783,
    "text": "They have exactly the same function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.924,
    "end": 135.752,
    "text": "They encode information flowing from the environment to the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 136.152,
    "end": 137.835,
    "text": "That's called sensation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.575,
    "end": 162.777,
    "text": " and they encode information that's flowing from the system to the environment that's called action of course that's what it's called from the system's point of view from the environment's point of view the system's actions are its sensations and the environment's actions are the system's sensations so it's all a completely symmetric system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.145,
    "end": 193.101,
    "text": " with this Markov blanket boundary in between that encodes the information exchange from one to another so now in this standard picture if we ask what can the system possibly be conscious of there's a fairly obvious answer it can be conscious of its sensations and maybe conscious of its actions because all that's data that's written on its Markov blanket",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.621,
    "end": 217.705,
    "text": " and then in some vague sense maybe it's conscious of something that's going on inside it and that's where the the problem is what does it mean to say that a system is conscious of internal states or internally generated experience and in the most straightforward reading of the fep",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 218.393,
    "end": 245.177,
    "text": " uh that simply doesn't happen all that's going on internally is some dynamical system doing its thing some bunch of physics uh some vector floating around in a state space and we can make this very precise in the quantum formulation and the quantum formulation what's going on inside the system may just be a unitary evolution of some pure state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.63,
    "end": 274.995,
    "text": " in some almost isolated hilbert space and so on the inside of the system at least in the quantum formulation it's very easy to stipulate that there's no classical information at all nothing that could be experienced no definite states that aren't big superpositions of all the possible values of all the possible degrees of freedom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.764,
    "end": 306.703,
    "text": " so at least in that way of thinking or in that formulation if there are no boundaries inside the system that function as markov blankets there's no possibility of inner experience and if there are boundaries in the inside of the system that function as markov blankets then the experiences encoded on those boundaries are the experiences of the systems that are bounded by those boundaries",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 307.19,
    "end": 307.691,
    "text": " i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 307.931,
    "end": 310.755,
    "text": "of parts of the system, not the whole system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 312.357,
    "end": 332.022,
    "text": "So in this way of thinking about the FEP, which is, again, is kind of the most straightforward possible way of thinking about it, what a system experiences is only the data that's written on its Markov blanket, either by its environment or by itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.205,
    "end": 336.167,
    "text": "So the motivating question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.653,
    "end": 361.918,
    "text": " for this paper is how do we account for imaginative experience in that kind of model and the answer is pretty obvious we've got to invoke some sort of inner boundary or inner markov blanket or inner screen that mediates this experience and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 362.219,
    "end": 385.948,
    "text": " we've got to somehow see the agent of interest as being inside that boundary so that's what we do in this paper um so if you daniel would please fast forward to figure three there it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.907,
    "end": 414.045,
    "text": " uh i don't know whether it's any it's possible to make that a little bit bigger on the screen but yeah that's better um this is kind of a stripped down picture of an active inference agent that's complicated enough to have several perception action loops which we've labeled qrf for quantum reference frame which is the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.548,
    "end": 441.99,
    "text": " representation of our perception perception action loop and the quantum formulation and what controls these uh perception action loops specifically by allocating attention to them and we think of attention in again the simplest possible way as allocating energy to allow the things to actually function",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.168,
    "end": 470.29,
    "text": " um what controls all that is some sort of executive system which is a meta controller or a meta processor in a kind of software language or software architecture language and since these perception action loops are exchanging information with this meta controller there must be a boundary inside and that boundary defines",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 470.641,
    "end": 500.597,
    "text": " what the meta controller experiences what the meta controller experiences is the activity state of the perception action loops that's what it's trying to control and it also experiences whatever output they give it so they might identify some object and tell the meta controller oh that's a table or that's a conspecific or that's a predator or that says something else and this system as a whole",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.083,
    "end": 528.002,
    "text": " experiences what's written on its boundary which is labeled b here by its environment so we have two different kinds of experience going on now we have an experience on an outer screen which is information encoded by the by the environment or information encoded by the system's actions and information on this inner screen called bmc",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.573,
    "end": 531.257,
    "text": " which is just the experience of the metacontroller.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.038,
    "end": 539.848,
    "text": "But it's also the experience of the perception action loops that they get from the metacontroller.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.908,
    "end": 544.074,
    "text": "So they can experience the data that the metacontroller writes on their boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.456,
    "end": 552.625,
    "text": "And these sort of black things that look like valves at the top are meant to indicate the flow of control, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.665,
    "end": 557.652,
    "text": "the flow of energy, resources, memory,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.458,
    "end": 571.298,
    "text": " precision, whatever you want to call it, from some resource pool to these perception action loops or QRFs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.78,
    "end": 581.092,
    "text": "So this simple architecture does not encode or support any kind of perceptual experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.112,
    "end": 586.761,
    "text": "So it doesn't support visual imagination or inner speech",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.382,
    "end": 588.704,
    "text": " or anything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.846,
    "end": 610.943,
    "text": "And we can claim that based on two or three decades now of cognitive neuroscience, which indicate that imagination, at least in humans and presumably in mammals and probably in vertebrates,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.227,
    "end": 636.002,
    "text": " employs the same kind of input processing that perception does up to a few details so when you have a some sort of imaginative visual experience or or when you engage in inner speech um your fairly low level perceptual processes are engaged and this is fairly well documented so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 636.269,
    "end": 643.896,
    "text": " So imagination is not just something that, for example, the prefrontal cortex does or the executive network does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.317,
    "end": 646.238,
    "text": "It involves the sensory systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.6,
    "end": 662.554,
    "text": "So to make a model of imagination in this active inference framework that's realistic for the animals that we know about, we need to engage these perceptual modules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.155,
    "end": 665.837,
    "text": "So the solution to doing that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.357,
    "end": 693.242,
    "text": " um is actually pretty straightforward and if you'll scroll down to figure four please daniel what we do is just add another boundary and this boundary is labeled b in in this picture and we make the stipulation that b in uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.302,
    "end": 720.394,
    "text": " can and typically does encode all of the information that's on the boundary that's labeled here be out which is the markov blanket around the whole system and that bn is what what the system experiences and this picture is complicated by issues of control not only does the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 720.863,
    "end": 748.862,
    "text": " the system the executive system or the meta controller need to manage the activity of the perception action modules these qrfs it needs to manage the flow of information between be out the boundary that the environment can write directly on and be in and most of the time it's going to leave those channels open",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.125,
    "end": 777.752,
    "text": " but it needs to be able to close them for example by closing the eyes or stopping up the ears or something like that and then it can allow these perception action modules to see information that either themselves or other perception action modules have written on this inner boundary",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.048,
    "end": 806.035,
    "text": " so if you look at this picture and think about popular architectures like the global workspace then clearly what we've done here is just distribute the global workspace between the meta processors boundary and the inner screen boundary and we've also indicated by the red horizontal arrows here that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.47,
    "end": 836.275,
    "text": " sometimes the meta controller may not actually be possible to completely suppress a channel from the external environment so even when you're sleeping and dreaming for example a loud enough noise can typically wake you up and if you're driving on the highway and sort of idly reminiscing about something events on the highway can rapidly bring you to your senses or else you die",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.233,
    "end": 864.422,
    "text": " so uh there's heavy evolutionary pressure to keep these channels openable by the external environment and in mammals at least that's implemented by the ventral attention system which can override the dorsal attention system and say no pay attention no kidding that thing in front of you is a tiger so that's what we've done in this paper architecturally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.229,
    "end": 883.976,
    "text": " has kind of followed the standard active inference architecture to one logical conclusion about experiencing the content that's created inside the system as if it was content created outside the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 885.838,
    "end": 893.97,
    "text": "And the remainder of the paper talks about what we know about this capability, the capability of imagination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.739,
    "end": 923.333,
    "text": " and um the short answer is we know a lot more about it than we did say 20 years ago but we know a lot less about it than we like to so we know very little for example about its phylogenetic distribution we can look at lots of kinds of animals including birds and octopi and certainly mammals",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.393,
    "end": 949.337,
    "text": " and infer that some of their behavior is playing and some of that play behavior at least may be driven by internal imagination we don't know we can look at human variation and see a lot of differences in human capabilities to have imaginative experience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.397,
    "end": 979.172,
    "text": " so for example uh i'm pretty incapable of having visual imaginative experience aside from diagrams and so are a lot of other people um we know that imaginative experiences are involved in various ways in pathology so uh for example uh we know that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.962,
    "end": 1008.383,
    "text": " one symptom of some sorts of schizophrenia involves uncontrolled imaginative experience or failures of what's called the reality monitoring system confusion between internally generated experience and externally generated experience so a lot turns on how imagination is implemented and so it's important",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1009.156,
    "end": 1036.699,
    "text": " uh for the active inference project to have an implementation of act of imaginative experience that's fully consistent with all of the other uh architectural assumptions of of active inference so that's what we're trying to provide here and uh we've hopefully provided a very simple um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1037.455,
    "end": 1045.225,
    "text": " bare bones kind of minimal assumption model of what's required for this kind of phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.847,
    "end": 1063.969,
    "text": "And hopefully the model is detailed enough to be able to provoke or at least encourage various further experimentation into exactly how imaginative experience works",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.776,
    "end": 1083.207,
    "text": " in the at this point only system where we really have uh access to reports of imaginative experience even though they may not be very reliable and that is us so um that's kind of a summary of what we're doing in this paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.811,
    "end": 1106.089,
    "text": " and i'm happy to um answer questions or or if they're not questions for for me defer them to my colleagues who know much more about various aspects of this topic than i do well if i could prompt you uh in a specific direction i think one one nice thing to maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.39,
    "end": 1133.933,
    "text": " discuss that was a great presentation of the work by the way thank you for being uh so you know thorough and comprehensive um i was wondering if you had a few words maybe to add on the neo-cartesian angle so i think there's a sense in which the work that we've done here kind of vindicates something like a naturalization of the homunculus it certainly makes a lot of these ideas a lot less um silly sounding do you do you have a view there",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1135.55,
    "end": 1161.203,
    "text": " Well, I would say it only vindicates, in the same way that the global workspace model does, the idea of an inner screen, an inner locus, if you will, of classical information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.47,
    "end": 1190.481,
    "text": " in what could be an otherwise quantum system or an otherwise boundaryless internal boundaryless system it says that to explain certain sorts of phenomenology you need to have some such construct where it differs from the classical homuncular picture which may of course be a parody",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.355,
    "end": 1219.877,
    "text": " is that the systems that can experience what's on the inner screen are in a very real sense smaller than the entire system and one way in which they're smaller is that there has to be stuff between the inner screen and the outer screen and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1220.38,
    "end": 1234.098,
    "text": " That stuff architecturally is not experienceable by the system inside the inner screen in this picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.94,
    "end": 1249.678,
    "text": "The other way that it differs is that the executive system and the executive system plus the perception action loops",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1250.182,
    "end": 1280.02,
    "text": " have very different experiences um and in a lot of kind of i'll call it folk psychology uh the experiencing agent is more or less equated with its metacognitive system so um if i say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.843,
    "end": 1309.973,
    "text": " i'm currently experiencing x that's by definition a report from my metacognitive system and because it has to be looking at what's going on inside my cognitive system my total cognitive system and i think one implication of this kind of work is that those reports are always unreliable because the metacognitive system is always working with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.408,
    "end": 1321.103,
    "text": " a very stripped down, coarse-grained, abstracted, reportable experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.786,
    "end": 1330.537,
    "text": "So what I say I'm experiencing is actually not a very good guide to what I'm actually experiencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1331.999,
    "end": 1339.69,
    "text": "And a corollary of that is what I can remember experiencing is not a terribly good guide to what I'm actually experiencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.577,
    "end": 1350.743,
    "text": " so it it does make those challenges to kind of folk psychological notions of kind of inner life",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1353.743,
    "end": 1354.504,
    "text": " Yeah, thanks for that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1354.744,
    "end": 1357.848,
    "text": "That was very interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1357.888,
    "end": 1362.313,
    "text": "So I know, Adam, yeah, you unmuted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1362.653,
    "end": 1364.776,
    "text": "I was hoping you also had something to add to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1364.796,
    "end": 1375.448,
    "text": "I know neo-Cartesianism has been one of the things that, like, I think I got the, you know, I was first introduced to this idea by you and Sam Vasey about at the same time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1375.949,
    "end": 1381.455,
    "text": "So hopefully this also sparks, you know, interest, maybe even joy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1381.604,
    "end": 1393.47,
    "text": " interest joy and uh trepidation like i guess i can blame you for partially like not giving up on the idea because it's so unpopular because it's just like you know dennett was like so like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.108,
    "end": 1412.826,
    "text": " clear and firm on this point and so many people joined him on like Descartes errors and I mean clearly there are problems there and like I can't deny what like you know what Chris is saying about like we can't just like blindly trust like folk psychology or our introspective access and we know there has to be distortions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.194,
    "end": 1435.05,
    "text": " But I guess one thing I was wondering about is whether some quasi-Cartesian intuitions might actually reflect both joints in phenomenological space and potentially guides to how they're realized, like in terms of what sorts of implementations or computational objects they might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.587,
    "end": 1445.764,
    "text": " And so this work from Chris, it comes from a very different background, even though I'm also inspired by the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.824,
    "end": 1456.262,
    "text": "Chris is coming from the fundamental physics and how quantum systems must have a singular interface or locality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1456.242,
    "end": 1465.78,
    "text": " is created in order to achieve... I'm going to butcher what I'm saying, but the way you're approaching this is very different from me, but very convergent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.182,
    "end": 1495.362,
    "text": " And so then this idea of an inner screen, that's something I was suggesting from my reading of both cognitive neuroscience, like neuroimaging literatures, and also attempts at trying to make cross-mappings between machine learning architectures and understandings of neural function and how you might interpret the brain as a kind of hybrid machine learning architecture and generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.342,
    "end": 1512.912,
    "text": " So in some of the work, some of it explored with Tim Verbalen in the context of robotics, the idea is like interpreting the brain as a cybernetic controller for an embodied agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.195,
    "end": 1515.179,
    "text": " That's your slam paper with Tim, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1515.5,
    "end": 1516.502,
    "text": "Yeah, the slam paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.582,
    "end": 1517.224,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1517.364,
    "end": 1517.785,
    "text": "Very cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1518.126,
    "end": 1525.742,
    "text": "What's cool is in this work, they have basically one of their core data structures they use for robot autonomy is a view and oppose network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.762,
    "end": 1532.436,
    "text": "And so I don't want to over-interpret or over-stress the connection, but I've sometimes somewhat fancifully, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.416,
    "end": 1538.743,
    "text": " perhaps I should just commit to the crime, thought of as almost like a kind of quasi-Cartesian theater in homunculus and their relation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.803,
    "end": 1551.779,
    "text": "And the idea is you have the view of the robot and its pose as being two very closely entangled data structures that are basically almost heavily mutually informing each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.179,
    "end": 1561.41,
    "text": "Because what you're seeing is informed very heavily about where your sensors are pointed, and that also what you're seeing gives you a sense of what your body is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.778,
    "end": 1563.521,
    "text": " And so these are the two primary data structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.541,
    "end": 1570.915,
    "text": "And these are also, if you look at, I guess, neural real estate and cortical hierarchies, the brain is dominated by vision and then touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.777,
    "end": 1579.551,
    "text": "And so the idea I've been exploring, and it wasn't, I keep being drawn back to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.531,
    "end": 1601.016,
    "text": " It's not part of the hardcore of any theory that if it was falsified, it wouldn't disprove the overall framework, but if it was shown to be evidenced, I think it would provide some support, is that potentially inner portions of the cortical hierarchy as a kind of shared latent workspace",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.283,
    "end": 1613.486,
    "text": " could potentially operate by principles of geometric deep learning and potentially correspond to something like a visuospatial modality and a somatospatial modality, which are mutually coupled and informing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.368,
    "end": 1616.592,
    "text": "Something like a Cartesian theater and a homunculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.926,
    "end": 1635.137,
    "text": " And the idea being that this being something like an inner screen and observer, even though it's not really strictly the sense that you don't have homuncular regress and that it's not like you have the clear problem of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.607,
    "end": 1653.272,
    "text": " adducing a fully competent homunculus as an explanation which requires a homunculus inside it, the idea of something like a centralized body-like data structure in relation to something like a centralized visuospatial modality, and that these two mutually informing each other is part of what brings coherence to the sensorium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.173,
    "end": 1660.602,
    "text": "So in Chris's work here, it's like showing how, like in coupling quantum systems, you need a kind of singular interface",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.885,
    "end": 1663.574,
    "text": " to establish locality and coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.614,
    "end": 1668.752,
    "text": "I'm going to need you to, like, rescue me, Chris, because I shouldn't be speaking until I'm speaking at the school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.12,
    "end": 1676.99,
    "text": " But at least shamanistically, I interpret this as a kind of convergence of some quasi-Cartesian intuitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.391,
    "end": 1680.615,
    "text": "Now, how far you want to go with them, I don't want to say we've vindicated folk psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.115,
    "end": 1686.222,
    "text": "And the points you made about you know introspection has to get it wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.504,
    "end": 1691.108,
    "text": "It's the whole point of maps have to be simpler than their territories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.128,
    "end": 1691.829,
    "text": "They have to diverge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.59,
    "end": 1695.634,
    "text": "But I do wonder whether...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.783,
    "end": 1724.254,
    "text": " what you've arrived at here could actually provide some uh vindication for some folk intuitions of a of a quasi-cartesian variety of the kind even that um dennett for all those years cautioned us against that's you know i i know that's that's my personal inter um uh one of the ways i'm uh thinking of this but you know i i know it's like nothing you're suggesting actually firmly establishes that or depends on it or right so that's my ramble i don't know if that made any sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.707,
    "end": 1725.869,
    "text": " I thought that was a great ramble.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1726.409,
    "end": 1729.674,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.714,
    "end": 1748.04,
    "text": "Yeah, what Dennett and others fundamentally cautioned against was kind of regressive homuncularism, where every layer basically has the same conceptual structure and every layer has basically the same experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.362,
    "end": 1753.988,
    "text": "And of course, that won't do, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.288,
    "end": 1780.633,
    "text": " so i think what the what the markov blanket construction i think forces us to do is be very careful about saying",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1781.592,
    "end": 1808.916,
    "text": " who has access to what information within any complicated layered hierarchical multi-component cognitive system and um because it it any such um componentization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.018,
    "end": 1837.519,
    "text": " makes each of the components an agent and so each of the components has an environment that they exchange information with and so i think what the what the fep encourages is just being very careful about that and um not assuming that a component has access to information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.292,
    "end": 1842.417,
    "text": " that it can't get from some part of its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.079,
    "end": 1859.236,
    "text": "So if we think of multiple components interacting with a shared memory, which is basically what the GNW is, then they have access to whatever information is written in the shared memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.278,
    "end": 1866.544,
    "text": "And that's not kind of a difficult thing to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.705,
    "end": 1897.307,
    "text": " and that information may be fairly rich but what it isn't is the same as the total experience of any combination of those systems uh each each system has its own experience of whatever is written in that shared memory and kind of the broadest",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.726,
    "end": 1925.269,
    "text": " brush access to that information is is more or less by definition what we call the meta controller the executive system or something along those lines but again that's that's always coarse-grained so i yeah i i don't think the two views are inconsistent i think well the if the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.536,
    "end": 1951.813,
    "text": " the active inference picture of things is is just a way of being precise about it thanks um do you want to ask one of your questions sweetie yeah i was um i was thinking about the uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.975,
    "end": 1963.036,
    "text": " A metacognitive system is like a place to gather the memories or it's like the reason why we have shared memories in the first place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1963.497,
    "end": 1970.933,
    "text": "That way around, like a locus to which the memories of the other systems can be shared to or something like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1972.803,
    "end": 1975.387,
    "text": " But yeah, that's highly speculative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1975.747,
    "end": 1983.719,
    "text": "So I was thinking like one thing we didn't talk about at all was this like the quantum reference frames.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1985.401,
    "end": 1991.53,
    "text": "What we understand under this, we skip like the figure and where they end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1992.231,
    "end": 1997.239,
    "text": "It's like the coarse grained structure on the retina or something like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1997.539,
    "end": 2001.004,
    "text": "Is this part of quantum reference frames or are they starting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2001.642,
    "end": 2031.261,
    "text": " uh later in the hierarchy with concepts like a gestalt or something like that um here so that would be one question um how deep the quantum reference frames we are looking here in the inner screen are i just lost your audio oh i just lost you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2032.81,
    "end": 2037.316,
    "text": " Oh, could the other person hear me or is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.258,
    "end": 2040.82,
    "text": "Yeah, just repeat the question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2042.402,
    "end": 2045.686,
    "text": "Yeah, so we didn't look at the quantum reference frames.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2045.826,
    "end": 2046.687,
    "text": "Can you hear me, Chris?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2047.388,
    "end": 2047.588,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2049.711,
    "end": 2050.492,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2050.532,
    "end": 2052.615,
    "text": "So we didn't talk about the quantum reference frames.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2053.676,
    "end": 2059.343,
    "text": "And so one question would be, what are they in a short answer?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2059.563,
    "end": 2062.547,
    "text": "And then another question related to this is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2062.949,
    "end": 2088.737,
    "text": " um how deep in the neuronal architecture are we talking about here so um are we talking about like something like pixels or a single um receptors in the retina or are we talking about gestalt representations further down in the hierarchy um so all um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2090.557,
    "end": 2095.646,
    "text": " Yeah, so how deep does this kind of reference frames that are in the inner screen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2099.213,
    "end": 2101.837,
    "text": "OK, well, yeah, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.378,
    "end": 2105.644,
    "text": "I can answer both of those, at least to some extent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2107.167,
    "end": 2113.138,
    "text": "So this construct of a quantum reference frame that we use,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2117.742,
    "end": 2143.935,
    "text": " is is actually a very old idea that's been formally updated in the last two or three decades uh really under pressure from the quantum communication and quantum security communities so in classical physics you have things called reference frames",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2144.658,
    "end": 2171.728,
    "text": " uh for example cartesian coordinates or a reference frame and um these are things that we use so clocks meter sticks all of those are reference frames what does that mean well it means two things a reference frame is both a standard",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.333,
    "end": 2200.197,
    "text": " so it defines a kind of unit for example the meter and it's a way of measuring so a meter stick lets you measure things in meters so it's those two concepts kind of bundled together and in classical physics these things are treated as abstractions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.442,
    "end": 2227.703,
    "text": " uh if you read einstein's work for example he's constantly talking about moving frames of reference etc and observers sitting on moving frames of reference and reporting what they see and on and on and on so as quantum information started to become a discipline it was recognized early on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.105,
    "end": 2240.063,
    "text": " that this purely abstract way of thinking of reference frames wouldn't do, that the physicality of reference frames actually had to be taken into account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.406,
    "end": 2244.831,
    "text": "So a meter stick is not an abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2245.452,
    "end": 2247.034,
    "text": "It's an actual object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2248.356,
    "end": 2254.045,
    "text": "It's a piece of wood or a piece of metal that we hold in our hands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2255.257,
    "end": 2282.344,
    "text": " and we use it to interact with the world and those interactions are actually forceful they require energy and so on so measurement uh is not this completely passive abstract thing where by magic you get some information uh you have to actually kind of whack the world with something with your meter stick",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.729,
    "end": 2312.584,
    "text": " to get some information out of it and that's the fundamental reason for things like heisenberg's uncertainty principle so if you think about reference frames in this physical way and then you think about observers as physical systems like us and you ask so what's required for me to be able to use a meter stick uh i used to have one around here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.935,
    "end": 2314.297,
    "text": " but I don't see it right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.24,
    "end": 2324.849,
    "text": "So if I have this object, a meter stick, and I want to measure length, then I have to have some concept of what length is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.671,
    "end": 2329.574,
    "text": "And that concept has to be encoded in my brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.896,
    "end": 2334.4,
    "text": "It has to be part of me as a physical device.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.462,
    "end": 2339.145,
    "text": "And if I use a clock,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.75,
    "end": 2369.571,
    "text": " i have to have some sense of time i have to be able to notice that the hands on the clock have moved for example so i have to have a clock in my head i have to actually be a clock in order to use a clock somewhere out in the external world otherwise i won't even notice that the clock is moving so that led us to think about what does it mean to say that the observer implements",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.243,
    "end": 2399.052,
    "text": " uh quantum reference frames that components of the observer actually are quantum reference frames and we know from neuroscience for example that the hippocampus encodes a very sophisticated 3d reference frame and we know that some of the perihippocampal areas encode fairly fairly sophisticated clocks so we're not making this up it has some connection to neuroscience it's not completely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.74,
    "end": 2426.946,
    "text": " theoretically motivated so now we can ask uh what how do we want to conceptualize these things and again we think of meter sticks and clocks as just objects in the environment and they may do something like clocks they may have to use energy and they may just sit there like meter sticks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2428.293,
    "end": 2435.202,
    "text": " And they may be outcomes of some complicated physical process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2435.282,
    "end": 2446.316,
    "text": "So, for example, if I want to define what up means, if I'm measuring spin, I'm generally going to do it with reference to the Earth's gravitational field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.357,
    "end": 2449.059,
    "text": "Well, what's that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.281,
    "end": 2454.226,
    "text": "It has something to do with the curvature of local spacetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.246,
    "end": 2457.49,
    "text": "But it defines an external reference frame that I can use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.959,
    "end": 2464.226,
    "text": " I can use the gravitational field or the magnetic field to think about what up means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.769,
    "end": 2482.448,
    "text": "But that requires that I have some representation, that I implement some representation that lets me access by interaction that external direction, directionality, either magnetic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.542,
    "end": 2484.623,
    "text": " or gravitational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.724,
    "end": 2487.587,
    "text": "And we know that we use gravity all the time to move around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.607,
    "end": 2492.533,
    "text": "That's one of the key features of our bodily system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.535,
    "end": 2499.963,
    "text": "We know that birds, for example, use magnetism in migrating, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.063,
    "end": 2504.649,
    "text": "So again, this is stuff that we know about from a neuroscience perspective also.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.151,
    "end": 2511.017,
    "text": "So to sort of come to a close on the first question,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2512.162,
    "end": 2539.907,
    "text": " a quantum reference frame in this way of thinking is a component of the internal process of some observer and you can think of as a component of the internal process of some organism and theoretically that internal process is just some dynamical system or can be represented by some hamiltonian operator or something simple",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.579,
    "end": 2570.552,
    "text": " and of course we have no clue about how to write those operators down but formally they're easy to play with so you can think of a quantum reference frame as just some components of a dynamical system or a hamiltonian so now the question of of how deep are they and that's a subtle question because one can construct an arbitrarily deep hierarchy of operators",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.253,
    "end": 2583.31,
    "text": " And if those operators all have a property, so in quantum theory, for example, all measurement operators are Hermitian, which just means that their eigenvalues are real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.371,
    "end": 2586.695,
    "text": "The outputs that they give you are real numbers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2586.835,
    "end": 2593.485,
    "text": "And so you can, since they're finite resolution, you can think of the outputs as binary numbers, some bit strings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2595.001,
    "end": 2612.366,
    "text": " You can construct an arbitrarily large hierarchy of these operators, and the whole hierarchy will be Hermitian, so it will look at the world and give you a real bit string, provided one condition is met, and the condition that has to be met is the operators have to commute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.948,
    "end": 2616.992,
    "text": "That's what those arrows mean in this diagram that's on the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2620.718,
    "end": 2646.557,
    "text": " and in quantum physics and classical physics of course all operators commute but in quantum theory they don't so quantum theory has the great advantage of giving us a formalism that automatically lets us talk about failures of commutativity which means that if i do operation a and then b i get a different answer than if i do b and then a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.056,
    "end": 2653.483,
    "text": " And clearly a lot of our interaction with the world has that structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2654.324,
    "end": 2660.231,
    "text": "If I do one thing and then another thing, the second thing often depends on the result of the first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.312,
    "end": 2664.897,
    "text": "And it can depend causally or it can depend non-causally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.197,
    "end": 2669.322,
    "text": "And if it depends non-causally, then that's quantum non-communitivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.983,
    "end": 2671.465,
    "text": "Both kinds occur all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2672.828,
    "end": 2702.818,
    "text": " so one advantage of the quantum formalism is that it allows you to deal with non-commutativity between operators which translates as the inability to define joint probability distributions over sets of variables but if you can define a joint probability distribution over a set of variables however large it is you can define one qrf over it and so you can think of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.828,
    "end": 2732.316,
    "text": " um things that for example in the dorsal early dorsal visual system uh identify moving edges okay that's a reference frame that identifies moving what moving edges you can identify lots of those in the visual field or you can think of something that identifies chairs or you can think of something that identifies scenes or you can think of something that identifies short",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.954,
    "end": 2761.527,
    "text": " histories of different scenes and as long as those the operators that build up those identifiers commute you can think of that as one quantum reference frame so you automatically get a very deeply hierarchical system that nonetheless divides splits into fragments when you have operators operations that don't commute",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2761.878,
    "end": 2784.696,
    "text": " when looking at the world changes it you know yeah um you want to respond or ask anything else for you please yeah thanks for the uh answer uh really interesting um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2786.92,
    "end": 2793.007,
    "text": " I was thinking about what to do with Adam's questions or remarks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2795.11,
    "end": 2798.233,
    "text": "Should I address them now or later?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2799.975,
    "end": 2800.236,
    "text": "Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2800.256,
    "end": 2802.138,
    "text": "Do you want to talk about it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2802.598,
    "end": 2803.339,
    "text": "Your thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2812.39,
    "end": 2814.092,
    "text": "Should who address what?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2814.578,
    "end": 2819.325,
    "text": " Adam wrote four messages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2819.765,
    "end": 2823.27,
    "text": "Yeah, Adam, if you write something in the chat, please say it on the street.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2825.894,
    "end": 2826.274,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.276,
    "end": 2842.577,
    "text": "So, Chris, in your work in terms of quantum interpretations of the FEP, some people might...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.777,
    "end": 2847.621,
    "text": " pattern match and then say like, oh, you mean like orchestrated reduction and like quantum computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.382,
    "end": 2853.906,
    "text": "But no, it's like a quantum formalism for the use of quantum formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.047,
    "end": 2870.961,
    "text": "And it makes me wonder, like, you know, I reached the limits of my technical depth here, but in terms of like how far we can go with like which, you know, quantum intuitions and interpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.001,
    "end": 2872.362,
    "text": "So like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.713,
    "end": 2893.658,
    "text": " So for instance, when you're thinking of interacting neuronal populations, as they're coming in and out of coherence, and they have probabilistic properties to where they're at in terms of their degree of coherence as they form, they couple with various types of synchrony, these interacting clouds of neurons,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.33,
    "end": 2914.17,
    "text": " Is there a sense in which part of the reason you could get quantum formalism from a neuronal system is because of its probabilistic nature, like some sort of mapping between Bayesian brain-like ideas, like the born rule of total probability?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.032,
    "end": 2920.557,
    "text": "But one of the things I was wondering is, so if there is this requirement for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.127,
    "end": 2950.105,
    "text": " order to get coherence about multiple observers with their multiple reference frames that you get this like establishment of a singular um interface across them with like um locality and um also coherent temporality uh but locality at least as i understand it um could this for instance like um so is this like requirements maybe something that's also sculpted by natural selection or development to some degree like genetics helps along but like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.54,
    "end": 2970.169,
    "text": " Could this be part of what, could this get, as a precondition for coherence, as like normal populations find ways of, and they interact in different ways to achieve coherence, that they establish the creation of an inner screen with locality as part of this requirement for coherent coupling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.91,
    "end": 2973.173,
    "text": "And so it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.389,
    "end": 2974.232,
    "text": " Again, a ramble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.713,
    "end": 2985.627,
    "text": "But thinking about quantum derivation of inner screens, it makes me wonder about quantum formalism as a source of mathematical interpretations of neural functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.91,
    "end": 3010.669,
    "text": " CF Bayesian brains and born-world tool probability, where they're interacting around populations as fuzzy-blanket probabilistic sets, each with their own reference frame, induce the formation of semi-centralized inner screens as a couple due to the requirement of its creation for coherent coupling with its locality and temporality, informational properties, and this also providing a source of phenomenal coherence slash binding as a source of something like a quasi-Cartesian inner theater,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.375,
    "end": 3017.722,
    "text": " and perhaps even a basis for egocentric, projective, geometric, visuospatial awareness and sensation slash imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.023,
    "end": 3019.584,
    "text": "So that's a lot of different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.625,
    "end": 3039.087,
    "text": "But I'm wondering, I'm at the limits of my technical depth here of where I should and shouldn't go with drawing from ideas from quantum physics and whether what I said is somewhat in the ballpark of mappings between neural functioning and quantum formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.429,
    "end": 3067.605,
    "text": " yeah i i think this is very much worth pursuing um i i wouldn't be surprised if neuronal coherence is not constantly essentially drawing different boundaries in the nervous system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.48,
    "end": 3091.922,
    "text": " across which classical information is forced to flow one reason for thinking that is that phase coherence is so important and phase coherence is i mean quantum coherence is a measure of a particular kind of unobservable phase coherence and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.341,
    "end": 3121.15,
    "text": " phase coherence is something that we can't observe locally right we as as outside observers can observe phase coherence locally unless we just happened to look at the right two neurons or the right two parts of some assemblage right we won't notice that this one over here happens to be phase coherent with that one over there unless we're looking correctly and that's kind of what unobservability means um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3121.906,
    "end": 3133.843,
    "text": " There's reasonably good experimental evidence that human cognition exhibits intrinsic contextual or non-causal contextuality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.966,
    "end": 3142.856,
    "text": "The relevant work was done by Edebar Zafirov and Andrei Krennikov and their collaborators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3144.097,
    "end": 3150.867,
    "text": "It's very careful experimental work and they understand the mathematics intimately well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.5,
    "end": 3176.77,
    "text": " uh so from that perspective i mean krunikov insists on causing calling it quantum-like but i think if if it can only be described correctly using the quantum formalism you might as well just call it a quantum phenomenon because quantum theory doesn't have any",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.053,
    "end": 3206.385,
    "text": " intrinsic scaling or anything like that i mean we associate it with the microscopic for historical reasons but black holes are quantum objects which are some of the biggest things we know anything about um so i think i think there's a lot to be done there i i think um probably the formalism that quantum theory provides",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.007,
    "end": 3230.061,
    "text": " will actually make it much simpler to think about neural behavior because it does build in these kinds of phenomena like phase coherence that we know experimentally are important but we we lose our ability to think about when we just think about things like firing rate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.635,
    "end": 3238.676,
    "text": " That was super interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3238.816,
    "end": 3240.779,
    "text": "I am going to have to drop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3240.819,
    "end": 3243.081,
    "text": "Unfortunately, I had a hard stop now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3243.882,
    "end": 3245.284,
    "text": "But I think Carl just joined us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3245.364,
    "end": 3245.965,
    "text": "Is that the case?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3249.89,
    "end": 3251.291,
    "text": "Yes, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.511,
    "end": 3252.012,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.513,
    "end": 3253.534,
    "text": "So it's like a relay race.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3253.614,
    "end": 3255.216,
    "text": "It's good to hear from you, Carl.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3256.918,
    "end": 3259.481,
    "text": "So have a good rest of the conversation, everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3259.501,
    "end": 3260.242,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3260.863,
    "end": 3261.523,
    "text": "Thank you, Maxwell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3262.485,
    "end": 3262.745,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.765,
    "end": 3263.506,
    "text": "Thanks, Maxwell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.707,
    "end": 3265.448,
    "text": "Good to see you all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3266.423,
    "end": 3279.539,
    "text": " Yeah, I'm going to have to depart fairly soon, but I can at least briefly bridge to Carl's part of the conversation, if you all want to carry on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.162,
    "end": 3294.237,
    "text": "What's happened so far, Carl, is just a brief description of what the paper is about, followed by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.347,
    "end": 3300.312,
    "text": " some conversation about what quantum reference frames are, what inner screens are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3301.353,
    "end": 3324.477,
    "text": "And we're just getting to, thanks to Adam, a discussion of how coherent activity among distributed neurons may draw different effective",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3325.081,
    "end": 3347.73,
    "text": " uh boundaries and hence create construct different effective markov blankets within the system so you know you know far more about this than i do i suspect not but thank you for orientating me",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.74,
    "end": 3361.462,
    "text": " Maybe to connect with the earlier discussion and continue on, Carl, how would you see this in light of the theater discussion and responses?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3362.504,
    "end": 3370.377,
    "text": "What unique explanations and predictions come from bringing this work together",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3370.357,
    "end": 3393.9,
    "text": " that were absent packets and parcel and other work that had active inference perspectives on awareness and consciousness but not the quantum do you want to just unpack the theta issue it it came up a little bit but please however you want to summarize and continue",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3394.808,
    "end": 3400.955,
    "text": " For my benefit, just to sort of focus me, what specifically were you referring to when talking about theatre?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.996,
    "end": 3406.622,
    "text": "Like your paper response to the theatre critics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3408.304,
    "end": 3409.645,
    "text": "Oh, the theatre.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.665,
    "end": 3412.228,
    "text": "Sorry, I thought you meant theatre rhythms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.029,
    "end": 3413.75,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3415.933,
    "end": 3416.974,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.994,
    "end": 3417.975,
    "text": "I was in a different world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.356,
    "end": 3419.016,
    "text": "My apologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.337,
    "end": 3420.518,
    "text": "Let me orientate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.02,
    "end": 3424.663,
    "text": "My response to the theatre critics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.352,
    "end": 3427.434,
    "text": " Oh, that was with Alan Hobson, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.575,
    "end": 3429.597,
    "text": "So that was some time ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.617,
    "end": 3430.158,
    "text": "2016.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.559,
    "end": 3431.82,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.14,
    "end": 3433.522,
    "text": "Yeah, well, that's nearly 10 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3434.122,
    "end": 3437.666,
    "text": "Can you remind me what you took from that paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.65,
    "end": 3442.152,
    "text": "I'll just summarise from the abstract.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3442.192,
    "end": 3453.705,
    "text": "You wrote, In brief, we fully concur with the theatre-free formulation offered by DeLega and Dewhurst and take the opportunity to explain why and how we use the Cartesian theatre metaphor.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3454.242,
    "end": 3479.457,
    "text": " do this by drawing an analogy between consciousness and evolution the analogy is used to emphasize the circular causality inherent in free energy principle aka active inference earlier times we conclude with a comment on the special forms of active inference that may be associated with self-awareness and how they may be especially informed by dream states and it was in that sort of era with the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3481.04,
    "end": 3489.031,
    "text": " I think therefore I am and the early sorts of recursive Bayesian models that you are proposing and working on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3490.273,
    "end": 3496.982,
    "text": "So how do you feel like this paper extends and continues in that line?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3497.022,
    "end": 3506.035,
    "text": "What do we gain in terms of explanation and prediction from bringing in the quantum formalism?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3509.896,
    "end": 3527.232,
    "text": " I can only answer that really from a classical perspective, but I think a lot has been added to the stories and a lot of nuances has crept into it, which is nicely framed by the quantum information theoretic formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.233,
    "end": 3536.32,
    "text": "I'm trying to cast my mind back a decade and what was around then and what is around now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.58,
    "end": 3539.903,
    "text": "And certainly there's a lot more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.355,
    "end": 3560.811,
    "text": " literature addressing consciousness in its various guises and in particular my mind goes to a direct confrontation of issues of experience and phenomenology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.331,
    "end": 3584.149,
    "text": " um and within that space the role of um hierarchies and specifically the role of um markov blankets in defining those kinds of hierarchies which begs the question if there are hierarchies in the brain first of all",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.483,
    "end": 3604.595,
    "text": " is there an irreducible Markov blanket in the sense that there can be no further sparsity of coupling or conditional independences or dynamical architectures that admit any further Markov blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.675,
    "end": 3609.242,
    "text": "So this was one of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.437,
    "end": 3620.059,
    "text": " contributions from the classical perspective to an early formulation of the paper that Chris has just taken us through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.393,
    "end": 3633.956,
    "text": " The other thing that's brought to the table is, if there are Markov blankets within a brain, what constitutes the active states of any of these internal Markov blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.597,
    "end": 3636.34,
    "text": "So that becomes an interesting focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.941,
    "end": 3645.456,
    "text": "And the story that people like Lars Sandvich-Smith and company, including people like Mark Soames would pursue,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.925,
    "end": 3661.475,
    "text": " is that the way that you act upon things lower in, say, a centripetal or centrifugal hierarchy would be primarily through mechanisms like attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.078,
    "end": 3666.685,
    "text": "Again, in the classical context would be read as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.188,
    "end": 3690.158,
    "text": " optimizing the precision or the confidence ascribed to various representations at lower levels and that's i think an interesting move because that weds the psychological interpretation of that gain control active gain control to attention in the psychology literature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.577,
    "end": 3719.672,
    "text": " It also provides a nice link to Mark Soames's notion of felt uncertainty, remembering that precision is the complement or the inverse of uncertainty and that there are people who would regard any feelings or qualitative experiences would require there to be a mechanism in the brain that would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.652,
    "end": 3733.024,
    "text": " render what was transparent opaque, that would be attention or would, from the point of view of simulations, be the gain control that comes along with this kind of mental action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.244,
    "end": 3746.335,
    "text": "And I use the word mental action as another way of describing the role of, or the process that would be implicit in having active states on Markov blankets in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.656,
    "end": 3749.338,
    "text": "So we're talking about a covert kind of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.605,
    "end": 3767.378,
    "text": " And that covert action can be read as attention or it can be read as sort of actively selecting those sources of evidence for belief updating within on the internal side of the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.695,
    "end": 3793.618,
    "text": " so i think that's quite a nice story um that sort of is quite accommodating of a number of different perspectives and different kinds of formulation but let's come back to this notion of um an irreducible um markov blanket i think that that in itself is an interesting concept um and in many senses when i read chris talking about the inner screen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.105,
    "end": 3821.108,
    "text": " what could argue and indeed a lot of people do argue, Shamil being one of these people, Ruben along with Shamil being one of these people, that there are a whole host of inner screens and I think the most recent analogy is that of these smart glasses that through mental action you can render opaque or transparent with screen after screen after screen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.742,
    "end": 3824.524,
    "text": " So what is the inner screen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.386,
    "end": 3836.961,
    "text": "And to my mind, just in a very simple-minded way, that has to be the innermost screen that surrounds the irreducible Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.782,
    "end": 3840.526,
    "text": "And there's some interesting issues that attend that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.586,
    "end": 3844.952,
    "text": "Well, if this irreducible Markov blanket is responsible for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.303,
    "end": 3856.174,
    "text": " providing messages and if we take the quantum theoretic formulation then we're talking about the holographic screen that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3856.61,
    "end": 3865.626,
    "text": " is surrounding the irreducible bulk that constitutes this irreducible part of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.666,
    "end": 3874.601,
    "text": "And writing that classical information to the active sector of the holographic screen has to have consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.661,
    "end": 3875.703,
    "text": "And what are those consequences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.763,
    "end": 3876.745,
    "text": "Well, we've just said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3877.062,
    "end": 3898.142,
    "text": " um from a sort of neurophysiological point of view it has to engage those mechanisms that mediate gain control and immediately you're now drawn to thinking okay well that basically means that the projections of the inner screen um must in some way do some kind of attentional selection beyond",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3898.342,
    "end": 3905.078,
    "text": " the screen and that's the sort of mental action that I was referring to previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.118,
    "end": 3913.077,
    "text": "So I think the notion of the inner screen is something which we didn't have until a few years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.411,
    "end": 3933.192,
    "text": " and it if you like to my mind is is a denouement of um arguments that have been formalized and developed over over the past 10 10 years i'm not sure that speaks to the the inner the um the theater debates uh they were more predicated on um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3933.172,
    "end": 3954.37,
    "text": " if I remember correctly, a dual aspect monism that inherits from the two kinds of information geometries that you get from a classical physics perspective where you're linking the movement on a statistical manifold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.873,
    "end": 3969.777,
    "text": " to an information geometry which essentially encapsulates a belief space a little bit changing your mind to exactly the same or supervening on it on the same substrate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.263,
    "end": 3981.126,
    "text": " which would be a neuronal substrate that you could cast in terms of neural firing, that has itself an information geometry read as classical stochastic thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.447,
    "end": 3990.145,
    "text": "So whenever there's a space of probability distributions, say of the kind that underwrites statistical or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3990.53,
    "end": 4011.778,
    "text": " stochastic thermodynamics, there is a thermodynamics, so there's a natural link there between the energetics of the brain and the informational or representational geometry on two statistical manifolds that supervene on the same substrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.758,
    "end": 4017.204,
    "text": " Perhaps I should pass back to Chris now, who hasn't gone away, so he's still here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.446,
    "end": 4029.318,
    "text": "Chris would wrap up that thermodynamic aspect into a thermodynamic free energy sector on the holographic screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.059,
    "end": 4034.644,
    "text": "I think there's an interesting discussion here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.81,
    "end": 4062.825,
    "text": " um as to whether there is a dual aspect well whether there are any information geometries in the spirit of um the uh statistical manifolds and if there are how are the thermodynamic versus the um the classical information structures linked and i'll have a rest now was that good enough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.565,
    "end": 4064.566,
    "text": " Thank you very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4065.067,
    "end": 4065.267,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4068.352,
    "end": 4069.453,
    "text": "Wow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4069.934,
    "end": 4075.582,
    "text": "I want to change directions away from the theater to something else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4077.244,
    "end": 4085.135,
    "text": "In the paper, you talked about the phylogeny of imagination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4085.416,
    "end": 4090.703,
    "text": "And you gave some reasons why the second layer in the screen",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4091.459,
    "end": 4105.958,
    "text": " was implemented and there was the event of a covert action, social situations could be better managed if some actions are covert and the other thing was the planning depth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4106.714,
    "end": 4131.321,
    "text": " um i was thinking maybe um um there's this cybernetic concept of second order observation to use the inner observation on something else to see what one person is using to experience this thing so to reflect on the own source and i think um this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4131.773,
    "end": 4156.667,
    "text": " idea of this inner screen uh could um yeah is really good at capturing this idea so we can use on the inner screen a quantum reference frame to look at another quantum reference frame and to look what a gradual reference frame we used there like um a second observation this could be maybe like another um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4157.963,
    "end": 4187.633,
    "text": " um advent for this kind of architecture or is the um could this be achieved with a without this in a screen yeah i i think a very good question is how does the system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4189.013,
    "end": 4191.637,
    "text": " represent its own capabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4195.341,
    "end": 4216.59,
    "text": "So in the kind of simple-minded picture that we drew, the metacognitive system or the controller, the attention system, has to know something about what the various perceptual and action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4217.127,
    "end": 4245.835,
    "text": " capabilities of the organism are good for so that it can decide what to spend energy on what to spend energy doing and this we know that this goes way way down in phylogeny so uh we know that even bacteria have very sophisticated ways of um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.114,
    "end": 4256.283,
    "text": " for example, swapping in or out whole metabolic pathways to deal with different food sources that are present in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4257.124,
    "end": 4273.78,
    "text": "And a key discovery from the 60s and early 70s was how this works, how the food source itself is perceived and how the perception of a food source can trigger",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4274.435,
    "end": 4295.92,
    "text": " uh the expression of whole families of genes that then encode enzymes for metabolizing and using that food source so you can think of that in terms of meta control and you can think of that as a system saying oh here's something in the environment that tells me",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4296.524,
    "end": 4317.874,
    "text": " that i should turn off a whole bunch of my information processing and turn on a whole other bunch of my information processing so in a sense i should switch what i'm paying attention to and switch what i'm doing about it i should turn on whole different perception and action capabilities as units",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.693,
    "end": 4325.742,
    "text": " So we know that that kind of capability is extremely deep in phylogeny.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.022,
    "end": 4328.606,
    "text": "All organisms have that kind of capability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.908,
    "end": 4347.895,
    "text": "So when we get up to these very complex organisms that actually have brains, we can ask, what's the analog of that at the level of, for example, neural representations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.111,
    "end": 4368.583,
    "text": " in the motor system of what the arms or hands can do uh and how those representations are engaged when you're faced with a problem like picking up a coffee cup or you know getting a nail out of a board to the hammer um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.407,
    "end": 4383.061,
    "text": " your system, and this is not consciously very accessible information, of course, kind of knows how to use the capabilities of the limbs to do these jobs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4384.903,
    "end": 4398.317,
    "text": "And so I think a question for the discussion that Carl was just enunciating about attentional control",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4399.394,
    "end": 4424.777,
    "text": " and metacognitive representation is this question of how the system represents its own capabilities, from how to use its limbs to how to manage its immune system, the sorts of things that Mark Solms is very engaged with, to much more abstract things like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4426.343,
    "end": 4431.03,
    "text": " Now, do I have the cognitive wherewithal to read this paper and understand it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4432.532,
    "end": 4436.518,
    "text": "We do have some sort of understanding of that that's difficult to articulate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4438.721,
    "end": 4445.972,
    "text": "So I think all of those questions are aspects of exactly the same kind of question of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.509,
    "end": 4465.632,
    "text": " internal resource representation or internal capability representation which an attention system has to have it's if it's going to function in a to do the job that an attention system has to do so i'm i'm afraid i'm going to have to depart too now um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.371,
    "end": 4486.219,
    "text": " but please carry on as long as you like and uh thankfully this is being recorded so i can see at some later time what was said in this latter part so thank you carl for joining and uh thank you all for for being here and being interested thank you chris",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4488.848,
    "end": 4517.353,
    "text": " okay does anyone have a comment or question or i can read uh some of the questions in the live chat yes carl well yeah i'm just picking up on on that last question which i thought was extremely interesting i noticed you put the um strange things paper up on the on the chat i think that was that was quite astute of you because um the very notion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.738,
    "end": 4544.472,
    "text": " of an inner screen tells you immediately that anything lying behind that inner screen does not have direct access to the actuators to the active states of any cell or any person or indeed any population and that has quite a fundamental implication because if you can always read the internal states within a Markov blanket as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.025,
    "end": 4571.91,
    "text": " or at least describe them as making inferences about the cause of their sensory sector, what that means is that the internal states behind the inner screen will also be representing in some sense, in some minimal sense, their own actions, because the actions are going to be vicariously a cause of the sensory impressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.021,
    "end": 4575.046,
    "text": " or the sensory sector of the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.246,
    "end": 4585.311,
    "text": "That's quite remarkable because what that basically means is that if you have an inner screen, you effectively are inferring what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.153,
    "end": 4590.523,
    "text": "You have Bayesian beliefs about your own behaviour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.077,
    "end": 4597.464,
    "text": " you're not directly aware of in the sense that there's a dynamical coupling between your active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.426,
    "end": 4603.592,
    "text": "Say, for example, the primary afferents going to your spinal cord.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.652,
    "end": 4613.023,
    "text": "So the spinal cord knows exactly the consequences of its action, but the central nervous system or parts of it behind the inner screen do not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.884,
    "end": 4616.747,
    "text": "So you've now got this interesting situation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.217,
    "end": 4639.765,
    "text": " where you've got beliefs posterior beliefs or you can be described as having as if you had posterior beliefs about your own action now if you've got posterior beliefs you must have prior beliefs if you've got prior beliefs about your own action before it's happened you have intentions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.437,
    "end": 4647.658,
    "text": " So at some level there's a bright line between things that do and do not have intentions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.441,
    "end": 4654.378,
    "text": "And I would, you know, just coming back to Chris's examples of, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.0,
    "end": 4657.242,
    "text": " the base of phylogenetic trees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.263,
    "end": 4659.345,
    "text": "Perhaps it would be even simpler just to go for a thermostat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.745,
    "end": 4666.413,
    "text": "A thermostat has direct access to the consequences of its action, whereas I do not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4667.214,
    "end": 4672.079,
    "text": "So you could argue, is there a different kind of intentionality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.319,
    "end": 4678.226,
    "text": "Or does a thermostat have intentions in the same spirit that I have intentions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.626,
    "end": 4684.753,
    "text": "And if your answer is yes, then largely you are...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.24,
    "end": 4710.724,
    "text": " answering or you are making that discrimination or disambiguation between things that are and are not intentional on the basis of possessing uh possessing an inner screen and then you can have a further argument which i suspect um um was um hinting at is um if i'm inferring what i'm going to do or to use chris's words what am i doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.548,
    "end": 4716.16,
    "text": " then the question is, on what temporal scale is the doing expressed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.842,
    "end": 4718.807,
    "text": "Am I leading a good life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4719.749,
    "end": 4720.912,
    "text": "Am I going to the shops?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.895,
    "end": 4724.983,
    "text": "Am I adjusting my posture to increase my comfort?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.807,
    "end": 4731.814,
    "text": " Am I reflexively responding to heart rate variability?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.195,
    "end": 4734.618,
    "text": "All of these are very different time constants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.118,
    "end": 4754.802,
    "text": "So I think there is a question now of the temporal depth of the imagination that would be effectively a description of the belief updating to evaluate, to infer what your intentions are or to form a posterior belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.372,
    "end": 4764.063,
    "text": " that will then be enacted by your reflexes, that is predicated on your prior beliefs about your action, namely your intentions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.523,
    "end": 4775.457,
    "text": "So I think there's possibly a vague spectrum of things that just look very myopically into the future, say viruses,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.96,
    "end": 4802.254,
    "text": " and things that look quite a long way into the future you know things things like you and me so i think there's some really interesting um like purely technical um things that attend any belief updating or any system that is equipped with an inner screen that can then be described as if it is doing a certain kind of belief updating and to finish um the the recursion and the metacognitive aspect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.757,
    "end": 4808.646,
    "text": " inherits from the fact that you don't have direct access to the consequences of your actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.062,
    "end": 4821.387,
    "text": "I'll ask a few related questions here in the chat.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4822.509,
    "end": 4827.617,
    "text": "So, Andreas asks, can we introspect our Markov blankets or not?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4830.533,
    "end": 4853.284,
    "text": " what is being observed who or what is there to observe that are you going to answer that daniel or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4858.951,
    "end": 4866.181,
    "text": " I think Chris would be the prime person to answer those questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4871.689,
    "end": 4881.203,
    "text": "I'm not sure in this section of the paper when there is a... Daniel, can you just scroll down just to make sure there's not a figure of R?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.423,
    "end": 4882.545,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.998,
    "end": 4884.641,
    "text": " Perhaps that was it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.582,
    "end": 4896.178,
    "text": "I think there's quite a straightforward answer to that question, just looking at the architecture of the kind that's being presented on screen now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.278,
    "end": 4904.01,
    "text": "So if there is any hierarchical or heterarchical structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.716,
    "end": 4924.4,
    "text": " induced by the sparse coupling of any dynamics, whether they're intracellular dynamics or whether they're the connectome in the brain, then that hierarchical structure just is defined by a series of nested Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4925.401,
    "end": 4932.63,
    "text": "And just to keep things simple, you can imagine a sandwich cake or a layer cake of Markov blanket after Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.032,
    "end": 4941.224,
    "text": " And from the point of view of any given Markov blanket, what is it seeing and who is it talking to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4941.465,
    "end": 4945.13,
    "text": "So the Markov blanket is just an expression of the inputs and the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4945.791,
    "end": 4956.407,
    "text": "So in this simplified picture of concentric or layer cakes or hierarchical subsumption hierarchy of Markov blankets, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.4,
    "end": 4964.587,
    "text": " Effectively, one level is basically seeing the outputs of another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4964.907,
    "end": 4968.311,
    "text": "So it's basically seeing the active states of another level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.052,
    "end": 4980.283,
    "text": "And the active states of the given level, say level I, now provide the inputs, namely the sensory states of the level below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.763,
    "end": 4985.668,
    "text": "And this becomes particularly obvious when you think about predictive coding hierarchies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.104,
    "end": 4999.253,
    "text": " So predictive coding hierarchies, you have this notion of ascending and descending messages, where the ascending messages are effectively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4999.452,
    "end": 5013.897,
    "text": " free energy gradients or the prediction errors, usually precision weighted prediction errors that ascend from lower levels of the hierarchy, lower Markov blankets, if you like, to the next Markov blanket, which would be the next level up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.179,
    "end": 5022.692,
    "text": "And then they are reciprocated, inducing the circular causality, which you always require when thinking about anything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5022.993,
    "end": 5026.997,
    "text": " embedded in its environment by descending predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5027.637,
    "end": 5031.881,
    "text": "So the actual message is what is seen and what is acted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5032.241,
    "end": 5050.958,
    "text": "Well, in this instance, we're associating action with descending predictions, but usually those predictions are going to be of precision to do the selection we were talking about, but more generally, we can think of them as basically actions on the level below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5051.174,
    "end": 5068.293,
    "text": " So what that basically means is that if I'm on Markov blanket and I have hidden states behind me, I am basically trying to make sense of the prediction errors that are coming from the Markov blanket below me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.414,
    "end": 5077.603,
    "text": "And in making sense of those, I am now acting on those blankets by issuing predictions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.478,
    "end": 5084.429,
    "text": " that I am now going to be using in order to evaluate the prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.47,
    "end": 5098.714,
    "text": "And then if you actually write out the requisite variables in a predictive coding scheme and just look at the links, you can quite easily identify the implicit Markov blankets layer after layer after layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.595,
    "end": 5111.036,
    "text": " Do we have more questions from the chat?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5114.7,
    "end": 5117.162,
    "text": "Do you want to ask any?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5117.422,
    "end": 5121.466,
    "text": "Or I can get into the one chat.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5121.626,
    "end": 5128.393,
    "text": "I have another question from the figure four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5128.913,
    "end": 5131.516,
    "text": "Can you stay there on the figure four?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5133.838,
    "end": 5139.163,
    "text": "Like every credit reference frame has in and outside",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5139.852,
    "end": 5145.059,
    "text": " connection to the executive or metacognitive screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5146.481,
    "end": 5155.735,
    "text": "But the thermodynamic free energy distribution quantum reference frame, the top one, has only an input.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5155.775,
    "end": 5164.026,
    "text": "The output is then through valves that co-regulate, I guess, the quantum reference frame activation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5165.108,
    "end": 5169.454,
    "text": "So yeah, I was thinking, why is there only one direction?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5170.244,
    "end": 5192.775,
    "text": " And isn't then the teo-dynamic free energy distribution quantum reference frame, that's a terrible name by the way, isn't this then higher in the hierarchy than the executor, which could be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5193.667,
    "end": 5206.341,
    "text": " answer to the question that Dorsal attention overrides like the other, something like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5206.361,
    "end": 5207.162,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5207.182,
    "end": 5219.556,
    "text": "Yeah, I think a related question that I have to that is like, if layers beget another layer, then what is structurally different about the inner screen",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5221.358,
    "end": 5225.002,
    "text": " Does it imply similar awarenesses?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5227.765,
    "end": 5240.878,
    "text": "Where does the narrative self-identification relate to these finite hierarchies which come to a stop just through the finiteness of things?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5247.145,
    "end": 5250.488,
    "text": "But that might be a Chris question related to this diagram.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5251.7,
    "end": 5265.533,
    "text": " I guess sort of just in a closing-ish round from Adam and Carl, how do you see this work going forward?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5265.593,
    "end": 5270.438,
    "text": "What would you be looking to reduce your uncertainty with further?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5271.459,
    "end": 5276.864,
    "text": "What kinds of predictions or experiments do you feel like came out of that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5277.124,
    "end": 5281.268,
    "text": "Or how did the discussions of the authors relate to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5283.695,
    "end": 5305.99,
    "text": " what takeaways and what research directions arise now maybe adam first well i never know actually um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5308.67,
    "end": 5333.968,
    "text": " first like to be surprised um in terms of um uh just seeing like independently can like what people come up with because you know i approach this from a very different take um than being like grounded in the formalism you know i've come from like a systems neuroscience and cybernetic perspective um but it's like the ways there are differences are in some ways most interesting to me but also the points of convergence but the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.948,
    "end": 5346.49,
    "text": " I guess wondering how far we could go with the quasi-Cartesian interpretations, like not going too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5346.773,
    "end": 5362.138,
    "text": " But going far enough, I'm wondering whether it can bear, it's like earlier Carl mentioned like mental transparency, but like what different aspects of consciousness studies and phenomenologies can be elucidated by further developments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5362.158,
    "end": 5370.992,
    "text": "So something I posted in the Zoom chat was like, there's been suggestions of, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.972,
    "end": 5378.563,
    "text": " there being potentially a Bayesian blurb problem and interpretations of the brain as a generative model that could produce awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5378.603,
    "end": 5381.347,
    "text": "Like, why doesn't experience seem probabilistic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5381.367,
    "end": 5382.849,
    "text": "Like, why don't we get superpositions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5383.37,
    "end": 5384.531,
    "text": "Why does this seem so classical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5385.232,
    "end": 5396.929,
    "text": "And so, like, Andy Clark, for instance, discussed this in terms of, like, the requirement of consciousness in terms of its functional role as being coupled to mental action or policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.365,
    "end": 5410.788,
    "text": " And that doesn't seem incompatible with what's being proposed here, but I wonder to what degree is this inner screen having classical properties part of what mediates this transition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5411.429,
    "end": 5422.208,
    "text": "Or rather part of what would explain another way, not necessarily mutually exclusive because the screen is helping for precision waiting and mental action and attentional selection, but to what degree is this another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5422.745,
    "end": 5449.326,
    "text": " uh complementary or separate um solution to the so-called bayesian blur problem um to the extent that it is a problem um and one more thing i guess i would wonder is in terms of like unpacking quasi-cartesian intuitions is so like in the work with like tim like these like two data structures they have are like a view network and a pose network that are like closely coupled for like the state of the um embodied agent relative to the world or for the robot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.593,
    "end": 5459.748,
    "text": " And something I would wonder is this inner screen, to what extent does it have the properties that would correspond to some of the phenomenology of space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.97,
    "end": 5463.413,
    "text": "To what degree is it connected to visual spatial awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.375,
    "end": 5466.538,
    "text": "But to what degree does it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5467.328,
    "end": 5469.211,
    "text": " connects to somatospatial awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5469.231,
    "end": 5471.295,
    "text": "Is that subsumed into visuospatial awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.315,
    "end": 5472.316,
    "text": "Is there only one modality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.677,
    "end": 5473.618,
    "text": "Are there multiple spaces?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5473.779,
    "end": 5484.797,
    "text": "These are, I guess, questions I've wondered about in terms of what is the relationship between what phenomenologists might sometimes describe as the lived body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.777,
    "end": 5489.003,
    "text": " and what the folk might call or what people might call the mind's eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5489.544,
    "end": 5499.739,
    "text": "So I have a lot of different questions and wondering whether further developments of this theory could constrain some of the many places I have uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.432,
    "end": 5514.261,
    "text": "So just to pick up on some of the key issues that Adam's just foregrounded for us,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5514.578,
    "end": 5521.706,
    "text": " So the Bayesian blur, I only understand through Andy Clark's writing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.866,
    "end": 5532.017,
    "text": "And I think Adam picked up on a very important point there that comes back to what we're talking about before in terms of the differences between intentions and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5532.718,
    "end": 5534.48,
    "text": "Action is a real variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.9,
    "end": 5536.102,
    "text": "It's not a random variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.402,
    "end": 5538.324,
    "text": "You can only infer a random variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.185,
    "end": 5543.59,
    "text": "So that means that your actual action, including your mental action,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5543.992,
    "end": 5567.502,
    "text": " is not a random variable and it cannot have a probability distribution it just is so the manifestation of your mental actions can't have a base in blur um just in a very simple-minded way that can also be read in terms of the act of selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5567.65,
    "end": 5590.384,
    "text": " you can only select one of many things um and that's why i quite like it when people use the word selection or attention selection or selecting this as opposed to that um and that the act of selection is you know selection is a verb uh and it does speak to the the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.972,
    "end": 5600.754,
    "text": " discrete aspect or the unitary aspect of manifesting your intentions that cannot have a Bayesian blur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5600.774,
    "end": 5605.445,
    "text": "So I think that that's an interesting thing that inherits from the inner screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5606.247,
    "end": 5609.554,
    "text": "The other interesting thing is that the inner screen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5610.445,
    "end": 5637.651,
    "text": " because it can no longer the innermost screen my apologies because it can no longer be sub-partitioned thereby enabling more and more abstract explanations for parts of the inner screen the only way that it can know itself is by acting on its world because its world is just the rest of the brain for us or the rest of the cell for a bacteria",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5639.42,
    "end": 5643.807,
    "text": " which means that it can only know itself through acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5643.867,
    "end": 5648.955,
    "text": "And that's quite unique to the inner screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5648.995,
    "end": 5654.343,
    "text": "And what does that mean in terms of future research?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.824,
    "end": 5657.047,
    "text": "Well, it means that there may be one or more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.087,
    "end": 5659.23,
    "text": "I'm not saying there's just one inner screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5659.27,
    "end": 5662.255,
    "text": "There could be a number of them in a heterarchical structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5662.235,
    "end": 5670.944,
    "text": " But it does beg the question now, what is the functional anatomy of this inner screen from a biological point of view?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.845,
    "end": 5687.922,
    "text": "And that's why I sort of deliberately emphasised the neurobiology and the neuropharmacology of this mental action a la Mark Soames, because we know there has to be connections from the inner screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5688.323,
    "end": 5696.566,
    "text": " to the cells of origin are the things that do the mental action, which ultimately reduce to classical ascending neuromodulatory systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.886,
    "end": 5700.797,
    "text": "So we've got a good start in principle for the neurobiology of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.25,
    "end": 5709.402,
    "text": " On the other hand, you might start to apply these ideas and the predictions to artificial consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.482,
    "end": 5716.072,
    "text": "So we wanted to simulate consciousness, or perhaps we were worried about the ethics of AI alignment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.392,
    "end": 5718.415,
    "text": "Can machines suffer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.395,
    "end": 5720.298,
    "text": " Are they self-aware?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5720.618,
    "end": 5731.334,
    "text": "And all of these questions, I think, rest very much upon the functional architectures and the implicit information geometries that you are literally in a position to build.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5731.835,
    "end": 5736.322,
    "text": "And then you're asking questions about, well, where would self-awareness live?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5736.763,
    "end": 5746.377,
    "text": "Well, it would have to live in that inner screen, or in that innermost screen, because as every time you move behind these successive screens,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5746.627,
    "end": 5757.108,
    "text": " you are, from a technical point of view, compressing your fantasies about what's causing your sensorium of sensorium of sensorium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5757.91,
    "end": 5765.766,
    "text": "And that compression ultimately reduces to the simplest explanation for my sensorium in that it's me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.91,
    "end": 5790.623,
    "text": " so you have the which is just another hypothesis but it's a nice simple explanation for gathering together all these different modalities that adam's talking about sort of visual uh visual modalities the auditory the interceptive um all of these can be jointly explained by a very simple hypothesis oh i am an embodied artifact more precisely",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5790.94,
    "end": 5796.39,
    "text": " It's not just I am one, because if there was just one hypothesis, there would be no hypothesis to select from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.75,
    "end": 5798.253,
    "text": "So there'd be no active selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5799.455,
    "end": 5800.757,
    "text": "So you would never know that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5801.118,
    "end": 5810.434,
    "text": "But as soon as you have different hypotheses about you in different states of mind or you in different states of being,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5810.903,
    "end": 5837.451,
    "text": " you can now act upon your brain and ultimately your body to contextualize and gather evidence yes i am in this state of mind uh everything that i'm receiving from my interceptive modalities visual modalities auditory modalities tells me that currently i am scared you know i'm in a dark alley in a city that i do not know my my heart is racing and i feel um petrified",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.937,
    "end": 5842.606,
    "text": " The best explanation for this is that it is me in this particular state of mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5844.029,
    "end": 5850.822,
    "text": "If I know I'm in that state of mind, then I can act by selectively attenuating or attending to various sources of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5852.064,
    "end": 5856.132,
    "text": "I will probably, in this instance, attend acutely to my auditory modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5856.112,
    "end": 5869.112,
    "text": " less to my visual, but also attend acutely, or in fact, I will actually attenuate my attention to my bodily states in preparation for flight and fight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.513,
    "end": 5884.195,
    "text": "And of course, in so doing, I will engage different kinds of reflexes and generate more evidence that I am in a state of panic, angst, or at least arousal and alertness that would prepare me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.765,
    "end": 5907.972,
    "text": " to come back to where i started you know would you want to build that into a into a robot you might well do if you believe people like yosha back for example you know if you want um if you want to elude the singularity then he would argue you really need to make our artifacts as conscious and empathetic as we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.39,
    "end": 5918.165,
    "text": " So you might have to move in that sort of biomimetic direction in order to guarantee true AI alignment right across the board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5922.651,
    "end": 5926.998,
    "text": "A great place to take it and leave it for now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5928.1,
    "end": 5931.124,
    "text": "So thank you to the authors for",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5931.155,
    "end": 5949.754,
    "text": " very provocative paper and for joining this discussion and to okoye for precipitating it and giving a lot of thought to it as well so best of luck till the next screen stream thanks bye bye",
    "speaker": "SPEAKER_06"
  }
]