[
  {
    "start": 1.112,
    "end": 1.432,
    "text": " Good luck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.294,
    "end": 3.434,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7.256,
    "end": 8.297,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.917,
    "end": 10.618,
    "text": "Yes, we are in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.299,
    "end": 12.3,
    "text": "It is January 23rd, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.54,
    "end": 16.963,
    "text": "We're here in Active Inference guest stream number 34.1 with Avril Guedin-Carloux.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.008,
    "end": 33.113,
    "text": " We're going to have a one-hour presentation, Physics of Creation, Can the Free Energy Principle Ground the Construction of Physical State Spaces, followed by about an hour discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.614,
    "end": 39.436,
    "text": "So if you're watching live, please feel free to add questions in the live chat, and we'll also have some guests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.137,
    "end": 44.159,
    "text": "So thank you, Avil, for joining, and off to you for the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.3,
    "end": 46.64,
    "text": "Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.94,
    "end": 51.262,
    "text": "So this is a complete presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.313,
    "end": 55.535,
    "text": " I will first introduce myself and the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.695,
    "end": 56.695,
    "text": "I am Avelina Calu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.775,
    "end": 57.976,
    "text": "I have a diploma in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.296,
    "end": 62.778,
    "text": "I'm working in cognitive science under the vision of Andy Clark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.298,
    "end": 80.346,
    "text": "This work is, institutionally speaking, the product of Kairos Research, which is a laboratory which myself, Alexey Rozanski, who is present here today, and other people are funded to investigate issues of relevance through political evolution and cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.559,
    "end": 85.14,
    "text": " And the topic will be on the physics of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.2,
    "end": 89.801,
    "text": "So creation is an atypical term, let us say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.501,
    "end": 102.584,
    "text": "It will be contextualized in presentation, but let us first define that it corresponds to the construction of physical possibilities, physical set spaces to talk in a more technical language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.484,
    "end": 107.225,
    "text": "And the original question that motivated this research is whether or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.109,
    "end": 120.238,
    "text": " The French principle, a piece of math that emerged in the cognitive science, which we will get to very soon, is capable of representing this process of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.979,
    "end": 127.723,
    "text": "So first, I have tried the first run of this without getting into the technicals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.243,
    "end": 131.946,
    "text": "It did not work, so I will address the technicals first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.546,
    "end": 136.529,
    "text": "We will see some concepts in physics, what they do, how they work,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.173,
    "end": 142.355,
    "text": " how they relate to what people typically do in physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.175,
    "end": 146.217,
    "text": "And first, I'd like to take a look at how physics explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.437,
    "end": 148.338,
    "text": "So physics explain with laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.018,
    "end": 152.239,
    "text": "They think that in nature, you have laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.139,
    "end": 157.801,
    "text": "And those laws are basically formal statements that constrain the possible states of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.982,
    "end": 166.825,
    "text": "And typically, those are entailing laws from which you can derive logically what the system will do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.671,
    "end": 173.638,
    "text": " An example of natural entailing law is Maxwell's equation of electromagnetic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.078,
    "end": 176.962,
    "text": "It is a different Maxwell than the one that is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.89,
    "end": 196.061,
    "text": " So what you see is four bits of vectorial calculus that will tell you how two fields that are collectively the electromagnetic field evolve with regard to another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.722,
    "end": 205.027,
    "text": "So this is a formal constraint on what E and B can do, like the equality express constraint by definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.119,
    "end": 215.427,
    "text": " And those can be used to derive basically fully E and B given boundary conditions, which is how you do things in electromagnetism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.629,
    "end": 225.696,
    "text": "But what is of relevance here is that any of those law presupposes basically that I can define E as a vector field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.016,
    "end": 233.603,
    "text": "So it presupposes what is called a set space, which is mathematical space that represents the set of possible states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.315,
    "end": 245.558,
    "text": " Before I state delta E and delta B is equal to this and this, we have to state that E exists and E can take such and such states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.958,
    "end": 250.059,
    "text": "In that case, it is a vectorial space in three dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.58,
    "end": 262.442,
    "text": "And this set space basically does, by construction, to capture any difference that make a difference about the system that is targeted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.617,
    "end": 270.499,
    "text": " for any change in E to be basically computable by my theory, it has to be represented in the set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.179,
    "end": 284.302,
    "text": "So, by construction, I want the set space to categorify every variable of interest in my system, given the scope and measurement capabilities of my theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.803,
    "end": 291.204,
    "text": "You have an underlying notion that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.173,
    "end": 298.838,
    "text": " basically implicitly underlying the notion of flows and state space, that is the notion of symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.839,
    "end": 304.323,
    "text": "I cannot get into the gory detail here, but I will try to be as complete as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.343,
    "end": 314.251,
    "text": "We specifically understand physical theories outside specifically relativity theory and some weird quantum stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.775,
    "end": 317.056,
    "text": " to derive from symmetries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.516,
    "end": 328.702,
    "text": "Symmetries are, I will say it out loud, algebraic groups of transformation over the set space that do not affect the system's dynamics as presented as it's Laplacian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.502,
    "end": 331.303,
    "text": "You do not have to understand what I just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.343,
    "end": 338.007,
    "text": "What you have to understand is that there are ways in which I can transform the system which does not change what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.527,
    "end": 342.269,
    "text": "An example in the symmetries, the sailing of the Lodfola Moschee in Innsvall,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.112,
    "end": 348.356,
    "text": " you see that you have basically the same pattern that is repeated again, and again, and again, and again, readily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.776,
    "end": 355.261,
    "text": "So if I make a small rotation in either direction, it will not change a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.222,
    "end": 363.147,
    "text": "And if I repeat it, and repeat it, and repeat it, and repeat it, and repeat it, and repeat it, I will still change my system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.347,
    "end": 372.314,
    "text": "Formally, I will apply transformation, but it does not change, basically, what observable properties the system have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.76,
    "end": 377.923,
    "text": " And this is what a symmetry is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.423,
    "end": 387.109,
    "text": "It is a set of transformation that is generated by a subset of smaller transformation, and that does not change what a system observably is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.19,
    "end": 394.875,
    "text": "And because of this, symmetries of a system, they basically constrain what difference can make a difference about the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.776,
    "end": 400.019,
    "text": "So implicitly, when I formulate a law or set space,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.86,
    "end": 403.401,
    "text": " I make a statement about the underlying symmetries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.021,
    "end": 428.671,
    "text": "I make the statement that, basically, everything that is not in the system, that is not represented as part of the system, is something that is symmetric, that the system is symmetric with regard to, that on which any transformation will not affect the system trajectory, at least not in a way that is relevant to my theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.006,
    "end": 441.256,
    "text": " It works for physics because it looks like in physics we have few symmetries that are everywhere verified, that are fundamental in some sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.497,
    "end": 445.48,
    "text": "It doesn't work so well in life and mind because we don't have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.902,
    "end": 449.304,
    "text": "To be specific, living systems have a structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.565,
    "end": 453.028,
    "text": "I do not think it should be controversial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.934,
    "end": 455.355,
    "text": " And they have consecutive symmetries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.915,
    "end": 457.976,
    "text": "They have changes that will not affect them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.176,
    "end": 465.858,
    "text": "If I switch all of the carbon atoms in my body, I scramble them between each other while keeping the relation to the rest, it did not change a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.639,
    "end": 469.1,
    "text": "So it is very trivial in the sense of symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.14,
    "end": 479.743,
    "text": "But basically, every structure that is me entails symmetries, entails information that are possible that do not affect the structure and other that will affect it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.541,
    "end": 509.134,
    "text": " the structure it is not a given like symmetries are considered to be in physics it is actively reconstructed by the activity of me if i cut myself if i fall if my bone break they will regrow basically you will have cicatricial tissue that will occur and that will make it okay again and it will change what structure is my body most importantly um i i did i was not born that way like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.818,
    "end": 538.958,
    "text": " big and with a bird and with 80 kilo of meat i grew and i grew from one single cell and this single cell just created an anatomical structure um apparently ex nihilo from basically a genetic code in the context and not only that but life in and of itself evolves in a way that builds structure that builds symmetries and all of this means that you can't set a state space that is the space of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.881,
    "end": 541.903,
    "text": " life in general of any living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.583,
    "end": 549.489,
    "text": "The symmetries that underlie a system, they change through time and they change by the own activity of this system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.39,
    "end": 557.415,
    "text": "So any living system constructs set spaces and to account for it we need a theory of set space construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.796,
    "end": 567.163,
    "text": "This is the motivation of the physics of creation line of work and this is basically the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.268,
    "end": 569.329,
    "text": " I did not permit as a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.349,
    "end": 573.393,
    "text": "It is the question that we need to keep in mind in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.614,
    "end": 577.597,
    "text": "So, Daniel, do we have any question yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.822,
    "end": 582.262,
    "text": "Anyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.743,
    "end": 585.745,
    "text": "OK, no technical issue that I should know about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.765,
    "end": 585.805,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.104,
    "end": 600.43,
    "text": " So what we'll do is first look at basically what we say of creation in life and mind at a conceptual level, what is the history of the concept and what I want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.851,
    "end": 612.958,
    "text": "Then we'll look into the formal specifics of how we try to represent basically cognition as inference and what limits these attempts have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.419,
    "end": 619.242,
    "text": "And finally, we will take the reflection further and see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.051,
    "end": 631.596,
    "text": " whether we can and how far we can represent physical creation, the construction of physical reality, with the tentative formalism we have framed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.897,
    "end": 635.718,
    "text": "So, let us look at creation in life and mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.678,
    "end": 648.263,
    "text": "Historically, the term of creation refers to autopoiesis, that means literally self-creation, and that is an attempt by an activist, what became an activist,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.489,
    "end": 657.617,
    "text": " mainly Maturana and Varela, to ground the study of cognition, the study of biology and the way living systems work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.94,
    "end": 671.91,
    "text": "They framed autopoietic theory as basically the idea that cognition is grounded in a way that living systems construct itself, like their metabolism allows them to reconstruct a structure,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.931,
    "end": 677.453,
    "text": " and the structure does not have to be conserved by metabolism, so you have self-creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.994,
    "end": 683.056,
    "text": "And this is basically the concept that tried to articulate to ground cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 683.216,
    "end": 701.145,
    "text": "And later, Varela and colleagues tried to basically concretize this by working on how the cognition was enacted, which is, it is implemented in the body and in the concrete activity of living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.458,
    "end": 728.767,
    "text": " and this basically um was very determined in the history of cognitive science and it framed the um or e approach so the extension of cognition beyond the brain let us say very very uh tentatively uh the idea that they frame is that you have uh you can see the diagram that is taken from the paulo's work and i tried to um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.404,
    "end": 739.288,
    "text": " to explain the relation between self-constitution, so let us say it is a weaker, lighter, more specified notion of autopoiesis, and agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.848,
    "end": 749.152,
    "text": "The idea is that you have self-constitution, that is the fact living systems build themselves, and it is basically afforded by the way living systems couple with their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.692,
    "end": 759.777,
    "text": "An agency's lighter, higher order of regulation of this disability to define basically the terms of your coupling with the environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.446,
    "end": 789.521,
    "text": " and um the idea generates is that living systems there are systems that have a structural identity that they actively generate and sustain under precarious circumstances there is no benevolent universe that helps lives that help life be life life has basically to generate environment where it is life and doing so it generates and it sustains",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.456,
    "end": 792.258,
    "text": " what it is, its identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.798,
    "end": 799.384,
    "text": "And all of this is necessary for sense-making, so let us say cognition, to be something, to occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.085,
    "end": 812.395,
    "text": "And this is, in my opinion, and to some extent in Di Paolo's own opinion, somewhat wordy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.516,
    "end": 815.878,
    "text": "It is a lot of concepts, a lot of Greek words,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.761,
    "end": 821.285,
    "text": " And people have tried to frame this in a way that is more mathematical and formal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.406,
    "end": 844.445,
    "text": "And the question it generates is how to formalize this self-creative property of biological organization and cognition in a way that is basically grounded in a material information flow, in things that are concrete physical structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.667,
    "end": 850.029,
    "text": " We have a pretty good answer to that, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.529,
    "end": 859.073,
    "text": "We have a pretty good work that made a point that you had related this somewhat high-level concept to basic physical processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.153,
    "end": 871.378,
    "text": "This work is the work of Moreno, Mossio and Monteville, mainly, who work in, I forgot the name, but Institute of End Study in the Pays Basque, in Spain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.499,
    "end": 874.76,
    "text": "And the idea is that living systems are constituted by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.435,
    "end": 876.316,
    "text": " closure of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.636,
    "end": 882.28,
    "text": "So the constraint is a physical thing that shapes how other physical things work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.001,
    "end": 883.601,
    "text": "Very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.021,
    "end": 888.605,
    "text": "If I have air in a box that is closed and the air can't leave the box, it is a constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.466,
    "end": 901.114,
    "text": "And the property that individuates living things is the fact that they are constituted by a set of constraints",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.863,
    "end": 909.413,
    "text": " that canalize metabolism in a way that reconstructs the same system of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.155,
    "end": 917.564,
    "text": "And so from there you have self-constitution, you have also structural, let us say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.326,
    "end": 944.706,
    "text": " notion of biology that does not depend on the matter it is made of but on the way it is sustained that is i think pretty good if you want to have a physicalist notion of life and um we have a very basic ontology in which constraints they shape metabolism and just shape information flow as in the way living stem react to things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.727,
    "end": 952.45,
    "text": " and that grounds the autonomy of living things, the fact that they can recreate themselves, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.331,
    "end": 961.555,
    "text": "But nothing gives a clear link between this and cognitive meaning, or anything we could recognize as cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.555,
    "end": 965.256,
    "text": "So this is what we will try to articulate next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.837,
    "end": 970.539,
    "text": "So how do living systems, as we just defined, can create meaning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.04,
    "end": 997.8,
    "text": " the notion i would like to import is the notion of active inference which i will not get into the mathematical detail here but the idea is that the way the flow the dynamical flow literally that is entailed by an agent and its environment it individuates states that are meaningful basically an agent will predict in a relatively formal sense um sensations that it will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.289,
    "end": 1004.834,
    "text": " I don't know how to say that, not perceive, perceive, but undergo, and actions it will undertake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.695,
    "end": 1009.959,
    "text": "And these predictions are basically what underlie meaning for the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.079,
    "end": 1016.805,
    "text": "It underlies what states will just so happen to shape its own action and be meaningful to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.187,
    "end": 1023.992,
    "text": "This can be framed by, in a pretty simple poetic move,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.101,
    "end": 1042.328,
    "text": " by stating that biological and cognitive systems, they do not simply infer what is, they bring about their own reality by actively inferring what is meaningful to them, by actively looking for states that they think are relevant for their own structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.988,
    "end": 1053.812,
    "text": "And then you start to have a stronger relation between what a physical system of constraint is and how it individuates states that are meaningful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.578,
    "end": 1073.722,
    "text": " But you still don't have a formal theory of basically how this metabolic flow builds learning or creation, like builds a new space of possible states that is not the one it began with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.433,
    "end": 1098.15,
    "text": " uh i had i have a description of a structure that is the set of constraints and this produces basically an activity of the system a flow over the structure and this flow it somehow constrains or shape the structure at the stem takes a time t plus one which itself produce a new function a new flow etc etc etc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.548,
    "end": 1116.324,
    "text": " So it is this dynamic of, I don't want to call that self-referential unfolding, whatever, the way a system of constraints produce a flow that reproduce the same constraint that we want to formalize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.966,
    "end": 1121.77,
    "text": "And the question we could reframe as such",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.726,
    "end": 1141.975,
    "text": " could reframe as how does cognition the ability to understand integrates information about the world it enacts within biological organization because cognition is basically the flow of political organization this is entailed by it everything that i see is something that i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.714,
    "end": 1147.475,
    "text": " but to say bring about that I look at because of the biological constraints I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.716,
    "end": 1158.618,
    "text": "And therefore, the question of creation can be reframed as how the meaning I project onto the world is brought back to shape my own structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.699,
    "end": 1167.92,
    "text": "And this is what we will try to frame mathematically in the framework of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.301,
    "end": 1170.141,
    "text": "Daniel, any questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.945,
    "end": 1201.185,
    "text": " So the attempt that we make here is to see how we can represent creation as a process of inference, which is likely the most minimal, highly recognizable way I could frame cognition as something that is distinct from simply its material implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.606,
    "end": 1211.488,
    "text": " Let us look at a piece of math that is called the Frangier Principle and that is the formal motivation or grounding for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.228,
    "end": 1220.549,
    "text": "It will be the hard part for people who do not do math or people who are not really familiar with the Frangier Principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.609,
    "end": 1222.57,
    "text": "I will work with it slowly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.47,
    "end": 1228.131,
    "text": "It is a piece of math that frames statistical inference from the chemical system theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.854,
    "end": 1234.599,
    "text": " The chemical system theory is basically the idea that you have states and they move as a function of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.88,
    "end": 1253.534,
    "text": "And what the FEP does is to prove that if I have something that is called a Markov blanket, so a boundary that any information must travel through for two subsystems to communicate, basically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.338,
    "end": 1263.242,
    "text": " then you have a synchronization that emerges between states that are outside this boundary and states that are inside this boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.483,
    "end": 1280.03,
    "text": "And not only this, but if I measure the basically... Every state that is on the inside of the boundary entails belief, entails equal distribution over the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.968,
    "end": 1299.579,
    "text": " And the flow of internal states is such that it minimizes the international distance between the actual external states, well, what I can observe, and what I believe to be the case, where I, of course, is the internal systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.599,
    "end": 1302.52,
    "text": "So that was abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.721,
    "end": 1306.503,
    "text": "The basic, informal meaning of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.609,
    "end": 1330.571,
    "text": " is that if I have a demical system and I have a boundary that acts to mediate information exchange between two subparts, then both subparts can basically represent each other and hold belief in each other in a way that is constructed by the systematic synchronization across the boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.411,
    "end": 1351.562,
    "text": " it is uh quite abstract and quite minimal but it is a foul proof that we can have representation we can have cognitive meaning from a very very minimal set of hypothesis which is basically a consistent causal structure and it is a pretty good case that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.999,
    "end": 1356.02,
    "text": " a basic dynamical system, for example, a system of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.54,
    "end": 1361.802,
    "text": "Constraints would be more general, but this kind of very basic non-cognitive things can entail cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.562,
    "end": 1376.366,
    "text": "It has been argued that it does underlie agency and creativity and similar concepts that would entail, in my opinion, creation as a prerequisite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.246,
    "end": 1381.287,
    "text": "So we'll try to see whether the FEP actually can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.651,
    "end": 1390.616,
    "text": " represent creation as the ability for agents to individuate states that are of meaning to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.359,
    "end": 1404.164,
    "text": "The thing is that the existence of Markov blanket is demonstrated for any complex stochastic chemical system, so chemical systems that are random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.425,
    "end": 1412.169,
    "text": "And this can be generalized as basically something that moves in function of itself plus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.035,
    "end": 1413.675,
    "text": " random noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.336,
    "end": 1415.597,
    "text": "It is a very general formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.637,
    "end": 1422.601,
    "text": "Arguably, any thing that exists can be framed as such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.581,
    "end": 1440.472,
    "text": "So we should be optimistic for the ability of this symbolism to represent the cognition of cognitive meaning by basic biological system and therefore creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.772,
    "end": 1442.493,
    "text": "It is not the case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.405,
    "end": 1464.458,
    "text": " because when i frame something as x of t equal something something well i have to pre-find x we have to define space of states that is x and i have defined creation as the ability to construct basically physical possibilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.55,
    "end": 1471.793,
    "text": " So by construction, if you frame something within the mechanism theory, you have to individuate states a priori.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.913,
    "end": 1474.394,
    "text": "What you have written down is not creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.534,
    "end": 1475.714,
    "text": "It can be a ground for creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.734,
    "end": 1477.955,
    "text": "It can be interesting in the study of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.736,
    "end": 1479.816,
    "text": "It is not creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.836,
    "end": 1482.177,
    "text": "It is not the construction of physical spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.917,
    "end": 1493.702,
    "text": "And it is likely not the construction of cognitive meaning, at least in the sense that an activist and autopoietic theory people mean it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.975,
    "end": 1504.803,
    "text": " It just underwrites what becomes measurable for a given subsystem within the stochastic-limical system, which is a lot, but is not, again, creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.784,
    "end": 1511.989,
    "text": "Let us think about how we should think of planetary creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.111,
    "end": 1517.633,
    "text": "There will be more math here, I'm afraid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.894,
    "end": 1522.217,
    "text": "But if a system is to observe another system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.78,
    "end": 1551.213,
    "text": " it will have to lose information about its broader environment it is a pretty easy well it is a something can derive from first principle because basically if you frame it as a quantum system observation will entail entanglement by definition i observe a system and it becomes something that has individual states because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.16,
    "end": 1558.564,
    "text": " I become entangled with it, so its states become basically synchronized with my states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.104,
    "end": 1572.552,
    "text": "But I cannot synchronize with everything all the time, so if I act so as to have more knowledge about the object, I act so as to have less knowledge about my environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.652,
    "end": 1575.814,
    "text": " So there is no basically lossless observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.074,
    "end": 1592.548,
    "text": "It is something that can be derived in the quantum setting that can be reframed in other way in classical settings because of the way observation will either induce hitting information loss or cause myself to forget information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.448,
    "end": 1596.591,
    "text": "You can pretty much derive it in a variety of case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.691,
    "end": 1598.472,
    "text": "It is likely true in all cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.573,
    "end": 1602.436,
    "text": "And it means that observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.154,
    "end": 1628.935,
    "text": " uh as it is constrained by my own flow and the way i couple with the environment it does not simply entails the observation of pre-existing well-individuated physical states it brings about well the individuated well-defined observables for me to observe so the way how to say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.655,
    "end": 1642.707,
    "text": " Given this, it is hard, maybe not possible, to frame a theory of observation from a mathematical theory that entails a priori well-individuated physical states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.247,
    "end": 1650.775,
    "text": "If I frame such a theory of observation or measurement of cognitive meaning, it will not be general and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.173,
    "end": 1661.278,
    "text": " I pretty much have to work creation on the very fundamental scales at which my theory operates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.379,
    "end": 1675.466,
    "text": "And this is something that is arguably done by reframing of the Fahrenheit principle for generic quantum systems by mainly Chris Fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.526,
    "end": 1681.329,
    "text": "The idea is to use category theoretic equivalence between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.674,
    "end": 1685.816,
    "text": " Lots of things I will definitely not get into at the end of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.717,
    "end": 1702.366,
    "text": "To reframe the synchronization dynamic that's in view, that builds cognitive meaning according to the French principle, as a series of binary measurements are equivalently symmetry-breaking operators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.226,
    "end": 1708.73,
    "text": "So the Y-adimical system synchronized with these two elements under the FEP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.995,
    "end": 1735.423,
    "text": " is reframed here as basically a series of binary questions that I ask my environment and that enforce my interaction with it in such a way that the answers to my questions become physical facts, which you can derive from a rather general quantum information theory background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.333,
    "end": 1741.496,
    "text": " but that gives basically no structure whatsoever to the measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.137,
    "end": 1748.862,
    "text": "Nothing in this theory says what kind of system can ask what kind of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.103,
    "end": 1759.191,
    "text": "And this means that, okay, this drives creation, maybe, drives individuation of physical possibilities, physical observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.353,
    "end": 1769.54,
    "text": " but it doesn't constrain at all what this creation is, so it doesn't explain much and it doesn't help much to understand how a living system recreates itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.562,
    "end": 1782.43,
    "text": "So we still have somehow to recruit the cognitive and numerical formulation of the FEP that I discussed very tentatively earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.712,
    "end": 1787.494,
    "text": "So let us take things from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.5,
    "end": 1803.219,
    "text": " um i have turned uh during this formal discussion from the notion that we have to represent creation in the living and cognitive world to the notion that somehow it is necessary present creation of physical reality like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.517,
    "end": 1809.221,
    "text": " the underlying states of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.882,
    "end": 1821.33,
    "text": "This third part will serve mainly to discuss this claim and what it means and what we should do with it, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.591,
    "end": 1828.015,
    "text": "First, I want to show basically that the claim that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.218,
    "end": 1831.078,
    "text": " There is no a priori physical reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.098,
    "end": 1833.059,
    "text": "It is a pretty basic claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.279,
    "end": 1834.859,
    "text": "It should not be treated as exceptional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.939,
    "end": 1837.5,
    "text": "It is a necessary property of a coherent physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.82,
    "end": 1847.242,
    "text": "It is a necessary property actually of the formulation or description of a world that is beyond what we call metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.183,
    "end": 1850.503,
    "text": "Let us be more specific in the argumentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.803,
    "end": 1858.085,
    "text": "I call this argument the argument from ontological consistency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.091,
    "end": 1872.959,
    "text": " an ontology that is naturalistic, that serves to present nature, if it is consistent, cannot call onto external objects, objects that would not be natural, to explain the properties of its own objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.719,
    "end": 1886.867,
    "text": "For example, if I tell you this thing is black because it reflects the light in such and such way, and I can also explain the properties of light, it is self-consistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.595,
    "end": 1894.198,
    "text": " If I tell you this thing is black because God willed it, and I cannot explain to you what God is physically, it is not self-consistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.478,
    "end": 1907.903,
    "text": "There is another property that is framed by Alexey Rozanski, who is present here, as the property of self-conscious consistency, that is that the ontology should basically include itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.763,
    "end": 1913.525,
    "text": "The discourse we have on physics is, unless",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1914.58,
    "end": 1920.382,
    "text": " We have very radical position about the relation between human and the other world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.882,
    "end": 1928.085,
    "text": "It is something that exists in nature and that is something that we need to account as an element of nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.585,
    "end": 1930.826,
    "text": "This entails two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.866,
    "end": 1933.327,
    "text": "This is one thing actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.387,
    "end": 1942.53,
    "text": "It entails that scientific representations, the models and theory we have and the property those model and theory have, they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.143,
    "end": 1946.964,
    "text": " must be accounted for as natural entities in their own rights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.684,
    "end": 1954.365,
    "text": "And they must be, at least in principle, explainable by the tools of physics and science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.346,
    "end": 1963.647,
    "text": "And this entails, in turn, that I cannot have such a thing as a law, a symmetry, or a set space that pre-exist physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.728,
    "end": 1969.669,
    "text": "Any statement I make about physics must itself be explained by physical processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.709,
    "end": 1971.409,
    "text": "I will elaborate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.563,
    "end": 1973.184,
    "text": " on what it means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.224,
    "end": 1985.975,
    "text": "The view of physicists is typically that we have theories, and those theories are representations of the world that just so happen to account for the fundamental structure of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.615,
    "end": 2000.107,
    "text": "For example, we have the Maxwell law of electromagnetics, electromagnetism, and those laws are representations of a force that exists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.876,
    "end": 2016.764,
    "text": " And that is generated by SU , I think, by a symmetry in the Hamiltonian, sorry, a symmetry in the quantum property of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.844,
    "end": 2024.267,
    "text": "But this symmetry pre-exists basically any atom to represents and any physical process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.327,
    "end": 2025.528,
    "text": "It is a fundamental property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.405,
    "end": 2054.507,
    "text": " what i say is that you cannot have a fundamental property you cannot have something that predates physics and that cannot ultimately be explained and if you admit such a thing your ontology is not consistent because you have to admit some things that are beyond that predate nature to explain things in nature which is the opposite of what self-consistency is so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.675,
    "end": 2067.638,
    "text": " If I want to frame a world where you do not have explanations that call onto things that are beyond physics, you have to have laws, symmetries and spaces that are constructed by physical processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.699,
    "end": 2071.5,
    "text": "And it is not a problematic view to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.3,
    "end": 2074.48,
    "text": "At least epistemologically, it is necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.361,
    "end": 2079.562,
    "text": "Let us discuss what it means concretely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.443,
    "end": 2083.443,
    "text": "We have cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.454,
    "end": 2086.015,
    "text": " Those cognitive systems, they perceive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.535,
    "end": 2092.299,
    "text": "And this perception brings about cognitively-relevant states, which the cognitive agent experiences as real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.439,
    "end": 2095.0,
    "text": "We have physical observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.581,
    "end": 2104.226,
    "text": "These physical observers bring about what we call pointer states that are well-individuated states that are measurable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.946,
    "end": 2110.329,
    "text": "And those states constitute physical reality, at least as any given observer can experience it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.53,
    "end": 2113.051,
    "text": "What I say here is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.778,
    "end": 2117.02,
    "text": " This is not epistemic notions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.261,
    "end": 2134.693,
    "text": "The pontoon states and the cognitively relevant states that perception, the cognitively relevant states under perception by agents, they are real and they are individuated as real by their observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.733,
    "end": 2143.119,
    "text": "And if we frame it properly, the QFEP at least, what we could do with the QFEP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.025,
    "end": 2171.876,
    "text": " it represents how proto minds at least particles agents that have properties that we classically understand as mindful they individuates physical observable which means that they create the species which means that this is a theory of creation not simply a theory of how access reality but a theory of how we get a reality in the first place and to do anything like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.629,
    "end": 2174.33,
    "text": " grounding properly this claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.771,
    "end": 2194.186,
    "text": "It will take a lot more details, and I will try to work by showing what the searcher theory would do, because obviously I do not have such a theory that is framed formally from start to finish as of now, and if I did, I would not present it now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.827,
    "end": 2200.931,
    "text": "Let us look at the way constraints basically create the relative experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.95,
    "end": 2209.875,
    "text": " This is a diagram of how us humans understand the world, the social world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.396,
    "end": 2219.603,
    "text": "Basically, we understand things like constraints over what we do and can do and what it entails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.863,
    "end": 2223.326,
    "text": "I understand that if I talk to you in proper English, you will understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.886,
    "end": 2226.948,
    "text": "If I talk to you in French or Swahili, you will not understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.968,
    "end": 2231.432,
    "text": "I understand that if I undress, it will be inappropriate, and if I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.382,
    "end": 2237.266,
    "text": " hold myself in a certain way, it will lead you to believe me more or less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.287,
    "end": 2244.032,
    "text": "I understand that if I start speaking very loud it will disturb people and they will act for me to stop talking very loud.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.573,
    "end": 2254.982,
    "text": "I understand very basic facts about how this world works and I understand how this constrains the action I can take and the consequences of that action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.622,
    "end": 2258.605,
    "text": "What I experience is basically a sociocultural landscape which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.469,
    "end": 2284.788,
    "text": " exists uh independently from me and that i act within and what i claim is that this social cultural landscape evolves in a way that is creative that is basically obvious new norms exist that did not exist 10 years ago and that is even more true for one millennium ago or before human were a thing and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.598,
    "end": 2309.531,
    "text": " The way I can represent how agent try to understand this social landscape and possibly fail or erode norms and the landscape in such way, it is equivalent representation of the landscape itself and the constraints that constitute this landscape and the way the flow of landscape reconfigures the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.491,
    "end": 2313.213,
    "text": "So what I did here is to basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.898,
    "end": 2330.047,
    "text": " frame theory of creative evolution, this of a set of constraints, well, of a social cultural landscape, on the way individual agents understand and act within this landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.868,
    "end": 2342.635,
    "text": "I have a sense in which constant observation and cognition about physical, here a social reality, but still physical in the sense that it exists in a physical world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.228,
    "end": 2348.949,
    "text": " how this landscape can be created by something that is cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.509,
    "end": 2354.271,
    "text": "And this basic ontology, if I am correct here, is something we can mathematize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.571,
    "end": 2355.051,
    "text": "I hope so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.591,
    "end": 2364.094,
    "text": "And that we can frame as a basic theory of, well, the individuation of new physical possibilities, creation, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.594,
    "end": 2364.754,
    "text": "not .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.035,
    "end": 2372.377,
    "text": "Create to this graph is given Trina Brinac and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.352,
    "end": 2380.897,
    "text": " What is of importance here is the duality between two representations, two perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.458,
    "end": 2398.392,
    "text": "The perspective of agents that basically enact sociocultural constraints, that the experience as a physical fact, as a reality, they cannot go beyond or escape or maybe affect in brute force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.472,
    "end": 2400.093,
    "text": "That's a possibility, but not escape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.258,
    "end": 2407.779,
    "text": " and the perspective of a set of constraints that ambitiously unfolds in a way that is creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.24,
    "end": 2412.32,
    "text": "And that is a formal intuition I plan to build on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.281,
    "end": 2423.423,
    "text": "And I can say something a bit more specific about how it works by analogy to the Fahrenheit principle and the holographic principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.023,
    "end": 2428.224,
    "text": "Basically, creation operator",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.136,
    "end": 2443.007,
    "text": " in my opinion, I could argue for that, I will not do this in detail right now, is something that goes for a space of, it's not actually a space of physical possibilities, it's a space of potentialities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.067,
    "end": 2446.069,
    "text": "It does not have possible states and impossible states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.53,
    "end": 2449.632,
    "text": "It is just the statement that something is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.672,
    "end": 2452.334,
    "text": "It is very close to what Greeks call chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.435,
    "end": 2455.417,
    "text": "So you have such a space of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.34,
    "end": 2485.844,
    "text": " and individual possibilities and from this space unfolds a pair of an individual observable which is called E for environment and an agent that is capable to observe this observable and the agent is also capable to maintain a boundary between itself and the observable for basically the observable to stay existing as observable to be observed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.085,
    "end": 2517.34,
    "text": " And from this, I think that some mathematical operator that does this basic flow is capable to describe the construction of physical set spaces as the unfolding strictly, strictly, no, metaphorically, of physical structure as basically the, yes, the emergence, the co-construction, the individuation, as you will,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.018,
    "end": 2533.423,
    "text": " of a well-individuated observable state, an observer that is capable to see this state and bias in this state, maintaining whatever worked as an undividuated space of possibilities before as a well-individuated boundary between itself and the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.344,
    "end": 2536.804,
    "text": "Let us think, for example, of a piece of paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.725,
    "end": 2540.506,
    "text": "I, an agent, can basically write things on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.826,
    "end": 2547.328,
    "text": "And by writing things on it, I create new physical observable, which is the content of what I've written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.07,
    "end": 2561.857,
    "text": " And the fact I write on it and or read it makes a piece of paper not a piece of paper, but a boundary between myself and a semiotic space where the writing occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.398,
    "end": 2568.841,
    "text": "This is the basic dynamic that must be framed for us to understand cognitive meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.858,
    "end": 2599.145,
    "text": " and that if we framed in such way could work to describe the construction of state spaces ex nihilo because literally you do not need physical possibilities to be a thing or be to exist it is the point of this presentation you don't need a space of possibilities to pre-exist the individuation of the agent environment this is why it is relevant and this is why it is hard to formulate and given an operator with this property we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.966,
    "end": 2603.007,
    "text": " pretty much work it back on the foundation of physics and see what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.868,
    "end": 2605.648,
    "text": "So, how the physics of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.669,
    "end": 2612.871,
    "text": "Let us tie the threads of this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.191,
    "end": 2616.833,
    "text": "I will formulate three take-home messages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.973,
    "end": 2627.757,
    "text": "First, we have something that is called the FEP, that is mainly framed as Bayesian mechanics, as informational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.002,
    "end": 2636.37,
    "text": " enrichment of the chemical system theory, but that can also be framed as something in quantum information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.452,
    "end": 2648.284,
    "text": "It says that agents actively infer states of meaning through their engagement with the environment in a way that maintains their structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.341,
    "end": 2652.342,
    "text": " This gives us a formal background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.945,
    "end": 2663.752,
    "text": "The quantum framing of it gives us a very, very tentative and hard to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.953,
    "end": 2669.737,
    "text": "I will not say ill-specified, but very few specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.937,
    "end": 2672.479,
    "text": "It doesn't have a lot of detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.04,
    "end": 2677.584,
    "text": "So it gives us a very not detailed background for the study of how cognitive meaning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.815,
    "end": 2707.214,
    "text": " um underwrite the construction of physical set spaces but because it is very abstract and not very specified we have to relate it in a much stronger way to the classical formulation of the fep where the internal flow of the agent and the synchronization manifolds that emerge from the interaction have a very specific topology of a specific very specific geometry and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.01,
    "end": 2711.153,
    "text": " can be equipped with meaning about the underlying physical structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2713.334,
    "end": 2718.739,
    "text": "Second, we have to admit that past materialism is a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.3,
    "end": 2723.503,
    "text": "We have to admit that there is something wrong in how we view science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.864,
    "end": 2727.526,
    "text": "Let us quote Einstein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.206,
    "end": 2736.333,
    "text": "If, without in any way disturbing the system, we can predict with certainty the value of a physical quantity, then there exists an element of reality corresponding to that quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.957,
    "end": 2761.944,
    "text": " by this account nothing is real which is a very big problem a very bad position to hold and we have in some sense to account for the role observation in creating well-individuating physical states not only for quantum physics not only for cognitive science but for everything in between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.947,
    "end": 2768.672,
    "text": " which is in some sense entailed by quantum physics, in some sense entailed by cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.952,
    "end": 2773.075,
    "text": "So I don't think it is a very big deal to say that, but I think it will be taken as such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.116,
    "end": 2788.287,
    "text": "And the statement I want to make is that not only doing away with this brand of realism is compatible with naturalistic demarche, with science, but it's also necessary because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.164,
    "end": 2791.39,
    "text": " for naturalistic science to be a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.41,
    "end": 2794.298,
    "text": "I have to represent myself representing as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.394,
    "end": 2819.827,
    "text": " there is something metaphysical that comes into play either as taking myself as a detached non-physical uh describer of the world or by postulating some kind of god-like pre-existing structure that i just so happen to stumble upon you will have something that is beyond physics in some sense if you don't do away with physical with this brand of scientific realism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.888,
    "end": 2825.231,
    "text": " And it has been said to me that it is not a new view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.892,
    "end": 2827.193,
    "text": "No, it is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.773,
    "end": 2835.5,
    "text": "It has been framed as a criticism of the notion of Atman thinking itself by an early Buddhist philosopher about three millenniums ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.721,
    "end": 2842.066,
    "text": "And the fact it is not new is not really a problem in my opinion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.978,
    "end": 2867.394,
    "text": " we should go with things that seem true whether or not they are exciting and novel and the fact that we can have a cosmology without a presence in nature and other people do not find any problem with it should be a sign that maybe our insistence that no there are things in themselves is not well motivated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.837,
    "end": 2893.277,
    "text": " And finally, what I propose here, beyond philosophical considerations and a discussion of what some piece of math do, is a very, very, very, very basic, not draft, but drawing of physics of creation that holds in two movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.337,
    "end": 2896.7,
    "text": "The first is abstractly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.572,
    "end": 2902.175,
    "text": " the individuation of something from nothing, of order of chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.496,
    "end": 2918.327,
    "text": "Given a space of undefined possibilities B, you have individuation of an observable that is well defined and of an agent whose observation of E also individuates a boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.448,
    "end": 2923.751,
    "text": "So we have this kind of framing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.189,
    "end": 2942.281,
    "text": " that could work as a handle on how to write subspace construction, it does have a very strong category, theoretical feel, from the way, basically, the content of B is not what's at stake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.341,
    "end": 2950.206,
    "text": "This diagram is pretty much agnostic concerning what B is and is not, and it must be because it underwrites the becoming of B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.954,
    "end": 2971.794,
    "text": " And there is a lot of work, if I want the physics of correlation to be a thing, in framing properly what kind of mathematical operators basically follow the flow of this diagram, and what those mathematical operators do, and the kind of physics they can underlie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.461,
    "end": 2975.522,
    "text": " Well, for this, I have a concerning case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.143,
    "end": 2983.166,
    "text": "I have the case of how humans collaborate to build and recreate social norms because it is a case of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.326,
    "end": 2988.108,
    "text": "It is pretty much the single case of creation I could convince anyone is a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.289,
    "end": 2994.531,
    "text": "There is money because we believe there is money, and it works as we believe it works because we believe it works this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.751,
    "end": 3001.174,
    "text": "It is a very true statement to say that norms constrain us because we believe in norms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.731,
    "end": 3031.341,
    "text": " and the duality it affords between the representation of single agents trying to understand and act within a social world and the flow the interesting flow that is created by social constraints and that recreate social constraints it is pretty specific it is much more specific than uh the vague operator and left and i know this operator must represent that so it gives",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.21,
    "end": 3037.354,
    "text": " basically some level of grip, at least a deep level, on how the physics of creation would work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.815,
    "end": 3052.544,
    "text": "And they would work by describing the unfolding of physical structure as the construction within physics of meaning and or constraints over what is observable by given adjective observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.105,
    "end": 3057.947,
    "text": "And pretty much we have to work from there because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.387,
    "end": 3066.251,
    "text": " I don't think there is no self-consistent in the sense I introduced earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.792,
    "end": 3069.414,
    "text": "There is no self-consistent physics if we don't do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.554,
    "end": 3070.495,
    "text": "So let's do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.177,
    "end": 3077.84,
    "text": "This work, again, is to some extent my work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.88,
    "end": 3082.703,
    "text": "It is to some extent the collective work of Kairos, which is basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.637,
    "end": 3090.559,
    "text": " It is a perspective laboratory that works towards an active science, an active naturalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.339,
    "end": 3105.203,
    "text": "A science that is naturalist in the sense that it plays the observer within the world and works within well-defined causal ontology rather than less well-defined laws and abstract principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.464,
    "end": 3110.465,
    "text": "And it tries to do so in a way that enables people, as in humans,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.826,
    "end": 3128.572,
    "text": " to understand the reality, to basically use this knowledge about how the world works to constrain their own behavior and navigate the world, especially given the recombination of constraints that we expect to be at play in the coming decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.772,
    "end": 3136.895,
    "text": "So I strongly suggest you take a look to our website and our general line of work and consider if you want to talk to us or join us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.555,
    "end": 3140.796,
    "text": "The QR code is, I believe, a link to our website.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.358,
    "end": 3151.226,
    "text": " So thanks to Maxwell, thanks to Daniel, thanks to Alexei, thanks to Yona, thanks to pretty much everyone who helped me write this and think it through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.246,
    "end": 3154.569,
    "text": "It was big work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.749,
    "end": 3158.472,
    "text": "So I will run through this slide if someone wants to read them in the video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.273,
    "end": 3161.675,
    "text": "And now we can go toward the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.581,
    "end": 3168.941,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.822,
    "end": 3170.162,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.037,
    "end": 3198.608,
    "text": " thank you alexi and maxwell welcome back if you want to join and please either of you provide a first statement or any set of questions however you want to continue just go for it you know what give me five minutes i will uh try to destroy my head so chat but don't expect me to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.651,
    "end": 3202.931,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.951,
    "end": 3209.313,
    "text": "Well, do you want to share your perspective on the project, things that Avel would be familiar with while you're here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.754,
    "end": 3215.875,
    "text": "Yeah, I can begin, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.335,
    "end": 3220.937,
    "text": "Yeah, so I worked on the metaphysical or ontological parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.537,
    "end": 3227.338,
    "text": "And yeah, to me, Avel gave it a good presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.519,
    "end": 3232.22,
    "text": "Yeah, it was really nice to see it framed into the whole",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.918,
    "end": 3243.621,
    "text": " way of talking about everything, like linking it to FEP and then to other stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.121,
    "end": 3254.185,
    "text": "So yeah, so the point of the, if I can share a bit more about the metaphysics of the ontology,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3256.785,
    "end": 3261.446,
    "text": " The idea was to create an anthology that is naturalist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.866,
    "end": 3268.327,
    "text": "And as FEP seems to be really naturalist, then I wanted to make it work together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.347,
    "end": 3275.148,
    "text": "At first, it was only in my own field that I developed this anthology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.588,
    "end": 3279.129,
    "text": "Then Avel said to me that it was really linked together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.149,
    "end": 3282.89,
    "text": "So that's what we tried to do here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.823,
    "end": 3287.924,
    "text": " what does that look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.984,
    "end": 3294.248,
    "text": "How are you evaluating what a metaphysic is or how, you know, when you found the right one or an incompatible one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.709,
    "end": 3295.949,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.369,
    "end": 3304.335,
    "text": "So the basic question was about the question of what exists more generally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.495,
    "end": 3309.638,
    "text": "So that was my, uh, my anger of, if it's a thing in English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3309.698,
    "end": 3309.879,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3310.219,
    "end": 3311.58,
    "text": "So, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.486,
    "end": 3320.868,
    "text": " There are many discussions about what there is in philosophy, mainly in the 20th century due to crime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.809,
    "end": 3325.41,
    "text": "I think it is popular in general in the culture of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.51,
    "end": 3332.152,
    "text": "So I followed these debates on what there is and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3333.379,
    "end": 3337.081,
    "text": " Pretty much, there are a lot of views about what there is and what there is not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.761,
    "end": 3344.284,
    "text": "So I was a bit, how to say that, disturbed by the fact that there are things that are not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.886,
    "end": 3354.39,
    "text": "And I wanted to give it a try to talk about what seems not to be and to make it exist in some way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3355.01,
    "end": 3358.211,
    "text": "And so how to say that better?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.046,
    "end": 3384.836,
    "text": " generally what doesn't exist is linked to consciousness like Pegasus or let's say stupid entities such as the round square copula of the clay college or something else such as i don't know some weird non-really mathematical entities and i was like okay so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.165,
    "end": 3389.708,
    "text": " I admit that they do not work, but at least we are talking about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.668,
    "end": 3394.431,
    "text": "So can't we just say they exist in some way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.391,
    "end": 3404.157,
    "text": "And then I went into social ontology and I found that we can call them social artifacts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3405.198,
    "end": 3408.86,
    "text": "And then I was a bit relieved with this view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3409.521,
    "end": 3413.424,
    "text": "So I tried to make it work with also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3414.761,
    "end": 3418.123,
    "text": " phenomenality or cognitive or personal experience, human experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.803,
    "end": 3421.985,
    "text": "Because being a social artifact doesn't make it all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.205,
    "end": 3431.57,
    "text": "So yeah, then I just tried to make it work between ontology, social ontology and cognitive ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3432.891,
    "end": 3434.852,
    "text": "And yeah, that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.552,
    "end": 3437.913,
    "text": "And also, yeah, something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3438.493,
    "end": 3441.555,
    "text": "Avel talked about the self-referential inconsistency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.055,
    "end": 3442.876,
    "text": "So it's a debate...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3444.573,
    "end": 3452.471,
    "text": " uh i've found by by working on ontology and i was really into it the fact that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3453.46,
    "end": 3480.181,
    "text": " a theory is inconsistent if it doesn't apply to itself and I found some articles about it which were against naturalism but one kind of naturalism only so it was mostly eliminativism and I saw that the people who were working on that they didn't know about a lot of naturalism and as I",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.167,
    "end": 3487.593,
    "text": " I work with Kairos and in my study, I found that there are many kinds of naturalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3487.933,
    "end": 3497.021,
    "text": "So I saw that the argument doesn't work with other kinds of naturalisms such as the one that is developed here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3497.481,
    "end": 3497.661,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.183,
    "end": 3499.883,
    "text": "I hope it's clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3502.265,
    "end": 3502.425,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.542,
    "end": 3529.518,
    "text": " i'll ask one question on this topic from the chat and then feel free to take it in any direction or maxwell so adam rostowski in the chat asked thanks avil question maybe for alexi what if state space is considered theoretical ideology rather than causal ontology its presupposition would then not be a threat to ontological consistency",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.882,
    "end": 3537.125,
    "text": " So what if state space is considered theoretical ideology rather than causal ontology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.705,
    "end": 3540.627,
    "text": "Maybe just unpack the question and then give it a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.388,
    "end": 3545.529,
    "text": "Yeah, I will write it now in order to reflect on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.832,
    "end": 3554.994,
    "text": "Perhaps, Abel, just a direct question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.114,
    "end": 3557.615,
    "text": "What are the state spaces that you're concerned with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.495,
    "end": 3560.056,
    "text": "How would you characterize what they are?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.067,
    "end": 3570.049,
    "text": " By constructions, there are spaces of postulated physical possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.91,
    "end": 3577.672,
    "text": "I do not understand the notion of ideology, how it works here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.692,
    "end": 3592.638,
    "text": "It's pretty trivial that what we usually call ideology will define what a person or political system or institution is capable or interested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.909,
    "end": 3621.963,
    "text": " uh in seeing uh it is um it is the topic of um scott seeing like a states uh foundational let's say work of anarchist anthropology that looks at basically how um whenever states try to do things uh overtly usually for the population their main concern in effect is to build the capability of control and usually they do so by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.76,
    "end": 3625.821,
    "text": " cutting through complexity aggressively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.782,
    "end": 3631.425,
    "text": "A very basic instance of that is scientific forestry, that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.745,
    "end": 3634.346,
    "text": "I can say it is indeed forestry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.768,
    "end": 3641.651,
    "text": "The idea was that Prussia needed war boats, loads of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.391,
    "end": 3652.017,
    "text": "They also needed to be able to predict how many war boats they would build on a given timeframe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.057,
    "end": 3653.278,
    "text": "So they needed to know how many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.674,
    "end": 3657.756,
    "text": " war-boat compatible trees they had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.536,
    "end": 3663.479,
    "text": "But you don't have war-boat compatible trees and not war-boat compatible trees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.499,
    "end": 3668.162,
    "text": "You have trees of different size, different ages, different essence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.922,
    "end": 3676.667,
    "text": "So if you just counted trees, even with a well-defined measure, you would not really know how many trees you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.027,
    "end": 3684.652,
    "text": "So they just raised forest and planted a homogeneous patch of a given specie at a given time with a given soil.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.535,
    "end": 3687.881,
    "text": " So they knew that when they knew they had",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.658,
    "end": 3692.1,
    "text": " 64, I don't know what trees there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.68,
    "end": 3693.941,
    "text": "I actually know what trees there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.961,
    "end": 3694.341,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.401,
    "end": 3695.542,
    "text": "It's told in English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.962,
    "end": 3701.106,
    "text": "So when they had, it's not oak, but they will say oak to say something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.086,
    "end": 3705.729,
    "text": "When they knew they had 64, 30 years oak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.089,
    "end": 3707.25,
    "text": "Well, that's 64.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.39,
    "end": 3710.932,
    "text": "30, I didn't say 30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.972,
    "end": 3711.472,
    "text": "Let's say 30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.512,
    "end": 3712.593,
    "text": "30 years oak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.113,
    "end": 3713.874,
    "text": "And that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.074,
    "end": 3717.016,
    "text": "They can cut the trees and they know exactly what they can do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.337,
    "end": 3736.683,
    "text": " So it is a way in which what something we could account as ideology, so the notion that we should be able to control blah blah blah blah, it basically constructs physical reality in a very concrete sense because they cut trees, they plant other trees that fit their expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3737.283,
    "end": 3747.587,
    "text": "It is a form of niche construction, it is a form of cognitive accession in the sense that the loads they would need to account for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3748.922,
    "end": 3759.126,
    "text": " How trees are they just offloaded onto the environment by making trees actually all the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.146,
    "end": 3763.008,
    "text": "And it is a form of meaning projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.368,
    "end": 3775.973,
    "text": "They have a system of meaning, which is that they need to count trees that are waterboard compatible, and they project it onto our actual forests are organized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.164,
    "end": 3785.747,
    "text": " But those are physical possibilities as understood by the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.268,
    "end": 3787.389,
    "text": "Those are state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.569,
    "end": 3793.553,
    "text": "We have a state space that was very complex with a lot of possible trees, possible species, possible size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.613,
    "end": 3797.716,
    "text": "That is brought down to how many trees I have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.656,
    "end": 3802.259,
    "text": "And it is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.572,
    "end": 3826.566,
    "text": " could you repeat the question word for word please because it was not clear to me how the national ideology intervenes what if state space is considered theoretical ideology rather than causal ontology its presupposition would then not be a threat to ontological consistency the causal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3829.113,
    "end": 3830.554,
    "text": " Yes, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.594,
    "end": 3832.476,
    "text": "The causal ontology precedes a set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.596,
    "end": 3841.482,
    "text": "It is the ontology of creation slash constraints that I have waved at somewhat impressively at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.944,
    "end": 3849.128,
    "text": "Set space are, I think, I think I will be able to demonstrate it, but I can't at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.589,
    "end": 3851.77,
    "text": "They express the point of view of an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.111,
    "end": 3857.395,
    "text": "So I imagine that this is what is meant to be traduced by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.952,
    "end": 3884.249,
    "text": " ideological theory theoretical ideology and um i do not think state space are a threat to ontology i think ontologies that consider state spaces as fundamental are flawed ontology is fine thank you avil alexi feel free to chime in and then maxwell if you want to add anything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.092,
    "end": 3897.959,
    "text": " yeah um so i think i will join avail on the the commentary um also i would like to say that um if we take",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3898.846,
    "end": 3927.43,
    "text": " quine's definition of ideology if i will not explain this now that well yeah so the idea i think is that the concepts are total and not fundamental stuff that's what i think it is implied by ideology here um so what i'd say is that um you give the value of being an ideology uh or consul ontology depending of your your goal and your",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3930.413,
    "end": 3933.874,
    "text": " But at least minimally, the stuff you're talking about, it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.254,
    "end": 3939.236,
    "text": "That's the fundamental stuff that I would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3940.196,
    "end": 3948.239,
    "text": "So even though it is ideological, even though it is instrumental, let's say, minimality is something and it has consequences on the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3948.419,
    "end": 3950.86,
    "text": "And that's what I think Havel said with the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.387,
    "end": 3955.529,
    "text": " niche construction of social time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3955.989,
    "end": 3969.977,
    "text": "It didn't really say that in these words, but yeah, even though your ideas are, let's say, stupid or absurd, and people appear to hear you, then your ideas, they are in the world, and they do something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3971.938,
    "end": 3974.58,
    "text": "So I hope I answered well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3975.4,
    "end": 3978.202,
    "text": "If not, then I can still take questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3981.533,
    "end": 3981.933,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.235,
    "end": 3987.236,
    "text": "Maxwell, do you want to add something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.857,
    "end": 3990.318,
    "text": "I don't really have anything burning to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3991.379,
    "end": 3997.883,
    "text": "I think this is the end iteration of our discussions around this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3998.003,
    "end": 4002.626,
    "text": "As always, I think you did a great job presenting what I think is a genuine issue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4002.686,
    "end": 4005.588,
    "text": "I've just been rehearsing the same thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4011.482,
    "end": 4014.344,
    "text": " you know, appeals to multi-scalarity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4014.364,
    "end": 4030.836,
    "text": "I mean, I find it interesting that you would speak an answer to these issues in quantum FEP, precisely because of its scale-free nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4031.016,
    "end": 4035.279,
    "text": "So, you know, you can't appeal to a space-time background when speaking in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4036.039,
    "end": 4055.668,
    "text": " uh the quantum fep formulation so i think uh that in my mind that makes things um potentially more difficult i see why you would want to do that because of the focus on um you know the the definition of an observation as a physical interaction i guess um my uh my kind of uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4057.151,
    "end": 4064.119,
    "text": " overarching question is whether the multi-scalarity of classical FEP helps at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4065.381,
    "end": 4072.069,
    "text": "In the sense that we described before, so you have a set of observables, some of them change too fast",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4072.629,
    "end": 4078.272,
    "text": " to really disclose or allow us to track reliably some phenomenon behind the blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4078.572,
    "end": 4079.113,
    "text": "Others do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4080.233,
    "end": 4082.755,
    "text": "In the latter case, we talk about states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4083.255,
    "end": 4085.736,
    "text": "In the former, we talk about random fluctuations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4086.617,
    "end": 4088.478,
    "text": "So I suspect that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4089.378,
    "end": 4105.324,
    "text": " you know, the kind of definitional discussions, by which I mean like, you know, definitions of states, like these kind of foundational issues that arise in classical FEP might be helpful hereabouts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4106.044,
    "end": 4110.666,
    "text": "I also suspect that you'll disagree with me, so I'm looking forward to hearing your thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4113.147,
    "end": 4116.148,
    "text": "So, basically, you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.871,
    "end": 4121.213,
    "text": " the distinction is clear between us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.653,
    "end": 4128.476,
    "text": "At least as you frame the problem, you seem to be a realist about the physical possibilities about state spaces, which I'm not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.336,
    "end": 4138.901,
    "text": "I have an argument for non-realism, which is self-frontal, well, ontological consistency and the arguments of self-consistency and self-frontal consistency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.501,
    "end": 4145.784,
    "text": "That brings us to say that you can't have preemptive state spaces in which to frame",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.465,
    "end": 4155.368,
    "text": " in which to classify have physical observables that somehow pre-exist physics' nature, the processes that are within it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.248,
    "end": 4158.169,
    "text": "So that is one of the physical arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.869,
    "end": 4171.213,
    "text": "The question is then, can I demonstrate conclusively that you do not have physical observables before observation, but set spaces do in fact traduce the perspective of an observer, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.017,
    "end": 4175.239,
    "text": " Basically, if I can demonstrate it, the debate is over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.921,
    "end": 4191.11,
    "text": "Until then, you have... You can basically hold structural realism, but you have to account for how things exist, if they are not fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.631,
    "end": 4196.094,
    "text": "I think multiscale FEP can do that, so it's not a critical problem for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.345,
    "end": 4207.039,
    "text": " Everything holds on the formal demonstration that we do not, in fact, have set spaces as a primitive physical effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.134,
    "end": 4217.62,
    "text": " Well, I would push a little bit back against your realism versus anti-realism distinction here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4218.141,
    "end": 4230.071,
    "text": "I'm really just talking about at the level of the formalism, you start with some of the observables, which seems to be what you are also saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4230.851,
    "end": 4238.678,
    "text": "And then you can talk about the way that those observables are related to some other things, which may be latent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4239.758,
    "end": 4242.919,
    "text": " All of that is a formal statement as far as I'm concerned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4243.559,
    "end": 4251.181,
    "text": "And it is useful whether or not it maps in some kind of fundamental realist ontology sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4251.781,
    "end": 4264.065,
    "text": "I guess if there is a kind of transcendental overtone to what I'm saying in the sense that we've argued in print on the map territory fallacy paper that the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4264.665,
    "end": 4276.97,
    "text": " The FEP theoretic maths and the related cluster of principles, unitarity, maximum entropy, and so forth, provide ultimate constraints on any model building exercise, just full stop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4277.27,
    "end": 4283.733,
    "text": "So again, that doesn't presuppose any realism about what maps map onto.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4284.213,
    "end": 4289.015,
    "text": "It's really just a statement about the construction and maybe the process of constructing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4291.62,
    "end": 4292.401,
    "text": " You're correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.481,
    "end": 4298.764,
    "text": "I was attributing... I don't know how to say it in English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.585,
    "end": 4302.846,
    "text": "It was not accurate to frame you as a realist about set spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.327,
    "end": 4311.351,
    "text": "It was correct, however, to frame you as an instrumentalist, which I refuse to be, because of naturalism, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.371,
    "end": 4316.734,
    "text": "I consider it necessary to frame causal ontologies that map onto reality properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.734,
    "end": 4342.362,
    "text": " as fine-grainedly as we can and to do that we have to include basically the translation relation and this is when everything becomes complicated because you can't say if there are such physical possibilities then this occurs you can't use that language because by doing that you frame physical possibilities as something that is abstracted from the underlying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.311,
    "end": 4343.992,
    "text": " physical reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.012,
    "end": 4347.275,
    "text": "You decouple the formal from the actual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.196,
    "end": 4357.204,
    "text": "And I think whatever ontology we use must be what reality is, must correspond structurally to what drives reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.205,
    "end": 4360.727,
    "text": "So I have... It is the contrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.848,
    "end": 4366.072,
    "text": "It is I who is the realist, but the constraint... I was going to suggest, I mean...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.161,
    "end": 4390.857,
    "text": " I go for ontology that is consistent in the sense I friend, and the constraints over that are much, much, much, much, much stronger than the constraints over instrumentalist ontology that just, yeah, we say interesting things, which is not actually easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.877,
    "end": 4392.098,
    "text": "It's just much more easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.991,
    "end": 4402.034,
    "text": " But suppose we started from the assumption that we don't have to have a strong position on the reality of state spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4404.395,
    "end": 4405.856,
    "text": "Does that affect",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4406.821,
    "end": 4407.982,
    "text": " your argument at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4408.482,
    "end": 4415.087,
    "text": "So, you know, if I were to say, like, I just, as a practitioner of science, start from my observables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4415.407,
    "end": 4418.109,
    "text": "You can be a radical phenomenologist from this point of view if you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4418.129,
    "end": 4424.854,
    "text": "You're just starting from your observables and then working out, like, what resists your manipulations or interactions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4426.655,
    "end": 4435.241,
    "text": "Yeah, does that, in your view, kind of allow us to move around asking the questions about the physics of creation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4435.261,
    "end": 4435.341,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.533,
    "end": 4439.093,
    "text": " You can move around with, oh, about the fix of creation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.273,
    "end": 4439.433,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.014,
    "end": 4441.714,
    "text": "Move around, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.174,
    "end": 4443.894,
    "text": "Understand some things with cognitive meaning, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.474,
    "end": 4447.915,
    "text": "You have a FEP grounds cognitive meaning in the same theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.935,
    "end": 4448.955,
    "text": "It's a huge deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.276,
    "end": 4460.397,
    "text": "What it does not is afford ontological, consistent theory of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.097,
    "end": 4465.738,
    "text": "And the difference between us is not what we hold the FEP to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.557,
    "end": 4493.929,
    "text": " i think we're both instrumentalists um crime you as a realist um but the difference is that i see an affordance to build a much stronger uh self-consistent uh physical theory that draws element and the general philosophy from the fep the philosophy of active inference basically and so what you need here maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.635,
    "end": 4496.056,
    "text": " Excuse me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.136,
    "end": 4498.899,
    "text": "I push in this direction because I think the goal is variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.78,
    "end": 4501.722,
    "text": "It is ultimately an ethical call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.562,
    "end": 4507.347,
    "text": "If you do not agree that the goal is variable, you should not agree that it is useful to push it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.108,
    "end": 4510.551,
    "text": "I do not have ultimately an issue with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.438,
    "end": 4517.261,
    "text": " So maybe there is a Kantian take here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4517.281,
    "end": 4534.07,
    "text": "Because I think, at least in the history of philosophy, this split between realism and anti-realism or instrumentalism, I think it's perhaps overly simplistic as a description of the potential options.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4534.55,
    "end": 4538.352,
    "text": "There is a whole Kantian line of thinking that talks about,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4540.433,
    "end": 4543.414,
    "text": " You know, something intermediate in some sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4544.634,
    "end": 4547.495,
    "text": "So, you know, yeah, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4548.455,
    "end": 4549.375,
    "text": "Just a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.096,
    "end": 4553.676,
    "text": "So I couldn't elaborate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.776,
    "end": 4555.437,
    "text": "Is Adam in the room?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.177,
    "end": 4559.038,
    "text": "Adam, if you're in the room, use the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.998,
    "end": 4567.1,
    "text": "But in a sense, I agree that... Not in the room, but I can read another question whenever you're done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.12,
    "end": 4568.48,
    "text": "I'll read another question from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.185,
    "end": 4586.656,
    "text": " Yeah, but I was going to say something, which is that I agree that basically the distinction between instrumentalism and realism must be dissolved, because both, none of them are ontologically consistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.997,
    "end": 4590.179,
    "text": "Both suppose a representation relation that is outside the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.219,
    "end": 4591.64,
    "text": "And the question is, whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.597,
    "end": 4597.238,
    "text": " The words, as a formal construct, correspond to the reality as a structural thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.258,
    "end": 4600.279,
    "text": "It is not a constant question to ask.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.099,
    "end": 4602.54,
    "text": "All of the things are in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.64,
    "end": 4611.743,
    "text": "We have to have a theory of how things are true or not that affords for the statements we have about the world to be in the world, because they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.004,
    "end": 4618.845,
    "text": "And so from the moment you agree that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.317,
    "end": 4623.318,
    "text": " Anthological consistency is something to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.038,
    "end": 4632.522,
    "text": "A lot of the distinction we have in Western philosophy will be dissolved, which makes communication complicated, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4636.944,
    "end": 4639.666,
    "text": "Maxwell, you want a closing thought on that, or I'll ask the next question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.807,
    "end": 4644.128,
    "text": "You can ask the next question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4644.288,
    "end": 4647.59,
    "text": "I think that brings us nicely to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.261,
    "end": 4650.763,
    "text": " This is from Alex Kiefer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.764,
    "end": 4667.76,
    "text": "So Alex wrote, I love the positive story in this paper insofar as I understand it, which I'm still working on, and the idea of treating even such things as state spaces and scientific reps as amenable to physical descriptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.621,
    "end": 4696.493,
    "text": " but to bounce off what Maxwell is saying I'm not sure I see the deep critique of thing in itself realism here probably depends what one means by that I tend to think of the strictly incoherent Kantian idea of something unknowable behind phenomena so why is treating state space creation as part of phenomena at odds with that and it's also pasted in the chat that's uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.265,
    "end": 4725.645,
    "text": " just to pick up on that i think um you know we you don't need to be a strong realist uh you can just believe that you know you are more or less getting it right and the the semantics that we've proposed uh you know that uses active inference and the free energy principle is a kind of uh formal basis but precisely uses the fact that you know you have a certain perspective you have certain beliefs and your beliefs are going to be more or less wrong",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4726.425,
    "end": 4744.453,
    "text": " And the prediction error or the free energy is precisely what you need to, the kind of minimal ingredient that you need to hook you into a situation enough to be doing something pragmatic that you might call truth telling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4744.473,
    "end": 4754.698,
    "text": "I think that's really all you need from a formal point of view is just the ability to be wrong and to change your mind in light of new evidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.215,
    "end": 4768.739,
    "text": " So my claim is not that everything in physics is false and formal statement about postulated possibilities have no epistemic value or trivial epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.619,
    "end": 4780.042,
    "text": "My claim is that those representations, as any representation, are relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4780.563,
    "end": 4781.443,
    "text": "They relate to objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4783.371,
    "end": 4807.195,
    "text": " and the truth value or value in a sense that we have to give the meaning we have to give to that uh if we are to give anything at all must be grounded in the study of physical dynamics that underlie the emergence if we are to have again an ontologic consistent theory we could just say that science is discourse that is not entirely false and say things that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.244,
    "end": 4808.965,
    "text": " Not entirely false.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.586,
    "end": 4811.968,
    "text": "I could do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.149,
    "end": 4821.398,
    "text": "Again, the notion that theory's physical discourse must be ontologically consistent is, ultimately, ethical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.979,
    "end": 4825.122,
    "text": "Like, it is a statement on what you should and should not do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.602,
    "end": 4827.444,
    "text": "I can say that it is better because of X, Y, Z.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.467,
    "end": 4835.553,
    "text": " You can say that x, y, z are not meaningful targets to have, and that whatever we do is OK, essentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.873,
    "end": 4845.741,
    "text": "Or maybe it's better than x, y, z. But the notion that I do not critique state spaces, but at least it's not the point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.961,
    "end": 4849.744,
    "text": "I have to frame it as a critique for it to resonate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.605,
    "end": 4854.288,
    "text": "But the point is that state spaces are rational property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.834,
    "end": 4864.736,
    "text": " And that to study this rationality, it reframes the entirety of physics, its epistemology, its ontology, its cosmology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.276,
    "end": 4874.939,
    "text": "And if you look at the flow of this theory, it's not pure abstraction, it underlies social evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.219,
    "end": 4880.5,
    "text": "So evolution is agent-productive meaning as norms, and then the norms win the things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.46,
    "end": 4883.241,
    "text": "It is something that is very",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.038,
    "end": 4889.281,
    "text": " basic for us to understand how social systems evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.982,
    "end": 4892.684,
    "text": "And yet there is no such theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.964,
    "end": 4902.691,
    "text": "There is no theory of social evolution that do not presuppose variation and abstract away any form of structure and metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.252,
    "end": 4904.973,
    "text": "It simply does not exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.005,
    "end": 4915.409,
    "text": " So the non-existence of a naturalistic theory of social evolution is, in my view, a pretty big problem for a purely predictive, pragmatic value standpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.509,
    "end": 4920.851,
    "text": "From a more abstract standpoint, we don't have a coherent cosmology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.991,
    "end": 4927.454,
    "text": "We don't have an explanation for why there are things and why the things that are look like what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.314,
    "end": 4934.257,
    "text": "Physically, we just have to postulate that space-time is such and such for physics to make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.473,
    "end": 4956.088,
    "text": " it is a problem we can't have a physical theory that is that stands only on the fact that its statement does not give rise to obvious problems we have to have something beyond the statement we have to have some way to account for how this statement became true",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.219,
    "end": 4985.007,
    "text": " and it is a pretty basic point to make in psychology biology sociology we can't just say things are such and such we have to say how they become such and such and why they become such and such it is uh nothing in evolution nothing biology makes like nothing in biology makes sense except in light fruition and it is because those are systems that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.712,
    "end": 4986.773,
    "text": " I don't like teleological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.793,
    "end": 4988.394,
    "text": "Let's say teleonomical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.074,
    "end": 4992.936,
    "text": "Those are things that are organized, that are coherent, that work in a specific way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.737,
    "end": 5010.647,
    "text": "And so we have to... We cannot just say they do x, we have to say how and why they do x. And this epistemology has not permeated physics, basically, because of the belief of physicists in a platonic truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.367,
    "end": 5014.256,
    "text": " of symmetries or formalism or symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.938,
    "end": 5017.104,
    "text": "I have a question for you, Abel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5019.15,
    "end": 5030.657,
    "text": " So I'm thinking about this in terms of the direction of travel of our research on the free energy principle, which I mean, there are two main components to that we could discuss that are relevant here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5030.797,
    "end": 5046.387,
    "text": "The first is a move from state-based to path-based or path integral formulations where what's at stake is precisely probability density functions, not over individual states,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5046.906,
    "end": 5058.3,
    "text": " but over trajectories, entire trajectories of the system where like what your generative model or Lagrangian is describing is the probability of some specific history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5059.702,
    "end": 5064.208,
    "text": "So this kind of intrinsically historical formalization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5065.517,
    "end": 5088.58,
    "text": " And on the other hand, as a kind of second main direction of travel, really formalizing these kind of three nested scales of inference, where you have inference over state factors and individual states, like, you know, color, and red, green, blue, and so on, inference over the parameters of the model,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5089.356,
    "end": 5095.022,
    "text": " uh, the characterize the relations between, uh, states and configurations of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5095.442,
    "end": 5105.793,
    "text": "And finally the, um, structure of the model, which is really like the, uh, the actual, uh, you know, relations and functionality of like what is connected to what, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5106.567,
    "end": 5117.236,
    "text": " So one of the things that we're working on is getting to the mathematical foundations of these basically mutually constraining scales of inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5118.017,
    "end": 5130.107,
    "text": "So suppose, you know, you had access to a path based description of the free energy, you know, formalism supplemented by a clear, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5130.464,
    "end": 5141.127,
    "text": " a clear formulation of inference nested within parameter optimization, nested within structure optimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5143.568,
    "end": 5146.309,
    "text": "In other words, assuming that we solve structure learning,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5147.128,
    "end": 5148.249,
    "text": " which is a big assuming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5148.849,
    "end": 5156.775,
    "text": "But if you granted those two things, would there be still much of a problem, you think, from a formal point of view?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5157.155,
    "end": 5170.444,
    "text": "If you could just move in the space of all possible model structures and paths through such spaces, would you not basically address what you have in mind here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5171.305,
    "end": 5171.465,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.926,
    "end": 5176.589,
    "text": "So three things first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.706,
    "end": 5204.043,
    "text": " uh path integral it solves the issue of um preset meaning for biological systems and the issue of um well use of that already uh but it is not something i called on here so it would not help with the issue i've discussed second is structural learning uh the question is how basically living things project structure if we have that we would progress in a big way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5206.11,
    "end": 5232.064,
    "text": " or a theory of cognitive meaning and agency but you will still operate within a given space of possibilities you will have a attraction slash contraction of the state of possibles about by the by virtue of what the fep is it is it builds a manifold so the manifold like nothing will evolve on the manifold where it will evolve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5233.555,
    "end": 5240.8,
    "text": " So some of the state space will become trivial, some of the dimension will become trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.36,
    "end": 5247.145,
    "text": "And some things that do not really appear per se in the state space will become relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.985,
    "end": 5251.488,
    "text": "So they will become part of the state space as experienced by the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5252.308,
    "end": 5256.251,
    "text": "But the hard part is to account for how this state space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.882,
    "end": 5279.595,
    "text": " as experienced by the agent becomes this space per C. How you have a matrix of six par six that serves as a boundary, let us say, and how agents will basically collaboratively build systems of meaning where they have alphabet and can communicate long sentences using this grid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5280.616,
    "end": 5286.239,
    "text": "And this is not in and of itself a question of structural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5286.94,
    "end": 5315.255,
    "text": " Although solving structural learning wasn't able to have a lot of computational experiments that would help greatly with looking at the fine-grained structure, the question is how you use mathematics in a way that describes creation, that describes the construction of set spaces by the activities that occurs within the set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5316.167,
    "end": 5318.428,
    "text": " That's what I'm suggesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5319.768,
    "end": 5334.092,
    "text": "What I'm talking about is if you could figure out when to add a new node or edge to your generative model, precisely when is it appropriate to add a new parameter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5334.492,
    "end": 5339.893,
    "text": "When is it appropriate to say, oh, these two parameters are connected to that state in these proportions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5340.354,
    "end": 5345.275,
    "text": "If you had that worked out, I could see a straightforward resolution",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5345.855,
    "end": 5348.197,
    "text": " to what you're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5349.038,
    "end": 5362.249,
    "text": "The system just unfolds dynamically, and occasionally it learns new structure or parameters, which basically means new degrees of freedom are added to the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5364.511,
    "end": 5366.673,
    "text": "You are again talking at the epistemic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.713,
    "end": 5372.578,
    "text": "You can describe a lot of things by basically looking at the dynamics and being smart about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5373.69,
    "end": 5401.241,
    "text": " don't you don't even need advanced mathematics to do that this statement we make is different let us say that you have people that agree that shells are an appropriate means of exchange for x y and z then money becomes a thing it is a thing that exists individually because it has structural properties and these properties drive observables through dynamics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.745,
    "end": 5404.966,
    "text": " equally inevitably did not exist a month before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5406.126,
    "end": 5412.808,
    "text": "The question we ask is how we account for an evolution within a space that builds another space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5414.149,
    "end": 5419.391,
    "text": "And we cannot just look at what happened in the space and declare how it has changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.771,
    "end": 5423.212,
    "text": "It is not the problem we are posing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.392,
    "end": 5432.175,
    "text": "The problem is how to reason mathematically something that occurs within a space that produce another space that is the same but not the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.007,
    "end": 5442.614,
    "text": " that is structurally similar, that inherits from what existed before, but is different in qualitative aspect because this one thing became.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.454,
    "end": 5446.897,
    "text": "So what we have to have is a theory of becoming, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.998,
    "end": 5454.722,
    "text": "And we can be very smart about modeling things without having a theory of becoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.762,
    "end": 5462.348,
    "text": "We can be very precise in inference and very efficient at seeing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.52,
    "end": 5472.022,
    "text": " regime changes, that does not mean we have a self-consistent theory of becoming, creation, space construction, call it what we like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.862,
    "end": 5474.622,
    "text": "Those are two different problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5475.463,
    "end": 5486.125,
    "text": "Although one may help the other greatly, both may help the other greatly, because the thing we are looking at is the same way, looking at two very different aspects of the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.805,
    "end": 5494.667,
    "text": " Maxwell, want to add something or Alexi on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5494.827,
    "end": 5496.848,
    "text": "No, I'm going to think about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5497.809,
    "end": 5498.51,
    "text": "Thank you, Avil.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5500.051,
    "end": 5500.371,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.391,
    "end": 5504.575,
    "text": "Yeah, from the chat on that topic, Tom wrote a similar question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5505.035,
    "end": 5509.819,
    "text": "Avil, could you elaborate more on how Act-Inf could be expanded to accommodate state space creation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.319,
    "end": 5516.044,
    "text": "Assuming Act-Inf is normative about free energy minimization, when should an agent expand the state space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5516.524,
    "end": 5518.125,
    "text": "And Alex Kiefer also kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5518.926,
    "end": 5543.755,
    "text": " uh added a note it's appropriate to add a new parameter when the model complexity accuracy trade-off says so more seriously isn't free energy measurable across models or different state spaces so it's almost like there's the structure learning meta cognition layer and it almost is like can the box be wrapped within the box",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5544.861,
    "end": 5549.002,
    "text": " Can it be possible to have a state space that within its state space represents itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.783,
    "end": 5562.747,
    "text": "And or to what extent do these physical intermediates and their associated physics and metaphysics need to come into play for different systems and at what level of generality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5565.7,
    "end": 5592.82,
    "text": " basically about this i'd subscribe to a variant of uh consistent history uh interpretation of quantum physics but it's not quantum physics it's just something that has the kind of physical properties quantum physics has um well i did commit to quantum information earlier so okay let us say it is a in nature quantum which is bit trivial because yes it has pieces in it which is what being quantum is but whatever um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.154,
    "end": 5604.902,
    "text": " This is the most specific, mathematically consistent way to present its data inform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5604.922,
    "end": 5606.583,
    "text": "Do you still see those slides?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5607.043,
    "end": 5607.243,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5607.684,
    "end": 5608.244,
    "text": "EBA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.264,
    "end": 5610.166,
    "text": "EBA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.226,
    "end": 5611.486,
    "text": "Bay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.589,
    "end": 5623.696,
    "text": "And this is basically category theory, because this diagram has a property which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.999,
    "end": 5653.636,
    "text": " uh following the arrows basically change what uh space is b begins as a neutral interface or a space of possibilities that in principle afford interaction but is not semantically loaded and the fact that you have an iteration of e the observables and a i framed it as an agent but it would rather be agentive capabilities or constraints that enable the observation of e so um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5655.524,
    "end": 5678.469,
    "text": " this does not conserve the property of b because b becomes equipped with semantics so we have theories that look at spaces without looking at what is in spaces those are category theories and those are the most abstract field of mathematics as far as i know and i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5680.206,
    "end": 5706.213,
    "text": " do not afford uh semantically loaded things like free energy energy is a measure of not only it entails of states but it also entails a measure of states i think the basic mathematical structure we need to represent that is much more basic than any other things and any country measure will break down much before we get there but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5709.002,
    "end": 5723.551,
    "text": " What we have that is more exponentially loaded is this, the duality between the experience of structural landscape by agents and the flow that is generated by the landscape and reconstructed landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.692,
    "end": 5730.476,
    "text": "So the question was, what was the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5732.857,
    "end": 5735.019,
    "text": "Could you repeat it word for word, Daniel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.725,
    "end": 5754.554,
    "text": " It was just about the normativity around model selection and whether modeling state spaces could or would require the intermediation with the physical artifact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5756.615,
    "end": 5761.098,
    "text": "The normativity is there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5761.338,
    "end": 5763.259,
    "text": "It is in this representation of the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5764.319,
    "end": 5767.141,
    "text": "I have a small agent that represents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.975,
    "end": 5773.238,
    "text": " a circular landscape and act within it, and I can just claim, okay, there is a set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.438,
    "end": 5774.559,
    "text": "There is a flaw in the set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5774.699,
    "end": 5775.58,
    "text": "I can define strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5775.96,
    "end": 5777.581,
    "text": "This agent minimizes free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5778.662,
    "end": 5786.166,
    "text": "And then this is where structural learning intervenes, basically, because those agents will try to understand the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5786.306,
    "end": 5787.927,
    "text": "They do not experience the world directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.308,
    "end": 5793.491,
    "text": "They will infer the world in a way that is robust and competent, but they can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.793,
    "end": 5820.505,
    "text": " make up new things they can fail to understand they can cheat they can erode the structure of the landscape that is collectively enacted in many ways and this um again is due to something that is the uh chemical it's not dynamical actually i i do not know what it is it doesn't have a word the uh unfolding of uh the structure of the landscape under its own",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.573,
    "end": 5826.224,
    "text": " It's on flow that, again, is not dynamical because it's not what dynamical sensory says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.427,
    "end": 5830.875,
    "text": "We've described what you're talking about in terms of niche construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5833.714,
    "end": 5839.896,
    "text": " Carl and I had an interesting discussion about this a few weeks ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5840.817,
    "end": 5856.904,
    "text": "I think what really distinguishes human systems from non-human systems is the degree to which the active inference loop is mediated by what would otherwise be internal states, but that end up having this kind of ambiguous function of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5857.424,
    "end": 5879.639,
    "text": " Yeah, they're environmental, but they encode the material aspects of some normative practice, or they store some information about what you're doing, like a blackboard, for instance, or these slides that we're all looking at, and in some sense encode the thought or aspects of the thought that you're trying to communicate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5879.659,
    "end": 5880.379,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5882.136,
    "end": 5889.401,
    "text": " Yeah, maybe a lot of the problem here can be finessed by noting that it's not just about agents interacting with each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5889.801,
    "end": 5900.148,
    "text": "There is a kind of common store of, you know, or traces, you know, like a kind of material thing that we all have in common.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5900.208,
    "end": 5900.909,
    "text": "Exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5901.309,
    "end": 5901.649,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5902.21,
    "end": 5902.85,
    "text": "And that is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5906.047,
    "end": 5915.154,
    "text": " You have a collective inaction of a given structure landscape because humans are such that they synchronize in a robust and semi-loaded way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5915.835,
    "end": 5919.298,
    "text": "And that structure landscape, it does not exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5920.579,
    "end": 5924.342,
    "text": "It is not something that pre-exists the fact that agents do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.862,
    "end": 5927.004,
    "text": "Agents infer properties and then enact them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5928.285,
    "end": 5930.547,
    "text": "And this makes it an open landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5931.665,
    "end": 5951.961,
    "text": " And the normativity of the FEP affords probably a computational experiment design that help us see how such landscape unfolds and look at mathematical theory where the agent is absent, where it is landscape that produce the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5952.481,
    "end": 5954.523,
    "text": "And once we have that, we have a theory of creation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.563,
    "end": 5955.884,
    "text": "It is what a theory of creation is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5957.595,
    "end": 5970.82,
    "text": " So what you're saying is if we had a theory where the agent was able to expand its state space through structure and parameter learning in particular, then we would have what you're looking for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5971.2,
    "end": 5972.32,
    "text": "Am I misunderstanding?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5974.601,
    "end": 5981.243,
    "text": "Yes, but I'm not sure that we agree that we're aligned on the constraints that this segment entails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5985.785,
    "end": 5986.585,
    "text": "Not sure I see what you mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5988.038,
    "end": 6007.951,
    "text": " the goal is not to understand how the agent engage with personal environment it is to abstract if we get to the target we can abstract entirely the agent and what they think and just look at constraints and how they unfold i went light on the constraint ontology because we do not have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6008.978,
    "end": 6009.918,
    "text": " It was not the place for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.438,
    "end": 6020.761,
    "text": "But we need to look at, specifically, constraints over what is observable, and how they are individuated, and how they produce other constraints, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6021.021,
    "end": 6028.623,
    "text": "We have to get back at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6032.18,
    "end": 6058.053,
    "text": " constraints are dual to uh priors i mean you're talking about the same thing so but the formulation that is taken in physics often by belief is dst it entails a primitive space and this is what needs to be um to address the problem i want to address this is why to have to be overcome and this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6059.68,
    "end": 6063.604,
    "text": " is likely possible given a constraint-centric ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6063.664,
    "end": 6071.231,
    "text": "So an ontology where you do not have possibilities, then constraints of other possibilities, but constraints, then possibilities afforded by constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6072.212,
    "end": 6075.935,
    "text": "And I do not know how... What I'm saying is that those two stories are the same story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6077.096,
    "end": 6078.978,
    "text": "That's what Bayesian mechanics says.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6079.879,
    "end": 6081.12,
    "text": "It is from within DST.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6084.951,
    "end": 6088.094,
    "text": " But they're both from DST.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6088.594,
    "end": 6102.305,
    "text": "So a free energy principle theoretic model of the belief updating of a particle in a system is, in the strong sense of like, is dual to if I have one, I have the other, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6102.846,
    "end": 6103.066,
    "text": "Is dual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6104.248,
    "end": 6115.718,
    "text": " a maximum entropy dynamical systems model of the whole system, as in the whole system of particles and environment to which it's coupled and all of that sensory motor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6116.638,
    "end": 6118.4,
    "text": "That's the cool thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6118.42,
    "end": 6124.826,
    "text": "The FEP is the canonically optimal dynamical systems model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6125.606,
    "end": 6127.648,
    "text": "It's maximum entropy in the sense that, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6128.135,
    "end": 6136.098,
    "text": " It is the, it makes the least assumptions given your current state of knowledge about the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6136.538,
    "end": 6143.861,
    "text": "You know, it's Jane's, Jane's as in, you know, J-A-Y-N-E-S.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6144.141,
    "end": 6146.702,
    "text": "It's Jane's optimal in the parlance of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6147.282,
    "end": 6148.483,
    "text": " Dalton Shaktivadival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6149.443,
    "end": 6154.506,
    "text": "Yes, so if you have a constraints model, you also have an FEP model and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6154.926,
    "end": 6162.17,
    "text": "If you work it out from the perspective of the FEP, you can map back onto a constraint, but definitionally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6163.531,
    "end": 6171.876,
    "text": "If you can frame a constraint model with no reference whatsoever to the chemical systems theory or pre-existing species, yes, I agree, you have solved the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6173.849,
    "end": 6192.499,
    "text": " but the paper which you refer to frames it within the st so it have that's interesting which is those that we need to get beyond to solve this specific problem again i do not mean to say basically you have a you have framed this equivalence i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6193.587,
    "end": 6195.568,
    "text": " up to details, let us say up to details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6196.148,
    "end": 6197.309,
    "text": "I would need to think about it, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.769,
    "end": 6205.472,
    "text": "But with hypotheses that are precisely those that I want to use the equivalence to overcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.533,
    "end": 6208.374,
    "text": "So it is not the same question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6208.414,
    "end": 6214.156,
    "text": "I guess I'm just saying that constraints don't get you out of the problem that you were posing originally either.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6214.597,
    "end": 6221.34,
    "text": "Like both, you have another kind of layer of pre-given static.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6222.418,
    "end": 6224.179,
    "text": " is not we have to characterize constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.739,
    "end": 6227.481,
    "text": "It is that we have to have an ontology of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.981,
    "end": 6233.224,
    "text": "So mathematical constructs that uses constraints with no reference to anything else, just constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6234.425,
    "end": 6235.305,
    "text": "What it means, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6235.805,
    "end": 6248.912,
    "text": "But if we have that, in the sense, while conserving the sense that is given by Monsieur Moreno, and while leveraging the equivalence between constraints and belief, meaning belief, whatever, that you derived, we have one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6249.473,
    "end": 6251.614,
    "text": "But it is not something that has been done because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.538,
    "end": 6269.973,
    "text": " FEP is framed within, well, vanilla FEP, the FEP is framed within DST, which presupposes state, and QFEP is, well, does not specify what build up survivability, just specify that there are observables, that we can make observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6274.17,
    "end": 6279.793,
    "text": " But we cannot solve this within DST or within pure abstract quantum information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6279.813,
    "end": 6282.115,
    "text": "It is not afforded by the structure of these theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6282.655,
    "end": 6284.936,
    "text": "One presupposes states, the other presupposes observers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6285.116,
    "end": 6290.42,
    "text": "We have to show how those are becoming integrated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6291.46,
    "end": 6296.123,
    "text": "And the only way forward I see is a constraint ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6297.873,
    "end": 6298.053,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6298.093,
    "end": 6308.084,
    "text": "But what I'm saying is just mathematically speaking, if you're talking about constraints, then there is a, in the end, it's probably functorial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6308.284,
    "end": 6318.034,
    "text": "I mean, you know, there is a rigorous and systematic mapping from what you're talking about to what the FTP is already saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6319.816,
    "end": 6324.94,
    "text": " That's really what the duality is saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6326.361,
    "end": 6335.088,
    "text": "Maximizing your entropy with respect to some set of constraints is dual to minimizing your free energy with respect to some model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6335.428,
    "end": 6336.289,
    "text": "It's the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6336.609,
    "end": 6338.651,
    "text": "If you have one, you always have the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6341.204,
    "end": 6349.489,
    "text": " How would you frame the notion of a constraint in the sense of Monsieur Monteville and Moreno with no reference to either DST or inviolated states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6350.249,
    "end": 6355.952,
    "text": "Well, I mean, in these reaction networks that they're mapping, they are implicitly using some kind of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6355.972,
    "end": 6358.414,
    "text": "They are not mapping the reaction networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6359.114,
    "end": 6360.675,
    "text": "It is another line of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6361.996,
    "end": 6366.819,
    "text": "Right, but I'm just saying that there is a similar kind of like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6367.819,
    "end": 6378.385,
    "text": " individuation of things that's going on when you map out like some kind of constraint schematic in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6378.705,
    "end": 6390.472,
    "text": "Like, yeah, the point that you're making sort of like grandfathers both here, which is okay, but how do you, you know, write down a state space model at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6391.193,
    "end": 6394.995,
    "text": "And how do they, how do you grow them in particular?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6395.015,
    "end": 6395.095,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6395.906,
    "end": 6418.84,
    "text": " um but i guess i'm just saying like yeah constraints are just as subject to this as to the extent that the fep is subject to your criticism the constraint stuff is also for the same or dual reasons like if you just inverted all of the arrows in your reasoning you would also be able to apply this to the constraint stuff equally like that's not an exit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6419.793,
    "end": 6421.054,
    "text": " to what you're pointing out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6421.354,
    "end": 6436.723,
    "text": "But I guess my complimentary point is if you think moving to a constraint ontology helps us, then that's interesting because any constraint mapping is also dual to an FEP theoretic model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6437.664,
    "end": 6447.57,
    "text": "So maybe the FEP can be used very directly just based on the way that you're... If you solve the problem in terms of constraints, you could flip it back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6448.05,
    "end": 6448.771,
    "text": "It doesn't really...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6450.083,
    "end": 6471.444,
    "text": " And I don't know if you're stuck along the way, then you can flip it at that point and think, okay, well, does looking at it from this, like, do I want to look at self-organization from the perspective of the selves that are self-organizing or from the perspective of organization and, you know, the maximization of entropy and all that stuff, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6473.015,
    "end": 6481.721,
    "text": " So if you're agreeing that the FEP treats an entirely different problem, this is not a view I hold, this is a view I oppose specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6482.482,
    "end": 6492.349,
    "text": "I do agree that physics of and by belief derives within DST a rigorous relation between basically what are the two sides of this up to details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6494.15,
    "end": 6500.034,
    "text": "What I am saying is framing as a goal the fact to leverage that as a way to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6502.432,
    "end": 6505.954,
    "text": " build the mathematical theory of state-space construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6506.694,
    "end": 6522.882,
    "text": "And I also claim that this would be essentially equivalent to build self-consistent and ontologically consistent constraint ontology for that, for this diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6524.423,
    "end": 6526.244,
    "text": "I'm not sure what you're going to get because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6527.097,
    "end": 6535.219,
    "text": " It is unambiguous that your research, as of now, is framed within DST, which presupposes states which the constraint ontology would not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6535.779,
    "end": 6544.862,
    "text": "And it is unambiguous that it is very relevant because it, as you said, entails one duality, at least in one specific case, which is this of DST.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6545.222,
    "end": 6547.822,
    "text": "That is the key problem to address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.562,
    "end": 6553.304,
    "text": "So I think you're... Wait, you may be combining two issues in this worry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6553.324,
    "end": 6554.544,
    "text": "I mean, so the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6555.454,
    "end": 6563.636,
    "text": " There's the worry of, like, new states arising, and there's the worry of using states at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6563.696,
    "end": 6578.658,
    "text": "So, I mean, I think the latter is very... Okay, so... Yeah, so the problem is not really that, you know, dynamical systems theory assumes states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6578.858,
    "end": 6583.139,
    "text": "It's just the staticness of the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6583.948,
    "end": 6590.29,
    "text": " Or the, you know, the pre-determinateness or the pre-specifiedness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6590.571,
    "end": 6591.551,
    "text": "Okay, so yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6591.951,
    "end": 6600.954,
    "text": "So if that's specifically your worry, then there is a very fruitful way forward, I think, to address a lot of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6601.335,
    "end": 6605.936,
    "text": "My proposal is a state-spaced construction, not state-spaced negationism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6608.848,
    "end": 6610.469,
    "text": " I need B to begin with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6610.489,
    "end": 6614.031,
    "text": "I need physical things to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6614.512,
    "end": 6622.778,
    "text": "Well, to have an actual self-consistent theory, you would need this to work from ex nihilo, to get something from nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6623.93,
    "end": 6626.033,
    "text": " But it is not the issue at hand here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6626.193,
    "end": 6632.38,
    "text": "The issue at hand here is how existing things can unfold, create whatever, meaning states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6632.92,
    "end": 6635.763,
    "text": "So it is not the notion of states that is the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6636.244,
    "end": 6643.412,
    "text": "The problem is the fact that we do not have a theory of how states are created, and we cannot frame it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6644.298,
    "end": 6650.605,
    "text": " exclusively from a mathematical theory that, by construction, presupposes a space of possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6650.985,
    "end": 6658.773,
    "text": "We can, however, leverage a result from this theory to generalize it to a space construction, which is what I'm proposing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6659.77,
    "end": 6675.562,
    "text": " so but what about the renormalization group so if you start really from the idea that you just have you know observations and they uh you know have a scale of noise associated with them um yeah you can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.302,
    "end": 6695.915,
    "text": " I mean, there are principled, you know, physics-y kind of ways of bootstrapping something, kind of saying, well, you know, some stuff changes so fast relative to my reference scale that it basically averages out and just contributes kind of random fluctuations to what I'm observing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6697.216,
    "end": 6698.597,
    "text": "Whereas other stuff is staged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6698.617,
    "end": 6705.221,
    "text": "You have a space of possibilities, and you look at, basically, a way to analyze it to look at relevant scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6705.888,
    "end": 6712.53,
    "text": " But maybe it would be afforded to have a past parallelism, but it does not entail and does not model past parallelism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6712.57,
    "end": 6716.931,
    "text": "It is a model of how complex things, complex dynamics unfold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6719.612,
    "end": 6720.833,
    "text": "So it is relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.893,
    "end": 6723.633,
    "text": "It is not what I'm pointing at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6727.795,
    "end": 6728.015,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6730.419,
    "end": 6738.966,
    "text": " As we come near the end, for each of us, maybe you can spend the most time, Avel, but for each of us, what are our next steps?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6740.327,
    "end": 6748.393,
    "text": "What cognitive counterfactuals and physical embodiments are going to be shaped by this work and discussion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6749.574,
    "end": 6755.078,
    "text": "Maybe we can have non-Avel go first, and then you can have the last word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6755.339,
    "end": 6755.699,
    "text": "Sound good?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6758.49,
    "end": 6769.139,
    "text": " Well, personally, I'm very excited to work on the category theory this year, learning about the recent dissertation of Toby Smith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6770.44,
    "end": 6776.966,
    "text": "Also, I think it's interesting to bring in that niche modification, active inference approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6777.927,
    "end": 6806.347,
    "text": " variational ecology a lot of the work that as maxwell brought up earlier had been framed within a multi-scale setting bringing some of these new developments over the last one or two years like the path-based formalization renormalization group environmental process generative process generative model symmetries weak markov blankets there's just many new concepts and toolkits on the table today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6807.308,
    "end": 6830.372,
    "text": " in 2023 than i think there were one or two or three years ago so it's been a super interesting discussion and it brings a lot of topics to our attention that i expect we'll be able to reduce our uncertainty about a lot in the coming year and i'll pass to alexi then maxwell with an apple",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6831.73,
    "end": 6835.752,
    "text": " The opposite, it would be more consistent because Alex and I work directly together in Kairos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6835.952,
    "end": 6837.292,
    "text": "Okay, Maxwell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6842.094,
    "end": 6847.216,
    "text": "Well, I mean, Daniel, I would echo your overall assessment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6847.657,
    "end": 6853.519,
    "text": "I share your enthusiasm for where everything is at right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6853.539,
    "end": 6860.622,
    "text": "I think we're poised for some very exciting work and a lot of very interesting stuff has happened over the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6861.104,
    "end": 6881.523,
    "text": " short term, uh, in terms of what Avelis presented, um, I think, uh, you know, uh, in addition to what you were describing, one of the things I want to, uh, like work out this year is really, um, the philosophy of the free energy principle or Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6882.043,
    "end": 6882.444,
    "text": "I think, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6883.576,
    "end": 6900.903,
    "text": " up until recently what what most everyone has been doing myself included was just coming at this thing from whatever you know disciplinary background we had access to and trying to just make sense of it but uh i think that has made us kind of blind to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6902.444,
    "end": 6916.069,
    "text": " Some of the, and everyone has kind of their blind spots, you know, all of these so-called interpretations of the FEP signal to me that there's, there's actually, yeah, there's, there's philosophical work to be done to kind of understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6916.769,
    "end": 6918.729,
    "text": "Jules Hedges put it nicely on Twitter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6918.769,
    "end": 6921.97,
    "text": "I think he said that he'd become convinced of two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6922.051,
    "end": 6926.272,
    "text": "First, the FEP is true in the sense that it's quote unquote, the right way to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6926.592,
    "end": 6929.133,
    "text": "And second, that it's a lot more like boring and,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6929.81,
    "end": 6955.867,
    "text": " than all the hype suggests in the sense that it's yeah it just follows from the way that a bunch of physics hooks up it's very very fundamental and important but like yeah i mean um there are it it's it's part of the kind of core package now and there are new exciting horizons of like unknown but you know more more to the the point is that there's there's like a kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6956.607,
    "end": 6961.669,
    "text": " core philosophy to the FEP that remains to be developed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6961.729,
    "end": 6973.173,
    "text": "So, for example, the duality between the principle of maximum entropy, which, you know, implements a form of like Occam's razor in some sense, and the free energy principle, I think is kind of deep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6974.273,
    "end": 6975.534,
    "text": "But we've only started to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6976.414,
    "end": 6991.307,
    "text": " think about, you know, the implications that have and Chris Fields, his group has been suggesting that there's a similar duality between the FEP and unitarity, or the conservation of classical information in quantum information theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6991.928,
    "end": 6994.79,
    "text": "So that's very exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6995.03,
    "end": 6996.352,
    "text": "Sorry for talking so long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6997.873,
    "end": 6999.234,
    "text": "Awesome, exciting times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6999.755,
    "end": 7000.115,
    "text": "Indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7000.916,
    "end": 7003.238,
    "text": "All right, Alexi and Aval with the final words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7007.168,
    "end": 7021.046,
    "text": " yeah so uh i will be short so i'm really excited about how these debates will move the lines in theoretical but also practical philosophy and on our direct perception of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7021.903,
    "end": 7024.705,
    "text": " stuff in life in general, to be a bit broad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7026.066,
    "end": 7045.839,
    "text": "Also, I hope that all of this will make, like, I hope this will make the difference in metaphysics and ontology and philosophy, and meta-ontology also, and naturalism, of course, as it seems to do in Active Inference Lab and Kairos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7050.803,
    "end": 7051.243,
    "text": "And Apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7054.645,
    "end": 7061.689,
    "text": " So there are three things we need to do to settle the dust on the argument I generated there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7062.189,
    "end": 7067.773,
    "text": "The first is to formalize much better the argumental ontological consistency and past pluralism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7068.233,
    "end": 7074.296,
    "text": "Both need to be very clear in their reach and entailments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7074.897,
    "end": 7077.138,
    "text": "This is something we'll do with Alexi mainly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7078.235,
    "end": 7079.776,
    "text": " and possibly other group members.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7082.698,
    "end": 7090.523,
    "text": "Something that we need to do too is to put a lot of work in working out what these Bayes things mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7091.384,
    "end": 7092.104,
    "text": "I do not know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7092.204,
    "end": 7094.746,
    "text": "I can tell you that it is essentially correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7095.046,
    "end": 7102.471,
    "text": "I'm pretty confident that it's essentially correct, but I have no idea whatsoever what it means mathematically, which is a pretty big problem as far as I'm concerned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7103.143,
    "end": 7124.416,
    "text": " So there will be a lot of work for me and other members, namely Yuna Brenak and Maxime Trimollet, to work out the specifics of this mathematical thing that allows order to unfold from chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7127.378,
    "end": 7127.538,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7128.847,
    "end": 7135.29,
    "text": " Most pressingly, in my opinion at least, it's what I'm supposed to focus on in terms of my expected workflow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7136.11,
    "end": 7142.052,
    "text": "It is to work out what this means, how social constraints are enacted and how they evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7142.513,
    "end": 7144.533,
    "text": "Because ultimately the rest is abstraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7144.593,
    "end": 7146.394,
    "text": "This is what has content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7146.934,
    "end": 7150.176,
    "text": "This is what allows us to say, okay, these are what exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7150.196,
    "end": 7152.076,
    "text": "These are the constraints that shape things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7152.437,
    "end": 7154.838,
    "text": "And this is what is their flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7156.398,
    "end": 7158.099,
    "text": "It is critical from a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7160.149,
    "end": 7186.244,
    "text": " scientific perspective because it is what gives me to this entire account it is critical from a well pragmatic perspective because it is uh what tells us uh what world we are in and what is its flow which is the goal of kairos something we'll do with um namely manon job and reynolds gonzalo and um so basically we will work around the specific of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7187.478,
    "end": 7190.282,
    "text": " And if someone is interested to collaborate, please write us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7190.582,
    "end": 7197.19,
    "text": "We will be very interested because there is a lot of... All of these problems are big problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7197.45,
    "end": 7199.072,
    "text": "All will say to a lot of firepower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7199.993,
    "end": 7206.742,
    "text": "So basically, anyone who wants to... Who is interested in working on the specifics with us is very much invited to reach out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7210.6,
    "end": 7232.59,
    "text": " excellent thank you alexi apple and maxwell for joining thanks everybody for watching till 34.2 all right it's over thanks yeah thanks both fellows um um",
    "speaker": "SPEAKER_01"
  }
]