[
  {
    "start": 8.131,
    "end": 31.759,
    "text": " hello welcome everyone it is may 20th 2025 we're in act inf math stream number 13.1 with alexi toomey discussing disco pi monoidal categories for active inference this should be a very exciting and useful presentation and stream so thank you very much for joining and looking forward to learning more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.511,
    "end": 59.873,
    "text": " yeah thanks a lot um so thanks a lot for the invite and yeah i guess um as i was saying just a couple of minutes ago um i'm very much looking forward to this talk and it's a bit of a challenge for me i guess in a sense that i'm no expert in active inference so i'll do my best at explaining what i think active inference is about and i also try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.853,
    "end": 82.789,
    "text": " uh yeah convince the audience here that um disco pi uh this python library uh for uh string diagrams is a promising way to to experiment with active inference so i guess um most of the the references i'll be using for for today would be this main disco pi paper um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.769,
    "end": 86.956,
    "text": " You can also check out the documentation on GitHub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.996,
    "end": 87.918,
    "text": "It's quite extensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.938,
    "end": 90.762,
    "text": "We've got plenty of examples and notebooks to play around with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.764,
    "end": 99.377,
    "text": "And then I'll give a small glimpse of what this compiled software is used for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.357,
    "end": 108.936,
    "text": " idea of QNLP, Quantum Natural Language Processing, which is what motivated the library in the first place, what I wrote my PhD thesis about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.677,
    "end": 119.577,
    "text": "And I guess I'll give some introduction to category theory, which is the sort of mathematical foundations on which this COPA is built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.557,
    "end": 141.721,
    "text": " And then I'll be using mostly this recent paper from Toh, Kleiner, and Smythe on active inference in string diagrams, where essentially they use the same mathematics that I was using for quantum NLP and apply that to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.922,
    "end": 146.847,
    "text": "And in a sense, that's where I learned all I know about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.827,
    "end": 174.96,
    "text": " i'll be giving a summary of the sort of theoretical background um and then i'll be mostly showing some screenshots from that paper to try and show how that theory applies to active inference in particular and then then we can discuss uh how disco pi could be used um to implement active inference experiments so yeah let's uh let's get going um so i guess the main um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.632,
    "end": 194.518,
    "text": " theoretical concept in this company is a box so like we we draw these boxes a lot and i guess uh i um i don't roast coffee every morning but i grind coffee i make a brew coffee every morning and i i guess that's uh something that you're gonna understand in terms of a black box where you you put",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.988,
    "end": 200.077,
    "text": " put a bunch of inputs like green coffee beans, electricity, roast level, start signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.838,
    "end": 201.74,
    "text": "It could be physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.76,
    "end": 202.802,
    "text": "It could be information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.842,
    "end": 215.123,
    "text": "These boxes are sort of abstract conceptual operations that just have a name, a designated list of inputs and outputs, and a designated list of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.103,
    "end": 218.77,
    "text": " So yeah, a designated list of inputs and a designated list of outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.79,
    "end": 228.149,
    "text": "So you've got two sets, the objects, so the things that are on the wires and the boxes have names too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.269,
    "end": 232.197,
    "text": "And then you have these two maps from boxes to lists of wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.479,
    "end": 237.347,
    "text": "So that gives you all the processes that you can talk about in your theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.327,
    "end": 244.239,
    "text": " And then you can translate one theory into another using these morphisms of signatures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.84,
    "end": 250.83,
    "text": "So first, if you have a box from X to Y, you draw it with an arrow in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.271,
    "end": 259.926,
    "text": "And then if you have a morphism of signature, what it means is you can translate wires of one into lists of wires in the second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.906,
    "end": 267.04,
    "text": " And then you can translate a box in one into a box in the appropriate thing in the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.18,
    "end": 271.087,
    "text": "So if you have... So this should be sigma prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.107,
    "end": 271.989,
    "text": "I guess it's a typo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.009,
    "end": 276.558,
    "text": "But you translate boxes in a way that respects the inputs and outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.079,
    "end": 280.345,
    "text": "And so that's very useful because...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.325,
    "end": 291.259,
    "text": " If you have different kinds of processes and you want to translate between them, that concept of morphism of signatures is going to be the key one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.74,
    "end": 298.769,
    "text": "And so I guess with that, you can define the set of diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.789,
    "end": 304.155,
    "text": "So that's going to be the main definition for this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.277,
    "end": 309.302,
    "text": "And you start with a signature, and then you define diagrams by induction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.282,
    "end": 311.065,
    "text": " where every box is a diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.886,
    "end": 316.653,
    "text": "The identity is a diagram, and you draw it with just a bunch of parallel wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.714,
    "end": 322.161,
    "text": "The composition of a diagram from x to y and y to z is also a diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.181,
    "end": 326.327,
    "text": "So if you have two diagrams, you can plug them one after the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.148,
    "end": 330.674,
    "text": "And then the tensor of two diagrams is also a diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.694,
    "end": 337.804,
    "text": "So if you have f and f prime, you can put them side by side, and you get something that goes from xx prime to yy prime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.122,
    "end": 339.023,
    "text": " And that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.223,
    "end": 344.068,
    "text": "So you can put diagrams in sequence and in parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.088,
    "end": 348.373,
    "text": "And you can also do nothing, so this identity diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.834,
    "end": 356.342,
    "text": "And then I guess the subtlety that we'll use here is that, well, I guess first, you need to put some axioms on these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.962,
    "end": 360.446,
    "text": "So I guess you want tensor and composition to be associative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.547,
    "end": 362.709,
    "text": "You want them to be unital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.729,
    "end": 365.732,
    "text": "So if you compose with the identity, it doesn't do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.712,
    "end": 372.342,
    "text": " If you tensor with the empty diagram, so the identity on nothing on the empty list, that's also doing nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.063,
    "end": 378.831,
    "text": "And then you want just these two equations that tell you that you can switch identity and tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.931,
    "end": 381.875,
    "text": "So ID of tensor or tensor of ID is ID of tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.276,
    "end": 388.805,
    "text": "And similarly for the composition, the tensor of two compositions is going to be the composition of the tensors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.906,
    "end": 392.631,
    "text": "And we'll see what that looks like in terms of diagrams in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.539,
    "end": 411.569,
    "text": " But as I was saying, this sort of nice thing that you get is that if you take a signature and you look at all the diagrams that you generate from it that makes a new signature, and you can use that as a signature where essentially now the boxes have diagrams inside them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.669,
    "end": 416.577,
    "text": "And so that's a way of formalizing an idea of hierarchical diagrams where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.557,
    "end": 423.093,
    "text": " Essentially, a subdiagram will contain or a subdiagram is a box that contains a diagram inside it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.056,
    "end": 432.557,
    "text": "So we'll use a lot of these hierarchical diagrams where we'll see the boxes serve to encode normalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.537,
    "end": 443.748,
    "text": " And so, yeah, to get back to this main equation, I guess that's the only equation you need to remember and you don't actually need to remember it because essentially you got it built into your visual system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.009,
    "end": 459.304,
    "text": "So that's the sort of main argument for why you should use string diagrams is that essentially they encode this very natural way of looking at processes as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.284,
    "end": 471.721,
    "text": " things on the plane where the axioms become just manipulation of these diagrams geometrically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.741,
    "end": 478.17,
    "text": "So, for example, this axiom of naturality where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.15,
    "end": 501.289,
    "text": " you exchange the composition and the tensor this amounts to having either the boxes composed uh first sequentially and then in sequence or first in sequence and then sequentially and that gives you the same um the same diagrams in the end so the only thing that counts is how things are connected i guess is the the main uh idea for that axiom",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.725,
    "end": 503.849,
    "text": " And so you can apply that to cooking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.292,
    "end": 509.26,
    "text": "The ingredients are going to be your wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.46,
    "end": 511.143,
    "text": "The cooking steps are going to be your boxes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.564,
    "end": 516.294,
    "text": "And now anything that you can compose with these cooking steps will be a recipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.354,
    "end": 523.648,
    "text": "It takes a bunch of inputs, like eggs, and gives you a bunch of outputs, like whites and yolks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.797,
    "end": 534.273,
    "text": " And yeah, I guess this axiom of exchanging tensor and composition, essentially, it amounts to formalizing what we mean by independence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 534.293,
    "end": 541.344,
    "text": "So if we have two boxes that are not connected, like tracking here and tracking here, we can perform them in any order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.346,
    "end": 547.133,
    "text": "If they're independent, it doesn't matter how we decompose this tensor of composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.176,
    "end": 552.201,
    "text": "So yeah, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.721,
    "end": 556.044,
    "text": " Let's look at what this diagram looks like in Python.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.925,
    "end": 567.196,
    "text": "So the main feature of this copie is you get this very nice syntax for expressing any such string diagram as essentially as a Python function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.256,
    "end": 572.841,
    "text": "So you start by declaring some types for the ingredients of your recipe, like egg, white and yolk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.901,
    "end": 577.446,
    "text": "You have a box for cracking an egg and giving white and yolk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.814,
    "end": 606.471,
    "text": " you have these parameterized boxes, so merge, you can merge anything, so any X, and that takes two Xs and gives you an X. And now, to define the diagram on the right, you'll just define a Python function, declare its inputs and its outputs, and now, if you take X and Y for the two Xs, you crack them, you get AB is a white yolk pair, CD is a white yolk pair, so you can merge the whites together, merge the yolks together, and return.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.822,
    "end": 609.705,
    "text": " So you get your diagram, and you can draw it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.725,
    "end": 614.59,
    "text": "So this output on the right is actually what this gives you as a drawing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.63,
    "end": 621.897,
    "text": "And you can also write it in terms of pure operations of tensor and composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.977,
    "end": 626.382,
    "text": "So this at symbol is how you do the tensor, the parallel composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.602,
    "end": 629.905,
    "text": "And these chevrons do the sequential composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.626,
    "end": 634.77,
    "text": "And here, you notice that we need this special box for the swap, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.105,
    "end": 639.776,
    "text": " At first with just tensor and composition, you can only do planar processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.257,
    "end": 646.291,
    "text": "So here you need this special swap box that takes yoke and white and gives you white and yoke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.474,
    "end": 652.185,
    "text": "So yeah, I guess that's the sort of simplest example of how to use this copier is you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.84,
    "end": 654.002,
    "text": " Define a bunch of types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.565,
    "end": 664.941,
    "text": "Define a composite model, composite diagram out of these basic steps, basic boxes and types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.562,
    "end": 666.824,
    "text": "And then you can draw the results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.944,
    "end": 668.868,
    "text": "I guess drawing the result would be the first step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.629,
    "end": 673.836,
    "text": "And in a second, we'll look at what else you can do with diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.229,
    "end": 683.01,
    "text": " So a more interesting example, I guess, in our context will be a generative model as a diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.532,
    "end": 685.598,
    "text": "So on the left,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.489,
    "end": 694.425,
    "text": " You have the basic example of a probabilistic model where you have random variables numbered x1 to x5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.387,
    "end": 697.01,
    "text": "And then you have these arrows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.112,
    "end": 702.461,
    "text": "I guess here some arrows are designated as input arrows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.683,
    "end": 707.13,
    "text": "Here on the left, x2 and x3 are sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.11,
    "end": 709.575,
    "text": " variables that I guess you get to control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.655,
    "end": 713.443,
    "text": "You can choose some distributions over these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.483,
    "end": 718.012,
    "text": "Then you have some hidden variables like this X1, X2, and X4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.574,
    "end": 720.938,
    "text": "And you have observed variables, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.959,
    "end": 725.127,
    "text": "The X5 and X3 would be the things that you can actually observe in the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.648,
    "end": 728.494,
    "text": "And then sort of implicitly in every",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.879,
    "end": 740.121,
    "text": " such probabilistic model, graphical model, you would have conditional probability distribution for every variable given the variables that point to it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.141,
    "end": 746.213,
    "text": "And so in the world of string diagrams, these conditional probability distributions become the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.682,
    "end": 768.538,
    "text": " the important thing in a sense like the i guess here the labels you could almost forget about these labels x1 to x5 they help to make the correspondence here but the actual important operations are these conditional distributions so x1 well you need a distribution on it it's this latent variable that's going to be your a is going to be a prior on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.518,
    "end": 791.083,
    "text": " on x1 and then you you need a distribution for b that gives you x4 based on x1 x2 you need distribution c that takes uh gives x5 given x4 x2 x3 and so on and then here you also need this important operation that does copying right so here the variable x2 will be used um in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.063,
    "end": 795.248,
    "text": " in the conditional distribution for X4 and for X5.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.789,
    "end": 800.494,
    "text": "So you feed it to B and you feed it to C. So you need to copy it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.514,
    "end": 805.52,
    "text": "You need to broadcast this, whatever input you feed in here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.86,
    "end": 820.277,
    "text": "And so if you take a distribution that's non-trivial, well, this will create some correlation between those distributions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.257,
    "end": 826.329,
    "text": " And so at the end, what you get are the observed variables, which are these outputs of your diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.271,
    "end": 838.654,
    "text": "And so you get this mechanical translation where every probabilistic model can be faithfully encoded as such a string diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 838.955,
    "end": 841.159,
    "text": " The wires are the random variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.621,
    "end": 848.19,
    "text": "I guess the sort of here is like the wires up to this copying, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.23,
    "end": 851.415,
    "text": "So here the variable X2 appears twice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.516,
    "end": 855.041,
    "text": "So you need to split the wire in some formal sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.724,
    "end": 860.611,
    "text": "The boxes are conditional probability distributions that define your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.552,
    "end": 865.198,
    "text": "And the diagrams are the generative models themselves, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.579,
    "end": 869.963,
    "text": " So here's what the same code would look like in this code pipe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.384,
    "end": 886.225,
    "text": "Again, you're going to instantiate a bunch of types for X1 to X5, and then you're going to have these boxes, ABC, and you can define your model as a Python function that takes a bunch of variables and just does the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.205,
    "end": 887.247,
    "text": " usual thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.407,
    "end": 895.403,
    "text": "And I guess the magic of these Python decorators is that your function here is not going to be interpreted as an actual function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.604,
    "end": 897.888,
    "text": "It's going to be executed sort of symbolically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.089,
    "end": 903.319,
    "text": "And these variables x2 and x3 are going to be turned into the input wire of your diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.299,
    "end": 908.208,
    "text": " And then these x5, x3 will be the output wires of your diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.708,
    "end": 920.749,
    "text": "And so, in a sense, what this code pi gives you is a sort of domain-specific language where you can write any such generative model, and you will get a data structure for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.87,
    "end": 927.501,
    "text": "So I guess today I won't have much time to get into the data structure underlying these, but I guess there's sort of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.481,
    "end": 945.869,
    "text": " Two main ways of understanding these diagrams is the first one is as a sort of sequence of layers where each layer of your diagram is like, for example, this first layer, you've got a box A in parallel with copying, in parallel with another copying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.27,
    "end": 954.923,
    "text": "The second layer would be B in parallel with a bunch of identities, and the last layer would be C. So this sort of list-like representation is very convenient for drawing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.903,
    "end": 965.513,
    "text": " And I guess if we go back to our cooking example, this is why you get to see these sort of stacking of boxes is essentially it's more convenient to have one box at each layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.553,
    "end": 969.925,
    "text": "So you just get a list of these guys, a list of operations that you perform.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.905,
    "end": 976.957,
    "text": " And then there's sort of the graph-like representation, which is the more natural one when you think of a graphical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.977,
    "end": 979.281,
    "text": "They're called graphical because it's a graph, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.402,
    "end": 985.613,
    "text": "So I guess DiscoPy gives you this ability of going back and forth between graph-like and sort of list-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.394,
    "end": 989.82,
    "text": "And the list-like operation is also how you define",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.8,
    "end": 992.025,
    "text": " the evaluation of these diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.045,
    "end": 994.531,
    "text": "So we'll get to see that in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.772,
    "end": 1000.485,
    "text": "These diagrams, you can draw them, you can store them as combinatorial representations of graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.929,
    "end": 1007.843,
    "text": "And I guess the main point is you can evaluate them and you can do experiments with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.768,
    "end": 1009.549,
    "text": " Let's get to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.69,
    "end": 1016.556,
    "text": "I guess the theory we need behind this is that of strict monoidal categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.637,
    "end": 1023.184,
    "text": "So I just say category for sure, because I guess they'll all be strict and monoidal in this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.384,
    "end": 1036.378,
    "text": "And essentially, once you know what a signature is, so this set of wires and boxes with domain, codomain, you can define a category as a signature with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.358,
    "end": 1066.315,
    "text": " a way of evaluating diagrams essentially so a way of taking a composition of boxes and wires to give a single box so first you need a way of interpreting identity uh for each object you need a way of interpreting uh composition and you need a way a sequential and parallel composition right so now essentially a category will be a concrete way of interpreting these diagrams and i guess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.801,
    "end": 1095.88,
    "text": " the the key sort of structural theorem for well okay let's first look at some uh some examples um so i guess the main example we've seen so far of a category is the category of wires and diagrams where the objects are these these wires the lists of inputs or outputs and the diagrams are this composition of boxes that you can represent combinatorially as graphs and then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.467,
    "end": 1108.422,
    "text": " I guess the most natural interpretation of these, if you come from some sort of mathematical background, would be to think of sets and functions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.502,
    "end": 1114.07,
    "text": "So every box will be a function of its input wires into its output wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.73,
    "end": 1120.618,
    "text": "So you think of Cartesian products, you get multiple inputs and you get multiple outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.987,
    "end": 1124.791,
    "text": " I guess sets and relations are super interesting too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.293,
    "end": 1133.541,
    "text": "So I guess in that case, you can do a lot fancier diagrams if you think of relations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.561,
    "end": 1138.706,
    "text": "So you don't have inputs and outputs anymore, but you can essentially think of them going both ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.988,
    "end": 1145.914,
    "text": "Then I guess, yeah, the main example of these monoidal categories was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.894,
    "end": 1155.248,
    "text": " to do linear algebra, to sort of formalize things that physicists were already doing, drawing diagrams, linear maps as diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.408,
    "end": 1157.21,
    "text": "So I guess that's the main example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.691,
    "end": 1165.202,
    "text": "And in our case, what we're interested in will be more something like the category of measurable spaces and stochastic maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.422,
    "end": 1171.311,
    "text": "So we'll think of each wire as a measurable space with the product space being the tensor,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.291,
    "end": 1173.934,
    "text": " the operation that puts wires side by side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.315,
    "end": 1183.807,
    "text": "And then a box will be essentially a stochastic map that takes a product space and gives you a new product space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.247,
    "end": 1198.665,
    "text": "And so I guess with this interpretation in mind, essentially a graphical model, a generative model is precisely a diagram with an interpretation in stock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.645,
    "end": 1207.836,
    "text": " I guess, yeah, then the main way to formalize this idea is essentially to define what's called a functor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.837,
    "end": 1219.59,
    "text": "It's going to be a morphism of categories, so something that translates a signature into another and also preserves identity, composition, and tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.958,
    "end": 1227.048,
    "text": " And then you have this sort of main theorem that tells you that diagrams are the free monoidal category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.188,
    "end": 1239.925,
    "text": "So what this means intuitively is that if you want to define a functor from the category of diagrams, the only thing you need to do is to define an interpretation for each wire and an interpretation for each box.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.905,
    "end": 1260.268,
    "text": " So on the left hand side, you've got all the functors from C Sigma to D. And here you've got all these much smaller objects where essentially you just need measurable space for each of the wires and a stochastic map for each of the boxes and or conditional probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.749,
    "end": 1265.674,
    "text": "And now you get an interpretation for each composition of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.635,
    "end": 1268.157,
    "text": "So that's sort of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.626,
    "end": 1282.223,
    "text": " the structural theorem, the sort of foundational theorem that justifies why are string diagrams the right data structure when you're looking at composition in sequence and in parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.044,
    "end": 1287.23,
    "text": "Any such composition is a diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.533,
    "end": 1291.275,
    "text": "And so I guess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.542,
    "end": 1321.279,
    "text": " with that theorem in mind like on the right hand side you've got something that you can represent as a small data structure that uh that there is uh you just need uh the representation for a stochastic map for each of the boxes in your diagram and on the left hand side you've got the sort of algorithm that's going to take these diagrams and compute their their meaning by plugging these distributions together and essentially performing inference so on on the right hand side you've got",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.799,
    "end": 1326.149,
    "text": " You've got something that is sort of data-like on the left-hand side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.189,
    "end": 1333.345,
    "text": "You've got the algorithm that's going to compute that data to give you inference algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.898,
    "end": 1356.565,
    "text": " and i guess yeah i was um promising some some short um detour into uh quantum uh natural language processing so i guess here it's just a small code snippet to um show i guess how concise you can make a particular model if you write it as a functor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.545,
    "end": 1360.393,
    "text": " So here we've got boxes are worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.413,
    "end": 1364.04,
    "text": "So we've got a box for Alice, a box for love and a box for Bob.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.661,
    "end": 1368.73,
    "text": "We're going to compose them together according to their grammatical structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.79,
    "end": 1376.325,
    "text": "So here the word Alice is connected to love via this cup and the word Bob is connected to love via that cup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.592,
    "end": 1378.795,
    "text": " And overall, you get a sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.875,
    "end": 1381.88,
    "text": "So that's the natural language side of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.96,
    "end": 1387.929,
    "text": "And then you get the quantum side of things by saying, look, every noun, I'm just going to interpret it as a qubit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.209,
    "end": 1396.041,
    "text": "So as a quantum system that I can control, the noun Alice is going to be one state of the qubit, the state zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.281,
    "end": 1398.685,
    "text": "The word Bob is going to be the state one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.665,
    "end": 1422.293,
    "text": " and now the world loves is going to be where interesting stuff happens where i'm going to entangle or correlate my inputs in my output my subject in my object and so here you represent it as a quantum circuit that's going to be some some hard amount gate and some control gate so essentially a bunch of quantum gates represented as boxes that you compose in sequence and in parallel so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.273,
    "end": 1440.518,
    "text": " I won't get into much quantum theory here, but I guess the main punchline is that you can replace quantum by probabilistic circuits, and the same theory applies in a sense that you get this compositional way of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.987,
    "end": 1446.454,
    "text": " interpreting, well, natural language, but interpreting any sort of compositional system in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.474,
    "end": 1460.093,
    "text": "So here you take your sentence, you apply the functor to it, you will get a circuit, a quantum circuit, and then essentially this eval is going to be a second step of the functor that's going to take your quantum circuit and turn it into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.073,
    "end": 1481.676,
    "text": " a bunch of matrices so it's going to turn it into vector spaces and linear maps and compute the meaning of that circuit compute the meaning of that sentence right so i guess that's one qnlp experiment in um in a few lines of python and i guess yeah the argument for this talk would be that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.656,
    "end": 1496.813,
    "text": " we can replace quantum with active inference here and get a very similar recipe for how to build larger active inference systems from smaller ones in the interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.653,
    "end": 1502.505,
    "text": " So yeah, I guess that was my thesis, three years of PhD thesis in one slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.107,
    "end": 1504.851,
    "text": "So let's move on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.693,
    "end": 1513.232,
    "text": "Yeah, I guess I'll try and give some of the sort of necessary theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.567,
    "end": 1521.036,
    "text": " to look at active inference formally, but give it all in terms of diagrams rather than complicated formulae.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.056,
    "end": 1533.39,
    "text": "So now that you've seen a bunch of diagrams, you've noticed that if you only have tensor in parallel and in sequence, you can only do planar diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.991,
    "end": 1538.696,
    "text": "If you want arbitrary diagrams, you need this special swap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.136,
    "end": 1543.101,
    "text": "And the swap is going to just satisfy these four axioms you see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1543.081,
    "end": 1545.648,
    "text": " If you swap with nothing, it doesn't do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.149,
    "end": 1548.475,
    "text": "If you swap and swap back, it doesn't do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.177,
    "end": 1554.17,
    "text": "If you swap F and G, it's the same as doing G and F and then swap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.052,
    "end": 1559.925,
    "text": "And finally, you can decompose a complex swap in terms of basic swaps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.158,
    "end": 1586.335,
    "text": " so that's all you need to get a symmetric monohedral category and essentially in the symmetric category you don't care about the order of wires because you can permute them so in the case of probability theory you don't care about the order of your probabilistic model you can permute the variables what matters is what's connected to what via boxes not the order of the inputs and the outputs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.315,
    "end": 1591.567,
    "text": " And yeah, I guess in natural language, you do care about the order of worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.587,
    "end": 1593.531,
    "text": "So in that case, you're not symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.313,
    "end": 1601.108,
    "text": "But another kind of category, once you have symmetric, is the idea of a compact category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.208,
    "end": 1604.796,
    "text": "And that's where you have the ability of bending wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.147,
    "end": 1610.02,
    "text": " I guess in a normal string diagram, the wires are going to flow from the inputs to the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.123,
    "end": 1613.61,
    "text": "In a compact diagram, you can flow backward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.991,
    "end": 1620.388,
    "text": "And in the first paper, applying category theory to Bayesian inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.368,
    "end": 1628.077,
    "text": " That was the technical apparatus to formalize the idea of Bayesian inversing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.298,
    "end": 1640.993,
    "text": "So I guess with these cups and caps, you can take a joint distribution on A times B and bend one of the legs to get a stochastic map from A to B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.973,
    "end": 1650.742,
    "text": " And similarly, if you have a stochastic map, you can bend the output and get a joint distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.703,
    "end": 1667.638,
    "text": "And now if you have a stochastic map from A to B and you have a prior on A, so I guess that's the little trick that they had to hide is this little black box on the cup here, then you can invert.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.618,
    "end": 1685.087,
    "text": " you can perform Bayesian inversion and you will get a stochastic map from D to A. And I guess there are many ways of formulating this caveat of you need a prior if you want to be able to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.32,
    "end": 1686.543,
    "text": " Bayesian inversion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.044,
    "end": 1697.667,
    "text": "And yeah, I guess I won't get too much into the literature of how you formalize categories of stochastic processes, a very big topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.727,
    "end": 1699.431,
    "text": "But in that context,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.732,
    "end": 1706.326,
    "text": " having a compact category means essentially every object, every wire comes with a prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.888,
    "end": 1710.295,
    "text": "And now when you invert, you use that prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.259,
    "end": 1718.533,
    "text": "So yeah, I guess in quantum, it's got a very different interpretation where these wires are going to represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.513,
    "end": 1722.018,
    "text": " Bell states, entangled states, and entangled measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.599,
    "end": 1725.442,
    "text": "And then this equation amounts to teleportation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.763,
    "end": 1736.978,
    "text": "In the context of Bayesian probability, this equation is just the Bayesian inversion of a trivial probabilistic channel is itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.178,
    "end": 1739.081,
    "text": "So I guess not very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.121,
    "end": 1741.845,
    "text": "In quantum, it's like, wow, we can teleport things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.925,
    "end": 1747.913,
    "text": "In Bayesian, it's just the inverse of the identity is the identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.893,
    "end": 1750.418,
    "text": " So that's a compact category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.22,
    "end": 1752.483,
    "text": "You can bend things around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.523,
    "end": 1763.826,
    "text": "So if you have symmetric plus compact, you can truly talk about a graph structure for your diagrams because you can connect any input to any output in a graph-like way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.806,
    "end": 1774.861,
    "text": " So now I guess an important ingredient we've seen for defining a generative model is the ability to use the same variable in multiple places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.622,
    "end": 1779.067,
    "text": "So that's formalized in terms of these co-monoids.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.167,
    "end": 1784.494,
    "text": "So you have an operation that splits a wire and it's co-commutative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.514,
    "end": 1789.341,
    "text": "So if you split and then you swap, it's the same thing as just splitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.321,
    "end": 1798.237,
    "text": " It's got a unit which is discarding, so if you split and then if you copy something and then you discard, or if you split and then you terminate the wire, you haven't done anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.278,
    "end": 1806.132,
    "text": "And it's co-associative, so it doesn't matter if you copy the left-hand copy or the right-hand copy, you get three identical copies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1806.112,
    "end": 1812.02,
    "text": " And yeah, I guess the main two axioms for being a Cartesian category are these two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.181,
    "end": 1817.228,
    "text": "So the second one, I guess you can call normalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.348,
    "end": 1832.71,
    "text": "So essentially in terms of stochastic maps, what this means is that if you apply a stochastic map and then take the weight of the results, take the mass of the results for any distribution coming in here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.69,
    "end": 1835.274,
    "text": " it's the same as the mass of the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.395,
    "end": 1845.208,
    "text": "So essentially, it takes a normalized distribution to a normalized distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.628,
    "end": 1849.253,
    "text": "And so on the left-hand side, it's more controversial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.313,
    "end": 1852.177,
    "text": "It's not going to be true in the category of stochastic maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.119,
    "end": 1854.921,
    "text": "This says that f is deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.981,
    "end": 1861.971,
    "text": "So if you perform f and then copy the result, it's the same as copying the inputs and performing f twice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.951,
    "end": 1882.441,
    "text": " And I guess if you take the special case where F has no input, this means that essentially F can be copied, means that it's deterministic in a sense that performing F, if F was a toss coin, you would take F through a coin and then copy the results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.483,
    "end": 1889.832,
    "text": "You would get a different result as if you toss two coins, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.812,
    "end": 1897.919,
    "text": " The second one is going to hold in terms of Bayesian probability theory if you have normalized processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.56,
    "end": 1901.782,
    "text": "And it's this idea of essentially you can also formalize it as causality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.822,
    "end": 1905.446,
    "text": "So if you discard the output, it cannot influence the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.446,
    "end": 1914.013,
    "text": "And yeah, the first one is essentially what brings you back to the world of deterministic processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.133,
    "end": 1919.818,
    "text": "So it's a good way of characterizing which stochastic map is in fact a deterministic one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.798,
    "end": 1927.112,
    "text": " And so if you have these two axioms, you're called the Cartesian category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.773,
    "end": 1931.32,
    "text": "If you don't have them, you're called the copy-discard category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.36,
    "end": 1939.495,
    "text": "And so I guess in our context, we are really interested in copy-discard categories where these two are different processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.475,
    "end": 1953.441,
    "text": " And yeah, I guess what can you prove at this abstract level of generality is a really nice no-cloning theorem where you don't need to assume any complex numbers or any quantum stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.461,
    "end": 1957.348,
    "text": "And in fact, it holds as well in the context of probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.328,
    "end": 1962.402,
    "text": " and I think it's called the no broadcasting theorem in that case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.525,
    "end": 1969.181,
    "text": "But the idea is that you cannot have both cups and cats and copying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.281,
    "end": 1972.35,
    "text": "So here, I guess you assume that you have cups,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.33,
    "end": 1978.499,
    "text": " And then because you have copying, then the copy of a cup is also going to be two cups, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.721,
    "end": 1987.913,
    "text": "But you can also do some shenanigans where you bend the wires because copying is co-commutative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.333,
    "end": 1992.8,
    "text": "So on one side, you're going to swap the wires.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.84,
    "end": 2001.392,
    "text": "And now you've essentially proved that two cups like this side by side are actually equal to two cups nested inside out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.372,
    "end": 2011.063,
    "text": " you bend all the legs and you get that a swap is equal to the identity, which is basically, yeah, it means you've done something wrong, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.084,
    "end": 2018.452,
    "text": "Like if you can't even distinguish swapping stuff from not doing anything, your category is very much trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.472,
    "end": 2030.046,
    "text": "So I guess that's the main, the no cloning theorem is that if you're both compact, so you have cups and caps and copying, now you have to be a trivial category in the sense that everything is a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.026,
    "end": 2032.428,
    "text": " essentially a scalar multiple of the identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.049,
    "end": 2037.133,
    "text": "So that's not the case in probability theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.173,
    "end": 2048.464,
    "text": "So probability theory also has this no-cloning feature, and that's essentially, well, you can't copy something if it's a non-trivial distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.524,
    "end": 2052.789,
    "text": "You can't copy a correlated state, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.77,
    "end": 2057.113,
    "text": "The same way you can't copy an entangled state in quantum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.093,
    "end": 2085.801,
    "text": " um so yeah um i guess um the last ingredient we need in order to talk about active inference is the idea of normalization um and a in the context of string diagrams that's going to be represented as i was saying it by hierarchical diagrams where you have a sub diagram that's uh inducted lines will just represent the normalization of it with some caveat if there's no support for the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.781,
    "end": 2087.104,
    "text": " for the particular state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.144,
    "end": 2097.345,
    "text": "So here you have a stochastic map from X to Y and you put it inside of a dotted line and you get its normalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.365,
    "end": 2100.471,
    "text": "So I guess to get inside is not really a stochastic map anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.551,
    "end": 2101.393,
    "text": "It's more of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.373,
    "end": 2108.242,
    "text": " just any measurable function, not necessarily normalized, and the thing outside becomes a proper stochastic map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.783,
    "end": 2120.739,
    "text": "And that means for any measurable function, you can decompose it in terms of something that's normalized and then something that you discount.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.799,
    "end": 2127.027,
    "text": "So these three lines are the discounting operation that we drew as a white dot before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2127.007,
    "end": 2137.921,
    "text": " So essentially, here, that equation tells you that every measurable function is going to be a normalized one up to some renormalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.981,
    "end": 2139.363,
    "text": "So I guess it's sort of intuitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.744,
    "end": 2144.69,
    "text": "And also, normalization behaves nicely with respect to parallel composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.75,
    "end": 2152.12,
    "text": "So if you have f and g, and then parallel, you normalize them, you get the normalization of f times the normalization of g.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.538,
    "end": 2158.964,
    "text": " It behaves well with respect to copying a particular variable of your generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.146,
    "end": 2163.589,
    "text": "But the thing it doesn't behave well with is the composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.669,
    "end": 2169.415,
    "text": "So it's not true that the normalization of composition is the composition of normalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.495,
    "end": 2179.525,
    "text": "And that's essentially what gives you the difference between a Jeffrey update and a Perl update in the context of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.648,
    "end": 2188.333,
    "text": " So on the left hand side, you've got a Jeffrey update where you first normalize and then pre-compose with the prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.427,
    "end": 2196.275,
    "text": " On the right-hand side, you've got your Perl update, where you do first the precomposition with the prior, and then you normalize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.315,
    "end": 2204.865,
    "text": "And so I guess here on the left, if you want to obtain something normalized overall, you will need to renormalize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.885,
    "end": 2206.868,
    "text": "So you get two normalizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.128,
    "end": 2208.71,
    "text": "On the right-hand side, you only get one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.511,
    "end": 2211.173,
    "text": "And that's the difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.473,
    "end": 2215.658,
    "text": "That's the fact that normalization is not a functor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.678,
    "end": 2218.962,
    "text": "In a sense, it doesn't commute with the composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.106,
    "end": 2225.832,
    "text": " So then another kind of bubble we'll need is taking the logarithm of a function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.813,
    "end": 2234.202,
    "text": "So if we have a function from x to the reals, positive reals, we can take its logarithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.682,
    "end": 2248.037,
    "text": "This function is just going to be, if we think of the category of measurable functions, well, the empty diagram is going to correspond to the real numbers, to the one-dimensional space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.017,
    "end": 2257.998,
    "text": " And so such a function will just be a box, an effect, which takes something and gives you just a renormalization factor, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.479,
    "end": 2263.95,
    "text": "And now if you have such an effect, you can put it into a green box and you'll get the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.93,
    "end": 2265.492,
    "text": " the negative log of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.373,
    "end": 2270.016,
    "text": "So that's sort of a mere sort of notational gadget.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.577,
    "end": 2288.976,
    "text": "And essentially, yeah, it only becomes interesting if you start using it inside a more complex diagram where this green box will not commute past the composition and will give some interesting hierarchical structure to your diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.412,
    "end": 2296.481,
    "text": " And I guess here I'm just copying some caveats from the Tor et al paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.002,
    "end": 2309.118,
    "text": "And yeah, I guess they give some pointers to some interesting category theory that could be formalized to explore these log boxes further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.138,
    "end": 2315.807,
    "text": "But in our context, what we need them to is essentially, yeah, we just want the nice properties of logarithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.787,
    "end": 2331.687,
    "text": " If this copying operator acts like essentially a product, then we want that the log of a product is the sum of the logs, so you get this nice operation, nice homomorphism property of the log.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.667,
    "end": 2338.443,
    "text": " The discarding operator acts like the unit of this multiplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.623,
    "end": 2341.57,
    "text": "So the log of the units will be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.114,
    "end": 2350.03,
    "text": "And then you get this nice product rule, this sort of Leibniz rule for the logarithm of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.01,
    "end": 2355.917,
    "text": " of a tensor product in that sense will be the sum of two tensor products.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.937,
    "end": 2376.22,
    "text": "So that's also the kind of equation you'll find in an automatic differentiation framework where the gradient of D tensor E is going to be the gradient of D plus the gradient of E. And finally, if X is deterministic, so that's what they call sharp states, then it also commutes past the log.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.841,
    "end": 2387.425,
    "text": " So you get this nice property of the logarithm, which allows to take a diagram with these green boxes and sort of massage them into a sum of diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.966,
    "end": 2396.385,
    "text": "And finally, you can define this notion of open vibrational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.365,
    "end": 2413.547,
    "text": " instead of looking at the free energy of a closed model, so something that wouldn't have an input i here, so just a joint distribution of internal states and observed variables, you have this idea of an open model, so you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.527,
    "end": 2433.696,
    "text": " some of the inputs that you can control and now you can define the free energy of this model with respect to joint distribution on the inputs with respect to the and the internal state and a prior on the observed variables and here's the formula.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.756,
    "end": 2441.728,
    "text": "So I guess that was sort of the main point of the paper was to build all this categorical apparatus to get to the point where you can just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.708,
    "end": 2463.278,
    "text": " draw the definition of free energy as diagram and then the main theorem being that essentially this gives you a compositional definition in the sense that the free energy for composition so it's the tensor composition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.663,
    "end": 2469.911,
    "text": " the free energy of the tensor will be some composition of the individual thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.931,
    "end": 2472.714,
    "text": "So I guess in the case of tensor is the simplest case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.255,
    "end": 2483.948,
    "text": "I won't show the case for sequential composition where you need to take a more complicated operation to compose the subsystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.029,
    "end": 2488.354,
    "text": "But I guess that's sort of the main theorem of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.925,
    "end": 2500.759,
    "text": " categorical active inference framework is that you get this idea that the free energy for the whole is composition of the free energy of its parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.1,
    "end": 2513.835,
    "text": "And essentially, monoidal category theory gives you the high-level layer of abstraction to describe these sorts of compositional phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.815,
    "end": 2523.37,
    "text": " And yeah, I guess with this sort of foundational theory, you want to turn it into application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.85,
    "end": 2527.215,
    "text": "And so I guess that's what this copier was built for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.255,
    "end": 2531.622,
    "text": "So what we already have to support this sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.602,
    "end": 2535.189,
    "text": " of active inference implementation in terms of diagrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.69,
    "end": 2553.222,
    "text": "Well, we have most of the finite dimensional case implemented already in the sense that if your random variable span is a categorical distribution, then you can turn this Bayesian inference problem into a tensor network contraction problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.202,
    "end": 2563.891,
    "text": " We have a bunch of automatic and diagrammatic differentiation algorithms implemented with some compilation with the JAX library.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.971,
    "end": 2569.676,
    "text": "So essentially, you can take your diagram and compile it into a bunch of GPU code for very fast execution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.057,
    "end": 2583.208,
    "text": "And finally, the sort of more experimental, more speculative part of the library is this idea of the geometry of interaction, where you formalize bidirectional processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.188,
    "end": 2587.612,
    "text": " So sadly, I won't have much time to get into that side of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.632,
    "end": 2597.241,
    "text": "But there's this very interesting idea of a Bayesian lens where you have these bidirectional operations that also have some stochastic side to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.281,
    "end": 2606.43,
    "text": "So essentially, you can talk about updates, about the forward part of your process being some inference and the backward part being some update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.75,
    "end": 2611.795,
    "text": "And this geometry of interaction will give you a way of composing these updates together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.163,
    "end": 2615.511,
    "text": " in a compositional structure of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.551,
    "end": 2623.128,
    "text": "So we already have the sort of purely abstract implementation of this geometry of interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.148,
    "end": 2625.634,
    "text": "What's missing is sort of plugging these two things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.674,
    "end": 2627.438,
    "text": "So just looking at how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.418,
    "end": 2643.03,
    "text": " If you take finite dimensional as a first step and you look at how it updates, you should be able to implement it in a purely compositional way with DiscoPy and also be able to draw the results in the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.01,
    "end": 2665.744,
    "text": " And I guess what's missing would be a more continuous implementation where I guess to go beyond finite dimensional, you need some sort of more involved implementation based on monads, I guess is a very well-developed theory on the category side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.724,
    "end": 2675.938,
    "text": " And there's one thing we've started working on, which is this idea of delayed interaction, where essentially you can represent discrete time processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.038,
    "end": 2680.063,
    "text": "So a very natural way of talking about time series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.544,
    "end": 2691.158,
    "text": "And yeah, I guess the main ingredient that's missing to develop this library further would be having experimentalists ready to take the challenge to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.138,
    "end": 2701.897,
    "text": " build their experiments in a way that you can compose them with other experiments in the future and build it upon a theory of how to compose processes together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.997,
    "end": 2713.618,
    "text": "So I guess that was sort of the main objective of this compile was to sort of lower the entry to the cost of entry to understanding string diagrams so that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.598,
    "end": 2726.937,
    "text": " any experimentalist from quantum computing or active inference can pick up just enough abstract mathematics to turn these experiments into something you can compose together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.957,
    "end": 2738.293,
    "text": "And yeah, I guess I'd be happy to get some questions from the audience and looking forward to more interactions with the active inference community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.794,
    "end": 2740.416,
    "text": "Thanks for the, thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.763,
    "end": 2742.244,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.086,
    "end": 2743.647,
    "text": "Great talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.589,
    "end": 2744.909,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.731,
    "end": 2748.216,
    "text": "Anyone watching live can write a question in a live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.396,
    "end": 2749.919,
    "text": "And I wrote down some questions as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.64,
    "end": 2755.911,
    "text": "First though, just to kind of pull back, like, how did you get into writing Disco Pie?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.011,
    "end": 2760.7,
    "text": "What brought you to wanting to build this toolkit and what made you interested in the area?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.709,
    "end": 2779.161,
    "text": " yeah i mean so i guess it started with the the master's thesis in oxford was um mostly quantum stuff uh with the course that bob cook was teaching there and um i was interested in ai already and uh nap in particular at the time and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.141,
    "end": 2800.677,
    "text": " i guess um yeah there was this program of bridging the two together and making uh quantum nlp uh and so i i got involved in that and when it came to implementing it it felt like it would be a shame to implement uh quantum nlp uh as a as a one-shot thing where you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.657,
    "end": 2802.84,
    "text": " build your experiment and throw it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.9,
    "end": 2818.142,
    "text": "And I guess we took it as an excuse to develop something that we thought was much more broadly applicable, where you take this general theory of monohedral categories and implement that and use QNLP as a sort of proof of concept that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.122,
    "end": 2824.591,
    "text": " it can do something useful and then hope that other people will start formalizing more stuff as monoidal categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.691,
    "end": 2840.033,
    "text": "So I guess this paper from Thao et al came after the thesis and I guess they took active inference as something that you could formalize with diagrams too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.133,
    "end": 2842.797,
    "text": "So yeah, I guess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2842.777,
    "end": 2855.908,
    "text": " qnlp was a bit of an excuse to get into some very cool maths and to develop some some cool software to back it up and now i'm sort of yeah looking forward to seeing other ways to apply this software",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.496,
    "end": 2860.9,
    "text": " Awesome, okay, I'm gonna read and answer one question from the live chat, and then I'll ask you a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.241,
    "end": 2869.029,
    "text": "So Divital wrote, is this under a specific group project at Active Inference Institute like Ontology or other project?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.469,
    "end": 2873.633,
    "text": "So just to briefly address that, it could be super relevant for Ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.914,
    "end": 2881.782,
    "text": "We could use the Active Inference Ontology to extract natural language descriptions of generative models, for example, represent them in DiscoPy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.842,
    "end": 2885.946,
    "text": "So it could be a tool used in Ontology project,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.926,
    "end": 2906.179,
    "text": " or it could be spun up as a category theory project as we've done in the past when we for example focused on some of toby uh st claire smith's work so everyone's welcome to uh get involved and reactivate projects as they are excited by this is definitely something exciting so let me ask you this question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.648,
    "end": 2930.395,
    "text": " how do we connect the properties of diagrams for example the ability to swap capture causality in the era of time cups and caps and all that with the features of cognitive systems which we're interested in like how do we know which kinds of formal constraints are overkill non-sequitur how do we really like reconcile and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.202,
    "end": 2941.533,
    "text": " build with the right formal systems when we're dealing with embodied cognitive systems that don't on a first pass have those kinds of constraints?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.295,
    "end": 2946.419,
    "text": "Yeah, I think that's a super interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.479,
    "end": 2954.588,
    "text": "And in a sense, like not being an expert in active inference, I don't feel entitled to really say what are the properties that you guys are interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.688,
    "end": 2961.175,
    "text": "But I guess as a sort of parallel to other ways diagrams have been applied in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.155,
    "end": 2982.555,
    "text": " particularly in quantum, I felt like one interesting way to look at diagrams is to look at them in terms of combinatorial structures that have some structural properties that you can exploit to turn the computational problems associated with them into tractable problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.535,
    "end": 3009.437,
    "text": " and maybe as a as a bet i would say that characterizing which models are efficiently simulable uh simulatable or not it's sort of a key question that you ask yourself when you you get to build a model of of cognition in general in a sense that if you cannot simulate it if you cannot um build an efficient implementation for it then it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.417,
    "end": 3012.621,
    "text": " likely that the brain isn't going to be working that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.641,
    "end": 3016.886,
    "text": "In a sense, the brain is efficiently solving this cognition problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.926,
    "end": 3022.933,
    "text": "So behind it, there must be some sort of tractable algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.093,
    "end": 3031.843,
    "text": "And I guess there's a way of characterizing which problems will be tractable by the shape of the diagrams associated with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.943,
    "end": 3039.272,
    "text": "So one particular way this happens is when you look at tensor networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.252,
    "end": 3064.585,
    "text": " if you can bound the width of your diagram and make it look like it's almost a tree, and you have this idea of bounded tree width where you can show that your network has some sort of hierarchical structure to it where it's shaped in terms of a main route that splits into branches, even if these branches are thick in a sense, it's not necessarily a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.565,
    "end": 3072.015,
    "text": " then this bounded tree width will give you a bound on how hard it will be to compute this tensor network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.076,
    "end": 3083.772,
    "text": "So in a sense, from the sort of graph structure of your diagram, from the fact that this graph has a nice decomposition, you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.752,
    "end": 3095.445,
    "text": " exploit that fact and turn it into an efficient algorithm to solve inference on that model to contract the tensor network in the case of physicists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.545,
    "end": 3108.139,
    "text": "But I think this general principle applies in a very broad range of cases and there's some like very deep intersections with complexity theory where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.119,
    "end": 3115.77,
    "text": " I guess this P and NP question is all about like, how do you separate between things that you can solve efficiently or not, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.83,
    "end": 3128.608,
    "text": "So diagrams gives you an interesting way of looking at this P versus NP question where the, yeah, I guess you can try and tell about these two classes by looking at the shape of diagrams that represent these problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.867,
    "end": 3154.208,
    "text": " awesome okay so what makes the variational free energy open or not open and then some more vfe related questions how did you connect that to the log properties since of course the free energy is used as a bound on log probabilities as surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.188,
    "end": 3179.807,
    "text": " and then what does it mean that the vfe is compositional since from a numerical perspective the compositionality is kind of trivial like of course i could calculate the free energy for two different situations and just add those numbers together so what do we really get with the semantics of composition that go beyond just calculating two numbers and then adding those two numbers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.952,
    "end": 3197.357,
    "text": " Yeah, so I guess to go back to that definition of open free energy, I guess the main difference here compared to the standard definition is this extra wire I, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.337,
    "end": 3206.633,
    "text": " The idea is that if this wire is empty, if there's no particular input, you get back to the usual definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3207.114,
    "end": 3217.692,
    "text": "And it's the idea of instead of trying to compute the free energy of a big monolithic system that represents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.672,
    "end": 3239.022,
    "text": " your the overall thing you want to study you first decompose that into a composition of different things being independent and being composed in sequence so that's where you get the the correlation and this decomposition of your problem will give you a formula to compute the the composition of the the corresponding free energies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.002,
    "end": 3243.251,
    "text": " And I guess this example wasn't necessarily the best one to pick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.311,
    "end": 3250.247,
    "text": "So it's the fact that it's compositional with respect to independent parallel composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.307,
    "end": 3255.458,
    "text": "Well, I guess it's a bit of a trivial property of free energy that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.438,
    "end": 3279.623,
    "text": " um the free energy of the tensor of two things will be the sum of the free energies um and i guess um i yeah um i should have included the more interesting case where you have a sequential composition of things and where this um sequential composition gives you a non-trigger way of decomposing the formula for your free energy so i guess that would be the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.603,
    "end": 3288.107,
    "text": " the place where you can get some traction in a particular experiment where essentially you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.749,
    "end": 3294.625,
    "text": "Yeah, I guess the same way that an automatic differentiation framework would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.605,
    "end": 3298.691,
    "text": " would use the structure of your program to compute the structure of its derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.132,
    "end": 3312.293,
    "text": "Well, here you could have, I guess, automatic free energy idea of the structure of your model informs the structure of the formula for its free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.273,
    "end": 3317.621,
    "text": " and potentially implying some algorithmic speed up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3317.641,
    "end": 3327.958,
    "text": "So I guess here, obviously there isn't any speed up to be found in this particular instance of compositionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.158,
    "end": 3332.104,
    "text": "And yeah, I guess I'm...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.084,
    "end": 3343.32,
    "text": " Yeah, I don't feel qualified enough to advance any conjecture on how the non-trivial case would give you algorithmic speedups, but I guess that's the sort of promise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.34,
    "end": 3344.882,
    "text": "And there's the idea of a speedup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.902,
    "end": 3357.18,
    "text": "There's also the idea of having software that's more modular, so having software for one experiment that you can potentially reuse to compose with a later experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.717,
    "end": 3370.933,
    "text": " yeah like where that kind of lands for me is we can use these nested box structures to reflect the articulations of different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.128,
    "end": 3401.123,
    "text": " causal and spatial and temporal systems in sequence and parallel and also proposed cognitive mechanisms so not necessarily related to the material connections on substrate but related to different kinds of interactions amongst like attention memory all these kinds of cognitive features so first there's the benefit of the interpretability legibility modularity reuse angle and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.103,
    "end": 3430.468,
    "text": " getting to that speed up if it's possible to have strong decomposition composition type rules large boxes with a lot of stuff in them whether that's 100 nest mates in a multi-agent simulation or 100 different cognitive systems in a complex single agent simulation those can be brought down to their most atomic computational rules and possibly certain kinds of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.174,
    "end": 3456.355,
    "text": " calculations will have certain methods that would be like the most effective for this kind of distribution or for this size so that gives a unified way to look at the topology of information flows and calculations in a notational disco pi framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.335,
    "end": 3473.599,
    "text": " rather than those connections being kind of semi-implicit in the control flow of a Python script or maybe scattered across different files with different functions calling each other, not necessarily in a unified way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.959,
    "end": 3475.862,
    "text": "For example, a common approach is like to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.842,
    "end": 3492.265,
    "text": " have an agent class and then have them be communicating back and forth with an environment and that could still be really well structured but it leads to kind of a fundamental division between what's happening within the agent and within the environment and that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.527,
    "end": 3514.59,
    "text": " understandable and a useful design pattern however the stronger direction to kind of steer towards would be unifying systems for notation possibly like disco pi that could get us like the best of both worlds with well-structured interfaces and unification across really different representations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.448,
    "end": 3537.996,
    "text": " Yeah, I think also one important aspect is this idea of separation of concern between syntax and semantics, where you want the ability to describe your models in a syntactic way that will be reused in different cases with different semantics in mind, different ways of computing inference on the same diagram, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.976,
    "end": 3567.983,
    "text": " with this idea of uh separating you have the diagrams on one side that represent the description of your model itself and then you have the functors that describe what the computation you do on that model and i think the separation of concern means that well you can compose the syntax together and compose these descriptions to form a louder description and then that way of building your model will inform the computation side of things and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.963,
    "end": 3576.619,
    "text": " I guess, yeah, speedups are sort of one of the theoretical results or experimental results you could get out of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.82,
    "end": 3583.272,
    "text": "And I guess, I mean, other ways of thinking about it, I think when you're talking about topology, it really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.252,
    "end": 3600.453,
    "text": " it really feels like there's some connection to be made there in the sense that a lot of what people do with these diagrams is try and embed them onto some topological space where your computation doesn't live in the abstract anymore and is actually embedded in a particular space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.493,
    "end": 3611.807,
    "text": "And I guess for physicists, this will be like embedded into space-time, you know, so you will have like these relativistic quantum mechanics ideas where you have quantum processors on a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.787,
    "end": 3613.55,
    "text": " on a manifold for your spacetime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.911,
    "end": 3631.483,
    "text": "But I think a similar idea can be used to take your abstract description of a generative model and embed it onto an actual topological space, which is the sort of space-like organization of a particular brain or a particular machine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.096,
    "end": 3634.477,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.597,
    "end": 3639.73,
    "text": "Yeah, I think of the saying, slow is smooth and smooth is fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.372,
    "end": 3646.367,
    "text": "Like the speed up sounds like it's going to be the pot of gold at the end of the rainbow, but actually the modularity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.887,
    "end": 3657.278,
    "text": " and the legibility of the software is what is going to get that infrastructure-grade long-term templated reuse of cognitive models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.959,
    "end": 3667.488,
    "text": "And if those take slightly longer to run than some super special case optimized situation, first off, we're only going to get to that optimized runtime from the modular design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.549,
    "end": 3673.755,
    "text": "And then in the end, I think it's going to be the compositionality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.735,
    "end": 3679.206,
    "text": " that leads to ecosystems of components that are effective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.54,
    "end": 3685.707,
    "text": " And then speed can be sort of a secondary consideration that's runtime and situation specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.288,
    "end": 3704.608,
    "text": "But like the benefits of bringing category theory to active inference, I hope we can draw out over the coming months and years because it really represents a upgrade in how these models are represented and communicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.669,
    "end": 3708.653,
    "text": "And they kind of bring an aesthetic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.388,
    "end": 3733.358,
    "text": " possibility with its own grammar that is clearly to be learnt and also a really strong machine readability so i hope that people who view this are excited to try disco pie and that we can continue to like look back at the models that have been built",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.338,
    "end": 3754.097,
    "text": " and bring them into these notation systems to demonstrate how they can exactly recapitulate and give reproducibility to past examples and i think that act alone is going to reveal a sort of adjacent possible and it would be awesome if that could all be happening in a flexible environment like disco pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.803,
    "end": 3781.3,
    "text": " yeah i i can't agree more i mean i think there's a similar effort that's been going on on the machine learning side where people have taken category theory to formalize existing models and it's always the question of okay i mean you can do existing stuff but what's the um what's the new stuff you can do with it and i felt like yeah active inference is definitely a place where you can look for this these new models where potentially there's um there's something there that you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.28,
    "end": 3810.696,
    "text": " um describe in a succinct elegant way using categories and show has some experimental value in practice and i guess software is going to be key to turn these theoretical insights into experimental experimental value and and i think yeah this this ability of category theory to make bridges between different topics and to to make metaphors become formal is also a good way to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.878,
    "end": 3815.464,
    "text": " get inspiration from other fields into active inference and back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.484,
    "end": 3827.682,
    "text": "So I think, I guess, yeah, it would be super exciting that the same library gets used by quantum natural language processing people and active inference that have a priori nothing to do with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3829.805,
    "end": 3830.185,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.205,
    "end": 3832.649,
    "text": "Well, do you have any last comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.669,
    "end": 3838.557,
    "text": "And also, like, what directions are you taking it now with the package or just in your own work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.903,
    "end": 3851.365,
    "text": " Yeah, I mean, I guess we're looking very much for contributors, especially people who can bring projects to apply the library in new directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.666,
    "end": 3859.06,
    "text": "And so please get in touch on GitHub or otherwise, and we'll be very happy to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.04,
    "end": 3863.51,
    "text": " to welcome new people to the DiscoPipe contributors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3863.77,
    "end": 3873.471,
    "text": "And in terms of new directions we're pushing it in, I guess, yeah, the sort of education effort is something we're trying to invest a lot of time in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3873.511,
    "end": 3878.061,
    "text": "So we spend a lot of time writing documentation, examples, notebooks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.041,
    "end": 3884.209,
    "text": " hopefully will lower the barrier to entry to something that's quite scary at first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3884.229,
    "end": 3887.774,
    "text": "I mean, category theory is one of the most intimidating topics out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.854,
    "end": 3895.725,
    "text": "So making it more childish and talk about snakes and spiders and sort of making it fun is a part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.966,
    "end": 3899.931,
    "text": "And I guess, yeah, in terms of developments, I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.911,
    "end": 3909.325,
    "text": " There's a lot of work on category theory for probabilities, and I think that has a very strong connection with functional programming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3909.365,
    "end": 3922.606,
    "text": "Like, I guess there's this monad-based library in Haskell that implements a lot of Bayesian inference in terms of monads and very elegantly in terms of category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3923.046,
    "end": 3927.994,
    "text": "I think some of that could be ported to Python and built into DescopePy so that you could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.974,
    "end": 3949.689,
    "text": " potentially go beyond the sort of toy examples where you have a bunch of categorical distributions and go into something where it's a very powerful system that can handle all kinds of Bayesian inference problems and in the same sort of nice looking diagram world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.794,
    "end": 3954.336,
    "text": "The future is diagrammed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.362,
    "end": 3962.391,
    "text": " Yeah, that's I mean, matrices were the maths of the 20th century diagrams will be the maths of the 21st.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.054,
    "end": 3964.374,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.755,
    "end": 3965.495,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.916,
    "end": 3970.582,
    "text": "Looking forward to learning more and appreciate all the work and the outreach that you all do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.863,
    "end": 3973.346,
    "text": "So yeah, thanks a lot for the invite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.486,
    "end": 3975.849,
    "text": "And hope get in touch soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.25,
    "end": 3976.59,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.71,
    "end": 3978.032,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.052,
    "end": 3978.653,
    "text": "Take care.",
    "speaker": "SPEAKER_01"
  }
]