[
  {
    "start": 5.06,
    "end": 8.364,
    "text": " Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.744,
    "end": 12.989,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I'm thrilled to be speaking with Connor Hines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.609,
    "end": 21.758,
    "text": "Connor is a PhD student, although he just told me he just finished his PhD at the Max Planck Institute of Animal Behavior, as well as a researcher at Versus AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.299,
    "end": 30.207,
    "text": "His work focuses on the apparent teleology of complex systems and especially how they can be described as conducting variational Bayesian inference over their environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.642,
    "end": 36.23,
    "text": " Thus, Conor leans heavily on active inference and the free energy principle in his analysis of collective behavioral systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.931,
    "end": 39.094,
    "text": "So he's the perfect guest for today's episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.295,
    "end": 40.917,
    "text": "Conor, thank you so much for being here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.957,
    "end": 42.639,
    "text": "I'm super excited to learn from you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.721,
    "end": 52.574,
    "text": "I need to put my technical hat on because your papers are technical, but I think there's a lot that non-technical audiences will be able to get out of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.395,
    "end": 58.202,
    "text": "I wanted to start... No, no, it's genuinely, it's absolutely my pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.975,
    "end": 69.009,
    "text": " I feel like psychology or cognitive science likes taking the unit of analysis as the individual and then saying, okay, how can we extrapolate from the individual to describe group dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.19,
    "end": 76.459,
    "text": "So I wanted to start very broadly with a kind of axiomatic question about when you study collective systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.48,
    "end": 88.695,
    "text": "Is there a difference between collective behavior in and of itself, like what you talk about in terms of collective behavior, and then the behavior of an aggregation of individuals who we can say belong to a group?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.844,
    "end": 92.689,
    "text": " So is there something over and above the behavior of individuals when we talk about collective behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.49,
    "end": 93.79,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.93,
    "end": 99.037,
    "text": "I mean, this question is one of the motivations for why I ended up studying this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.858,
    "end": 106.406,
    "text": "And I think it ties into what I would say is a larger unifying theme of complex systems in general, complex system science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.947,
    "end": 117.4,
    "text": "I think if you could sum it up in one phrase would be more is different, the whole is greater or different than the sum of its parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.38,
    "end": 120.804,
    "text": " And that is really evident, I think, in the study of collective behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.844,
    "end": 132.376,
    "text": "So yeah, I would say that there's something absolutely different about kind of blurring your eyes, so to speak, on the individual components of a system and treating the system as a thing, as an emergent thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.977,
    "end": 136.6,
    "text": "And there's a lot of theories about whether that's like an epiphenomenal thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.621,
    "end": 139.564,
    "text": "Is that just something that exists on a descriptive level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.084,
    "end": 145.53,
    "text": "Or does this larger thing, like a flock of birds or a school of fish or a society or an economy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.51,
    "end": 165.257,
    "text": " Does it in some way have like causal power and influence on these like micro level individuals, but I like the larger if the last like whatever 30 years of complex system science has shown us that yes, there is something qualitatively different about the bigger picture than just an aggregation of individual components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.71,
    "end": 171.859,
    "text": " Yeah, I think in terms of, let's say, socio cultural groups, the top down influence is quite transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.899,
    "end": 178.209,
    "text": "I mean, in terms of an economy, the economy that you function in, presumably has a kind of circular causality with the agents in the economy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.17,
    "end": 182.715,
    "text": "I'm wondering whether in terms of more mechanical complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.697,
    "end": 194.012,
    "text": "So even in let's say, simulation work, is there something that emerges ontologically, in terms of the actual dynamics of the group as a whole, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.992,
    "end": 199.457,
    "text": " can't be reduced to, let's say, just like a summation of those individual behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.138,
    "end": 205.763,
    "text": "And I guess, in that, even if there is, can we distinguish that from top down causality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.083,
    "end": 211.808,
    "text": "So as you say, you might have something which like is ontologically different, you can actually say, Okay, this is a different phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.429,
    "end": 221.637,
    "text": "But where do you see the top down causality coming in, before we get to, let's say, languages or broader cultures or economies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.887,
    "end": 226.331,
    "text": " Yeah, no, that's a hotly debated topic, effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.412,
    "end": 232.838,
    "text": "So there's a lot of work that's kind of trying to actually quantify the amount of top-down causation that there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.359,
    "end": 241.927,
    "text": "Because, of course, we can always define some set of macroscopic or coarse-grained variables from an ensemble of microscopic variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.988,
    "end": 245.771,
    "text": "Say I have a bunch of particles or a bunch of gas particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.831,
    "end": 247.793,
    "text": "I can take averages like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 247.773,
    "end": 252.28,
    "text": " and come up with quantities like the temperature or the average mass or the average velocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.72,
    "end": 257.627,
    "text": "The question is, is that coarse-grained variable actually doing anything to the lower level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.647,
    "end": 258.609,
    "text": "Does it feed back down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.41,
    "end": 264.337,
    "text": "And my intuition is even in simulation, yes, there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.437,
    "end": 266.721,
    "text": "And people have tried to quantify this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.741,
    "end": 275.333,
    "text": "There's people like Lionel Barnett and Anil Seth at University of Sussex who have come up with quantities like dynamical independence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.313,
    "end": 284.614,
    "text": " So there's an idea where these coarse grain variables don't just act as descriptors or aggregators of lower level constituents, but they end up having their own causal power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.155,
    "end": 290.487,
    "text": "And intuitively, when you hear that, it's quite hard to imagine how that's possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.467,
    "end": 315.397,
    "text": " Um, but it's, I think it's one of the most fascinating and kind of magical things about complex systems is that basically these slower, like both like spatially and temporally coarse grain variables end up kind of, uh, accumulating a life of their own and they can in fact influence and in some ways be more predictive of the lower variables, um, than just taking the whole like ensemble of lower variables as predictors themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.097,
    "end": 317.419,
    "text": "Um, I don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.399,
    "end": 338.867,
    "text": " to be quite frank although i'm quite confident this exists i don't have a great intuition for how that's possible because it kind of flies in the face of the last you know 200 years of reductionist science which is basically saying that the only causal direction is up everything starts like you know with gluons and quarks and then you kind of build the universe up from there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.847,
    "end": 343.852,
    "text": " But all of this research is suggesting that there is some degree of downward causal influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.892,
    "end": 348.197,
    "text": "And ontologically, it's actually quite philosophically difficult to reckon with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.237,
    "end": 349.718,
    "text": "I don't know why that is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.758,
    "end": 350.919,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.04,
    "end": 365.935,
    "text": "I mean, I wonder whether it's just a slightly different type of causation from the kind of gluons or quarks up in the sense that going all the way back to Aristotle, people talk about constraint versus causation, and it might be just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.915,
    "end": 369.061,
    "text": " macrosystems constrain the organization of microsystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.362,
    "end": 370.524,
    "text": "But yeah, it's a massive question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.945,
    "end": 372.788,
    "text": "And yeah, as you said, it's very philosophically rich.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.828,
    "end": 377.036,
    "text": "I mean, strong emergence, weak emergence, all of this kind of stuff is really philosophical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.718,
    "end": 378.139,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.379,
    "end": 384.932,
    "text": "I'm going to sort of humans or are in silico simulations of humans or cognitive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.074,
    "end": 386.134,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.857,
    "end": 397.737,
    "text": " when you put when you sort of run these in silico simulations, you equip, you know, I read one of your papers, you equip them with social information, right social priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.837,
    "end": 403.006,
    "text": "So in one of yours, you add distance to the net their neighbors, or you would have the rates of the change of the distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.008,
    "end": 404.95,
    "text": "I'm wondering whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.622,
    "end": 406.323,
    "text": " Would it be possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.343,
    "end": 412.411,
    "text": "Do you know, do individual agents need to be equipped with the social priors to become social agents?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.372,
    "end": 413.712,
    "text": "More?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.353,
    "end": 429.452,
    "text": "Is there a way that actually just by acting, and let's say having a shared goal, but without actual reference to the presence of other agents, we have this kind of gestalt, or we have this kind of emergence of a overall pattern?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.242,
    "end": 448.892,
    "text": " yeah definitely i i think so basically there's different ways you can effectively introduce correlations or coupling between agents um the way that we think i mean there's a lot of evidence that animals and agents in society do correlate each other's activity is through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.294,
    "end": 452.742,
    "text": " either directly or indirectly perceiving aspects of the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.802,
    "end": 463.928,
    "text": "Like we can see each other, schooling fish can sense their neighbors, bacteria can sense each other in kind of like all sorts of interesting ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.667,
    "end": 475.139,
    "text": " but there's nothing qualitatively saying that you can't couple a system of particles with some like third court like driving or common source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.179,
    "end": 488.433,
    "text": "So for instance, if I have a bunch of particles trying to navigate towards a food source on some like media, like they're all attracted by biochemical gradients towards a food source, of course that will induce correlations in their activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.474,
    "end": 491.637,
    "text": "So it will seem like they're all moving as one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.617,
    "end": 501.621,
    "text": " where as in fact, there's nothing that's actually letting them sense each other, but they're just some kind of common source that's giving the appearance of correlated activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.641,
    "end": 508.377,
    "text": "And this is a classic thing that comes up in neuroscience too, when we're looking at large recordings of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.357,
    "end": 510.56,
    "text": " oftentimes we're not recording the whole brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.6,
    "end": 513.444,
    "text": "We're just looking at some small subsection of neural activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.865,
    "end": 517.129,
    "text": "And you see all these correlations between neural firing patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.149,
    "end": 518.511,
    "text": "And you say, oh, look, they're connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.012,
    "end": 523.858,
    "text": "And people use all kinds of correlational techniques to infer the nature of those interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.918,
    "end": 525.32,
    "text": "Oh, this neuron is driving that neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 525.561,
    "end": 532.731,
    "text": "But you actually never know if there's some third causal driving force that's actually responsible for correlating their activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.171,
    "end": 536.676,
    "text": "And this is actually one of the nice things about studying collective animal behavior,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.179,
    "end": 548.37,
    "text": " Like in the lab of Ian Cousin, where I did my PhD, they have the ability to kind of track with high resolution a bunch of individuals, like every individual in an ensemble, in a collective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.13,
    "end": 556.277,
    "text": "And they can even reconstruct kind of, to some extent, the visual fields and the sensory fields of the individuals in the group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.637,
    "end": 566.967,
    "text": "And in that way, they can kind of decouple these potentially third correlating or confounding factors from the actual use of social information that the individuals might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.947,
    "end": 568.554,
    "text": " That's cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.734,
    "end": 569.397,
    "text": "That's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.321,
    "end": 573.473,
    "text": "Yeah, because I can imagine without that, it can be very confounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.915,
    "end": 575.1,
    "text": "And it makes me think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.57,
    "end": 581.461,
    "text": " To what degree here is collective behaviour genuinely advantageous for these organisms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.641,
    "end": 583.765,
    "text": "And I guess it comes to a kind of evolutionary question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.466,
    "end": 590.978,
    "text": "There is an evolutionary debate about what is the transmitted thing over epochs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.159,
    "end": 594.946,
    "text": "Is it the actual gene, the species, collective and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.687,
    "end": 597.831,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.811,
    "end": 607.98,
    "text": " In some sense, if we just say, okay, well, there are these aggregations of individuals which have similar goals and therefore look as if they are acting in accordance with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.601,
    "end": 612.464,
    "text": "And obviously, when you start recognizing others, well, then you have to start taking them into account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.605,
    "end": 627.177,
    "text": "Your work, have you got any intuition as to whether the presence of others with shared goals is actually beneficial for the organism who's pursuing that individual goal or whether it'd be better if we all siloed off and an island onto ourselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.427,
    "end": 647.967,
    "text": " yeah yeah that's it that's like a really um perennial question the study of in not only collective behavior but like socio-biology kind of in its original formulation by like eo wilson is you know is there something inherently advantageous to group living and um if so it's clearly not a be-all end-all because we do have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.947,
    "end": 651.533,
    "text": " the presence of species that are like solo predators, like wild cats, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.734,
    "end": 656.322,
    "text": "They're not living in herds, but then there's other animals that are actually living in groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.382,
    "end": 657.944,
    "text": "And so there's clearly some trade off there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.405,
    "end": 669.685,
    "text": "So I think one answer that probably biologists, because I have to admit, like I often theorize very high level with concepts from physics and mathematics, but there are clear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.665,
    "end": 674.91,
    "text": " you know, individual fitness and more selfish gene related motivations for group living.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.31,
    "end": 682.277,
    "text": "Like a classic one that has been used to motivate flocking and schooling fish is like predation risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.297,
    "end": 693.127,
    "text": "If you're living in a group, you're basically lowering the chance that any particular individual gets predated because, and there's also interesting psychological effects that flocking has on predators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.187,
    "end": 694.408,
    "text": "Like there's a crowding effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.729,
    "end": 699.233,
    "text": "So if there's a bunch of individuals in my visual field, it's harder for me to focus on a single one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.213,
    "end": 704.403,
    "text": " So that collectively lowers the predation risk of everyone in that collective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.423,
    "end": 706.487,
    "text": "So that's one answer to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.527,
    "end": 709.693,
    "text": "There's another interesting answer, which I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.733,
    "end": 711.316,
    "text": "This is maybe a little controversial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.696,
    "end": 718.369,
    "text": "And I think this is where it really ties into the free energy principle, which is once you have a collective system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.94,
    "end": 734.721,
    "text": " regardless of whether it's actually beneficial to the individuals that partake in it if the system has dynamics that kind of allow it to survive it's kind of created now its own selection pressure on it in of itself so the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.701,
    "end": 759.713,
    "text": " um simply by existing and not dissipating is kind of like self-evidencing or selecting itself at perhaps like a higher dynamical scale and this is where i think concepts like the free energy principle which is really in the game of defining why things persist in the first place and what it means to be a thing um has something to say about about collective behavior so i would actually argue that there's certain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.777,
    "end": 765.524,
    "text": " kind of group dynamics that exist, sometimes even at the expense of the individual fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.065,
    "end": 780.283,
    "text": "But once you've entered into this macro scale, the macro scale is kind of living and trying to find evidence for its own existence, even if that goes back and punishes the individual actors that actually originally cooperated to create it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.905,
    "end": 794.183,
    "text": " Um, that's a little bit more controversial, but I think it's a really good, maybe a framework for understanding kind of like maladaptive group dynamics, things like misinformation or virality, social networks, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.704,
    "end": 799.51,
    "text": "Well, the Marxists will be screaming that you've got a great theory there of capitalists, you know, capitalist realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.932,
    "end": 803.656,
    "text": "Um, yeah, that's, that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.676,
    "end": 810.625,
    "text": "I mean, I guess as a, you know, more philosophical bent on this one things, well, where's the kind of locus of control here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.824,
    "end": 823.941,
    "text": " Because I think intuitively, we don't think that the group dynamics have control or agency, like the overall arc of a culture has the agency of its constituents individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.183,
    "end": 833.794,
    "text": "But this idea is like, again, I think it comes down to a kind of constraint causality distinction, there are certain things that say that you can do within",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.263,
    "end": 838.15,
    "text": " capitalist America versus what you could do in communist Russia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.972,
    "end": 842.699,
    "text": "And those actors constraints without there being some homunculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.34,
    "end": 847.127,
    "text": "I mean, obviously, there are homunculus is in the insofar as there are political figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.889,
    "end": 850.293,
    "text": "No, that's a that's a really interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.313,
    "end": 855.563,
    "text": "I think what I've been thinking about is, and this is a even deeper question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.218,
    "end": 861.105,
    "text": " and I'm wondering whether you have to think about this when you talk about collective behavior and aggregating individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.565,
    "end": 864.85,
    "text": "Do you ever think, at what point does one individual end and what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.19,
    "end": 865.791,
    "text": "And when does it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.871,
    "end": 869.676,
    "text": "But when can we distinguish one individual from another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.157,
    "end": 876.245,
    "text": "And I know that sounds stupid, because people will just say, Well, it's the body and you just have it, you just see them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.306,
    "end": 881.753,
    "text": "And obviously, when we're talking about high level evolved systems, like the visual system, and it probably is based on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.733,
    "end": 888.948,
    "text": " you know, v1, picking out lines, which distinguish it, you know, individual organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.429,
    "end": 901.193,
    "text": "I'm curious, in terms of the actual Bayesian mechanics and the free energy principle, is there anything that gives us individuated thingness beyond taking that as a kind of axiom, like, oh, no, there, it just is a thing that is self evidencing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.78,
    "end": 903.463,
    "text": " No, yeah, I don't think it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.543,
    "end": 912.077,
    "text": "I think that's one of the challenges of maybe what the general problem would be called is like system identification or Markov blanket identification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.517,
    "end": 920.55,
    "text": "How do I like look at some high dimensional system and actually pick out what are the individuals or the components of that system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.031,
    "end": 927.021,
    "text": "And even within like biological systems, it's often not that clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.041,
    "end": 929.104,
    "text": "Like you and me might look at,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.742,
    "end": 935.076,
    "text": " hill of termites or ants, colony of ants, and say, okay, yeah, those individual ants are the individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.416,
    "end": 940.67,
    "text": "But in a system where they all share the same genetic material, it becomes a little bit unclear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.991,
    "end": 946.705,
    "text": "And especially when you have these kind of self-immolating sacrifices for the good of the collective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.685,
    "end": 964.71,
    "text": " it's you start thinking about things like the extended phenotype like are these individuals actually individuals or are they kind of just manifestations of some common gene pool they're kind of like the the tools and the fingers that the gene pool is using to act in the world um so i don't think that bayesian mechanics has",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.618,
    "end": 969.907,
    "text": " any strict definition about what a thing has to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.928,
    "end": 972.413,
    "text": "I mean, people will disagree with me on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.754,
    "end": 984.64,
    "text": "For instance, the recent work from people like Carl Friston on particular things, strange kinds, this line of papers actually makes particular arguments about what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.62,
    "end": 1011.235,
    "text": " constitutes a thing and it has to do with a particular set of dynamical constraints between the different subsets of the thing like there's active states and sensory states and there's certain conditional independence relations that have to exist um so so the proposals have been made but i don't think anything about basing mechanics actually tells you how to do the partitioning of the state space it's like given a state space we can then start interpreting the dynamics of that thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.434,
    "end": 1020.545,
    "text": " as doing some sort of Bayesian inference, but where the actual state space comes from, that's a much deeper question that I think is like an active, active area of inquiry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.045,
    "end": 1022.627,
    "text": "That's really Yeah, that's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.667,
    "end": 1039.888,
    "text": "Because I guess one way of doing it would be that you were you out like scientists in some way, and you go, Well, if these things are behaving differently, let's say you got to answer behaving differently, they're diverging in their movements, then you would say, Well, we can make the assumption that the active and sensory states are different, their Markov blanket is different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.51,
    "end": 1051.684,
    "text": " But if they're replicating one another, then even that decomposition of the system into sensory states and active states kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.968,
    "end": 1054.612,
    "text": " kind of informs you to say that that's one overarching thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.133,
    "end": 1062.245,
    "text": "And again, I mean, I like recruiting kind of a philosophical vagueness here, which is that, like, from a philosophical perspective, it's probably just an empty question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.986,
    "end": 1069.035,
    "text": "And there, you know, it's well, what point does a pile of sand become a heap or, you know, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.757,
    "end": 1075.005,
    "text": "And it's, it's empty, if not, if not interesting, and maybe beneficial when we're talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.93,
    "end": 1096.993,
    "text": " i think there are phenomenological effects about you know to what degree do i recognize myself as a kind of siloed off individual versus part of a group and they're probably very aberrant ends to that spectrum like social isolation versus schizophrenia where i'm kind of melting into the world versus being completely alone so i think there are there's import but yeah i recognize that it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.973,
    "end": 1101.72,
    "text": " Yeah, I do think, yeah, I totally agree on a philosophical level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.381,
    "end": 1104.624,
    "text": "There is no hard line in the sand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1104.644,
    "end": 1106.767,
    "text": "There's not going to be some be-all, end-all definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.027,
    "end": 1115.379,
    "text": "Eventually, what will be our deciding factor is the utility or, I guess, the more pragmatist sort of stances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.399,
    "end": 1120.146,
    "text": "The partition we choose for a particular system, is it going to help us do something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.126,
    "end": 1128.613,
    "text": " So for instance, in a lot of my interest in collective animal behavior, I've just been mesmerized by like videos of schooling fish, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.035,
    "end": 1132.245,
    "text": "And these schools are not like cells in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.238,
    "end": 1158.773,
    "text": " know the the i mean cells potentially violate this as well but the position and the role that individuals play within the school are not fixed right so fish can like go to different sides of this area some fish can kind of act as the eyes and ears of the school while others are acting more like the leaders so you have like spontaneous change in roles and leadership and that already is basically telling you that at the higher level at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.871,
    "end": 1181.689,
    "text": " the the kind of sensory states are not assigned like unchanging individual identities so they're so already the partition we use if we want to start studying the school as an individual that partition has to kind of supersede individual identity has to be some spatiotemporal coarse graining of like the movements and identities of different fish or particles over time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.669,
    "end": 1205.652,
    "text": " good which partition we use should be a function of like what question or what hypothesis we're trying to answer yeah um so it comes down to this teleological or pragmatic motivation have you got this is a seems like a much more banal question but i'm just curious because i don't know that much about collective behavior in biology have you got a particular favorite of collective behavior you mentioned schools of fish is there anything else that kind of stands out as impressive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.087,
    "end": 1211.96,
    "text": " Yeah, so schools of fish is probably my top one just because they're visually so mesmerizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.98,
    "end": 1221.48,
    "text": "I mean, starling flocks are quite interesting as well, particularly because, so it often happens that in many realistic schooling scenarios,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.46,
    "end": 1250.607,
    "text": " although you'll have three-dimensional schools this is something i learned from my my advisor ian in practice a lot of the schooling actually is happening in two dimensions so even three-dimensional schools are actually made up of more like 2d manifolds whereas if you look at starling flocks they have very interesting three-dimensional structure so you've probably seen these like um what they call murmurations like these kind of shimmering and oh they almost look like chaotic like strange attractors the way they hold over on themselves",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.587,
    "end": 1257.46,
    "text": " And even those have like quasi two-dimensional structure, but those two-dimensional planes are moving in 3D space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.921,
    "end": 1260.145,
    "text": "And so stuff like that is just visually very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.305,
    "end": 1269.422,
    "text": "And there's a lot of really interesting research like trying to do high resolution recording in 3D of all the birds in a flock and trying to track them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.402,
    "end": 1271.725,
    "text": " So I think that's a really a beautiful one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.125,
    "end": 1275.028,
    "text": "But again, it comes back to your earlier questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.128,
    "end": 1276.39,
    "text": "What is the actual function of that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.81,
    "end": 1286.981,
    "text": "Sometimes these murmurations are very beautiful and impressive, but people still don't really know what the function of such crazy displays of collective coordination are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.702,
    "end": 1287.982,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.083,
    "end": 1295.21,
    "text": "It brings to mind what you mentioned about the fact that there's actually a conversation I had with Carl because we were right at the first episode of this podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.23,
    "end": 1297.553,
    "text": "We were talking about what is the imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.837,
    "end": 1302.388,
    "text": " Cole, you know, originally spoke about an existential imperative underlying the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.07,
    "end": 1309.406,
    "text": "But it's a slightly misleading term because it doesn't say that, you know, we have to do anything, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.426,
    "end": 1310.428,
    "text": "I could just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.527,
    "end": 1311.669,
    "text": " disintegrate right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.729,
    "end": 1316.275,
    "text": "It's saying that if I do persist, then I look as if I am doing variational based inferences on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.576,
    "end": 1321.943,
    "text": "So I said to myself, well, but is there an underlying telos to you know, is there an evolutionary pressure to survive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.983,
    "end": 1322.123,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.143,
    "end": 1325.568,
    "text": "This is just a kind of a biological self truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.309,
    "end": 1332.077,
    "text": "And he went, Yeah, and you kind of see that because there are not many animals that kill themselves, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.097,
    "end": 1339.588,
    "text": "Like there does seem to be some underlying pressure, or some self evidencing survival in a way like survival with self evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.568,
    "end": 1343.596,
    "text": " But it does bring to mind this really interesting fact that there are some animals who will self-immolate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.277,
    "end": 1348.785,
    "text": "And yeah, I think that is so interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.23,
    "end": 1360.407,
    "text": "Is there any kind of idea about beyond, you know, we mentioned ants and termites, and I think that's kind of altruism for the group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.768,
    "end": 1360.868,
    "text": "Yeah."
  },
  {
    "start": 1361.236,
    "end": 1362.578,
    "text": " Are there any other examples?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.36,
    "end": 1370.533,
    "text": "Well, I'm wondering if there's any examples that might just be very tricky to explain under a kind of Bayesian mechanics or under an active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.793,
    "end": 1379.97,
    "text": "I mean, we can expand that question more broadly and just say, is there any animal collective behaviour that you just find staggeringly odd under like an embedded Markov blanket system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.862,
    "end": 1395.124,
    "text": " Yeah, I mean, I think like, so one of the main reasons I went into the collective motion in particular, like the schooling fish and kind of flocking birds was because I found them to be exactly those examples that violate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.205,
    "end": 1403.24,
    "text": " the kind of classic image we have of Markov blankets where you have like kind of layers of states that are not really changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.28,
    "end": 1407.508,
    "text": "Like you have the particles on the edge of the blanket and then you have the ones that are a little more inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.548,
    "end": 1411.135,
    "text": "And then finally you have like the kind of hard nucleus of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.277,
    "end": 1418.108,
    "text": "So I find that even like basic collective motion kind of evades the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1418.712,
    "end": 1422.577,
    "text": " proper understanding under the current iterations of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.617,
    "end": 1432.57,
    "text": "I mean, this is part of the reason the paper you mentioned that kind of studies like frames individual elements of like a school as like active inference agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.331,
    "end": 1438.117,
    "text": "That paper actually didn't try to formulate the whole school as a collective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.137,
    "end": 1440.68,
    "text": "That was one of the other objectives I had during my PhD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.7,
    "end": 1443.724,
    "text": "And it's something I'd still like to study if I have time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.704,
    "end": 1459.45,
    "text": " But I find that actually doing proper Bayesian mechanics on the whole school as if the school is the unit of analysis was quite difficult precisely because collective motion is an example where the roles that individuals play is changing dynamically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.75,
    "end": 1468.024,
    "text": "So if we are to find like a stable Markov blanket description that satisfies all the tenets of the free energy principle, we will have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.004,
    "end": 1484.385,
    "text": " kind of come up with a more dynamic version of system identification that allows you to kind of dynamically redraw who is a sensory state, what parts of your high dimensional state space are playing the role of active versus sensory versus internal dynamically over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.405,
    "end": 1490.653,
    "text": "So I think even like the most kind of basic examples, ant colonies as well, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.673,
    "end": 1492.595,
    "text": "They're a dynamic mixing system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.615,
    "end": 1496.34,
    "text": "Although the roles are more genetically predetermined for the social insects,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.164,
    "end": 1503.232,
    "text": " Though all these examples, I think, are a bit of a challenge to the classic formulation of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.033,
    "end": 1519.273,
    "text": "I guess one of the earlier critiques of active inference was that it's a kind of state-based formalism, which doesn't allow for dynamic change, as you say, and over-timeness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.253,
    "end": 1535.102,
    "text": " i recognize i think this is something that actually came up in a odd twitter discussion between maxwell and kate nave about uh path integrals and the path dynamics it might be you know you're right at the forefront of this research maybe it's worth just for the audience unpicking",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.521,
    "end": 1548.745,
    "text": " what is the difference between a kind of state-based or static active inference versus a path-based active inference, which allows for this kind of, well, I think of metamorphosizing Markov blankets or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.766,
    "end": 1549.988,
    "text": "Yeah, yeah, for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.008,
    "end": 1555.538,
    "text": "So the classic variant of deriving the free energy principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.518,
    "end": 1559.143,
    "text": " rests on specifying what's called a steady state distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.563,
    "end": 1565.11,
    "text": "So it's actually just a probability distribution over the states of the system that should not change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.051,
    "end": 1572.259,
    "text": "And this can generally be applied to many systems, at least on some time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.299,
    "end": 1580.609,
    "text": "So it seems like the distribution of particles in a rock or in me and you, for example, doesn't seem to change on quite so long of a time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.629,
    "end": 1583.813,
    "text": "Of course, the rub is in how do I define what a state is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.894,
    "end": 1585.035,
    "text": "Is a state a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.015,
    "end": 1589.282,
    "text": " particular cell, because cells are turning over all the time, or is it maybe a tissue, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.963,
    "end": 1602.805,
    "text": "But anyway, the basic free energy principle as it was, I mean, I guess as it was pedagogically described, this is, I'm referring to papers like the free energy principle for a particular physics, the monograph from 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.257,
    "end": 1612.171,
    "text": " So the idea is you have this stationary distribution over states, and it's like very trivially a multivariate system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.211,
    "end": 1617.9,
    "text": "So there's a potential for some of those states to be active states, sensory states, internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.92,
    "end": 1621.165,
    "text": "You've kind of partitioned the system, but what's important is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.145,
    "end": 1644.418,
    "text": " over long times if i measure the system the probability distribution of being in this part of state space or this part of state space that probability is fixed it doesn't change over time so it still allows for particles to move around if i look at the individual trajectories like things can change there can be fluctuations but the stationary density the probabilities are are constant yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.618,
    "end": 1664.332,
    "text": " That's in contrast with the more recent path integral or path formulation, where it's not the distribution over the states themselves, like finding my position in this part of the room over time on average, but it's more probably the distribution over paths or trajectories themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.073,
    "end": 1667.858,
    "text": "So the point of this is that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.838,
    "end": 1675.786,
    "text": " There's also a stationary measure or a stationary distribution, but it's not over particular points in state space, but it's rather over sequences of points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.008,
    "end": 1688.079,
    "text": "And that allows you to have a lot more flexibility in the dynamics, where you could have things that appear non-stationary in the sense of if I look at just the positions of the variables, that will be changing over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1688.4,
    "end": 1696.208,
    "text": "But it's because there's actually a more abstract stationary measure, which is operating on the paths or the sequences of variables of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.188,
    "end": 1705.727,
    "text": " So yeah, this is what allows, I mean, apparently, this is, I think, what's going to be upcoming as we see this formulation unpacked more, especially in terms of simulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.248,
    "end": 1713.082,
    "text": "We're going to see versions of this Bayesian mechanics applied to systems that are moving in time and not stationary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.102,
    "end": 1717.15,
    "text": "And this is only something you can get with the path-based formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.433,
    "end": 1730.934,
    "text": " So when you talk about the states, so we're either talking about the sort of path that states take or the kind of position that they have at a given time, what part of the Markov blanket are we talking here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.334,
    "end": 1739.627,
    "text": "Because some people talk about the internal states, parametricizing beliefs over external states and their self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.607,
    "end": 1750.567,
    "text": " And then some people talk about the actual blanket states or the particular blanket states reducing VFE or some people talk about the particular states, which is the blanket states plus the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.108,
    "end": 1761.447,
    "text": "So when we're talking about states tending towards an attracting set, what are the commitments that we're making here in terms of which states those are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.848,
    "end": 1763.591,
    "text": " So yeah, people will disagree on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.691,
    "end": 1767.817,
    "text": "I mean, in the original formulation of the free energy principle, it should be all of those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.318,
    "end": 1774.608,
    "text": "So blanket, sensory, active, and internal all have a stationary distribution defined over them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.59,
    "end": 1778.835,
    "text": "So it's basically the joint distribution of all the subsets of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.015,
    "end": 1780.778,
    "text": "That's the thing that should be unchanging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.699,
    "end": 1789.712,
    "text": "Would that include the external states, or are we allowing those to have some chaotic element to them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.114,
    "end": 1807.785,
    "text": " Yeah, I mean, for the mathematics in the original formulation to work, you actually also need the external states to be unchanging, which is one of the critiques that the free entry principle had got is like, you're not really defining a stationary system to be the system per se, like the agent, but you're actually including the whole world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.765,
    "end": 1811.169,
    "text": " the agent is embedded in as part of your stationary measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.63,
    "end": 1820.882,
    "text": "And you could make arguments that, oh, well, it's referring to just the eco niche, like the behaviorally relevant part of the agent's world that it's trying to control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.303,
    "end": 1825.729,
    "text": "So it's kind of like the agent is forcing its external states to obey the stationary measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.79,
    "end": 1835.882,
    "text": "But I think the path-based formulation allows you to get around that because all these things now become non-stationary if considered in terms of just raw states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.862,
    "end": 1840.071,
    "text": " But yeah, originally it does include all the subsets of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.652,
    "end": 1852.656,
    "text": "It sounds like even when we're talking about the change of the path of states, there still seems to be some kind of predetermined characteristics or predetermined attracting set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.636,
    "end": 1855.981,
    "text": " that path is tending towards a certain probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.763,
    "end": 1857.003,
    "text": "For sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.043,
    "end": 1867.059,
    "text": "You allow for some what Carl would call itinerancy or some deviation from that ideal, but you've still got some pre characteristic dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.379,
    "end": 1869.803,
    "text": "I'm just wondering, you'll know a lot more about physics than I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.364,
    "end": 1875.612,
    "text": "How much does that really square with kind of fundamental physics or understanding of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.712,
    "end": 1878.036,
    "text": "Is it actually feasible to say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.016,
    "end": 1886.384,
    "text": " even if we allow for some itinerancy and change over time, there are there's like a mathematical way that you could still describe that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.404,
    "end": 1896.053,
    "text": "Yeah, I think that actually that assumption is quite consistent with physics because I mean, there's a lot of like equivalency between these different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.094,
    "end": 1902.74,
    "text": "So as soon as I say, oh, these stochastic differential equations tend toward some attracting set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.681,
    "end": 1903.821,
    "text": "Mm hmm."
  },
  {
    "start": 1903.801,
    "end": 1911.716,
    "text": " Another way of saying that is I've just written down a particular form of their flow, like the way that they change over time, some particular equations of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.578,
    "end": 1921.455,
    "text": "And if those equations of motion meet a few basic constraints, like one of them is that they don't diverge into positive or negative infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.435,
    "end": 1923.918,
    "text": " which is, I think, a pretty safe assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.938,
    "end": 1929.985,
    "text": "I mean, if we were assuming all of our equations diverges to infinity, we wouldn't be able to do much with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.526,
    "end": 1938.496,
    "text": "So as long as you say that this equation doesn't diverge to infinity, another way of saying that is there is some measure that this belongs to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.616,
    "end": 1942.36,
    "text": "It basically will tend towards something with constant probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.721,
    "end": 1944.523,
    "text": "And those constant probabilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.503,
    "end": 1949.151,
    "text": " in certain systems will be better described in terms of paths rather than states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.211,
    "end": 1952.797,
    "text": "So the paths of the system will have constant probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.378,
    "end": 1963.676,
    "text": "So although that sounds like restricting, it's actually just a statement of writing down any differential equation that doesn't have some crazy kind of impossible form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.658,
    "end": 1964.778,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.798,
    "end": 1964.858,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.192,
    "end": 1973.682,
    "text": " final question on the physics, because you did a reply to this, how particular is the physics of the free energy principle made by Aguilera and colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.543,
    "end": 1983.393,
    "text": "And I just was really curious, because it's very much pertains to what I was saying about what states are we talking about the particular states, the internal states of blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.954,
    "end": 1991.503,
    "text": "And you say in that paper, and I can quote, I expressed general agreement with the target article statement that the marginal flow of internal states does not point along",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.483,
    "end": 1995.368,
    "text": " variational free energy gradients evaluated the most likely internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.849,
    "end": 2003.84,
    "text": "However, in this commentary, I focus on the flow of particular states, internal brackets, internal and blanket states, and their variational for energy gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.86,
    "end": 2007.666,
    "text": "And the average flow of these systems do point along variational free energy gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.226,
    "end": 2010.91,
    "text": "And in my notes, I've literally just written, what does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.02,
    "end": 2020.892,
    "text": " Yeah, no, thanks for bringing that up because I wrote another commentary, I think on the same article that was a lot more like, it was more about this sparse coupling conjecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.952,
    "end": 2023.435,
    "text": "And that one actually didn't get much attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.815,
    "end": 2040.357,
    "text": "But so yeah, that effectively, this is a very interesting point because one of the main hypotheses of the free energy principle, and this manifests in terms of like particular process theories, like predictive coding, is that if you look at the internal states of some system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.826,
    "end": 2044.233,
    "text": " they're pointing directly towards the free energy minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.253,
    "end": 2052.09,
    "text": "So either on average, or if it's deterministic for a particular path, the system looks like it's minimizing free energy very nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.591,
    "end": 2060.387,
    "text": "So in the same way we train deep neural networks to exactly maximize the ability to predict the test data, we train predictive coding networks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.367,
    "end": 2062.211,
    "text": " to exactly minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.231,
    "end": 2066.341,
    "text": "So they're taking the direction of steepest descent towards the free energy minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.842,
    "end": 2069.448,
    "text": "And at that minimum is where your inference is best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.97,
    "end": 2077.768,
    "text": "At the local minimum of the free energy, your inference over external states is the best it can be, given your approximate posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.748,
    "end": 2106.0,
    "text": " in your generative model so what aguilera at all's um paper found is that if you look at like very simple stochastic differential equations these are like in this class of linear systems so they're very easy to analyze and they're probably not the best model of the more complex systems we're actually interested in in biology but they're a really good starting point what they found is that sorry that's where i live outside yeah i've got to walk um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.993,
    "end": 2128.562,
    "text": " uh that they found that even for these simple linear systems the average internal states are actually not pointing towards these free energy minimum and that was kind of posed as like a challenge to the free energy principle and the mathematics behind that derivation in my opinion were uh totally sound so it is true that actually even in these uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.981,
    "end": 2151.073,
    "text": " very simple linear diffusion systems you don't get this kind of nice interpretation as internal states walking in the steepest direction towards the best inference they're actually taking a more circuitous route towards the minimum which entails the best inference however if you extend your um your kind of your your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.712,
    "end": 2156.223,
    "text": " definition of internal states to include also the active states and the sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.243,
    "end": 2165.847,
    "text": "So the so-called particular states, the things that differentiate the particle from the external environment, then those things actually are pointing down free energy gradients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.308,
    "end": 2168.995,
    "text": "And this kind of is in line with this general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.667,
    "end": 2195.269,
    "text": " idea that i think is a lot more in line with like the idea of sensory motor coupling it's not just the internal states that are doing inference but the internal states are kind of cooperating or conspiring with your active states in order to collaboratively get to that free energy minimum at which point inference is exact or as exact as it can be given your approximations so it's saying okay i don't need to go the the steepest way to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.249,
    "end": 2199.297,
    "text": " the free energy minimum, I can take like a kind of curvy circuitous route.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.657,
    "end": 2208.935,
    "text": "But I'm at the same time, I'm pushing my active and sensory states in such a way that will actually minimize the time it takes us to get to the free energy minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.496,
    "end": 2213.264,
    "text": "And that was kind of the point of that, of that article, or one of the points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.624,
    "end": 2214.306,
    "text": "No, that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.626,
    "end": 2217.612,
    "text": "I'm just wondering, so when we talk about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.334,
    "end": 2227.206,
    "text": " So we're talking here about the sort of self-evidencing or the gradient descent of particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.868,
    "end": 2237.94,
    "text": "Could we say that actually it might, what would it mean to say, what would it look like if I said we're doing gradient descent just on blanket states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.781,
    "end": 2244.088,
    "text": "So let's ignore, silo off the internal states for a second and just say our blanket states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.71,
    "end": 2250.636,
    "text": " absent the internal states also, they also point down variational free energy gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.004,
    "end": 2253.107,
    "text": " Yeah, I don't think that is guaranteed, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.127,
    "end": 2265.045,
    "text": "I don't think blanket states are necessarily pointing down free energy gradients necessarily without taking into account sensory and, or sorry, internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.306,
    "end": 2271.615,
    "text": "So the internal states are kind of the things that are driving the active states to jointly minimize the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.635,
    "end": 2279.307,
    "text": "And the free energy, recall, is defined on both the blanket and the internal states because it's defined on the observations, which are like the blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.287,
    "end": 2285.675,
    "text": " And it's also defined on your beliefs over external states, which in this case are parameterized by internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.296,
    "end": 2298.151,
    "text": "So if you define the free energy just on the blanket states, I don't think it's guaranteed to, it will be minimized in the long run, but it's not guaranteed that the dynamics are pointing in the direction of steepest descent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.112,
    "end": 2307.302,
    "text": "How do you, when people, so I think people, this is kind of coming to the kind of education of active inference, I guess, and part of this podcast is learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.637,
    "end": 2334.707,
    "text": " me learning and the audience learning alongside with me when people when people like you talk about internal states i understand what it means to sort of parameterize beliefs over external states and in some ways you're doing vfe because you want to return to like a set of external states which is viable for your existence so fish are not going to be found outside water i'm not going to be found in an ice cube so on my freezer i don't know um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.244,
    "end": 2346.024,
    "text": " Now, my sort of a persistent question that I've always had, and I don't think anyone has really answered, and I'm not sure there is an answer is, is that we say that the internal states are kind of the vehicle for these beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.846,
    "end": 2349.611,
    "text": "But are they could you also just say they are these beliefs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.972,
    "end": 2354.4,
    "text": "Like, is there anything over and above the internal states beyond these Bayesian beliefs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.617,
    "end": 2356.24,
    "text": " Yeah, no, that's a really good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.3,
    "end": 2365.077,
    "text": "So this gets into a bigger question also about identifiability and uniqueness of the free energy principle and Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.117,
    "end": 2370.668,
    "text": "So in short, the internal states are not just simply the beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.648,
    "end": 2373.333,
    "text": " because they are whatever physically they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.533,
    "end": 2385.796,
    "text": "Like if we're looking at a school of fish and we're saying these five fish are playing the role of the internal states or looking at a cell, this part of DNA is playing the role of the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.816,
    "end": 2387.138,
    "text": "It's coding the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.118,
    "end": 2388.602,
    "text": " production of proteins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.203,
    "end": 2393.314,
    "text": "That itself, that internal state doesn't have anything intrinsically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.334,
    "end": 2399.39,
    "text": "It's not parametrizing parameters of probability distributions over external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.972,
    "end": 2401.195,
    "text": "So what's always",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.867,
    "end": 2414.826,
    "text": " at play when you're saying that the internal states are about or in somehow representing external states is there's always a function there, which in the classic free energy literature is called the synchronization map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.267,
    "end": 2422.298,
    "text": "And what this is, it's a function that takes your internal states and it maps them into the parameters of probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.979,
    "end": 2429.308,
    "text": "So it's basically something that takes the raw, dirty physics of the system, however it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.288,
    "end": 2437.848,
    "text": " the metals and the ions and the things that actually consist of your system, and it's mapping them into a space of probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.908,
    "end": 2444.884,
    "text": "So if we wanted to say that my neurons are encoding beliefs about the position of objects in the room,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.864,
    "end": 2471.26,
    "text": " that that function that synchronization map would be doing is it would like take the firing rate of a neuron which is like an actual physical neurophysiological property that i can measure from the neuron and it's mapping it to something like the mean of a gaussian distribution or the variance of a gaussian distribution so it i mean i guess in that sense it's like do you think that the firing rates of the neurons simply are the belief i would say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.898,
    "end": 2498.074,
    "text": " actually this this kind of hints at at something i i um saw you talking about alex kiefer on on one of your earlier podcasts is like this kind of identity problem like are the neural firing rates the belief the representation themselves or is there some map that takes the raw physics of the system and then maps it into a probability distribution into a representation so i think you always do need that function that actually takes the system and maps it to a belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.054,
    "end": 2509.034,
    "text": " But the problem with identifiability is it seems like there may be many candidate functions that take the system states and map them to a probability distribution over beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.455,
    "end": 2520.855,
    "text": "So it's very hard to just look at a system and say, oh, yeah, it's forming beliefs about the average distance to neighbors or the light refraction in the room or the contrast of some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.835,
    "end": 2546.539,
    "text": " some image out there we we usually come to the table with very strong priors about for instance neural coding we think that neurons either code things with the timing of spikes or they use like the firing rate and that's how they do the encoding and that's basically saying we come to the table with priors about what that function is but in theory there's nothing about the free energy principle that tells you what that function is so it's a very hard like identifiability problem in general",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.768,
    "end": 2549.294,
    "text": " Okay, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.314,
    "end": 2549.595,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.615,
    "end": 2557.002,
    "text": "I mean, another thing that kind of sticks in my mind when I think about this is where does the weather like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.758,
    "end": 2559.38,
    "text": " where do the beliefs stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.4,
    "end": 2561.462,
    "text": "So what point is something internal to the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.502,
    "end": 2563.344,
    "text": "And what point is something external to the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.964,
    "end": 2581.262,
    "text": "So like, for example, let's say my eye, right, there's something like me, let's take as a kind of presupposition, I am conducting variational Bayesian inference, like, over the external states, but the external states in some strange way are also myself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.282,
    "end": 2586.668,
    "text": "Because I also, let's say, the observations that come with respect to my glucose levels,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.053,
    "end": 2612.284,
    "text": " now that's because i need to have some beliefs right some uh probability distribution that my glucose levels are going to tend towards a certain point in that like there is some internal belief about an external state but that external state is actually still within me now we kind of get around this through this notion of embedded markup blankets right like i'm not actually paramatrializing those beliefs but actually my cells are but i guess the point here is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.939,
    "end": 2618.486,
    "text": " It comes back to a question that I've had loads of times and people have had different answers to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.986,
    "end": 2639.571,
    "text": "Is this just a useful structuring tool here where I can just say, well, I don't really know why or how or when this Markov blanket ends and becomes part of the bigger order Markov blanket and so on until you get something that it's like to be me, but it's useful and we can do some useful maths or useful physics based on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.551,
    "end": 2661.812,
    "text": " Because I just think like, again, it's philosophically vague as to does it makes like, is the cell is part of the, you know, is there just a straight elision really, between an internal state and an external state from the perspective of a cell, because it seems that it's also doing Bayesian beliefs on its own location, its own status, its own, right, like, so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.927,
    "end": 2664.011,
    "text": " I've always struggled with that with the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.051,
    "end": 2670.983,
    "text": "Yeah, it makes sense for me that the internal states I have to parameterizing beliefs about where I am in the world or who I'm with and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.424,
    "end": 2673.527,
    "text": "But what about myself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.908,
    "end": 2680.78,
    "text": "I've got to be about my glucose levels, my temperature, my well being and all the way down to my very granular physics level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.76,
    "end": 2683.143,
    "text": " Where does it stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.163,
    "end": 2683.724,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.804,
    "end": 2699.763,
    "text": "I think the generic answer to this, I think is basically what you meant by embedded Markov blankets, which is if I look at like a coarse grained level, like more psychological level of explanation, like you have beliefs about who's in the other room or what's behind your door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.664,
    "end": 2709.855,
    "text": "So that itself could be drawn out as like a Bayesian network where you have some sensory states, which are like your sensory organs, like your eyes and ears and nose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.835,
    "end": 2716.706,
    "text": " And then you have your internal stage, which is like your psychological state or something or some coarse grained representation of what your brain is thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.187,
    "end": 2721.013,
    "text": "And then you have that external state, which is like the presence or absence of another person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.914,
    "end": 2726.963,
    "text": "Each of those nodes in our Bayesian graph, we can kind of double click on and zoom in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.323,
    "end": 2732.612,
    "text": "And that itself is a thing that has internal blanket sensory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.012,
    "end": 2734.695,
    "text": "So that's like the generic thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.675,
    "end": 2753.528,
    "text": " answer that that um people like carl friston will talk about with the renormalization group like you have markov blankets at different scales and of course the work of maxwell ramsted and people like that who are literally like writing papers about how exactly this happens you have this nested markup blanket so i think that is the the general answer is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.689,
    "end": 2761.457,
    "text": " every time we write down a Bayesian network and a graph, we're like saying, okay, that's the blankets, that's the internal, that's the external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2761.777,
    "end": 2770.808,
    "text": "Every time we do that, we're kind of admitting, well, actually I can always like take what I consider a single state and just rip it up and like start partitioning that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.428,
    "end": 2779.317,
    "text": "And then I think the ultimate conclusion of that exercise is basically your conclusion, which is it all becomes a matter of why are we doing this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.378,
    "end": 2783.262,
    "text": "Like, why am I at this level of zoomed outness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.528,
    "end": 2788.713,
    "text": " And it's probably for some practical utility as a modeler, as a neuroscientist, as a physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.875,
    "end": 2790.095,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.115,
    "end": 2790.575,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.595,
    "end": 2797.683,
    "text": "So if we take the sort of psychological perspective and let's say, you know, so let's say you actually will use your preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.803,
    "end": 2804.51,
    "text": "So the paper that I was mentioning before was from the I believe it's collective behavior from surprise minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.91,
    "end": 2811.257,
    "text": "So that's a really great preprint that people can check out is obviously quite technical, but there's, again, lots of things that people can get out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.322,
    "end": 2822.113,
    "text": " let's say, you know, we embed these, we're doing these Bayesian beliefs over the distance that I am from another person and the rate of change of that distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.234,
    "end": 2827.519,
    "text": "I guess my question here is, am I also conducting Bayesian beliefs about where I am?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.139,
    "end": 2835.106,
    "text": "Do I get where I am out of just like, do I get where I am just out of the beliefs about where other people are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.127,
    "end": 2838.91,
    "text": "Even at a very psychological level, you know, there's someone else in the other room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.93,
    "end": 2840.552,
    "text": "Do I also need to be doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.562,
    "end": 2845.431,
    "text": " Bayesian beliefs about myself in relation to those external world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.451,
    "end": 2855.655,
    "text": "And does that mean that I am also in some ways, like I've got a dual perspective, I've got like this dual monism where I am doing the Bayesian belief about myself as if I was part of the external world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.023,
    "end": 2862.891,
    "text": " Yeah, kind of like doing theory of mind on your own self, like having to simulate your own inference process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.232,
    "end": 2873.624,
    "text": "Yeah, I mean, so I think the argument made in that collective behavior from surprise minimization paper is that you can get away without that variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.804,
    "end": 2877.188,
    "text": "Like you can get away with a lot of coordinated behavior,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.337,
    "end": 2888.051,
    "text": " where agents are tuning their own position and their velocity in space just by operating on very low level reflex arcs, basically just trying to minimize sensory prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.532,
    "end": 2893.418,
    "text": "And so those agents in that paper don't have any representation of their own position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.458,
    "end": 2896.442,
    "text": "That's not like a latent variable in their generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.422,
    "end": 2925.147,
    "text": " all they do is they have some velocity vector and that induces prediction errors and what they can do is they can just change that velocity to basically reduce prediction errors so you can get a get quite a lot of sophisticated behavior without that representation however i think there are plenty of good examples of systems and maybe this gets more into like what you would call metacognition although it doesn't even have to be that yeah but there are systems where you would like to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.717,
    "end": 2931.526,
    "text": " a representation of a random variable in your system that represents something like the self position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.807,
    "end": 2935.511,
    "text": "And you would like to do inference over that variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.912,
    "end": 2937.655,
    "text": "And that basically is what active inference is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2937.715,
    "end": 2951.455,
    "text": "If I have a variable that corresponds to some latent that can control my own body position or my speech or whatever, and doing inference over that latent variable is basically what ends up being some kind of agency or control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.435,
    "end": 2964.074,
    "text": " And I think the cases when you would want to have that extra variable are ones where the dynamics of yourself are above and beyond what can just be determined from your sensory inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.615,
    "end": 2974.27,
    "text": "So for like these reflexive fish, I can get away without having a self variable because their behavior is pretty much completely a deterministic function of their sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.25,
    "end": 2979.685,
    "text": " There is a little bit of like memory in there because they have the belief from the last time step of belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.986,
    "end": 2981.37,
    "text": "But it's very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.41,
    "end": 2983.416,
    "text": "It's not like a very complex dependency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.868,
    "end": 3001.171,
    "text": " When you have individual agents that have a lot of autonomy, I guess, which I would just parse into more long-term nonlinear dynamics, then it makes sense to introduce another latent variable in your model that corresponds to something like myself or my position or my actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.691,
    "end": 3012.205,
    "text": "And at that point, you're going to get more of, I would say, a tension between externally driven behaviors that are driven by sensory stimuli only",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.185,
    "end": 3016.784,
    "text": " and internal, more like endogenous or autonomous behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3017.447,
    "end": 3020.76,
    "text": "And those are the cases when you would want to put that latent variable in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.96,
    "end": 3022.783,
    "text": " Yeah, I've been I've been thinking about this myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.843,
    "end": 3049.701,
    "text": "I'm, we're just finishing up these edits for this flow states paper, and trying to explain sort of with Lars and Carl and others and try to explain sort of what it means for the you know, this is the self is the so called or hidden, like one of just many hidden causes, according to active inference is hypothesizing cause, and trying to explain kind of the difference between an internal cause and an external cause for something that's already presumably internal, right, like me,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.322,
    "end": 3054.927,
    "text": " And yeah, this is cool, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.928,
    "end": 3072.266,
    "text": "I think I remember hearing you're probably more up to date with this, but I remember hearing Carl talk about the idea that the very fact that we introduced something like a self was basically a new structure in a generative model in order to explain disparate input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.286,
    "end": 3075.57,
    "text": "So it's like I'm hearing a bunch of speech signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.55,
    "end": 3099.01,
    "text": " and if i don't if i only have one latent variable in my model which is like there is somebody speaking right then it's not going to be a good enough model of like the speech signals and when you get enough of these like social signals it actually becomes the free energy minimizing solution to break that node into two and there's one that i can control and there's one that's someone else that i can't control exactly that's the best way to like explain the data",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.074,
    "end": 3107.382,
    "text": " Well, yeah, and presumably this is happening actually in developmental psychology and developmental biology whereby a child doesn't really know, have a self-other distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.442,
    "end": 3110.986,
    "text": "And I always relate this back to, I think action is very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.146,
    "end": 3119.514,
    "text": "So this is going back to the work of someone like Chris Frith and the comparator model whereby I can make predictions about the consequences of my action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.534,
    "end": 3128.203,
    "text": "And the very fact that I can do that and witness the sensory outcomes of my action means I kind of get, well, I get this sensory motor arc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.285,
    "end": 3135.972,
    "text": " And then I can have a higher order inference that there is something that that internal to my generative model that is driving that action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.572,
    "end": 3148.103,
    "text": "I guess the question here is what's happening in something like a psychopathology, like thought insertion and schizophrenia, where people don't trust the thoughts that I mean, I think this is actually kind of true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.323,
    "end": 3156.711,
    "text": "And I think the Buddhists actually fleshed this out quite well, though, obviously, if you actually meditate, you'll see that while the thoughts are not yours, like they're not cut, they're not you're not making the force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.751,
    "end": 3158.292,
    "text": "But there's a classic thing in schizophrenia of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.272,
    "end": 3162.138,
    "text": " people who have schizophrenia will often think that the thoughts that they're thinking aren't theirs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.3,
    "end": 3166.586,
    "text": "They're being beamed in by an alien or a government surveillance operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.207,
    "end": 3175.2,
    "text": "How you feed in something like a predictive model into that, unless you take thought as an action and then say, well, I'm predicting the outcomes of my thought and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.18,
    "end": 3179.928,
    "text": " that because I guess we think of predictions as thoughts in some realist way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.968,
    "end": 3182.392,
    "text": "And so you end up with this circular loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.412,
    "end": 3184.396,
    "text": "But yeah, it's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.416,
    "end": 3185.758,
    "text": "I think it's Yeah, it is fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.778,
    "end": 3190.246,
    "text": "I think it's a I think it's a I think this idea of the self as an inferred cause is reasonable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.346,
    "end": 3198.64,
    "text": "I think the only problem is, is that it engenders some kind of potential homunculus, which is sort of what's doing the inference in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.907,
    "end": 3199.71,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.835,
    "end": 3202.441,
    "text": "But these are questions for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.461,
    "end": 3204.972,
    "text": "Yeah, that brings you back to having to define internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.012,
    "end": 3209.811,
    "text": "Like, what if the internal states are the self and you're inferring that that even exists?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.095,
    "end": 3213.559,
    "text": " you need to define the inference process on some other subset of states like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.579,
    "end": 3215.141,
    "text": "How did you get off ground in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.481,
    "end": 3216.442,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.863,
    "end": 3216.963,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.983,
    "end": 3217.764,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.024,
    "end": 3221.708,
    "text": "Well, you've just given me another paper idea, and maybe a PhD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.549,
    "end": 3224.771,
    "text": "So, okay, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.791,
    "end": 3231.239,
    "text": "I wanted to ask about this scene construction paper, because I've been really interested in scene construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.359,
    "end": 3236.845,
    "text": "And I was, I was happy, you know, I saw you work with Bette Mitzer, and I think his work is really amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.825,
    "end": 3245.694,
    "text": " And I just wrote this paper on attention and it's super inspired by what he was doing with Carl and this, especially their selective attention paper, their 2019 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.054,
    "end": 3247.375,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.395,
    "end": 3257.145,
    "text": "Maybe just for the audience who aren't, who probably have an idea and intuition what scene construction is, and they probably think of it as visual, although I really like the sort of language example here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.685,
    "end": 3262.41,
    "text": "Maybe you could explain just at a very sort of high level what scene construction is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.88,
    "end": 3267.445,
    "text": " Yeah, no, I like that you brought up the language example, because that's actually what originally compelled me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.525,
    "end": 3273.211,
    "text": "Even when I saw those papers on scene construction, I actually immediately thought of it in terms of like parsing and language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.231,
    "end": 3277.636,
    "text": "A scene construction is just kind of a type of hidden variable inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.656,
    "end": 3281.34,
    "text": "So I have a bunch of sparsely sampled data points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.221,
    "end": 3288.027,
    "text": "And then given that sequence of data points, like little sensory samples, I suddenly kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.007,
    "end": 3311.466,
    "text": " infer something that's explaining all of them at once like oh this this is the latent cause this is the latent exp explanation that kind of unifies all these disparate um these disparate data points and i guess the construction aspect comes from two ways one is the fact that usually the way we get that sequence of sparse data is through some kind of sampling so like as i read a sentence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.446,
    "end": 3315.939,
    "text": " I'm tip in like Western languages, you're typically reading left to right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.24,
    "end": 3320.933,
    "text": "And as my eyes go right across the page, I'm gathering more evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.217,
    "end": 3337.336,
    "text": " and I'm constructing the scene as in my posterior probability distribution over these different explanations is kind of shifting until at some point, and often we see with human language and visual understanding, there's kind of this like nonlinear feedback where, oh, it kind of snaps into place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.356,
    "end": 3338.397,
    "text": "Oh, this is what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.038,
    "end": 3345.406,
    "text": "And it's very interesting seeing this in language too, like in different languages, like German, for instance, the verb will come at the end of the sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.426,
    "end": 3350.852,
    "text": "So you kind of have to wait until the end of the sentence where that meaning kind of snaps into place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.237,
    "end": 3378.696,
    "text": " so that that's generally what i would describe as scene construction and then in the visual case often it's um you might be looking at a a a painting or something like an ambiguous painting let's say some a modernist maybe abstract thing with not very clear figures and you're sparsely sampling it with your eyes trying to figure out like what's actually going on here and at some point when sampling you you get that gestalt impression of oh there's like a figure in a cloak or something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.676,
    "end": 3389.817,
    "text": " And that moment of gestalt recognition is like the act of constructing the scene, of inferring the latent explanation for all the sensory data that I've gathered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.522,
    "end": 3391.003,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.023,
    "end": 3391.723,
    "text": "That's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.024,
    "end": 3398.091,
    "text": "I guess something that Beck's work really drove home to me and impelled me to write this paper was the importance of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.932,
    "end": 3408.303,
    "text": "So if you're doing a sort of Yabba's task where you have a picture, exactly what you just said, you have a picture and then someone says, well, how rich are the family in this picture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.463,
    "end": 3412.368,
    "text": "And then you scan all of the furniture and you look at their clothes and then they ask something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.448,
    "end": 3416.793,
    "text": "I don't actually know what it is, but let's say, how well do they get along with each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.853,
    "end": 3419.837,
    "text": "And you look at how they're sitting and you look at whether they're looking at each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.02,
    "end": 3431.022,
    "text": " So context is clearly driving a kind of overall, the kind of derivation of a latent courts in some ways, because you're going, Okay, well, I'm going to pick out this evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.803,
    "end": 3434.228,
    "text": "And that's going to drive my inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.969,
    "end": 3441.522,
    "text": "So are we, would you say that we're always integrating a kind of higher order context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.653,
    "end": 3447.203,
    "text": " when we're doing scene construction such that, you know, there is no such thing as the kind of neutral scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.505,
    "end": 3454.095,
    "text": "It's always, you know, the inference is always being driven by our recognition of where we are, what we are, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.837,
    "end": 3455.278,
    "text": "Totally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.318,
    "end": 3462.21,
    "text": "Yeah, I think that's that that's one of the most interesting aspects of Bayesian modeling in general is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.376,
    "end": 3477.798,
    "text": " The ability for people to very rapidly infer a context, which to map it back to the kind of abstraction I used to describe scene construction in the beginning is like, you're inferring which latent explanations you're even testing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.219,
    "end": 3478.76,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.78,
    "end": 3483.106,
    "text": "In the case of, do you get the sense that the family in the painting is rich?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.506,
    "end": 3484.688,
    "text": "You're suddenly...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.668,
    "end": 3490.613,
    "text": " that's inference of a rapid context that then induces which latent explanations am I interested in learning about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.154,
    "end": 3493.496,
    "text": "Like rich versus not rich.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.516,
    "end": 3499.282,
    "text": "Whereas if the cue or the prompt was, is the man wearing a red shirt?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.902,
    "end": 3504.867,
    "text": "Then the different latent explanations that you've suddenly inferred you have to test is a different set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.467,
    "end": 3513.915,
    "text": "And I think that's like one of the most amazing and kind of underexplored abilities that humans and other animals have is they can infer,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.081,
    "end": 3528.58,
    "text": " can use context to basically quickly infer a generative model so like the context kind of selects the generative model that then you use to do something like active inference yeah well yeah i've been thinking about this um because clearly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.897,
    "end": 3535.448,
    "text": " clearly it's just not computationally feasible to contemplate or assess every possible state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.468,
    "end": 3546.565,
    "text": "I mean, this is the whole basis of variational Bayesian inferences that kind of P of Y is just, it's in almost infinitely diverse in its state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.586,
    "end": 3556.221,
    "text": "And so I've been kind of proposing that there's a higher order action policy, which does the kind of pruning to use reinforcement language, the kind of pruning of your potential state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.201,
    "end": 3564.516,
    "text": " And I've been thinking about that a lot in terms of action, because even action, I don't consider doing absolutely everything at any given time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.937,
    "end": 3567.962,
    "text": "Have you got any other further intuitions about how that might work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.022,
    "end": 3578.361,
    "text": "Because I think the slight tricky thing here is that we have a kind of higher order policy, let's say, to prune our state space, but that needs itself to be driven by observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.252,
    "end": 3579.733,
    "text": " right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.753,
    "end": 3584.58,
    "text": "I need to know, okay, I'm going to prune accordingly, because I've observed something in the world, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.6,
    "end": 3587.785,
    "text": "Like, so I see that it's raining, for example, in London right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.905,
    "end": 3593.734,
    "text": "And so, like, I'm just immediately pruning swimming trunks and sunglasses and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.915,
    "end": 3596.138,
    "text": "Yeah, I needed to do the observation in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.158,
    "end": 3600.725,
    "text": "So it sounds like I got to have a higher order action policy to observe the world to drive my context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.306,
    "end": 3604.952,
    "text": "I'm just curious about how much how deeply recursive does that go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.972,
    "end": 3607.656,
    "text": "Yeah, I think like the the overall",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3608.446,
    "end": 3609.429,
    "text": " My Amin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.712,
    "end": 3616.459,
    "text": " I would like to think that there's a generic solution where you basically can start with no structure and build everything from scratch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.479,
    "end": 3618.561,
    "text": "But I think there's basically no free lunch here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.782,
    "end": 3633.096,
    "text": "And I agree with you that maybe the best way to explain human behavior is that you're inferring a context or inferring something that then allows you to prune or select a model that then you can use in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.696,
    "end": 3637.16,
    "text": "But the process by which you do that also assumes some kind of model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.2,
    "end": 3639.162,
    "text": "What's the model by which you infer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.142,
    "end": 3641.044,
    "text": " I need to act to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.064,
    "end": 3651.854,
    "text": "Where those models come from, these deep hyper priors about the spaces of models that I can select at a lower level, those are probably things that are developmentally inborn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3652.154,
    "end": 3662.844,
    "text": "That's probably the space that evolution actually works on, on the space of hyper priors or deep hyper models that babies are born with in their brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.904,
    "end": 3666.668,
    "text": "And these things are probably things that you and I couldn't elucidate in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.154,
    "end": 3673.023,
    "text": " like in human cognitive neuroscience is like a probability of the dots moving right versus left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.103,
    "end": 3674.686,
    "text": "Like that's a likelihood we can write down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3675.146,
    "end": 3681.857,
    "text": "These kinds of models that are like the models about how do I select which structures to use for a given task?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.877,
    "end": 3688.647,
    "text": "Those are probably very hard to put into words, but those are the sorts of things that I expect developmental psychologists have somewhat of a hold on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.667,
    "end": 3693.735,
    "text": "Like these, they probably have to do with like intuitive folk physics, like things like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3693.715,
    "end": 3702.369,
    "text": " There are objects, there are agents, there are things with like spatial temporal correlations over time, like very deep physical constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.13,
    "end": 3707.317,
    "text": "But I do think that at a more mechanistic level, what you're saying makes a lot of sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.377,
    "end": 3711.685,
    "text": "I think like one way you could formulate this is in terms of mixture models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.785,
    "end": 3719.858,
    "text": "So mixture models is like I have some assignment variable that's very high up that tells me which model am I using right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.563,
    "end": 3723.247,
    "text": " And so the mixing variable is what you infer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3723.307,
    "end": 3733.123,
    "text": "And then given the inference of the mixing variable, that effectively selects one of five or ten or a thousand different alternative explanations for the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.844,
    "end": 3740.054,
    "text": "And usually those are models of the same form, like a Gaussian mixture model is a mixture of Gaussians.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3740.615,
    "end": 3747.145,
    "text": "But I think in what you're discussing, what you're mixing are totally alternative structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.125,
    "end": 3751.754,
    "text": " One structure that I'm inferring, one context I'm inferring I'm in is like I'm driving a race car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.155,
    "end": 3755.041,
    "text": "Another context is that I'm talking to a friend or a colleague.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.061,
    "end": 3756.985,
    "text": "And those are totally different models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.027,
    "end": 3761.995,
    "text": "I think one place where the mixture model falls apart is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.717,
    "end": 3768.984,
    "text": " With mixture models, you would assume that when you infer that higher level assignment, sometimes that inference can kind of be wide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.324,
    "end": 3771.106,
    "text": "So you're not sure what context you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.907,
    "end": 3775.991,
    "text": "But when you look at human behavior, people tend not to mix context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.091,
    "end": 3778.534,
    "text": "There's probably some experimental paradigms where you get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.874,
    "end": 3784.98,
    "text": "But oftentimes people infer like they kind of select like I'm definitely going to make these assumptions going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.0,
    "end": 3786.582,
    "text": "I'm definitely going to make these assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.562,
    "end": 3791.734,
    "text": " So there might be something like a better model of structure selection than mixture models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3792.315,
    "end": 3798.85,
    "text": "But that would be one idea, I think, like mathematically where to get started would to be looking at like mixtures of structures effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.1,
    "end": 3800.241,
    "text": " Yeah, nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.261,
    "end": 3804.446,
    "text": "I spoke to Sanjeev now Joshi about this on the podcast, who's a versus with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.506,
    "end": 3806.108,
    "text": "And I spoke to him about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.128,
    "end": 3807.289,
    "text": "And we went back and forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.309,
    "end": 3809.291,
    "text": "And I think we ended up grounding out and evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.311,
    "end": 3811.514,
    "text": "So I think absolutely, you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.774,
    "end": 3818.181,
    "text": "I think there are a couple of things I want to say to that one is, it's always I tell everyone this on this podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.201,
    "end": 3825.85,
    "text": "And personally, I think it's always a bit dangerous to just take one slice of the generative model at one slice of time and take that to be what's actually happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.83,
    "end": 3835.941,
    "text": " it's always dynamic the observations are always feeding into the upper levels which are feeding back down i guess that's the beauty of a kind of predictive coding or a deep parametric modeling system is that like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.14,
    "end": 3837.762,
    "text": " this is just an idealization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.882,
    "end": 3839.545,
    "text": "It's constantly happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.446,
    "end": 3855.927,
    "text": "Personally, I think the other like point of complexity here is that not only do we need to, let's say, derive a context, we also have to derive the salience of the context or like the relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.388,
    "end": 3862.536,
    "text": "So you know, I've been Yeah, I wrote this paper where I'm kind of talking about a circular causality between preferences and attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.516,
    "end": 3872.371,
    "text": " And something that I kind of realized was, well, well, I knew it, obviously, because it's just for my life that if I'm hungry, like if I'm truly starving, I'm not good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.391,
    "end": 3879.141,
    "text": "I don't care about anything else that's on like, that seems fundamentally peripheral at that time, whether that's finishing a paper or, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.796,
    "end": 3906.158,
    "text": " being on my phone and so on, which means that like, there's almost not only is our higher order policy that I prune my state space, according to the fact that I'm now hungry, but also that now trumps any other states possible state space, like on my phone, or I'm writing my essay, which implies that there's like an even higher level precision weighting policy that says, Well, not only do you have to prune accordingly, but you also have to prune in a hierarchical fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.442,
    "end": 3907.024,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.505,
    "end": 3915.81,
    "text": "And I don't know, again, I don't know how deep this goes because as Carl will tell us, anatomically, the brain is very ridgy and very recursive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.482,
    "end": 3917.724,
    "text": " Yeah, that's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.844,
    "end": 3922.21,
    "text": "I mean, that also reminds me, I think, of this paper of Burke's that you mentioned from 2019, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.251,
    "end": 3927.158,
    "text": "Because if I remember correctly, that version of selective attention actually depended on the preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.759,
    "end": 3928.179,
    "text": "Is that right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3928.64,
    "end": 3938.895,
    "text": "So yeah, that's something like other than that work by Burke, and I guess the paper you're discussing now, I don't know of much work that explicitly uses the preferences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.875,
    "end": 3942.621,
    "text": " to then select what generative model is being used for inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.982,
    "end": 3943.863,
    "text": "Because you're absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.883,
    "end": 3949.592,
    "text": "It's not just, oh, I have some observations that I infer the context, which then tells me how to act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.053,
    "end": 3954.64,
    "text": "But that inference also depends on what your goals are, like what is important right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.62,
    "end": 3959.991,
    "text": " And usually we get importance in the kind of classic model based reinforcement learning ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.051,
    "end": 3967.125,
    "text": "We roll out a given policy and we see how much does that policy overlap with what I want, like a reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.166,
    "end": 3969.55,
    "text": "We basically evaluate policies in terms of reward functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.031,
    "end": 3971.835,
    "text": "But what you're suggesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.815,
    "end": 3985.919,
    "text": " maybe cannot be accommodated in that way, where the actual inference itself is biased by, it's not just policy selection, but even state selection or state inference is biased by what's important, what's relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.999,
    "end": 3987.862,
    "text": "And I think there are ways you can get that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.922,
    "end": 3997.418,
    "text": "Like there's this generalized free energy paper by Thomas Parr and Carl Friston from 2019, where they show that in that particular formulation of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.398,
    "end": 4026.493,
    "text": " variational free energy called the generalized free energy you actually do get this interesting influence on state inference from preferences so your preferences will kind of optimistically bias your state inference so that you'll only be doing inference about things that kind of matter for your actual selection so that might be one one place to also call it pointed me in the direction of that paper because you read it you read my paper and then obviously you didn't tell me about this one that sounds absolutely right yeah because i mean my way of coming at it was thinking well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.688,
    "end": 4033.637,
    "text": " in principle, you know, there's near infinite things that I can optimize my free energy minimization over, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.657,
    "end": 4036.542,
    "text": "Like, like, and there are ways out of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.602,
    "end": 4043.412,
    "text": "I mean, some people will talk about something like, you know, Julian Kibberstein, or Mark Miller, or Mark Anderson was all about aerodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.432,
    "end": 4049.882,
    "text": "So it's not enough to minimize free energy, there needs to be a constantly improving slope of prediction error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.183,
    "end": 4060.297,
    "text": " I still don't think that does it because in principle, I could just get way better at tidying my room, but like that's just it or something extremely trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.857,
    "end": 4064.102,
    "text": "Yeah, that's gonna cut it ultimately, because I might just end up starving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.622,
    "end": 4073.254,
    "text": "So it's Yeah, it is exactly as you said, I still think this can be couched in terms of something like an expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.487,
    "end": 4088.982,
    "text": " function it's just it's just far it's just higher order and everything trickles down from it such that as you say like now we have like a selected generative model in truth i haven't thought too much about how this could be implemented mathematically because yeah you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.35,
    "end": 4092.273,
    "text": " That's the place that... Yeah, that's totally true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.313,
    "end": 4098.399,
    "text": "You could actually say... Because the typical way we do the expected free energy is in this brute force enumeration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.779,
    "end": 4099.82,
    "text": "Let's say I did this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.221,
    "end": 4105.185,
    "text": "I did X versus Y. If I did X, what would my expected free energy look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.206,
    "end": 4110.03,
    "text": "It would be a combination of the utility, which is the preferences, and then this information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.931,
    "end": 4114.935,
    "text": "If you were to evaluate that brute force for model selection...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.915,
    "end": 4123.784,
    "text": " if I was to select this model and then go through a whole round of active inference with this model, it just becomes very hard to compute the expected free energy, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.804,
    "end": 4131.992,
    "text": "So maybe there's just a better algorithm or implementation that would allow you to kind of heuristically evaluate these counterfactual consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.172,
    "end": 4137.418,
    "text": "Like if I selected this model, would that make me less hungry?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.438,
    "end": 4138.899,
    "text": "Would that like save me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.34,
    "end": 4144.585,
    "text": "But you probably have to come up with some heuristic or some clever way to get around the enumeration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.649,
    "end": 4151.017,
    "text": " Well, I wonder whether it could just be belief free, whether you might just like, we might just have contextually queued model selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.138,
    "end": 4170.26,
    "text": "You know, the moment that I have the slight, you know, the slightest drop in my glucose, then the whole thing cascades down, such that I have the prioritization of seeking food, and I, I don't even have to run the expected free energy of, I could go here, I could go there, I could go and what am I, you know, how well am I going to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.28,
    "end": 4172.563,
    "text": "Yeah, rather",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.78,
    "end": 4198.205,
    "text": " I just have this what now I just at the very bottom of all that process, I just have this one preference, which is, I think, you know, something like that might hijack or shortcut the whole process leading to like, quite low compute, but actually a pretty robust way of like getting adaptation, because presumably, this is something similar to what a child is doing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.265,
    "end": 4199.806,
    "text": "Like, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.826,
    "end": 4201.588,
    "text": "And I think that kind of works in terms of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.716,
    "end": 4212.982,
    "text": " I don't know, like the simplicity of children in some ways that they sort of cry over anything, which kind of implies that there is just like a very simple stimulus response mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.623,
    "end": 4218.295,
    "text": "And I wonder whether that could just be expanded, you know, just more broadly to model selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.528,
    "end": 4219.169,
    "text": " Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.329,
    "end": 4219.469,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.59,
    "end": 4227.462,
    "text": "I think that ultimately is probably what's really happening in biology because this also extends across the biological spectrum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.502,
    "end": 4231.728,
    "text": "Animals are very context or basically needs driven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.069,
    "end": 4237.617,
    "text": "Things like attention, all these basic cognitive faculties are really enslaved to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.052,
    "end": 4245.99,
    "text": " effectively the basic things that the lower brain is telling the body it needs to do, like breathing, eating, thirst, sleeping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.591,
    "end": 4250.059,
    "text": "So I think ultimately it is some fast stimulus response mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.62,
    "end": 4253.226,
    "text": "I think the only issue with that is it does kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.628,
    "end": 4255.671,
    "text": " it seems less principled, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.691,
    "end": 4258.115,
    "text": "It seems like, oh, we just have to hack in a short circuit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.436,
    "end": 4263.163,
    "text": "And it's not just like evolving through a neat process of free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.764,
    "end": 4266.509,
    "text": "Maybe it is, but it's just happening on a slower timescale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.829,
    "end": 4273.6,
    "text": "Like it's some slow accumulation of experience evolutionarily that has trained this short circuit inference to say, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.62,
    "end": 4279.99,
    "text": "There might have been some EFE calculation on the part of evolution to select for evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.122,
    "end": 4285.727,
    "text": " you know, stimulus response mappings for something very like fundamental, like food or sleep or breathing and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.747,
    "end": 4286.548,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.209,
    "end": 4287.329,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.349,
    "end": 4287.99,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.01,
    "end": 4291.092,
    "text": "Well, that that's given me lots of ideas I need to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.454,
    "end": 4301.582,
    "text": "Final sort of topic I want to touch on is, you know, just before we went live, we spoke a little bit about you being versus full time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.643,
    "end": 4307.188,
    "text": "And I want to sort of ask again, I know, it's been the Sanjeev and others, everything is very under the wraps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.228,
    "end": 4308.149,
    "text": "And I respect them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.189,
    "end": 4309.47,
    "text": "I don't want Maxwell to come and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.682,
    "end": 4311.664,
    "text": " shake me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.145,
    "end": 4316.352,
    "text": "But so I was curious, just a very sort of high level, you've gone from biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.793,
    "end": 4329.076,
    "text": "So thinking about biological feasibility, to modeling and artificial intelligence and trying to ground something in, you know, trying to take biotic cognition and say, Well, what makes that intelligent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.096,
    "end": 4332.522,
    "text": "And then can we replicate that in silico or, you know, in a robot?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.025,
    "end": 4339.817,
    "text": " I was just wondering, how biologically feasible are certain assumptions made by active inference modelers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.939,
    "end": 4348.131,
    "text": "For example, active inference modelers talk about, again, not exactly my bag, but a mean field approximation, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.111,
    "end": 4355.819,
    "text": " where presumably the hidden states or the different tensors have conditional independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.839,
    "end": 4360.985,
    "text": "How you can take that one, you can take any other assumptions more broadly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4361.405,
    "end": 4365.51,
    "text": "Does this seem to you actually biologically feasible or is it just like an interesting modeling tool?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4366.171,
    "end": 4366.351,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4366.371,
    "end": 4366.671,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.473,
    "end": 4373.218,
    "text": "Those are probably the most interesting and important examples of the assumptions we make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.258,
    "end": 4377.763,
    "text": "So I think the biggest one in one word is factorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.283,
    "end": 4393.12,
    "text": " The models, both the generative model that animals have, as well as their cue, their approximate posterior, which they optimize using free energy minimization, those almost necessarily have to be simplified, in my opinion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.808,
    "end": 4403.445,
    "text": " There are some people who believe that the brain is doing sampling-based inference, in which case they can actually be doing full posteriors, in which they don't need any simplifications in their model of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4403.465,
    "end": 4405.429,
    "text": "They're doing full posterior inference on their model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.97,
    "end": 4409.556,
    "text": "I don't think that really holds up because it's way too slow to be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.536,
    "end": 4413.022,
    "text": " useful for the timescale that biology needs to work on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.543,
    "end": 4419.895,
    "text": "So I think those assumptions like factorization in the generative model, those are quite realistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.915,
    "end": 4422.72,
    "text": "And factorization in the posterior, in this approximate posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.78,
    "end": 4428.189,
    "text": "I think that's actually one of the coolest things about variational inference is it seems like something that brains can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.75,
    "end": 4432.978,
    "text": "Because once you make these factorization assumptions, what it gives you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.958,
    "end": 4442.58,
    "text": " are updates to your beliefs that are beautifully local like they they only need nearby information and this is kind of the whole um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.712,
    "end": 4449.144,
    "text": " rallying cry of people like Bert DeVries who work on these message passing and factor graph schemes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.585,
    "end": 4463.691,
    "text": "What's beautiful about that is it's distributed and local and that locality inherits from the fact that we're making factorizations or we're making assumptions of certain variables in my model or in my beliefs are independent of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.671,
    "end": 4468.941,
    "text": " A specific question is, is the mean field factorization appropriate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.242,
    "end": 4475.174,
    "text": "That one assumes that all the different state factors are conditionally independent, actually just fully independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.815,
    "end": 4478.3,
    "text": "That one, I think, is an open question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.841,
    "end": 4484.953,
    "text": "And so there's basically a knob we can turn from fully factorized where everything's super cheap and local",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.018,
    "end": 4487.301,
    "text": " but you're introducing approximation error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.321,
    "end": 4493.909,
    "text": "As soon as you start making these assumptions, your beliefs are not going to be as good at actually explaining the data and minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4494.369,
    "end": 4506.704,
    "text": "On the other side, we have fully enumerated, combinatoric, entangled beliefs and explanations for the world, which are maybe the most accurate, but doing inference on them is going to be expensive and take a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.285,
    "end": 4510.789,
    "text": "So the open question in my mind for biology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.107,
    "end": 4520.7,
    "text": " if we were trying to really map biological processes to like variational Bayesian inference is like where on that sliding scale is biology or our particular systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.341,
    "end": 4525.988,
    "text": "And so a lot of the work that we're trying to do at Versys is basically find good settings of that knob.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.008,
    "end": 4537.463,
    "text": "Like we want to figure out what is a setting of factorization of complexity we can build into these models that they're still sufficiently expressive and generalizable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.503,
    "end": 4540.067,
    "text": "They generalize across contexts, across tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.317,
    "end": 4542.507,
    "text": " but they're not computationally insane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4543.09,
    "end": 4548.977,
    "text": "Like we need to make things cheap and we need to also, we would ideally like to make them cheap enough that we could imagine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.328,
    "end": 4552.532,
    "text": " neural wetware implementing them with like local computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.313,
    "end": 4553.713,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.094,
    "end": 4555.936,
    "text": "Yeah, yeah, that's, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.216,
    "end": 4561.602,
    "text": "I mean, I guess that is the kind of, well, that's always the accuracy complexity trade off, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.622,
    "end": 4572.014,
    "text": "I mean, it's built into the very, I started in my introduction by asking about what I mentioned, in my introduction, apparent teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.216,
    "end": 4577.901,
    "text": "Actually, this was probably the first question I ever had in when I discovered active inference, what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4578.134,
    "end": 4581.681,
    "text": " a year and a bit ago, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.998,
    "end": 4583.661,
    "text": " Well, what is free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.141,
    "end": 4584.342,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.382,
    "end": 4588.268,
    "text": "Like, is there a little sensor in the brain that is like cued into this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.328,
    "end": 4590.871,
    "text": "Like, again, this was me being very naive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.693,
    "end": 4604.652,
    "text": "Is this like little thing and it's sensing free energy and it's trying to get it down to this minimum, which again, now I think about it obviously implies some kind of action policy that is descending down free energy gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.654,
    "end": 4610.942,
    "text": "So it is a naive question, but in some ways it's useful, I think, because it feeds into an intuition, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.884,
    "end": 4618.653,
    "text": " human, you know, there's this long standing, there was a long standing debate about like, what life is, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.673,
    "end": 4625.222,
    "text": "I mean, like the Alain Vittal, is there like some special source that we put into humans that just like, means that we self organize?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.422,
    "end": 4629.828,
    "text": "And I guess this is just a perennial problem, which is, well, why are we doing this in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.908,
    "end": 4630.089,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.149,
    "end": 4637.098,
    "text": "Carl tells us that if we are doing, you know, if we are, if I can say that you're Connor today, and you're calling tomorrow, I can kind of describe what you've done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.585,
    "end": 4641.052,
    "text": " But why you do that is a kind of mystery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.673,
    "end": 4654.739,
    "text": "And I think some people intuitively think, well, maybe there's this adaptive sensor in the brain which tracks this kind of special thing called free energy, which is probably not happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4654.779,
    "end": 4656.522,
    "text": "Let's be honest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.447,
    "end": 4664.345,
    "text": " and it was obviously an information Lee theoretic term that makes things compute tractable from a modeling perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.686,
    "end": 4667.794,
    "text": "But when you're talking about putting that into an artificial agent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4669.124,
    "end": 4672.629,
    "text": " the question that comes to my mind is, is there anything else that you need to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.669,
    "end": 4681.741,
    "text": "Is there a higher order prior, for example, you need to put into it, that means that it actually will act to minimize variational free energy, that actually will self organize?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.222,
    "end": 4684.745,
    "text": "Because there's like, it's kind of like, why does a computer work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.765,
    "end": 4690.272,
    "text": "Like what I've always just like, what's the kind of fundamental thing and maybe in the case of computer or humans, it's electricity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.773,
    "end": 4695.199,
    "text": "Is there anything like that you need to kind of put in that means that it's just doesn't just sit there and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.179,
    "end": 4699.787,
    "text": " is built with these beautiful priors, but doesn't really act in accordance with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.807,
    "end": 4700.107,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.127,
    "end": 4700.348,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.388,
    "end": 4701.53,
    "text": "No, that's a really deep question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.57,
    "end": 4707.62,
    "text": "I mean, so at a fundamental level, I totally agree with you that there's no secret sauce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.64,
    "end": 4708.722,
    "text": "There's no special signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.363,
    "end": 4720.883,
    "text": "As soon as I've written down any equation of motion that doesn't explode any equation of motion for systems that just generally keep existing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.015,
    "end": 4727.532,
    "text": " Another way of saying that is I've written down a free, I can write the dynamics of that system with some free energy functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4728.035,
    "end": 4742.44,
    "text": " So as designers of artificial systems, we have the luxury of not having to write down an equation of motion in such a particular way that we know if we backed out the Bayesian mechanics of it, oh, look, it's actually minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.701,
    "end": 4744.063,
    "text": "We can start with the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.424,
    "end": 4752.979,
    "text": "So as artificial engineers, we can say, no, we're going to actually have these things integrate equations of motion that minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.959,
    "end": 4754.024,
    "text": " So that's what we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.125,
    "end": 4759.51,
    "text": "But systems like self organizing biological systems in the same way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.059,
    "end": 4767.565,
    "text": " on the Savannah, the drafts necks are not getting longer to reach the trees because they want to optimize fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.625,
    "end": 4773.83,
    "text": "That's a post hoc, like apparently teleological description for the dynamics of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.931,
    "end": 4779.576,
    "text": "And then we put a sauce on it, a descriptive sauce called fitness or called natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4780.036,
    "end": 4781.597,
    "text": "That's the exact same thing with free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.898,
    "end": 4782.999,
    "text": "There's just dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.459,
    "end": 4789.565,
    "text": "And then post hoc, we dress it up with, well, these dynamics look like they're actually doing approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.665,
    "end": 4791.066,
    "text": "And that's a cool,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4791.046,
    "end": 4800.982,
    "text": " useful, in my opinion, framing in the same way natural selection is a cool, useful framing for statistical filtering of phenotypes over generations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4801.683,
    "end": 4808.655,
    "text": "But as artificers, as builders and engineers, we can actually write systems that optimize fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4808.815,
    "end": 4810.658,
    "text": "We can write an algorithm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.857,
    "end": 4813.28,
    "text": " We could write a genetic algorithm that does it automatically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.881,
    "end": 4818.367,
    "text": "We can also write an algorithm that directly surfs a fitness landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.528,
    "end": 4822.333,
    "text": "And in the same way, we can directly write algorithms that minimize free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.834,
    "end": 4835.672,
    "text": "The problem is we now have the burden of proof of having to write down a general model and to figure out what the best free energy functional for a given task is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.112,
    "end": 4839.497,
    "text": "I think a more almost complex systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.22,
    "end": 4858.392,
    "text": " way of designing a system would be to actually just design a bunch of particles in a vat and basically design physics, design a particular sandbox of physics that emergently gives rise to agents that minimize free energy without actually plugging that in at the level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.053,
    "end": 4860.676,
    "text": "But that's hard though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.736,
    "end": 4861.036,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.216,
    "end": 4863.4,
    "text": "That's kind of where I was leaning, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.541,
    "end": 4864.021,
    "text": "I see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.322,
    "end": 4864.422,
    "text": "Yeah."
  },
  {
    "start": 4864.402,
    "end": 4874.178,
    "text": " I guess it does bring into mind just fundamental questions of teleology and makes you think, well, why is physics doing this in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.799,
    "end": 4878.025,
    "text": "And as you say, it probably would be in silico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.065,
    "end": 4881.33,
    "text": "Can we get these kind of particles that just do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.66,
    "end": 4912.667,
    "text": " is there a way that we could get to the bottom of that rung without invoking another axiom or another miracle or another process and maybe not you know it's um yeah that's yeah is your thinking that if we did it that way so we started by just like writing down very simple physics of like particles and of that and then we we get the amazing mechanics emergent for free is because i've thought about this as well in your thinking is that like is there an advantage to doing it that way rather than top down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4912.647,
    "end": 4923.942,
    "text": " Well, I think there's an advantage in the sense that to my kind of eyes, there's a slight difference between natural selection and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4924.543,
    "end": 4929.99,
    "text": "And that's because I think with natural selection, you get both the principle and the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.792,
    "end": 4933.955,
    "text": "Now, there are obviously some axioms and miracles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.995,
    "end": 4938.601,
    "text": "Now, I'm not a geneticist, so don't shoot the messenger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4938.681,
    "end": 4941.625,
    "text": "But the basic idea, obviously, is that you get the mutations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.01,
    "end": 4951.964,
    "text": " And mutations are what drive natural selection, because it leads to kind of differentiation within the pool of genes, if you take a very sort of gene focused form of Darwinian natural selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.605,
    "end": 4969.57,
    "text": "But that gives you both the principle, okay, over time, given mutations, there will be optimization for fitness just for free, because you just get, obviously, you get the things that are successful in, you know, the genes that permit reproducing themselves being reproduced, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.056,
    "end": 4974.124,
    "text": " But with variational free energy and active inference and the free energy principle, you get the principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.687,
    "end": 4977.831,
    "text": "What you don't necessarily get is the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.091,
    "end": 4988.271,
    "text": "Namely, what Carl tells you is if things persist, this is what they have to, we can describe them using these mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4989.293,
    "end": 4993.06,
    "text": "It doesn't give you why things persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.411,
    "end": 4995.814,
    "text": " So that's kind of what I mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.854,
    "end": 5016.617,
    "text": "And I do think that if you had a kind of completely neutral system, because the reason why some of these queries come to mind is because I think in the older papers, the older active influence papers, they would very subtly squeeze in this thing where it would say, well, there's also the higher order prior or higher order action policy to minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.766,
    "end": 5020.47,
    "text": " And then that, I think, is a very philosophically fraught thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5020.57,
    "end": 5024.074,
    "text": "Because then you go, well, is there a higher order policy for that policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5024.654,
    "end": 5026.196,
    "text": "And so, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.216,
    "end": 5028.018,
    "text": "And evolution obviously ground some of this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.979,
    "end": 5034.404,
    "text": "But it makes me think like, sure, it's a really lovely scientific tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.445,
    "end": 5043.634,
    "text": "But the power is really in the process theories, whether that's decoding, active inference, variational message passing, POMDP schema, whatever you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.711,
    "end": 5047.522,
    "text": " because you don't get the process for free from the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.542,
    "end": 5049.932,
    "text": "And I think in that there's a slight difference with evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.177,
    "end": 5051.619,
    "text": "Totally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5051.639,
    "end": 5053.286,
    "text": "Yeah, I see exactly what you mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.306,
    "end": 5053.748,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.768,
    "end": 5055.615,
    "text": "I mean, I guess one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5056.642,
    "end": 5058.945,
    "text": " So it depends on how you define evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.426,
    "end": 5065.214,
    "text": "I would potentially argue that natural selection is even happening in non-biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5066.035,
    "end": 5072.104,
    "text": "It's just the process theory that provides the equivalent of mutation is maybe slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.124,
    "end": 5072.765,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.785,
    "end": 5076.27,
    "text": "But I guess you could still say that, well, there's still a mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5076.571,
    "end": 5078.333,
    "text": "Like it's just... It's a change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.353,
    "end": 5080.576,
    "text": "Yeah, it's a change, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5080.596,
    "end": 5080.937,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.957,
    "end": 5086.024,
    "text": "I think my hunch is that something like that could also be identified for...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.105,
    "end": 5091.998,
    "text": " a variational free energy minimization, but I think it would be something that maybe would not be satisfying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.214,
    "end": 5095.439,
    "text": " Like you need, which is another way of saying change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.459,
    "end": 5100.386,
    "text": "You need some function that maps a state to another state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.866,
    "end": 5104.752,
    "text": "And that if you iteratively apply that function, it doesn't diverge to infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.393,
    "end": 5105.493,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.513,
    "end": 5110.56,
    "text": "And I think that would be like the kind of process, theoretic equivalent of mutation in, in natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5112.042,
    "end": 5112.142,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.162,
    "end": 5113.364,
    "text": "I'm sure someone's gonna do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5113.885,
    "end": 5114.706,
    "text": "It probably won't be me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.906,
    "end": 5115.707,
    "text": "Probably will be cold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.727,
    "end": 5117.53,
    "text": "Let's be honest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.1,
    "end": 5133.436,
    "text": " Yeah, it comes back, I think, to this idea that Kate was talking about, and I haven't read her book, but I know it's out, which is that maybe a slight concern with active inference and the free energy principle is that at its very core, it rests on some kind of determined characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.157,
    "end": 5134.438,
    "text": "Mm hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.604,
    "end": 5159.903,
    "text": " maybe I mean all theories have their axioms right I mean all theories have their miracles and natural selection definitely has its miracles but it's very neat and clever and it all wraps up quite nicely and yeah I think you're absolutely right that maybe there's a little bit more work to do to really get the process of like why things don't just fall apart I mean this is Schrodinger's big question right I mean yeah and Karl's big question but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.929,
    "end": 5171.746,
    "text": " Yeah, I think it's very important for an audience to realize that when we talk about active inference being the overarching theory of everything, that's probably never, never really made those claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.367,
    "end": 5173.629,
    "text": "Yeah, I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.649,
    "end": 5177.034,
    "text": "We need, we don't have the physics of why things don't fall apart yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5177.075,
    "end": 5180.26,
    "text": "We've assumed that that physics works and is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5180.36,
    "end": 5181.682,
    "text": "And then we do the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.702,
    "end": 5182.723,
    "text": "Yeah, yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.124,
    "end": 5188.152,
    "text": "And which makes one think, and again, this is no disrespect to Carl or you or Maxwell, anyone who's deeply invested in this, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.756,
    "end": 5191.48,
    "text": " Exactly how much are we getting out of the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.56,
    "end": 5202.274,
    "text": "Because I think Carl himself takes a very deflationary or tautologist count of the free energy principle, which is that it just says, if things persist, they act and perceive like things that would persist do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5202.554,
    "end": 5207.1,
    "text": "Things act in accordance with themselves if they are to exist as themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.981,
    "end": 5208.081,
    "text": "Yeah."
  },
  {
    "start": 5208.736,
    "end": 5211.466,
    "text": " But as I said, how things do that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.486,
    "end": 5212.209,
    "text": "You have to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.811,
    "end": 5220.72,
    "text": "If I make the fundamental presupposition that you are the same thing today as tomorrow, like you have to at least be obeying by that principle, how you do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.472,
    "end": 5224.835,
    "text": " Well, I guess we might know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.177,
    "end": 5228.0,
    "text": "Colin, this was really, really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5229.743,
    "end": 5231.906,
    "text": "These are wonderful, deep questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.966,
    "end": 5233.728,
    "text": "And I'm actually just very glad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.449,
    "end": 5239.637,
    "text": "I think something that people need to be more of is epistemically humble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.837,
    "end": 5242.461,
    "text": " and say where they don't know the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.521,
    "end": 5249.392,
    "text": "And I'm very much in admiration of the fact that you're willing to say that there are plenty of things that this community still doesn't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5249.412,
    "end": 5254.079,
    "text": "So and yeah, the insights are just wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5254.179,
    "end": 5260.168,
    "text": "I mean, I my final question actually is just a curious curiosity, which is you were a neuroscientist, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.208,
    "end": 5262.672,
    "text": "So master's neuroscience, PhD neuroscience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.276,
    "end": 5266.739,
    "text": " How on earth did you learn all the maths and the physics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5268.06,
    "end": 5269.442,
    "text": "I'm just out of curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.662,
    "end": 5270.943,
    "text": "No, that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.524,
    "end": 5278.971,
    "text": "Yeah, so I did my bachelor's in kind of more cognitive neuroscience, doing a lot of EEG, psycholinguistic stuff, so not really math heavy at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5279.691,
    "end": 5287.078,
    "text": "And then in my last year of bachelor's, I took one computational neuroscience class at University of Pennsylvania.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.098,
    "end": 5288.88,
    "text": "It was Vijay Balasubramanian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.9,
    "end": 5290.161,
    "text": "He was the teacher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5290.242,
    "end": 5299.104,
    "text": " And it just really turned my mind not only to comp neuro, but then all the methods that you need to know to do proper computational neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.565,
    "end": 5302.773,
    "text": "And that kind of just opened the Pandora's box a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5303.375,
    "end": 5307.846,
    "text": "And then I did a two-year internship at the National Institute on Drug Abuse, and we were doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.826,
    "end": 5327.32,
    "text": " again like translational pre-clinical neuroscience working with rats and mice and just during the evenings during that that two-year stint i was taking all these like machine learning and computational neuroscience classes that at the time in like 2015 were still like free on coursera so like andrew ing's course jeff hinton's class",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5327.3,
    "end": 5331.264,
    "text": " And I, yeah, I just like had to teach myself a bunch of math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5331.985,
    "end": 5341.255,
    "text": "And it was annoying and hard, but I think it helps me catch up a lot to a point where I could then go and read Carl's papers and actually like kind of understand what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.676,
    "end": 5342.076,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5342.276,
    "end": 5344.959,
    "text": "But it was definitely a really long and like self-taught journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.4,
    "end": 5356.952,
    "text": "And because of that, I do have a lot of like foundational gaps in math that people like Lance DeCosto, like you can clearly tell by talking to him, he doesn't have those gaps because he has that proper education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5357.152,
    "end": 5360.458,
    "text": " Well, I'll tell you, there's one man with the biggest gap of them all, and that's me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5360.858,
    "end": 5363.002,
    "text": "So the PhD will be fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.583,
    "end": 5365.025,
    "text": "It'll be great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.045,
    "end": 5368.832,
    "text": "We'll be bootstrapping our way to some kind of mathematical adequacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.373,
    "end": 5371.837,
    "text": "Definitely wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.877,
    "end": 5372.438,
    "text": "Wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.578,
    "end": 5373.52,
    "text": "So much to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.562,
    "end": 5376.565,
    "text": "So many wonderful insights and great intuitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.826,
    "end": 5382.315,
    "text": "And yeah, it's just been an absolute pleasure on my part, and I'm sure everyone will benefit accordingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.295,
    "end": 5383.681,
    "text": " So yeah, it's been so nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5383.701,
    "end": 5385.047,
    "text": "Thanks for inviting me in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5385.087,
    "end": 5386.695,
    "text": "And it was really a pleasure talking to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5386.895,
    "end": 5387.498,
    "text": "It was wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.759,
    "end": 5389.467,
    "text": "Connor, thank you so, so much again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5390.09,
    "end": 5390.652,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]