[
  {
    "start": 7.523,
    "end": 37.21,
    "text": " hello welcome everyone it's january 29th 2025 we're in active inference guest stream 97.1 with dr matthew sims discussing acellular slime mold a jumping off point for exploring different notions of biological memory so thank you for joining looking forward to hearing more thanks so much hello welcome everyone it's january 20 2025 we're in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.478,
    "end": 80.819,
    "text": " Returning in one second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.9,
    "end": 81.28,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.729,
    "end": 90.41,
    "text": "We're back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.43,
    "end": 91.471,
    "text": "Like a slime mold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.172,
    "end": 92.673,
    "text": "Returning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.474,
    "end": 93.934,
    "text": "We're back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.234,
    "end": 97.238,
    "text": "Should I start or should we just go for it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.258,
    "end": 99.52,
    "text": "Yeah, begin from the beginning of the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.54,
    "end": 100.121,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.141,
    "end": 100.642,
    "text": "I can't hear you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.464,
    "end": 102.804,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.844,
    "end": 103.545,
    "text": "We're back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.605,
    "end": 104.786,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.806,
    "end": 105.587,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.607,
    "end": 107.99,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.43,
    "end": 109.131,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.039,
    "end": 119.61,
    "text": " Today I'm going to be looking at a couple of questions regarding Fusarium polycephalum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.776,
    "end": 121.459,
    "text": " which is acellular slime mold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.8,
    "end": 141.075,
    "text": "And I'm going to be looking at different notions of memory that have been thought about in the biological sciences, not necessarily in, for example, when you're thinking about large language models or when you're thinking about computational memory outside of biological systems, but biological memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.848,
    "end": 147.297,
    "text": " Fusarium polycephalum is a springboard, if you will, for thinking about things like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.357,
    "end": 157.233,
    "text": "Now, this organism, I'm going to get a little bit into its biology and a little bit into its complex life cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.754,
    "end": 163.063,
    "text": "And these are different things that I have researched.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.043,
    "end": 170.218,
    "text": " thought about in the kind of more recent book that I've published with Cambridge University Press called Slime Hold in Philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.16,
    "end": 180.36,
    "text": "And this particular talk that you'll see right now is going to be kind of an excerpt, if you will, from a couple of the chapters, namely chapter three of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.88,
    "end": 191.415,
    "text": " And looking at memory, I think it's a quite nice way to get an overall understanding of the importance of this system, this model system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.455,
    "end": 205.015,
    "text": "And it's a system that's becoming used more and more to investigate various questions in either cognitive science or in ecology or in philosophy biology or theoretical biology more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.995,
    "end": 227.998,
    "text": " Questions like biological individuality, for example, questions like the biological status of something like a dormant spore when we're thinking about living systems being systems that are more generally systems that are metabolically active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.367,
    "end": 232.732,
    "text": " So what does that mean if you have a form of life that's not metabolically active?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.752,
    "end": 245.166,
    "text": "And looking at the biology of something like a pizarum polycephalum or slime mold can really, I think it's very kind of instrumental into digging into these questions, more theoretical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.206,
    "end": 254.136,
    "text": "And also you can explore and expand upon these questions by generating hypotheses that can be really tested in an organism that's quite easy to culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.397,
    "end": 256.939,
    "text": "So this talk,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.543,
    "end": 260.306,
    "text": " is going to proceed as follows with that kind of background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.227,
    "end": 267.734,
    "text": "I'm going to look at what Physerum is, then I'm going to turn to a really, really, really beautiful experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.795,
    "end": 275.003,
    "text": "It's a very interesting and powerful experiment, well designed by Chris Reed and colleagues at Macquarie University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.763,
    "end": 279.788,
    "text": "They're still doing experiments with Physerum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.274,
    "end": 284.798,
    "text": " And this particular experiment is about kind of externalized memory in Pizarro.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.38,
    "end": 290.504,
    "text": "I'll look at that experiment, go through it, then I'll look at different forms of biological memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.326,
    "end": 299.873,
    "text": "And these different forms of biological memory, I'm going to cap it out at three or four different forms of biological memory and try to connect them all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.795,
    "end": 309.943,
    "text": "And then I'm going to ask a question regarding whether or not one or more of these forms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.126,
    "end": 318.791,
    "text": " biological memory requires an explanation using kind of cognitive theories or cognitive frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.975,
    "end": 322.161,
    "text": "And I'm going to answer that question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.597,
    "end": 325.281,
    "text": " using the notion of metabolic individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.321,
    "end": 329.627,
    "text": "Again, it's biological individuality which we'll get into during the talk also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.667,
    "end": 348.233,
    "text": "And so applying this particular type of criterion from biological individuality or metabolic individuality as a criterion, I'm going to be able to kind of rule out which levels of memory, depending upon the levels of biological organization that this memory happens in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.668,
    "end": 353.236,
    "text": " are the warranted targets of cognitive explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.739,
    "end": 358.325,
    "text": "So what's Physarum polycephalum?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.107,
    "end": 363.916,
    "text": "So Physarum polycephalum, it's the Latin name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.296,
    "end": 366.981,
    "text": "The genus is Physarum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.315,
    "end": 372.002,
    "text": " And polycephalum is the species name, the species add-on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.363,
    "end": 375.227,
    "text": "And that generally means many-headed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.828,
    "end": 384.762,
    "text": "And they say there's many-headed in the sense that the spore comes out of what looks like to be a many-headed fruiting body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.964,
    "end": 388.328,
    "text": "Generally, it's an acellular slime mold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.57,
    "end": 391.112,
    "text": "It's a protist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.177,
    "end": 396.241,
    "text": " a unicellular protist, and it has a very interesting complex life cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.321,
    "end": 420.542,
    "text": "And when I say complex life cycle, what I mean is that it has multifaceted in the sense that it has more than one vegetative stage, one than more stage where it actually has a form that reproduces and kind of forges, eats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.045,
    "end": 435.992,
    "text": " And this stage goes from a spore at number one, the spore actually germinates and out from the spore you have something called a biflagellate cell or a mixed amoeba cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.633,
    "end": 441.822,
    "text": "Now, a mixed amoeba comes out of the spore and germinates from the spore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.263,
    "end": 445.669,
    "text": "When there's less water in the environment, the biflagellate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.852,
    "end": 455.364,
    "text": " actually is something that is the kind of the flagella are going to be something that's synthesized when there's no water in the area when it germinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.265,
    "end": 461.852,
    "text": "Now, during a mixed amoeba stage, it can reproduce asexually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.892,
    "end": 468.4,
    "text": "So there are many, many different kind of clones, clone cells, and each of these have a single nucleus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.291,
    "end": 478.951,
    "text": " When it actually encounters another type, another mixed amoeba of the same type, not necessarily genetically the same, they can actually come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.051,
    "end": 483.28,
    "text": "And that's when you have a type of reproduction that occurs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.34,
    "end": 489.713,
    "text": "It's mitosis without actually cell separation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.283,
    "end": 518.721,
    "text": " so without cytokinesis and that's when you start having this particular growth of a cell and these are all this is all microscopic small single cells until this stage where the nuclei reproduce and it starts growing and becomes visible to the eye and this is becomes a plasmodial stage this plasmodial stage is the stage at which most of the experiments with physarum occur and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.275,
    "end": 531.789,
    "text": " It's a very interesting stage because at this stage, the fusarium, the cell, again, it's a single cell, multinucleate single cell, crawls over and locomotes over various surfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.891,
    "end": 535.934,
    "text": "And you can design experiments watching this particular type of locomotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.356,
    "end": 540.119,
    "text": "Now, again, I talked about the vegetative stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.641,
    "end": 544.925,
    "text": "I've said pretty much this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.045,
    "end": 547.948,
    "text": "During this vegetative stage,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.553,
    "end": 554.87,
    "text": " posarum during this plasmodial stage, it's going to consume bacteria, fungi, and decaying organic matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.97,
    "end": 565.397,
    "text": "And again, here you have a picture from one of my lab experiments of posarum just locomoting and covering oats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.626,
    "end": 578.418,
    "text": " During this plasmodial stage or the vegetative stage, one of its vegetative stages, there's again many experiments that have shown interesting types of capacities that it displays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.799,
    "end": 592.532,
    "text": "It's been shown to kind of solve the shortest path problem, engage in habituation, which is a type of learning, very simple type of learning, anticipate periodic environmental conditions, hot bursts of air,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.255,
    "end": 601.587,
    "text": " a bribe versus error, excuse me, and make flexible behavioral decisions that are based upon comparative evaluation rules rather than absolute evaluation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.568,
    "end": 619.372,
    "text": "And this is just, you know, a very, very kind of brief summary of the various experiments that have been, that Physerum has been used with to engage in questions regarding things like learning, things like decision-making, and there are many more experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.273,
    "end": 623.177,
    "text": "But you get a kind of representation of what this might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.541,
    "end": 638.065,
    "text": " Now let's move on with that kind of brief understanding of what the life cycle of azerom is and focusing upon this particular type of vegetative stage, the plasmodial stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.267,
    "end": 649.705,
    "text": "We can start thinking about one experiment in particular, the experiment by Chris Reid and his lab over at Macquarie in 2012.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.647,
    "end": 659.239,
    "text": " You'll see a particular picture here of Hansel and Gretel, and I hope to make this clear why I'm showing this to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.103,
    "end": 671.496,
    "text": "So when it locomotes over surfaces, it leaves an extracellular slime trace or slime trail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.237,
    "end": 673.559,
    "text": "I'll refer to this as ES.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.12,
    "end": 676.283,
    "text": "Now ES is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.938,
    "end": 690.059,
    "text": " It's a polymucous saccharide, and this mucus makes it easier for pfizerum to actually locomote, but it serves many, many functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.381,
    "end": 704.802,
    "text": "And it's been well known in the literature since the 50s that wherever pfizerum, wherever it navigates, wherever it locomotes, it leaves this trail behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.777,
    "end": 719.76,
    "text": " So one question that has risen and a question that is kind of the crux of the experiment for Reid et al is whether or not Physerum uses this extracellular slime to navigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.601,
    "end": 730.958,
    "text": "So the reason why they can ask this question is it's been observed that Physerum avoid their own extracellular slime trails and the extracellular slime trails of others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.765,
    "end": 751.427,
    "text": " Now, if it's used as a type of externalized spatial memory, avoiding expending energy unnecessarily to revisit patches of food, again, food is being bacteria, food being fungus and other types of microorganisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.88,
    "end": 763.225,
    "text": " If you can use that to avoid previously forged patches, then this becomes an interesting type of relationship with a particular type of mucopolysaccharide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.728,
    "end": 769.158,
    "text": "And so to test this, they have a couple conditions, two conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.0,
    "end": 771.964,
    "text": "So they have an agar plate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.231,
    "end": 784.425,
    "text": " And this agar plate is, the conditions are exactly the same, except for one agar, one plate of agar is covered with extracellular slime, the other isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.046,
    "end": 790.472,
    "text": "The covered plate is called the coated condition and the blank, that is the blank condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.933,
    "end": 795.718,
    "text": "They set a U-shaped acetate trap on this particular plate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.559,
    "end": 801.445,
    "text": "And the whole idea is to put fusarium, as you see in a starred zone,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.425,
    "end": 806.412,
    "text": " and put a goal, which is going to be a drop of highly concentrated glucose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 807.554,
    "end": 809.236,
    "text": "And that goal is food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.117,
    "end": 826.521,
    "text": "So if Fusarium is going to actually use extracellular slime to navigate and to avoid navigating in areas on the agar that it's already navigated on, the hypothesis is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.041,
    "end": 830.488,
    "text": " in the coded condition, it's going to take a lot longer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.508,
    "end": 831.57,
    "text": "And that's exactly what they found.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.65,
    "end": 835.598,
    "text": "It took about 10 times the time, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.678,
    "end": 840.227,
    "text": "It was 10 times greater in the coded condition than the non-coded condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.472,
    "end": 848.003,
    "text": "So to come back to this idea, and here you have kind of the Hans Gretel element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.607,
    "end": 853.017,
    "text": " as Reed and Al kind of make the following conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.378,
    "end": 866.329,
    "text": "They said, the results of this study provide a unique demonstration of spatial memory systems and non-neuronal organisms, supporting the theory that an externalized spatial memory may be the functional precursor of an internal memory of higher organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.203,
    "end": 880.325,
    "text": " I think this is quite interesting, but two hypotheses, obviously, and I think one can safely ignore one of the hypotheses and concentrate on the kind of formal hypothesis about an externalized spatial memory system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.968,
    "end": 888.118,
    "text": "Whether or not that system was a precursor to internalized memory, that's something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.001,
    "end": 890.342,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.28,
    "end": 908.415,
    "text": " In this particular type of conclusion, based upon this experiment, memory processes have been, and this externalized memory process has been interpreted as a particular type of cognitive process, albeit one that extends into the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.017,
    "end": 911.402,
    "text": "Now, is that strange?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.277,
    "end": 913.462,
    "text": " May, yeah, sure, why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.205,
    "end": 922.32,
    "text": "It is strange, but really, I think there's a lot of, at least for the last 20 to 30 years, there's been a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.638,
    "end": 932.628,
    "text": " a lot of research done and focused upon the idea of what's called the hypothesis of extended mind, the hypothesis of extended cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.27,
    "end": 939.215,
    "text": "And my PhD supervisor, Andy Clark, he was very instrumental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.275,
    "end": 942.519,
    "text": "Him and Dave Chalmers were very instrumental in kind of putting that out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.539,
    "end": 949.506,
    "text": "I think that sometimes cognition can be scaffolded by external elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.836,
    "end": 954.34,
    "text": " And I think that's fine, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.201,
    "end": 962.269,
    "text": "If we take that assumption on board, it shouldn't really matter whether or not it's on the outside or on the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.53,
    "end": 964.792,
    "text": "But we'll come back to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.293,
    "end": 972.321,
    "text": "So now I want to think about, in order to actually really move on to the question, is this really memory, though?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.33,
    "end": 978.447,
    "text": " which is a more fundamental question, to think about what memory is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.467,
    "end": 986.614,
    "text": "So I'm taking a definition or a characterization, as I like to call it, a rough characterization from Francis C. Kaluski and Michael Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.881,
    "end": 992.389,
    "text": " And Mike and Fantizek look at memory as follows in one of the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.79,
    "end": 1004.147,
    "text": "They say it's experience-dependent modification of internal structure in a stimulus-specific manner that alters the way the system is going to respond to a stimulus in the future as a function of its past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.802,
    "end": 1010.948,
    "text": " Now, I think a couple of things stand out in this particular type of characterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.968,
    "end": 1014.492,
    "text": "One is that it's stimulus-specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.113,
    "end": 1019.157,
    "text": "So breaking a bone, for example, is not going to count as a memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.637,
    "end": 1027.025,
    "text": "There are many ways to break a bone, and breaking a bone is not going to necessarily be dependent upon one type of stimulus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.706,
    "end": 1031.89,
    "text": "So that's a very important element of this definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.87,
    "end": 1037.637,
    "text": " Another important element which I'm pushing back on is the idea that it has to be a modification of internal structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.099,
    "end": 1051.794,
    "text": "Again, if we take the hypothesis of extended cognition seriously, there's no reason to be dependent upon this assumption about internal structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.755,
    "end": 1054.097,
    "text": "Sometimes it extends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.752,
    "end": 1056.961,
    "text": " And that's an assumption that I'm willing to take on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.402,
    "end": 1065.775,
    "text": "Maybe some people won't, but that's something I'm definitely willing to take on, depending upon the functional analysis of what's going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.02,
    "end": 1079.392,
    "text": " Now, putting this into place, you have a different type of characterization, so I think you can add external structure here, internal structure or external structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.193,
    "end": 1093.146,
    "text": "And one important thing also about Levin's, Belusco and Levin's characterization, when they bring this up, they have a footnote which says, you know, memory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.122,
    "end": 1103.838,
    "text": " is going to be outstripped in terms of that memory that's necessarily associated with cognition, necessarily associated with intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.858,
    "end": 1111.35,
    "text": "So there's going to be many more types of memory than those that are necessarily associated with intelligence or cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.37,
    "end": 1112.031,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.332,
    "end": 1114.375,
    "text": "That's what we're gonna get into next, I suppose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.165,
    "end": 1130.94,
    "text": " So you have different forms of biological memory that the ones that I'm going to look over right now for this presentation is these are going to be dependent upon different levels of biological organization, different timescales and biological levels of organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.961,
    "end": 1141.17,
    "text": "Now, one is going to be cellular memory, which are individual cells, somatic cells, for example, immunological memory, networks of cells and molecules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.19,
    "end": 1143.332,
    "text": "So you're getting larger and larger timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.717,
    "end": 1150.97,
    "text": " individual organisms, and then collective memory on a collective scale, a group of organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.49,
    "end": 1155.858,
    "text": "Necessarily, I'm going to look at the notion of kind of colonial memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.044,
    "end": 1160.987,
    "text": "So what's cellular memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.229,
    "end": 1165.675,
    "text": "In a nutshell, which I'm sure many of you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.566,
    "end": 1176.154,
    "text": " Cellular memory is going to describe how various pluripotent cells, you know, stem cells differentiate into different types of cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.607,
    "end": 1182.776,
    "text": " And stem cells themselves, after they start actually differentiating, those cells reproduce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.857,
    "end": 1189.525,
    "text": "And as they reproduce, they don't go back to stem cells and then turn back into, for example, a fat cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.507,
    "end": 1191.768,
    "text": "Fat cells produce fat cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.788,
    "end": 1198.558,
    "text": "So there's some type of way that cells maintain the cellular type over mitosis or cellular division.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.059,
    "end": 1202.884,
    "text": "And this is what cellular memory can be understood as.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.383,
    "end": 1220.367,
    "text": " One of the ways that this occurs, one of the mechanisms underlying this, again, I hope this is not too simplified for everyone, but I think it's kind of an important thing to talk about anyway, is through epigenetic modification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.482,
    "end": 1238.066,
    "text": " And this is one of the ways that epigenetic markers and epigenetic mechanisms were introduced biologically, was looking through or trying to understand the question as to how differentiated cells remain differentiated over time during development, during ontogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.788,
    "end": 1248.48,
    "text": "And these epigenetic mechanisms, there are many of them, but a couple of the ones that I have here, just kind of examples of histone modification,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.388,
    "end": 1262.722,
    "text": " where you have an octamer of histones that are going to be wrapped by a particular type of kind of strand of DNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.983,
    "end": 1275.615,
    "text": "Histones are going to make up, these histones are going to make up the chromatin and going to make up, they're going to make up the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.435,
    "end": 1305.805,
    "text": " the larger the larger groupings of cells sorry sorry the larger groupings of kind of dna um and when his stone is actually wrapped very tightly when the dna is wrapped very tightly around his stone it's it can be accessed for the uh for transcription so what that means uh you have some uh the brakes are put on to transcription so the brakes are put on uh in terms of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.527,
    "end": 1310.474,
    "text": " genetic processing, which is okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.955,
    "end": 1313.599,
    "text": "So that acts in and of itself as a type of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.619,
    "end": 1320.471,
    "text": "And if one is very interested in this, one can look into the work of kind of, yeah, you say Yablanca and Avia Yablanca and Marion Lam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.972,
    "end": 1326.662,
    "text": "They've done incredible research on this philosophically and biologically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.283,
    "end": 1338.48,
    "text": " But this is one of the things that kind of, in a nutshell, explains the way that a cell actually, when it differentiates, remains the same type of cell as the same type of cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.52,
    "end": 1343.407,
    "text": "Now, you have histone modification, chromatin marking, RNA interference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.747,
    "end": 1350.397,
    "text": "There are many different types of epigenetic mechanisms that can be used, but this is just an overview, a very quick and accurate overview probably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.14,
    "end": 1354.303,
    "text": "Moving on to the immune system memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.127,
    "end": 1361.238,
    "text": " Now, I think immunistic Castro says it best, so I'm going to read this out for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.259,
    "end": 1369.292,
    "text": "Our immune system is composed of a huge number of cells presenting receptors on their surfaces, transmembrane receptors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.193,
    "end": 1379.329,
    "text": "These receptors are responsible for binding with portions of pathogens known as antigens and signaling other immune cells to eliminate the marked or recognized pathogens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.22,
    "end": 1388.453,
    "text": " Now, the invading pathogens replicate themselves inside our bodies, thus increasing the amount of damage being caused to our organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.555,
    "end": 1397.447,
    "text": "One way the immune system evolved to fight against infection was by replicating our immune cells as to cope with the replicating pathogen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.188,
    "end": 1400.632,
    "text": "But the replication of immune cells is not perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.992,
    "end": 1402.735,
    "text": "You have errors, you have mutations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.153,
    "end": 1410.721,
    "text": " Now errors occur with a rate proportional to the quality of recognition between immune receptors and the pathogen recognized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.522,
    "end": 1422.613,
    "text": "Those mutated cells with high affinity with the pathogen, high affinity means that they have, in terms of their shape, they fit together well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.994,
    "end": 1426.557,
    "text": "They're selected, maintained in a repertoire called memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.32,
    "end": 1431.422,
    "text": "So to just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.723,
    "end": 1432.905,
    "text": " illustrate this very quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.925,
    "end": 1446.413,
    "text": "You have certain cells with transmembrane receptors, which are kind of represented by these different shapes coming off these circles, these cells, and they're going to fit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.433,
    "end": 1452.465,
    "text": "They're going to have kind of better recognition with some of the foreign antigens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.222,
    "end": 1463.196,
    "text": " the ones that are better recognized, and again, they're going to be the ones that are put into a particular type of reservoir.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.857,
    "end": 1476.574,
    "text": "And they mutate, and the mutation ends up actually making transmembrane cell receptors, or transmembrane receptors that are going to actually fit even better with the pathogens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.115,
    "end": 1483.043,
    "text": "And they're put in the kind of, again, this repertoire of memory, cell memory, or immunological memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.959,
    "end": 1496.848,
    "text": " Organismal memory is the thing that everyone typically thinks about, particularly from the perspective of psychology, comparative psychology, cognitive science, or even modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.888,
    "end": 1500.778,
    "text": "And this is just answering the question of how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.079,
    "end": 1507.185,
    "text": " an organism adapts to, via changing experiences, adapts to a changing world over the lifetime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.025,
    "end": 1512.709,
    "text": "And again, it's over the lifetime that has to be put forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.57,
    "end": 1529.905,
    "text": "The idea that something like organismal memory occurs typically, it's going to occur typically over ontogenesis, over a long trajectory of development, from birth to death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.982,
    "end": 1556.635,
    "text": " The particular type of paradigmatic way of looking at memory and looking at learning also, I suppose, people start looking at this, or scientists have started looking at it in Metazoa, just because cognitive science, which is a very still, young science, piggybacking off of psychology, has started with humans and then thinking about other types of closely related animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.615,
    "end": 1560.34,
    "text": " But now things are obviously changing a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.421,
    "end": 1566.169,
    "text": "People are asking questions, as Chris Reid has asked questions about memory and Physerum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.89,
    "end": 1568.572,
    "text": "But this is just a little bit of the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.612,
    "end": 1582.032,
    "text": "And I'm not going to say too much about organismal memory because I think this comes quite intuitively given the particular type of, you know, our approach to memory and cognitive science already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.024,
    "end": 1610.23,
    "text": " memory one thing that should be said also is that typically it's going to be associated with learning so learning is the way that memories are encoded typically but this is something that we can come back to later which i think is interesting particularly with vasara but with other organisms such as a plicia now collective memory the last type of memory i want to talk about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.205,
    "end": 1624.699,
    "text": " This refers to how history-dependent, self-organizing behavior of a group of organisms becomes stabilized at the level of the collective rather than at the level of the individual that makes up that collective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.96,
    "end": 1633.548,
    "text": "And a lot of the research that has been done on collective memory is the work on colonial memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.188,
    "end": 1638.613,
    "text": "Ant colonies, for example, or termite colonies, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.167,
    "end": 1652.467,
    "text": " these types of insects that use pheromones as a manner of navigating a particular type of spatial environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.211,
    "end": 1662.222,
    "text": "Now, Deborah Gordon, she is a fantastic zoologist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.13,
    "end": 1670.157,
    "text": " And she was at Oxford for a while, and a lot of Deborah Gordon's work was with ants, looking at ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.177,
    "end": 1677.844,
    "text": "And she's done some pretty incredible research kind of looking at ant collectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.805,
    "end": 1679.946,
    "text": "And this is something that she writes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.327,
    "end": 1691.297,
    "text": "A Redwood ant, a colony of Redwood ants, remembers its trail system leading to the same trees year after year, although no single ant does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.914,
    "end": 1701.076,
    "text": " In the forest of Europe, they forage high in trees and feed on excretions of aphids, another type of small insect, that in turn feeds on the tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.078,
    "end": 1709.117,
    "text": "Now, their nests are enormous mounds of pine needles situated in the same place for decades, occupied by many generations of colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.228,
    "end": 1714.857,
    "text": " These colonies, I can just interject here, some of these colonies last a very long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.498,
    "end": 1720.668,
    "text": "They have very long lifespans, the colony it does, and the colony outlasts the individual ant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.269,
    "end": 1726.178,
    "text": "So each ant tends to take the same trail every day,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.985,
    "end": 1729.388,
    "text": " day after day to the same tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.028,
    "end": 1745.886,
    "text": "During the long winters, the ants huddled together under the snow, and the Finnish myrmecologist Rainer Rosegarten showed that when ants emerge in the spring, an older ant goes out with a younger ant along that older ant's habitual trail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.487,
    "end": 1752.233,
    "text": "The older ant dies, and then the younger ant adopts that trail as its own, leading the group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.854,
    "end": 1757.279,
    "text": " leading the colony to remember or reproduce the previous year's trails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.699,
    "end": 1769.512,
    "text": "So you have this particular type of connection between nodes, if you will, connecting the memories from one generation to the next year after year of the entire colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.353,
    "end": 1775.518,
    "text": "So it's a kind of diachronic connection, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.741,
    "end": 1781.865,
    "text": "So after going through all of those notions of memory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.2,
    "end": 1795.011,
    "text": " I hope that's clear that the different types of memory that are occurring at different temporal and spatial scales, and those temporal spatial scales can be demarcated by different levels of biological organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.292,
    "end": 1809.103,
    "text": "Now we can ask the question, which one of these, or which of these should I say, are going to be subject to cognitive explanation as a cognitive process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.203,
    "end": 1811.565,
    "text": "Now, when I say subject to cognitive explanation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.013,
    "end": 1814.716,
    "text": " I want to make this clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.776,
    "end": 1830.06,
    "text": "I'm asking the question of which of these particular types of memory systems or exhibitions of memory that we should be able to use cognitive theories and cognitive frameworks to try to explore and understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.682,
    "end": 1855.255,
    "text": " This is not just, for example, using a cognitive theory with scare probes, it's not an as-if explanation, it's not using the intentional stance, but it's actually using cognitive theories to think about these and identify these mechanisms and the functional placement of these particular types of memory systems as cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.348,
    "end": 1861.497,
    "text": " So right away, I think it's quite obvious that we do this with organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.557,
    "end": 1874.059,
    "text": "That's going to be the paradigmatic level of biological organization at which we ask these questions, which we apply our cognitive theories to, our cognitive frameworks to, in a non-instrumental way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.301,
    "end": 1876.643,
    "text": "But what about cellular memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.683,
    "end": 1877.966,
    "text": "What about immune system memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.986,
    "end": 1881.732,
    "text": "What about collective memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.614,
    "end": 1886.296,
    "text": " Again, we do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.697,
    "end": 1896.587,
    "text": "How are we going to get, and the question that I'll ask now is how are we going to get any type of, how are we going to explore this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.288,
    "end": 1900.351,
    "text": "Because I think it's an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.391,
    "end": 1908.259,
    "text": "We can make some assumptions and just say that perhaps there's similar principles running through all of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.678,
    "end": 1919.097,
    "text": " Given this particular definition or characterization of memory from Frantisek Beluska and Mike Levin, they all count as memory, so why not apply all cognitive theories to them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.578,
    "end": 1927.733,
    "text": "I think that can lead us into some difficult territory, and if we do this, Anon's a block to play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.253,
    "end": 1947.358,
    "text": " And so I want to look at now and introduce a particular type of way of thinking about this that's going, we can kind of ring a particular type of criterion, a rough criterion out for thinking about which of these biological organizational levels really are warranted for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.46,
    "end": 1957.011,
    "text": "Now, warranted to explain in terms of cognitive explanations or warranted targets for our cognitive explanations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.037,
    "end": 1964.989,
    "text": " One clue here is it's going to come from this particular kind of passage from Pamela Lyon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.029,
    "end": 1981.176,
    "text": "And she writes using actually I should I should I should say something about this, this particular kind of definition that she offers, I'll get a characterization that can be changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.375,
    "end": 1990.365,
    "text": " she's offering something that is very much influenced by Sarah Shuttleworth, who's a cognitive ecologist or cognitive ethologist, excuse me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.507,
    "end": 2003.781,
    "text": "And this particular definition is, or characterization is quite, I think it's, again, it's general, but it's general enough to do some work, specific enough to do some work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2003.801,
    "end": 2008.446,
    "text": "So cognition here comprises the sensory and other information processing mechanisms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.966,
    "end": 2018.88,
    "text": " An organism has for becoming familiar with valuing and interacting productively with features of its environment, exploring, exploiting, invading in order to meet its existential needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.02,
    "end": 2024.188,
    "text": "Now, these are going to be the most basic, which are survival, persistence, growth, thriving and reproduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.07,
    "end": 2031.598,
    "text": "Now, if we concentrate on that, the existential needs and saying this is fundamental to cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.975,
    "end": 2040.427,
    "text": " We'll have various philosophers, various biologists, various kinds of scientists who will back this up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.408,
    "end": 2058.058,
    "text": "Maturana and Varela are kind of the obvious ones, people coming from the kind of autopoetic frameworks, the autopoetic theory, people coming from the organizational biology theories, for example, people coming from, like Hans Jonas, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.511,
    "end": 2063.717,
    "text": " who thinks that metabolism is the basis of meaningful behavior, any type of self-concern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.778,
    "end": 2075.77,
    "text": "So any entity that has its own metabolic machinery is therefore, this is going to be central to the entities having capacities that are going to be subject to cognitive explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.952,
    "end": 2085.942,
    "text": "Another person, a philosopher that's out there also, who really emphasizes kind of metabolism and how it kind of shades into cognition is someone like Peter Godfrey Smith.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.544,
    "end": 2087.944,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.342,
    "end": 2097.514,
    "text": " one way to think about metabolism is through the lens of what's called a metabolic individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.037,
    "end": 2109.392,
    "text": "And this is under the kind of, under the larger or more general type of kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.727,
    "end": 2116.475,
    "text": " a philosophical framework, I suppose, in biology, thinking about what biological individuals are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.336,
    "end": 2121.44,
    "text": "And this is a question that's come up for many, many, many years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.561,
    "end": 2136.898,
    "text": "And one of the, I think, fundamental books about this was written by Julian Huxley, Thomas Huxley, his grandson, and produced and released in 1912.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.283,
    "end": 2154.931,
    "text": " And it's quite interesting, Charles Darwin wrote a bit also about the biological individual, but it wasn't until I think Julian Huxley's book that a lot of, and he wrote this when he was quite young, I think he was 27, many interesting questions came out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.951,
    "end": 2160.76,
    "text": "He had a very interesting, a keen, a sharp perspective on what the notion of biological individuality is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.094,
    "end": 2162.838,
    "text": " Now, what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.958,
    "end": 2167.008,
    "text": "It means we're asking a question about what a biological individual is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.048,
    "end": 2178.715,
    "text": "We want to provide an account of what in the biological world constitutes accountable and relatively well-delineated cohesive unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.078,
    "end": 2183.583,
    "text": " So there's two ways to go about this, two general ways to go about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.723,
    "end": 2186.166,
    "text": "There's more than two ways, but I'll just concentrate on two ways here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.226,
    "end": 2191.153,
    "text": "You can think about Darwinian individuals, which are going to be units of reproduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.173,
    "end": 2209.258,
    "text": "These are going to be any type of units that are capable of undergoing Darwinian natural selection, which means they have to meet three criteria, those three criteria that Avantin was expressed as variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.492,
    "end": 2213.74,
    "text": " or a heritable variation and selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.101,
    "end": 2218.188,
    "text": "So it has to meet these criteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.208,
    "end": 2231.112,
    "text": "So you have things like genes, that could be a Darwinian individual, or chromosomes, that could be a Darwinian individual, because these are, or memes, ideas, these are things that can undergo Darwinian natural selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.446,
    "end": 2232.167,
    "text": " These are units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.768,
    "end": 2244.068,
    "text": "However, there's another type of biological individual that you typically find when theorizing about various biological processes, various biological phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.069,
    "end": 2247.934,
    "text": "And this is going to be the metabolic individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.016,
    "end": 2254.686,
    "text": "It's going to be a unit of function that has it, and this unit's going to have its own metabolic machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.573,
    "end": 2261.182,
    "text": " So let's look now just a little bit more at metabolic individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2261.222,
    "end": 2269.016,
    "text": "I think you can understand how this comes apart from Darwinian individuals, and I'll try to make this more explicit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.036,
    "end": 2280.437,
    "text": "So according to Peter Godfrey Smith, metabolic individuals are systems comprised of diverse parts which work together to maintain the system structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.852,
    "end": 2288.823,
    "text": " despite the turnover of material, by making use of sources of energy and other resources from their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.025,
    "end": 2293.711,
    "text": "Now, diverse parts, that should stand out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2294.272,
    "end": 2298.458,
    "text": "They're going to have some type of cohesion that maintain the structure of a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.221,
    "end": 2305.75,
    "text": "They're going to be essentially persisters for things that actually serve their own self-maintenance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.725,
    "end": 2307.427,
    "text": " over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.31,
    "end": 2319.283,
    "text": "Things that use energy to resist the forces of decay to reinforce entropy, only contingently things that reproduce so that metabolic individual does not have to be a Darwinian individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.462,
    "end": 2321.343,
    "text": " That's quite important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.363,
    "end": 2325.008,
    "text": "So you'll have certain types of Darwinian individuals, again, a gene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.77,
    "end": 2327.452,
    "text": "A gene is not a metabolic individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.472,
    "end": 2330.236,
    "text": "A gene does not have its own kind of metabolic machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.256,
    "end": 2332.319,
    "text": "A gene is not a persister.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.739,
    "end": 2338.267,
    "text": "It doesn't engage in the types of behaviors or activities that keeps itself going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.372,
    "end": 2348.562,
    "text": "And metabolic individuality is a quite important concept when it comes to thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.605,
    "end": 2351.287,
    "text": " transitions in the individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.208,
    "end": 2359.215,
    "text": "But this notion is something for the many of you probably know about this, but it's a notion, or it comes from theoretical biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.755,
    "end": 2374.33,
    "text": "It's based upon, loosely based upon and veers from the major transitions in evolution that were kind of formalized by John Maynard Smith and Errol Seth Murray.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.9,
    "end": 2388.178,
    "text": " And the idea about major transitions and individuality, we're thinking about how one level of biological organization reaches the next level of biological organization over evolutionary time scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.139,
    "end": 2397.33,
    "text": "And an example of this might be, for example, an example for this would be going from a prokaryote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.002,
    "end": 2400.247,
    "text": " to a eukaryotic cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.668,
    "end": 2410.51,
    "text": "The evolution from a prokaryotic to a eukaryotic cell, or the evolution from a eukaryotic cell, a single-celled eukaryote, to a multi-celled eukaryote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.232,
    "end": 2415.999,
    "text": " And those particular types of transitions are quite important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.52,
    "end": 2424.01,
    "text": "And a lot of biological theories are focused upon understanding how those transitions occurred over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.17,
    "end": 2426.173,
    "text": "What were the circumstances under which they occurred?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.193,
    "end": 2426.954,
    "text": "Did they occur once?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.015,
    "end": 2428.256,
    "text": "Did they occur multiple times?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.158,
    "end": 2429.979,
    "text": "And many different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.361,
    "end": 2437.83,
    "text": "So metabolic individuality is interesting when thinking about eukaryogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.587,
    "end": 2456.933,
    "text": " which is how do you go from a single-celled prokaryotic organism to a eukaryotic organism with a nucleus, with various kind of cellular parts like a chloroplast or a mitochondria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.571,
    "end": 2461.681,
    "text": " And the idea here is that there's some type of metabolic integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.761,
    "end": 2475.394,
    "text": "Most of the theories that are thinking about kind of eukaryogenesis think about this in terms of a metabolic integration or two cells, whether it's going to be a bacteria, an alpha bacteria, and some type of archaea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.374,
    "end": 2477.337,
    "text": " are going to come together in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.737,
    "end": 2490.614,
    "text": "It's going to either be by, you know, there are different various theories, one doesn't have to be committed to the theory, but looking at this particular type of illustration, you have some type of phagocytosis that's occurring from a larger cell to the smaller cell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.797,
    "end": 2503.17,
    "text": "When that happens, there's a, depending upon the natures of those two different types of cells, the inner alpha bacteria",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.42,
    "end": 2527.907,
    "text": " and the outer, what do they say, going to be an archaean, depending upon that kind of relationship, they could enter into some type of symbiotic relationship such that the output of that endosymbiont, if you will, is something that's metabolically useful for its external environment, which is another cell, and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.948,
    "end": 2533.393,
    "text": "And so this nestedness of one metabolic individual in another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.93,
    "end": 2550.629,
    "text": " after time is going to evolve into a single individual where those two individuals, those two entities that were at one point in time separate are now so closely knit metabolically that they're one type of individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.669,
    "end": 2554.113,
    "text": "So you have this idea that metabolic individuals can be nested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.254,
    "end": 2559.499,
    "text": "And that's a quite important idea here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.492,
    "end": 2563.796,
    "text": " Metabolic individualities are going to come in degrees also for this reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.06,
    "end": 2574.128,
    "text": "So how might the notion of metabolic individuality hint at what cognitive explanations of memory might get the most purchase?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.389,
    "end": 2576.491,
    "text": "I want to argue the following.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.592,
    "end": 2589.486,
    "text": "If metabolic individuals are first and foremost persisters, and such self-maintenance is to be the fundamental background against which all cognitive capacities might be thought to arise, again, this is an assumption,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.787,
    "end": 2603.104,
    "text": " then the kind of memory, learning, decision-making, anticipation for that matter that warrants possible cognitive explanation qua cognitive process is going to be the one that arises at the level of the metabolic individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.367,
    "end": 2606.73,
    "text": " Now, this automatically rules out genes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.471,
    "end": 2623.613,
    "text": "When we talk about gene learning or, say, gene regulatory systems that are going to actually be engaged in something like associative learning or conditioning, which there's some research that shows this, I think we can say, sure, genes do learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.793,
    "end": 2633.766,
    "text": "But if that's the case, if gene regulatory networks are not metabolic individuals themselves, I think this is a kind of a misclassification, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.472,
    "end": 2642.767,
    "text": " And because gene regulatory networks work within a metabolic individual, they're not the metabolic individual itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.43,
    "end": 2648.877,
    "text": "Viruses, for example, viruses are dependent upon their host for the metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.218,
    "end": 2653.085,
    "text": "So these things are not going to, these types of entities are not going to be metabolic individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.147,
    "end": 2659.416,
    "text": "And I think we kind of have a basis for thinking about this, given the assumption",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.396,
    "end": 2682.518,
    "text": " that you know uh metabolic individuals are persisters and that cognition first and foremost is going to function directly for the entity in which that those particular kind of capacities are working for is going to function directly for the self-maintenance of that individual so since metabolic individuality comes in degrees",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.32,
    "end": 2686.323,
    "text": " an interesting kind of question arises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.005,
    "end": 2693.776,
    "text": "So how much metabolic individuality is going to be required to warrant memory being subject to cognitive explanation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.816,
    "end": 2694.638,
    "text": "How much is too little?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.678,
    "end": 2703.493,
    "text": "Again, if you remember the idea that I just said recently, the idea I just brought, that you can have cells within cells,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.727,
    "end": 2717.824,
    "text": " You have a mitochondrion, which actually has remnants of its own DNA right now within any type of somatic cell and somatic cells within organs and organs within organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2718.265,
    "end": 2725.093,
    "text": "How do we actually think about degrees of metabolic individuality in this sense that's non-arbitrary?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.44,
    "end": 2752.887,
    "text": " So I want to argue that even if some entity qualifies as a marginal metabolic individual, the fact that it's part of a larger system which even has a higher rank of metabolic individuality suggests that the behavior of the organizational level that's the highest degree of relative metabolic individuality is going to be subject to the explanation of cognitive memory or learning or decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.575,
    "end": 2772.156,
    "text": " So the highest degree of metabolic individuality in a nested group, a nested system, is going to require actual applications of cognitive theories and cognitive frameworks in a way that's not instrumental or just taking the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.281,
    "end": 2778.503,
    "text": "So we can return to each of these forms of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.63,
    "end": 2784.875,
    "text": " And think about applying this particular type of question, applying this particular type of criteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.977,
    "end": 2787.698,
    "text": "So we already talked about organismal memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.718,
    "end": 2793.725,
    "text": "And I think if this is the case, then we can tick that off, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.785,
    "end": 2807.359,
    "text": "Organisms are going to have the highest relative degree of metabolic individuality of their organizational levels, of all of the levels that they actually are composed of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.778,
    "end": 2818.909,
    "text": " And this is going to be good news to the notion of asking whether or not, say, Physarum's externalized memory counts as actual memory, that we should be applying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.529,
    "end": 2834.123,
    "text": "We can be asking whether or not that type of memory, if it's navigational memory, whether it satisfies various types of conditions that people thinking about navigational memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.103,
    "end": 2840.913,
    "text": " would need to apply to it to understand its function, to understand the mechanisms behind it better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.095,
    "end": 2843.136,
    "text": "What about cellular memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.019,
    "end": 2849.726,
    "text": "I want to argue that somatic cells, they have their own metabolic machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.766,
    "end": 2852.23,
    "text": "I think that's quite obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.632,
    "end": 2870.87,
    "text": " and thus they're metabolic individuals, you know, they metabolize and they have means to metabolize, but relative to the metabolic individuality of the encompassing biological levels at which you find somatic cells, they're quite low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.832,
    "end": 2879.078,
    "text": "Their survival is dependent obviously upon their environment, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.429,
    "end": 2908.255,
    "text": " the metabolic individuality and this is where you get the kind of marginal metabolic individuality of kind of somatic cells uh their maintenance is something that is directed towards the maintenance of the system of which they're a part so when you get when you have when you have you know somatic cells or groups of somatic cells uh whose maintenance is reshifted towards their own existence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.471,
    "end": 2910.153,
    "text": " you start having certain things like tumors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.815,
    "end": 2915.64,
    "text": "And this is like metastasis, things of that nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.66,
    "end": 2923.109,
    "text": "And I think this is kind of turning against, you have a kind of turning against the system of which they're a part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.229,
    "end": 2926.673,
    "text": "They start using that system and metabolizing that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.634,
    "end": 2929.357,
    "text": "They become decoupled from that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.397,
    "end": 2932.2,
    "text": "Another way to think about this is in terms of autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.94,
    "end": 2942.97,
    "text": " When a cell has too much autonomy, when it regains its autonomy from the system of which it's a part, a somatic cell, that cell actually becomes deleterious for the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.291,
    "end": 2945.893,
    "text": "So it's not controlled by the system anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.933,
    "end": 2953.16,
    "text": "So I would like to say that something like cellular memory, we can use the intentional stance to talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.36,
    "end": 2960.567,
    "text": "Maybe that'll get us somewhere, but I think to use something non-instrumentally is actually a conflation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.75,
    "end": 2977.684,
    "text": " given what, again, given what the different types of transitions and individuality that have occurred over evolutionary timescales have led to, the dependencies upon these different types of organizational levels and differences in autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.005,
    "end": 2986.572,
    "text": "So no, I don't believe that's the case, that cellular memory should be targeted with cognitive theories in any non-instrumental way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.653,
    "end": 2990.335,
    "text": "Immune system memory, I think, is the same thing, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.787,
    "end": 2997.437,
    "text": " The cells of an immune system, they have their own metabolic machinery and a certain degree of metabolic autonomy, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.542,
    "end": 3013.181,
    "text": "Long-term functioning of metabolic processes and persistence of the network of immune-specific cells and molecules that make up an immune system are going to be dependent upon their functional integration within the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.083,
    "end": 3016.947,
    "text": "That dependence upon that functional organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.146,
    "end": 3029.44,
    "text": " is something that is to be expected given where an immune system or the cells that make up the immune system, how they're related to the larger encompassing kind of system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.381,
    "end": 3043.877,
    "text": "So relative to the organism in which you find immune cells or immune systems, those immune cells are not going to actually be more autonomous than that system within which in there with, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.897,
    "end": 3046.68,
    "text": "So in that sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.167,
    "end": 3069.107,
    "text": " if you can start comparing levels of autonomy in that sense you'll have differences of course these are happening but the time the actions the behaviors if you will of these systems are going to be happening on different time scales however when you're just kind of thinking about uh whether or not the immune system could ever act in its own accord or for its own accord",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.087,
    "end": 3080.6,
    "text": " That's something that I think gives you a kind of quite direct answer as to whether or not immune systems are going to be targets for cognitive explanation, which I don't think they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.403,
    "end": 3084.565,
    "text": "Lastly, a collective memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.626,
    "end": 3088.709,
    "text": "So the memory at the level of something like a colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.911,
    "end": 3097.339,
    "text": "So here's three reasons why I think an ant colony might be viewed as a metabolic individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.247,
    "end": 3099.649,
    "text": " made up of heterogeneous parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.849,
    "end": 3104.395,
    "text": "Again, you have differentiation of colony members.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.136,
    "end": 3108.18,
    "text": "You have the queen, of course, the reproductive function of the queen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.2,
    "end": 3114.568,
    "text": "But then you have workers, which are all sisters, just like bees in the sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.588,
    "end": 3117.552,
    "text": "And they have their all functional allocations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.792,
    "end": 3120.696,
    "text": "You want to have different types of phenotypes within the colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.577,
    "end": 3127.765,
    "text": "And they maintain a particular colonial structure that is going to be dependent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.015,
    "end": 3130.177,
    "text": " over the turnover of individual ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.919,
    "end": 3134.841,
    "text": "There's a high degree of metabolic integration between these parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.824,
    "end": 3146.392,
    "text": "Different ants are going to actually retrieve food and forage, feed the colony, feed the nests, feed the queen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.733,
    "end": 3155.44,
    "text": "And that metabolic integration is dependent upon each of the parts fitting together and functioning together cooperatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.398,
    "end": 3166.351,
    "text": " Now, there's going to be a small degree of non-cooperation within ant colonies or within any colony, but that's going to be overshadowed by cooperative behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.215,
    "end": 3178.688,
    "text": "Lastly, you have integration, which is going to be underwritten by external signals like, again, pheromones and pheromone trails and behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.908,
    "end": 3184.195,
    "text": "So entering and exiting the nest at a certain type of rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.445,
    "end": 3190.475,
    "text": " So it really doesn't, in this case, again, like for Xerum, it really doesn't matter if the signals are internal or external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.579,
    "end": 3194.402,
    "text": "These signals are going to be used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.582,
    "end": 3200.833,
    "text": "The way that they're used, again, the way they function is going to be analogous to internal signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.653,
    "end": 3211.222,
    "text": " So is collective memory subject to cognitive explanation in a non-instrumental way, as a cognitive process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.242,
    "end": 3232.423,
    "text": "And I think assuming that there isn't any type of system that is encompassing an ant colony that scores higher than the colony in terms of metabolic individuality, I think an ant colony is going to be in this case where it's going to be maybe equal to the individual ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.028,
    "end": 3241.977,
    "text": " This is a dynamic, obviously a dynamic process, but it might be equal to the individual ants or the individual organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.457,
    "end": 3252.708,
    "text": "So colonies come close to having a similar score, enough to regard them as something that we can ask the question or apply literally cognitive theories to ant colonies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.828,
    "end": 3260.976,
    "text": "And I think this kind of buttresses this idea of colonial intelligence, of colonial memory, colonial learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.723,
    "end": 3264.925,
    "text": " So that's that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.127,
    "end": 3271.655,
    "text": "So in summary, we can return to the question of Physarum again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.956,
    "end": 3273.378,
    "text": "Physarum is our springboard here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.398,
    "end": 3281.571,
    "text": "Is it warranted to interpret Physarum's use of extracellular slime, this mucopolysaccharide, as a form of biological memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.591,
    "end": 3282.672,
    "text": "I want to say yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.113,
    "end": 3285.056,
    "text": "We're warranted in thinking about it in terms of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.438,
    "end": 3291.486,
    "text": "Can such a memory be investigated from the perspective of cognitive memory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.702,
    "end": 3299.012,
    "text": " me apply cognitive explanations to it i'm going to say yeah sure uh pizarum is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.127,
    "end": 3299.828,
    "text": " an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.108,
    "end": 3303.973,
    "text": "Organisms are, again, paradigmatic forms of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.215,
    "end": 3314.147,
    "text": "They exhibit memory in a very paradigmatic way that we've seen within the talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.167,
    "end": 3319.934,
    "text": "And I believe that Fazem obviously is going to be a metabolic individual for that reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.395,
    "end": 3325.201,
    "text": "So we can ask the third question, is externalized spatial memory a form of cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.663,
    "end": 3328.105,
    "text": "And I say perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.878,
    "end": 3356.91,
    "text": " I'll leave it at that, perhaps, because this is going to depend, again, if we can apply cognitive theories, specifically navigational theories of memory and learning to Fazeram's case, because it has the highest degree of metabolic individuality of its biological organizational levels, that's going to depend upon the different types of navigational theories that we apply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.11,
    "end": 3363.676,
    "text": " So that third question is when really it's going to be theory dependent, it's going to be framework dependent, whether or not that's going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.438,
    "end": 3373.505,
    "text": "Michaelian, for example, he suggested that these are three different types of criteria for spatial memory and navigational memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.085,
    "end": 3384.855,
    "text": "You have to have survival relevant storage, which means that information that gets stored is going to be determined by the relevance of that information to the survival of the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.375,
    "end": 3391.34,
    "text": " That, again, goes very well with the idea of a metabolic individual sister.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.901,
    "end": 3398.967,
    "text": "Number two, for something to qualify spatial memory, there has to be instability over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.047,
    "end": 3402.63,
    "text": "So the obvious way to think about this is memories can be forgotten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.911,
    "end": 3404.752,
    "text": "They can be overwritten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.332,
    "end": 3414.64,
    "text": "A memory that can't be overwritten, no matter what type of substrate that memory is in, doesn't seem to be something like a memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.058,
    "end": 3418.523,
    "text": " It can't be, it doesn't have the dynamics of a memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.566,
    "end": 3423.471,
    "text": "And lastly, there's something like metamemory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.511,
    "end": 3428.579,
    "text": "He suggests that spatial memory or navigational memory should be core.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.36,
    "end": 3442.5,
    "text": "It's a core feature of it, which just means that there are other processes that are going to influence whether memory states are acted upon or ignored in favor of guided behavior with the current context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.037,
    "end": 3470.53,
    "text": " And whether or not these all are satisfied by Physerum, this is a question, but now we get to the point where we can ask these specific types of questions from a cognitive theory, apply it to a particular type of individual, because that individual seems to, you know, kind of, it seems to be a kind of the highest degree of, has the highest degree of metabolic individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.51,
    "end": 3474.013,
    "text": " or relative degree of metabolic individuality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.274,
    "end": 3499.116,
    "text": "So in conclusion, regardless of whether viserum's use of extracellular slime is considered a cognitive process or not, now again, that's going to be theory dependent, it should be clear that focusing on the behavior of the single-celled non-moronal organism is going to be quite helpful in revealing interesting and important questions about memory, and it can help us consider relations between different forms of biological memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.771,
    "end": 3508.988,
    "text": " So again, if cognition is first and foremost a biological process and biological organisms, approaching this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.39,
    "end": 3526.89,
    "text": " particularly this idea of cognitive explanations using non-normal model organisms like the serum, it's going to offer a really promising way, I think, of going forward, a potential escape from the trap or the prison of our own kind of familiarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.631,
    "end": 3535.92,
    "text": "And I think that's a really important thing is to have model organisms that are so different from us that it stretches the imagination, if you will,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.137,
    "end": 3553.875,
    "text": " stretches the imagination in ways that you know uh expands our horizons and the types of the different types of questions we can ask and that help us to kind of reflect on our own case or cases that are more similar to us thank you thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.066,
    "end": 3566.751,
    "text": " awesome all right well while uh some people may be writing any questions in the live chat i believe the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.035,
    "end": 3595.557,
    "text": " previous time we discussed was in live stream 30 it was how to count biological Minds symbiosis the free energy principle and reciprocal multi-scale integration so some of those topics definitely came back into play ranging from the metabolic symbiosis and the multi-scale nesting where do you see active inference and the free energy principle in this line of research",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.718,
    "end": 3601.665,
    "text": " I think it's an interesting way to model this, most certainly an interesting way to model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.685,
    "end": 3619.03,
    "text": "And I think the particular idea of taking metabolism and taking different levels of metabolic integration seriously is something that, I don't know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.225,
    "end": 3641.006,
    "text": " It's something that I wasn't really, I was thinking about it previously in How to Count Biological Minds, yes, but I didn't really understand the importance of this as an evolutionary process, as the importance to it as being kind of the result of an evolutionary process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.626,
    "end": 3647.532,
    "text": "And once you have these, taking this into consideration,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.95,
    "end": 3657.359,
    "text": " you do have a manner of kind of delineating where the target's going to be or where the most important target's going to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.379,
    "end": 3660.562,
    "text": "So you can apply, for example, active inference to any level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.965,
    "end": 3667.829,
    "text": "You can apply it to any level, but some levels are going to be more interesting than others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.231,
    "end": 3677.839,
    "text": "And I think because it is a type of, you know, active inference, it's a type of process theory and it's a type of kind of modeling framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.988,
    "end": 3681.473,
    "text": " You're free to choose which levels you want to apply it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3681.994,
    "end": 3694.933,
    "text": "However, there are going to be some levels that are going to have more of a payoff when you start applying other types of cognitive theories to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.162,
    "end": 3714.222,
    "text": " I think particularly when you start thinking about not literally nesting, but I would say contextualizing those theories within something like, you know, thinking about major transitions in cognitive evolution or thinking about major transitions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.202,
    "end": 3733.206,
    "text": " more generally uh but cognitive theories putting putting like that those those particular types of cognitive theories in the context of uh you know evolution if if one thinks about cognition as being something a kind of suite or toolbox of various capacities that have evolved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.587,
    "end": 3741.056,
    "text": " And one doesn't just take on the assumption that all life is cognitive, which some people do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.957,
    "end": 3750.528,
    "text": "But then that question becomes whether or not, it's not a question about how cognition evolved necessarily, but it's a question about how life evolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.849,
    "end": 3752.371,
    "text": "Those two questions become the same question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.053,
    "end": 3754.914,
    "text": "Yeah, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.934,
    "end": 3763.125,
    "text": "Like the cognitive turn in evolutionary biology leads us almost to the point of asking, well, what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.438,
    "end": 3781.796,
    "text": " remains, other than cognitive account, is the Venn diagram of the cognitive account, if we take it down to the materials level, ultimately identical with the biological account or the metabolic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.116,
    "end": 3791.205,
    "text": "All of the substrate of living systems is part of the building up and breaking down of metabolism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.607,
    "end": 3794.652,
    "text": " So then, you know, what is outside of that scope?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.672,
    "end": 3806.574,
    "text": "Like, how many different frames, and maybe no need to reduce to one, but point to the same cell in the petri dish?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.515,
    "end": 3810.521,
    "text": "I'll ask a question in a live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.541,
    "end": 3811.843,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.823,
    "end": 3839.94,
    "text": " glia maximalist wrote thank you how do you think the metabolism of different sized organisms relates to their perception of time or their own behavior it's an interesting really interesting question um i think metabolism can run in an organism and i'm quite sure of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.287,
    "end": 3843.251,
    "text": " I would be quite sure about this claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.371,
    "end": 3849.121,
    "text": "Metabolism can run without an organism being necessarily aware of anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.544,
    "end": 3858.879,
    "text": "It's at a certain level that we can actually have a particular type of understanding, if you will, of our metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.941,
    "end": 3862.806,
    "text": "But metabolism nonetheless will affect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.427,
    "end": 3873.526,
    "text": " will affect perception, it will affect how organisms behave, and it will affect probably their proprioception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.029,
    "end": 3881.2,
    "text": "And depending upon, because it's about value trade-offs, if you will,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.888,
    "end": 3898.244,
    "text": " So if metabolism, for example, if an organism is in a state where the function of metabolism is breaking down, there are going to be certain types of stress responses that occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.506,
    "end": 3902.689,
    "text": "That will affect the manner in which an organism behaves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.249,
    "end": 3904.07,
    "text": "That's quite simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.091,
    "end": 3908.014,
    "text": "At which level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.062,
    "end": 3934.71,
    "text": " organism actually is aware that that's happening that's a different question and i'm not i'm not sure exactly where that happens that you have to have a quite complex uh neuronal system for that to happen but even before you get to that complex neuronal system you know complex nervous system even brain you want to have certain types of mechanisms in place",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.146,
    "end": 3940.215,
    "text": " that are going to be able to bring an organism back into its homeostatic range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.337,
    "end": 3950.995,
    "text": "That bringing it back into that homeostatic range is something that I would be very certain that most organisms, if not all organisms, have to do in order to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.287,
    "end": 3953.607,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3953.708,
    "end": 3975.916,
    "text": "Also, there's interesting connections like with the metabolic individuality you focused on that primary persistence, and then even molecules or processes that are thought of as almost reaching into the semiotic, like neurotransmitters, sometimes are amino acids or just several modifications away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.437,
    "end": 3982.905,
    "text": "So the line between what's a metabolite and what is a semiochemical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.885,
    "end": 4009.618,
    "text": " they are also overlapping because metabolites are key signaling molecules um yeah maybe just to your book like what do you hope the impact of such a book is or how did you come to think we need a slime mold and philosophy book and who would read it and think what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.353,
    "end": 4018.001,
    "text": " Yeah, well, I was quite lucky at one point in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.284,
    "end": 4021.485,
    "text": "I got in touch with Mike Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.786,
    "end": 4029.955,
    "text": "And Mike was really, he's a, Michael is a fantastic person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.817,
    "end": 4033.459,
    "text": "Brilliant guy and a fantastic person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4033.499,
    "end": 4040.247,
    "text": "And he asked me, okay, like, you've been writing a little bit about, you know, Physarum, you've been writing about Seindl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.581,
    "end": 4042.163,
    "text": " have you got your hands dirty yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.065,
    "end": 4044.327,
    "text": "Have you started doing experiments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4044.367,
    "end": 4045.388,
    "text": "And I'm like, no, not at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.428,
    "end": 4047.031,
    "text": "It's like, okay, well, let's change that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.133,
    "end": 4061.854,
    "text": "So Mike sent me some protocol for culturing for Xerum and took me step by step with a lot of communication with him as to how to do this and how to set up some experimental designs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.595,
    "end": 4064.057,
    "text": "I had been, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.678,
    "end": 4075.057,
    "text": " About a year and a half prior to that, I was over in Rome with Giovanni Pizzulo learning how to design behavioral experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.52,
    "end": 4087.159,
    "text": "And Mike was the one that reshifted my focus from human behavioral experiments to behavioral experiments in a petri dish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.017,
    "end": 4112.1,
    "text": " And the more I got doing these particular types of experiments, nothing published, not anything yet anyway, the more I was thinking about what an incredible way to kind of ask or answer questions that a lot of questions that has been happening or arising in kind of theoretical biology or philosophy biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.671,
    "end": 4119.818,
    "text": " There are a lot of what ifs, a lot of counterfactuals, a lot of speculation that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.079,
    "end": 4140.737,
    "text": "But given the ease with which this particular type of organism can be cultivated or cultured, given the speed at which it moves, and also given what it actually can do, it's quite unique as to what it can actually, the behavior that it engages in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.477,
    "end": 4146.826,
    "text": " There are a lot of questions that you can proceed to ask and just answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.828,
    "end": 4162.793,
    "text": "And so I haven't had the time or necessarily the resources to sit down for five years and answer all these questions myself with people in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.33,
    "end": 4169.283,
    "text": " But at Bochum Ruhr University, I was given the chance to work with a couple of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4169.824,
    "end": 4174.915,
    "text": "One, her name is Chu Rang, and she's a postdoc there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.955,
    "end": 4182.672,
    "text": "And she was working on kind of recording climbing plants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.799,
    "end": 4189.626,
    "text": " and doing analysis of climbing plant behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4190.707,
    "end": 4198.976,
    "text": "I don't know if you've seen recordings of plant tendrils as they grow and wrap around vines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.996,
    "end": 4202.14,
    "text": "They wrap their tendrils around certain poles and things like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.22,
    "end": 4204.863,
    "text": "And she was doing kinematic analysis of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.364,
    "end": 4210.009,
    "text": "And we decided to actually use that same type of analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.546,
    "end": 4216.796,
    "text": " with Vizarum, looking at its growth, looking at its movement and in response to certain things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.876,
    "end": 4224.508,
    "text": "So I was very, very, very, very lucky to make her acquaintance and be able to work with her.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.13,
    "end": 4231.238,
    "text": "But I thought, OK, well, prior to this, there's no way that I can do this myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.315,
    "end": 4255.234,
    "text": " all of it myself it's an intensive it's a really intensive research program there's so many questions that can be asked and i think part of the part of the fun of it uh and i think part of the value of it is asking the questions and maybe inspiring people who want to want to answer these questions in the lab uh to give give them a couple kind of questions to kind of uh you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.214,
    "end": 4268.97,
    "text": " to use as a fulcrum, if you will, and to get philosophers of biology, philosophers of science, and biologists, microbiologists together in one space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.659,
    "end": 4292.713,
    "text": " uh to work together and perhaps think about these questions and and use resources uh you know to answer these questions if you will uh in a laboratory setting and so that's what the book is about pretty much it's like it's looking at how viserum which is like it's it's an organism that i'm absolutely you know i'm i continue to be mesmerized by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.98,
    "end": 4311.715,
    "text": " you know, the various things that it can do and just how beautiful of a life cycle it has, and interesting of a life cycle it has, how it can be used to answer some questions from very, very long standing questions in the philosophy of biology and say, philosophy of cognitive science also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.057,
    "end": 4338.968,
    "text": " awesome that resonates a lot i'll add a few points i'll begin with a quote from a 1989 paper a framework for plant behavior by silvertown and gordon who you quoted and they wrote there's some question whether words used to describe animal behavior such as the word behavior itself or foraging can be properly applied to the activities of plants",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.948,
    "end": 4356.805,
    "text": " so it's kind of this evergreen discussion oh okay but is it really solving that maze or is it really memory and certainly mike levin and others and these come up like is anything that's outside of the organismal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.08,
    "end": 4371.84,
    "text": " frame actually doing cognition and then the slime mold blurs that because it's also a single cell so then it's like well why would it matter if there's a lipid",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.327,
    "end": 4393.17,
    "text": " membrane separating this or that when the cell is also the organismal boundary and then also to the relevance and sort of the cross fertilization of philosophy of biology and the behavioral sciences or ethology in professor gordon's undergraduate class",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.285,
    "end": 4399.792,
    "text": " One thing that she would have the undergraduates do was design and carry out a behavioral experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.812,
    "end": 4405.017,
    "text": "Even do squirrels cross the bike path more on Wednesdays?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.758,
    "end": 4417.69,
    "text": "And there's something about doing any inquiry that provides philosophical insights that the armchair doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4418.193,
    "end": 4442.327,
    "text": " and it helps reveal there's a associative analogical mode that's like studying foraging across different systems however by virtue of thinking and scoping over so many systems most are not going to be directly engaged with you know we're thinking about like a space hypothetical asteroid forager and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.307,
    "end": 4444.955,
    "text": " ants as a broad category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.015,
    "end": 4452.115,
    "text": "But then when you get into the natural history and the behavioral science or the constraints of a specific laboratory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.5,
    "end": 4470.922,
    "text": " just sticking with one system like a Drosophila or slime mold or this one field site, those can offer so many questions that even leads to re-interrogation of what the bigger category like navigation was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4471.482,
    "end": 4482.355,
    "text": "So for example, like in the navigation example or the maze solving, I thought, well, it's doing something spatial, but not necessarily with a cognitive map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.28,
    "end": 4502.284,
    "text": " so what is this now it's like hmm so actually there's some play between what is cognition that's realized spatially and that which is aware of its own spatiality and that's something that can just be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.804,
    "end": 4518.147,
    "text": " brought to bear with the petri dish and some experiments like that so it's just when the philosophy questions are held up with the inquiry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.291,
    "end": 4541.012,
    "text": " there's just amazing possibilities and like your what you shared shows that you know people come from both sides and and um may it be a perforated membrane between the two because there's so much to like learn on both sides absolutely absolutely absolutely i think this is like you hit the nail on the head it's just um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.971,
    "end": 4547.318,
    "text": " I take it then that you were in Deborah Gordon's class then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.839,
    "end": 4549.181,
    "text": "Did you take courses with her?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.201,
    "end": 4550.562,
    "text": "She was my PhD advisor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.564,
    "end": 4552.145,
    "text": "Ah, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.185,
    "end": 4552.685,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.946,
    "end": 4553.506,
    "text": "That makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.207,
    "end": 4555.429,
    "text": "Makes a lot of sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.449,
    "end": 4556.13,
    "text": "She's incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.45,
    "end": 4557.271,
    "text": "She's really incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.134,
    "end": 4563.56,
    "text": "So yeah, I think that you hit the nail on the head with many of the things that you just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.581,
    "end": 4568.907,
    "text": "In terms of, say, spatial navigation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.123,
    "end": 4572.368,
    "text": " Yeah, Physarum, not going to have a cognitive map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.43,
    "end": 4574.872,
    "text": "Not going to have a cognitive map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.892,
    "end": 4579.739,
    "text": "And this is, I think, like, I think cognitive maps are quite complex things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.759,
    "end": 4584.647,
    "text": "There's still disagreements as to whether or not, you know, which organisms use cognitive maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.588,
    "end": 4597.847,
    "text": "Again, Sarah Shuttleworth, 2014, she really kind of puts the brakes on and said, if you can explain this, a lot of what organisms do, animals do, she's a mythologist,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4598.215,
    "end": 4604.511,
    "text": " in terms of using certain types of other simpler mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.195,
    "end": 4615.498,
    "text": "They're still quite complex cognitively, but they're simpler mechanisms in cognitive maps, running computations on cognitive maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.255,
    "end": 4635.715,
    "text": " you have you have these things going on in ads for example uh where you have uh like uh egocentric or versus uh aliocentric kind of recognition of landmarks and things of that nature or um you probably know this the term better than me but dead reckoning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.078,
    "end": 4638.26,
    "text": " Using dead reckoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.3,
    "end": 4641.346,
    "text": "Dead reckoning is distinct from using a cognitive map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.467,
    "end": 4645.234,
    "text": "It probably can be used in addition in animals with cognitive maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.757,
    "end": 4652.749,
    "text": "But the question that arises in viserum, is there something similar to dead reckoning happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.989,
    "end": 4655.955,
    "text": "Is there something similar to landmark navigation happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.055,
    "end": 4657.618,
    "text": "Is it leaving its own landmark?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.375,
    "end": 4673.89,
    "text": " something like this, you can start to ask these questions because you can relate its behavior to other types of cognitive theories if you're asking the right level, if you're at the right level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.99,
    "end": 4682.698,
    "text": "So yeah, it's not going to satisfy any of this kind of criterion, if you will, for thinking about cognitive maps, but maybe landmark use, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.739,
    "end": 4686.682,
    "text": "Landmark use does not necessarily have to be a personal process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.742,
    "end": 4688.263,
    "text": "It can be a sub-personal process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.117,
    "end": 4698.815,
    "text": " I think it's a Hofstetter quote, like, computers don't play chess, they do statistics, but they don't do statistics, they just follow the laws of physics and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.036,
    "end": 4708.716,
    "text": "It's like cognitive phenomena, when we start to really interrogate them and break them apart, oh, well, that outfielder's not really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.27,
    "end": 4733.252,
    "text": " inferring the location of the ball they're just using a behavioral heuristic to stand where it's gonna it's like well if that's actually how it's done then what is the space between the problem as it was set up and how it's really being done in all these different biological ways so and that even came up in the reciprocal integration like what do we expect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.435,
    "end": 4734.916,
    "text": " What are we surprised by?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.956,
    "end": 4745.085,
    "text": "What does what we're surprised by say about who and how we think we are in how we analyze these cognitive systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.087,
    "end": 4752.492,
    "text": "I'll ask a last question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.512,
    "end": 4761.4,
    "text": "Upcycle Club wrote, how might the adaptive behaviors of slime molds contribute to our understanding of distributed cognitions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.704,
    "end": 4766.506,
    "text": " Okay, that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.526,
    "end": 4776.997,
    "text": "I think it relates back to, I would have to say, really very important work by Chris Reed and his colleagues over at Macquarie University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.177,
    "end": 4786.107,
    "text": "The first paper that I referred to, the 2012 paper, about externalized spatial memory, or externalized navigational memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.667,
    "end": 4792.213,
    "text": "I think that's a good place to start with that in terms of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.071,
    "end": 4797.683,
    "text": " an organism that uses its own byproducts to navigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.468,
    "end": 4802.777,
    "text": "It uses its own byproducts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.702,
    "end": 4810.268,
    "text": " Again, this is not a personal level kind of choice or anything like this, but I should say this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.308,
    "end": 4814.452,
    "text": "I think this is quite important in terms of understanding the nature of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.593,
    "end": 4817.936,
    "text": "Once we get to say, okay, well, this is the right level for looking at memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.956,
    "end": 4826.905,
    "text": "This is perhaps the right level for looking at the organismal level or biological organizational level for thinking about things like problem solving, decision making, and so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.326,
    "end": 4832.41,
    "text": "Its use of extracellular slime, which again is a mucopolysaccharide,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.761,
    "end": 4853.79,
    "text": " can be overwritten so it's not just a repulsion to this stuff uh if you create a situation uh in a petri dish where you have a circle of exercise of islam this is one of the experiments i've done and you put a viserum in that circle uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.905,
    "end": 4867.223,
    "text": " And then you put a reasonably sized oat flake, which is something that you use for food in order for motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.03,
    "end": 4869.992,
    "text": " it'll climb over the extracellular slime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.474,
    "end": 4885.23,
    "text": "And that's one of the things that I think is quite important in thinking about, and that was one of the kind of criteria also about kind of spatial memory and navigational memory that was brought up in the talk, that something can be overwritten given the particular type of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.111,
    "end": 4889.015,
    "text": "I would think there are many other ways that you can expand this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.095,
    "end": 4895.202,
    "text": "You can ask the question, when does it use its extracellular slime and what does it use its extracellular slime for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.401,
    "end": 4901.488,
    "text": " Is it just, again, is it just a lubricant for motility?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.948,
    "end": 4904.651,
    "text": "No, we know that it kind of uses it for navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.572,
    "end": 4908.215,
    "text": "In what ways does it use it for navigation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.377,
    "end": 4911.859,
    "text": "And does it always have to be in contact with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.92,
    "end": 4912.961,
    "text": "Are there gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.501,
    "end": 4924.834,
    "text": "There are many questions that could be asked, but I guess the most important thing to think about is the fact that whatever's going on, it's a coupling of a cell to something in its external milieu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.063,
    "end": 4955.732,
    "text": " And depending upon the geometry of that extracellular slime, depending upon the values of various stimuli within its surrounds that it can sense, again, it's sensing these various, it's sensing food, for example, through concentration gradients and through agar that are going through the air, or whether it's going to be oats or sugar from oats that are kind of leaking, seeping into the agar, or whether it's in its own natural environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.999,
    "end": 4967.955,
    "text": " it can do this particular type, these, I'll call them computations, if you will, on what's available and what's more important for this particular type of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.016,
    "end": 4979.951,
    "text": "And exercise of the slime plays a role in that, in the sense that it's one of the things that it weighs in these particular types of computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.712,
    "end": 4984.757,
    "text": "The computations, again, might be very, very, very, very simple,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.092,
    "end": 4999.484,
    "text": " But there are computations that are being run because it's the integration of information and the weighing out of this information according to the continuation of metabolic functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.885,
    "end": 5003.353,
    "text": "When things don't work out, then it goes into one of these dormant stages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.16,
    "end": 5006.943,
    "text": " and it can reemerge after waiting things out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.103,
    "end": 5011.348,
    "text": "But that's, extracellular slime plays a very, very important role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.408,
    "end": 5026.945,
    "text": "So again, the suggestion, look at the work of Chris Reid, Reid et al, 2012, 2013, and it's a very good starting place to understand how Physarum uses extracellular slime in these ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.536,
    "end": 5051.008,
    "text": " i'm also struck by when you showed the life cycle diagram and how it seems like less is known about what cognitive tasks or work is done in those other stages and then also how different they looked from the size and morphology and it just is like what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.507,
    "end": 5070.212,
    "text": " what we you know the caterpillar and the larva and the butterfly all do different things and so when we think about the life cycle perspective and community there's so many cool ways to go well if you have any last comments please go for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5070.192,
    "end": 5089.263,
    "text": " Otherwise, it's a great direction of research and it's exciting to see how the cognitive sciences are entering the chat and bringing a lot of excitement to these perennial questions about individuality and cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.545,
    "end": 5091.106,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5091.186,
    "end": 5097.516,
    "text": "Yeah, I think in terms of life cycles, I think there's something fun and very important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5098.61,
    "end": 5099.412,
    "text": " that goes on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.472,
    "end": 5114.526,
    "text": "One of the things that has beset I said, I suppose, biological research, a lot of biological research, and specifically, you know, thinking about cognition, is that we're adults interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5116.278,
    "end": 5141.085,
    "text": " We think about the adult organism, you know, of course there's developmental psychology and kind of people are looking at that, but most, a lot of the research when we're talking about generalizing certain types of capacities and generalizing certain type of, you know, response rates, we have a very kind of narrow band of model organisms and ages of model organisms that we're looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.406,
    "end": 5146.15,
    "text": "This even, when you look at an organism with a complex life cycle,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.227,
    "end": 5162.207,
    "text": " you expand that in such an incredible way because you're not just looking at different ages, you're looking at different, really, really different phenotypes within the same organism over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.968,
    "end": 5175.985,
    "text": "And not only are you looking at different phenotypes, you're looking at, and this is one of the things that I approach in the book, it's a wonderful way to explore something like niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.298,
    "end": 5203.44,
    "text": " Because if those different parts of the life cycle are responses to changes in an environment, if they're responses to various selection pressures, ways to accommodate selection pressures, sometimes they might be primed by certain types of stimuli, sometimes not, then you have a different kind of frame",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.775,
    "end": 5209.42,
    "text": " that one can use to think about niche construction, various types of niche construction and how they're related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.341,
    "end": 5219.33,
    "text": "So yeah, a beaver, the stereotypical example of the beaver building a dam to kind of control the dynamics within its particular type of niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.692,
    "end": 5233.343,
    "text": "You have that, like that's a particular type of externalized niche construction, but then you have other things which involve, for example, an organism changing its own morphology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5234.842,
    "end": 5242.313,
    "text": " as a way to kind of buffer itself from changes in selection pressures, harder selection pressures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5242.333,
    "end": 5247.701,
    "text": "So a change in temperature might be a change in, for example, moisture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.502,
    "end": 5259.077,
    "text": "So the mixed amoeba, it will synthesize flagella by flagella if it starts raining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.222,
    "end": 5268.893,
    "text": " if there's a lot of water, then it'll stop synthesizing those flagella and start crawling again as an amoeba as if it dries out again, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.895,
    "end": 5286.937,
    "text": "And there are kind of costs, like the costs of that particular type of morphological change or that type of niche construction are quite interesting things to think about because when it's a biflagellate, it can't reproduce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.218,
    "end": 5289.52,
    "text": "So there's a trade-off there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5290.242,
    "end": 5293.927,
    "text": " When it's a mixed amoeba, when it's reproducing, it can't feed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.968,
    "end": 5303.602,
    "text": "So it's a very interesting way to think about life history trade-offs plus niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.163,
    "end": 5315.98,
    "text": "And you get all of that if you focus rather than on just the plasmodium cell that we've been talking about during this, that we've been focused on this talk, on the entire life cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.276,
    "end": 5325.817,
    "text": " And there are many other organisms, bryophytes, for example, ferns, incredible, incredible life cycles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5328.263,
    "end": 5333.817,
    "text": "Behavior is different, obviously, in bryophytes or plants or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.797,
    "end": 5360.698,
    "text": " But the same goes for them in the sense that that life cycle provides a really beautiful way, a beautiful lens through which to see how an individual's morphology is very much coupled in incredible ways to different environmental dynamics and how it can actually influence those dynamics and influence its own evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.268,
    "end": 5365.73,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5366.192,
    "end": 5372.255,
    "text": "Thank you, Matt, for joining again and looking forward to reading the book and until next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5373.6,
    "end": 5374.163,
    "text": "Thanks, man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.183,
    "end": 5375.367,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5375.387,
    "end": 5375.548,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]