[
  {
    "start": 1.027,
    "end": 1.648,
    "text": " All right, hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1.908,
    "end": 4.111,
    "text": "It is May 16th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5.032,
    "end": 12.523,
    "text": "We're in the RxInfer JL project with some guests from Bias Lab and participants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.543,
    "end": 18.07,
    "text": "And Votzer will be sharing with us about the RxEnvironments.jl package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.09,
    "end": 19.432,
    "text": "So thanks all for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.492,
    "end": 22.056,
    "text": "Looking forward to this presentation and discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.356,
    "end": 22.917,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.247,
    "end": 47.233,
    "text": " right thank you daniel uh so my name is wouter i am a second year phd student in bias lab uh you may know bias lab because we are the main authors of the rx infer package a package for reactive bayesian inference and last year when i was working with rx infer and doing well reactive bayesian inference i found that there was a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 47.534,
    "end": 52.642,
    "text": " lacking support for environments in the same reactive paradigm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 53.283,
    "end": 61.756,
    "text": "And we were relying on reinforcement learning packages such as Gymnasium or Reinforcement Learning JL, and I didn't really like it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 62.297,
    "end": 74.335,
    "text": "So I wrote rxenvironments.jl, a package for reactive environments, which aims to complement RxInfer in the reactive",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 74.804,
    "end": 92.053,
    "text": " um agent development uh ecosystem so if we look at rx environments it's a very lightweight boilerplate package it contains all boilerplate code to make something that i call a reactive environment a reactive environment is uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 93.097,
    "end": 105.823,
    "text": " an environment that consists of entities where an entity can be an agent but it can also be a component of an environment or the entire environment itself and what we have to describe is how entities",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 106.242,
    "end": 130.41,
    "text": " communicate with each other so every entity has its own markup blanket with which it can communicate with other entities in the environment so in that sense it's very related to active inference because well we have a very specific notion of the interior of an entity and the exterior of the entity and its markup blanket and i try to replicate that in rx environments",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 130.677,
    "end": 135.664,
    "text": " So to give a short demo, we can dive right into the code.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 135.745,
    "end": 152.41,
    "text": "I have prepared the mountain car example in the documentation of our environments, but just to showcase to you that this gives you more flexibility to work with.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 152.55,
    "end": 159.3,
    "text": "So we have on the left-hand side, I have my code because I'm going to manipulate this environment",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 159.702,
    "end": 181.575,
    "text": " uh in real time and on the right hand side i have the environment so i have my landscape i hope you guys can see my cursor by the way i have the landscape and in the middle i have one agent one car a dot representing a car what's nice about rx environments is that i can send um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 182.517,
    "end": 211.984,
    "text": " actions to the environment so my landscape the environment is one entity the agent the car is a different entity and i can send a command that contains engine force on a scale from minus one to one so i can send minus one to the entity and you'll see that the car starts driving up the hill it doesn't have a lot of engine force and i can live send different commands and you'll see",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 213.314,
    "end": 214.936,
    "text": " that the car responds accordingly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 215.597,
    "end": 224.567,
    "text": "Now, what's nice about RX environments is that, as I said, you'll get native multi-agent environments out of the box.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 225.248,
    "end": 237.363,
    "text": "So if I just add a different mountain car agent with some hyperparameters to the environment, you'll see that there is now a second dot at the bottom of the valley, a second car.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 238.344,
    "end": 241.768,
    "text": "And similar to how this first car can be controlled",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 242.558,
    "end": 244.3,
    "text": " we can control the second car too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 245.06,
    "end": 248.063,
    "text": "Point one was maybe this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 248.443,
    "end": 254.769,
    "text": "I should have maybe given this car a bit less engine power because it's clearly flying off the screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 256.37,
    "end": 264.397,
    "text": "But you get the gist that we can control both cars simultaneously.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 264.958,
    "end": 271.924,
    "text": "And RX Environments handles all this communication natively, reactively under the hood.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 272.562,
    "end": 296.528,
    "text": " So my idea is, or my next steps for this project are going to be to incorporate it better into the RxInfer ecosystem, because I think that building agents with RxEnvironments in this way, that both the Active Inference community as well as the RxInfer community can benefit from this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 296.812,
    "end": 300.998,
    "text": " So this is a very short overview of the things that Rx environments can do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 301.018,
    "end": 302.059,
    "text": "It can do a whole lot more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 303.421,
    "end": 312.534,
    "text": "But I think that this is a very short demo that gives you the best idea of why it's nice that we're going to go reactive, because you get stuff like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 312.594,
    "end": 313.876,
    "text": "We can control in real time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 313.956,
    "end": 316.199,
    "text": "We can control multi-agent environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 316.86,
    "end": 321.307,
    "text": "And it's very active inference-y in that sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 321.847,
    "end": 325.873,
    "text": "So on that note, I'll stop sharing my screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 326.984,
    "end": 327.686,
    "text": " Let's see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 328.428,
    "end": 336.63,
    "text": "And yeah, if you guys have any questions about this, which I, which I heard you have, then I'll be very happy to take them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 342.305,
    "end": 342.706,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 342.927,
    "end": 343.508,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.074,
    "end": 348.197,
    "text": " Very informative and hilarious mountain car example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.717,
    "end": 357.385,
    "text": "Yeah, you can play with this engine force of this mountain car, and I probably should have prepared that it doesn't fly off the screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 357.445,
    "end": 360.427,
    "text": "But I mean, it gets the point across, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 362.129,
    "end": 362.97,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 363.31,
    "end": 365.292,
    "text": "I'll share screen and just type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.392,
    "end": 373.939,
    "text": "And so everyone else in the group, just go for asking any of the questions we'd already identified or any new questions arising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.219,
    "end": 374.98,
    "text": "So go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.44,
    "end": 386.654,
    "text": " I don't understand you very well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 386.994,
    "end": 396.208,
    "text": "Maybe there's, do you understand Cope as well?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 397.49,
    "end": 402.577,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 402.737,
    "end": 403.819,
    "text": "You're very, very faint.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 412.051,
    "end": 412.237,
    "text": " Thank you.",
    "chars": null
  },
  {
    "start": 415.122,
    "end": 419.306,
    "text": " Yeah, okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 419.806,
    "end": 424.931,
    "text": "I actually had a question, Valter, not on this particular page that Daniel's sharing right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.511,
    "end": 436.741,
    "text": "I tried my hand at, let's say, plugging in the mountain car, the existing mountain car agent in the RX and third documentation into your mountain car environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 437.362,
    "end": 443.087,
    "text": "I wasn't quite able to do that, but it appears that you have done that in that example just then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.067,
    "end": 471.184,
    "text": " and then maybe i was missing something because in the in the documentation the rx environments documentation from mounting car i didn't see that there was a an agent that had you know a instantiated generative model uh much in the same way that the rx infer documentation had and i thought oh okay this this is a wrapper or you know a nice api for me to specify an environment i i now have to go away and specify my agent also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.502,
    "end": 495.687,
    "text": " but it seems is that what you did for that example just then or or did you just no no no i just for this example just now i just used my uh you know custom commands that i just uh sent myself um so this is something that i'm actively working on on combining the two um the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 496.257,
    "end": 519.497,
    "text": " mountain active inference mountain car example on the arcs and fur website i believe is a bit um cheating in a sense because we give it all environment dynamics all functions of the environment dynamics and then we do some some approximation to the posterior of what we have to do but in a sense it doesn't really",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 519.848,
    "end": 538.026,
    "text": " discovered that it has to do anything because it knows all the environment dynamics so that's why i haven't really spent time on incorporating this specific example because i feel that if we're going to demo this package plus",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 538.462,
    "end": 568.232,
    "text": " an agent that it should be an agent that actually has capabilities of exploring the environment instead of knowing all the environment dynamics and just well basically doing model predictive control right okay that makes it a bit clearer okay i'll have a follow-up but i'll maybe let somebody else um thank you very much so to give a very short answer to your question we can we can sit together if we uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 568.82,
    "end": 580.298,
    "text": " on if you want to define an agent a generative model i know how to hook the two up i just don't have a working example yet right okay i don't want to use this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 580.649,
    "end": 604.581,
    "text": " i don't want to use this agent from from the arcs and third documentation because indeed i feel that it's a bit cheating but it's my personal opinion right yeah yeah okay that actually clears a lot of things off me because i was kind of unclear like oh do i do i kind of plug that one in is that is that what i do yeah okay but that's not that functionality is exactly clear yeah we can um however",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.168,
    "end": 626.451,
    "text": " There is a subtlety there, and that is something that I find very interesting in my research, is if you open up this space or you open up your environment to be reactive, then you want your environment to be able to receive an action at any point in time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 626.92,
    "end": 655.712,
    "text": " so what we see in reinforcement learning is that you have a specific transition function the environment waits until you send an action it will move the environment forward a pre-specified amount of time and it will emit to you an observation and a reward however if you make this entire thing reactive then well our agent would be able to emit at any point in time and also it would be able to get an observation at any point in time now that is a very interesting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 656.806,
    "end": 686.779,
    "text": " setting to work with because now our agents should kind of be robust to getting an observation at any point in time specifically what if our agent that lives on some embedded device and some drone whatsoever it has less compute to do to do inference however well at some point we're going to have to send an observation or an agent an action back to the environment we're going to have to do something",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 687.603,
    "end": 703.748,
    "text": " So this reactivity opens up a research avenue for, well, right now for me, because I find this very interesting, on how truly reactive agents would look like, if you see what I mean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 704.97,
    "end": 705.951,
    "text": "Yeah, I do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.032,
    "end": 708.095,
    "text": "That's exceptionally exciting stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.375,
    "end": 709.577,
    "text": "It's awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 710.097,
    "end": 722.503,
    "text": " Okay, but okay, just to wrap up my question, there is no, at the moment you kind of manually, you know, you put in the force limit and you say, okay, I'm going to kind of manually, you know, play around with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.905,
    "end": 736.641,
    "text": " I have working examples with like Bayesian thermostat or very, very easy, which I probably, I don't know if I have them on my machine right now or if they live somewhere, like it works.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 737.182,
    "end": 741.587,
    "text": "But the thing that I got to work is model predictive control and not active inference yet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 742.368,
    "end": 743.108,
    "text": "So that's why.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 745.151,
    "end": 745.431,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 745.792,
    "end": 746.372,
    "text": "All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 746.392,
    "end": 748.415,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 748.435,
    "end": 748.795,
    "text": "You're welcome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 758.123,
    "end": 763.709,
    "text": " Can you hear me a bit better now?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 763.729,
    "end": 764.75,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 764.85,
    "end": 770.857,
    "text": "Voter, I'm interested in the relationship between RxEnvironments and RxInfer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 772.559,
    "end": 786.814,
    "text": "For example, to put it simply, is it possible to use only RxEnvironments or is it supposed to be always used in collaboration with RxInfer?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 787.756,
    "end": 812.262,
    "text": " yes the relation is that i wrote arcs environment specifically um as a complementary package to arcs infer so if you just want to do bayesian inference you use arcs infer but i think if you want to build agents that you're better off using the the two together so arcs environments is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 812.933,
    "end": 817.66,
    "text": " a package that uses the same reactive backend as RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 817.86,
    "end": 820.384,
    "text": "So it's made to be compatible with RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 821.004,
    "end": 829.376,
    "text": "However, if you write agents just with an algorithm, you can use RxEnvironments by itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 829.817,
    "end": 833.102,
    "text": "It's not mandatory to use RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 833.242,
    "end": 834.724,
    "text": "They are separate packages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 834.764,
    "end": 836.547,
    "text": "There's not a dependency on RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 837.107,
    "end": 838.249,
    "text": "However, since",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 838.6,
    "end": 864.996,
    "text": " um they share the same reactive backend so the same package for reactivity under the hood which is also from bias lab which is rocket um if you want to build agents i would advise to to use rx infer so they're they're disjoined but they're designed with each other in mind or arcs environments is designed with arcs and fur in mind so um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 865.482,
    "end": 875.812,
    "text": " If we use this high level of abstraction given to us by RxInfer, do we lose anything?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 875.852,
    "end": 886.643,
    "text": "Or can we at any time dive into the lower levels by means of RxInfer itself?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 886.663,
    "end": 893.97,
    "text": "So I would say yes, because the inference process that happens in RxInfer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 894.271,
    "end": 900.237,
    "text": " is disjoint from what's going on in Rx environments, similarly to what happens in real life.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 900.437,
    "end": 916.013,
    "text": "So you can see Rx environments as a package in which you can make a digital twin of the environment, but then whatever happens in the inference process in your agents, well, that's still Rx Infer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 916.494,
    "end": 923.721,
    "text": "All Rx Infer diagnostic tools or debugging tools should be available there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 925.675,
    "end": 927.918,
    "text": " And a more practical question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 928.239,
    "end": 945.244,
    "text": "I know from the large papers and Professor De Vries as well, they like to divide what's going on into these six methods, the act, future, execute, observe, compute, and slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 945.825,
    "end": 954.518,
    "text": "So do you see that as kind of superfluous in the Rx environment setting?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 955.426,
    "end": 959.23,
    "text": " Is it fine to still use that approach?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 960.011,
    "end": 962.593,
    "text": "Let me Google the definition for superfluous.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 964.255,
    "end": 971.662,
    "text": "I'm going to tread very carefully in answering that question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 972.523,
    "end": 984.555,
    "text": "I don't think it is superfluous because in a sense that it's... If you want to design your agent such that it goes through those steps,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 985.042,
    "end": 1010.897,
    "text": " um then you're more than welcome to uh my personal opinion is that i'm i will i'm going to try and see if i can make an active inference agent that does inference in one step instead of having to act observe uh plan slide uh and so forth however for arc's environment so for your environment",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1011.164,
    "end": 1039.905,
    "text": " it doesn't really matter how you will get to your uh to your action as long as well or not right you can you can send an action at any point in time and if you don't send an action the world will just continue that and arcs environments will just continue running there's no real constraints on that so that the design is to be as less constraining on users as possible while opening up this reactivity uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1040.729,
    "end": 1070.28,
    "text": " um the reactivity aspect and also for um if you start with the package you could make what i call discrete environments they're they're a bit beating i would say because they're basically just the arcs environments equivalent of uh of a classical reinforcement learning environment where you have a pre-specified time step every time but i wanted to make that to make the transition easier",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1070.716,
    "end": 1076.341,
    "text": " Because if you go full reactive right off the bat, I would say it's a very ambitious thing to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.063,
    "end": 1081.846,
    "text": "So I don't think it's a superfluous algorithm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1085.509,
    "end": 1097.34,
    "text": "But I also don't think it's, well, RxEnvironments doesn't constrain you to use it, so I would say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1099.002,
    "end": 1099.322,
    "text": "Nice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1099.808,
    "end": 1108.477,
    "text": " Now, let's say one has a need to write one's own node in the factor graph.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1108.697,
    "end": 1114.784,
    "text": "Would Arc's environments support that kind of thing, or is it kind of an irrelevant question?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1115.845,
    "end": 1127.217,
    "text": "It's, in that sense, I would say irrelevant, because a custom node is something that lives in Arc's infer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1128.057,
    "end": 1135.827,
    "text": " And Rx environments really is concerned with everything that goes on outside of your inference process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1138.069,
    "end": 1139.531,
    "text": "And then another quick question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1139.591,
    "end": 1157.153,
    "text": "While playing with the, I think it was a thermostat problem in Rx environments, I wanted to see the time behavior of some variables like observations, states, controls, free energy, and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1157.723,
    "end": 1164.14,
    "text": " It wasn't straightforward to me how to plot those in the RX environment settings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1164.32,
    "end": 1170.797,
    "text": "Is there an example that you can point us to or a fragment of code that shows us how to do that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1172.382,
    "end": 1174.467,
    "text": "I can make it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1174.818,
    "end": 1203.357,
    "text": " because i i know how i can access so free energy is uh something that lives inside your agent so it's part of the inference process it's the it's the uh cost function if you will of of of the inference process so for free energy you would have to look at your uh would have to look into arcs and fur however everything that goes on in our environments we can extract it and we can plot it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1204.467,
    "end": 1213.756,
    "text": " So both environment states as well as emitted controls or observations, we can extract all those things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1216.099,
    "end": 1223.526,
    "text": "I can show a code fragment that does this because it's one line.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1224.627,
    "end": 1229.732,
    "text": "However, I also understand that that is not something that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.332,
    "end": 1233.715,
    "text": " well, you probably remember after this meeting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1233.755,
    "end": 1243.047,
    "text": "So I'll make sure that we can design an example that showcases this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1243.728,
    "end": 1249.956,
    "text": "But in a nutshell, we can create a keep actor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1250.777,
    "end": 1258.707,
    "text": "So this is, well, an entity that will keep all, everything that it gets.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1258.973,
    "end": 1277.387,
    "text": " uh we'll keep it inside memory and then we subscribe to the observations of the agent so we say subscribe to observations and with this ops keep actor we do this and if i then call ops values",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1279.898,
    "end": 1304.387,
    "text": " this will contain all kinds of well arts environment observations which is basically a wrapper struct for let me call data on this entire array and you'll get your individual observations so we can basically tap anywhere in this process",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1304.823,
    "end": 1309.789,
    "text": " Anywhere in this communication, we can tap whatever is being emitted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1310.61,
    "end": 1319.12,
    "text": "So if I run this again, now it will contain 400 elements because, well, this environment is reactively running while we speak.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1319.721,
    "end": 1323.085,
    "text": "So the agent is getting more and more observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1323.185,
    "end": 1332.636,
    "text": "So you see this thing reactively growing every time I call or extract its contents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1333.173,
    "end": 1338.221,
    "text": " So there is definitely functionality in which you can sort of inspect this process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1340.624,
    "end": 1345.111,
    "text": "But yeah, I have to stress that it's really distinct from the inference process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1345.131,
    "end": 1358.05,
    "text": "If you make an agent in RxInfer and you hook it up to RxEnvironments, then you have to set up a similar procedure to extract free energy and stuff like that from RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1358.671,
    "end": 1363.136,
    "text": " And because I'm not the author of RxInfer, I don't know how easy that is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1364.177,
    "end": 1371.345,
    "text": "But for RxEnvironments, yeah, this is one of the first things that I wanted to do, see what my agent was sending, see what my agent was observing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1371.786,
    "end": 1372.867,
    "text": "So I made sure to build it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1374.729,
    "end": 1379.334,
    "text": "Yeah, I'm not sure if what you just showed was recorded by us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1379.695,
    "end": 1386.923,
    "text": "So if you could just make sure that that is included in your examples as well, that would be excellent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1387.797,
    "end": 1389.819,
    "text": " Yes, that's my idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1391.561,
    "end": 1400.59,
    "text": "I just wanted to showcase for now such that you know that it exists, but it wasn't meant to be a big tutorial or anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1400.79,
    "end": 1407.297,
    "text": "I can just put it in the examples and then we can plot it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1407.558,
    "end": 1409.9,
    "text": "That's not a problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1409.92,
    "end": 1410.821,
    "text": "Okay, thanks a lot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1412.543,
    "end": 1412.843,
    "text": "You're welcome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1417.109,
    "end": 1417.69,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1417.71,
    "end": 1422.135,
    "text": "Anyone else can go for a question or we have some other written ones or I can ask you a question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1425.198,
    "end": 1425.819,
    "text": "I have a quick question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.899,
    "end": 1429.423,
    "text": "I would just wonder once I don't know if you guys can hear me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.603,
    "end": 1429.983,
    "text": "I hope so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.444,
    "end": 1430.964,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.346,
    "end": 1432.906,
    "text": "Fantastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.148,
    "end": 1441.876,
    "text": "A lot of the examples that you have there and kind of the way I'm I'm probably naive in how I'm thinking about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.818,
    "end": 1447.082,
    "text": "The arts environment is modeling something in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.585,
    "end": 1454.012,
    "text": " the real world, or at least that's the example that we're thinking of right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.613,
    "end": 1462.963,
    "text": "Is art environments capable of essentially modeling more metaphysical spaces?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.003,
    "end": 1473.795,
    "text": "So if you think of your question in a way that you have a time series or a space that you're trying to occupy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.075,
    "end": 1476.556,
    "text": " but it's not a physical space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.656,
    "end": 1484.344,
    "text": "It's a more theoretical space dimensionality that you're trying to have an agent navigate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.405,
    "end": 1504.002,
    "text": "Is that something that you see that this is usable for, or is this something that we need to kind of gear back towards the RxInfer package itself to kind of build the more metaphysical concept of the environment that you're putting together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.808,
    "end": 1505.889,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.69,
    "end": 1518.56,
    "text": "Yeah, if I understand your question correctly, yeah, my answer to that would be that there's no physics simulator or whatever in ARCS environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1518.58,
    "end": 1528.689,
    "text": "It's purely the boilerplate to make whatever you write act reactively and expose reactive streams that you can then use in ARCS.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1529.11,
    "end": 1534.174,
    "text": "So, for example, one of our colleagues has made a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1534.88,
    "end": 1542.83,
    "text": " an environment that returns the result of a stochastic differential equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1543.49,
    "end": 1554.023,
    "text": "So an agent could query with an action, I want the realization at time t, and the environment would respond with the actual value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1555.285,
    "end": 1561.512,
    "text": "And with this interplay of querying a stochastic differential equation and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1562.268,
    "end": 1571.777,
    "text": " and getting a result, you can cast stochastic differential equations sort of a Bayesian state-based model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1572.698,
    "end": 1574.94,
    "text": "I'm not an expert on this topic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.96,
    "end": 1577.943,
    "text": "I just know that one of our colleagues did this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1577.963,
    "end": 1588.073,
    "text": "So if I understand your question correctly, that would be the sort of environments you were after or you were questioning about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1589.572,
    "end": 1590.934,
    "text": " So I would say, yes, you can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1591.014,
    "end": 1596.961,
    "text": "So there's no, there's no physics simulator or anything in there because that's a whole different, a whole different topic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1598.002,
    "end": 1602.788,
    "text": "My main thing was just to make whatever code you guys write to make it reactive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1606.993,
    "end": 1607.434,
    "text": "Fantastic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1607.454,
    "end": 1607.774,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1607.794,
    "end": 1608.836,
    "text": "Now that makes a lot of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.856,
    "end": 1612.44,
    "text": "I just wanted to clarify that since perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.652,
    "end": 1621.544,
    "text": " not thinking so much in robotics or creating like physical environments and thinking more along the lines of data environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1621.584,
    "end": 1625.67,
    "text": "So that's why I was trying to understand how we could utilize this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1626.972,
    "end": 1627.232,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1627.733,
    "end": 1628.955,
    "text": "Yeah, you can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1629.075,
    "end": 1629.856,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1629.876,
    "end": 1632.24,
    "text": "And, uh, you can push it further, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1632.28,
    "end": 1636.486,
    "text": "You can make, uh, uh, a combination of the two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1636.506,
    "end": 1640.352,
    "text": "You can make a, uh, an environment that flies a drone,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1640.77,
    "end": 1658.222,
    "text": " uh your agent has to control the drone but it can also query the environment for hey what is going to be my position in five seconds so kind of this this well abstract action that's basically querying the environment well since we have this uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1658.978,
    "end": 1688.884,
    "text": " this mechanism that we can depending on what action you send correspond or match this with an observation now you can do stuff like that there's nobody stopping you doing it whether or not it's useful for your agent well that's up to you i i was just yeah i'm trying to make your environments as expressive as you can or your the framework as expressive as i can and yeah you you can you can go wild with it right you can go crazy and that's perfect because the agent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1689.286,
    "end": 1699.637,
    "text": " that I'm wanting to put together would need to actually walk through time in a certain way and optimize its activities in a time series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.919,
    "end": 1704.162,
    "text": "Yeah, I was already expecting you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1704.182,
    "end": 1705.704,
    "text": "That's why I brought up this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1707.246,
    "end": 1707.906,
    "text": "That's very cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1708.007,
    "end": 1717.517,
    "text": "I would be very excited to see, well, whether or not you can build your environment and our environments would be very cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1717.537,
    "end": 1718.398,
    "text": "Absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1719.307,
    "end": 1720.229,
    "text": " I'll keep you updated then.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1721.431,
    "end": 1721.691,
    "text": "Nice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1721.911,
    "end": 1722.172,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1724.315,
    "end": 1737.217,
    "text": "The observable and actor roles in Craig's experiments, can any entity take on either of these roles, or are there certain constraints?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1737.277,
    "end": 1744.69,
    "text": "For example, let's say the agent must always have the actor role or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1746.627,
    "end": 1750.154,
    "text": " No, they're completely unconstrained.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1750.875,
    "end": 1762.898,
    "text": "There is no real distinction under the hood between entities or between something that represents an environment or something that represents an agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1763.468,
    "end": 1785.561,
    "text": " uh they are both entities in arcs environments um the only thing is that you can make uh something which i call an active or a passive entity by the way all this terminology it's all up for discussion i've thought about this and most of the terms that i come up with there they don't really fit what i what i'm trying to say um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1786.334,
    "end": 1798.788,
    "text": " But an active entity is something that whenever it gets an observation or whenever it receives an action, it emits or at least considers emitting to its subscribers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1798.848,
    "end": 1804.214,
    "text": "For example, the mountain car environment itself would be an active entity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1804.695,
    "end": 1816.088,
    "text": "Whenever the agent sends an action to move the car, it will correspond or it will match this action with, well, moving the car.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1816.523,
    "end": 1822.911,
    "text": " Whereas the agent, whenever it gets an observation from the environment, well, it doesn't really have to do anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.431,
    "end": 1829.979,
    "text": "We have to, in a later stage, attach an inference process, but that is something that's not RxEnvironments, that is RxInfer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1830.039,
    "end": 1844.657,
    "text": "So we make this entity passive in a sense that it's an observer that can also send actions, but those are not triggered by an actual algorithm that we write ourselves",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1845.127,
    "end": 1873.952,
    "text": " uh in arcs environments but it's a result of some inference process it's the triggers are external to the the reactive ecosystem that we've built in arcs environments itself so that's the only distinction that i make but you can yeah something that represents an environment is something that represents an agent they're they're under the hood completely the same things they're just uh entities that that that can communicate with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1874.472,
    "end": 1895.097,
    "text": " with with external entities do you think you could um in addition add a discrete control space example for us as well because mountain car and the abrasion thermostat are both continuous examples",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1896.697,
    "end": 1915.403,
    "text": " Even if it's just a simple discrete control space or categorical in particular, categorical control space, maybe a simple maze example or a grid example, you know, like the windy grid that's often used in reinforcement learning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1916.324,
    "end": 1918.507,
    "text": "Even if it's just a simple grid.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1919.769,
    "end": 1922.192,
    "text": "Windy grid.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1922.212,
    "end": 1922.933,
    "text": "Windy grid.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1923.534,
    "end": 1924.776,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1924.796,
    "end": 1926.518,
    "text": "Okay, I'll Google that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1927.882,
    "end": 1937.153,
    "text": " Even if it's just a simple categorical control space, because that's what our problems currently center around.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1937.173,
    "end": 1942.339,
    "text": "Not so much continuous control spaces, but categorical control spaces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1944.121,
    "end": 1946.323,
    "text": "Okay, that's, yeah, I can do that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1947.224,
    "end": 1948.045,
    "text": "Okay, I see.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1948.586,
    "end": 1949.367,
    "text": "Windy crypt world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1950.428,
    "end": 1951.99,
    "text": "Okay, I can do that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1954.292,
    "end": 1955.073,
    "text": "Okay, excellent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1955.433,
    "end": 1955.914,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1959.421,
    "end": 1966.512,
    "text": " Can I ask a sort of a very quick, broad question about the whole ontology bit?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1967.15,
    "end": 1981.793,
    "text": " When I first learned about this, my own naivete and just sort of looking through the docs, I thought, oh, okay, this is a wrapper around Rx and Fur for standardizing the creation of an environment that you will then use for whatever purposes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.654,
    "end": 1984.417,
    "text": "But it sounds to me it's not at all that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.138,
    "end": 1990.807,
    "text": "It's really, this is not even really a way of talking about an environment per se.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.869,
    "end": 1993.191,
    "text": "No, it's more of a...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1994.217,
    "end": 1997.223,
    "text": " It's a communication protocol for active inference agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1998.625,
    "end": 2005.378,
    "text": "This is a way to standardize the dyadic interaction between two abstract entities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2006.56,
    "end": 2010.988,
    "text": "That could be between environment and an agent, or it could be something else entirely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.69,
    "end": 2016.158,
    "text": "That's much broader than what I was conceptualizing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2016.931,
    "end": 2027.683,
    "text": " So when I started this, indeed, I started as, OK, I want to standardize environment creation in our ecosystem, in our .",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2027.703,
    "end": 2033.649,
    "text": "And I had a discussion with Magnus Koudal, who's also in this Discord I saw.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2034.831,
    "end": 2036.733,
    "text": "And, well, we had some very interesting talks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2036.753,
    "end": 2041.538,
    "text": "And he said, well, actually, an environment and an agent, they're not so different, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2042.817,
    "end": 2070.664,
    "text": " they just hand or they just receive data from each other and handle them accordingly so yeah there is a certain uh symmetry there and then i thought well if there's a symmetry there then i can make an overarching uh programming concept and just kind of implement it that way and that's what i did and then it turned from just a way in which you can make an agent and an environment communicate to a package in which you can communicate this whole network of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2071.302,
    "end": 2094.947,
    "text": " uh of subscriptions and communications um because there's yeah there's no constraints anymore so for example we run an environment in in uh in our lab with marco actually that um has well in a non-trivial uh entity interaction where we have a hearing aid that uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2095.636,
    "end": 2124.529,
    "text": " gets data from both the external world because it can well it has a microphone and it should register the external world but it can also get data from the user of the hearing aid saying hey unhappy with the hearing aid settings yes or no so now we have a three entity environment we have the user we have the hearing aid and we have the uh the external world that just emits noise",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2124.897,
    "end": 2147.749,
    "text": " then we have a fourth entity which is our agent that should learn the preferences of the user that should get data from the hearing aid and should uh tweak the parameters inside of the hearing aid so now we have four entities that are communicating in this non-trivial way and well we built this in arcs environments and it all holds up like it all just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2148.387,
    "end": 2175.93,
    "text": " yeah it runs just because whenever we get data the hearing aid knows ah i get new data i get new noise i have to transform this noise and send it to the user and i have to do a free transform and send it to the agent for analysis uh and just because it does this reactively it's all tractable and all works nicely so yeah uh it it turned out to be a bit of a uh a bigger",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2176.653,
    "end": 2204.078,
    "text": " well scope than i would have imagined but i'm yeah i i'm not making any claims on on how large it actually is that's uh yeah cool this this is also very cool and i'm very very thankful that you're working on this because i i had the thought like oh well what what what then is you know sort of predicated off the environment it's kind of like well we have the environment and the asian they're kind of both being equally treated here so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.425,
    "end": 2207.609,
    "text": " That's a very interesting question, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.709,
    "end": 2211.776,
    "text": "So what is the actual difference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2213.399,
    "end": 2220.01,
    "text": "Some people say, well, an agent has some sort of inferential process on how it comes up with an action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2220.05,
    "end": 2225.419,
    "text": "But in a sense, well, we are all just with our eyes and ears and muscles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2225.479,
    "end": 2230.167,
    "text": "We have an interface to the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2230.4,
    "end": 2253.555,
    "text": " yeah in in that sense we we are just all mark of blankets with internal states that that navigate this world uh and this well communication that we have with our outside world i i try to replicate that fantastic thanks",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2255.83,
    "end": 2280.707,
    "text": " anyone else want to ask any questions yeah christoph or yeah question um i didn't quite get what you um what you said about the difference between the typical reinforcement learning setting and uh rx environments could you um could you could you explain that again please that was very interesting sure if if you want or if you make an environment in gym in gymnasium we can we can look at the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.345,
    "end": 2305.395,
    "text": " um at their documentation right so let's see gymnasium package so i go to gymnasium and i want to make my own custom environment i saw it here make your own custom environment i've visited this page before so we can make our environment blah blah and then you have this function step",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2305.983,
    "end": 2310.027,
    "text": " The step method usually contains most of the logic for your environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2310.047,
    "end": 2319.838,
    "text": "It accepts an action, computes the state of the environment after applying that action, and returns a five-tuple observation reward terminated truncated info.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2321.199,
    "end": 2325.003,
    "text": "So we write a function step that takes only an action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2325.804,
    "end": 2334.133,
    "text": "So this is the main design paradigm of GIM and most reinforcement learning packages, actually, where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2334.35,
    "end": 2361.285,
    "text": " i emit an action this action is incorporated into the world but the time that the environment is stimulated forward is constant so there's no notion of different time intervals whereas if i'm i'm a very big uh football aficionado for the americans that's soccer but it's actually football",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2362.109,
    "end": 2390.901,
    "text": " but if i kick a ball i kick the ball the ball starts rolling well whether or not i do something the ball will just continue rolling like this this environment around me it doesn't wait for me to emit additional actions or i'm not consciously saying okay for the next second i do nothing and then the ball rolls okay for the next second i do nothing again and the ball rolls further no there is a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2391.623,
    "end": 2415.268,
    "text": " in the real world there is a difference right we do something and then the world just continues so we can do something at any point in time and the world around us will just well the world keeps on turning um and that's what i was trying to do with with rx environments is to um alleviate ourselves of this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2415.856,
    "end": 2425.967,
    "text": " um communication protocol because this specifies i get one observation i can do one action per observation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2427.044,
    "end": 2453.71,
    "text": " and that's it and in between different observations i have no power to do anything whatsoever also if i have an environment that instead of modeling one second forward i now do half a second well everything breaks down because now i have to emit actions at twice the speed or my observations don't correspond anymore with my internal model or there's all kinds of stuff that if you do",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2454.145,
    "end": 2470.551,
    "text": " it's like this it turns kind of awkward and that's what i was trying to alleviate uh with with arc's environments is that i'm trying to make this communication between agent and environment as free as possible so if you have a hearing aid environment",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2471.088,
    "end": 2473.872,
    "text": " Yeah, that's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2474.393,
    "end": 2476.115,
    "text": "Yeah, I'm rambling, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2476.356,
    "end": 2478.038,
    "text": "Good that you interrupted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.058,
    "end": 2479.28,
    "text": "That's a good explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.38,
    "end": 2491.057,
    "text": "And I think you also mentioned something about some difficulty there, because the question then becomes, if you have multiple agents interacting with the environment, then what exactly is the state of the world, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.561,
    "end": 2499.289,
    "text": "What exactly is the state of the world is not... Because you can just sort of...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2500.737,
    "end": 2528.179,
    "text": " you can have like a god entity that takes care of of this stuff that that kind of resolved all conflicts in that sense um the main question for me would be well we just took away your one moment to conduct an action in reinforcement learning you have one moment you can do an action and you'll get one observation we just took away this one moment and gave you the opportunity to act at any point in time well when are you going to do it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2528.547,
    "end": 2528.847,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.248,
    "end": 2536.597,
    "text": "So, you know, the reason I'm asking about this is that it immediately got me thinking about Stephen Wolfram's work on observer theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.038,
    "end": 2540.462,
    "text": "So he's trying to formalize the notion of an observer, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.803,
    "end": 2552.057,
    "text": "And there is this whole field that he basically invented for the physics project related to what he calls multi-computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.037,
    "end": 2557.345,
    "text": " I'm not really deep into that yet, but it seems somehow relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.525,
    "end": 2571.345,
    "text": "As an agent interacting with the environment, we effectively sample it precisely because it keeps rolling as we do the internal computation required to update our generative model in order to act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.646,
    "end": 2575.893,
    "text": " So I think you stumbled onto something quite profound there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.654,
    "end": 2580.901,
    "text": "And the question is about this God mode view, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.941,
    "end": 2587.431,
    "text": "That's an old question in physics, whether there exists the absolute reference frame or whether everything is relative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.653,
    "end": 2592.5,
    "text": "And yeah, I just want to say that, you know, food for thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.54,
    "end": 2594.543,
    "text": "There's some interesting problems there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.583,
    "end": 2596.827,
    "text": "Maybe we can talk about it sometime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.267,
    "end": 2598.97,
    "text": "I would love to hear your thoughts about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.895,
    "end": 2600.476,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2600.676,
    "end": 2602.559,
    "text": "I'm very interested in this stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2602.939,
    "end": 2614.676,
    "text": "So as a software developer, I would advise you in your environments, if you're not dealing with, you know, existential stuff that just make a God state that takes care of this, but you make a very good point, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2614.916,
    "end": 2624.67,
    "text": "So if we really want to make an accurate representation of the world, do we need this God state or because we now allow our environments to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2625.764,
    "end": 2641.09,
    "text": " to alleviate this right we can have multiple entities that together compose the environment and then there is some internal communication between them so um it does it does open up this door like it doesn't slam it wide open but at least you know there's a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2642.015,
    "end": 2644.398,
    "text": " In Dutch you would say open gear.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2644.919,
    "end": 2646.801,
    "text": "No Dutch people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.821,
    "end": 2656.233,
    "text": "I think that's a potential incursion into effectively resolving some of the most interesting problems in the fundamental theories of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.395,
    "end": 2668.309,
    "text": "Understanding precisely which one is the case, whether it is this absolute reference frame or whether you can just simply explain everything through these relative reference frames and agents sampling the environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.289,
    "end": 2681.483,
    "text": " And if you can effectively recover something that looks like physics from this interaction, which is what Wolfram is essentially working on, that would be a complete computational fundamental theory of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.624,
    "end": 2692.035,
    "text": "And it's a big undertaking, but it's worth considering, not just merely from software engineering perspective, but from that angle, if you're interested in that kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.804,
    "end": 2695.946,
    "text": " I mean, yeah, it's very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2695.987,
    "end": 2700.972,
    "text": "There's something that, uh, you know, it's a very big deviation from what my supervisor wants me to work on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2700.992,
    "end": 2706.839,
    "text": "So it's probably not something that I'm going to undertake, but if anyone wants to pick it up, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2706.859,
    "end": 2707.64,
    "text": "Who am I to stop them?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2715.749,
    "end": 2716.01,
    "text": "Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2716.03,
    "end": 2716.59,
    "text": "It's great work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2717.431,
    "end": 2717.772,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.315,
    "end": 2720.615,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.635,
    "end": 2723.338,
    "text": "Anyone else want to ask any questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.309,
    "end": 2738.038,
    "text": " How would you deal with the setting of multiple ant nest mates moving around and modifying the pheromones on the ground?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.899,
    "end": 2749.511,
    "text": "So in these kinds of simulations, it's common enough to have the pheromone pheromone state on the ground, and then nest mates that are reading and writing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.432,
    "end": 2756.278,
    "text": "How do you deal with the spatial proximity and the collisions and interactions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.57,
    "end": 2762.275,
    "text": " So that is something very, very, very difficult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2762.415,
    "end": 2768.723,
    "text": "I'm working on a project right now where, once again, we're modeling football, which is why I brought up this example just now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2769.724,
    "end": 2773.729,
    "text": "And resolving collisions is something extremely difficult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2774.089,
    "end": 2786.645,
    "text": "It's something that I don't have a standardized, advised way of doing in ARX environments just because game studios, they spend God knows how many developer hours on resolving collisions efficiently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2787.105,
    "end": 2788.527,
    "text": "So that's not something that I think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2788.878,
    "end": 2810.953,
    "text": " well we we can figure out in an afternoon right um it's it's something that would be in the internal dynamics of your environment but not something that is part of your communication protocol per se just influences the the type of observations that your agent would get um so it's not something that i can give that i feel qualified to give advice on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2812.57,
    "end": 2818.078,
    "text": " But it is like making this environment with ants running around the floor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2818.498,
    "end": 2823.385,
    "text": "That is something that's just a multi-agent environment that's fully covered.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2823.405,
    "end": 2827.13,
    "text": "The problem is the collisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2827.631,
    "end": 2828.592,
    "text": "That is a difficult thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2829.774,
    "end": 2834.861,
    "text": "It's not difficult in an ARCS environment perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2834.921,
    "end": 2841.75,
    "text": "It's difficult in a computational geometry perspective that you want to resolve collisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2842.591,
    "end": 2846.638,
    "text": " Like in AAA games, you can still clip into walls somewhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2847.9,
    "end": 2849.703,
    "text": "That's a great and funny response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.743,
    "end": 2857.817,
    "text": "Yeah, I would just highlight the real structural difference when you pointed to the step function in the gymnasium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.679,
    "end": 2865.491,
    "text": "That is why in so often for these control problems, there's like a null action or like a weight action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.991,
    "end": 2868.075,
    "text": "So you kind of get this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.865,
    "end": 2898.248,
    "text": " bimodal action vector policy vector where there's like a do nothing option and then all the options because out of requirement something must be emitted at every click of the simulation and all of a sudden it's like we moved from walking on a staircase to like ice skating or flying with rx and fur because it has totally opened up a dimension of the control question when to act not just which with according to a metronome",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.869,
    "end": 2907.504,
    "text": " And that's an entirely different approach that the communication protocols enable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.105,
    "end": 2916.378,
    "text": "And then those communication protocols can have all these other functionalities, like they can have a sub ontology or they can have compliance features as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2916.879,
    "end": 2919.704,
    "text": "So it's super powerful and we're very excited to learn it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.086,
    "end": 2922.649,
    "text": "That's yeah, that's the main point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2923.034,
    "end": 2926.177,
    "text": " Yeah, it's two sides of the same coin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2926.738,
    "end": 2931.083,
    "text": "It opens up this communication protocol, but then, yeah, you have to question when.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2932.925,
    "end": 2933.205,
    "text": "When?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2933.586,
    "end": 2936.609,
    "text": "It's something that I'm going to spend time on in my next project.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2936.769,
    "end": 2940.733,
    "text": "Can we make an iterative procedure, maybe with iterations and arcs and thirds?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2940.813,
    "end": 2947.02,
    "text": "We can send intermediate posteriors, and we always have an action that we supply.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2947.581,
    "end": 2948.542,
    "text": "I don't know yet.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2948.562,
    "end": 2949.223,
    "text": "I have no idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2950.484,
    "end": 2952.366,
    "text": "I have ideas, but I don't have anything working yet.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2955.333,
    "end": 2978.383,
    "text": " I think, to me, the underlying principle of the first suite versus traditional intercom is that instead of having synchronized communications, we now have asynchronous communications between everything.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2978.403,
    "end": 2979.585,
    "text": "Between everything, yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2986.602,
    "end": 3006.923,
    "text": " i'm glad i got that point across that's that's the point i wanted to make great well um if anyone else has a question otherwise we will continue learning and watching the github updates and just building out examples because in the coming months we know a lot of fun things will happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.164,
    "end": 3009.505,
    "text": " All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3009.765,
    "end": 3010.968,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3010.988,
    "end": 3015.259,
    "text": "You guys can always reach out to me on, I don't know, GitHub, Twitter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3015.86,
    "end": 3018.447,
    "text": "I don't know how often I'll check Discord.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3018.467,
    "end": 3019.83,
    "text": "I'll try, you know, I'll try.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3020.512,
    "end": 3025.343,
    "text": "But you can always reach out to me on LinkedIn, Twitter, whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3025.484,
    "end": 3026.025,
    "text": "That's all fine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3029.06,
    "end": 3055.641,
    "text": " excellent i i do have a final question if that's all right um sure just just with respect to you know future directions and that kind of thing what's kind of the biggest problem set of problems what are you kind of looking to do i know that's a massive thing but is there anything relatively summative in that direction that you could perhaps speak to just for just a second so i'm very interested in this when to act uh problem so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.144,
    "end": 3067.707,
    "text": " This, to me, opens up the door to an agent that, because we, okay, so,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3068.058,
    "end": 3074.765,
    "text": " We can now act at any point in time, or at any point in time, we can send something to the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3075.025,
    "end": 3082.993,
    "text": "A logical consequence for me is that at any point in time, we should have an action ready to send.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3083.013,
    "end": 3087.037,
    "text": "So when the next observation comes in, we don't know when that's going to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3087.517,
    "end": 3089.92,
    "text": "We should be able to act.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3089.94,
    "end": 3094.865,
    "text": "So we have a certain computational budget between one observation and the next.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3095.285,
    "end": 3097.407,
    "text": "We don't know how much it's going to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3097.927,
    "end": 3099.589,
    "text": " but we do have a budget to spend.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3100.35,
    "end": 3110.484,
    "text": "So I want to design indeed an iterative procedure that comes up with an action and then refined it and refined it and refined it until, well, the next observation comes in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3110.765,
    "end": 3116.172,
    "text": "So we have to send whatever we had and we get the next observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3116.388,
    "end": 3144.859,
    "text": " this gives you if this all works right this gives you a very nice robust agent that if you give it a lot of computing power a lot of computational budget then in between observations well it's going to be able to come up with a pretty good um pretty good action that will solve the task accordingly like ideally however if you limit this uh this computational budget you put it on like a raspberry pi or an edge device",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3145.261,
    "end": 3173.31,
    "text": " it will not have as much iterations to refine its actions so it will still solve the problem hopefully but it will be less efficient doing so it will be slightly dumber so this is a very to me it's a very interesting problem to think about because then you have a sort of a procedure for control that is robust to loss of computation or whatever and it's still adaptive and reactive and and all those nice things we get from from asian inference",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3174.235,
    "end": 3203.871,
    "text": " um so yeah that's something that i that i would want to work on if i you know at 48 hours in the day it's very interesting so it sounds to me like the number of iterations you just referred to is the iteration field in the call of the infer function yes yes if i can do something like that so i run an indefinite amount of iterations and i just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3204.155,
    "end": 3231.462,
    "text": " stop the inference procedure whenever i have to do something and then i extract the latest posterior for the action and i i send that to the environment yeah that's something well that would be the first thing i would investigate yeah i certainly think it has the potential to make the behavior in general uh quite robust if you if you consider that approach",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3232.589,
    "end": 3238.358,
    "text": " It would always have something to do, like it would always do something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3238.959,
    "end": 3250.416,
    "text": "Whether or not the free energy would converge as a measure of whether or not this action is good enough, that is to be investigated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3250.536,
    "end": 3259.069,
    "text": "But it would allow us to run the same models on edge devices as well and get slightly worse performance, but still",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3260.163,
    "end": 3289.258,
    "text": " yeah yeah it would still do the job we and then you can investigate you know how many iterations do i actually need before i can solve the problem uh it's of course problem dependent but yeah it's a very yeah it's just something that that really interests me i really like this this way of thinking um and it's in part why why i wrote this package because i i don't like this this this synchronized communication protocol from jim i just i just don't like it yeah that's why i wrote wrote arts environments",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3290.437,
    "end": 3296.987,
    "text": " I think the only alternative is to not be able to respond whenever it gets an observation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3297.047,
    "end": 3299.951,
    "text": "In other words, to postpone your response.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3301.013,
    "end": 3301.814,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3301.834,
    "end": 3306.962,
    "text": "It nudges back into the synchronicity approach again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3307.543,
    "end": 3313.592,
    "text": "So it breaks away from the reactiveness of the whole thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3315.395,
    "end": 3319.04,
    "text": " But then you run into the robustness issue, I would say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3319.08,
    "end": 3338.909,
    "text": "If you have a self-driving car and it's driving into a wall because it thinks it's a green light, because those things are not that smart nowadays, and it figures out it's a wall, but it takes some time to adjust or it takes some time to come up with the idea, okay, now I have fully converged on the action that I have to steer away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3339.249,
    "end": 3341.472,
    "text": "Well, by that time, we might have already crashed into the wall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3343.655,
    "end": 3344.136,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3344.707,
    "end": 3368.672,
    "text": " this this queuing up of uh of observations and waiting until uh my computation is fully converged i think it takes away the robustness like if you if if you don't have enough computational budget to spend well yeah you might do the wrong thing it's the same as when you and i are in a car right if we're in a very um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3369.867,
    "end": 3398.187,
    "text": " a very busy situation so well i'm in the netherlands so we have cyclists right so if we have cyclists we have other cars there's a an ambulance coming whether it's very busy you might feel overwhelmed but you still kind of know the basic things to do to to to steer your car it's basically the same where you have limited computational budget there's all this stuff around you so to come up with a really thought through response or action",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3398.605,
    "end": 3428.022,
    "text": " uh it's too much to ask because you don't have the computational budget but your brain kind of prioritizes and says well if we stay on the road and we let the ambulance pass and well we're fine for now we're this is the best we can do um so this feeling of being overwhelmed by what what goes out on around you inspired this idea of of robustness and uh uh of interruptability basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3431.14,
    "end": 3452.845,
    "text": " yeah but then again how i'm going to do it well no idea yet or run rx infer iterations and see if i can uh can send intermediate posterior results or something or but it's just something yeah i find this very very very interesting awesome it's a good thing that free energy in general",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3454.377,
    "end": 3458.443,
    "text": " decays predictably in a sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3458.463,
    "end": 3475.049,
    "text": "So, I mean, just fully using your budget, your computational budget for the time that you're looking for the next observation over this, I think it's fairly safe to just use the current value of the posterior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3475.069,
    "end": 3477.532,
    "text": "That's the best you can do under the circumstances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3479.115,
    "end": 3481.178,
    "text": "Yes, that would be the argument indeed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3484.55,
    "end": 3492.339,
    "text": " Hopefully, this opens up the road to having actual robots driving around instead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3492.5,
    "end": 3496.665,
    "text": "Because, well, there's no self-driving cars where I live.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3496.705,
    "end": 3499.288,
    "text": "There's no robots or drones flying around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3499.348,
    "end": 3503.093,
    "text": "And I think one of the reasons is because they're not robust or interruptible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3506.777,
    "end": 3507.238,
    "text": "Well, we agree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3507.418,
    "end": 3507.638,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3509.812,
    "end": 3510.234,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.358,
    "end": 3512.041,
    "text": "Thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.844,
    "end": 3518.385,
    "text": "We'll look forward to staying updated, asynchronously even.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.927,
    "end": 3521.979,
    "text": "Asynchronously, reactantly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3521.999,
    "end": 3522.561,
    "text": "See you all soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.782,
    "end": 3524.85,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]