[
  {
    "start": 5.988,
    "end": 6.95,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.311,
    "end": 12.982,
    "text": "This is Active Inference Model Stream number 10.1 on April 4th, 2024, 4-4-24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.064,
    "end": 21.178,
    "text": "And we're really excited today to be with Bart Van Erp and Albert Potasenko.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.158,
    "end": 41.023,
    "text": " talking about building a drone with rx infer we have an ongoing rx infer learning group at the institute and a lot of participants have been excited to use even early versions of this package and connect it to all the exciting math and developments so thank you both for joining looking forward to this very pragmatic presentation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.995,
    "end": 68.513,
    "text": " awesome thanks daniel thanks for the kind words and nice introduction also welcome everyone online and as we daniel mentioned we're gonna build a drone today so last week i didn't know anything about drones whatsoever but in the meantime i was able to craft one with the help of my colleagues and i want to kind of transfer the learning experience that i obtained over this week to all of you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.493,
    "end": 78.297,
    "text": " such that you can leverage the power of our toolbox RxAffair in the end to make your own very cool applications, your own drone, your own autonomous vehicle, whatever you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.078,
    "end": 82.266,
    "text": "And we will then be there also to support you in this journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.107,
    "end": 84.369,
    "text": " But for now, let's get started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.91,
    "end": 87.234,
    "text": "How are we going to build a drone with RX Infer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.855,
    "end": 90.841,
    "text": "So first of all, let me briefly introduce myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.881,
    "end": 91.963,
    "text": "My name is Bart van Erp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.524,
    "end": 98.955,
    "text": "I'm a PhD student and teaching assistant in BIOSEP, which is the research group here at Eindhoven University of Technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.935,
    "end": 107.325,
    "text": " And together with Albert who is also live and will also be monitoring the chat in case there are any questions pop up along the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.345,
    "end": 110.208,
    "text": "We will be your host today together with Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.59,
    "end": 113.793,
    "text": "This talk will be supported by ReactiveBase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.454,
    "end": 121.602,
    "text": "So ReactiveBase is the over coupling GitHub organization of RxInfer and all the packages on which it's built.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.987,
    "end": 134.005,
    "text": " at the moment we're looking for contributors so if you have if you're interested after this talk please reach out and then definitely we can get you acquainted with the toolbox and with our environment there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.415,
    "end": 159.486,
    "text": " so we're from bias lab the eindhoven university of technology we are located here in eindhoven also called city of light and from here we're doing very interesting research on building agents probabilistic graphical models and using these to craft all kinds of engineering applications trying to solve real world problems with our engine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.592,
    "end": 184.326,
    "text": " our engine rx infer you might have already heard about this but our engine is a julia engine which allows us to perform automatic bayesian inference specifically through reactive message passing the engine that we have built is completely reactive which means that it doesn't do anything unless there is something to do for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.728,
    "end": 200.627,
    "text": " so it's relatively energy efficient because it doesn't consume energy during all the other moments and we perform message passing but i'll give a more in detailed discussion on this more explanation will follow later in this talk",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.805,
    "end": 205.509,
    "text": " And we're going to use this toolbox in order to craft a drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.71,
    "end": 218.365,
    "text": "A drone that can actually fly using some simplified drone mechanics, go from position A to position B. And I'm very eager to show you how this journey, how this development journey looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.286,
    "end": 220.127,
    "text": "So let's get started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.989,
    "end": 226.154,
    "text": "So what I'm going to talk about are three parts basically in this talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.435,
    "end": 229.939,
    "text": "I'm going to first start off with the model specification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.341,
    "end": 253.615,
    "text": " in the bayesian inference methodology the first part is always that we need to craft a model and this model will include some drone physics so i'll be taking you back to high school where you learned all these concepts refresh a couple of them and based on that i'm gonna construct a generative model of how a simplified drone would look like furthermore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.949,
    "end": 277.138,
    "text": " i'll then continue upon the probabilistic inference so if we have crafted this model and we want this model actually to do something inference allows us to compute posteriors in this model and the inference on this model is actually the underlying control algorithm that we will be crafting and this will be automated using our toolbox rx infer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.844,
    "end": 307.024,
    "text": " then finally we'll wrap up with some experiments and then there will be plenty of time to answer any questions that you might have let's get going for the model specification we're going to start off with some simplified drones physics it will be very easy for some a refresher for others but hopefully throughout this uh throughout these following couple of minutes you'll have a basic understanding of how a drone works we have greatly simplified it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.628,
    "end": 325.654,
    "text": " because of course going into the details of three uh three-dimensional drones with wind all that kind of stuff would be a bit too much for just a single live stream but we hope to offer you the tools and maybe the machinery to create these more complicated models yourself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.798,
    "end": 328.46,
    "text": " So we have this very nice throne here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.282,
    "end": 332.927,
    "text": "And what we're interested in is what forces act on this throne.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 333.327,
    "end": 334.829,
    "text": "So we're going to simplify this a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.39,
    "end": 345.344,
    "text": "And we're saying that each of the rotors, so the left and the right rotor, produce some kind of upward force pulling this throne from the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.886,
    "end": 355.759,
    "text": "Of course, we also walk around on Earth and we know that there is also a force that opposes this, namely gravity, which tries to pull us to the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.431,
    "end": 383.839,
    "text": " well combining these two forces allows us to either increase or decrease the altitude of this drone and make it fly that's the entire goal in the end the goal will be to come up with these forces these fl and fr such that our drone flies from location a to a location b if we do the computations a bit and see what are the kind of the net force forces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.055,
    "end": 412.999,
    "text": " acting on this drone is in this case we see that we have a vertical component fy which is the sum of the individual forces created by the motor minus the force of gravity that's acting upon the drone and in the horizontal direction because everything is nicely aligned we have a net force of zero if there would be wind for example there would be a contribution there but in the simplified model i assume that well there is no horizontal component as of yet",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.413,
    "end": 427.894,
    "text": " But if we tilt the drone a bit with a certain angle theta, we actually see that this theta not only affects, of course, the horizontal or the vertical net force, but also the horizontal one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.276,
    "end": 438.21,
    "text": "So based on this, we can obtain equations for this horizontal and vertical force acting upon the drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.923,
    "end": 451.409,
    "text": " The motors, we assume that they are at a distance r, a radius r, from the center of mass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.489,
    "end": 460.218,
    "text": "So we very simplistically assumed that the center of mass of the drone is at the radius r from its rotor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.278,
    "end": 465.823,
    "text": "So the force, you can think of it as acting upon an arm, creating a specific moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.405,
    "end": 472.129,
    "text": "So the torque that gets generated by these rotors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.413,
    "end": 497.509,
    "text": " with respect to the center of mass of the drone is the difference between these two forces multiplied with the radius r. With these three equations, so the net forces acting upon the drone and this net torque that we can compute based on the rotation that the drone wants to go to, we can already construct a big part of the model of this drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.071,
    "end": 522.855,
    "text": " so these are kind of the forces that we that act upon the drone horizontal vertical direction the rotation as given by this torque and we want to convert these forces into motion because in the end we want to move the drone and we want to figure out what forces are required to move from a position a to a position b using newton's law we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.375,
    "end": 530.924,
    "text": " already know that our force is equal to our mass multiplied with our acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.625,
    "end": 537.711,
    "text": "In other words, our acceleration is our force divided by our mass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.632,
    "end": 547.102,
    "text": "So based on the net forces that we just computed, we can also extract the equations for the accelerations in the vertical and horizontal direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.545,
    "end": 552.488,
    "text": "These accelerations accumulate, so if we integrate over them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.923,
    "end": 576.754,
    "text": " get actually a velocity so an incremental change in our velocity you can think of is actually this acceleration times this incremental change in time which gives us kind of a relationship so if we increase the acceleration over a period of time then we also know that that will lead to an increase in our velocities in both the horizontal and vertical direction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.763,
    "end": 583.811,
    "text": " If we take this even a step further, then we can also start to model the actual position of the drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.932,
    "end": 591.4,
    "text": "So integrating over this velocity will give us our position in both the X and Y direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.005,
    "end": 597.628,
    "text": "Basically, every small change in X",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.013,
    "end": 624.679,
    "text": " will be a result of the particular velocity over a small period of time and with this set of equations it actually becomes possible to extract the movements from these net forces of the drone so that's basically the movement so how it moves from left to right up and down but there is this additional component to the drone namely its angle because its angle also changes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.017,
    "end": 656.37,
    "text": " the acceleration in the angle so the angular acceleration alpha here is the torque divided by the moment of inertia of the drone you can think of this as being very similar to newton's equation with the forces and the mass which give us the horizontal vertical acceleration but this is just the similar similar equation that's used for actually angular acceleration similarly we can also compute the angular",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.722,
    "end": 682.577,
    "text": " velocity so omega because a small increment in this angular velocity will be our angular acceleration times a small fraction of time so integrating over the angular acceleration will give us the angular velocity and you might have already guessed this based on this we can also compute a new angle so the angle is this velocity integrated over time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.245,
    "end": 713.391,
    "text": " very similarly as we derived the equations for the actual movement of the drone and together these net forces these equations for the movement of the drone and these simplified equations for the rotation they constitute the drone dynamics so it might have seemed like a recap from high school but for the simplified example this is all that we actually need in order to craft this drone and that's what i'm going to show you right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.543,
    "end": 727.298,
    "text": " Because these equations of motion, I'm going to write down in a function, specifically a Julia function, because that's the language that RxInfer also uses under the hood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.66,
    "end": 732.766,
    "text": "So we're going to create this function f, and I'm going to walk you right through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.846,
    "end": 735.55,
    "text": "There are just 15 lines of code, so I think this should be manageable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.972,
    "end": 739.976,
    "text": "So we have a function f, which accepts the state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.076,
    "end": 746.365,
    "text": "So you can think of this state as the positions, velocities, angle and angular velocities of the drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.425,
    "end": 774.613,
    "text": " the actions to which we refer to the forces on the left and right rotor the particular drone like what are the characteristics of that drone and the environment so are we on mars are we on earth all those attributes that are environment related so in the first three lines what we're going to do is we're going to extract some information so we're going to extract the forces from our actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.235,
    "end": 787.707,
    "text": " we're going to extract the mass, the moment of inertia, and the radius of the drone, because these are properties that correspond to the particular drone that we're using, and the gravity we're going to just grab from our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.048,
    "end": 791.411,
    "text": "Because if we would be on Mars, we would have very different dynamics, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.974,
    "end": 800.5,
    "text": "Then from the state, what we extract are x and y, which are horizontal and vertical positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.442,
    "end": 828.985,
    "text": " vx and vy which are velocities in the horizontal and vertical direction data which was our angle and omega which was our angular velocity with all these properties characteristics and states extracted we can actually start implementing the equations that we have on the left so fg which is the force generated by the gravity is simply equal to the mass times the gravitational constant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.108,
    "end": 835.254,
    "text": " Fy and Fx are merely copied from the equations on the left.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.355,
    "end": 840.301,
    "text": "So it's the sum of the forces multiplied with cosine or sine of the angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.302,
    "end": 846.83,
    "text": "And for the y force, the net y force, we also subtract the gravity because there it has an influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.372,
    "end": 850.975,
    "text": "And for the net torque, we do the similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.156,
    "end": 860.068,
    "text": "So we extract the difference between the force generated by the left and right rotor and multiply that with the radius in order to get us a torque.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.39,
    "end": 891.861,
    "text": " then next up is we can based on these forces we can compute the accelerations in the x and y direction so f of x divided by m will give us these accelerations or f of y divided by m for the vertical acceleration we're going to take a very crude euler approximation so we're going to do a linearization in order to actually create a new velocity so vx new which will be the velocity after enforcing the actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.381,
    "end": 893.803,
    "text": " Will be our previous velocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.644,
    "end": 895.986,
    "text": "Plus our acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.407,
    "end": 898.71,
    "text": "Times this increment in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.73,
    "end": 899.291,
    "text": "This dt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.872,
    "end": 901.474,
    "text": "And this dt we said beforehand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.934,
    "end": 903.497,
    "text": "But this is a simplified assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.537,
    "end": 906.24,
    "text": "Which of course there are more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.502,
    "end": 908.484,
    "text": "Assumptions to be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.524,
    "end": 909.445,
    "text": "We can choose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.346,
    "end": 911.288,
    "text": "Euler-Marwanger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.568,
    "end": 914.372,
    "text": "And all those other fourth order approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.412,
    "end": 916.235,
    "text": "But for now let's keep it simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.255,
    "end": 917.516,
    "text": "And let's stick to this very.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.297,
    "end": 921.402,
    "text": "Simple order approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.422,
    "end": 922.303,
    "text": "Then based on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.857,
    "end": 942.553,
    "text": " velocities and accelerations we can also do a similar trick for the new positions so how does our x and y coordinate change based on their previous coordinates the velocities that we had at the previous moment and the accelerations that we computed here we have this quadratic term over the accelerations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.871,
    "end": 964.66,
    "text": " uh which are merely a matter of fact of the approximation because we over dt we also want to kind of integrate over the accelerations so that's odds the second term basically odds for this effect and makes it a bit more realistic with that out of the way we can do similar things for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.943,
    "end": 990.192,
    "text": " the rotation so the acceleration the rotational acceleration is our torque divided by a moment of inertia that we got from the drone we again can update the angular velocity based on its previous angular velocity the acceleration that we just computed and the time interval and based on that we can also update our angle so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.914,
    "end": 1018.626,
    "text": " what this function does it accepts the state actions and some characteristics of the drone in the environment and some discretization over time and it computes and returns a new state so if we would have applied a specific action of force fl and fr corresponding to the two rotor engines what would be the new state or approximately the new state that we end up with it's very simplified but this you can think of as a state transition function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.829,
    "end": 1032.72,
    "text": " With that out of the way, now it's actually time to start with the easy work, because we have now this function f, and this function f specifies how we think this internal state of the drone evolves over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.582,
    "end": 1040.567,
    "text": "Something I forgot to mention, but Julia also supports Unicode, so the people who are paying attention might have already seen it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.368,
    "end": 1050.317,
    "text": "I still think it's a great feature, but you can actually use Greek symbols, which makes this translation going from physics to code way more easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.787,
    "end": 1077.908,
    "text": " and also allows you to retain this physical interpretation to it but that being said let's continue with the proper model so just remember now that we have f which encodes our state transition for our drone we're going to construct a generative model and here i have drawn it as a so-called forney style factor graph but i'm going to talk you right through it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.238,
    "end": 1106.562,
    "text": " so what we have is these boxes and these boxes correspond to factors or functions on how variables relate to each other which one relates to another one and how are they interconnected through which functions and through um through which nodes let's say and the edges so the arrows here in this case correspond to the individual variables in our model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.027,
    "end": 1120.441,
    "text": " The variables s in this example correspond to the state of the agent, so that contains the position of the agent in both x, y and the velocities also in the x, y direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.963,
    "end": 1127.569,
    "text": "Furthermore, this state also contains the angle and this angular velocity to make life a bit simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.652,
    "end": 1135.738,
    "text": "u in this case corresponds to the actions, so the actions that we want in the end to also infer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.592,
    "end": 1149.12,
    "text": " based on this figure we can for example see around this function f which was our state transition that we put in the previous state and the actions and we get something out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.99,
    "end": 1162.825,
    "text": " To that, we add a bit of Gaussian noise to accommodate for any uncertainties that are maybe in the parameters, in the environment, because we use simplified drone physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.905,
    "end": 1176.762,
    "text": "Maybe we want to add a bit of process noise there just to accommodate for the fact that these dynamics are not perfect and that there will always be internal, external fluctuations that drive this drone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.446,
    "end": 1185.88,
    "text": " If we write this down in a probabilistic matter, we can construct this particular factor graph where we have these time slices which repeat over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.722,
    "end": 1190.169,
    "text": "And mathematically, we can write that in the equation that's on the slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.97,
    "end": 1200.268,
    "text": "So we have a prior on the initial state, which we refer to as P , which encodes our starting position, starting velocities, starting angles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.835,
    "end": 1205.16,
    "text": " And all the way at the end of the model, we have our goal prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.501,
    "end": 1212.131,
    "text": "So P , where capital T denotes the length of our model, also known as our horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.953,
    "end": 1219.321,
    "text": "This P describes, okay, where do we actually want the agent to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.084,
    "end": 1223.147,
    "text": "What do we want its velocity to be at the end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.229,
    "end": 1227.253,
    "text": "What do we want its angle to be at the end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.535,
    "end": 1229.597,
    "text": "All these kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.045,
    "end": 1239.956,
    "text": " So together, P and P , these two priors, de-encode the starting and end position of our drone respectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.396,
    "end": 1255.534,
    "text": "Whereas this middle part with the f-function, the transition function that we just described, and the control U, of which we can put a Gaussian prior because we want to infer it, together these encode the dynamics of the drone, the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.231,
    "end": 1259.092,
    "text": " How does this look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.492,
    "end": 1262.696,
    "text": "I'm just gonna report it directly into RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.798,
    "end": 1279.476,
    "text": "So over the past couple of months, our colleagues have spent significant amounts of time actually improving our modeling language, which makes it now even easier to craft your own probabilistic models in RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.597,
    "end": 1284.762,
    "text": "And with these effectively four lines, five lines of code,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.552,
    "end": 1311.795,
    "text": " we can construct the model the graph that we have on the left so what i'm going to do is i'm going to talk you through it and i think at the end i think hope all questions or i i don't think there will be a lot of questions surrounding this particular model any longer because it's merely a replication of what's on the left we're going to define the variable s1 and s1 in this case actually refers to the first state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.147,
    "end": 1318.497,
    "text": " But Julia indexes with 1, so that's why it's not S0, but S1 instead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.517,
    "end": 1340.01,
    "text": "And S1, which encodes our starting position, we're going to encode that with a multivariate normal distribution, whose mean is given by some initial state that we provide to the function, and whose covariance matrix we assume to be very narrow, because we assume that we know the position of the drone at the initial time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.133,
    "end": 1369.609,
    "text": " then inside this for loop we're going to basically unroll this middle segment of the drone of this generative model we're going to create a prior on the control so on this u of t and we're going to put there also immersive multivariate normal because that's nice to work with whose mean is the mass times gravitational constant divided by two and then as a vector of two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.298,
    "end": 1378.351,
    "text": " The reason for this is because our prior assumption of this drone is that it exerts a force because we think it's flying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.473,
    "end": 1387.727,
    "text": "So it would make sense that we assume the force of the engines will be just enough maybe to balance the drone in the air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.029,
    "end": 1394.618,
    "text": "So this mg divided by 2, which is actually the force of the left and right rotor respectively,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.256,
    "end": 1422.192,
    "text": " they compensate for the force of gravity if the mode of the engine or the drone were to be upright so here we provide some additional information that allow us to improve convergence and improve also estimation because we know that the drone is probably not going to drop out of air we want it actually to kind of stabilize and stay at its position so we do that here by putting this prior on the control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.078,
    "end": 1450.744,
    "text": " then following that is our state transition so how do we think our state evolves over time and this is where the dynamics of the simplified run that we talked about on the previous slide actually come into play so the mean of the next state will be given by this function f over the previous state and the corresponding actions and the drone the environment and the discretization over time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.458,
    "end": 1456.001,
    "text": " together with some noise because of the unknown dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.041,
    "end": 1461.488,
    "text": "Maybe we've got some internal external fluctuations, uncertainties, stochastic behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.709,
    "end": 1465.514,
    "text": "So that's all something that we also encode in this multivariate normal distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.456,
    "end": 1478.03,
    "text": "So that incorporates this for loop and that this for loop basically unrolls the segment that's on the left containing this p , this f and this norm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.05,
    "end": 1482.756,
    "text": "Then finally, we finish up our model by putting this goal prior at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.327,
    "end": 1510.026,
    "text": " so at the horizon plus one because of the indexing we're gonna put the multivariate normal whose mean is located at the goal containing our goal position goal the velocities that we wish to attain at the goal the angle at the goal etc etc and together these couple lines of code effectively they're just five they create the generative model that's on the left",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.786,
    "end": 1514.487,
    "text": " So that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.248,
    "end": 1518.853,
    "text": "We have crafted the model of how we think the drone evolves over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.333,
    "end": 1523.599,
    "text": "We have derived some simplified equations to model its states dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.581,
    "end": 1525.922,
    "text": "And now we want to do inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.824,
    "end": 1531.43,
    "text": "So we are interested in computing the marginal distributions over both actions and states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.231,
    "end": 1538.359,
    "text": "Basically, we want to ask our model, okay, it's nice that you have encoded this starting and end position in the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.828,
    "end": 1542.094,
    "text": " But in order to obtain that, how can we actually reach that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.214,
    "end": 1543.216,
    "text": "How can we actually do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.317,
    "end": 1550.308,
    "text": "So we're interested in figuring out what is actually the marginal distribution over the actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.688,
    "end": 1555.837,
    "text": "So this Q of U. And what is the marginal distribution over the states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.639,
    "end": 1560.705,
    "text": "So what forces do we need to apply to go from position A to position B?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.587,
    "end": 1564.532,
    "text": "And how will this trajectory going from A to B look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.478,
    "end": 1579.192,
    "text": " In the general case, if we were to just try to solve this equation and compute these marginal distributions, then we would have to integrate over all other parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.035,
    "end": 1585.04,
    "text": "But that's very computationally heavy because there are a lot of parameters in our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.2,
    "end": 1588.765,
    "text": "So doing this in a naive way would not be efficient at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.088,
    "end": 1594.873,
    "text": "But there is luckily a way to make it efficient, namely through message passing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.427,
    "end": 1598.771,
    "text": " So let's dive a bit deeper into how that actually looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.514,
    "end": 1606.762,
    "text": "So for this purpose, I've created this simplified factorized model to make sure everyone can kind of follow along.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.723,
    "end": 1611.288,
    "text": "So we have the different factors FA, FB, FC and FD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.65,
    "end": 1616.495,
    "text": "Each linked to some of the variables from X1 ranging to X6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.377,
    "end": 1623.384,
    "text": "And each factor is only connected to the variables to which it also relates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.744,
    "end": 1625.046,
    "text": "It's a simple case, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.562,
    "end": 1654.341,
    "text": " suppose now that we wish to compute the marginal here over the variable x4 doing this naively would require us to integrate out this factorized model over all variables x except for x4 however that's computation heavy as i mentioned earlier because we have five variables to integrate over and that might be a challenge because we're in this very high dimensional space then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.042,
    "end": 1684.058,
    "text": " luckily what we can do is we can make use of that these vectors are not connected to everything so the vector nodes that are on the left are not connected to each of the variables and this turns out to be very beneficial from an efficiency standpoint so we can effectively split up this large integration over the entire model fx into a set of smaller integrals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.506,
    "end": 1715.327,
    "text": " simply by making use of this distributive property of integration where we can kind of separate them out put some parts into brackets and by doing so this large integration problem actually reduces into a couple smaller integration problems which are more efficient to solve we can also give an interpretation to this for example this f a of x1 x2 integrated over the variable x1",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.05,
    "end": 1723.637,
    "text": " You can also think of this as closing the box, as we demonstrate on the left, over that vector f .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.019,
    "end": 1728.262,
    "text": "And this is, the result of this, we call a message.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.362,
    "end": 1735.489,
    "text": "So this message you can think of as a summary of a particular part of that particular graph, of a part of the graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.111,
    "end": 1738.933,
    "text": "And we can iterate this a couple of times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.513,
    "end": 1742.496,
    "text": "So this message mu ,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.932,
    "end": 1756.823,
    "text": " if we propagate that into the next node this fb and we solve the corresponding integration with this double integration over now x2 and x3 we get a new message mu of x4",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.765,
    "end": 1782.996,
    "text": " and we can do this this on all the edges and all the over all the factor nodes here in our model we can integrate over the single node fd over the node fc where we have an incoming message mu of x5 and what we end up with and that's the interesting part is that all these messages are relatively easy to compute they are relatively small because they do not require this huge integration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.338,
    "end": 1798.736,
    "text": " The funny thing here is, is that this marginal, the one that we're interested in, this Q of X4, is now simply the product of mu of X4 times the other mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.776,
    "end": 1803.182,
    "text": "So the messages that are actually colliding on that edge, and then of course renormalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.444,
    "end": 1813.877,
    "text": "But that marginal distribution can simply be computed on a very local level by multiplying the messages that are flowing over these edges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.701,
    "end": 1819.029,
    "text": " Hence making it very efficient to solve this integration problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1819.871,
    "end": 1825.02,
    "text": "And this is also how we actually solve inference in our toolbox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.04,
    "end": 1837.924,
    "text": "So in the probabilistic generative model that we created for the drone, we can use message passing to solve this marginalization in a very efficient manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.908,
    "end": 1864.502,
    "text": " give you an example these are some benchmarking results that we obtained with rx infer on the left you can see how long it takes for a simple state space model which is similar to the model that i've shown before but you can think more of this like in a common filter setting for people who have a bit familiarity with control systems and we can see that the filtering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.87,
    "end": 1866.832,
    "text": " and the smoothing both scale very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.032,
    "end": 1873.94,
    "text": "They scale very nicely in the number of observations or in the length of the model, just linearly, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.082,
    "end": 1881.188,
    "text": "On the right, we also do a comparison between RxInfer, so our toolbox, and Turing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.089,
    "end": 1892.16,
    "text": "Turing is another toolbox in Julia which doesn't use message passing to solve the actual marginalization problem, but instead it reverts to sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.545,
    "end": 1910.925,
    "text": " so instead of computing everything kind of analytically or mostly analytically or with approximations it draws a lot of samples and tries to extract statistics from this but as you can see the left axis is on the log scale so we obtain significant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.243,
    "end": 1938.347,
    "text": " performance improvements in comparison to the sampling based methods and that's also why we are pushing for rx infer because it's just way more efficient to perform these competitions with message passing in comparison to sampling based methods there is one thing in our model so if you recall these drone dynamics then our state transition was quite non-linear so it was very challenging",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.968,
    "end": 1943.874,
    "text": " or it is very challenging, to do exact message passing with this non-linear node.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.557,
    "end": 1967.085,
    "text": "Because if we go from the previous state to the next state, then the distribution of this next state will no longer be nice and Gaussian, but it might be a distribution which is outside of the family of exponential distributions, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.926,
    "end": 1992.128,
    "text": " it requires some approximations in order to actually do inference around it so in the experiments i have used unscented which we can just specify with the little code block on the right and what this does it draws a very small but very informative set of samples around the incoming Gaussian distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.783,
    "end": 2018.588,
    "text": " which capture the first and second moment of the distribution so the mean and variances of these sigma points these samples these are still the same as the statistics of the incoming normal distribution what we then do is we use these very carefully selected samples to propagate through the non-linearity and based on the transformed sigma points we then reconstruct what the gaussian at the output could have looked like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.795,
    "end": 2026.864,
    "text": " So this unsumpted allows us to make approximations through this non-linearity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.668,
    "end": 2032.313,
    "text": "With that in place, we can actually perform inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.454,
    "end": 2038.502,
    "text": "So the code block on the left bottom is all you need in order to get the drone running.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.303,
    "end": 2046.654,
    "text": "So inside the infar function, we specify a model, which was the drone model that we specified in one of the previous slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.596,
    "end": 2049.098,
    "text": "We specify its data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.331,
    "end": 2072.385,
    "text": " although it's not observing something directly and it's more doing a planning task we can still supply it with the initial state and the goal state where do we want the agent to move to and this meta object corresponds to the approximations that we wish to take and that's all that's all that's necessary in order to actually get this drone up and running",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.939,
    "end": 2098.339,
    "text": " and in order to demonstrate this we have a very nice experiment created by dimitri one of our colleagues where we have this drone moving around it will be it's more complicated than or i would say the plotting is more complicated than what i've shown on the previous slide because actually getting this plotting to work requires way more code than actually getting our inference to work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.821,
    "end": 2128.123,
    "text": " uh but what it allows us to do is not only to do this planning but also to do this really in an online manner so here in this particular example we have created this this video where on the fly we are changing parameters so we're increasing the mass of the drone making it heavier we're increasing the size of the drone so it's radius it's ancient power like what are the limits of this this drone what can it obtain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.745,
    "end": 2133.36,
    "text": " Gravity, perhaps you want to move to another planet and test your simulation there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.324,
    "end": 2136.732,
    "text": "But we're changing these characteristics on the fly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.772,
    "end": 2141.387,
    "text": "And with RX and VIRB we are still able to do this planning task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.675,
    "end": 2167.543,
    "text": " that being said um all the code and the examples that i showed you today they are publicly available on the reactive base organization so in the rx infer examples.jl repository you can find the code codes required to run actually the drone experiments",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.03,
    "end": 2197.733,
    "text": " it will be a simplified experiment so not the one on the previous slide because that would be way too intense to over that would be just too overwhelming to have a look at but the main characteristics of this particular drone demo are available here and if you have any questions want to try it out please let me know after or contact me if you have issues but the code that we developed for this particular live stream is actually publicly available",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.244,
    "end": 2212.937,
    "text": " with that i would like to thank you of course for this very nice opportunity for this nice audience if you want to have more information feel free to reach out to any one of us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.71,
    "end": 2237.862,
    "text": " reactive base found issue whatever you've seen deemed pretty can contact us research group bias lab our spin-off lace dynamics for industrial applications but most importantly for reactive base i want to say that we're also looking for collaborators so if you got motivated by this style got inspired to create your own cool applications",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.517,
    "end": 2264.389,
    "text": " please reach out to us and hopefully help us develop rx infer into the toolbox of the future i think that's something that i would like to strive for so if you're in inspired reach out and we'll make sure that there are amazing opportunities lying ahead and that's all thanks a lot for the attention and i hope it was an inspiring talk that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.993,
    "end": 2290.579,
    "text": " got you engaged with rx refer got you excited so if you have any questions please let me know awesome thank you very cool presentation albert do you want to give any first or overview remarks and then chris and kobus we can discuss and ask some questions too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.943,
    "end": 2308.635,
    "text": " uh well not not really in a sense that uh yeah it was uh although it was the first time i saw this presentation it was a great part i mean i i knew the the underlying project behind that and how the drone works but the presentation i think was very nice it also connected how uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.615,
    "end": 2313.321,
    "text": " while the Bayesian inference is basically how is it connected to the goal-driven behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.441,
    "end": 2315.723,
    "text": "I think it's really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.005,
    "end": 2325.615,
    "text": "Yeah, I just wanted to add along the presentation that Bart was speaking about this noise component when he has drawn the graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.316,
    "end": 2333.745,
    "text": "So this noise component also could be seen as basically the compensation for our poor approximation of the dynamics, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.765,
    "end": 2337.289,
    "text": "Because we use this first-order linear approximation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.59,
    "end": 2344.545,
    "text": " Well, that's arguably not the best way of approximating the underlying physics, although it worked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.082,
    "end": 2374.853,
    "text": " this simplified demo and there well i think i can just maybe add on how this demo can be extended or this model can be extended well the first thing to do is well just to use a different approximation right that's one thing that comes to my mind and another thing would be and i think from the active inference perspective uh would be to omit some of the parameters in the transition function",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2374.833,
    "end": 2397.617,
    "text": " deem them unknown and to let the agent figure out it uh through the interaction with the environment so you could achieve that also with a rigs infer by putting some priors on the on the matrix or putting some prior on the components of this matrix and you can see how fast the agent actually learns the physics of the environment yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.791,
    "end": 2419.318,
    "text": " awesome i'll ask some quick questions from the live chat and then chris and kobus if you want to ask feel free okay so carlos asks is the reactive part based on events to trigger the pipeline or based on signals yeah yeah go ahead bart",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.973,
    "end": 2441.61,
    "text": " yeah so what we or what dimitri did when he built it when he started building this rx inferred toolbox is he used a very different computing paradigm so normally you execute code from the top to the bottom but what he did is he used this reactive paradigm so based on events",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.911,
    "end": 2467.817,
    "text": " a particular computation is being executed and these events can be various it can change of course it depends very much on the context what an event is but often the event corresponds to making actual observations so especially for active inference agents if we make a new observation only then recomputations are being executed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.797,
    "end": 2479.258,
    "text": " so basically the entire algorithm does nothing unless there is something to compute and i hope that kind of answers the question but i'm not entirely sure so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.538,
    "end": 2505.583,
    "text": " was a bit unclear maybe albert you can uh out to it if you have a better yeah i'm just not i'm just not sure which kind of reactive part was uh was meant in in the question because yeah there is the reactive part of the inference but also the demo itself was uh reactive right like when you are triggering this but but basically speaking about how how it works indeed it it it the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.036,
    "end": 2516.248,
    "text": " it triggers on the event basically so in the event is that yeah something there are a few things that could be changed right it's either environmental change something changed in the environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.768,
    "end": 2541.898,
    "text": " uh and then we we sense this uh from from our sensors and then the inference follows right so there is uh just to add upon what bart said about this uh reactive part so message passing is a well-known algorithm i mean it's it's it's been around uh since uh pearl or i believe propagation perhaps later earlier but then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.705,
    "end": 2555.979,
    "text": " The reactive is a particular implementation of this message passing, which is more kind of driven by how the system should work in the field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.8,
    "end": 2556.98,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.102,
    "end": 2559.483,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.763,
    "end": 2571.295,
    "text": "Yeah, with Magnus Kudal, we explored a lot of the message passing and talked a little bit about how all the messages could be passed at once or the reactive paradigm where you could uncouple the rates of updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.663,
    "end": 2575.553,
    "text": " Okay, I'll ask one more question from the live chat and then Chris or Cobas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.154,
    "end": 2580.405,
    "text": "Fraser asks, fantastic stuff, double exclamation point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.425,
    "end": 2580.585,
    "text": "Uh-oh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.447,
    "end": 2588.625,
    "text": "If somebody wanted to help develop RxInfer with your organization, what are the ideal characteristics and backgrounds to have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.086,
    "end": 2614.292,
    "text": " i think we are very open so also within our lab in bias that we have a huge variety of backgrounds range from computer science to physics electrical engineering for myself for example so there is a wide variety of backgrounds possible of course we assume that or we would like coding to be something that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.272,
    "end": 2636.888,
    "text": " you're good at or willing to learn because i think that's one of the most important things of course to develop a software engine and all the rest i think we can provide you with excellent materials to get across or to to get familiar with the methods that we use or get acquainted with the models that we that we have developed in the past",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.184,
    "end": 2665.997,
    "text": " so personally when i started in in this group and when i started working on this project i also didn't have any background so i used to be an electrical engineer i never heard about well i will start probability theory and then quickly forgot about it um so my background was very different and it's maybe a bit difficult to get started directly with all this probability message passing out this entire paradigm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.315,
    "end": 2680.138,
    "text": " but it's definitely a very nice ride to learn so i would say if you're willing to learn willing to make a nice contribution then that's always welcome",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.519,
    "end": 2703.105,
    "text": " yeah well we are mostly writing stuff in julia right so julia is sort of i mean i mean it's learnable language right it's not like if you don't know julia you can't help us no it's not absolutely not true so we welcome people from different programming backgrounds and besides there are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.085,
    "end": 2716.555,
    "text": " different branches on how you can help within this RxInference basically the whole reactive base ecosystem because it consists not only of the inference engine which I must say it's the most difficult part for contributing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.058,
    "end": 2722.385,
    "text": " Because there are many intricacies involved within this inference language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2722.405,
    "end": 2725.85,
    "text": "But there is also GraphPPL, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2725.87,
    "end": 2726.991,
    "text": "There is also Rocket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.051,
    "end": 2732.779,
    "text": "There are other packages which basically constitute the whole ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.879,
    "end": 2738.627,
    "text": "And yeah, well, you don't have to be an expert in Bayesian inference to contribute to Rocket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.029,
    "end": 2746.296,
    "text": " or you don't have to be, again, an expert in particular approximations to contribute to a model builder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.756,
    "end": 2755.004,
    "text": "And of course, the documentation is something which always needs an update, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2755.024,
    "end": 2759.448,
    "text": "So we don't dismiss people for contributing to the documentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.468,
    "end": 2767.315,
    "text": "That's extremely important for the community and for ourselves because we can see, okay, so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.868,
    "end": 2773.495,
    "text": " Where are the parts which we could explain better or actually improve our ecosystem?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.339,
    "end": 2776.639,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.659,
    "end": 2778.922,
    "text": "Kopus?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.003,
    "end": 2780.164,
    "text": "Very interesting talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2780.184,
    "end": 2781.285,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2781.986,
    "end": 2793.201,
    "text": "I have a question about categorical examples where the control space consists of values from a categorical distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.839,
    "end": 2798.752,
    "text": " So does Oryx in Per have any such examples available?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.277,
    "end": 2801.4,
    "text": "We do, we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.841,
    "end": 2805.25,
    "text": "So we do not only support continuous variables in this case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.432,
    "end": 2813.52,
    "text": " But we also support a variety of categorical distributions, categorical distributions themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.341,
    "end": 2815.643,
    "text": "We do have a lot of examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.123,
    "end": 2827.235,
    "text": "So if you visit the website rxinferred.ml, there is this huge list of examples, use cases, some of which feature categorical distributions as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.695,
    "end": 2834.022,
    "text": "All the way ranging from modeling a simple coin toss to more advanced examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2834.491,
    "end": 2849.715,
    "text": " but we do offer functionality in both the discrete domain as in the continuous domain yeah okay yeah go ahead yeah I just wanted to add there is well the most uh kind of uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.134,
    "end": 2876.462,
    "text": " famous example or hello world examples into the categorical world within I think is hidden market model and I think we have an example on that I'm not sure that we have incorporated the control within that example that's probably learning the transition matrices for observations and well the hidden state but there is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.847,
    "end": 2886.385,
    "text": " I think nothing's stopping you from introducing the control for a certain discrete type of Markov model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.238,
    "end": 2889.059,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2889.159,
    "end": 2903.097,
    "text": "And then I use VS Code and I do have problems with Greek symbols when they contain multiple characters in a superscript or subscript, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2903.177,
    "end": 2906.561,
    "text": "So do you guys use VS Code at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2906.721,
    "end": 2911.427,
    "text": "And if so, do you have best practice to solve my problems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2912.605,
    "end": 2941.768,
    "text": " we do use vs code i think our entire lab uses vs code because it has turned out to be a very very nice tool so it's good that you mentioned this regarding the subscripts and the superscripts that you mentioned is personally i try to avoid them because oftentimes i completely agree that it looks nice to have this dot over a variable for example to denote the derivative or to draw kind of the index with a superscript",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.221,
    "end": 2968.06,
    "text": " but personally to me that clutters it a bit and also makes it more challenging to edit so i just try to refrain from using sub and superscripts in vs code with this auto tab although it looks very cool and might be nice for like demo purposes for actually experimentation or development i always try to avoid them so not a solution but this is my kind of my take on it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.39,
    "end": 2987.5,
    "text": " okay yeah i can understand uh uh yeah because and another possible problem with super and subscripts is they can appear very small and i often find myself having to zoom in a bit to you know discriminate between certain symbols and then my final question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2988.222,
    "end": 2995.014,
    "text": " To what extent can you guys parallelize within RxInfer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.056,
    "end": 3002.788,
    "text": "Are there obvious low-hanging fruit choices to apply parallelization in RxInfer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.338,
    "end": 3021.722,
    "text": " yes so it's good that you mentioned this because at the moment we have actually a master student who is kind of working on this particular or trying to work on this project where we try to parallelize the message passing and the computation for example of the marginals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.702,
    "end": 3025.787,
    "text": " So there are opportunities there to do some sort of parallelization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.109,
    "end": 3033.537,
    "text": "In general, at the current moment, our message posting is all linear, unfortunately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.318,
    "end": 3039.585,
    "text": "However, there have been papers where they also parallelized that, although it seems that it's impossible to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.587,
    "end": 3041.668,
    "text": "Apparently, it still is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.037,
    "end": 3056.907,
    "text": " uh but that's something perhaps for a future project so at the moment we do not provide a lot of parallelization around rx infer but in the future this is definitely on top of our agenda to make also improvements in terms of performance and computational speed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.422,
    "end": 3061.187,
    "text": " Just one quick question, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.467,
    "end": 3061.988,
    "text": "Another one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3063.171,
    "end": 3076.735,
    "text": "Have you guys thought of approaching big players like Amazon Web Services, for example, and present this to them and try and get them to incorporate it into their standard tools?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3078.723,
    "end": 3101.203,
    "text": " we have been um so with lace dynamics kind of the spin-off company which also uses rx inferred to develop real applications let's say for customers we have considered this this option but at the moment we have not been in contact to any of these these companies or clients sorry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.027,
    "end": 3108.94,
    "text": " No, I just wanted to add that we haven't talked to none of Fang yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.862,
    "end": 3118.298,
    "text": "Although we are in talks, there are a few interested parties in the pipeline, but no, we haven't approached Amazon yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.963,
    "end": 3121.504,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.205,
    "end": 3123.907,
    "text": " Thank you, Cobus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.569,
    "end": 3127.376,
    "text": "I'll ask another question in the chat and then Chris, if you have anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.978,
    "end": 3137.282,
    "text": "Fraser asks, what are the largest current challenges to the reactive message passing paradigm for doing this kind of approximate Bayesian inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.726,
    "end": 3140.687,
    "text": " It's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.887,
    "end": 3144.331,
    "text": "I think it also depends a lot on who you ask this question to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.371,
    "end": 3150.878,
    "text": "To me personally, the message passing, I think is a great method in itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.959,
    "end": 3155.683,
    "text": "And it also overcomes already a lot of challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.703,
    "end": 3165.073,
    "text": "What I think would be the most fruitful next step is to really start working on the actual modeling, the modeling aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.133,
    "end": 3167.455,
    "text": "So can we create maybe universal models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.873,
    "end": 3191.468,
    "text": " hierarchical models how can we do this such that these hierarchical models or similar actually solve more complicated tasks than a simple stage-based model can do so for me personally i think that's where we can achieve the biggest gains in this modeling part",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.173,
    "end": 3217.084,
    "text": " i'm not sure about what albert thinks are the most the biggest yeah what the biggest outstanding challenge is but there are i think from from yeah i totally agree from the from the research perspective the structural adaptation of of the model that's the most i would say yeah the hardest and the most interesting uh from uh from my opinion uh problem that's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3217.317,
    "end": 3241.873,
    "text": " like hand crafting this model like for for this type of drones right it's nice it can be easy sometimes not well if you go to the three-dimensional that gets significantly uh more complex so indeed like having um a machinery well the thing the interesting thing that we we do have a machinery to to do a structural adaptation uh because arix infer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3242.393,
    "end": 3262.242,
    "text": " uh does provide the an opportunity to extend your model to patch it uh although how to do that in principle how do you indeed grow or or shrink your model and so in time while observing and being in the field i think this is the most challenging part indeed and as for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.694,
    "end": 3271.797,
    "text": " Well, there are certainly problems with approximations and universal rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3272.579,
    "end": 3277.21,
    "text": "That's something we also outline in a few demos that well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.882,
    "end": 3284.115,
    "text": " There could be a situation where the rule for computing the message, which Bart was showing, is not available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3285.578,
    "end": 3294.557,
    "text": "So there is always this question whether you want to commit to a simpler approximation to do it faster, or you want to commit to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.212,
    "end": 3301.582,
    "text": " more accurate approximation, but it will take more computational resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3301.662,
    "end": 3305.848,
    "text": "And how to balance between these two, that's another interesting question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3305.888,
    "end": 3307.951,
    "text": "How to automatically decide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3309.033,
    "end": 3314.1,
    "text": "I think this is what I would call the most interesting challenges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.803,
    "end": 3317.946,
    "text": "I would also add",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.365,
    "end": 3328.831,
    "text": " from our kind of educational and research side, that one of the big challenges, thankfully one being approached, is to develop the documentation and the examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.432,
    "end": 3335.547,
    "text": "The examples help us learn, but also a lot of us are having good success bringing in code examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.527,
    "end": 3341.876,
    "text": " into code and language models and using the working examples to template new examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.436,
    "end": 3348.324,
    "text": "So as the library of open source published models grows, that will become more possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.925,
    "end": 3364.386,
    "text": "And then also there's a lifelong fascinating journey of talking about how do you go from seeing a drone in the sky to getting those physics equations down and that kind of like approach to modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.366,
    "end": 3373.28,
    "text": " And how do we get to a graph, assuming that that's where the software package can pick up and render it kind of no problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3373.741,
    "end": 3383.557,
    "text": "But there's still this very human, very collaborative process, which also could receive a lot of documentation and examples about getting to that kind of a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.984,
    "end": 3389.065,
    "text": "Chris, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.566,
    "end": 3392.01,
    "text": "Yeah, Chris, do you want to ask anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.323,
    "end": 3396.226,
    "text": " No, I just wanted to say thank you guys very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3396.286,
    "end": 3397.968,
    "text": "I really enjoyed the presentation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3397.988,
    "end": 3406.618,
    "text": "I really enjoyed how you broke down a lot of the top of my head right now is like the integration example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3407.158,
    "end": 3409.381,
    "text": "It was very intuitive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3409.541,
    "end": 3417.189,
    "text": "It made a lot of sense and it really highlighted a lot of the benefits and true power in what you guys have developed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3417.209,
    "end": 3417.99,
    "text": "So thank you guys.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.09,
    "end": 3422.335,
    "text": "And I really, really appreciate your time and explaining this to us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3423.935,
    "end": 3425.272,
    "text": " Thank you for the kind words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.601,
    "end": 3455.022,
    "text": " if i could also add yeah thanks for having us one um comment just as we've been working on it week by week a real like arising insight that got us both excited and not daunted but just realizing the scope of the package and the work was in comparing the rx and fur active inference examples with other active inference simulations like from pi mdp or built",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.002,
    "end": 3458.288,
    "text": " kind of custom outside of a package like the inference examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.849,
    "end": 3472.974,
    "text": "And we realized that a lot of alternative approaches, people try to go as fast as possible to developing an active inference agent and then talk about like the variational free energy or the expected free energy of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.354,
    "end": 3479.946,
    "text": "And so the package serves as a helpful accelerator to get to an agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.926,
    "end": 3500.972,
    "text": " but that's not like the general agent and then even making small changes to that scheme can be buried and scattered across different packages and then there's all these other kinds of limitations that one quickly finds themselves encountering like in the education application settings whereas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.952,
    "end": 3505.977,
    "text": " In RxInfer, it's such an engineering-driven approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.297,
    "end": 3509.961,
    "text": "So a lot of the engineers on our team were immediately more comfortable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.361,
    "end": 3524.456,
    "text": "And then a lot of people who had been playing with active inference from a computer science or from a philosophical and mathematical side were a little bit surprised because we were getting very low level with the node engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.496,
    "end": 3530.942,
    "text": "And then after wiring that up and understanding it, it's just like, press play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.682,
    "end": 3543.025,
    "text": " So a lot of the focus on developing an agent was actually, that focus was moved to better understanding the graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.46,
    "end": 3546.864,
    "text": " that represents the ecosystem of shared intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.425,
    "end": 3563.185,
    "text": "And there was less upfront focus on merely making it like an agent-based model because you could make an agent-based model like the drone, or you could develop other kinds of graphs that don't necessarily have an agentic basis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.886,
    "end": 3566.97,
    "text": "So that helped us realize that this is a much",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.95,
    "end": 3582.073,
    "text": " broader toolkit than doing active inference or agent-based modeling of any kind but that those are use cases that are benefited greatly by it definitely i think you are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.572,
    "end": 3587.817,
    "text": " actually picking the main point of our package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.837,
    "end": 3597.53,
    "text": "So Rx refer allows us to enable or enables us to create these agents very quickly, very adapt, very efficiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.55,
    "end": 3613.41,
    "text": "So if we compare this, for example, to, and you mentioned this already also from your engineers, like if you would go through a traditional design cycle for an engineering firm, you would create a single model kind of thingy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.795,
    "end": 3632.85,
    "text": " single algorithm let's say 50 pages of code or something and that's nice these 50 pages of code but that all yeah it's unmaintainable you need a lot of engineers to actually make improvements upon it yeah if something changes you know you don't know what's going to happen right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.202,
    "end": 3642.656,
    "text": " Whereas with RxAffair, we just have to specify this little piece of code, which specifies the model and then inference is automated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.716,
    "end": 3644.679,
    "text": "As you mentioned, you just press play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.82,
    "end": 3662.685,
    "text": "It isn't that easy, of course, from the actual ancient perspective, but we try to make the user experience as good as possible to make it as easy on the user to build agents, active inference agents or any other applications where you might need such",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.29,
    "end": 3689.888,
    "text": " machinery to actually complete a specific task and hopefully by doing so by making this user friendliness one of our priorities is we can also enable active inference getting adopted across industries and across research groups yeah after today if we have a quick question is there an email that we could send those questions to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.146,
    "end": 3700.924,
    "text": " I think from the Active Inference Institute, there is a communication channel, but Daniel, please correct me if I'm wrong, directly to BiasLab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.191,
    "end": 3706.581,
    "text": " But if you have questions, feel free to start a discussion on GitHub because we actively maintain it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.142,
    "end": 3710.668,
    "text": "We keep also a close watch on what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.289,
    "end": 3714.695,
    "text": "And there might also have been people with similar questions before you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.416,
    "end": 3726.135,
    "text": "So my first hunch would be create a discussion on GitHub and we will definitely then get involved with one of our colleagues in order to help you out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.892,
    "end": 3740.732,
    "text": " okay well if if if you have questions uh regarding uh his dynamics uh venture then you could uh yeah use our info at lacedynamics.com as well so just to dump any other questions you want yep",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3741.978,
    "end": 3742.299,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.719,
    "end": 3745.163,
    "text": "Well, thank you all again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.203,
    "end": 3746.846,
    "text": "It's really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.886,
    "end": 3757.204,
    "text": "I was thinking about how the packages are kind of factorized and modular and separable, almost like that's a theme that helps ecosystems work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.564,
    "end": 3759.227,
    "text": "So overall,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.338,
    "end": 3763.262,
    "text": " thank you very much for the work and for presenting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.342,
    "end": 3777.003,
    "text": "We've really appreciated the chance to work with a package in our learning groups, and we'll look forward to seeing more examples and sharing more also from the projects that people are working on in the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.945,
    "end": 3780.027,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.047,
    "end": 3782.27,
    "text": "It was a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3782.29,
    "end": 3783.071,
    "text": "Thank you for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.054,
    "end": 3785.155,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.175,
    "end": 3786.296,
    "text": "Okay, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.917,
    "end": 3788.86,
    "text": "So see you all next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.696,
    "end": 3791.086,
    "text": " Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.764,
    "end": 3792.092,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3792.133,
    "end": 3792.421,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]