[
  {
    "start": 0.029,
    "end": 25.835,
    "text": " three two one hello and welcome to active inference lab live stream number 27.0 it's august 23rd 2021 and we're going to be discussing the paper active inference applicability to different types of social organization explained through reference to industrial engineering and quality management",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.301,
    "end": 28.842,
    "text": " So welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 29.582,
    "end": 34.865,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 35.465,
    "end": 37.086,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.966,
    "end": 43.469,
    "text": "This is a recorded and archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 44.549,
    "end": 49.612,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 51.724,
    "end": 56.286,
    "text": " At the short link, you can find the roadmap of the upcoming discussions that we're going to be having.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.786,
    "end": 64.288,
    "text": "And these are going to be group discussions on August 24th, tomorrow, and then August 31st for number 27.1 and 2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 65.008,
    "end": 67.589,
    "text": "And hopefully the author will be joining us for both discussions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 67.769,
    "end": 75.312,
    "text": "And we have some openings in the coming weeks if you want to join for a session or if you want to recommend somebody who should join.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.11,
    "end": 89.337,
    "text": " Today in ActiveStream 27.0, we're gonna be learning and discussing about this paper with the aforementioned long title by Stephen Fox, and the link is here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 90.218,
    "end": 96.622,
    "text": "And just like a lot of the other .Zero videos, all of them, this video is just an introduction for some of the ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.682,
    "end": 98.243,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 98.444,
    "end": 108.03,
    "text": "It's kind of always this assemblage of all of the participants here just modifying the slides and going down a few avenues that we thought were interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 109.091,
    "end": 111.814,
    "text": " setting up some questions to discuss in the dot one and dot two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.815,
    "end": 120.082,
    "text": "So we'll go over the aims and the claims of the paper and the abstract and roadmap and then talk about keywords, then go through the figures and tables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.762,
    "end": 133.174,
    "text": "So if you want to participate in these group discussions tomorrow or the following week, then just let us know or save and submit your questions and get in touch with us if you want to participate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 134.605,
    "end": 143.972,
    "text": " So we can just start with hello, and then it will be cool to hear from both of you what drew you to the paper or what made you interested in talking about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.732,
    "end": 146.433,
    "text": "I'm Daniel and I'm in California.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.334,
    "end": 148.455,
    "text": "So whoever wants to go first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 151.457,
    "end": 155.098,
    "text": " I'm Blue and I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.478,
    "end": 157.359,
    "text": "And I liked this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.379,
    "end": 165.221,
    "text": "It was a really like refreshing, kind of interesting and very readable perspective compared to a lot of the other papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.521,
    "end": 175.784,
    "text": "And it made some links with industrial engineering, which I thought was interesting and kind of like a new take on active inference and FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.771,
    "end": 180.352,
    "text": " I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.712,
    "end": 181.793,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.093,
    "end": 199.568,
    "text": "And what I found interesting about the paper is just looking at it through the lens of engineering's priors, I guess, in terms of what they would hold up as active inference just because of what they do every single day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.069,
    "end": 201.71,
    "text": "And again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.146,
    "end": 213.873,
    "text": " That kind of juxtaposed with the social piece was really interesting to me because not to overgeneralize, but when you're focusing on how to break something down, you don't tend to look at the whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.913,
    "end": 218.896,
    "text": "So I thought that was really interesting to try to pull those two things together and make them coherent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.557,
    "end": 220.918,
    "text": "I agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.958,
    "end": 230.704,
    "text": "There's that discussion of the interfaces between the engineered system and the actual way it's used in the niche, which I think we're going to return to when we're talking about like a bookshelf.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.204,
    "end": 238.526,
    "text": " So the paper is the title of the link are shown here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 239.667,
    "end": 247.21,
    "text": "And I guess maybe do either of you want to just read the first two aims and claims?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 248.191,
    "end": 248.491,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.631,
    "end": 256.655,
    "text": "So the principal contribution of this paper is to relate active inference theory to everyday practice in social organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.515,
    "end": 261.717,
    "text": "Active inference is a corollary of the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.11,
    "end": 275.927,
    "text": " which formalizes cognition in the auto poetic organization of living systems that resist the second law of thermodynamics by occupying a limited repertoire of states, thus persisting as bounded self-organizing systems over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.541,
    "end": 300.347,
    "text": " okay and then i'll read the last two then anyone can give a thought it is explained throughout the paper how industrial engineering and quality management better enable social organization to occupy a limited number of states in order to persist as a bounded self-organizing systems over time rather than dissipating into their surrounding environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 301.047,
    "end": 315.435,
    "text": " Although previous papers by others have encompassed active inference up to the levels of socio-cultural cognition, this is the first paper to address active inference in everyday organizational practice, including industrial engineering and quality management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.379,
    "end": 341.265,
    "text": " So the paper is setting up to be just like one more plank towards applying active inference, bridging some of the practices that are already in use in the fields that we're going to be exploring, like the quality management and industrial engineering, and then sort of the adjacent possible for what kinds of systems could exist in those domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 342.805,
    "end": 348.149,
    "text": " Sometimes we have a more mathematical paper or more philosophical paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.189,
    "end": 350.09,
    "text": "This one's going to use a lot more of the jargon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.771,
    "end": 353.372,
    "text": "And like Dean said, the priors of engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.733,
    "end": 355.834,
    "text": "So that's why it's kind of cool to hear about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.416,
    "end": 359.737,
    "text": "Daniel, can I add something to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.937,
    "end": 360.097,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 361.178,
    "end": 363.439,
    "text": "Yeah, I just think it's interesting that I think we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.819,
    "end": 370.243,
    "text": " to use a bridging metaphor is seems just to be a really easy thing to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.944,
    "end": 378.531,
    "text": "And then I think what the paper in terms of the aims and the claims does is tries to point out where that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.858,
    "end": 381.579,
    "text": " that connection might exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.239,
    "end": 388.583,
    "text": "And we can always argue whether or not it exists in all situations at all times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.763,
    "end": 400.129,
    "text": "But I do think that there are some times, again, when we can hold a static connection between an idea at one scale and an idea at another scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.729,
    "end": 406.412,
    "text": "And so not all scales allow for that or have those affordances, but sometimes they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.852,
    "end": 407.973,
    "text": "So I mean, that part of it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.157,
    "end": 414.72,
    "text": " Maybe what we need to do is separate the times when the metaphor works and when it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.261,
    "end": 417.542,
    "text": "Agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 417.922,
    "end": 421.303,
    "text": "Being utilitarian implies some sort of utility metric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.144,
    "end": 428.807,
    "text": "Having a preference for reward or for preferred states implies those being defined, maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 428.867,
    "end": 437.312,
    "text": "And also, I think this will come up in this paper because it's all about which are the useful metrics to check up on useful policies to pursue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.154,
    "end": 441.957,
    "text": " Okay, so does anyone want to read abstract one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 444.179,
    "end": 444.579,
    "text": "I'll read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.48,
    "end": 452.746,
    "text": "Active inference is a physics of life process theory of perception, action, and learning that's applicable to natural and artificial agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 452.986,
    "end": 456.729,
    "text": "In the paper, active inference theory is related to different types of practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.55,
    "end": 466.998,
    "text": "In social organization, here the term social organization is used to clarify that this paper does not encompass organization in biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.467,
    "end": 479.196,
    "text": " Rather, the paper addresses active inference in social organization that utilizes industrial engineering, quality management, and artificial intelligence alongside human intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.997,
    "end": 489.726,
    "text": "Social organization referred to in this paper can be in private companies, public institutions, other for-profit or not-for-profit organizations, and any combination of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.384,
    "end": 498.57,
    "text": " The relevance of active inference theory is explained in terms of variation of free energy, prediction errors, generative models, and Markov blankings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.171,
    "end": 502.092,
    "text": "Pretty interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.192,
    "end": 516.101,
    "text": "I think usually when we talk about these multi-scale perspectives on institutions, cities, societies, it's always like the entire edifice, all of the niche and everything that's moving in it is part of this one biological organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 516.121,
    "end": 516.802,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.683,
    "end": 520.045,
    "text": " or at least biological co-regulating system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 520.445,
    "end": 528.272,
    "text": "And here it's very explicit that it's trimming the biological component from the engineered component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.372,
    "end": 530.794,
    "text": "It's kind of like the car and then the passenger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 531.494,
    "end": 539.201,
    "text": "So then instead of just saying, well, the car and the passenger are part of the same extended cognitive niche, because that's one way to look at that situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 539.241,
    "end": 541.963,
    "text": "Like it's an extended affordance that the driver has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.248,
    "end": 556.437,
    "text": " Another way to think of it is by making a very clean partitioning, recognizing that there's still this emergent function, like cars don't drive themselves, but you can still parse out the individual who's using the car from the design process of making the car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 557.938,
    "end": 565.824,
    "text": "And one thing to add to that, if you haven't read Lucy, and I'll always kill her last name, Lucy Sukman, S-U-C-H-M-A-N.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.284,
    "end": 570.867,
    "text": "She's got a book out many years ago that I think has still got some incredible shelf life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.907,
    "end": 571.328,
    "text": "It's called...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.244,
    "end": 575.746,
    "text": " It's reconfiguring the human machine interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.707,
    "end": 597.862,
    "text": "And if you haven't read it, it's a fantastic book in terms of looking at how her case study is how people walk up to a photocopy machine for the first time where the engineers are trying to make it intuitive and how the human interface with that isn't always necessarily something that you can engineer for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.582,
    "end": 601.924,
    "text": "So something to consider if you're looking at this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.042,
    "end": 615.099,
    "text": " If I could just give another thought, I think that the uncoupling of social organization from biological organization is kind of a really unique and fresh perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.937,
    "end": 618.66,
    "text": " compared to some of the other papers that we've looked at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.84,
    "end": 638.218,
    "text": "Especially considering that it is biological organization because it's happening in biological creatures, but it's an interesting partition that the author creates to make it known that it's not talking about hierarchical organization in structures or societies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.11,
    "end": 645.593,
    "text": " Yeah, so we don't need to worry about what's inside of the tissues and go into the biological organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.973,
    "end": 648.774,
    "text": "Okay, I'll read the second abstract and then anyone can give a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.755,
    "end": 654.997,
    "text": "Active inference theory is most relevant to the social organization of work that is highly repetitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.865,
    "end": 664.995,
    "text": " By contrast, there are more challenges involved in applying active inference theory for social organization of less repetitive endeavors such as one of a kind projects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 665.896,
    "end": 676.068,
    "text": "These challenges need to be addressed in order for active inference to provide a unifying framework for different types of social organization employing human and artificial intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.55,
    "end": 680.091,
    "text": " So I have a thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.111,
    "end": 697.003,
    "text": "It might be somewhat controversial, but, um, you know, so I think that, um, the highly repetitive, so, I mean, I think about active inference in terms of exploration and exploitation, and I think like, it really depends on, on where your generative model rests, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.043,
    "end": 701.466,
    "text": "So like, as the generative model, like the model of the organization, or is it the model of the individual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.566,
    "end": 706.91,
    "text": "Because I think that, um, doing a highly repetitive project that reminds me of exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.421,
    "end": 710.984,
    "text": " where a one-off project can be exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.324,
    "end": 728.578,
    "text": "So you can still update your model depending on exploring some new avenue by this little side project, but you come back to updating your model, the model of your business, yourself, the way that you work, your organization, with knowledge about how to do processes in a one-off kind of process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.52,
    "end": 731.781,
    "text": "I agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.529,
    "end": 742.715,
    "text": " especially because we talk about it a lot in the context of generating strategic novelties, perhaps, and those are seemingly less repetitive, but...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.383,
    "end": 774.103,
    "text": " there's going to be some further clarification on that and also this points to this uh yeah exciting areas like one shot learning or like true structural novelty and active inference models that's something that we've talked about in other areas like how do you know when to be tweaking the knobs of the parameters as you currently have them set up versus expand a hidden state into two types of hidden state or something like that again thinking about what the system is realistically or from this instrumentalist way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.583,
    "end": 798.105,
    "text": " okay the roadmap is written out here and it's a we're going to go through it in rough order it introduces in each of these sections one of the kind of key ideas or principles the variational free energy prediction errors generative models markov blankets and survival",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.846,
    "end": 802.829,
    "text": " And then in section seven, active inference is proposed as a unifying framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 803.349,
    "end": 810.875,
    "text": "So this is kind of one of those classic paper layouts with some disciplinary sections, one through N disciplinary sections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 811.575,
    "end": 815.818,
    "text": "And then the next section is active inference as a unifying framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 816.418,
    "end": 820.181,
    "text": "And then the next section is like challenges or current research directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 820.782,
    "end": 828.327,
    "text": "And then a concluding section, maybe with a more call to action or more philosophical liftoff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.589,
    "end": 834.352,
    "text": " There were a bunch of keywords and I think we're going to get to all of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.733,
    "end": 837.194,
    "text": "So two columns of keywords.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.214,
    "end": 840.397,
    "text": "Let me shrink the video.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.697,
    "end": 840.837,
    "text": "Yeah."
  },
  {
    "start": 841.398,
    "end": 842.659,
    "text": "Two columns of keyword.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.799,
    "end": 843.039,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.96,
    "end": 846.562,
    "text": "So first active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.843,
    "end": 850.826,
    "text": "It's in the title of the paper and here's how it's written in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 851.386,
    "end": 853.668,
    "text": "Who wants to read the large text here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 855.438,
    "end": 855.758,
    "text": " I got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.38,
    "end": 862.085,
    "text": "Active inference is the physics of life process theory of perception, action, and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.966,
    "end": 864.647,
    "text": "Active inference generates predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.168,
    "end": 871.174,
    "text": "Active inference predictions are based on knowledge learned from past situations and perceptions of present situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.794,
    "end": 879.122,
    "text": "Active inference minimizes errors between actions that are planned through the inference of predictions and what happens when the planned actions are taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.592,
    "end": 883.934,
    "text": " So this is the first lines of the paper, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.174,
    "end": 889.098,
    "text": "In the introduction, that's how it begins with, you know, active inference is the first word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.178,
    "end": 898.024,
    "text": "So that's sort of the opening shot and it's just a cool framing to bring it out as a physics of life process theory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 899.324,
    "end": 926.761,
    "text": " yet this isn't about biological organization so it's almost like recognizing the origins and some of the motivations for the kind of modeling that active inference provides yet making another later decision to partition the system of interest a certain way so cool framing and then the uh next lines so kind of shrinking that definition of active inference um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.779,
    "end": 940.561,
    "text": " This is because prediction errors cause unwanted surprises, which individually or accumulatively can threaten survival by going beyond the limited number of states in which survival is possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 941.061,
    "end": 946.122,
    "text": "By contrast, minimizing prediction errors facilitates survival through least action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 947.942,
    "end": 956.184,
    "text": "So this is also linking up several of those key terms that are going to be section headers later, but it's just this idea that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.646,
    "end": 968.213,
    "text": " predictions about the external world, especially if they incorporate preferences that are optimistic, help reduce the complexity of deciding which actions to take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.753,
    "end": 979.1,
    "text": "And then the way that that gets operationalized is with the process theory of prediction error minimization, which is a real-time estimate of how good the generative model is performing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 981.742,
    "end": 985.805,
    "text": "And then just add anything or...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.829,
    "end": 1013.179,
    "text": " say more here but it's just an interesting topic how it's described as the principle of survival through least action so what is this principle of least action and how do we reconcile active biological agents as being in one way participating under this survival through least action even if it's just a misnomer what does that really mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.119,
    "end": 1023.424,
    "text": " And then how does survival through least action contrast or overlap with more familiar phrasing, probably survival of the fittest?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.865,
    "end": 1028.868,
    "text": "Like, is the survival of the fittest the survival of the least active?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1029.588,
    "end": 1046.077,
    "text": " Or how should we read this relationship between maybe Darwinian conceptions of fitness and which individuals survive versus this physics-based framing of survival through least action under the principles of least action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.378,
    "end": 1048.358,
    "text": "Stationary action principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1048.378,
    "end": 1049.759,
    "text": "Can I add something, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.959,
    "end": 1050.099,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.36,
    "end": 1073.04,
    "text": " Yeah, so I think it's interesting that you, depending on how you define each of these terms, that you can sort of transfer or oscillate across frame, what a frame is, which to me is identifying a focal point, maybe a margin or a limit, and what a fit is, what goes inside the other, like glove and hand or hand and glove.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.54,
    "end": 1076.443,
    "text": "And I think sometimes we talk about a niche fit,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.466,
    "end": 1081.447,
    "text": " But that's different than what the frame of the niche is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.047,
    "end": 1094.391,
    "text": "So the fact that we're sort of ping-ponging back and forth between the two, I just wonder whether or not we're looking at the same thing or if we realize we're looking at two things at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.572,
    "end": 1097.832,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1103.213,
    "end": 1104.914,
    "text": "Continuing on with the introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.442,
    "end": 1116.29,
    "text": " It's written, active inference is a corollary of the free energy principle, FEP, which formalizes cognition of the autopoietic organization of living systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.111,
    "end": 1121.494,
    "text": "Within FEP, active systems must occupy a limited repertoire of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1122.154,
    "end": 1127.338,
    "text": "This requires minimizing the long-term average of surprise associated with sensory exchanges with the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.999,
    "end": 1133.183,
    "text": "Minimizing surprise enables them to resist a natural tendency to disorder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.42,
    "end": 1154.28,
    "text": " So this just kind of relates to some questions like how do framings for this sort of active intelligent behavior what other framings exist and how do we think about broad concepts like reward preference and curiosity and surprise in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1156.698,
    "end": 1159.179,
    "text": " And then the last paragraph then, any thoughts or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1159.699,
    "end": 1165.76,
    "text": "Surprise rests on predictions about sensations, which depend on an internal generative model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.64,
    "end": 1182.183,
    "text": "In particular, although surprise cannot be measured directly, a free energy bound on surprise can be, suggesting that agents minimize free energy by changing their predictions about what sensory inputs will come from actions, or by changing the predicted sensory inputs through changing action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.622,
    "end": 1204.788,
    "text": " This just reminds me of the kind of fundamental pairing in Active Inference where the ways that you can go down that free energy gradient are either by updating parameters of your internal model, learning, development, or by updating action states, which is through action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1205.148,
    "end": 1210.77,
    "text": "Because you can't control external states directly, and you can't control the incoming sensory data directly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.724,
    "end": 1217.387,
    "text": " then all you can do is control those two states that are under your control, the internal states and the action states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.049,
    "end": 1224.371,
    "text": "All right, another term was the Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.071,
    "end": 1237.778,
    "text": "So anyone want to just like give what's the Markov 101 or what's a way in which Markov blankets came into play in this paper or in another context?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1242.714,
    "end": 1255.804,
    "text": " So Markov blankets are essentially the boundary or how a system creates a boundary and how you can define essentially like a non-equilibrium steady state system with a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.384,
    "end": 1264.63,
    "text": "I thought it was an interesting play in this paper and I think maybe we'll unpack it here later on in the intro video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.284,
    "end": 1271.869,
    "text": " We just, in number 26, talked a bunch about Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.309,
    "end": 1285.123,
    "text": "So, suffice to say that it's still open exactly which cases, which sense of the Markov blanket is meant on this continuum from analytical and mathematical with Markov, the OG blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.26,
    "end": 1300.693,
    "text": " the Bayesian statistical generalization by Pearl and others, and then this partitioning into incoming sensory and outgoing active states of the blanket by Friston and others, and then how that exactly relates to all these other topics that we're discussing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.536,
    "end": 1306.599,
    "text": "Okay, I'll play the video at 46 seconds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.819,
    "end": 1308.921,
    "text": "Blue, what was exciting to you about this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.454,
    "end": 1315.876,
    "text": " So this is the video from the Tesla AI day that just happened last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.036,
    "end": 1325.16,
    "text": "And this is, it's a humanoid robot that Tesla is going to attempt to design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.02,
    "end": 1342.429,
    "text": " And so I just put this definition of artificial intelligence from, like, Google, and it said, the theory and development of computer systems able to perform tasks that normally require human intelligence, such as visual perception, speech recognition, decision-making, and translation between languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.049,
    "end": 1346.551,
    "text": "And so, spoiler alert, this is actually not a robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.591,
    "end": 1352.654,
    "text": "This is actually, like, a person, but he made it, you know, look like a robot that was getting up and then, like, bam, I'm going to dance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.714,
    "end": 1353.795,
    "text": "But I think, like, that kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.355,
    "end": 1362.14,
    "text": " movement and perception about space, that kind of spatial awareness is something that's still very much a challenge for AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.32,
    "end": 1364.241,
    "text": "So that's why I threw this video in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.643,
    "end": 1366.883,
    "text": "Agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.263,
    "end": 1376.549,
    "text": "Will be interesting to see how they do processing and what kinds of algorithms and hardware and software end up being used for real time robotics systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1377.549,
    "end": 1382.192,
    "text": "Any comments on artificial intelligence or anything, Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1385.495,
    "end": 1393.138,
    "text": " Again, I don't spend a whole lot of time on this, because to me, artificial intelligence is always a post hoc domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.578,
    "end": 1397.539,
    "text": "Even this example, can we create a copy of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.219,
    "end": 1410.524,
    "text": "I mean, it's already been done by something, and now we're trying to re-engineer it or redevelop it, as opposed to what active inference is, which is the inclusion of ad hoc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.144,
    "end": 1411.664,
    "text": " the what if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.045,
    "end": 1426.735,
    "text": "So, I mean, if they can get artificial intelligence to a place that it's including what if, in the truest sense of all possibilities, then I'd probably be quite excited or scared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.755,
    "end": 1427.676,
    "text": "I'm not sure which.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.134,
    "end": 1430.374,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1431.054,
    "end": 1435.296,
    "text": "So some other keywords were social and organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1436.336,
    "end": 1455.523,
    "text": "And one of the goal statements of the paper was, this paper is intended to contribute to bridging the gap between theoretical papers in active inference theory, which have been reported to be too opaque to be understood widely, and potential application opportunities in the multi-intelligence social organization,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1456.303,
    "end": 1461.706,
    "text": " that being social organization that employs human intelligence and different types of artificial intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1462.407,
    "end": 1467.45,
    "text": "So, and whoever put this image, what did it mean or represent in the context of the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.9,
    "end": 1478.448,
    "text": " So I just looked, so I didn't, I don't know that it's necessarily really in the context of the paper, but I started to look into like, how are societies organized, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.668,
    "end": 1490.978,
    "text": "And so this is like, I just was doing some Googling and I thought that this was an interesting paper and the title and the author there in the small print, if you're able to read them, but this is like a state organization, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.078,
    "end": 1497.364,
    "text": "And it describes the fascist media model as focusing on community and culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.384,
    "end": 1518.85,
    "text": " And it describes the communist media model as focusing on state bureaucracy and the liberal media model as focusing on market exchange, which I just thought was interesting and just kind of an interesting way to, I don't know, reflect on societal organization and what is the central theme there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.4,
    "end": 1530.724,
    "text": " And it's kind of in line with that partitioning of the kind of the car from the user, because not included here are like the human users.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.964,
    "end": 1534.046,
    "text": "This is kind of everything but the eyes on the TV.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1534.566,
    "end": 1538.848,
    "text": "This is just partitioning the structure of the organization as an engineered object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1539.71,
    "end": 1542.451,
    "text": " So that's a cool similarity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.231,
    "end": 1544.151,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.872,
    "end": 1565.237,
    "text": "So we just had a guest stream and Pranev and Raphael, even they were debating, can we say that something that's an emergent property in an individual, which is then something that we can test as an emergent property within a dyad, can also become an emergent property within these high variability states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.598,
    "end": 1566.938,
    "text": "And even they couldn't agree completely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.467,
    "end": 1572.629,
    "text": " that there's some sort of a parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.59,
    "end": 1587.418,
    "text": "I think we know that on these high variability states like a social organization, afterwards, again, we can take an account of what it became, but it's really hard to know where it's going, even if you break it down into a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1588.755,
    "end": 1592.18,
    "text": " communist or a fascist direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.401,
    "end": 1597.288,
    "text": "It's telling us, like you say, what direction down the highway the car is going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.669,
    "end": 1600.954,
    "text": "But beyond that, it's still a lot of guessing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.877,
    "end": 1603.017,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.529,
    "end": 1611.512,
    "text": " So I guess that's where industrial engineering comes into play for that designing for that car on the highway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.973,
    "end": 1624.338,
    "text": "Industrial engineering involves applying methods such as task analysis and job design in order to predict results, evaluate results and improve results from processes during their development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1625.079,
    "end": 1629.141,
    "text": "The application of industrial engineering has been progressing around the world since the 1900s.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1629.161,
    "end": 1629.221,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1632.83,
    "end": 1634.75,
    "text": " wasn't an area I was too familiar with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1634.77,
    "end": 1642.052,
    "text": "I saw a lot of mention of the 99 out of 100 and the three standard deviations and then halt the process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1642.812,
    "end": 1646.033,
    "text": "So that kind of just was an interesting thing to hear about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.453,
    "end": 1649.794,
    "text": "Any thoughts or we can continue on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1649.814,
    "end": 1655.015,
    "text": "Okay, I guess a related field of industrial engineering is quality management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.047,
    "end": 1663.151,
    "text": " And so this is a type of system that involves, I guess, hardware and software and behavioral protocols.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.352,
    "end": 1683.123,
    "text": "Quality management systems, QMS, involve documenting processes which have been developed through industrial engineering as process specifications, work procedures, et cetera, monitoring processes for conformance to specifications, et cetera, and using observations of non-conformances to inform the further development of processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1683.823,
    "end": 1688.684,
    "text": " Both industrial engineering and QMS are focused on the continuous improvement of processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.185,
    "end": 1695.427,
    "text": "The application of industrial engineering has been progressing around the world since the 1900s and quality management since the 1950s.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1697.787,
    "end": 1698.487,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1702.369,
    "end": 1705.87,
    "text": "Just having been a business owner, it's a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.09,
    "end": 1712.772,
    "text": "Yep, definitely makes me think about precision of measurement changing and then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.096,
    "end": 1727.809,
    "text": " what can be measured and then what can be measured gets entrapped and then what can be regulated becomes gamed and all these sort of complex ways that assessment of performance fits one into local versus global optima.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1730.251,
    "end": 1733.975,
    "text": "You can also see how instructionalism got systematized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.929,
    "end": 1748.713,
    "text": " yep, if there's a way to do it and this is the way that's approved, even if the later becomes like an improvement in the protocol or some sort of change in the context, maybe it can't be utilized because it's not part of the approved version.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1749.634,
    "end": 1754.435,
    "text": "And so there's no simple answer there because you can't just say, well, okay, accept all changes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.035,
    "end": 1758.316,
    "text": "And then if you just say, okay, we'll have a small bar for making edits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1758.376,
    "end": 1762.958,
    "text": "It's like, there's no perfect trade-off point with the false positives and the false negatives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.658,
    "end": 1782.025,
    "text": " especially for situations that truly are ambiguous, which is why we fall back to these approaches that put us at the kind of functional inflection point of the pragmatic and epistemic outcomes, which is like active inference, rather than just pursuing reward over short term or over some other timeframe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1784.306,
    "end": 1791.009,
    "text": "But common to all these different frameworks for control theory is basically statistical process control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1791.926,
    "end": 1794.687,
    "text": " So maybe whoever made this slide, was it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1795.127,
    "end": 1797.928,
    "text": "Yep, Blue, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.948,
    "end": 1810.132,
    "text": "So statistical process control is a collection of tools and techniques used to measure and analyze process data in order to characterize the behavior of our processes and achieve process control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.199,
    "end": 1820.504,
    "text": " And so in the paper, I don't know how much we'll get into it here, but the paper really describes statistical process control and gives a figure similar to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.564,
    "end": 1828.328,
    "text": "So you have normal process variation, which they described as six sigma deviation from whatever is optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.388,
    "end": 1837.693,
    "text": "So there's the optimal, which is like the green line, and then three sigmas to the up and three sigmas to the down as to like an over or under estimate of your target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.533,
    "end": 1846.437,
    "text": " And then any time that you have a process that deviates from the Six Sigma range, you have the special cause variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.597,
    "end": 1853.46,
    "text": "And so in the business schema that I'm familiar with, at least, which is minimal, but some,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.781,
    "end": 1857.122,
    "text": " You do this root cause analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.222,
    "end": 1860.664,
    "text": "Why is there this special cause variation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.824,
    "end": 1864.646,
    "text": "What happened in that one circumstance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.706,
    "end": 1873.071,
    "text": "We have to go and analyze that instance to find out why it was outside of the sigma deviation because that's an unacceptable data point at that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.512,
    "end": 1874.752,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.252,
    "end": 1875.993,
    "text": "Good explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1880.635,
    "end": 1882.016,
    "text": "How about thermodynamic entropy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.396,
    "end": 1909.503,
    "text": " also um this was also me but um it's a quantity representing the unavailability of a system's thermal energy for conversion into mechanical work often interpreted as the degree of disorder or randomness in the system uh and so you know there's the the law of thermodynamics that says that entropy in the universe is always increasing so um becoming going from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.187,
    "end": 1937.322,
    "text": " more ordered to less ordered or so from highly ordered to more disordered which this kind of shows in this example uh things spreading apart and like it's like you would if you left town for two years and you came back and found that your house was a mess that wouldn't really be surprising like even if you left it clean even if you know i mean just things deteriorate and fall apart and dust goes in and whatever rodents creep around and stuff like that and it's that apparent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.391,
    "end": 1953.538,
    "text": " and empirical local organization of matter like into bones and flesh and life and whatnot and also the always and only co-occurrence of that kind of local organization of energy with cybernetic or anticipatory behavior",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1954.358,
    "end": 1965.347,
    "text": " That's what motivates a kind of framework that is going to, on one hand, work for particles, but also work for active particles and all of the continuum between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.927,
    "end": 1972.873,
    "text": "So that's why there's all these different cognitive structures as well as physical structures that are being linked together through basically physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1973.613,
    "end": 1987.284,
    "text": " And by hooking to free energy principle and variational methods and all these other areas of math and physics, then it puts active inference just like one step closer towards embodiment on some of those different pathways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1987.304,
    "end": 1990.647,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.628,
    "end": 1993.229,
    "text": "Information, theoretic entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.271,
    "end": 2001.536,
    "text": "So this is the Shannon entropy as it's often referred to because it was, I think, first described by Claude Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.368,
    "end": 2010.331,
    "text": " But I always put Maxwell's demon here when I'm thinking about relating thermodynamic energy and informational entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.651,
    "end": 2020.275,
    "text": "And I think, was it Alex Kiefer wrote a paper that really we did in one of the live streams that really kind of outlined how these are connected with the Helmholtz distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.295,
    "end": 2023.576,
    "text": "And so if you really want to dig deeper into these relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.356,
    "end": 2025.077,
    "text": " That's a good way to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.097,
    "end": 2039.317,
    "text": "But I always think about, you know, so Maxwell's Demon is the idea that, you know, if you have molecules like shown on the left here in this box and you have two sides of the box and there's a partition in the center and like, you know, they're cold and hot molecules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.188,
    "end": 2058.064,
    "text": " So if you knew which molecule was hot and which molecule was cold, so if a demon is sitting there who can see is the molecule hot or cold and only lets the hot ones go through to the right and only lets the cold ones go through to the left, and every time he opens the partition, effectively that is work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.865,
    "end": 2060.266,
    "text": "And so just kind of conceptually...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.767,
    "end": 2070.59,
    "text": " That shows that the relationship between information and work, the more information you have, the less work you have to do, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.07,
    "end": 2074.071,
    "text": "So that's kind of the relationship that I think about in my mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.191,
    "end": 2079.172,
    "text": "And then there's a formal definition of Shannon entropy down below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.552,
    "end": 2086.094,
    "text": "But it's usually given in informational context as a measure of surprise, as we've talked about on the live stream many times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.804,
    "end": 2089.886,
    "text": " and they relate information as negative entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.946,
    "end": 2096.75,
    "text": "So it's the reverse, surprise is the reverse of surprise, or sorry, information is the reverse of surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.711,
    "end": 2100.692,
    "text": "Cool, thanks for the explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.952,
    "end": 2101.973,
    "text": "Dean, any thoughts on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.203,
    "end": 2105.285,
    "text": " Yeah, one of the things I... I mean, I love this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.305,
    "end": 2106.507,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.667,
    "end": 2107.788,
    "text": "Thank you for that explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.948,
    "end": 2109.189,
    "text": "It's really good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.69,
    "end": 2116.117,
    "text": "So one of the people I'm reading right now is a guy by the name of Dan Siegel and his book about the mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.477,
    "end": 2117.538,
    "text": "And what he talks about is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.986,
    "end": 2131.315,
    "text": " When people are at dis-ease, so not an easy state, but when they're struggling with something, he talks about the fact that there's one of two ends of a continuum, be it blue and red, in this example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.455,
    "end": 2135.057,
    "text": "One end is chaos and the other is rigidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.978,
    "end": 2140.581,
    "text": "And so from an information theoretic entropy state, are we stuck?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.901,
    "end": 2141.662,
    "text": "Are we bored?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.523,
    "end": 2143.663,
    "text": "Are we feeling trapped?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.264,
    "end": 2146.986,
    "text": "Or are we being overwhelmed or underwhelmed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.645,
    "end": 2152.008,
    "text": " meaning we're not in that in-between state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.028,
    "end": 2163.697,
    "text": "And so I think there's a lot that can be done if we get a basic understanding of Maxwell's demon without sort of getting stared off by it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.916,
    "end": 2166.156,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.596,
    "end": 2181.58,
    "text": "It's almost like, yeah, what would these particles and their temperature represent if they were, I don't know, ideas or something more related to inference rather than just particles, because we're always looking at that intersection between the physical systems and the informational systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2183.601,
    "end": 2183.781,
    "text": "All right."
  },
  {
    "start": 2185.56,
    "end": 2187.121,
    "text": " variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2187.862,
    "end": 2196.65,
    "text": "So this keyword was defined in the paper as the difference between predicted sensory inputs and actual sensory inputs when monitoring processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2199.662,
    "end": 2207.071,
    "text": " VFE increases as the difference increases between what is predicted to happen if actions are taken and what does happen when those actions are taken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2207.631,
    "end": 2217.903,
    "text": "The more prediction errors there are, the more thermodynamic energy will be consumed amidst the thermodynamic entropy of remedial actions, corrective actions, restorative actions, and firefighting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.604,
    "end": 2224.47,
    "text": " This will leave less thermodynamic energy available for doing productive work comprising productive actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.17,
    "end": 2230.175,
    "text": "Thus, if the variational free energy is high, then thermodynamic entropy, e.g.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.295,
    "end": 2236.421,
    "text": "energy not available for doing productive work, will be high, and the thermodynamic free energy, e.g.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2236.541,
    "end": 2238.904,
    "text": "energy available for doing productive work, will be low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2240.202,
    "end": 2245.007,
    "text": " Hence, variational free energy can have an inverse relationship to thermodynamic free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.687,
    "end": 2255.217,
    "text": "This is because the bigger a prediction error, which can be considered in terms of bigger VFE, the smaller can be the thermodynamic free energy available to do productive work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.498,
    "end": 2259.661,
    "text": "So this is a pretty interesting passage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2260.042,
    "end": 2261.143,
    "text": "Did either of you have a thought on it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2264.662,
    "end": 2269.967,
    "text": " it's exploring this thermo-info nexus in a little bit of a different way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.987,
    "end": 2279.657,
    "text": "And on one hand, it's kind of confusing that the variational free energy is going to be the opposite of the thermodynamic free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2280.238,
    "end": 2282.661,
    "text": "But it's almost like, what is happening here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.121,
    "end": 2284.182,
    "text": "And it just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.205,
    "end": 2287.589,
    "text": " to see that they have a negative relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2287.649,
    "end": 2293.82,
    "text": "It's like if the engine were perfectly anticipatory and super efficient, it would be carrying out a ton of work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2294.462,
    "end": 2297.788,
    "text": "If it's moving in a super spurious heat producing way,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.732,
    "end": 2312.149,
    "text": " then the product, lot of variational free energy, a lot of surprising observations relative to functional operation of the motor, then your capacity to perform work to capture those very noisy vibrations is low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.509,
    "end": 2314.752,
    "text": "And so a lot of the underlying",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2316.448,
    "end": 2321.972,
    "text": " potential becomes dissipated rather than used to perform kind of useful inference, useful action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.272,
    "end": 2334.78,
    "text": "So not sure if that's a correct mapping, but I think it'll be cool to talk to the author because this is a very fascinating idea about how different formalizations of free energy actually relate to modeling processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.86,
    "end": 2335.16,
    "text": "Yeah, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2336.275,
    "end": 2340.659,
    "text": " So it's like, I really thought this is kind of what made me think of Maxwell's demon, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.779,
    "end": 2352.128,
    "text": "So it was interesting because, you know, the variational free energy, when we talk about minimizing free energy, we always think about like as minimizing surprise, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.188,
    "end": 2359.133,
    "text": "So if we minimize surprise, then we don't have to do all this thermodynamic energy, like the firefighting that they talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.153,
    "end": 2362.636,
    "text": "And I think that the paper, when we get into the five whys and that figure, I think we'll",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.075,
    "end": 2392.613,
    "text": " elaborate a little bit more on that but um the it's just interesting because we don't have to output as much work and that's kind of what made me think about about maxwell's demon and kind of why i snuck that in there um but yeah you're right i don't know like you know i think that the relationship between um infodynamics and thermodynamics is still very much being defined there's a lot of very recent research um that's looking closely at how those two uh relate to one another nice do you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.823,
    "end": 2406.632,
    "text": " Yeah, I just, I immediately said to myself, I really want my autonomic nervous system to work, and I don't want to have to think about it, because a lot of the mechanical things are dependent on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.832,
    "end": 2413.837,
    "text": "So I'm not sort of pulling apart what the claim is here, but I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.966,
    "end": 2426.311,
    "text": " If you read that, you're kind of saying, okay, a lot of the surprise you're not even aware of because your autonomic nervous system is functioning correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.913,
    "end": 2429.173,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2430.151,
    "end": 2458.673,
    "text": " point there it's almost like a surprise variational surprise does not equate to attention or even especially the conscious awareness of attention in a human psychological situation so it's totally possible that like the difference in pressure sensing depending on your body's posture that's completely normalized out that's recalibrated for the expectations of body position",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2460.086,
    "end": 2462.867,
    "text": " without coming to our attention, unless we bring it to our attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2462.887,
    "end": 2465.587,
    "text": "So that and many other similar examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.967,
    "end": 2471.728,
    "text": "So Dean, I love how you're like not able to stay outside of the biological partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.969,
    "end": 2479.03,
    "text": "Well, I just, I'm not, again, I'm not, I want to be able to create with this stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2479.53,
    "end": 2480.63,
    "text": "I mentioned that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.15,
    "end": 2483.271,
    "text": "And so to me, it's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.616,
    "end": 2487.937,
    "text": " To willfully ignore that is hard for me to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.957,
    "end": 2489.438,
    "text": "I'm not saying it's not possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.138,
    "end": 2493.06,
    "text": "I'm not saying it's the right thing to do here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.5,
    "end": 2495.621,
    "text": "I'm just struggling to let go of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.021,
    "end": 2498.162,
    "text": "I want to let go of it, but I'm having a hard time with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.582,
    "end": 2504.264,
    "text": "Well, and I think for all of us, you know, the urge to apply to every system is very strong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.284,
    "end": 2505.705,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.243,
    "end": 2509.263,
    "text": " Here's table one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2509.683,
    "end": 2521.486,
    "text": "So here's the mapping of a bunch of different sets of terms from active inference constructs, and then thinking about how they're applied in industrial engineering and quality management practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.286,
    "end": 2529.808,
    "text": "So variational free energy, which we just were talking about, is the difference between the predicted sensory inputs and actual sensory inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.305,
    "end": 2539.17,
    "text": " the variational free energy upper bound as well as its lower bound is basically the range in which that system is working well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2539.31,
    "end": 2543.954,
    "text": "It's like the loaves of bread are within the calibration range and we can just keep on pumping them out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2545.236,
    "end": 2551.501,
    "text": " Precision weighting has to do with which aspects of the process are monitored with which level of precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.322,
    "end": 2559.068,
    "text": "For example, which width of a part has to be machined in fractions of a millimeter versus other tolerances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.029,
    "end": 2568.656,
    "text": "And then the expected free energy is the expected energy between the preferred sensory inputs from process operation and the actual sensory inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2570.12,
    "end": 2573.863,
    "text": " So the variational free energy is the difference between the prediction and the actual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2573.883,
    "end": 2581.75,
    "text": "So you have some generative model of your data center, and then you have the generative model of the temperature through time, and then the comparison with the actual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2582.431,
    "end": 2584.833,
    "text": "But here it's about the preferred",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.754,
    "end": 2587.015,
    "text": " versus the actual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.795,
    "end": 2597.542,
    "text": "So that's like we recognize that it is warmer than we would like it to be, which is why we're conditioning our policy in the long range towards getting back to that zone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.083,
    "end": 2601.245,
    "text": "But for now, we need to also have an accurate sensor measurement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.985,
    "end": 2607.189,
    "text": "So that's also a nice juxtaposition that's not always finessed in other papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2610.014,
    "end": 2617.616,
    "text": " The next, in all these keywords, the first set were about free energy and precision and how these terms are calculated relative to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.636,
    "end": 2624.838,
    "text": "The second set of terms in table one is some of the key terms of Bayesian statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.498,
    "end": 2634.661,
    "text": "So just to read only the constructs, and these are also really helpful because we're as a lab thinking about what are the core terms of active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.161,
    "end": 2638.722,
    "text": "What are the definitions that are general enough to be really,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.762,
    "end": 2666.922,
    "text": " educational but also not too limiting or prioritize one sense over another for example so the bayesian terms that would be found in any other course or textbook on bayesian statistics prior expected posterior actual posterior preferred posterior and prediction error so that kind of puts the predictive processing as a uh under the umbrella of bayesian statistics okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2668.683,
    "end": 2675.41,
    "text": " The next set of terms in the table was related to this dichotomy of two different types of inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.15,
    "end": 2692.046,
    "text": "So epistemic inference was defined as updating the definitions of process during process improvement based upon analysis of nonconformance reports, whereas instrumental inference is updating which actions will be included in the process during process improvement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2692.987,
    "end": 2696.429,
    "text": " So this is sort of like epistemic knowledge based.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2696.67,
    "end": 2702.974,
    "text": "This is about updating the knowledge based upon especially the times where things don't go right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2702.994,
    "end": 2712.781,
    "text": "And then this is like policy inference, action planning as inference, because it's like instrumentally is actually like about what the instrument is gonna do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.762,
    "end": 2716.123,
    "text": "So, and then the last, oh, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2716.184,
    "end": 2718.125,
    "text": "Any thoughts on these terms?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2720.455,
    "end": 2729.282,
    "text": " Okay, then the next set of terms in table one was Markov blanket, internal state and external state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2730.043,
    "end": 2737.77,
    "text": "So definitely check out number 14, number 26, a few of the other live streams to learn more about the Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2737.97,
    "end": 2741.193,
    "text": "And this is a figure from DaCosta et al, 2021.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2742.474,
    "end": 2748.339,
    "text": "The blanket is here the boundary state between the internal state of the social organization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.505,
    "end": 2758.201,
    "text": " So those are the ones and the external state of the environment when operating processes are defined in the quality management system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.249,
    "end": 2760.891,
    "text": " then what are those internal states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2761.451,
    "end": 2767.777,
    "text": "Those are the social or organizational processes developed during industrial engineering for minimum risk in the process environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2768.538,
    "end": 2770.059,
    "text": "And then the external state is the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.88,
    "end": 2782.751,
    "text": "So that's kind of mapping the Markov blanket, kind of the car, the interfaces and outside the car, or maybe that's not the perfect mapping, but I think that's kind of what is being suggested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.472,
    "end": 2784.092,
    "text": "And then the last,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.895,
    "end": 2797.198,
    "text": " few terms of table one are four of just the general constructs, general principles that are also section headers and important topics, risk, ambiguity, principle of least action, and principle of survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.538,
    "end": 2798.738,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2801.058,
    "end": 2809.5,
    "text": "Yeah, so I think all of this ties into a way of looking at the world through rows and columns, which is fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.52,
    "end": 2814.041,
    "text": "I mean, it's a good place to try to look at things and analyze them, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.186,
    "end": 2823.948,
    "text": " Not everybody creates off of that because not everybody is necessarily looking for a precision forward view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.448,
    "end": 2831.29,
    "text": "Sometimes you're experimenting and you're making all kinds of mistakes and learning from that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.87,
    "end": 2836.271,
    "text": "And so, again, you just want to see this for what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.451,
    "end": 2841.073,
    "text": "It's nothing wrong with it, but it's not the only way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.873,
    "end": 2842.173,
    "text": "That's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.814,
    "end": 2846.415,
    "text": " Blue, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2849.42,
    "end": 2851.703,
    "text": "Okay, so then there's the figures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2852.685,
    "end": 2855.99,
    "text": "And these will recall some of the key terms we talked about earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2857.828,
    "end": 2881.215,
    "text": " uh the text says as shown in figure one spc charts these statistical process control charts have upper and lower control limits and processes need to remain within these limits processes that go outside the limits do not meet specifications that define intended states so left side good top of the drake meme right side bad bottom of the drake meme not working",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2884.136,
    "end": 2906.832,
    "text": " okay figure two is this five wise so it's written out here more textually if you want to pause it and look at it and here it's more graphical so do either of you want to give a thought on the five wise or okay well the scenario that's laid out is uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.915,
    "end": 2913.936,
    "text": " kind of working backwards from why there was a not reliable organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.857,
    "end": 2918.638,
    "text": "And the five whys, it's actually not related to Aristotle's four whys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2919.218,
    "end": 2920.998,
    "text": "But that would have been a nice opportunity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2921.038,
    "end": 2922.739,
    "text": "Maybe there's a four by five matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2923.399,
    "end": 2931.621,
    "text": "But these five whys are referring to needing to go back kind of five layers, or like five",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2932.523,
    "end": 2939.066,
    "text": " derivatives up the chain, asking what led to a high reliability organization being unreliable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2940.047,
    "end": 2946.069,
    "text": "So the general case of this sort of cascading failure in terms of variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2946.149,
    "end": 2948.771,
    "text": "So the general phrasing is that there's high,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2949.651,
    "end": 2952.132,
    "text": " uncertainty, high entropy in work instructions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2952.492,
    "end": 2962.838,
    "text": "So the IKEA instructions are not accessible enough to many people or the radio is really blurry so people can't hear what letters are being said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.979,
    "end": 2972.144,
    "text": " And then that makes the variational free energy high because of prediction errors, which then leads to unproductive actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2972.164,
    "end": 2975.826,
    "text": "So then you're scanning on the radio because you can't quite lock on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.326,
    "end": 2977.587,
    "text": "And then that's consuming energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2978.247,
    "end": 2983.51,
    "text": "And then that ends up reducing your battery so that you can't do what you actually need to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.311,
    "end": 2989.834,
    "text": "And then the case in this truck driver incident is that the truck driver is getting ambiguous signals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.6,
    "end": 2991.341,
    "text": " logistical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2991.401,
    "end": 2999.446,
    "text": "So this itself is a policy communication from like, you know, some cloud mapping service or the company that's contracting the trucker.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3000.407,
    "end": 3009.073,
    "text": "And then this leads to the driver having increased spatial uncertainty getting lost, which leads them to drive around unproductively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.634,
    "end": 3014.157,
    "text": "So they don't have enough fuel to efficiently complete the deliveries that are important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.322,
    "end": 3024.527,
    "text": " And so here's the graphical layout of the five whys showing with that example, how on the bottom is the truck drivers getting the bad info.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.327,
    "end": 3038.335,
    "text": "And then that surfaces after sort of several repercussions in terms of the structure of multi-level decision-making and active inference, how we can...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.543,
    "end": 3060.95,
    "text": " use this framework which maybe is used in industry and map it onto the states of decision making from active inference perspective but notice that there's no reward here it's not well drivers uh minimize their reward about this or you know risk on this or maximize their reward on this so it just shows how this sort of um framework",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.065,
    "end": 3069.726,
    "text": " has a different framing than people might expect if the only machine learning model they were aware of was machine learning and specifically reward reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3070.026,
    "end": 3070.147,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.854,
    "end": 3073.616,
    "text": " Yeah, and it isn't just industrial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.056,
    "end": 3087.69,
    "text": "You can be like me and jump in the car with two of my friends who are both emergency doctors and you're heading off to the ski hill and at some point the conversation comes around to there are no accidents in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.671,
    "end": 3094.357,
    "text": "And, of course, being emergency doctors, they see the outcomes of accidents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.706,
    "end": 3120.399,
    "text": " events happening to people and so their perspective is there's always a way of being able to go back and see all the parts of the decision branch and how it arrived in front of them and them having to sort of put the pieces back together again but again i don't i don't know that necessarily that that means that randomness doesn't come into play and there isn't a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.098,
    "end": 3135.612,
    "text": " certain part of this where the variation simply can't be um calculated in but i still go skiing with them i don't i don't just just dislike them or defriend them so anyway yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.978,
    "end": 3145.605,
    "text": " it just reminds me of like when I dropped a hard drive and then I thought, well, I guess this is the one in a hundred hard drives that fails every year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.446,
    "end": 3148.969,
    "text": "Yes, but it was also the one time that I dropped it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.549,
    "end": 3152.852,
    "text": "So there's always this sort of like N equals one way to uncouple",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.853,
    "end": 3160.137,
    "text": " cause and effect or potentially actionable consequence to the not reliability of your organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.478,
    "end": 3174.106,
    "text": "But then also there's this designing for the statistics when they decide to make a recall or not based upon, you know, the relative amount of failure versus the relative amount of, you know, legal changes needed, something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3174.707,
    "end": 3182.712,
    "text": "So that's where you talked earlier about including co-occurrence instead of just only giving time over to the sequential aspect of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.717,
    "end": 3183.857,
    "text": " Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3184.698,
    "end": 3193.866,
    "text": "So figure three frames the quality management systems, the QMS, the quality manual as a generative model comprising beliefs about processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3194.747,
    "end": 3204.475,
    "text": "So it's interesting because it could be seen as just a cookbook, recipe book, instruction book, but it's being at least deployed in a generative capacity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3205.49,
    "end": 3213.678,
    "text": " And instead of just like saying, you know, whip the eggs for five minutes and then until they're frothy or, you know, until they are this, make peaks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3214.159,
    "end": 3216.321,
    "text": "It's like, we expect it to make peaks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3217.102,
    "end": 3219.805,
    "text": "Whip it until your expectation is achieved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.805,
    "end": 3223.126,
    "text": " It's a different way to get to that same outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3223.506,
    "end": 3224.887,
    "text": "Now, which one's gonna be more resilient?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3224.907,
    "end": 3227.909,
    "text": "If it says five minutes and there's no peaks, then what do you do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.169,
    "end": 3229.009,
    "text": "Do you add something?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.069,
    "end": 3230.01,
    "text": "Do you keep on going?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3230.59,
    "end": 3237.854,
    "text": "Whereas if you have a precision seeking process, maybe you can be resilient to it if it only takes two minutes and you don't overdo it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.7,
    "end": 3245.708,
    "text": " And the example of something being correct, like 99 out of 100 times is just used, I think, just repeatedly in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3246.349,
    "end": 3249.032,
    "text": "Just it could be calibrated differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3249.072,
    "end": 3250.193,
    "text": "And I'm sure it's situational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.474,
    "end": 3251.815,
    "text": "It's just sort of like shorthanded 99 out of 100.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3253.882,
    "end": 3259.223,
    "text": " But yeah, it is defining these QMS in terms of the active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.283,
    "end": 3260.084,
    "text": "So what should be done?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.104,
    "end": 3266.905,
    "text": "You know, pipette 50 microliters of fluid into the little tube, and then you monitor something about the process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.865,
    "end": 3281.649,
    "text": "And then that leads to this feedback cycle between the quality management review, and then that being in kind of co-evolution with the industrial engineering itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3282.608,
    "end": 3294.756,
    "text": " And then that leads to the update of the process in the quality manual in step four, so that then there's kind of like, okay, if it's too low after your first pipette, then do a little bit more pipetting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3295.537,
    "end": 3303.282,
    "text": "And then they keep on protecting that 99% functional outcome at each of those nodes that are bifurcating out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.583,
    "end": 3305.784,
    "text": "Okay, any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3309.444,
    "end": 3316.329,
    "text": " I'm not going to read this whole thing, but the top part talks about this design for assembly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3316.99,
    "end": 3321.253,
    "text": "And one of the principles is to make parts either symmetrical or clearly asymmetrical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.353,
    "end": 3322.994,
    "text": "So nothing in the uncanny valley.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3323.555,
    "end": 3328.258,
    "text": "This is done so that it is immediately and unequivocally apparent how a part is to be put into sub-assembly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.099,
    "end": 3334.102,
    "text": "And this is the famous IKEA catalog aesthetic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.303,
    "end": 3340.405,
    "text": " and how that made furniture building like fun and accessible for some people, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3341.466,
    "end": 3347.369,
    "text": "And then in this second quote, it is kind of thinking about that IKEA paradigm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3347.909,
    "end": 3362.716,
    "text": "Although furniture companies may not be considering their industrial engineering in terms of minimizing variational free energy, it is apparent that its aim is to minimize errors between what it intends to people to see when looking at its furniture kits and what people do see when looking at its furniture kits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3363.556,
    "end": 3374.504,
    "text": " So it's sort of like the goal should be to make it look like it looks on the sale room floor or like it looks like in your imagination after you see the advertising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3375.324,
    "end": 3385.011,
    "text": "And then if you can see those flat pieces of wood and you can see that instruction booklet and you can see the policy, then you're going to be not surprised.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.231,
    "end": 3388.854,
    "text": "You're going to be satisfied because your preference was to have like the couch there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3389.734,
    "end": 3391.716,
    "text": "So just kind of a cool example that highlights how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.226,
    "end": 3395.107,
    "text": " Our preferences aren't just over temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3395.788,
    "end": 3403.373,
    "text": "We often talk about those kinds of examples, but we can also have preferences for having affordances or niche modifications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3403.834,
    "end": 3406.396,
    "text": "Like we can have a preference to have a handle on something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.216,
    "end": 3411.199,
    "text": "And then that kind of relates us to this like behavioral economics under active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.239,
    "end": 3415.442,
    "text": "Like what makes somebody expect there to be a new couch in their living room?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.982,
    "end": 3419.545,
    "text": "And then what makes them drive out and pick it up on the weekend and everything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3420.266,
    "end": 3420.486,
    "text": "And then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3422.347,
    "end": 3430.45,
    "text": " It's this kind of idea that the supply chain is this extended uncertainty reducer and it's like bringing stuff to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3431.17,
    "end": 3443.415,
    "text": "And then there's this notion in this computational industrial case and in the at home case where the assembly information that's provided is a policy decision from the people who are making the product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3443.435,
    "end": 3447.737,
    "text": "And then that really relates to like participation in making that product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.237,
    "end": 3456.544,
    "text": " If it's all pre-compiled, then there's no affordance for participation versus having like a culture of people working through it for many different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3458.645,
    "end": 3468.834,
    "text": "And then this was just the funny example of the interface, which said, although there may be little risk in furniture assembly, this can be followed by much ambiguity in furniture installation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3469.334,
    "end": 3472.356,
    "text": "So in other words, it's not just about what's on this brochure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3473.444,
    "end": 3481.552,
    "text": " Because predetermining all the possible prediction errors in fixing the assembled furniture to walls in millions of different buildings around the world is very challenging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3482.693,
    "end": 3493.844,
    "text": "And so there's this difference between the assembly information, like how do you just assemble the system of interest, which is just the internal and blanket states of the new shelf,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3495.219,
    "end": 3499.903,
    "text": " What's the difference between that information, how to build the bookshelf, and then the operations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3499.943,
    "end": 3502.405,
    "text": "Like, oh, well you didn't tell me that I couldn't kick it from the side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3502.745,
    "end": 3504.486,
    "text": "It's like, you just told me how to build it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.627,
    "end": 3506.028,
    "text": "You didn't say that I couldn't use it this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3506.748,
    "end": 3522.18,
    "text": "And then, so how do you design for internal coherence versus designing for interoperability with sort of unknown unknowns and all these different types of entities that the system's gonna interact with on the blanket, on the interface?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.981,
    "end": 3535.884,
    "text": " So it's not just the Ikea booklet, but I thought that was kind of an interesting notion that even just building it wasn't really the end of the story because then people take their perfectly built bookshelf and then just like staple it to the wall the wrong way and like ruins both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3536.944,
    "end": 3537.344,
    "text": "So Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3539.184,
    "end": 3543.925,
    "text": "Yeah, and then, I don't know if you can see this, but then how do you account for this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.965,
    "end": 3551.347,
    "text": "How do you account for somebody who took a piece of olive wood, any random piece of olive wood and turned it into something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.577,
    "end": 3573.735,
    "text": " like this right so it's not there's no there's no billy there's no way of deconstructing this you just have to pick up you have to pick up something that is a mark off blanket it's it's as it's pre-carved and then you have to be able to pull out what you think is in that and how do you how do you engineer that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.636,
    "end": 3576.857,
    "text": " Well, it's a completely different process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.917,
    "end": 3581.158,
    "text": "So I think as people, we're capable of doing both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.818,
    "end": 3593.482,
    "text": "And I'd love to talk to the author about how you do this kind of work when there's certain results that are...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.679,
    "end": 3597.44,
    "text": " are available and are part of the active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.52,
    "end": 3599.981,
    "text": "So it'll be a nice contrast tomorrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.141,
    "end": 3600.381,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.641,
    "end": 3600.881,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3600.962,
    "end": 3601.202,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3601.762,
    "end": 3602.302,
    "text": "Good point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3602.362,
    "end": 3606.344,
    "text": "Like where's artisanship and craft in this phrasing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3607.478,
    "end": 3614.761,
    "text": " So here's an example using that case of the bookshelf or the cupboard being bolted to a wall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3615.582,
    "end": 3623.625,
    "text": "And this also gets at that partition between the part of the system that you can design and then the part of the system that is not being considered.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3624.285,
    "end": 3629.868,
    "text": "So here, the internal states, and this is kind of interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3630.588,
    "end": 3634.89,
    "text": "It'll be cool to see who is there alive to talk about this sort of embodiment aspect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3636.854,
    "end": 3641.438,
    "text": " The internal state is the person's embodied prior knowledge of fixing assembled cupboards to walls.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3642.479,
    "end": 3659.913,
    "text": "And depending on what they know about carpentry, if they're just totally watching the YouTube video and then letting it rip versus if they're experienced, with different materials, they're gonna take actions and that's gonna modify the niche, which is the external state, the room to which the cupboard will be fixed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3660.654,
    "end": 3664.057,
    "text": "And that's going to be reflected in what the person perceives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3665.459,
    "end": 3690.764,
    "text": " then it's just cool like the here maybe there's multiple ways to interpret the center it's like there's the wall blocking like external blocking state then there's like the affordance block where the tools are inadequate like you know you need the the hex wrench of size seven and you only have the size four so you just can't do it even if you know how to do it and there's times where even if you have the right tool it's like it's too rusty to do it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3691.664,
    "end": 3705.298,
    "text": " so there's like it's just a cool example and shows a little bit of that that horseshoe theory again between philosophy and engineering where they're both radically focused on embodiment and pragmatics okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3706.653,
    "end": 3712.595,
    "text": " Then the next section after four is seven, active inference as a unifying framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.295,
    "end": 3732.742,
    "text": "And so basically they write, an important application of active inference theory can be as a unifying framework for a social organization framework summarized in figure five, which we'll look at in a second, operated through quality management systems, QMS, via interoperability protocols at an upper level of multi-tier enterprise architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3733.282,
    "end": 3734.783,
    "text": "So before we look at figure five,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3735.788,
    "end": 3744.85,
    "text": " It's just like, how does active inference serve as a unifying framework in some of these areas that we've been talking about for the last months?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3745.151,
    "end": 3756.794,
    "text": "Like we've heard people use this integrating word to talk about active in action and perception, engineering, biology, communication, cyber physical systems, remote teams, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3757.074,
    "end": 3761.335,
    "text": "So just it's being used a little bit in a different way here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3761.895,
    "end": 3765.056,
    "text": "So let's see figure five and then you can give any thoughts on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3766.94,
    "end": 3777.906,
    "text": " Here, organizational active inference is again being mapped onto this sense, internal, action, external loop, this kind of a circular loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3778.546,
    "end": 3780.587,
    "text": "The internal states are the organization's belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.888,
    "end": 3793.415,
    "text": "Just like in figure four, it was the person's embodied beliefs, here it's the organization's embodied beliefs embodied in the QMS, which is again being framed as beliefs over processes and states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3794.528,
    "end": 3800.274,
    "text": " That results in human and artificial intelligence employed to fulfill specifications, procedures, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3800.814,
    "end": 3804.718,
    "text": "So these can be actions that are taken by APIs or bots or by people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3805.399,
    "end": 3814.268,
    "text": "This acts upon the external states, which lead to perceptions of sensory states, which could be the temperature in the room,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3814.957,
    "end": 3817.319,
    "text": " It could be the pH of the wine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.339,
    "end": 3819.661,
    "text": "It could be the number of sales on the course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3820.302,
    "end": 3834.774,
    "text": "So then they do industrial engineering on this loop as an organization in relationship to integrating perception and action through internal state updating, pretty much just like we've been talking about for all these other active inference systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3835.094,
    "end": 3835.454,
    "text": "Any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3835.474,
    "end": 3839.438,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.368,
    "end": 3849.017,
    "text": " Table 2 writes, there can be many reasons why pragmatics subsumes semantics and leads to prediction errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3849.578,
    "end": 3860.871,
    "text": "For example, inept priors and inept preferred posteriors can come from lock-ins, path dependencies, and success traps, which place emphasis on past experiences over new information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3861.966,
    "end": 3876.421,
    "text": " Individuals may seek to survive by learning from filtered information that supports the preconception of groups, which they believe can support their individual survival, rather than seek information that supports the efficient reduction of prediction errors in external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3877.282,
    "end": 3881.587,
    "text": " So it's almost like you can't prefer what you prefer so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3881.767,
    "end": 3894.401,
    "text": "Otherwise, you're going to, I don't know, maybe follow that local band all the way to a local end instead of sometimes coming out of that local organizer, local local attractor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3895.245,
    "end": 3897.606,
    "text": " And any want to go for this blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3897.926,
    "end": 3898.087,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3898.327,
    "end": 3898.587,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.607,
    "end": 3901.048,
    "text": "It just, it seemed like just confirmation bias, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.068,
    "end": 3905.831,
    "text": "You seek to survive by learning the information that supports the preconceptions of groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.011,
    "end": 3906.191,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.211,
    "end": 3910.253,
    "text": "So that's like, you know, I believe this, my, my, can, can my group believe this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.313,
    "end": 3911.073,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.574,
    "end": 3911.974,
    "text": "That's that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.274,
    "end": 3912.514,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3912.934,
    "end": 3914.195,
    "text": "This is a cool table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3914.255,
    "end": 3915.376,
    "text": "It's like, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3915.856,
    "end": 3917.837,
    "text": "So in the perception phase of active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3918.922,
    "end": 3930.407,
    "text": " You can have a top-down error based upon inept priors, so you can believe the wrong thing about what you should expect to see, or you can have the sensor be influenced, interesting about e.g.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3930.467,
    "end": 3936.21,
    "text": "emotion, but that's, I guess, being phrased as a bottom-up way that perception can be modified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.662,
    "end": 3941.565,
    "text": " And then in the intermediary, intermediate, it's bounded rationality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3941.785,
    "end": 3948.189,
    "text": "So that's kind of like a compromise between what you think is possible and magical realism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.47,
    "end": 3960.197,
    "text": "Then the action phase also can be run aground by inept, focusing on basically poor outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3960.217,
    "end": 3965.901,
    "text": "Like if you're aiming for five degrees off of shooting a free throw, then you're going to miss the free throws, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.028,
    "end": 3973.793,
    "text": " And then that also your attention could be affected by poor signal to noise ratio, like if you couldn't see where the hoop was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3975.234,
    "end": 3981.299,
    "text": "And just interesting how like it's being really methodically broken down the sources of where the error can come from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3982.76,
    "end": 3985.963,
    "text": "And then also in table three, there's a nice distinction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3987.642,
    "end": 3998.447,
    "text": " And it relates to that notion that active inference would be potentially very effective for repetitive processes, but potentially not as effective for one-of-a-kind processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3999.107,
    "end": 4004.83,
    "text": "And so the repetitive processes are like mass production, and then the one-of-a-kind processes are like the project production.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4005.39,
    "end": 4014.514,
    "text": "So right off the bat, it's kind of like, well, how individual does a project need to be before it's not best modeled by active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4015.868,
    "end": 4025.016,
    "text": " And then it just talks about how Markov blankets, generative models, prediction error, and variational free energy play out in both of these two areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4025.756,
    "end": 4039.648,
    "text": "So that would definitely be something for people to like read through the table and then mention it and give a specific example or question to the author because this is like super informative and a cool combinatoric way to look at how ideas are related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4040.008,
    "end": 4041.089,
    "text": "So yeah, Dean and then Blip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4043.546,
    "end": 4071.932,
    "text": " So when I'm looking at this, and I don't know if this is helpful or if this just makes it even more turbid, but if one hand of this is the ability to frame something so that we know what's in, what we're looking at versus what we're not looking at, and if the other hand is how we match, essentially if you go back to table two and this, table three and the figure, the matching is what's superordinate and what's subordinate, what's inside of what,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.044,
    "end": 4074.088,
    "text": " Those are the two hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.148,
    "end": 4079.105,
    "text": "That still doesn't tell us what is going on in between, which I think is the fit piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.086,
    "end": 4092.67,
    "text": " which from a thinking standpoint is, am I fitting now hand in glove, meaning is my glove size large or is it glove in hand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.17,
    "end": 4103.533,
    "text": "Does the glove I need serve the purpose because I'm skiing or because I'm foraging or I'm water skiing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.613,
    "end": 4108.955,
    "text": "So between framing and matching,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.614,
    "end": 4111.314,
    "text": " is this fit question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.474,
    "end": 4113.535,
    "text": "All three of them are different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.595,
    "end": 4116.715,
    "text": "The fit is in between these other two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.335,
    "end": 4131.598,
    "text": "And even if we make a great table, even if we make sure that we got the right headings and right definitions underneath, it still doesn't talk about, is it glove in hand or hand in glove?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.978,
    "end": 4135.659,
    "text": "And I think for people who want to actually use active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.394,
    "end": 4144.557,
    "text": " They want to be able to not get stuck conflating fit with frame or conflating fit with match.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.997,
    "end": 4154.441,
    "text": "They want to put those two parameters, the frame and the match on the outside, and then see what happens in the middle based on what those parameters are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4154.781,
    "end": 4156.982,
    "text": "I think that's the struggle for most people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.699,
    "end": 4163.044,
    "text": " trying to gain entree into, well, how does this active inference thing actually work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.624,
    "end": 4164.985,
    "text": "It works different all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4165.226,
    "end": 4167.167,
    "text": "That's the point of the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.608,
    "end": 4175.434,
    "text": "It's the potential to be able to invert at will that I think laying it out this way helps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.855,
    "end": 4184.382,
    "text": "It gets you like 90% of the way there, but it doesn't really tell you what you could do with it as opposed to what just happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.598,
    "end": 4187.339,
    "text": " Very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4188.019,
    "end": 4188.26,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4188.96,
    "end": 4189.141,
    "text": "Lou?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.103,
    "end": 4200.031,
    "text": "So, like, just kind of this piggybacks right off of what Dean was saying, like the Markov blanket, and even here in the first line of this table,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.783,
    "end": 4205.085,
    "text": " you know, the Markov blankets are hard when they're shifting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.406,
    "end": 4214.873,
    "text": "And this is something that we've talked about in other live streams in other contexts, like shifting, overlapping, my Markov blanket, interacting with your Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4214.933,
    "end": 4226.703,
    "text": "I think that, you know, the underlying mathematics to support those kinds of arguments are kind of missing still, or not missing, but still being worked out is probably more correct than",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.949,
    "end": 4230.491,
    "text": " But, but I do think that Markov blankets do change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.511,
    "end": 4237.115,
    "text": "I mean, even if I just think about like my brain as, you know, Markov blanket, like cells die, cells are born.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.335,
    "end": 4241.337,
    "text": "And I know that that's very controversial in the neuroscience field, but, but cells are actually born.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4241.357,
    "end": 4245.94,
    "text": "So, so, I mean, there's, there's constantly this, this turnover of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.454,
    "end": 4252.896,
    "text": " who belongs inside the Markov blanket and any kind of, you know, organizational structure has that shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.076,
    "end": 4258.218,
    "text": "It's not like the boundary of the Markov blanket has to be, has to retain some kind of flexibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.798,
    "end": 4263.28,
    "text": "And, and so that, you know, is, is seen here in this, in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.773,
    "end": 4265.593,
    "text": " first line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.313,
    "end": 4268.354,
    "text": "And also, whose generative model is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.574,
    "end": 4272.935,
    "text": "So this is kind of another something that I was like, hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.255,
    "end": 4278.317,
    "text": "So the quality management solution, or the QMS, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.077,
    "end": 4280.697,
    "text": "I maybe got the abbreviation wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.077,
    "end": 4284.638,
    "text": "But that is the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.978,
    "end": 4287.139,
    "text": "But who does it belong to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.179,
    "end": 4288.559,
    "text": "Does it belong to the process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.9,
    "end": 4293.601,
    "text": "Does it belong to, and this is maybe my deficiency in my understanding of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.421,
    "end": 4296.763,
    "text": " industrial engineering, because I'm just not familiar with the jargon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.803,
    "end": 4300.125,
    "text": "But like, is it the process that gets the quality management solution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.205,
    "end": 4302.787,
    "text": "Or is it the organization that has the quality management?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.827,
    "end": 4304.468,
    "text": "Or is it like some kind of subunit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.588,
    "end": 4305.268,
    "text": "Is it a team?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.689,
    "end": 4311.433,
    "text": "So I'm just kind of unsure about they talk about this is the generative model, but like, whose model is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.053,
    "end": 4318.978,
    "text": "And like, so depending on on how that's answered, and we'll have the author on so we can ask them, but depending on how that's answered,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.171,
    "end": 4329.577,
    "text": " you know, these one-of-a-kind processes, as I said earlier, can maybe be used to update the generative model in a very explorative kind of way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.238,
    "end": 4331.458,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4332.479,
    "end": 4336.842,
    "text": "So here's just for a few implications and bigger questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4337.942,
    "end": 4339.083,
    "text": "So here's just a quote.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.283,
    "end": 4341.685,
    "text": "Markov blankets are not features of real-world systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4342.065,
    "end": 4344.607,
    "text": "Rather, they are an intuitive post hoc ascriptions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4345.6,
    "end": 4350.267,
    "text": " Rather, they are intuitive post-hoc descriptions made in order to model real-world systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4350.948,
    "end": 4359.962,
    "text": "Hence, any description of a Markov blanket is subjective and can be changed over time as the modeler's focus changes and or as real-world systems change in the opinion of the modeler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4360.936,
    "end": 4366.583,
    "text": " Thus, as summarized by phrases such as the map is not the territory, Markov blankets, da-da-da-da-da-da-da.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4366.884,
    "end": 4368.466,
    "text": "And then also, this is a funny line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4369.387,
    "end": 4375.715,
    "text": "It has been argued in relation to Markov blankets and other important constructs in active inference theory that the math is not the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4377.861,
    "end": 4379.022,
    "text": " wherever you heard that one before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4379.622,
    "end": 4383.303,
    "text": "But this is like kind of the ultimate instrumental take.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4384.224,
    "end": 4392.847,
    "text": "It's making a clean distinction between map and territory, between the utility-driven use of active inference and claims about what the system really is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4393.928,
    "end": 4403.472,
    "text": "And then this, just the last line, but it's an interesting quote, but I'll just read the last line is, move to the slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4405.285,
    "end": 4415.707,
    "text": " Hence, the ascription of Markov blankets could be a recurring challenge throughout project production, which may only be resolved by reference to decisions made in courts of law long after the project is completed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4416.307,
    "end": 4433.93,
    "text": "Just maybe think about, I don't know, maybe like the Bay Bridge being built in the Bay Area in California and like, you know, it was years later and it happened differently and I'm sure some companies were bought and sold and all the morphing of the organization and the physical modification of the project and the personnel changing over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4434.81,
    "end": 4446.226,
    "text": " all of that which is sort of this on one hand it's an n equals one unique enacted situation but then on the other hand there's principles for engineering it well and uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4447.296,
    "end": 4453.382,
    "text": " Sometimes the process is itself wondering about how it's organized, and then sometimes you can't even know until it's after it's done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.402,
    "end": 4455.584,
    "text": "So that's just kind of cool and funny.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4458.387,
    "end": 4465.394,
    "text": "Another quote, this is sort of taking a take on philosophy from the engineering perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.368,
    "end": 4476.619,
    "text": " Exactly how beliefs are updated in embodied cognition is a topic of ongoing research, which involves specialist mathematics to describe relationships between prior probabilities and posterior probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4477.64,
    "end": 4485.368,
    "text": "By contrast, updating beliefs through active inference in industrial engineering and quality management involves applying well-established practical methods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4486.209,
    "end": 4493.033,
    "text": " In particular, planning what should happen by active inference involves developing processes through applying industrial engineering techniques.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4493.713,
    "end": 4502.197,
    "text": "So it's sort of like we know what our policy affordances and mechanism of updating our affordances are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4502.678,
    "end": 4503.438,
    "text": "That's our discipline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4504.418,
    "end": 4512.703,
    "text": "And so more broader question is what are the implications for generalized frameworks like embodied cognition or active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4513.789,
    "end": 4519.991,
    "text": " What are the implications when they interface with disciplinary or project-specific one-time work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4520.912,
    "end": 4526.314,
    "text": "And then how does active inference get simplified in the context of industrial engineering?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4526.914,
    "end": 4534.697,
    "text": "And how does work in the disciplines become linked in a bidirectional conversation to the broader body of knowledge?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4535.997,
    "end": 4537.458,
    "text": "Just general questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4538.398,
    "end": 4538.718,
    "text": "Any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4538.778,
    "end": 4539.959,
    "text": "Okay, Dean, yeah, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4549.666,
    "end": 4550.287,
    "text": " Dean, you're muted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4550.307,
    "end": 4551.287,
    "text": "Yeah, I can't hear you, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4553.188,
    "end": 4553.628,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4553.648,
    "end": 4554.028,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.108,
    "end": 4554.649,
    "text": "Yeah, continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4556.669,
    "end": 4557.57,
    "text": "No, my bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.51,
    "end": 4564.553,
    "text": "Whether we're talking about the Bay Bridge as do we have the proper glove in hand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.8,
    "end": 4573.863,
    "text": " or whether we're talking about instrumentalism, do I actually have a precise fit of glove for my hand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.944,
    "end": 4582.786,
    "text": "I think what we have to be aware of is that both of those questions come up post hoc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.047,
    "end": 4591.93,
    "text": "I tried on the glove and it worked, or maybe the design of the Bay Bridge should have been different given the contextual circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.72,
    "end": 4611.573,
    "text": " All I'm curious about is, so before the Bay Bridge is built, before I fit one of two questions into that glove-hand relationship, am I aware of how that can be seen post hoc or ad hoc?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.663,
    "end": 4620.226,
    "text": " conscious of the fact of where I'm taking this active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.266,
    "end": 4622.788,
    "text": "And as Lou pointed out earlier, whose is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.128,
    "end": 4628.691,
    "text": "And now just as importantly, when is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4628.932,
    "end": 4633.334,
    "text": "When is that question being asked in the context of what the product is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.354,
    "end": 4637.037,
    "text": "Because if we're gonna talk about social organizations as the product,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.924,
    "end": 4640.285,
    "text": " Active inference allows us to look on both sides of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.765,
    "end": 4655.95,
    "text": "So as long as we're including the when in terms of discovering fit, I think we're actually using active inference in terms of what its potential is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.09,
    "end": 4656.47,
    "text": "That's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.95,
    "end": 4658.39,
    "text": "Nice comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4658.41,
    "end": 4659.851,
    "text": "Little philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.531,
    "end": 4663.432,
    "text": "Not like we need that, but I'm just throwing it in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.732,
    "end": 4664.232,
    "text": "Yeah, that's cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.352,
    "end": 4667.053,
    "text": "So then here's another quote.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4670.048,
    "end": 4676.235,
    "text": " In terms of the explore-exploit dynamic, project production involves much more exploration than exploitation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4676.715,
    "end": 4679.599,
    "text": "Hence, more wayfinding than navigation is involved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.059,
    "end": 4684.424,
    "text": "In particular, wayfinding involves the ability to create novel routes which are based...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4685.345,
    "end": 4689.05,
    "text": " on understanding a wider frame of reference than navigating along a preset route.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.871,
    "end": 4701.626,
    "text": "Wayfinding involves creating novel routes through changing situations by making non-conscious reference to subjective prior knowledge and conscious subjective reference to current situations and semantic information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4702.691,
    "end": 4708.395,
    "text": " That's pretty dense, but pretty fascinating because it does point at this kind of like repetitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4709.015,
    "end": 4713.878,
    "text": "Then you can just write out the directions and follow them in a little bit more of a rule following way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4714.618,
    "end": 4720.322,
    "text": "And then the extreme case being like a train, like the Cal train just went from San Francisco to San Jose, just went.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4720.422,
    "end": 4723.204,
    "text": "And it was like, it had, you know, the affordance to speed up or slow down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4723.684,
    "end": 4727.727,
    "text": "But then when there's the bushwhacking or the wayfinding here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4728.547,
    "end": 4730.649,
    "text": " then there's almost like novelty of path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4730.769,
    "end": 4736.274,
    "text": "And then there's higher novelties like introducing a new tool or climbing to the top of a tree to see further.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4736.674,
    "end": 4744.061,
    "text": "But there's just this path finding novelty that is really important for all kinds of these applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4744.481,
    "end": 4744.722,
    "text": "So just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4746.058,
    "end": 4770.435,
    "text": " raises the question that'll be cool to discuss about like how does active inference uh juxtapose or interface with sense making and wayfinding um explore exploit the pragmatic epistemic distinction and then the way that the models are fit with accuracy minus complexity just how does that come together in active any thoughts or good yep dean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.42,
    "end": 4775.244,
    "text": " Yeah, because wayfinding is my niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.504,
    "end": 4778.447,
    "text": "I was just so happy that he pulled these two references.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.487,
    "end": 4788.076,
    "text": "If you haven't read work of 95 and 96 here, I strongly recommend it because he's pulled out two fantastic references in terms of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4791.004,
    "end": 4794.568,
    "text": " things you could look at in terms of what that exploration piece actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.768,
    "end": 4797.511,
    "text": "They're both fantastic, especially the 95.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4797.791,
    "end": 4806.7,
    "text": "I've read both of them and they're both excellent examples within the context of what he's trying to talk about in terms of implications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.741,
    "end": 4812.627,
    "text": "So I just wanted to do a clap for that one because I thought, glad he brought the wayfinding piece into this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.007,
    "end": 4833.227,
    "text": " cool yeah the 95 is finding the way a critical discussion of anthropological theories of human spatial orientation with reference to reindeer herders of north eastern europe and western siberia 2009 and then the second article is humans use predictive gaze strategies to target waypoints for steering 2019. so it's kind of interesting because um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4834.609,
    "end": 4852.584,
    "text": " And especially having adapted a visual foraging model to a Stigma G pheromone deposition model in the active inference paper, it has drawn out this contrast between two extremes of foraging, both which can have a pragmatic and an epistemic component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4852.604,
    "end": 4856.527,
    "text": "There's like skin in the game, ant body on the ground where you're physically moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4857.148,
    "end": 4872.16,
    "text": " you're hurting and you have to go somewhere to find out how it is there versus visual foraging or visual scanning is sort of like you have the cost of movement, of course, but it's not like where your eye is, is directly paying a cost in most cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4872.7,
    "end": 4883.309,
    "text": "So it's kind of cool to see that the way finding and the sense making comes into play on these two extremes with a niche modifying body on the ground, as well as with a scanning approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4885.097,
    "end": 4896.519,
    "text": " Okay, another quote, won't read the whole thing, but basically we can imagine after hearing all of this that the prediction error is something that you want to minimize for effective business operation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4896.739,
    "end": 4907.302,
    "text": "So a large prediction error could lead to the company dissipating, for example, through its internal resources being scattered into an external state by being taken into the possession of its unpaid suppliers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4907.522,
    "end": 4913.423,
    "text": "So that's a Markov blanket dissolution via court-mediated bankruptcy proceeding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4914.543,
    "end": 4930.997,
    "text": " um alternatively the company could be acquired and merged into one of its large unpaid suppliers that seeks to move up the value chain from tier 1 to oem manufacturer in the case of acquisition and merger the description of markov blankets would need to be changed in legal documents",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4931.946,
    "end": 4954.513,
    "text": " So that just totally set off my Scott David alarm and made me think about the ways that the Markov blankets can be designed, the managing synthetic externalities, seeing law as a niche modification and as a technology in and of itself, but also one that can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.413,
    "end": 4959.215,
    "text": " facilitate other technologies coming into existence or being hindered as we see all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4960.056,
    "end": 4965.799,
    "text": "And then he uses the acronym BOLTS, business, operational, legal, technical, social.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4966.779,
    "end": 4972.983,
    "text": "And then the bigger question is like, how can we see active inference serve in a de-risking or recovery capacity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.988,
    "end": 5001.725,
    "text": " then how can we reframe existing or emerging practices for resilience in terms of active inference so this is like a 1980 style merger and acquisition framed in the markov blanket framework but what does the d5 active inference model look like what does the smart contract active inference model look like these will be like really interesting questions and how they're going to intersect with formal laws as well as the codas law",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5004.295,
    "end": 5005.036,
    "text": " Any comments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5007.218,
    "end": 5007.479,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5008.079,
    "end": 5009.621,
    "text": "And then I think the last point was just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.478,
    "end": 5020.984,
    "text": " In the further directions of the paper, further refinement of active inference constructs is needed to enable wide application to social organization employing human and artificial intelligence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5021.744,
    "end": 5035.572,
    "text": "Apropos, the practical examples in the paper can provide starting points for research into the challenges of ascribing Markov blankets, defining generative models, handling pragmatics, and modeling variational free energy in real-world social organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5036.232,
    "end": 5046.563,
    "text": " And that's an idea that we touched on in our 2020 paper, Active Inference and Behavior Engineering for Teams, which is that in the case of remote teams, then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5047.745,
    "end": 5059.333,
    "text": " the entire structure can be observed through the sensory data that's sent to a user and then the actions that are received, for example, on either side of an interface or either side of a blockchain wallet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5059.873,
    "end": 5068.379,
    "text": "So for remote teams, because they're defined digitally, we have access to the entire state space, so to speak, of sensory and active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.939,
    "end": 5081.903,
    "text": " Whereas for trying to do the active inference model of people in a physical boardroom, that's always gonna be complicated, even if you have a really effective way to get body position out of the cameras in the room, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5082.343,
    "end": 5094.387,
    "text": "So just kind of cool to think about industrial design or engineering, all these different ideas we talked about in terms of online, as well as physical engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5094.407,
    "end": 5095.968,
    "text": "So not just like cars and stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5097.093,
    "end": 5099.874,
    "text": " Those are hardware and software as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5101.495,
    "end": 5103.796,
    "text": "So we kind of just close by saying, what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5105.116,
    "end": 5109.578,
    "text": "People can give their last thoughts, Blue and Dean, just what would a good understanding enable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5110.119,
    "end": 5117.142,
    "text": "What are some good unique predictions or implications or areas that this line of research might be addressing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5117.842,
    "end": 5119.563,
    "text": "What are the next steps for this kind of research?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5120.023,
    "end": 5125.025,
    "text": "The goals of the research, and then also just what you're curious about asking the author tomorrow and in the following week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5129.497,
    "end": 5133.899,
    "text": " Yeah, I think I've laid out some questions today that I hope I don't forget for tomorrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.419,
    "end": 5145.083,
    "text": "But I definitely think that active inference in systems, in organizations and social structures is definitely important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5146.038,
    "end": 5156.927,
    "text": " along with the validation of your model through other models, like through the models of other people and through this confirmation bias, like, oh, my model must be good because you have a model that's like my model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.448,
    "end": 5163.994,
    "text": "So I think that this existence can help to really set boundaries and definitions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5165.001,
    "end": 5170.087,
    "text": " on how we really form social structures, not just businesses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5170.247,
    "end": 5175.252,
    "text": "And I mean, in businesses, there's kind of a hierarchical component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.613,
    "end": 5179.477,
    "text": "But I mean, also like society as a whole, we form these social structures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5180.046,
    "end": 5183.607,
    "text": " structures and how does the social morphogenesis really take place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.667,
    "end": 5197.891,
    "text": "So I think really the author puts out a good, you know, way of kind of delving into social morphogenesis, even through like quality management and industrial engineering, but it's definitely first steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.071,
    "end": 5203.093,
    "text": "Dean, any final comments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5205.173,
    "end": 5207.534,
    "text": "I'm really looking forward to talking to the author because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.319,
    "end": 5209.789,
    "text": " I think at the end of the day, rather than",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.834,
    "end": 5214.755,
    "text": " What's the word here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.115,
    "end": 5234.888,
    "text": "Rather than exploring why these mappings have been put together in this paper, I'm kind of curious now about trying to figure out, so when did these parallels sort of form in his mind and get to a place where he could take a lot of this background information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.928,
    "end": 5238.971,
    "text": "Because he's really cleverly and thoroughly sourced here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.351,
    "end": 5243.554,
    "text": "When did he sort of put these two things together as a reflection of one another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5244.236,
    "end": 5246.224,
    "text": " And where does he see that going forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.662,
    "end": 5248.622,
    "text": " Totally agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5249.143,
    "end": 5260.167,
    "text": "It's a single author paper that reflects a really deep understanding and probably a lot of experience presenting and thinking about this and maybe even applying it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5260.487,
    "end": 5264.549,
    "text": "So those are all super interesting areas to find out about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5264.569,
    "end": 5265.389,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5265.569,
    "end": 5267.27,
    "text": "Well, Blue, Dean, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5267.31,
    "end": 5267.93,
    "text": "That was epic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5268.05,
    "end": 5271.071,
    "text": "Thanks for all the help on the slides and on the stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5271.692,
    "end": 5272.312,
    "text": "So that was great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5272.872,
    "end": 5276.694,
    "text": "We'll talk to everybody in the .1 and .2 or later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5276.914,
    "end": 5277.234,
    "text": "So bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5278.377,
    "end": 5278.73,
    "text": " Thanks, Dan.",
    "speaker": "SPEAKER_01"
  }
]