[
  {
    "start": 11.292,
    "end": 39.486,
    "text": " all right welcome everybody to the active inference lab today it's actinflab live stream number 27.1 on august 24th 2021 welcome to the active inference lab we are a participatory online lab that is communicating learning and practicing applied active inference you can find us at the links here on this slide this is recorded in an archived live stream so please provide us with feedback so that we can improve on our work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 40.495,
    "end": 51.785,
    "text": " All backgrounds and perspectives are welcome here and we'll follow good video etiquette for live streams so people can just raise their hand in Jitsi if they want to speak at any time or write a question in the live chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.234,
    "end": 55.776,
    "text": " This short link has a calendar of upcoming live streams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.437,
    "end": 59.459,
    "text": "And today we're here in 27.1 on the 24th.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.24,
    "end": 64.723,
    "text": "And in August 31st, we'll follow up with another discussion on this same paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 65.044,
    "end": 67.946,
    "text": "And then we haven't yet decided what to read in the upcoming weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 68.086,
    "end": 71.529,
    "text": "So if you want to come on and discuss, that would be cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 73.186,
    "end": 88.56,
    "text": " Today in Actim Stream 27.1, our goal is to learn and discuss this very cool paper, Active Inference, Applicability to Different Types of Social Organization Explained Through Reference to Industrial Engineering and Quality Management by Stephen Fox.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 89.641,
    "end": 98.75,
    "text": "And we're gonna go anywhere we want with a paper or questions, and we're really appreciative to have Stephen here, so that will be a cool discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.151,
    "end": 103.152,
    "text": " Let's start with just introductions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.212,
    "end": 108.334,
    "text": "The non-authors can say what was interesting to them or what kind of brought them to this discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 108.795,
    "end": 113.837,
    "text": "And then it will be awesome to hear some context on the paper that we can take the discussion anywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 114.277,
    "end": 115.077,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.237,
    "end": 118.859,
    "text": "I'm a postdoc in California and I'll pass it to Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 121.067,
    "end": 121.507,
    "text": " Yeah, good morning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 121.527,
    "end": 122.088,
    "text": "My name is Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.968,
    "end": 123.809,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.189,
    "end": 137.837,
    "text": "And the thing I found really interesting is that this was the fastest turnaround time between the point zero, which is a bit of a deconstruction, and now this point one, which is now going to be sort of put back together or reconstructed today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.857,
    "end": 143.121,
    "text": "And I just like the idea that the sort of the feedback loop is really tight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.801,
    "end": 144.582,
    "text": "So I'm really kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.632,
    "end": 152.242,
    "text": " Both curious and happy that the feedback is such a quick turnaround.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.582,
    "end": 154.245,
    "text": "And I'll pass it over to Steven Sillit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.562,
    "end": 157.423,
    "text": " Oh, thank you, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.603,
    "end": 157.943,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.963,
    "end": 160.225,
    "text": "Yeah, I'm just really intrigued.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.305,
    "end": 168.89,
    "text": "I'm very excited to hear more questions about how active inference fits in at the larger social and applied scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.491,
    "end": 175.215,
    "text": "And I know a lot of us here, it's kind of a bit of our thing is how does this get applied in different contexts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.315,
    "end": 176.996,
    "text": "So yeah, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.016,
    "end": 186.863,
    "text": " Awesome agreed about the whiplash dot zero so Stephen welcome, please introduce yourself and then maybe give us some context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.045,
    "end": 197.772,
    "text": "Hello everybody, my name is Stephen fox i'm a principal scientist at the technical research Center of Finland.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 200.212,
    "end": 225.594,
    "text": " and my background is i left school when i was 16 i was an apprentice and did that my craftsman master craftsman manual work for 10 years and then when i was working full-time in industry i got a phd in engineering design and subsequently i've got a doctor of science degree in production engineering",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 227.928,
    "end": 248.193,
    "text": " and i came across um active inference and i thought it looked pretty straightforward and useful but then i started reading some scientific papers about it and it became more and more difficult to understand at least for me",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 249.413,
    "end": 258.922,
    "text": " So I thought the only way to resolve this was if I wrote a paper about it and sent it off to peer review.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.823,
    "end": 269.911,
    "text": "So three iterations and 5,000 words of critique later, it was published in the paper that you've read.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 273.743,
    "end": 274.564,
    "text": " Okay, awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 274.604,
    "end": 277.987,
    "text": "I have a few thoughts on that, and then anyone can raise their hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.607,
    "end": 284.151,
    "text": "So one piece was that getting more difficult to understand active inference as you went along.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 284.452,
    "end": 286.333,
    "text": "What dimension was that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 287.114,
    "end": 288.935,
    "text": "What made you feel that way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.436,
    "end": 291.878,
    "text": "And is that different than other areas that you learned about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 293.439,
    "end": 296.822,
    "text": "Well, the scientific papers about...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 299.52,
    "end": 306.871,
    "text": " on the topic, they are addressing particular audiences, aren't they?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 306.951,
    "end": 310.276,
    "text": "So for example, some papers are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 312.754,
    "end": 323.043,
    "text": " addressing computer scientists who were using established machine learning paradigms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 323.923,
    "end": 326.145,
    "text": "So the paper is directed to them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 326.165,
    "end": 333.291,
    "text": "And I guess the papers are sort of responses to criticisms that come from that audience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 334.993,
    "end": 345.487,
    "text": " So if a reader is not a member of that audience, it's not clear what it's about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 345.727,
    "end": 349.072,
    "text": "So I think the core idea is straightforward enough.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 350.373,
    "end": 362.618,
    "text": " But so it's sort of like the relationship between thermodynamic entropy and information entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 364.299,
    "end": 366.399,
    "text": "So this is beyond the active inference literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 366.98,
    "end": 368.72,
    "text": "The basic idea is simple enough.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 369.0,
    "end": 377.724,
    "text": "But of course, if you read a scientific paper about it, the scientific paper about it is about some particular",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 380.061,
    "end": 384.441,
    "text": " issue there when it's applied in a very particular",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 387.314,
    "end": 388.834,
    "text": " for a very particular purpose.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 389.694,
    "end": 396.497,
    "text": "So I think I understand the relationship between thermodynamic entropy and information entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 397.097,
    "end": 406.941,
    "text": "But if I read any scientific paper about it, I at least can become baffled because it's a very focused issue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 407.361,
    "end": 411.263,
    "text": "And of course, in scientific literature, you need to go beyond the state of the art.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 412.819,
    "end": 414.56,
    "text": " So I think that's the thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 416.142,
    "end": 437.857,
    "text": "I asked a colleague of mine to look into the literature as well, and he was baffled enough to decline my invitation, complete with a funding possibility, to carry on looking into it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 442.11,
    "end": 443.952,
    "text": " Dean, thanks for sharing that, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.992,
    "end": 444.932,
    "text": "So Dean, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 444.972,
    "end": 446.334,
    "text": "And then anyone else with a question?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 447.435,
    "end": 448.836,
    "text": "Yeah, Stephen, I was just curious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.876,
    "end": 455.802,
    "text": "So you're kind of alluding to who's in the room, that, you know, who is the audience thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 455.842,
    "end": 464.949,
    "text": "And I'm curious because you sort of understand yourself as being a bit of a craftsman and a bit of an artisan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.07,
    "end": 468.613,
    "text": "So do you think the paper has...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 470.089,
    "end": 474.352,
    "text": " a ready audience, or do you think your paper can act as an attractor state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.752,
    "end": 476.373,
    "text": "Because we're talking about active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 478.794,
    "end": 481.196,
    "text": "My own paper that you've been reading?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 481.556,
    "end": 482.957,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 483.017,
    "end": 491.762,
    "text": "Well, I think, well, the first thing is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 493.661,
    "end": 494.964,
    "text": " Now it's clear to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 494.984,
    "end": 503.424,
    "text": "And also it turned out, I didn't know until it was published, that the academic editors, Professor Friston,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 505.186,
    "end": 512.952,
    "text": " So at least it's clear to me what it is in what I'm doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 513.873,
    "end": 515.555,
    "text": "And so I can apply it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 515.595,
    "end": 523.121,
    "text": "So for example, I've put it into a proposal that's currently under review and hopefully get some funding.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 524.061,
    "end": 532.028,
    "text": "And then if it's of use to others, then that's good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 533.826,
    "end": 547.727,
    "text": " That would be, and I've had one person who's read it very thoroughly and said it was, he said it was a great help to him and he wished this paper had existed forever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 549.224,
    "end": 556.148,
    "text": " three years ago, because it would have saved him so much trouble of going on the treasure hunt through the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 556.828,
    "end": 560.371,
    "text": "So that gentleman is in the world of business.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 561.931,
    "end": 575.379,
    "text": "So he also had been on this treasure hunt through the literature, finding a sentence here and a sentence there that he could sort of put together and think, well, do I understand this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 575.479,
    "end": 576.62,
    "text": "Don't I understand it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 578.092,
    "end": 580.796,
    "text": " So, yeah, hopefully it's of help to others.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 582.278,
    "end": 582.999,
    "text": "But it's not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 583.44,
    "end": 587.245,
    "text": "I mean, I don't think there's a big, there's not a big audience for this, I don't think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 591.111,
    "end": 591.652,
    "text": "It's a niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 593.379,
    "end": 595.12,
    "text": " it'll always be a niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 596.7,
    "end": 603.743,
    "text": "And it makes me think about how the development of this niche and the community dynamics within it have been different than maybe other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.423,
    "end": 613.247,
    "text": "Like what you said again about getting more difficult or perceiving the implications or the difficulty to be higher than when you initially jumped in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.767,
    "end": 616.628,
    "text": "First off is a meta learning characteristic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 616.668,
    "end": 622.731,
    "text": "You're updating your uncertainty or your scope or the policies that you're gonna have to take as you explore the space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.472,
    "end": 629.306,
    "text": " And then there's something about this field that impels a lot of people to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.345,
    "end": 632.506,
    "text": " learn theory and to explore applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.967,
    "end": 643.853,
    "text": "Whereas, I don't know, other related fields, sometimes, like you said, they're either framed as a technical debate, like people have shown this relationship under this condition, here we show up for this other condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.433,
    "end": 655.78,
    "text": "And then that's a bit too abstracted away from meaning for many people, or it's just in some corner of the literature, or just sort of, it remains at a qualitative level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.34,
    "end": 683.366,
    "text": " sort of okay cool cybernetics like goal orientation and then it can veer off and maybe get disconnected from some of the formalisms and so you mentioned the core of active inference or that now you have a clearer sense of it so what did you initially or what is your more refined sense of what that is now um so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.636,
    "end": 714.222,
    "text": " well illumination came to me when i read a paper i think it's an uncertainty and stress and it says um a professor friston's one of the the authors uh and it says that free energy something like this that free energy is the information that somebody is lacking",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 717.044,
    "end": 745.819,
    "text": " uh to to make their internal model match reality and of course we know then we could be discussing forever and a day about what reality is but i thought that was a so on the treasure hunt that's a sparkling jewel of information because i thought okay so ah so it's an information gap",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 747.467,
    "end": 758.225,
    "text": " What we're talking about is the information gap between the internal generative model and the external state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 762.353,
    "end": 779.029,
    "text": " what the uh and there's variational free energy because of course our internal state keeps changing and the external state of the world keeps changing whether we want it to or not so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 780.82,
    "end": 795.297,
    "text": " as we try to uh and as actions haven't the actions we're going to take we haven't taken them yet so we seek to reduce expected free energy over a series of actions",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 797.218,
    "end": 800.839,
    "text": " And so to me, what does that mean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 800.899,
    "end": 814.143,
    "text": "It means we seek to reduce the information gap between our internal generative model of the world and the world which we are in, that we're in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 818.505,
    "end": 832.684,
    "text": " um so and then active influence as well how do we do that we can the actions we can take we can either we can change what we pay attention to that's an action or we can take action in the world",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 834.486,
    "end": 862.041,
    "text": " to change uh the sensory inputs so that's it so and if um so if uh now this reducing the information gap i'm as you'll have noticed in the paper i'm using this term unwanted surprise so surprisal is the difference between",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 864.708,
    "end": 885.84,
    "text": " what we are predicting and then the sensory input and the world itself so these things can be for example in consumer culture survival may mean selecting the right",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 887.643,
    "end": 908.932,
    "text": " garb and accessories so one can survive in a social group and prosper in there maintain one's social capital so if we're in the if we're in the rich world survival can be at that level but if we're in the uh other parts of the world survival can be",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 911.761,
    "end": 929.459,
    "text": " the difference between literally between energy output and energy input over the course of a week and you literally might not survive if you don't get that right so does that make sense",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 931.55,
    "end": 939.975,
    "text": " very interesting description just to kind of trace out the order that you brought up a few variants of free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 940.015,
    "end": 949.741,
    "text": "And so you framed it as being free energy as the information gap between the internal generative model and then the external states dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.901,
    "end": 951.882,
    "text": "So that makes me think about like trading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 951.982,
    "end": 952.682,
    "text": "Like if you knew",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.891,
    "end": 958.132,
    "text": " what the shape of the stock or the crypto was gonna look like, you could trade perfectly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.672,
    "end": 973.057,
    "text": "And then for other situations, it's also like, if you knew perfectly what was gonna happen, you could act perfectly, you could steer your ship so that given the exact wind distribution, you were always like navigating at the fastest possible rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.877,
    "end": 983.0,
    "text": "But that is kind of an intractable calculation to make due to, for other reasons, the internal and external states changing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 984.232,
    "end": 986.734,
    "text": " and that's leading us to the variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 987.755,
    "end": 1000.006,
    "text": "And then that is a statistical calculation conditioned on action, which leads us to the expected free energy, which is seeking to minimize free energy indirectly through expected free energy directly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.646,
    "end": 1007.973,
    "text": "And then you point out that there was this capacity to change attention and to change sensory states through action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.593,
    "end": 1011.516,
    "text": "So I think that was very succinct, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1013.217,
    "end": 1034.991,
    "text": " run through of a lot of the active inference things dean or steven what did that make you think about well when i oh yeah could i just could i just read could i just read exactly what it says in the paper uncertainty interest it says free energy can be regarded as the information a person is lacking",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1036.764,
    "end": 1063.896,
    "text": " and which he stroke she could use to make his her internal model as close as to reality and the authors of this paper are then these are so there's professor friston but the other authors are been doing research and threat",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1064.588,
    "end": 1067.251,
    "text": " So there's Bruce McEwan and Carl Friston.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1068.292,
    "end": 1071.815,
    "text": "It's called Stress and... Stress and Uncertainty.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1071.835,
    "end": 1072.295,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1072.676,
    "end": 1076.459,
    "text": "Why it causes diseases and how it is mastered by the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1078.041,
    "end": 1081.604,
    "text": "And it's published in Progress in Neurobiology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1081.924,
    "end": 1082.245,
    "text": "Got it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1082.325,
    "end": 1082.625,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.939,
    "end": 1116.538,
    "text": " cool so that was the paper that kind of gave you the insight into the of free energy yes where where's the chat here i can send you the link in the chat um it's on the bottom left or you can email it afterwards and we'll add it to the youtube uh description so cool uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.605,
    "end": 1122.077,
    "text": " Dean, what were you going to say on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1122.779,
    "end": 1125.326,
    "text": "No, I was just going to ask Stephen,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.972,
    "end": 1138.536,
    "text": " So when I was going through the paper, until I got, I don't know, probably 80% in and started seeing the references that you made to the wayfinding aspect in the exploration piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.916,
    "end": 1146.638,
    "text": "Prior to that, there was a lot of attention given over to the precision piece around the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.698,
    "end": 1150.239,
    "text": "And one of the things that I commented in the 270 was,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.686,
    "end": 1159.773,
    "text": " If we're talking about active inference, we're basically talking about two things at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1159.793,
    "end": 1161.916,
    "text": "We're talking about precision and we're also talking",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1162.802,
    "end": 1163.682,
    "text": " about provisioning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1163.722,
    "end": 1180.526,
    "text": "And I think my simple metaphor is, are we talking about a hand that fits into a glove or are we talking about the provisioning piece, which is how many different gloves have we provisioned in terms of the context that the hand might find itself in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.546,
    "end": 1186.127,
    "text": "Cold weather, water, forging a piece of hot iron or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.167,
    "end": 1190.428,
    "text": "And so what I was curious about was in terms of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1192.09,
    "end": 1208.254,
    "text": " social organization and the industrial engineering piece, how the provisioning and the precision coincide with one another in terms of what you are thinking now post-hoc writing this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.315,
    "end": 1216.196,
    "text": "Can I share my screen somehow?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1216.496,
    "end": 1216.716,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1219.107,
    "end": 1221.468,
    "text": " Let me unshare these slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.508,
    "end": 1225.209,
    "text": "So on the bottom left, the middle button, share your screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.769,
    "end": 1228.47,
    "text": "And then I'll make it like full screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.951,
    "end": 1230.871,
    "text": "So you can make it look however you want on your side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.891,
    "end": 1233.372,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1233.692,
    "end": 1233.993,
    "text": "All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1243.459,
    "end": 1244.82,
    "text": " Okay, can you see?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1245.2,
    "end": 1251.104,
    "text": "Yeah, hit hide on Jitsi, where it says hide sharing your screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.805,
    "end": 1254.126,
    "text": "And then yeah, I can make that full screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1254.466,
    "end": 1255.207,
    "text": "So thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1256.468,
    "end": 1257.708,
    "text": "So you see a diagram?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1257.888,
    "end": 1258.529,
    "text": "Yep, figure one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.17,
    "end": 1266.054,
    "text": "Okay, so why there's so much emphasis",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1268.231,
    "end": 1281.39,
    "text": " on what's going on down here in make to stock and assemble to order is because what I was trying to do was get an anchoring",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1283.234,
    "end": 1306.961,
    "text": " And so, okay, in here, in where there's mass production and mass customization, where there's a great deal of refinement of what is offered through many rapid iterations, that then there's something",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1307.701,
    "end": 1332.86,
    "text": " That's fixed that Okay, there are there are a lot of activities like this in the world and the diagram about the quality assurance process So this is in in a way this is as if we think about it of the evolution but the Toyota Corolla is a highly evolved species and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1334.525,
    "end": 1360.682,
    "text": " compared to um if we make uh if we make a vehicle ourselves from scrap so i don't know it's been in the news there but teenage teenager in india has made a tuk-tuk out of scrap solar powered as well so then that's a it's not highly evolved it's the first",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1362.52,
    "end": 1383.925,
    "text": " prototype working prototype and then these things up here this uh the top engineer to order the initial situated entropy is much higher and the barriers to information gain are much higher so as the diagram you're looking at just changed",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1385.925,
    "end": 1386.465,
    "text": " Yeah, OK.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1386.906,
    "end": 1388.006,
    "text": "So this is from another.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1388.046,
    "end": 1392.488,
    "text": "So that diagram I just showed a minute ago, that's from another one of my papers in Entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1392.909,
    "end": 1394.249,
    "text": "And this is from another one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1395.41,
    "end": 1402.553,
    "text": "So what's going on is that if... So with...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1405.069,
    "end": 1413.063,
    "text": " DIY, do it with others, prosumption, mass imagineering.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1413.084,
    "end": 1418.113,
    "text": "It begins with just an idea in our minds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1420.35,
    "end": 1427.296,
    "text": " And we may begin at the level of, I think in the video, Dean, you show a carved piece.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1428.157,
    "end": 1433.622,
    "text": "So it might be you've got a tree stump in your back garden, or you might have a tree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1433.902,
    "end": 1435.383,
    "text": "And start down there, raw materials.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1435.424,
    "end": 1435.784,
    "text": "And you might...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1436.503,
    "end": 1452.248,
    "text": " shape it and then there can be this phenomena that well there's a dialoguing between the human doing the shaping and the piece of wood itself because the piece of wood has got its own properties and you're not going to get a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1454.188,
    "end": 1480.97,
    "text": " and aesthetically pleasing carving if you chisel against the grain right so so the grain that has been shaped through perhaps hundreds of years some of the trees there in california um so there's a dialoguing between the the human doing the shaping and the the piece of wood itself shaping what the human does but then more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1482.371,
    "end": 1498.701,
    "text": " From an industrial point of view, if anything that is bespoke, so the term bespoke is more appropriate in apparel than engineer to order.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1499.321,
    "end": 1506.206,
    "text": "So bespoke is short for bespoken for, and it meant bespoken for by an individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1506.786,
    "end": 1511.008,
    "text": "So the materials that were to be used were bespoken for by an individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1512.563,
    "end": 1524.302,
    "text": " and in today what happens with bespoke is that there'd be cloth so that's a formed material parts buttons",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1526.429,
    "end": 1538.673,
    "text": " And then suppose it's show business or suppose Elton John in his most flamboyant days had an idea in his mind for a new costume.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1540.334,
    "end": 1543.555,
    "text": "It would be a preliminary idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1543.575,
    "end": 1546.056,
    "text": "There'd be iterations of sketching.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1548.136,
    "end": 1567.582,
    "text": " and uh doing some mock-ups maybe and looking at the fabrics and they do it and then maybe we get to quite an advanced stage of the fitting and he'd decide that he'd look at it and think i don't like this actually and completely change his mind and they do something else and then with engineer to order",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1569.659,
    "end": 1573.202,
    "text": " That could be, for example, the late Steve Jobs' yacht.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1574.042,
    "end": 1581.067,
    "text": "So you might have an idea in his mind about what it might be, what it might look like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1581.868,
    "end": 1589.534,
    "text": "And then the shipbuilders, they're going to try and get as far up the bill of materials as they can.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1590.314,
    "end": 1605.319,
    "text": " So they're going to try to use the cabin modules that they've used on other ships, or at the very least, to use the 3D digital models that they've got.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1607.84,
    "end": 1614.263,
    "text": "So what's in the paper, it's really around this picture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1623.78,
    "end": 1651.077,
    "text": " It's down here because then that's the... So to start with something that's quite concrete and highly transferable before then, as I do later in the manuscript, in the paper, getting into the project processes and the wayfinding and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1653.072,
    "end": 1654.173,
    "text": " Does that answer the question?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1655.093,
    "end": 1658.215,
    "text": "Can I just do a quick follow-up, just so it's clear in my mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.977,
    "end": 1674.486,
    "text": "So what I'm seeing here, what you put up on the screen is, and I want to be corrected if I haven't got this right, is I see ways of laying out a fabrication series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1675.447,
    "end": 1682.872,
    "text": "And I guess what I was wondering is more on a philosophical level, as you're transferring from idea to fabrication,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.838,
    "end": 1686.88,
    "text": " How do we use active inference there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.54,
    "end": 1694.746,
    "text": "How do we turn the idea and translate it into this fabrication exercise?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1695.466,
    "end": 1697.808,
    "text": "Is it a planning effort?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.988,
    "end": 1703.553,
    "text": "Is it getting our ideas, plural, provisioned?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.653,
    "end": 1712.319,
    "text": "Is it about propositioning the garment maker before they go on to do the construction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.419,
    "end": 1712.66,
    "text": "Is it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.951,
    "end": 1732.466,
    "text": " You know, what I'm trying to do is get in my head clear what your focus was on, because I can tell now already 40 minutes into our conversation today that there was much more you could have written about, but I'm sure basically what you wanted to do was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1733.226,
    "end": 1742.695,
    "text": " was get one thing clear in terms of this paper, but that, for people like me, that opens up a whole Pandora's box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1742.715,
    "end": 1753.644,
    "text": "So I just wanna be, in my mind, certain that the focus here is about the fabrication piece and not the stuff that comes before the fabrication piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.705,
    "end": 1756.287,
    "text": "Am I leaning in the right direction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1771.479,
    "end": 1773.58,
    "text": " Seems like he silently left, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.8,
    "end": 1776.621,
    "text": "Oh, no, sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1777.241,
    "end": 1778.841,
    "text": "I was on mute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.262,
    "end": 1779.902,
    "text": "Oh, continue then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.922,
    "end": 1782.123,
    "text": "I was on mute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1782.823,
    "end": 1783.723,
    "text": "Powerful answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1784.763,
    "end": 1785.023,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.702,
    "end": 1812.607,
    "text": " yeah so in the in the paper itself um i think i'm using the term it's mass production and project production is it yeah so in so yeah so the the focus on the paper of the paper is on this mass production so just to try to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1815.169,
    "end": 1816.89,
    "text": " What's the word I'm looking for?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1816.99,
    "end": 1818.031,
    "text": "I can't think of anything better.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1818.231,
    "end": 1821.293,
    "text": "But just to sort that out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1821.453,
    "end": 1826.397,
    "text": "Just say, okay, so that's what happens in mass production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1827.297,
    "end": 1831.04,
    "text": "And here are these diagrams and these explanations here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1831.08,
    "end": 1836.223,
    "text": "And there's the statistical process control charts and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1837.004,
    "end": 1838.445,
    "text": "That's what goes on there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1838.805,
    "end": 1839.725,
    "text": "That's settled.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.746,
    "end": 1840.126,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1841.226,
    "end": 1846.669,
    "text": " Now we move on to the project production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1847.689,
    "end": 1857.574,
    "text": "And why I'm focusing on physical production is because then it's tied into action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1858.435,
    "end": 1863.677,
    "text": "There's a clear link between action and energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1865.998,
    "end": 1869.28,
    "text": "And, of course, energy is a finite supply of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1871.136,
    "end": 1898.79,
    "text": " uh for individuals and organizations so the mass production stuff is to provide the the platform to go into more challenging areas am i answering your question dean tangential rambling am i no no no like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1900.189,
    "end": 1903.312,
    "text": " I guess it depends on how much you decide to zoom out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1904.953,
    "end": 1913.881,
    "text": "And so I just want to be clear in my head what the focus is on, because there is absolutely active inference in fabrication and manufacturing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.981,
    "end": 1917.304,
    "text": "I have no quarrel with that whatsoever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.324,
    "end": 1924.911,
    "text": "I just want to be able to make sure that I don't overextend what I think is the active inference potential",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.104,
    "end": 1938.028,
    "text": " Because as I said, when I was reading the paper, where it got exciting for me was that whole exploration beyond the precision and onto the provisioning or provisionings part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.108,
    "end": 1938.908,
    "text": "So thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.928,
    "end": 1940.928,
    "text": "Yes, you cleared that up for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.389,
    "end": 1944.65,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.59,
    "end": 1948.671,
    "text": "How about Stephen with the raised hand and then anyone else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.652,
    "end": 1952.292,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.467,
    "end": 1965.794,
    "text": " I'm looking at this here, and I see some interesting ways that you're engaging free energy in relation to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.914,
    "end": 1971.157,
    "text": "Because often we might see mathematical models and then philosophical arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.397,
    "end": 1983.845,
    "text": "And I sense that this mid-ground, which may be where a lot of the applied work happens at scale, is heuristic-based or principles-based to get a sense of how to navigate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.765,
    "end": 2007.875,
    "text": " um and may not be directly modelable because there's so many dimensions so that's kind of interesting so i wonder you know where where people are talking there about situated entropy or the the the um it's it's a potential um so i'm wondering how you how you think about the heuristic and how you think about um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.95,
    "end": 2016.491,
    "text": " how much someone could model this type of thing or how much it's about modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.591,
    "end": 2024.233,
    "text": "And if so, what type of modeling might be useful in organizational industry context?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.873,
    "end": 2037.856,
    "text": "Um, well, I think at the end of the paper, I, I raised this question, I think about, um, well, there's, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2039.838,
    "end": 2048.024,
    "text": " There's maths, and then there's modeling, and then there's simple rules.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2049.625,
    "end": 2059.873,
    "text": "And so in engineering design, and not just engineering design, simple rules can be extremely powerful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2059.993,
    "end": 2062.135,
    "text": "So design for manufacture and assembly",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2063.735,
    "end": 2071.318,
    "text": " the application of that has led to 90% reductions in the assembly times of many products.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2072.839,
    "end": 2092.527,
    "text": "So you could have just kept modeling the former process as people did for many years with ever more sophisticated mathematical models and simulation tools, but it still wasn't very good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2093.287,
    "end": 2101.555,
    "text": " Or you could just apply some simple rules, reduce assembly time by 90%, and then, well, then it's a lot better, isn't it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2102.376,
    "end": 2108.201,
    "text": "So I sat in one of the meetings that...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2111.175,
    "end": 2129.127,
    "text": " Professor Friston and Maxwell Ramstead, I think, were going through Professor Friston's book, The Monograph, the name of which escapes me now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2129.548,
    "end": 2131.609,
    "text": "A Free Energy Principle for a Particular Physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.722,
    "end": 2153.021,
    "text": " yes so professor friston and thomas parr were in discussion with is it michael bale who's uh he works for a japanese ai firm uh martin biel yes money bill yeah and um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2154.927,
    "end": 2161.693,
    "text": " at least one colleague of Martin's and they were discussing amongst themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2162.914,
    "end": 2172.982,
    "text": "And I don't think as far as I could tell, they weren't able to get an intersubjective understanding between themselves even.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2173.923,
    "end": 2182.03,
    "text": "And Martin's published a paper in entropy where he's contesting some of the maths and, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2184.654,
    "end": 2195.08,
    "text": " So my view is that, of course, things develop and they have to start somewhere, and no doubt that will lead to good things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2195.96,
    "end": 2203.064,
    "text": "But the more people that can understand something, the more likely it is that...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2204.265,
    "end": 2230.687,
    "text": " opportunities for its development and flaws in its current um framing can be identified and progressed so i'm and i've sent in my email this morning this quote from einstein didn't i from from geometry and experience that uh what do you have it there now um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2233.567,
    "end": 2238.528,
    "text": " That quote from Einstein was in my email.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2239.209,
    "end": 2240.549,
    "text": "I can look it up in just one second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2241.009,
    "end": 2245.771,
    "text": "But right now, just on the screen, was the guest stream with Martin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2246.611,
    "end": 2248.511,
    "text": "And so totally agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2248.551,
    "end": 2249.792,
    "text": "Really fascinating there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2251.072,
    "end": 2251.452,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.153,
    "end": 2257.714,
    "text": "So in answer to the question, I say, of course, there's a place for maths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2258.174,
    "end": 2260.115,
    "text": "There's a place for computer simulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2261.116,
    "end": 2274.671,
    "text": " But if so, if we go for so it may be that some are engaged in positivistic research and they're seeking to establish a correspondence truth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2275.992,
    "end": 2284.876,
    "text": " And others, you know, anti-positivists, interpretives, they are engaged in looking for constructivist truth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2286.016,
    "end": 2291.879,
    "text": "And what I'm doing is, I suppose, it's critical, realist, pragmatic truth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2292.639,
    "end": 2294.6,
    "text": "So if it works, it's true.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2295.62,
    "end": 2303.964,
    "text": "So what I'm doing is, well, it's probably a bit rough, but maybe it's good enough to get something done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2307.805,
    "end": 2310.266,
    "text": " Yep, very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.747,
    "end": 2324.693,
    "text": "One question I had was, you talked about that kind of co-evolution with the iterations, whether it's the craftsperson working with a raw material with its imperfections or its characteristics,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2325.773,
    "end": 2333.115,
    "text": " And then all the way up to this more social form, which is like Elton John and the costume designers in that feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.135,
    "end": 2340.278,
    "text": "So whether it's just hands on object like drawing or whether it's more extended to include all these other aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.238,
    "end": 2368.094,
    "text": " how do we hold space for that versioning and uh co-evolving process and for the material to allow it to reveal its characteristics while also having effective supply chains you know that can make cpus and that deliver high precision materials because it just sounded like you had experience on on both sides with the industrial engineering as well as the craft and artisan side",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2371.892,
    "end": 2372.272,
    "text": " Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2372.352,
    "end": 2391.844,
    "text": "So, well, with automated engineering tools, as I'm sure you know, there are these communities of makers and where people are sharing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2391.864,
    "end": 2394.585,
    "text": "Is Instructable still going?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2395.586,
    "end": 2400.129,
    "text": "That online community of giving instructions for projects and things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2400.209,
    "end": 2400.329,
    "text": "So,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2401.343,
    "end": 2418.974,
    "text": " so one one big uh challenge is that it's skill so manual skill so if if work like carving it depends upon our um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2420.967,
    "end": 2429.833,
    "text": " quite a lot of manual skill to get a reasonable looking carving that somebody might be happy with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2430.453,
    "end": 2446.143,
    "text": "But if you're gonna make something, if you're gonna 3D print something, then the manual skill required isn't so high and that can be communicated",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2448.115,
    "end": 2468.958,
    "text": " so some of the uh work that i've been doing is in this a virtual social physical convergence but through virtual technology you can share socially skill knowledge in doing physical work and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2470.729,
    "end": 2481.375,
    "text": " If also, do you know the open ecology movement, where there are engineering designs freely available on the internet?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2482.395,
    "end": 2497.183,
    "text": "So through virtual, social, physical convergence, there's great potential to enabling more people to produce what they consume to become prosumers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2500.979,
    "end": 2506.802,
    "text": " And as Gandhi, I paraphrase Gandhi now, he said, prosperity can't come from mass production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2507.803,
    "end": 2511.125,
    "text": "It can only come from production by the masses.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2514.932,
    "end": 2516.533,
    "text": " Very interesting answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2517.373,
    "end": 2526.257,
    "text": "Reminds me a lot of Bucky Fuller trying to pivot the supply chain from weaponry to livingry, mass producing the aluminum sheets for housing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2526.717,
    "end": 2536.902,
    "text": "But that was kind of only potentially a transient step in this supply chain and production and then eventually knowledge reimagining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.444,
    "end": 2541.765,
    "text": " Will we all have a silicon foundry in our house?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2542.426,
    "end": 2543.446,
    "text": "Probably not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2544.246,
    "end": 2550.469,
    "text": "Could we all have a compost bin or could we all have a sewing kit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2551.149,
    "end": 2559.653,
    "text": "That's something that's a totally different type of artifact, so it can be mapped differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.753,
    "end": 2564.655,
    "text": "Dean, and then anyone else or any questions in live chat?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.51,
    "end": 2584.025,
    "text": " Well, I don't want to go off into the woods here, but I was curious, Stephen, if you've ever read any of this stuff from Matthew Crawford, in particular his shop craft title, and then the other one is The World Beyond Your Head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.045,
    "end": 2586.628,
    "text": "And the reason why I'm asking is because in that book,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.128,
    "end": 2608.038,
    "text": " In that second book, which is one of my favorites, he talks about all of the distractions in the world that caused us to not be able to be focused and precise and do the crafting, never mind being able to do the production at an industrial scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2608.798,
    "end": 2612.46,
    "text": "And so I was just curious if maybe there was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2614.372,
    "end": 2637.544,
    "text": " maybe that author was maybe whispering in your ear when you were putting this together because if you whether you're whether you're carving something out of a piece of wood and having a dialogue with it which I completely agree with or you're just making sure that there's no bugs in the in the command software for the for the making of the copies it's still an ability to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.312,
    "end": 2641.152,
    "text": " be able to use things like active.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2641.192,
    "end": 2646.373,
    "text": "He wrote the Beyond Your Head book in 2014, so I don't think he was looking at active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2646.393,
    "end": 2660.736,
    "text": "But I think that how that is employed can sometimes be perceived as just the right amount of being able to give attention over to something and still remain open to possibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2660.776,
    "end": 2667.557,
    "text": "So I was just wondering if that was something that may have been adding some color to what you were doing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.818,
    "end": 2674.702,
    "text": " No, I have not heard of that before, but I shall look into it with interest.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2675.682,
    "end": 2677.063,
    "text": "Yeah, it's fantastic stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2677.984,
    "end": 2679.205,
    "text": "Yeah, thanks for the comment, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.886,
    "end": 2680.806,
    "text": "Steven, Silet?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.329,
    "end": 2693.716,
    "text": "Yeah, this... I hope this game doesn't go in the weeds either, but I think this is... Like you say, this touches on so many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.617,
    "end": 2696.238,
    "text": "When you talk about the generative model...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.574,
    "end": 2722.054,
    "text": " um and you've got embodied cognition sort of fitting into that um generative models we've often been thinking that it's an action orientated model so it's an act it's a model of how to act okay um and i'm curious how far for instance if you do welding you mentioned welding and stuff like that so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.373,
    "end": 2730.156,
    "text": " With this skilled performance idea, that can be the generative model of how to weld.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.956,
    "end": 2742.241,
    "text": "But at what point, or this sort of maybe ties into something I've been exploring, at what point do you think that the instructions to weld are in the niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.502,
    "end": 2757.127,
    "text": " and being used by someone's generative model, of which they only have a certain sequence available, you know, now welding, it may be that someone just they get a skillful practice and go the whole way, you know, so it's all in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.567,
    "end": 2767.03,
    "text": "But I'm just wondering, once you get to sort of this management level, what point it's a niche artifact as much as it is a generative model internally?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.385,
    "end": 2781.991,
    "text": " Well, I think with craft skills, it's being able to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2782.591,
    "end": 2797.981,
    "text": "It's just at some point or another after I was an apprentice, I think most people who are apprentices have had this feeling that you're struggling and then you wake up one morning and then suddenly you've got a feel for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2798.161,
    "end": 2798.782,
    "text": "You can do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2800.72,
    "end": 2822.727,
    "text": " and um exactly how that is i don't think anybody really knows because somehow it's going into the the fascia system that's the thing the feel for it is embodied in the fascia system and most um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2824.888,
    "end": 2835.892,
    "text": " To my reading as a craftsperson, most literature about embodied cognition is just paying lip service to it being about embodied cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2836.973,
    "end": 2850.639,
    "text": "And it's not really addressing the nature of embodied cognition about how much that depends upon the fascia system and body memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2852.365,
    "end": 2877.499,
    "text": " and uh in this 4e model uh about extended cognition you know put put your memories in your mobile phone type of thing but there's no way that you can put your your manual skill uh embodied cognition muscle memory in a mobile phone you can have many videos of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2878.3,
    "end": 2881.122,
    "text": " people doing manual work from all kinds of different angles.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2882.863,
    "end": 2884.484,
    "text": "So that can be informative.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2885.825,
    "end": 2900.113,
    "text": "But it's not, as you can have many videos of people riding bicycles, that's not the same as having your body memory of how to get on a bike and not fall off while you're pedaling it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2904.376,
    "end": 2906.657,
    "text": "Yeah, Stephen, go for it, and then I have a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.887,
    "end": 2910.169,
    "text": " Yeah, I think this is a good... I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.19,
    "end": 2919.84,
    "text": "I mean, so there's some transition that happens when it goes from presumably some instructional process which has been decoded in a kind of a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.894,
    "end": 2946.082,
    "text": " cognitive way to something more embodied like you're saying it becomes a practice but then there's also i suppose and i don't know but when you start coordinating for instance you've got a whole group of welders working on the side of a oil tanker um so there's there's kind of then it might start to move again there's there's a scale beyond the individual welder you know and at what point does it then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.381,
    "end": 2962.188,
    "text": " get beyond what I've been thinking of as an experiential, ecosystemic kind of knowing to something which has to be coordinated through some artifact, like a plan or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2965.129,
    "end": 2965.39,
    "text": "Cool."
  },
  {
    "start": 2966.51,
    "end": 2967.711,
    "text": "Let's just go to Blue first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2970.012,
    "end": 2972.713,
    "text": "Daniel, go ahead, because your thought is probably my thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.773,
    "end": 2974.114,
    "text": "Oh, no, you should go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.016,
    "end": 2989.75,
    "text": " So I have a question that was kind of related to Steven's question in terms of the niche modification, not as it relates to craftsmanship per se, but to industrial engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.21,
    "end": 2997.077,
    "text": "And in this paper that was the topic of our discussion, you said that, you know, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.978,
    "end": 3003.403,
    "text": " The processes need to be carried out right the first time in like 99% of the cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.823,
    "end": 3004.484,
    "text": "So I remember this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.504,
    "end": 3008.147,
    "text": "And to what extent is that first time right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.207,
    "end": 3013.712,
    "text": "I mean, I just remember as a business owner, there's a lot of SOP development process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.273,
    "end": 3028.887,
    "text": " So you develop SOPs and KPIs so that everybody knows exactly what their job is, exactly what they're supposed to do, and exactly the procedure for executing the job so that theoretically anyone can come in and be subsumed under the Markov blanket",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.488,
    "end": 3036.993,
    "text": " for the business and the niche has been modified maybe in such a way to make that happen correctly 99% of the time in the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.654,
    "end": 3044.919,
    "text": "So do you think that that process development in the industrial engineering application is niche modification or perhaps something else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.183,
    "end": 3055.847,
    "text": "Yeah, so this, the 99 times out of 100, so that's Six Sigma.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.508,
    "end": 3059.91,
    "text": " which is under the umbrella of total quality management.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3060.931,
    "end": 3070.497,
    "text": "And that is where... So if you've made... So this is all... By the way, are you still seeing my screen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3070.517,
    "end": 3071.898,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3072.838,
    "end": 3073.859,
    "text": "Maybe could you reshare it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.16,
    "end": 3075.82,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3075.9,
    "end": 3076.2,
    "text": "Hang on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3076.24,
    "end": 3079.782,
    "text": "So let me just... If I go back to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3089.479,
    "end": 3110.756,
    "text": " so if i go yep back to that point i was making about some embodied cognition so yep looks good this this can you see that segment of predictive processing yep okay so what i'm doing in this paper is i'm uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3114.321,
    "end": 3136.182,
    "text": " refer i'm making reference to the fascia system and body memory um and relating it to this you know well predictive global neural workspace um so that's um as far as i've got with that now this 99",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3140.41,
    "end": 3141.951,
    "text": " Now, can you see the treadmill?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3142.271,
    "end": 3142.991,
    "text": "Yep.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3143.512,
    "end": 3147.193,
    "text": "Okay, there it is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3147.614,
    "end": 3156.338,
    "text": "This 99.9% at the time, right this time, this has come with the treadmill of production and consumption.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3157.198,
    "end": 3166.523,
    "text": "So if an organization invests a billion dollars in building a factory and in the tooling, then",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3168.613,
    "end": 3173.697,
    "text": " It's got to mass produce and it's got to get people to buy what it's selling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3175.358,
    "end": 3179.621,
    "text": "And there can't be disgruntled customers because now there's global competition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3182.763,
    "end": 3190.568,
    "text": "And that 99%, it can be measured to microns with car body panels and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3193.26,
    "end": 3214.639,
    "text": " But if you're in the leather cluster in Italy, and you're making leather bags, as has been going on for hundreds of years, then the precision is not so desirable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3215.64,
    "end": 3220.044,
    "text": "It's good if every one of the leather bags that is made",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3221.437,
    "end": 3229.964,
    "text": " is a little bit different to each other because that signals that it's handmade.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3229.984,
    "end": 3233.047,
    "text": "So the 99% that write first time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3237.643,
    "end": 3254.113,
    "text": " is all wrapped up in this um treadmill of production and consumption with varying levels of precision depending on what the niche is so if the niche is you're a global car maker",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3255.414,
    "end": 3268.503,
    "text": " Well, the door better close with the obligatory clunk, and it better be a watertight, airtight fit when you're driving at maximum speed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3269.104,
    "end": 3271.405,
    "text": "Otherwise, customers will be lost.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3272.986,
    "end": 3284.274,
    "text": "So in different niches, the level of vision that's required depends upon what customers are expecting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3286.658,
    "end": 3288.764,
    "text": " and what the competition will tolerate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3288.784,
    "end": 3294.36,
    "text": "Does that answer the question at all?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3296.121,
    "end": 3298.043,
    "text": " Thanks for the interesting answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.063,
    "end": 3300.465,
    "text": "I'll give a thought and then we'll go to Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3300.525,
    "end": 3304.309,
    "text": "So first, it's almost like, what about a semantic precision?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.709,
    "end": 3315.499,
    "text": "Like a writer who is outputting precision in terms of at multiple levels, like a typographical precision and also like they don't just want to release their hand hitting the keyboard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.559,
    "end": 3317.941,
    "text": "That's not what their writing product is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.462,
    "end": 3321.705,
    "text": "So it's not just the mechanical precision that we can talk about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.405,
    "end": 3329.49,
    "text": " And then that idea of waking up to skill and the way you connected it to embodiment is really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.53,
    "end": 3336.574,
    "text": "Maybe people wouldn't expect that from an industrial designer, but then when we think about craft and the continuum, it makes more sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.214,
    "end": 3344.298,
    "text": "And then also that waking up aspect of it, it's like during sleep when we're simplifying and pruning neural connections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3345.299,
    "end": 3355.503,
    "text": " the more neural applications of free energy principle and active inference could help us see that as like a process of model simplification and unlearning the details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3356.123,
    "end": 3360.164,
    "text": "And that is sort of where skill and mastery comes in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3360.244,
    "end": 3369.368,
    "text": "And that could be cognitive unlearnings and bodily updatings in terms of the morphogenesis of the tendons or the sensory receptors or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3370.348,
    "end": 3385.334,
    "text": " all kinds of other changes and so it's just cool that we can like really telescope in on just wanting to apply it to as you did in the paper really partitioning out the biological systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3386.636,
    "end": 3405.243,
    "text": " partitioning out the flesh and bone, but we know we can go there, but there's so much that you can say about just the engineering side that it was just like, it makes it very interpretable, yet also clearly comprehensive, which is what you pointed out was kind of lacking in the literature when you were learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.904,
    "end": 3408.205,
    "text": "So Scott, go for the question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.225,
    "end": 3410.005,
    "text": "I don't know if you watched the .zero, but we...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3412.126,
    "end": 3416.389,
    "text": " We had a Scott David alert with the Markov blankets of contracts and law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3418.03,
    "end": 3419.251,
    "text": "But yeah, anyways, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3419.271,
    "end": 3420.552,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3420.652,
    "end": 3421.433,
    "text": "Sorry I was delayed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3421.473,
    "end": 3422.253,
    "text": "I was on another call.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3422.714,
    "end": 3424.635,
    "text": "A couple of things that... Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3424.735,
    "end": 3429.398,
    "text": "A couple of interesting comments that sparked some questions I had.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3429.859,
    "end": 3439.245,
    "text": "So talking about the fascia and your statement about the mobile phone can't record the fascia, and obviously that's true, but it sparked three things in me I wanted to get your thoughts on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3439.765,
    "end": 3440.026,
    "text": "One is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3440.965,
    "end": 3461.556,
    "text": " what in the notion of the fascia and the embodiment is it possible to use active inference framings or is it fruitful in the opposition of various fascia elements so when you're learning diving or frisbee playing one muscle's pushing against a bone or whatever and so the fascia has multiple components as well",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3462.236,
    "end": 3472.44,
    "text": " And so are there learnings that happen among fascia elements themselves because they're building actin, myosin, you know, bulk or whatever?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3472.46,
    "end": 3474.661,
    "text": "I guess those are the proteins, but in any event, they're building bulk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3474.941,
    "end": 3478.642,
    "text": "That's one is the opposition among fascia elements.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3479.023,
    "end": 3482.364,
    "text": "The other one is it reminded me a little bit on the mobile phone thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3482.924,
    "end": 3485.085,
    "text": "Sandy Pentland at MIT talks about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3485.56,
    "end": 3496.907,
    "text": " I think he did some work on predicting if people are going to get Alzheimer's by they have their mobile phone in their pocket and they start walking around their apartment differently and the mobile phone is able to track that there's a difference, an anomaly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3497.508,
    "end": 3507.854,
    "text": "And so I thought that was kind of interesting that although the mobile phone can't track your craft, but it can note anomalies based on picking up fascia histories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3508.395,
    "end": 3515.079,
    "text": "And then the third thing, it made me think a little bit about robotic prosthesis and haptic sensors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3515.649,
    "end": 3519.171,
    "text": " And so there, again, you have this feedback mechanisms that are bounded.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3519.631,
    "end": 3545.363,
    "text": "Obviously, again, they're not storing craft, but it seems like, I just wondered if any of those sparked any thoughts that relative that question of the, I guess, not just the mobile phone, but that sensory apparatus and the information networks being responsive with elements of fascia in different direct and indirect ways, and maybe an active inference framing, a hybrid between the technology embodying a certain",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3546.03,
    "end": 3555.213,
    "text": " expectation, let's say, and the fascia embodying a certain expectation, and that kind of harmonic coupling, if that had any thoughts on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3555.373,
    "end": 3555.674,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3559.735,
    "end": 3569.298,
    "text": "I think one thing that I'd consider in all these things is what's the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3571.67,
    "end": 3591.85,
    "text": " going to mention the r word now reward uh what's the uh what would be the effort to reward ratio of doing that so if if um like you said about learning to dive so i'd say that maybe there'd be some uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3593.183,
    "end": 3608.744,
    "text": " rules um sort of like design rules for learning to dive that maybe could be formulated that might be useful for people to learning to dive but then going into",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3611.477,
    "end": 3640.549,
    "text": " very sophisticated modeling when individuals are so different that might require a huge amount of effort and the reward may be less so I don't think you're alone when I was saying before Scott that that in industrial engineering so up until 1980 people use the mathematical models and the simulation tools available to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3642.861,
    "end": 3671.258,
    "text": " to model industrial processes but then design for manufacturing assembly was introduced and assembly times in many products was reduced by 90 with simple rules and so all the amount of there's there's a place for modeling but um what i'm more interested in for is focusing on um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3676.215,
    "end": 3693.596,
    "text": " Are there simple rules, are there simple methodologies, tables and diagrams that can provide insights as designed for manufacturing assembly that can lead to very substantial improvements?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3695.176,
    "end": 3699.118,
    "text": " So that's what I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3699.438,
    "end": 3705.941,
    "text": "But then like this gate tracking you were talking about, about people, are they getting out?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3707.601,
    "end": 3714.584,
    "text": "One thing that I think is very attractive about active inference is it can provide a starting point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3716.229,
    "end": 3723.531,
    "text": " where humans and artificial intelligence can be starting from the same place.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3724.411,
    "end": 3732.494,
    "text": "That, okay, what's going on here is we're trying to reduce this information gap",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3733.735,
    "end": 3756.497,
    "text": " between the internal generative model of the human being and the external state of the world that they're moving around in and both the human being trying to do that under and the artificial intelligence is trying to do that and how is that done it's done through active inference",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3757.417,
    "end": 3768.742,
    "text": " where we learn from either changing what we pay attention to and or changing the action we take.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3769.722,
    "end": 3779.967,
    "text": "So then there can be a common starting point and maybe this can make the human being feel much more comfortable around the artificial intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3781.607,
    "end": 3794.233,
    "text": " So I'm working on a project at the moment that's this third wave of AI where there's some top-down rules and bottom-up sensory inputs combining.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3795.794,
    "end": 3807.619,
    "text": "And I see active inference as being well worth exploring as a starting point for human-AI interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3809.321,
    "end": 3814.306,
    "text": " where both the human and the AI have got this generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3815.668,
    "end": 3816.429,
    "text": "That's the human.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3817.39,
    "end": 3820.132,
    "text": "It's understandable to the human.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3823.796,
    "end": 3825.158,
    "text": "Awesome points about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3826.786,
    "end": 3828.706,
    "text": " where active inference could come into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3828.726,
    "end": 3849.232,
    "text": "And also almost from a designer's perspective, if they have a systems diagram or a digital twin of some type that includes active inference agents interacting, first, because they're all of a similar type of model, there'll be increased interoperability and ease of computing these kinds of systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3849.992,
    "end": 3850.212,
    "text": "And then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3851.172,
    "end": 3875.341,
    "text": " the system designer or perturber can simulating with counterfactuals or with any other technique can uh formalize what affordances they do and don't have so it's like if someone says the only way i'm going to get this marketing um you know to succeed is if i update their generative model so that they think that you know this isn't a ponzi scheme it's like if that can be formalized then we could have benevolent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3876.101,
    "end": 3891.547,
    "text": " Shapings of the niche and kinds of interjections like we're gonna inject this much money with this much of an equation Because we're doing KL optimal control on this parameter Conditioned on these other parameters, you know, how do people feel about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3892.067,
    "end": 3902.131,
    "text": "versus We're gonna do an ad hoc strategy based upon conversations that you weren't part of so and then that just while you were saying about the generalized principles",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3903.402,
    "end": 3918.893,
    "text": " Again, really interesting because there was a lot of detail in the paper and a lot of really insightful comments, but it wasn't the same formalism-driven approach that we've seen in some other works directly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.013,
    "end": 3921.995,
    "text": "Of course, cited a lot of the primary literature there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3922.696,
    "end": 3926.278,
    "text": "So just cool how you pulled back to the level of the generalized principles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3927.29,
    "end": 3949.049,
    "text": " and then we can dip down into more special mathematical framings but this last part of table one which were also all sections of the paper were like essential kind of principles that at least you and the reviewers agreed were important enough to define clearly",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3954.642,
    "end": 3956.483,
    "text": " Yeah, I found that quote now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3956.703,
    "end": 3968.171,
    "text": "So this is from Albert Einstein, Geometry and Experience, addressed to the Prussian Academy of Sciences in Berlin, 27th of January, 1921.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3970.232,
    "end": 3974.895,
    "text": "As far as the law of mathematics refer to reality, they are not certain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3975.876,
    "end": 3979.658,
    "text": "And as far as they are certain, they do not refer to reality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3985.279,
    "end": 3985.559,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3985.82,
    "end": 3990.083,
    "text": "That reminds me also the way that you, again, describe free energy as that information gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3991.004,
    "end": 3997.909,
    "text": "It's almost like we can have a description or an estimation of a gap, a negative space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3998.65,
    "end": 4001.432,
    "text": "And so it's like, well, what's in the gap?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4001.472,
    "end": 4005.255,
    "text": "It's like, well, if I knew or if we had any more precision, then we'd tell you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4005.695,
    "end": 4010.059,
    "text": "But all we know is how large the deviation is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4011.56,
    "end": 4013.542,
    "text": "So it's sort of like a way of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4015.411,
    "end": 4029.055,
    "text": " One way around it is using a positive definition of something that's lacking, and then that's closely related to this idea of tractable minimization that is better suited to be calculated than an intractable maximization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4030.935,
    "end": 4042.778,
    "text": "Like maximization of reward or expected utility, which is a totally different set of constraints and outcomes than a variational free energy gradient descent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4046.42,
    "end": 4048.321,
    "text": " So Scott, and then anyone else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4050.221,
    "end": 4061.005,
    "text": "I wanted to, that got me thinking of the, just the, uh, I guess the, um, library of opportunities for a system, or I'm not sure how to characterize it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4061.386,
    "end": 4073.43,
    "text": "But, um, one of the things I've been fussing with is the Chris Christopher Alexander, um, for folks who haven't, um, been in that space with, I just learned that a few months ago about him, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4074.284,
    "end": 4085.91,
    "text": " He's an architect who collected the idea that he had had was the collect up in architecture and is collecting up different practices in architecture and different patterns.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4086.611,
    "end": 4088.052,
    "text": "And he came up with a pattern language.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4088.132,
    "end": 4097.577,
    "text": "The idea was if you want to create a portico and a place to negotiate private and public space, for instance, he had certain patterns that happened in different kinds of architecture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4098.117,
    "end": 4103.941,
    "text": " And so if you wanted to do architecture, you could look at a bunch of patterns and stare at them for a while and see which one looked best.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4104.661,
    "end": 4115.309,
    "text": "And it's interesting with these questions of filling gaps, the easiest place to look is what other similarly situated parties have done in similar situations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4115.469,
    "end": 4118.791,
    "text": "So if you have that crosstalk, the peer-to-peer conversation,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4119.98,
    "end": 4126.13,
    "text": " than you can discover without having to go through all the pain and the cost of discovering yourself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4126.19,
    "end": 4128.054,
    "text": "And that's the notion of guilds, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4128.074,
    "end": 4130.037,
    "text": "I heard reference earlier to apprenticeship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4130.675,
    "end": 4135.579,
    "text": " Learned by the masters, not just reinventing the wheel kind of idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4136.259,
    "end": 4150.689,
    "text": "And it's interesting when we talk about gap filling, because in more static systems, culturally static systems, let's say, historically quiescent periods, then you can learn a lot from the guilds.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4151.65,
    "end": 4155.773,
    "text": "But in periods of high dynamic change, environmental change,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4156.522,
    "end": 4163.369,
    "text": " the guilds are going to maybe underserve you because there may be so much change that the old practices just don't hold up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4163.529,
    "end": 4166.031,
    "text": "The externalities are such that they swamp things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4167.072,
    "end": 4176.962,
    "text": "And so I wonder in that gap, if there's an element of discovery, both of the available, what are the ways to discover what's available and,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4178.763,
    "end": 4184.451,
    "text": " And then discover the things that are not available, A, because they're in a different silo, so they haven't been available.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4184.971,
    "end": 4189.177,
    "text": "But maybe because they haven't yet been tried in any silo, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4189.197,
    "end": 4192.141,
    "text": "So they're just not emerging type of notions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4192.501,
    "end": 4193.943,
    "text": "Maybe that's a bad question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4193.963,
    "end": 4194.243,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4194.263,
    "end": 4195.765,
    "text": "It just, it felt like that gap.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4196.581,
    "end": 4199.863,
    "text": " There's easy, low-hanging fruit of practices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4199.923,
    "end": 4202.244,
    "text": "Chris Alexander kind of stuff is relatively low-hanging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4202.664,
    "end": 4209.848,
    "text": "And then it seems like there's other mechanisms here of discovery, and maybe that's randomness, and maybe that has to do with evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4210.369,
    "end": 4213.751,
    "text": "But anyway, if that's commentable, I'd like some comments on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4213.771,
    "end": 4214.871,
    "text": "Yeah, awesome question, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4217.333,
    "end": 4219.594,
    "text": "Are you still seeing my screen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4219.854,
    "end": 4220.835,
    "text": "Yes, I'll make it big.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4222.556,
    "end": 4223.016,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4223.416,
    "end": 4224.677,
    "text": "Okay, so now...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4228.891,
    "end": 4255.898,
    "text": " leapfrog skills leapfrog skills yes there it is so um the thing is about manual skills as scott was just saying the guilds and everything so in the work that i do development projects that point out that industrial thinking is 300 years old it came from the english midlands 300 years ago and uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4259.784,
    "end": 4268.588,
    "text": " And taking that as the basis of doing development work may not be a good idea because it's 300 years old and the world's changed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4269.328,
    "end": 4271.97,
    "text": "And so it is with skills that...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4276.342,
    "end": 4278.925,
    "text": " It's good to be able to carve wooden pieces.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4279.025,
    "end": 4280.868,
    "text": "It can be very rewarding.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4282.109,
    "end": 4285.073,
    "text": "And maybe it can bring a few people some economic benefits.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4285.654,
    "end": 4289.619,
    "text": "But that can't address the poverty of billions of people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4290.68,
    "end": 4302.406,
    "text": " And craft guilds, as I say to people, well, when they say ministers, when they say, well, we need to build training centers and give people apprenticeships.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4302.466,
    "end": 4305.447,
    "text": "And I point out, well, that's medieval thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4306.327,
    "end": 4309.149,
    "text": "So that isn't good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4309.209,
    "end": 4310.209,
    "text": "That's not very good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4311.21,
    "end": 4315.091,
    "text": "So here there's explanation of leapfrog skills.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4315.171,
    "end": 4318.373,
    "text": "I take you down to some diagrams here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4327.196,
    "end": 4327.857,
    "text": " Whoops.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4329.358,
    "end": 4332.461,
    "text": "Just a simple example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4333.822,
    "end": 4334.383,
    "text": "Bear with me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4337.045,
    "end": 4341.97,
    "text": "This is taking longer than I thought it would.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4342.19,
    "end": 4349.877,
    "text": "What was your active inference stage or awareness at this time in 2016 or when you were writing it leading up to here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4351.588,
    "end": 4364.595,
    "text": " zero well no but the thing is it looks it depends how you look at it doesn't it because i so if you're doing manual work then you're doing active inference because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4366.871,
    "end": 4368.993,
    "text": " What are we doing?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4369.634,
    "end": 4370.935,
    "text": "So information gap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4371.035,
    "end": 4371.876,
    "text": "How am I going to do this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4372.877,
    "end": 4373.818,
    "text": "Because I need to do this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4373.838,
    "end": 4375.58,
    "text": "Because if I don't do this, I'm not going to get paid.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4376.641,
    "end": 4379.143,
    "text": "If I don't get paid, I can't buy food.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4379.523,
    "end": 4380.404,
    "text": "I can't pay the rent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4380.845,
    "end": 4381.966,
    "text": "So how am I going to do that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4382.006,
    "end": 4383.127,
    "text": "That's the information gap.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4383.927,
    "end": 4389.392,
    "text": " And then, so I'm going to pay attention to my priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4390.093,
    "end": 4391.274,
    "text": "What have I done before?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4392.395,
    "end": 4405.066,
    "text": "I'm going to pay attention to the sensory inputs from the external state and notice that, oh, not all the materials I need are here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4405.947,
    "end": 4408.108,
    "text": "So I need to improvise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4409.009,
    "end": 4433.725,
    "text": " adaptive expertise i need to not apply what i've done before where it's not going to help and i'm going to have to think of a bit of something to do it and uh so in my opinion active inference is certainly what's going on in manual work and then you you give it a try it doesn't uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4434.585,
    "end": 4454.658,
    "text": " all right it works to some extent or not another extent so then look back in the generative model hang on what I don't like done something like this before look around oh look I see in the distance there's some bit of kit I can use over there I'll use that and so on but to go back to this craft",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4456.966,
    "end": 4480.541,
    "text": " thing but can you see that figure five that yep the kind of stuff you put around the door so doing these joints that difficult to form and to fix and very often if you stare at such joints closely you you'll see they'll have been filled up with glue and dust or a bit of uh more paint being stuck in there",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4481.941,
    "end": 4490.604,
    "text": " But then if you do this instead, it actually looks better and it doesn't, no need for the craft guild.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4491.224,
    "end": 4492.124,
    "text": "It's just a kit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4493.384,
    "end": 4495.685,
    "text": "It's just these molds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4495.825,
    "end": 4496.625,
    "text": "It's just a kit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4497.385,
    "end": 4507.008,
    "text": "So you've got the, and these blocks here in the corner, it makes it look more fancy and you can just assemble it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4509.059,
    "end": 4512.16,
    "text": " So I go back to this one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4517.121,
    "end": 4518.442,
    "text": "OK, so.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4523.443,
    "end": 4526.244,
    "text": "Do you see now a diagram that says movable factories?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4526.464,
    "end": 4526.644,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4527.845,
    "end": 4532.626,
    "text": "OK, so movable factories on the job training product kits in the middle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4535.007,
    "end": 4538.728,
    "text": "Engineering design of capable processes for mistake proof production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4540.871,
    "end": 4552.114,
    "text": " So this is, as we know, Ikea spread around the world, much more successful than any furniture company.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4553.234,
    "end": 4558.716,
    "text": "It's competitors because they do engineering design of capable processes for mistake-proof production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4559.656,
    "end": 4565.978,
    "text": "And this can be applied to many things, water towers, solar arrays.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4568.562,
    "end": 4593.053,
    "text": " anything really so this in uh what's going on about the craft guilds that yes craft guilds although i'm a master craftsman myself it's medieval thinking and it's um it's just not scalable and it's very very wasteful hugely wasteful",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4593.673,
    "end": 4599.376,
    "text": " And really, craft skills are good for coping with chaos.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4600.616,
    "end": 4607.299,
    "text": "But chaos is hugely wasteful, awash with entropy that can't be resolved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4608.44,
    "end": 4619.504,
    "text": "So when I'm doing development projects, this is what I'm advocating, what's in that diagram.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4619.765,
    "end": 4623.006,
    "text": "Dean, with a raised hand, and then anyone else who raises their hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4625.509,
    "end": 4628.051,
    "text": " I'm just throwing down a couple of things here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.091,
    "end": 4630.072,
    "text": "So this kind of fits in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4631.553,
    "end": 4637.536,
    "text": "This is a nice fit into the glove of what Scott was asking and then what I saw in terms of the title of that paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4638.197,
    "end": 4639.398,
    "text": "So my question is this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4639.478,
    "end": 4654.027,
    "text": "If we, using the same kind of triangular shape as the five whys, if we start at the top with learning and that learning then breaking down into one aspect of which is updating,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4654.795,
    "end": 4666.6,
    "text": " And then that breaking down into one act of which is gap respecting that then breaking down into assessing what the step function is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4666.62,
    "end": 4674.183,
    "text": "And then that breaking down finally into some sort of action taken, which is the filling to follow or the gap closing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4675.604,
    "end": 4679.906,
    "text": "Is that medieval thinking or is that an invention gradient descent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4682.065,
    "end": 4711.046,
    "text": " I know that's a lot of stuff, but if you want to take the best of what happened 300 years ago and not get locked into starting with I'm going to close a gap because I perceive a gap present, is there a way that we can take the best of the past, meld it with the current, and come up with an inventive gradient descent which doesn't sort of hold us to either the craft or the mass production?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4714.392,
    "end": 4715.333,
    "text": " I believe we can.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4716.674,
    "end": 4716.934,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4717.674,
    "end": 4718.535,
    "text": "We'll be good friends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.356,
    "end": 4720.776,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4722.197,
    "end": 4730.023,
    "text": "And in in that paper, let's see if we can get to this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4735.847,
    "end": 4737.568,
    "text": "There's yet uncertainty and stress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4738.809,
    "end": 4740.05,
    "text": "Nice questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4747.355,
    "end": 4760.667,
    "text": " what you said about the scalability of the mentorship and the guild model versus alternative models was really interesting because there's the sort of academia versus non-academia divide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4760.988,
    "end": 4768.454,
    "text": "So with that sort of student through PhD and that traditional mentorship system and how that's evolving, then there's the traditional craft",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4769.435,
    "end": 4793.886,
    "text": " um trajectory the apprentice and the master and the way that that is also changing and the way that academia and research are reconnecting so there's just so many cool threads about how everybody will find guidance yeah so are you are you seeing my screen yep mass imagineering mass customization mass production yep",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4795.146,
    "end": 4806.653,
    "text": " So I'm looking at, in this one, I'm looking at it from the point of view of consumer culture and saying how these complement each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4807.554,
    "end": 4815.379,
    "text": "So it's in there, Dean, about how these can all be complementing each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4817.78,
    "end": 4819.161,
    "text": "I'm definitely going to have a read of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4821.118,
    "end": 4824.981,
    "text": " Remember to maintain firm downward pressure on the soles of your feet while you do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4828.003,
    "end": 4830.345,
    "text": "And pump to the tempo of staying alive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4830.365,
    "end": 4835.609,
    "text": "You've got to keep your feet on the ground, otherwise it'll blow your socks off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4837.711,
    "end": 4838.011,
    "text": "Scott?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4840.908,
    "end": 4852.195,
    "text": " Yeah, I want to get back to, that was, you struck me with that statement before, the craft skills are very wasteful, and they're useful with chaotic situations, but chaos is really wasteful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4852.795,
    "end": 4868.224,
    "text": "That's really, that struck me, and I wanted to ask you, I thought, well, that's interesting, because inefficiency is resilient, and the distributed, make me think about distributed agriculture, distributed manufacturing, a lot of the resiliency",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4869.008,
    "end": 4870.589,
    "text": " discussions that are going on now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4870.629,
    "end": 4875.131,
    "text": "I work with a group called All Fed that's trying to figure out how to feed everyone in the world and things like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4875.171,
    "end": 4883.155,
    "text": "And then also the notions of monoculture and the production of cheap industrial calories, but then there's no variety.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4884.035,
    "end": 4896.581,
    "text": "And again, getting back to this, the notion in active inference, I keep coming back to Carnot's characterization in the second law of thermodynamics that you need hot and cold differentials to perform work with a heat engine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4897.463,
    "end": 4903.566,
    "text": " And I feel like you need the differentials and information to have active inference Bayesian occurrence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4904.386,
    "end": 4918.492,
    "text": "So that inefficiency feels like it's laden with value because of the differentials that are in there, the chaos and the, it feels like there's lots of value to be derived from chaos and inefficiency.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4919.389,
    "end": 4929.385,
    "text": " And maybe that's part of what was, well, I guess it was being done in the industrial revolution notions is you took craft skills and reduce the inefficiencies and drive value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4930.166,
    "end": 4933.552,
    "text": "And it feels like as we have more chaos in the information sphere,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4935.094,
    "end": 4946.679,
    "text": " are we, how might we release those, that value, but still recognizing that maybe it's a, there's a font of inefficiency that keeps coming at us because interaction volumes are going up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4947.099,
    "end": 4952.101,
    "text": "So we don't have to worry about an exhaustible supply of inefficiency that awaits us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4952.681,
    "end": 4960.765,
    "text": "But if we mine the inefficiency and bring it into the system where it's known, then it seems like it creates value.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4960.805,
    "end": 4962.606,
    "text": "I wonder, is any of that commentable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4962.626,
    "end": 4963.406,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4964.033,
    "end": 4966.516,
    "text": " I hope that made some sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4967.737,
    "end": 4969.038,
    "text": "Yes, yeah, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4970.38,
    "end": 4976.806,
    "text": "But before I go on to that, also, Dean, there's this paper, Domesticating Artificial Intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4978.868,
    "end": 4979.769,
    "text": "Is that on the screen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4979.97,
    "end": 4980.13,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4981.244,
    "end": 4994.757,
    "text": " okay so expanding human self-expression through applications of artificial intelligence in prosumption so that's another um another one about this combining different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4996.229,
    "end": 5012.049,
    "text": " different uh paradigms of production and presumption and consumption okay so yes so what i was saying about um inefficiency so perhaps i should",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5015.217,
    "end": 5030.07,
    "text": " explain better what i mean that redundant variation so redundant variation doesn't add it consumes energy and it doesn't add any value so that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5031.59,
    "end": 5055.758,
    "text": " that is the the thing that with this leapfrog skills i'm pointing that out that well it serves no useful purpose to have redundant variation variation can add value but not not redundant variation so that's what i mean and also it depends on what people's circumstances are so if people are um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5057.959,
    "end": 5081.034,
    "text": " uh living on the edge as many people are then there's just no they don't have any spare energy and redundant variation can uh well we know do you know this term the precariat that people in in the west that uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5081.934,
    "end": 5089.8,
    "text": " that people don't, they have zero-hours contracts and things like that, and they're in the precariat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5090.24,
    "end": 5094.103,
    "text": "But the real precariat in the world are the people who are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5095.709,
    "end": 5104.734,
    "text": " living on the edge in developing countries because their staying alive is literally precarious.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5105.835,
    "end": 5112.258,
    "text": "Getting water is difficult, and when they get water, it's dirty.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5112.838,
    "end": 5113.739,
    "text": "So they've got a choice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5114.139,
    "end": 5122.744,
    "text": "They can drink it to keep living, but if they drink it, they're going to get ill, and maybe the illness is going to kill them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5123.904,
    "end": 5129.529,
    "text": " So there are different scenarios.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5129.629,
    "end": 5135.073,
    "text": "And in development work, it's redundant variation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5135.173,
    "end": 5139.496,
    "text": "It's just trapping can keep people trapped in desperate poverty.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5142.278,
    "end": 5149.504,
    "text": "Could you just comment a little bit, as a follow-up, expand on that redundant variation, what that looks like in some examples?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5150.245,
    "end": 5153.147,
    "text": "And also just wanted to mention, in one of the groups I'm working with, AllFit,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5153.786,
    "end": 5173.56,
    "text": " we're thinking of developing a how many days to starvation app for people, and like the countdown clock in the Bulletin of Atomic Scientists, but how many days a person has in their food availability, including what's in their refrigerator, what's in their food desert, et cetera, but it's days to starvation because of that awareness, that precariousness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5173.6,
    "end": 5176.642,
    "text": "But anyway, if you could talk a little bit more about redundant variations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5176.662,
    "end": 5180.125,
    "text": "I'm not quite sure what the concept of what that looks like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5182.675,
    "end": 5185.097,
    "text": " Can you see this diagram again on my screen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5185.317,
    "end": 5185.537,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5186.397,
    "end": 5186.617,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5187.238,
    "end": 5202.727,
    "text": "So in the difficult-to-form fit and fix on the left-hand side, the shape, if there's a little bit of a twist and a little bit of poor machining,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5204.286,
    "end": 5229.908,
    "text": " the timber sections there it can make forming that joint really difficult and then though so those variations they're just they're just redundant they don't they don't add any value they lead to because there is this this the duality of entropy and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5230.708,
    "end": 5236.811,
    "text": " There's a little bit of physical disorder because maybe the wood's a bit twisted or the machining was a bit off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5237.431,
    "end": 5239.292,
    "text": "So there's the information uncertainty.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5239.872,
    "end": 5241.393,
    "text": "How am I going to make that joint?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5242.613,
    "end": 5250.917,
    "text": "So then suppose there's six ways of forming that joint with equal probability, just like a fair die.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5251.737,
    "end": 5254.398,
    "text": "And the information entropy is 2.58 bits.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5256.92,
    "end": 5282.094,
    "text": " and that 2.58 bits it's just it's just not adding any value at all um that gap of 2.58 bits but with this alternative on the right hand side those uh the square pieces in the corners they can have a rebate formed in them in their in their thickness so there's quite a substantial overlap there's maybe a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5285.063,
    "end": 5304.237,
    "text": " nine millimeters or three-eighths of an inch overlap so if if the joint isn't perfect it just covers it up and it doesn't matter so that's a practical example and then if we scale that up to all the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5306.431,
    "end": 5308.673,
    "text": " The many, many things that can be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5309.013,
    "end": 5317.439,
    "text": "So why design, manufacture, act, factor and assembly, reduce products assembly times by 90% is because it just eliminated all redundant variation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5320.822,
    "end": 5321.302,
    "text": "Does that help?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5323.047,
    "end": 5342.009,
    "text": " know what what that reminds me of is almost like we talk about aberrant precision we've talked about that on the neuropsychiatry side delusional beliefs failure modes of decision-making algorithms it's okay to not be latched on to the perfect strategy as long as there's this healthy uncertainty",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5342.589,
    "end": 5364.826,
    "text": " about strategic decision making because it's that uncertainty that's getting kind of coasted on that should the system persist ends up finding an appropriate or an adequate strategy but aberrant precision when there's like high precision um confidence but then also it's off target with its mean estimation things can go awry and so it's like that door frame on the left the mass-produced one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5365.626,
    "end": 5381.509,
    "text": " then as you've pointed out it's kind of like a false sense of precision because if you look at it it looks like the more precise one it looks like oh it's sharper or it was machined such and such angle at exactly this angle but then that one degree tolerance what sounds like really accurate on the machining wheel",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5382.35,
    "end": 5387.852,
    "text": " Now that plays out on the doorframe and now it's actually less precise in practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5388.513,
    "end": 5403.539,
    "text": "And also like you pointed out the example with the cupboard or the bookshelf being attached to the wall, like you can design for internal precision really well, but then it's hard to take a step back and have latitude for like the wiggle room of real life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5404.099,
    "end": 5408.801,
    "text": "But that's actually where the success or the failure of the product in use is going to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5409.895,
    "end": 5413.056,
    "text": " So that's very interesting topics that you brought up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5415.437,
    "end": 5417.298,
    "text": "Just a quick follow up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5417.498,
    "end": 5423.941,
    "text": "One of my happiest days in my life is when I discovered that you can mix sawdust with epoxy and then do gap filling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5424.181,
    "end": 5426.942,
    "text": "And I actually completed projects a lot faster as a result.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5428.022,
    "end": 5431.984,
    "text": "One other comment on that is contracts, mass contracts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5432.424,
    "end": 5433.645,
    "text": "We had a lot of negotiations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5433.705,
    "end": 5436.726,
    "text": "I used to work with banks and software companies and things doing contracts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5437.316,
    "end": 5454.645,
    "text": " and it was funny because in negotiations a mass contract has that you get rid of redundant variation right you just get there's no reason to have a different contract for all these things but it constrains the people who have less power in the negotiation but it's funny because people say to you when you're in the negotiation with someone who has a mass contract they'll say",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5455.445,
    "end": 5457.887,
    "text": " Well, you can't change it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5457.927,
    "end": 5460.208,
    "text": "This is the way we always have done it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5460.929,
    "end": 5462.73,
    "text": "And they're saying this is just it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5463.17,
    "end": 5466.813,
    "text": "And then the answer back to that is, well, let me show you how we're going to do it for the next 20 years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5467.093,
    "end": 5473.577,
    "text": "Because the world changes around these things that have insufficient variation in them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5474.278,
    "end": 5480.682,
    "text": "And so it's interesting when what seems like a system that has eliminated redundant variation becomes anachronistic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5484.252,
    "end": 5486.275,
    "text": " Are you seeing my screen now?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5486.295,
    "end": 5487.617,
    "text": "Are you seeing three circles?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5487.777,
    "end": 5488.017,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5488.958,
    "end": 5489.179,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5489.599,
    "end": 5492.543,
    "text": "So, Scott, you were talking about distributed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5493.805,
    "end": 5495.948,
    "text": "And so what's...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5497.734,
    "end": 5524.399,
    "text": " I'm working on is this it's this highly distributed prosumption highly distributed and highly efficient compared to distributed subsistence which is distributed but not efficient and centralized which is efficient but not distributed so that's the thing and here is the dark picture of what happens with centralization okay",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5527.551,
    "end": 5530.552,
    "text": " That looks like the fovea and retina.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5531.472,
    "end": 5539.314,
    "text": "The focus, all the attention is on the heart of the empire and then it's all dark.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5542.655,
    "end": 5543.915,
    "text": "So nice images.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5544.515,
    "end": 5546.576,
    "text": "And also that distributed model is very cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5549.897,
    "end": 5555.258,
    "text": "So Steven with a raised hand and then anyone else who wants to raise their hand or a question in the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5558.237,
    "end": 5561.559,
    "text": " I'd like to bring in a bit more on that aesthetics and embodiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.659,
    "end": 5566.963,
    "text": "I put a couple of notes actually in the YouTube chat as well, just with a link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5567.403,
    "end": 5572.627,
    "text": "I don't know if you've heard of the William Morris and Philip Webb Red House in Bexley Heath, Kent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5573.227,
    "end": 5587.797,
    "text": "It talks a lot about the crafts because they actually had this whole thing in the 1800s where they were wanting to redo the crafts in the house and they actually had little holes in the ceiling so they could redesign the ceilings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5588.977,
    "end": 5612.632,
    "text": " in a craft way for different events so this this push against industrialization so i was wondering when you mentioned about the better aesthetics by putting the corners i mean in some ways you you you you gain what could be seen at one level of aesthetic but there again with the craft and seeing some of the variation the the the reach of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5613.49,
    "end": 5614.571,
    "text": " And I wonder how you feel about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.651,
    "end": 5621.936,
    "text": "The reach of the embodied inference of the person making it is lessened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5622.297,
    "end": 5638.529,
    "text": "So I wonder what your thoughts are about the ability to infer from the other direction what the process of creation was and how that aesthetic creates more soul, how that is in a way what the soul of objects are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5643.65,
    "end": 5666.174,
    "text": " um so if let me try to sum up what i my understanding is of what you what you were saying so my understanding of what you're saying correct me if i'm wrong is that if something is crafted then it has more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5667.942,
    "end": 5688.767,
    "text": " um inherent value at least to the person doing the who crafted it so if somebody carves a carves a sculpture then that has more inherent value to them than if they",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5690.649,
    "end": 5693.511,
    "text": " downloaded a model of a sculpture and 3D printed it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5694.592,
    "end": 5694.932,
    "text": "Is that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5695.833,
    "end": 5696.734,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.655,
    "end": 5717.631,
    "text": "And on top of that, the ability for their embodiment of creation, their process of creation or their active inference or an active inference process of creation extends further out into that distributed network because someone who's further removed from that person could see that sculpture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.371,
    "end": 5733.589,
    "text": " and they could get closer to being them than being closer to being a cdc routing machine operator you know um well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5738.504,
    "end": 5759.985,
    "text": " i don't i don't well i don't know because if i see it if i see a sculpture then i can appreciate it hopefully but i'm far from being able to do it myself and uh so let me give you a more mundane example that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5760.678,
    "end": 5786.378,
    "text": " in many parts of the world walls used to have walls and ceilings used to have wet plaster applied to them to make them smooth and so plastering a ceiling getting the plaster on the ceiling the wet plaster on the ceiling and it's smooth it's a very difficult thing to do",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5787.78,
    "end": 5791.623,
    "text": " And so people would do apprenticeships as plasterers and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5792.683,
    "end": 5799.087,
    "text": "And so I can see that I can see, oh, yeah, that looks and maybe I could try to do it myself as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5799.127,
    "end": 5801.529,
    "text": "And all the plaster would end up on the floor and on me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5802.189,
    "end": 5804.591,
    "text": "And then I'd realize that, oh, this is really difficult.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5805.672,
    "end": 5813.838,
    "text": " But it doesn't get me any closer to being a plasterer with the skill to get the plaster on the ceiling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5814.619,
    "end": 5833.694,
    "text": "And if all dwellings depend upon, the construction of all dwellings depends upon such processes, then billions of people are going to remain in bad dwellings or no dwellings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5836.978,
    "end": 5859.88,
    "text": " So if I understood you correctly, I don't think it makes me, but if I see somebody putting up some boards on a ceiling that are designed to give a functionally adequate and aesthetically adequate ceiling, and I see them do that, then I can do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5863.564,
    "end": 5864.084,
    "text": " Cool, thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5864.344,
    "end": 5865.064,
    "text": "Just one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5865.164,
    "end": 5867.705,
    "text": "Just one follow-up, just very quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5868.125,
    "end": 5871.685,
    "text": "I suppose I could also... I'm not necessarily disagreeing with what you're saying at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5871.725,
    "end": 5890.409,
    "text": "I think I would also just... In terms of this distributed... Like if you go into a medieval house and you see a more rough-and-ready plastering, you may not know how to do it, but you could imagine the process of someone in bodies that did it, even if you couldn't do it yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5891.049,
    "end": 5892.049,
    "text": "So I was wondering about that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.129,
    "end": 5909.563,
    "text": " those kind of those removals as things get industrialized um which may be a you know maybe that's why sometimes we add texture back in and sometimes the more expensive stuff that we buy in the shops actually has texture put back in that can be actually expensive to produce",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5911.767,
    "end": 5912.868,
    "text": " It reminds me of graffiti.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5913.388,
    "end": 5922.092,
    "text": "Like when you see graffiti, you can imagine an affordance that would lead to you having done that art versus like an Apple phone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5922.152,
    "end": 5925.894,
    "text": "It's delivered like in the conch shell with smooth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5925.934,
    "end": 5931.617,
    "text": "And it's sort of the extreme case where at the very least, it's more cognitive to understand how it was built.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5932.137,
    "end": 5933.498,
    "text": "And it definitely makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5933.578,
    "end": 5938.5,
    "text": "And things that are well-worn, it doesn't make them like better or more valuable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5938.58,
    "end": 5939.081,
    "text": "It just makes them...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5939.981,
    "end": 5965.969,
    "text": " more able to play a part of a story in someone's life like putting up a kid's drawing it becomes about the person and latching onto a broader network of connections versus the very parsimonious and ruthless efficiency of an industrial design process that kind of seeks to um remove the human touch and like you know if it was a craft beer it has a little dirt it's character if it's a mass-produced one has a little dirt it's dirty",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5967.029,
    "end": 5983.725,
    "text": " so we tolerate um different types of imprecision when we know that we're dealing with like our neighbor versus when we're expecting some international shipment of uh food um so scott with a question and then looks like you want to share something else steven",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5984.994,
    "end": 5986.035,
    "text": " You know, it's interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5986.055,
    "end": 5991.898,
    "text": "It's kind of the disgust reaction is invoked there, too, and that idea of that rejection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5992.198,
    "end": 6000.583,
    "text": "And anyway, that reminded me of that last bit was there's a black box of AI that we talk about now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6000.623,
    "end": 6004.305,
    "text": "Well, in a way, we have a black box of industrialization, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6004.365,
    "end": 6006.266,
    "text": "The thing was made, but we don't know how.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6007.176,
    "end": 6033.798,
    "text": " and it used to be that if you look this if you look at a shoe you can say i see the stitches and i see there's a cow over there i can see how you get leather and i get it then you look at a nike shoe and you're like i have no idea where that came from how it was made if it was glued what was put together right it's just so in a way we had that black box now me when marx was talking about alienation and industrialization maybe part of our alienation is not knowing our connection to craft",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6034.713,
    "end": 6039.358,
    "text": " One of the things I talk to people about is in Europe, they have these rights called drop morale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6039.398,
    "end": 6040.319,
    "text": "They're moral rights.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6040.379,
    "end": 6042.3,
    "text": "It's a copyright right overlay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6043.161,
    "end": 6046.424,
    "text": "So if I sell you a painting in Europe, you can't destroy it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6046.825,
    "end": 6051.049,
    "text": "I still have rights as an artist, moral rights in the art as a form of expression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6051.63,
    "end": 6054.853,
    "text": "I think it has a Hegelian and Kantian background, but let's put that aside.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6056.587,
    "end": 6059.269,
    "text": " In the United States, if I sell you a painting, you can do anything you want to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6059.789,
    "end": 6065.613,
    "text": "We have a kind of Locke utilitarian notion of these expression and rights and individual rights.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6066.194,
    "end": 6073.319,
    "text": "So it feels like there's indifference here philosophically in terms of connection to expressive content.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6074.299,
    "end": 6076.741,
    "text": "In the drought morale context, you're not talking about industrial production.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6076.781,
    "end": 6081.925,
    "text": "You're talking about a copyright, which gets towards industrialization of guild type production, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6081.945,
    "end": 6083.646,
    "text": "Because it's a work of original authorship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6084.784,
    "end": 6094.874,
    "text": " Again, maybe not directly related, but I just thought it was really interesting that in a way we're looking at that black box question again and humans being alienated from production.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6095.575,
    "end": 6103.483,
    "text": "And I wonder if there's some aspects in the work that we're seeing here of that de-alienating production.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6103.503,
    "end": 6104.945,
    "text": "I wonder if you could comment on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6105.926,
    "end": 6106.747,
    "text": "Nice question, Scott.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6106.887,
    "end": 6107.147,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6108.533,
    "end": 6110.294,
    "text": " Can you now see a diagram?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6110.354,
    "end": 6113.717,
    "text": "It's sort of got a slopey line and some black boxes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6113.777,
    "end": 6114.057,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6114.998,
    "end": 6121.323,
    "text": "So it says here, increasing geographical and social distribution of production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6122.564,
    "end": 6124.625,
    "text": "So degrowth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6124.705,
    "end": 6127.327,
    "text": "Now, degrowth centralised industrial production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6127.688,
    "end": 6130.65,
    "text": "This is happening with premature deindustrialisation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6131.751,
    "end": 6137.155,
    "text": "In many countries in the world, they had some industrialisation and now it's going.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6138.635,
    "end": 6148.159,
    "text": " And we see that what's coming on is there's distributed industrial, distributed artisanal, and distributed DIY.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6148.219,
    "end": 6149.039,
    "text": "That's growing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6152.5,
    "end": 6158.302,
    "text": "But probably what's still going to come from centralized industrial production is materials, formed materials.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6159.322,
    "end": 6166.585,
    "text": "And then components, and then local goods is becoming more distributed, then distributed infrastructure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6167.505,
    "end": 6192.811,
    "text": " and then down here this so industrial production so this requires massive capital investment in fixed industrial manufacturing assets then you get industrial mass production and this is all based upon that you get higher productivity from that massive capital investment",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6194.512,
    "end": 6217.823,
    "text": " but can this produce higher wages more goods purchased is there still scope for that will this lead to increased um by production employment evidence suggests not so this is non-industrial production for one of a better term so with this there's minimal capital investment inflexible",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6218.473,
    "end": 6224.504,
    "text": " non-industrial production assets, non-industrial production, then there's higher productivity",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6226.198,
    "end": 6233.34,
    "text": " And that's coming, and one of the options here is you can have higher value artisanal production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6234.54,
    "end": 6249.644,
    "text": "So if shoes are handmade to some extent, as they are with a company doing that that was in Ethiopia, that can lead to higher wages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6250.704,
    "end": 6254.345,
    "text": "And that's more goods and infrastructure made with personal commitment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6256.016,
    "end": 6259.217,
    "text": " leading to increased paid and personal production employment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6259.957,
    "end": 6264.719,
    "text": "And then down, lower price DIY production, lower expenditure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6265.519,
    "end": 6276.363,
    "text": "So with prosumption, you could, for example, produce something with some degree of craft in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6277.883,
    "end": 6280.864,
    "text": "And that could produce higher production.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6282.381,
    "end": 6310.895,
    "text": " sales price higher wages and then at the same time your costs can be reduced so if you if you fabricate your own solar panels and you install them yourselves and suppose you can get all your electricity from that well then your energy costs go down so i'm seeing this as being um is that diagram very visible in your yep i made it large it's what you see on jitsi is not what the live stream is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6311.846,
    "end": 6312.126,
    "text": " Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6312.867,
    "end": 6313.187,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6313.247,
    "end": 6321.214,
    "text": "So that diagram, I think, is addressing both sides of this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6321.474,
    "end": 6327.119,
    "text": "On the one hand, you're reducing this lower price DIY.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6327.699,
    "end": 6333.224,
    "text": "So there, the idea is to eliminate all redundant variation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6334.804,
    "end": 6349.567,
    "text": " to drive down costs of essential goods as low as possible, so as many people can access them as possible, so they can fabricate and install themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6350.968,
    "end": 6361.49,
    "text": "And the higher value artisanal production, this is using automated engineering, this mass engineering type of thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6366.107,
    "end": 6367.028,
    "text": " Pretty cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6367.368,
    "end": 6371.152,
    "text": "Reminds me of doing more with less and also Bucky.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6371.813,
    "end": 6379.661,
    "text": "So maybe we can just each have a final thought or a final area that we want to explore a little bit next week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6380.441,
    "end": 6383.404,
    "text": "And then otherwise, this has been an awesome discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6388.186,
    "end": 6396.872,
    "text": " Um, you just think for a few seconds for what would, what would be our, what was something that will stick with us from today or where do we want to take it in our dot two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6396.992,
    "end": 6399.334,
    "text": "So, um, Scott first, then Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6401.615,
    "end": 6402.296,
    "text": "I really like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6402.696,
    "end": 6405.137,
    "text": "Um, concluding thought on that really feels like that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6405.157,
    "end": 6405.718,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6406.445,
    "end": 6429.035,
    "text": " conversion of labor and attention and skills and the into embodied our embodied world and that feels like that dynamic is going to be very interesting to continue to explore in that last diagram there those pathways and the complementary pathways are fascinating and thank you for fantastic discussion thank you scott dean",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6429.801,
    "end": 6435.107,
    "text": " Yeah, I just wanted to, I have to read this because I was listening and thinking about what I wanted to close with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6435.887,
    "end": 6451.003,
    "text": "My takeaway today, besides the fact that I've got a new reference with embedded jet boots that I'm going to have to go and try to hold myself down with, is that perhaps life is an apprenticeship in wayfinding across scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6452.444,
    "end": 6458.526,
    "text": " So one of the things that I think that we're trying to do in these live streams is popularize active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6459.126,
    "end": 6465.347,
    "text": "We're trying to drive down the costs, per se, of that entry barrier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6466.268,
    "end": 6477.051,
    "text": "And so these kind of interaction processes, like we're having today in this point one, I think are giving us more of a sense of how that cost factor can be addressed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6479.704,
    "end": 6483.886,
    "text": " beyond a room full of academics, which I think we all agree is kind of a small niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6484.926,
    "end": 6489.188,
    "text": "And I think that's something that we're all trying to make available to more people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6489.248,
    "end": 6495.471,
    "text": "So that last reference that you made, Scott, was actually pretty helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6496.831,
    "end": 6505.835,
    "text": "I think one of the things that we try to do in terms of an interactionist forward approach is in the point zeros we deconstruct",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6506.857,
    "end": 6521.113,
    "text": " in the point ones we reconstruct and then in the point twos, which is next Tuesday, which I'm unfortunately going to be on a, I'm going to be away from, but that's where the new or next super ordinance sort of emerge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6521.474,
    "end": 6525.438,
    "text": "And so that, I think the way that we're trying to set this up, whether it's going to,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6526.638,
    "end": 6532.661,
    "text": " I don't know when it's going to sort of take off, like when the jet boots will really be fired up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6532.801,
    "end": 6537.142,
    "text": "But I think we're putting things in place for that to happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6537.203,
    "end": 6542.785,
    "text": "So I think on the one hand, I can kind of laugh about the fact that I'm going to have to anchor myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6543.445,
    "end": 6549.708,
    "text": "But on the other half, he says, anytime we can get creative with this stuff, it's worthy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6549.808,
    "end": 6551.549,
    "text": "It's enthusiasm worthy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6551.609,
    "end": 6553.73,
    "text": "So thank you for sharing with us today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6553.75,
    "end": 6554.59,
    "text": "I really appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6555.845,
    "end": 6557.426,
    "text": " Thank you, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6557.486,
    "end": 6558.787,
    "text": "Stephen, and then Bloop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6560.528,
    "end": 6561.149,
    "text": "Thank you again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.189,
    "end": 6562.59,
    "text": "Yeah, I really enjoyed it today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6562.69,
    "end": 6564.131,
    "text": "It was a great, great call.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6564.291,
    "end": 6568.173,
    "text": "And I'm going to take away the idea of situated entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6568.193,
    "end": 6573.977,
    "text": "I think that's really useful and has a lot of legs to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6574.077,
    "end": 6580.742,
    "text": "And I'm really interested in more about talking about pragmatic approaches to using the variation of expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6580.762,
    "end": 6583.464,
    "text": "And I think that goes beyond what I was often maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6584.164,
    "end": 6592.068,
    "text": " pragmatism, which we've had here as a kind of philosophical thing, but maybe pragmatics in terms of design and application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6592.168,
    "end": 6593.029,
    "text": "So thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6593.309,
    "end": 6593.549,
    "text": "Brilliant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6594.65,
    "end": 6594.87,
    "text": " Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6594.89,
    "end": 6618.252,
    "text": "Then just my closing thought is, uh, I'm really fascinated by your experience and theorizing and other publications on this, the past and present and future of that continuum or multidimensional space between craft and artisanship, the boutique, the bespoke, everything on that principal component side, and then industrialization and, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6619.372,
    "end": 6644.026,
    "text": " have we hit peak something you know have we seen the biggest solid state drives of all time in 2019 that was peak solids date or what will be peak what and what's been gonna be what are we at the bottom of what are we near the top of and uh some of the the roads and the paths that you sketched are pretty cool so Stephen Fox if you have any final comments",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6646.464,
    "end": 6651.546,
    "text": " Scott, could you email me a link to the organization that you were mentioning?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6651.566,
    "end": 6658.269,
    "text": "I will email Stephen's email address to Scott.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6659.569,
    "end": 6660.79,
    "text": "Okay, thank you very much.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6662.63,
    "end": 6667.612,
    "text": "Thank you all very much for taking the trouble to read my paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6669.813,
    "end": 6673.995,
    "text": "I was plowing a lonely furrow when I was doing it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6676.864,
    "end": 6705.301,
    "text": " Lou with the last word thanks Stephen and you know you gave us so many additional references to read that that's really what I'm looking forward to doing between now and next week is digging into some of this additional literature that I've been made aware of cool so till next week we'll read the papers think of questions invite any colleagues or anyone else so all backgrounds are welcome to join so we'll see you all next week bye thanks bye bye",
    "speaker": "SPEAKER_00"
  }
]