[
  {
    "start": 1.069,
    "end": 21.498,
    "text": " hello it's february 22nd 2023 2 2 2 2 3 and we're in the second discussion of chapter 7 in cohort 2. before we go to the questions of chapter 7 and then at the end a look ahead to chapter 8",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.72,
    "end": 36.759,
    "text": " we are going to have thomas parr joined for a live stream in five days and so anybody if they would like to raise an area of questions could be conceptual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.344,
    "end": 44.646,
    "text": " Or it could just be a general textbook level or personal question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.866,
    "end": 54.909,
    "text": "So of course, feel free to add anything, but just while we're here, any thought or like kind of general piece that people are thinking that Thomas could reduce our uncertainty about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.196,
    "end": 72.18,
    "text": " All right, just, of course, add it when you see fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.583,
    "end": 86.892,
    "text": "Okay, there were several questions that we've already looked at from 7 and several more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.534,
    "end": 90.715,
    "text": "We can also look a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.097,
    "end": 94.939,
    "text": "Just again, we looked at the first question,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.596,
    "end": 119.839,
    "text": " sections of the chapter itself so does anyone have a chapter seven question that they want to go to or add or do they prefer to walk through the sections in the textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.516,
    "end": 162.296,
    "text": " let's look at equation 7.4 see if we have anything annotated for it okay we don't have the natural language yet so let's just look a little let's pick back up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.283,
    "end": 191.067,
    "text": " with the rat in the maze example go through it connect it to the equations and then return to some to several of the questions down here in seven so in the earliest part of chapter seven was a passive inference with the example of listening to music",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.358,
    "end": 220.564,
    "text": " now the upstairs action selection part is going to come into play the imperative for action selection is going to be G G like we saw in chapter 5 takes the action prior the prior on different policies which can be understood as like habit and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.432,
    "end": 247.999,
    "text": " sharpens it according to just qualitatively provide epistemic and pragmatic value and quantitatively as described in equation 2.6 and 7.4 does anyone want to give a reading or a thought on 7.4 just what is it saying in and of itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.924,
    "end": 268.213,
    "text": " and or how does or might this relate to in their words the resolution of the exploration exploitation dilemma yeah ali go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.498,
    "end": 284.184,
    "text": " Well, yeah, as we saw before in chapter two, I guess, but I think it was in a more comprehensive terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.544,
    "end": 298.171,
    "text": "But here we only have a part of that equation, which basically deals with the tradeoff between negative, I mean, epistemic value and the pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.565,
    "end": 328.435,
    "text": " and how they relate to each other because as we saw in chapter two the trade-off or the dilemma between exploration and exploitation is basically one of the fundamental requirements for any sentient behavior for any sentient agent because as long as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.761,
    "end": 336.963,
    "text": " the agent wants to explore the environment in order to informally discover new",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.974,
    "end": 378.786,
    "text": " let's say opportunities or new resources, be it, I don't know, food resource or any other resource necessary for its survival in the environment, it needs to somehow have a trade-off between this kind of having the pragmatic value on one hand, namely to survive in the environment, and on the other hand, to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.312,
    "end": 389.404,
    "text": " to discover new resources for its survival, which basically relates to the pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.866,
    "end": 405.673,
    "text": " Either of those two requirements, if taken to its extreme far, would probably result in the demise of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.654,
    "end": 412.577,
    "text": "Take, for instance, an agent residing in an environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.398,
    "end": 425.323,
    "text": " for a certain period of time, it can survive in that environment using the pre-known resources there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.383,
    "end": 432.246,
    "text": "But when the resources is about to diminish, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.748,
    "end": 451.039,
    "text": " that agent needs to explore a little bit further in order to discover some new resources and continue its persistence through time or its survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.044,
    "end": 458.385,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.165,
    "end": 459.646,
    "text": "Yes, Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.907,
    "end": 478.917,
    "text": " Yeah, so I'm a little bit wondering, in these epistemic considerations, only things can be considered that the agent actually already knows about, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.598,
    "end": 482.479,
    "text": "And then I'm...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.652,
    "end": 505.974,
    "text": " wondering why at several places, I think I said this in chapter 2 and here in this chapter 2, also 7.2, also that one would like to find the most unlikely path, or one would like to increase the information value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 509.477,
    "end": 510.378,
    "text": " That's what I understood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.538,
    "end": 520.747,
    "text": "So the path that should be searched for would be the path that maximizes information, which means it's the most uncertain path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.409,
    "end": 528.413,
    "text": "And I'm incorrect?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 529.935,
    "end": 533.64,
    "text": " there's aspects that I think are correct, but I just want to draw that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.421,
    "end": 538.427,
    "text": "So actually what is being selected for policy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.628,
    "end": 565.558,
    "text": " are the most likely paths what is an agent like me most likely to do we're sampling our actions from the action posterior so rather than scaling policies by their reward and ranking them by their reward in reward learning and choosing sampling from the reward posterior for example we're going to be sampling from an action posterior so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.344,
    "end": 576.569,
    "text": " In the sense that our actions are selected based upon their posterior likelihood, we're actually pursuing the most likely path of action, indeed the path of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.609,
    "end": 589.757,
    "text": "However, we are seeking in the epistemic component, especially maximally informative sequences of future observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.877,
    "end": 593.619,
    "text": "So in the special case where pragmatic value doesn't matter,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.049,
    "end": 596.911,
    "text": " Like we have no preference over outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.471,
    "end": 599.974,
    "text": "We don't care if our bank account goes up or down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.974,
    "end": 605.779,
    "text": "Then we implement a pure InfoMax novelty search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.72,
    "end": 618.411,
    "text": "In a situation that's totally known, there's no epistemic value to be obtained, we have a special case of pure utility pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.192,
    "end": 640.603,
    "text": " However, in cases where both utility pragmatic and epistemic are on the table, G is proposed to resolve this dilemma by adjusting the action prior into an action posterior that respects the importance of both of those imperatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.745,
    "end": 648.827,
    "text": "That's the unified imperative of action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.482,
    "end": 657.203,
    "text": " Yeah, so I'm not sure how I should understand this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 657.763,
    "end": 661.404,
    "text": "So for instance, I want to go to the baker and buy some bread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 662.244,
    "end": 670.246,
    "text": "And then the most informative, I mean, the more unlikely thing is actually that I go to the barber and cut my hairs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.906,
    "end": 676.087,
    "text": "So I would, because that has more information and going to the baker and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.747,
    "end": 686.075,
    "text": " considering what kind of bread I'm going to buy, I go to the barber because that is more informative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.056,
    "end": 689.898,
    "text": "I'm not sure I understand how I should understand this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.22,
    "end": 696.904,
    "text": "These values are calculated about generative models, not about territories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.885,
    "end": 702.089,
    "text": "So again, it's natural and intuitive to want to be like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.72,
    "end": 731.068,
    "text": " directly mapping from an equation or calculation to a real world territory situation but keep in mind these are um ultimately numerical values calculated for generative model it doesn't make sense to talk about free energy being minimized like for example of a person doing translation simply or of an ant simply foraging it's of the generative model that these values are being calculated on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.301,
    "end": 743.771,
    "text": " And so if one proposes a generative model of location behavior, so kind of in a previous discussion, we had like a higher order, like what location am I going to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.871,
    "end": 746.814,
    "text": "Barber, home, baker, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.735,
    "end": 749.977,
    "text": "And then we have a lower level model with our footsteps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.997,
    "end": 754.921,
    "text": "So that's kind of analogous to the live stream 42 slam robotics example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.022,
    "end": 757.043,
    "text": "Then in that situation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.252,
    "end": 787.457,
    "text": " one could ask how different policy selections were being influenced by their respective epistemic or pragmatic value but it is not the case that we can directly draw from a variable to the territory these are like summary variables or re-weightings on our map and it only makes sense to talk about these summaries on maps not territories ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.299,
    "end": 817.266,
    "text": " Actually, Michael Levin has an excellent paper from 2019, The Computational Boundary of a Self, in which he has an interesting diagram showing the cognitive sphere or cognitive light cones, if you will, of each cognitive or intelligent agent in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.084,
    "end": 843.67,
    "text": " uh it can have an effect and uh it's um of uh more or less uh of its concern so uh it also integrates the yeah that's it so uh so for example um for humans uh because of uh well or highly intelligent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.478,
    "end": 856.245,
    "text": " species or agent because of the complexity of its goal-directed activity and agency it results in a kind of larger cognitive boundaries",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.235,
    "end": 871.926,
    "text": " And for somewhat, let's say, quote, unquote, simpler agents, that would result in a much smaller light cone area of cognitive boundaries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.766,
    "end": 883.674,
    "text": "So yeah, depending on the complexity of the tasks that the agent is capable of doing, that territory of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.638,
    "end": 893.12,
    "text": " its cognitive effectivity would vary according to the complexity of the thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.341,
    "end": 895.581,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.201,
    "end": 911.805,
    "text": "So, these are, G is a functional that is going to sharpen our action prior according to such and such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.045,
    "end": 914.766,
    "text": "If we just wanted to pass through habit,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.953,
    "end": 917.356,
    "text": " we would just pass through habit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.237,
    "end": 925.09,
    "text": "And in chapter five, in the nervous system example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.733,
    "end": 947.248,
    "text": " this is what's reflected in the bottom here with this dopaminergic circuitry where on the left side of this basal ganglia or whatever mammalian tissue it happens to be on the left side there's kind of like a habit pass through like e the prior on affordance is basically passed through",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.817,
    "end": 956.028,
    "text": " Whereas in G, I'm sorry, on the right side, G is sharpening the policy distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.308,
    "end": 961.997,
    "text": "So if we just wanna pass through habit, we don't even need to apply G. However, if we want to sharpen,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.4,
    "end": 988.184,
    "text": " our action selection the moment to respect expected free energy in a prospective planning like fashion then we want to calculate um g so what is being calculated with g again this is an equation 2.6 but also here we're taking another look at it so there's two terms looking first at the pragmatic value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.138,
    "end": 995.88,
    "text": " And the special cases were already mentioned and elsewhere about when one of these or the other is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.56,
    "end": 1012.425,
    "text": "Okay, so fancy E, it's an expectation regarding our Q variational distribution that we control of O tilde observation sequence conditioned upon policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.465,
    "end": 1016.446,
    "text": "So we're going to see that both terms are conditioned upon policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.628,
    "end": 1024.274,
    "text": " So if there's only two affordances, then we're only going to compute two different Gs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.954,
    "end": 1030.339,
    "text": "So this is how we kind of prevent like spiraling and computing like all possible world futures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.12,
    "end": 1032.721,
    "text": "We're conditioning on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.902,
    "end": 1037.425,
    "text": "And we're interested in, we're reducing our uncertainty about which actions to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.807,
    "end": 1040.328,
    "text": "So that's what this first part is saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.848,
    "end": 1043.531,
    "text": "So expectation of the variational distribution,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.987,
    "end": 1065.865,
    "text": " of upcoming observation sequences conditioned upon actions policies that we can take and it is going to be um a natural log to help facilitate just all kinds of things that logs facilitate but it's it's a monotonic relationship with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.977,
    "end": 1068.398,
    "text": " what is being described here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.458,
    "end": 1083.183,
    "text": "And this is about observations conditioned on preferences, C. So where observations are close to preferences, pragmatic value is high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.423,
    "end": 1090.085,
    "text": "Where our observations are different than our preferences, pragmatic value is low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.585,
    "end": 1095.627,
    "text": "Rather than associating pragmatic value with a reward function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.974,
    "end": 1108.202,
    "text": " we're associating it with bounding our surprise, natural log, self-information, surprisal, of our preference slash expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.545,
    "end": 1125.715,
    "text": "The epistemic value component, which can be kind of seen as like a sub-function with like a negative i, but it's interesting that also this is kind of a surprisal-like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.333,
    "end": 1145.565,
    "text": " um like even pragmatic value enters into an information theoretic surprise like formulation so even our pragmatic value is still informational it's not you know tokens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.967,
    "end": 1174.37,
    "text": " here we see again an expectation over our variational distribution but here rather than on the sequence of observations through time o tilde it's the sequence of hidden states through time so this is um now looking at underlying latent states conditioned upon policy and there's two there's a difference of two entropies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.772,
    "end": 1205.016,
    "text": " then here's p which is like the the kind of actual distribution and then q the distribution we control now within the parentheses o tilde in both case o tilde conditioned upon states minus o tilde conditioned upon policies so there's definitely a few ways to unpack it and i think we've we've um explored some but um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.656,
    "end": 1233.699,
    "text": " broadly if the policy is not further reducing your uncertainty about this relationship the epistemic value is low if the policy is reducing your uncertainty about s via o then there's epistemic value",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.848,
    "end": 1240.149,
    "text": " I think there's like a lot of open questions that are pretty contextual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.29,
    "end": 1252.313,
    "text": "Like how do these implicit or tacit understandings, like how does the rat know that going to that cue location is going to reduce its uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.173,
    "end": 1256.935,
    "text": "How does it know the semantics of the left versus the right cue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.795,
    "end": 1261.256,
    "text": "How does it know what, you know, this is not the whole story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.605,
    "end": 1280.542,
    "text": " but within the context of doing variational inference on a structurally determined model this is the basis of the separation between pragmatic value defined as alignment between observations and preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.505,
    "end": 1293.776,
    "text": " and epistemic value defined as reduction of uncertainty, which is to say entropy, of how policies sharpen our understanding of the relationship between hidden states and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.176,
    "end": 1294.456,
    "text": "Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.979,
    "end": 1301.042,
    "text": "Yeah, so both of these are expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.102,
    "end": 1308.008,
    "text": "So that is with respect to future things that might happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.538,
    "end": 1312.559,
    "text": " These expectations are actually used in the sense of a mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.319,
    "end": 1317.061,
    "text": "The time horizon is implicit within pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.001,
    "end": 1323.843,
    "text": "Whether that is being calculated, whether g is being calculated over pi of length 1, 2, 3, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.023,
    "end": 1325.484,
    "text": "in the discrete time formalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.104,
    "end": 1333.707,
    "text": "But these expectations are actually like center of gravity, Laplace approximation, central limit theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.527,
    "end": 1336.428,
    "text": "Think expectation of a distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.208,
    "end": 1338.549,
    "text": "Even though it's about the future,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.622,
    "end": 1346.81,
    "text": " We're actually computing like the center of gravity or policies of different times, but we're not funny enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.83,
    "end": 1350.354,
    "text": "Like we are, but we aren't talking about future time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.238,
    "end": 1370.397,
    "text": " OK, so what I maybe don't really understand here is the difference between P and Q. I was of the understanding that P is something that is present in the presence that we experience, and Q is something that happens in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.278,
    "end": 1379.643,
    "text": " Now I'm a little bit confused because P and Q both relate here in this equation to the future, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.363,
    "end": 1382.325,
    "text": "So how can this be understood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.687,
    "end": 1390.329,
    "text": "The difference between P and Q is not between the present and the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.349,
    "end": 1397.934,
    "text": "P is like the underlying distribution and Q is our variational approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.083,
    "end": 1427.02,
    "text": " this is like the actual entropy of the relationship between observations and hidden states whereas this is the relationship of the entropy um the entropy of the variational generative models relationship between those two ali uh yeah i think uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.075,
    "end": 1443.319,
    "text": " equation 2.3 might help to somehow clarify that ambiguity between P and Q, because in equation 2.3, yeah, that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.379,
    "end": 1446.22,
    "text": "The KL divergence between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.682,
    "end": 1460.207,
    "text": " Q and P is defined as the expectation between the surprisal of Q and the surprisal of P. And one interesting thing about equation 7.4 is that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.749,
    "end": 1476.357,
    "text": " epistemic value is the expectation with respect to the hidden states, but the pragmatic value is the expectation with respect to the observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.318,
    "end": 1487.024,
    "text": "So we need to keep both of them in mind because here, as Daniel just mentioned, P is just the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.827,
    "end": 1505.01,
    "text": " Q is the variational, I mean, free energy, but P is the standard probability function we apply to a random variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.971,
    "end": 1514.833,
    "text": "So that's why they have distinguished between those two functions, because Q has some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.272,
    "end": 1520.894,
    "text": " a specific, um, uh, definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.934,
    "end": 1535.006,
    "text": "So for example, in equation 2.2, uh, the probability of P without any, uh, yeah, that's, that's just, uh, the simple derivation of the probability of, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.38,
    "end": 1548.507,
    "text": " a random variable being of a specific value is calculated without taking into account cues or other parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.968,
    "end": 1550.288,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.708,
    "end": 1558.733,
    "text": "Yes, the fact that pragmatic value is associated with outcomes is what ties closely to perceptual control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.117,
    "end": 1583.744,
    "text": " and the fact that epistemic value is associated with hidden states is related to the um avoidal of overfitting we're not reducing our epistemic value on observations observations are being evaluated for their pragmatic value hidden state inferences are being evaluated and and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.803,
    "end": 1591.496,
    "text": " through them policies are being evaluated for their epistemic value michael",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.441,
    "end": 1604.066,
    "text": " Yeah, so I am a little bit confused about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.766,
    "end": 1609.149,
    "text": "You said that Q relates to the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.07,
    "end": 1622.079,
    "text": "But the variational free energy, I mean, we made this distinction between the G, which is the expected free energy, and the F, which is the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.119,
    "end": 1623.3,
    "text": "And now inside that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.96,
    "end": 1627.641,
    "text": " Expected free energy is a variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.982,
    "end": 1633.384,
    "text": "So, yeah, just to be clear, Q is the variational distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.024,
    "end": 1635.224,
    "text": "This is the guy we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.905,
    "end": 1637.025,
    "text": "Q is the guy we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.126,
    "end": 1638.826,
    "text": "P, we don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.146,
    "end": 1640.166,
    "text": "Mind your P's and Q's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.867,
    "end": 1641.847,
    "text": "Q is the one we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.147,
    "end": 1649.27,
    "text": "Variational free energy is a real-time functional that's a function of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.655,
    "end": 1653.776,
    "text": " our variational density queue and incoming data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.616,
    "end": 1656.096,
    "text": "It doesn't engage with planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.957,
    "end": 1668.839,
    "text": "Expected free energy and a host of cousins like free energy of the expected future that Baron Milledge and others have proposed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.859,
    "end": 1672.4,
    "text": "This is not like the only way to even do this energy-based method in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.659,
    "end": 1701.169,
    "text": " this is rather than a function of taking in only q and y as arguments here the primary argument is the policy prior vector and then the computation of this functional involves q the variational distribution but like q could be a gaussian distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.011,
    "end": 1711.619,
    "text": " So we'd be looking to parameterize the variational parameters, you know, the median and the variance, the two parameters of a Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.941,
    "end": 1717.424,
    "text": "And the true generative process may not be Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.986,
    "end": 1725.652,
    "text": "But we would be looking, just like in a linear regression, we'd be looking to minimize the sum of squares with the L2 norm,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.914,
    "end": 1739.582,
    "text": " In this variational inference setting, we'd be looking to fit the best Gaussian mean and variance given the family of the variational distributions that we had chosen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.626,
    "end": 1746.806,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.936,
    "end": 1766.62,
    "text": " Yeah, so one other angle can be E is the actual posterior probability that is calculated according to the actual states we have at our disposal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.66,
    "end": 1770.101,
    "text": "But Q is the approximate posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.121,
    "end": 1778.483,
    "text": "So it's not the exact posterior that has been calculated in P. But yeah, Q is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.993,
    "end": 1807.838,
    "text": " related to variation of free energy in the sense that it's deployed in calculating the variation of free energy because for the, in order for the free energy to be a tractable parameter to be, I mean, implementable in a computational task, we need to use this approximate variation of free energy because otherwise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.619,
    "end": 1822.405,
    "text": " we don't have either all the information we need to calculate the exact posteriors, or it's too intractable to compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.826,
    "end": 1827.648,
    "text": "So that's the reason behind using approximate variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.249,
    "end": 1830.489,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.609,
    "end": 1836.572,
    "text": "And I think one kind of, as a valiant, this idea of like probably approximately correct,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.533,
    "end": 1865.838,
    "text": " is kind of like when they say almost surely in math but more on the statistics side if it's probably approximately correct it's like actually within the context of approximate bays that is what is gonna be not just good enough but like as good as you can kind of aim for um okay matrices are defined",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.959,
    "end": 1892.624,
    "text": " a has two slices a1 and a2 where we can think of it as two modalities of a and the dimensionality is clear in the MATLAB implementations it's clear in the pyMDP it's not exactly exactly the same syntax but like the structure of these matrices in principle are the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.087,
    "end": 1922.799,
    "text": " a1 is describing the probabilistic mapping from location to exteroceptive cues so it's not exactly an identity matrix but basically this is the accurate gps sensor when it's at this location start location it knows exactly where it is so again you can be like well how does it get this implicit knowledge of where it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.215,
    "end": 1927.836,
    "text": " Right, that's part of the complexity of cognitive modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.537,
    "end": 1933.958,
    "text": "But suffice to say that we're in a setting where the location is known without error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.299,
    "end": 1945.903,
    "text": "But one can imagine that there would be different outcomes and the need to do different parameterizations if there were off-diagonal elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.923,
    "end": 1950.024,
    "text": "A2 is the probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.964,
    "end": 1952.265,
    "text": "So they sum across to one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.946,
    "end": 1981.405,
    "text": " or the i'm sorry they they call them sum to one about the the food location the the between the spatial location and then the outcome of food so semantically this represents beliefs about food location in the a here 7.5 is the same as 7.4 it's just that here it's like two in the upper left 98 on the off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.052,
    "end": 2012.396,
    "text": " here we see 98 on the upper left two on the off here we have one in the third row empty on the second here those two rows have been flipped to represent the black on the left side versus the black on the right side so the food can be either on the left or the right side the rat can either make the move to go to the left or the right side or can go to the queue if it decides to go for the queue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.664,
    "end": 2024.432,
    "text": " not the Q letter, but the C-U-E, if it decides to receive an informational Q, then it will find out where the food is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.972,
    "end": 2031.177,
    "text": "Again, check out model stream 7.2 with the epistemic foraging and all of that sort of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2034.54,
    "end": 2041.526,
    "text": "These slices of B are describing movement affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.671,
    "end": 2054.32,
    "text": " Because again, with respect to the hidden state being location, B describes how different policy selection bears upon hidden states changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.042,
    "end": 2065.027,
    "text": "C is describing the relative preference for different outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.829,
    "end": 2070.512,
    "text": "So the C1 vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.696,
    "end": 2099.006,
    "text": " is about the first modality five of them that's the locations and there's a negative for the starting location so that's like a little bit of like a like a kind of get going because if it preferred to start location it might just stay there then in the second modality that's referring to this shorter vector of these one two three and that's these one two three um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.227,
    "end": 2128.664,
    "text": " in various modeling settings we've already started to see that like the c scaling matters a lot and so that's one reason why i think it's tentative or hypothetical to say that simply like equation 7.4 resolves explore exploit because it sets up the space for explore exploit to be framed absolutely it does however",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.952,
    "end": 2158.271,
    "text": " depending on how the variables are parameterized you can end up with an agent who still goes for the pragmatic value every time or who still goes for the information value every time so in terms of outcomes it's not simply resolved by knowing what equation 2.5 is but rather this opens up a space of modeling in which adaptive solutions can be reached so if this was six thousand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.397,
    "end": 2159.657,
    "text": " then 0, 6,000, 0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.739,
    "end": 2167.522,
    "text": "It's like reward is so good, it's going to be pursued.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.183,
    "end": 2172.806,
    "text": "If this was flat, 0, 0, 0, then it would be pure epistemic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.867,
    "end": 2186.555,
    "text": "So that's why it's so important that we develop statistical power methods and parameter sweeps across simulations because just making one T maze and saying like, oh, look, the rat does this or that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.635,
    "end": 2188.296,
    "text": "It's kind of like, okay,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.235,
    "end": 2213.759,
    "text": " d also is described for the two modalities and um it um describes the priors on the two there's a belief about the first location i'm actually just just i'm a little bit curious why there's five elements here but only four elements here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.564,
    "end": 2225.93,
    "text": " And then in the second modality there, which again is referring, maybe this is like a minus, there's one fewer element here because there's only two here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.212,
    "end": 2231.754,
    "text": "Here's like reflecting an equal prior over where the food is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.655,
    "end": 2235.837,
    "text": "So a priori is 50-50 left or right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.937,
    "end": 2241.08,
    "text": "So do you do a 50-50 bet left or right on the food?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.161,
    "end": 2245.043,
    "text": "Or do you go to get the epistemic Q",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.085,
    "end": 2275.055,
    "text": " which of course reduces your uncertainty about where the food is now we're going to dive a little bit deeper into epistemic value itself so in 7.4 they're saying we're going to go ahead and call just the epistemic value decomposition term i equation 7.8",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.182,
    "end": 2301.14,
    "text": " so here is just a separation of our as it was written in the prior equation that is going to be rewritten in terms of a kl divergence q s and pi q and s and pi they're the same on both sides here's p o s here's q o pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.775,
    "end": 2332.721,
    "text": " and it's it's definitely worthwhile i think for us to write out what these verbally mean because they have very i think interesting um implications for again like what is the epistemic value and then here is um with this semicolon being noted this is reflecting a pure information gain salience bayesian surprise imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.564,
    "end": 2345.653,
    "text": " Here's some simulations showing at time two, it goes to get the information and then it proceeds to the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.973,
    "end": 2346.193,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.676,
    "end": 2360.147,
    "text": "Yeah, just about your previous remark about why C has five elements and D has four elements, because C actually,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.011,
    "end": 2389.044,
    "text": " corresponds with the elements of A matrices, because A matrices actually describe the states that the environment is dealing with, but because D corresponds with B matrix, and because B matrix is a transition matrix,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.831,
    "end": 2397.075,
    "text": " That's why we don't need to have a redundant additional element for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.596,
    "end": 2402.698,
    "text": "So D being priors, yeah, maps onto B matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.579,
    "end": 2403.879,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.159,
    "end": 2418.728,
    "text": "And right now, you have to specify the tensor dimensionality and add some labels, but they're developing a lot of functions in PyMDP, and people who work with it can definitely have a lot of feedback on slightly more intuitive...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.904,
    "end": 2427.31,
    "text": " and scalable ways to specify dimensionality, which is currently one of the rate limiting steps in PyMDP application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.33,
    "end": 2428.651,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.751,
    "end": 2433.694,
    "text": "Just getting through seven and then just so we can look ahead to eight continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.235,
    "end": 2438.318,
    "text": "So precision, negative entropy, negentropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.138,
    "end": 2440.96,
    "text": "This is the high temperature and low temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.38,
    "end": 2443.562,
    "text": "High temperature, differences are erased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.743,
    "end": 2446.344,
    "text": "Low precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.825,
    "end": 2474.441,
    "text": " low temperature absolute zero high precision differences are accentuated that has technical usage especially in certain statistical distributions isochate paradigm par and frist in 2017.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.701,
    "end": 2493.288,
    "text": " Icicating is, while our eyes may dwell on what we may associate with pragmatically valuable, broadly speaking, icicating is driven by information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.19,
    "end": 2505.915,
    "text": "So it's a great place to study how pragmatic semantics at a higher level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.362,
    "end": 2535.932,
    "text": " are in a predictive processing type relationship with isocating at a lower mechanical level with this level almost surely being driven by information gain learning and novelty here um one kind of question that was arising was like why is our dashed line between only here but apart from that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.598,
    "end": 2560.933,
    "text": " priors are being provided on a and b so that's sort of like they can again and it's like a little bit like wise b over here so it's about the topology not the geometry in this situation what's happening is that a prior is being provided on a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.842,
    "end": 2566.287,
    "text": " so that these A and B in principle can be learnable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.068,
    "end": 2573.116,
    "text": "How that plays out and how that influences the pseudocode of the action perception loop, PyMDP is very clear about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.602,
    "end": 2587.993,
    "text": " Conjugate priors, this is facilitating, amongst other abilities, the Dirichlet conjugate prior for the categorical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.554,
    "end": 2592.537,
    "text": "So if we have probability distribution over categorical outcomes, is it hot or cold?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.318,
    "end": 2597.741,
    "text": "Then the Dirichlet can be used in an earn counting way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.854,
    "end": 2604.381,
    "text": " Like every time you observe a warm day or a cold day, you just put in a ball of that color into the urn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.462,
    "end": 2608.085,
    "text": "And then it could be two and two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.646,
    "end": 2610.448,
    "text": "And then the next ball is very influential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.588,
    "end": 2611.93,
    "text": "It could be a thousand and a thousand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.95,
    "end": 2613.531,
    "text": "Then the next ball is not so influential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.272,
    "end": 2618.057,
    "text": "And that turns out to be what's called a conjugate prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.755,
    "end": 2645.153,
    "text": " that enables the categorical distribution to stay as a classical probability distribution Kolomogorov's axioms and all of that while also allowing the conjugate prior to have this like counting or learning by counting strategy inferential approach to learning this is a difference with many other areas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.369,
    "end": 2655.131,
    "text": " they're proposing learning schemes that may or may not be biologically relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.672,
    "end": 2673.736,
    "text": "Whereas a lot of work has gone into understanding how the perceptual or fast inference and learning or slower parameter learning processes are unified but of distinct time scales and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.645,
    "end": 2707.198,
    "text": " here in 711 equation they are going to delve more into like learning as active yes it's about policy everything's being conditioned upon policy there's a lot that one can say about the integration of action so this maze learning task is fundamentally intertwined with the action selection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.783,
    "end": 2715.364,
    "text": " The agents updating of their likelihood is related to their action selection amidst uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.164,
    "end": 2718.965,
    "text": "They're not seen as like two separated phases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.545,
    "end": 2730.327,
    "text": "Here's where they just drop some kind of threads and further literature, maybe further versions of the textbook are going to come into more detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.387,
    "end": 2736.788,
    "text": "Hierarchical deep inference, nested modeling, something that people talk and think about a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.844,
    "end": 2743.806,
    "text": " But here we see the figure 4.3 or figure 7.3, the rake and the policy selection fractal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.547,
    "end": 2745.927,
    "text": "It's a rake of rakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.228,
    "end": 2750.449,
    "text": "And structure learning and Bayesian model reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.349,
    "end": 2756.171,
    "text": "Just some model comparison and analysis techniques that support Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.56,
    "end": 2771.31,
    "text": " Another example involving a hierarchical inference model is described and that has been used in the context of reading and other visual inference tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.312,
    "end": 2774.253,
    "text": "That's chapter seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.773,
    "end": 2776.475,
    "text": "Let's quickly look to chapter eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.296,
    "end": 2780.518,
    "text": "Chapter seven was discrete time generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.199,
    "end": 2784.282,
    "text": "Chapter eight is gonna be continuous time generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.448,
    "end": 2807.604,
    "text": " main setting in which discrete time models have been studied is central or cognitive decision making categorical decision making in contrast the major setting in which continuous time active inference models to this time have been used in is in continuous movement or motor control tasks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.365,
    "end": 2816.207,
    "text": " So like in Livestream 46, active models do not contradict folk psychology with Alex Kiefer, Ryan Smith, and Maxwell Ramstad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.048,
    "end": 2822.549,
    "text": "They talk about like motor AI, MAI, and decision active inference, DAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.89,
    "end": 2834.053,
    "text": "Here, there's going to be a proto-Bayesian physics-like model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.409,
    "end": 2863.192,
    "text": " representation that's going to enable us to do continuous things specifically the separation of a data observation sequence in terms of an underlying function and a fluctuation stochastic term and then a latent state derivative with a little dot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.471,
    "end": 2890.476,
    "text": " change in latent states as a function of the current status of the hidden state and slowly varying causes which are going to be playing the role of policies in continuous time formalization and again partitioning out of our stochastic fluctuations so actually this part is allowed is this part is guaranteed to have zero mean and that's what facilitates like bayesian mechanics a lot of other statistics um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.932,
    "end": 2920.3,
    "text": " again just like quickly looking through it this y g x and f relationships continue to be built up to again talk and this is very spm like here's our actual sensor readers readings from the eeg fmri meg their function of neural activity neural activity is a hidden latent state it is a function of current neural activity and attention for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.829,
    "end": 2935.877,
    "text": " That physics analogy in the continuous state space can be extended into Newtonian dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.537,
    "end": 2938.819,
    "text": "And as Dalton and Bayesian mechanics have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.922,
    "end": 2947.728,
    "text": " laid out in the last year or two, it goes way, way further than this, but this is a spring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2948.349,
    "end": 2953.093,
    "text": "So this is Hooke's law as a mere active inference entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.914,
    "end": 2963.943,
    "text": "This is like a boring active entity that just dampens, but it's just to show that we can understand the generalized coordinates of motion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.014,
    "end": 2979.842,
    "text": " which is to say position, velocity, acceleration, snap, crackle, pop, et cetera, et cetera, et cetera, generalized coordinates of motion within this continuous time framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.623,
    "end": 2991.469,
    "text": "Dynamical systems often which are conditioned to be smooth and differentiable are amenable to continuous time formalizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.157,
    "end": 3000.798,
    "text": " In the discrete time, we'd say, well, we have one, two, and three, and then we're going to be moving to one of the locations in the grid world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.599,
    "end": 3003.679,
    "text": "And we have a transition matrix over grid world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.619,
    "end": 3009.68,
    "text": "In the continuous time setting, here, this is the spinal cord with the butterfly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.26,
    "end": 3019.522,
    "text": "Here's the sensory data coming in, Y, and then a descending hidden state inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.059,
    "end": 3033.588,
    "text": " and uh error deviation that's being resolved through policy selection in the continuous space so this is hearkening back to chapter five and the spinal cord reflex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.673,
    "end": 3049.917,
    "text": " how continuous time generative models can be applied to continuous spinal motor reflexes as opposed to the usually more centrally associated discrete categorical decision-making, DAI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.738,
    "end": 3054.939,
    "text": "There's a sidebar on precision attention and attenuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.021,
    "end": 3065.626,
    "text": " There's the discussion of Latke-Volterra, which is also called predator-prey or winnerless dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.547,
    "end": 3068.888,
    "text": "You can't win in this ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.928,
    "end": 3084.859,
    "text": "There are ecologies that collapse, of course, but activity dynamics amongst brain regions have been modeled for decades as these winnerless competitions, also called neural Darwinism, and that's relating to Friston's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.522,
    "end": 3110.152,
    "text": " lineage with edelman more examples of how these kinds of winnerless competitions can be used in the context of continuous time generative models to generate smooth action sequences like this sort of gibberish cursive writing learning is um approached in a continuous model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.529,
    "end": 3119.355,
    "text": " Everything in chapter eight is kind of being contrasted or juxtaposed with what we saw in chapter seven in the discrete time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.077,
    "end": 3134.887,
    "text": "They introduced the Lorenz attractor, which is unpacked in significantly more detail in live stream 32 on Markov blankets and stochastic chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.129,
    "end": 3139.751,
    "text": "It is basically this example with the Lorenz attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.609,
    "end": 3165.456,
    "text": " which is showing that generalized synchrony which isn't lockstep but rather mutual information amongst coupled dynamical systems can happen even when those coupled dynamical systems are Lorenz attractors they don't have to be like both like simple linear systems um so that's like good to know and they've used that to simulate birdsong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.718,
    "end": 3172.103,
    "text": " Where before learning, they're kind of like on and off a synchronization manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.203,
    "end": 3178.788,
    "text": "And then after learning, they've sharpened their joint distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.049,
    "end": 3181.831,
    "text": "Again, this begs further questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.891,
    "end": 3184.493,
    "text": "How do they know the semantics of the song and how did they learn the song?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.513,
    "end": 3188.877,
    "text": "But this is just an example at this level of complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.897,
    "end": 3191.559,
    "text": "8.5, hybrid models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.703,
    "end": 3222.999,
    "text": " here we have the rake within a rake but notice that the outer rake there should be a line connecting this g to pi the outer rake is d a i here we see hidden states through time t minus one now future tail of two densities observations through time classic dai chapter 7 up top but the nested model has the same structure figure 4.3 but here we see the position",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.758,
    "end": 3254.168,
    "text": " velocity acceleration generalized coordinates pattern occurring so this is called a hybrid model because the discrete time model is nesting a continuous time model so this has been used to model things like where do i want to look from a categorical perspective and then here's the oculomotor saccades at a continuous model that's nested within that more equations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.589,
    "end": 3265.317,
    "text": " isochade model, more equations, summary, and key advances in continuous time models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.258,
    "end": 3267.799,
    "text": "End of the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.339,
    "end": 3268.579,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.36,
    "end": 3269.72,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.321,
    "end": 3273.723,
    "text": "We'll take a break and then begin with the next cohort in just two minutes.",
    "speaker": "SPEAKER_00"
  }
]