[
  {
    "start": 4.823,
    "end": 7.97,
    "text": " Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.35,
    "end": 13.18,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I'm delighted to be speaking to Vanya Visa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 13.201,
    "end": 20.335,
    "text": "Vanya is a postdoctoral fellow at Johannes Gutenberg University Mainz in the department of... Royal University Bochum, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.356,
    "end": 21.618,
    "text": "The internet has lied to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 21.859,
    "end": 23.001,
    "text": "The internet has lied to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 23.487,
    "end": 25.009,
    "text": " I don't like this introduction bit already.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 26.391,
    "end": 27.593,
    "text": "But I think this is true nonetheless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.633,
    "end": 34.183,
    "text": "His research centers on consciousness, mental representation, philosophy of cognitive science, philosophy of mind, and of course, active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.585,
    "end": 42.355,
    "text": "We also both share a love of self-modeling, attention, autopoetic intentionality, and much, much more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.635,
    "end": 45.439,
    "text": "And I'm sure these are just some of the topics that we will discuss today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.86,
    "end": 47.402,
    "text": "Vayner, welcome to the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.422,
    "end": 48.464,
    "text": "Thank you so much for joining me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.125,
    "end": 49.946,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.146,
    "end": 50.727,
    "text": "It's a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.825,
    "end": 51.766,
    "text": " No, this is really exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.246,
    "end": 64.178,
    "text": "Yeah, as I said in the intro, we share a lot of interests that might appear quite niche to people, but actually, as far as I can tell, pertain to their lived experience at every moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.398,
    "end": 66.4,
    "text": "So it's worthwhile dissecting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 66.921,
    "end": 72.406,
    "text": "Funnily enough, the first time I think I'd heard of you was actually from Jacob Hovey in the conversation I had with him.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.426,
    "end": 79.853,
    "text": "And he said that you know Thomas Metzinger's work perhaps better than Thomas and certainly better than anyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.204,
    "end": 89.496,
    "text": " So I wonder whether we could start by outlining some of these crucial concepts that sometimes seem a bit counter-intuitive to people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.957,
    "end": 95.404,
    "text": "So for example, when I say we both share a love of self-modelling or phenomenal self-modelling, what does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 95.424,
    "end": 98.227,
    "text": "What does this sort of acronym PSM, the phenomenal self-model mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.889,
    "end": 100.63,
    "text": "Yeah, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.65,
    "end": 109.722,
    "text": "So maybe as a disclaimer, of course, Thomas knows more about this than me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.258,
    "end": 140.097,
    "text": " invented the term self-models and has developed the self-model theory of subjectivity over many many years and actually I think I can say that there's probably no living philosopher who has read as much relevant literature about this topic as Thomas because he's devoted his entire career to this and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.633,
    "end": 151.509,
    "text": " works a lot and I would never, even if I tried, be in a position to know as much about this as he does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.791,
    "end": 158.84,
    "text": "And I think it might be a good idea even to invite him to this podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.86,
    "end": 159.722,
    "text": "You've been invited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.742,
    "end": 161.224,
    "text": "He has said yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.542,
    "end": 163.424,
    "text": " that was a while ago, I tried to push it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.684,
    "end": 166.847,
    "text": "So Thomas, if you're listening, which I think he might be, you know, you never know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.069,
    "end": 169.05,
    "text": "Please do come on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.17,
    "end": 175.817,
    "text": "Yeah, so actually, it's quite likely that some of the things that I'll be saying might not be 100% true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.977,
    "end": 183.785,
    "text": "So Thomas, if you're listening, now, you may want to correct some of the misrepresentations of your work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.926,
    "end": 187.028,
    "text": "But anyway, yeah, what is a self model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.068,
    "end": 188.95,
    "text": "So for me, it's, I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.115,
    "end": 193.56,
    "text": " think easiest to first think about bodily self models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.421,
    "end": 202.952,
    "text": "So just imagine some creature or a robot that has a body and has to control the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.272,
    "end": 210.381,
    "text": "And as we all know, in many cases, control can be facilitated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.019,
    "end": 215.003,
    "text": " or improved if you have a model of the thing that you're controlling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.224,
    "end": 228.038,
    "text": "And if you want to control your body and the interaction with the environment, it can be highly useful to have a model of your body and a model of your environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.898,
    "end": 236.206,
    "text": "And this is actually then already a form of self model, which is part of the world model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.267,
    "end": 239.49,
    "text": "So the world model would be just be a representation of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.128,
    "end": 254.322,
    "text": " the world or the relevant part of the world, the parts that are relevant to you and the, your environment and your body is part of this world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.362,
    "end": 263.551,
    "text": "So it's the self model is part of the world model, but of course that's just a form of self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.571,
    "end": 270.017,
    "text": "And it's quite primitive probably compared to the self models that we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.453,
    "end": 271.674,
    "text": " human beings have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.694,
    "end": 293.976,
    "text": "And one thing that distinguishes ourselves models is that we don't have only unconscious self self models, but actually we have, we also consciously experienced the contents of our self models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.996,
    "end": 298.62,
    "text": "So this brings us into the notion of a phenomenal self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.14,
    "end": 304.907,
    "text": " where phenomenal refers to phenomenal experience, phenomenal consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.788,
    "end": 318.022,
    "text": "So if you have not just an unconscious self model, but a phenomenal self model, you actually experience your body as your own body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.062,
    "end": 328.675,
    "text": "And another form of selfhood that you then might experience is experiencing your own actions as your action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.195,
    "end": 339.649,
    "text": " So this is often called a sense of agency that you have over your action and a sense of ownership that you have over your body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.869,
    "end": 353.447,
    "text": "And both can also get lost or be affected in various ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.448,
    "end": 357.632,
    "text": "And so these are some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.781,
    "end": 359.823,
    "text": " concepts that are relevant here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.903,
    "end": 378.099,
    "text": "There's one thing that I wanted to add, or maybe an example that Thomas also likes to use, I think, is this robot Starfish that was developed by Josh Bongard and colleagues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.119,
    "end": 387.568,
    "text": "And in order to make it flexible and able to adapt to changes to the environment and also to its own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.903,
    "end": 401.815,
    "text": " So for instance, if one of its limbs is damaged or is cut off, you want the robot to still be able to control its body and control movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.955,
    "end": 406.239,
    "text": "And so it can be useful to have a model of the body, a self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.879,
    "end": 411.123,
    "text": "But of course, in that robot, it's not a phenomenal self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.143,
    "end": 413.024,
    "text": "It's not a conscious robot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.144,
    "end": 417.488,
    "text": "So that would be an example of an unconscious bodily self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.008,
    "end": 421.472,
    "text": " Yeah, let's start with the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.512,
    "end": 422.613,
    "text": "I think that's a good place to start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.653,
    "end": 428.72,
    "text": "Because as you say, it's kind of the low hanging fruit, the lowest level of what people think about in terms of the phenomenal self model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.901,
    "end": 445.218,
    "text": "I think a potential point of confusion for people is the fact that the body has what I guess Merleau-Ponty called a dual aspect, which is both that it's a lived body, but it is also a body that can be observed and can be objectified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.999,
    "end": 446.8,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 447.353,
    "end": 458.314,
    "text": " I guess the question here is why do we, is there a difference between saying I am my body, I live through my body, or versus I have a body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.295,
    "end": 461.419,
    "text": "And what are those different aspects of selfhood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.44,
    "end": 463.303,
    "text": "Because on one part, I feel like you're getting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.891,
    "end": 465.793,
    "text": " what we will be called perspective illness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.414,
    "end": 467.235,
    "text": "I am my body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.275,
    "end": 468.357,
    "text": "I live through my body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.417,
    "end": 468.737,
    "text": "I live.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.538,
    "end": 474.424,
    "text": "Yeah, I mean, literally through it as a vehicle for which I can be in the world versus possession.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.185,
    "end": 481.293,
    "text": "I am some in this case, it seems like people would feel like a disembodied ego who has a body that they own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.353,
    "end": 492.227,
    "text": "Is there a way of coalescing these kind of two canonical features of selfhood one being possession and one being perspective illness or association with the lived body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.658,
    "end": 494.839,
    "text": " Yeah, that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.94,
    "end": 502.609,
    "text": "So I think these different perspectives are, to some extent, compatible, whereas it depends on what you mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.649,
    "end": 523.615,
    "text": "So one could, for instance, wonder whether a non-human animal, which maybe does not have a form of consciousness that is comparable to human conscious experience, and that doesn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.168,
    "end": 530.015,
    "text": " reflect about its own body nevertheless lives through its body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.035,
    "end": 553.281,
    "text": "So there's a live body, but that doesn't mean that we don't have that we, I would say it's just that we can also have different forms of experience, or richer forms of bodily experience, and reflect about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.683,
    "end": 555.545,
    "text": " our own experience in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.386,
    "end": 562.971,
    "text": "And so having a body versus living through a body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.111,
    "end": 577.724,
    "text": "So it seems to me that the lived body is that that's more characteristic of experiences or situations in which we're not so much aware of having a body at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.804,
    "end": 581.968,
    "text": "So maybe when we're engaging in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.421,
    "end": 598.609,
    "text": " some physical activity, playing sports and just not thinking about where our limbs are, but just moving and interacting and in the sense living through the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.969,
    "end": 603.417,
    "text": "I don't know if that captures what is usually meant by that expression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.038,
    "end": 604.319,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.599,
    "end": 606.943,
    "text": "I wonder whether it's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 607.835,
    "end": 612.371,
    "text": " We wrote this paper, not you and I, me, Carl, Lars, and others wrote this paper on flow states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 612.392,
    "end": 615.322,
    "text": "And flow states are exactly this, playing sports.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.342,
    "end": 617.49,
    "text": "And we tried to ground it in a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.842,
    "end": 619.744,
    "text": " self-modelling architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.245,
    "end": 625.572,
    "text": "And actually, the revisions have been really useful for that because I've been able to get a little bit more concrete on what I'm talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.112,
    "end": 646.718,
    "text": "And the kind of dichotomy that we're saying is present there, I think I can say this because hopefully it'll be published, well, as the pre-print's out, is the distinction really between a minimal phenomenal self, which is like these really basal fundamental aspects of selfhood, mindness, presentness, perspectivalness, versus epistemic agency or strong epistemic agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.12,
    "end": 661.053,
    "text": " And by that, I mean, you know, when we let's say plan or when I'm talking to you and I have to think about my next sentence, there's a very strong sense of self-guiding that process where I can use, let's say, former resources, former knowledge to apply to deep temporal planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.074,
    "end": 664.622,
    "text": "And we're saying that that's attenuated in flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.602,
    "end": 694.069,
    "text": " and what we're also saying therefore is that metacognition because i think it's really important here to distinguish between pre-reflective self-awareness and reflective self-awareness and i'm treating reflective self-awareness as a metacognitive act your self is reflecting on itself because um reflective self-consciousness is itself a kind of part a form of epistemic foraging that too is attenuated in flow states but i think the interesting question there is if i was in flow would i purely live through my body or could i be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 694.876,
    "end": 697.719,
    "text": " perceptually aware of having a body nonetheless?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 698.34,
    "end": 698.961,
    "text": "Could I have both?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 699.882,
    "end": 706.99,
    "text": "And these are very difficult questions to tease out because, you know, they're only done retrospectively and so you only get qualitative reports.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.29,
    "end": 709.092,
    "text": "That's an interesting dimension that I haven't thought about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.913,
    "end": 721.626,
    "text": "I think, okay, so I emailed you, however, you know, a month ago, two months ago, and I said, so I've been trying to get my, I've been trying to think about how Metzinger's phenomenal self-model can be coalesced with active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.095,
    "end": 724.278,
    "text": " And this is the Active Inference Insights podcast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.298,
    "end": 729.304,
    "text": "So I messaged you, I said, active inference takes cognition to be fundamentally inferential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.485,
    "end": 736.012,
    "text": "Are the processes within or the processes that generate the phenomenal self model inferential?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 736.953,
    "end": 743.361,
    "text": "Are the processes that are themselves being modeled by the phenomenal self inferential or both?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 743.594,
    "end": 755.009,
    "text": " because I think you would do a great service to everyone if you could explain that what Thomas is talking about is kind of the cognitive system recapitulating its own data structures into phenomenal space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.211,
    "end": 757.793,
    "text": "And I think that's an interesting idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.833,
    "end": 772.352,
    "text": "He talks about this in sort of his 2003 book and 2008 book and some other works that the phenomenal self model is in an implicitly reflective way is obviously a model of itself, whether that is a, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.058,
    "end": 786.837,
    "text": " giving relevant features into consciousness or coarse-grained features into consciousness, whatever it is, but it's a reflective process where the data structures in the body and brain are being transposed into phenomenal space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 787.357,
    "end": 788.439,
    "text": "So maybe we can start there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 788.459,
    "end": 790.782,
    "text": "I may have butchered it and I'm sure Thomas is pulling his hair out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.304,
    "end": 798.272,
    "text": "But maybe we can start there and then feed an inference and see where it might exist within those cycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.243,
    "end": 817.382,
    "text": " Yeah, so I think this is actually quite complex topic because when we're talking about self models, it seems to presuppose that there's already an experienced I, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.462,
    "end": 823.669,
    "text": "That I have a body, I am moving my hand and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.729,
    "end": 834.384,
    "text": " but I don't think that's necessarily already present in any, in the most basic forms of phenomenal self models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.766,
    "end": 850.709,
    "text": "And what it's, at least the way I think about it is that having a, at least a bodily self model is mainly about just making a distinction between one between inner and outer as it were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.47,
    "end": 853.133,
    "text": "So I'm just trying to avoid the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.687,
    "end": 857.19,
    "text": " with self and non self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.691,
    "end": 860.733,
    "text": "So a distinction between two types of processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.254,
    "end": 867.72,
    "text": "One is the environment and the other is here where I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.841,
    "end": 879.651,
    "text": "And I think that actually suffices for having a bodily self model or even a phenomenal self model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 880.371,
    "end": 882.293,
    "text": "But of course, when we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.235,
    "end": 908.449,
    "text": " think about our experience and the way we the different forms of self that we experience there's there's more to it there's there's something like an an eye and maybe at this point it's useful to um bring another aspect of the the self model theory on the table which is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.053,
    "end": 912.638,
    "text": " phenomenal model of the intentionality relation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.139,
    "end": 916.844,
    "text": "So quite exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.846,
    "end": 932.186,
    "text": "And so the idea is that there's in a complex self model, phenomenal self model in which there's not just a distinction between this belongs to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.267,
    "end": 933.488,
    "text": "This does not belong to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.508,
    "end": 934.41,
    "text": "This is my body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.45,
    "end": 935.391,
    "text": "This is not my body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.451,
    "end": 935.932,
    "text": "And so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.312,
    "end": 938.115,
    "text": "Well, this is my,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.344,
    "end": 944.449,
    "text": " my action or this is an involuntary movement and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.551,
    "end": 965.892,
    "text": "In more complex self models, you also have this perspectivalness and subjectivity in the sense that you not just make the distinction between what is self and non-self or what is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.58,
    "end": 979.638,
    "text": " outside and what is inside, but also how you are related to the environment, how you are related to your body and how your thoughts are related to the world and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.719,
    "end": 986.047,
    "text": "So this brings a reflexive component to it and makes it more complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.528,
    "end": 989.873,
    "text": "I find it a bit difficult to put this into words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.033,
    "end": 991.836,
    "text": "Yeah, it is difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.956,
    "end": 994.439,
    "text": "I mean, so I can hopefully assist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.82,
    "end": 996.402,
    "text": "I have some sort of quotes here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.382,
    "end": 1019.217,
    "text": " um great so this is the way that i've understood it at least and so we'll start with the quote so thomas metzinger 2008 so the two paper the ego tunnel i think is 2009 so this is a really actually very useful paper um he wrote in 2008 called something like the empirical approach to phenomenal self-modeling it's really it's actually very lucid he says that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.197,
    "end": 1027.504,
    "text": " The subjectively experienced content of the phenomenal self is the representational content of a currently active dynamic data structure in the system's central nervous system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.365,
    "end": 1033.47,
    "text": "And that is, it's a representational entity whose content is determined by the system's very own properties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.81,
    "end": 1041.237,
    "text": "So what I mean by that is it's standing in for something that is lower level to it, namely these data structures, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.257,
    "end": 1048.123,
    "text": "And we obviously here are taking as axiomatic that there are representational structures and maybe that's problematic and we can get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.458,
    "end": 1057.083,
    "text": " And the way that I've always read the PMIR is that the cognitive system can pay attention to the fact that it itself is directed at other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.527,
    "end": 1061.235,
    "text": "And therefore, what happens is that it...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.35,
    "end": 1069.1,
    "text": " well, I'm not going to say it makes the inference, but it projects into phenomenal space this notion of itself and something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1069.701,
    "end": 1078.633,
    "text": "I guess my question here is, that's taking as a presupposition that there is some division that the self model can model, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.034,
    "end": 1088.927,
    "text": "it can reflect on the fact that its own attention can be directed at so-called external worldly objects or things in the world model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.818,
    "end": 1098.57,
    "text": " My question here would be, how does the brain know what in the sense is external to it and what is internal to it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.151,
    "end": 1108.384,
    "text": "In the sense that I can introspectively pay attention to parts of my own lived experience, but have a sense of mindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.921,
    "end": 1111.383,
    "text": " and not feel that kind of duality or that distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.403,
    "end": 1117.268,
    "text": "But if in principle I pay attention to the chair next to me, that feels like a separate object to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.789,
    "end": 1130.72,
    "text": "So if the brain is recapitulating some distinctions that are in its self-model, I guess my real question is, are we not, as you say, already invoking an a priori distinction between the thing that's paying attention and the attended object?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.302,
    "end": 1137.426,
    "text": "Yeah, so if I understand your question correctly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.334,
    "end": 1140.597,
    "text": " then the answer would be yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.958,
    "end": 1144.022,
    "text": "And so you mentioned knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.122,
    "end": 1145.384,
    "text": "So how does the brain know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.945,
    "end": 1150.472,
    "text": "And of course, knowledge requires truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.872,
    "end": 1166.755,
    "text": "So you're assuming that there is effect to the matter, whether something is really inside or outside, or something is really I or mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.275,
    "end": 1168.898,
    "text": " or self or not self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.639,
    "end": 1178.192,
    "text": "And I don't think we have to make this assumption that these are truth claims and that the brain has knowledge about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.853,
    "end": 1183.561,
    "text": "But it does have to make some prior assumptions about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.182,
    "end": 1188.468,
    "text": "And these can be delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.37,
    "end": 1193.316,
    "text": "So in that sense,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.566,
    "end": 1217.565,
    "text": " I think the question how does the brain know can be dissolved, but of course when the question is where do these priors come from and why are they relatively immune to revision and what happens if they do break down or the sense of self dissolves and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.49,
    "end": 1226.363,
    "text": " So might it be feasible to say that at the very bottom level, all we have is attention in some way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.304,
    "end": 1235.117,
    "text": "I've recognized that I almost, well, I did commit this kind of dualistic fallacy when I said there is the attender and the attended object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.798,
    "end": 1240.245,
    "text": "It seems to me that actually that might be an inference too far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.826,
    "end": 1244.953,
    "text": "Rather, there just is the attention onto these kinds of objects in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.001,
    "end": 1246.083,
    "text": " these data structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.704,
    "end": 1249.167,
    "text": "Again, Metzinger puts this far better than I do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.948,
    "end": 1259.262,
    "text": "He says that when he talks about the PMIR, the phenomenal model of the intentionality relation, he says that you mentally simulate yourself as currently being directed at a target object or goal state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.284,
    "end": 1262.647,
    "text": "And that's a really interesting notion, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.667,
    "end": 1264.87,
    "text": "This mental simulation of yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.012,
    "end": 1272.141,
    "text": "Maybe he's committing a linguistic fallacy there that there's a self there in the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.703,
    "end": 1274.164,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.292,
    "end": 1284.22,
    "text": " So we can pay attention, let's say, to the fact that we can be targeted at certain areas of our data state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.081,
    "end": 1289.065,
    "text": "But then we can also pay attention to the fact that we're paying attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.085,
    "end": 1296.572,
    "text": "And that seems to me, I don't want you to think about this proposal, that seems to me to be maybe the heart of reflective self-consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.913,
    "end": 1303.999,
    "text": "That I can pay attention to the fact that there seems to be something that is paying attention to that which is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.468,
    "end": 1306.552,
    "text": " that which is where attention is going to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.573,
    "end": 1308.216,
    "text": "There's a kind of triple hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.399,
    "end": 1319.961,
    "text": "One, does that sound like a feasible underlying explanation of metacognitive self-conceptualization or reflective self-consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.001,
    "end": 1324.992,
    "text": "And two, how deep do those recursive patterns go?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.073,
    "end": 1329.04,
    "text": " What I mean by that is like, how many times can I reflect on my own attentional processes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.24,
    "end": 1337.554,
    "text": "And I know Lars Sandberg-Smith and others have been doing this in terms of so-called meta-awareness, but I'm thinking more in terms of actually the underlying phenomenal reality of being a self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1338.315,
    "end": 1347.992,
    "text": "Is there a point when which the very notion just becomes, uh, you know, irreconcilable with a certain degree of recursive operations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1349.655,
    "end": 1349.915,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.156,
    "end": 1350.456,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.381,
    "end": 1352.022,
    "text": " Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.082,
    "end": 1360.832,
    "text": "So regarding this triple distinction, I think that's already quite difficult to imagine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.852,
    "end": 1370.303,
    "text": "So maybe we can just try to clarify this and just restate this again together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.343,
    "end": 1374.388,
    "text": "But before that, there's something that came to my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.468,
    "end": 1378.553,
    "text": "Because when we think about how does the brain know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.005,
    "end": 1407.443,
    "text": " um what's inside um and what's in uh outside and when it comes to i mean there's some to some extent there there might be truth to to these um to claims about this and um so when it comes to attention we can just make a this really broad distinction between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.182,
    "end": 1437.143,
    "text": " um attention attention to processes that are driven by external influences so when some salient object or process processor now noise and the environment suddenly captures my intention and we can contrast that with cases in which i'm controlling my my attention and so the changes in attention are generated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.46,
    "end": 1442.587,
    "text": " or more caused by internal processes than by external processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.468,
    "end": 1458.407,
    "text": "And the brain can make inferences about that and can be more or less accurate about whether some changes in attention have been more caused by external or internal processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.869,
    "end": 1466.758,
    "text": "And it can make sense to model attention to improve these inferences and improve the control of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.262,
    "end": 1467.763,
    "text": " and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.043,
    "end": 1478.697,
    "text": "And maybe we can use this to just re-describe this triple distinction that you mentioned, because I'm not sure I fully got what you are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.717,
    "end": 1478.917,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.338,
    "end": 1479.779,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.919,
    "end": 1484.885,
    "text": "I'm aware that there are lots of layers to this, as is the problem when we talk about hierarchies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.366,
    "end": 1495.159,
    "text": "So I can actually read, I was thinking maybe it's best for me to just read what I've, so this is, so if people go and look at that flow paper right now on the preprint server, they won't see this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.274,
    "end": 1497.88,
    "text": " Hopefully, I'm not spoiling anyone's party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1498.822,
    "end": 1504.214,
    "text": "By the time this comes out, this is at the very end of a review process, so hopefully it's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.795,
    "end": 1507.521,
    "text": "Anyway, people can shout at me if they want.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1507.541,
    "end": 1509.165,
    "text": "I wrote, so it's my words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1510.411,
    "end": 1513.717,
    "text": " I said, in planning, so we're talking about epistemic agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1513.797,
    "end": 1532.132,
    "text": "In planning, the organism not only knows that it is intentionally directed at something else, yielding a weak form of epistemic agency and perspectivalness, but it is also in the act of knowing about its own knowledge, which encodes as multiple counterfactual representations of what might unfold as a result of my actions in the section of my current eco niche that I seem to control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1532.332,
    "end": 1539.989,
    "text": " In this way, planning involves strong epistemic agency, since the cognizer can epistemically model itself as epistemically agentive, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.129,
    "end": 1545.902,
    "text": "it can come to know its own capacity to control itself and its eco-niche over a protracted period of time through stored knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.135,
    "end": 1553.643,
    "text": " And then I go on to say that that self-modelling process is transparent in the sense that the agent often does not know that it knows its intentional objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.663,
    "end": 1558.729,
    "text": "Rather, there just is the sense of epistemic agency, which permeates a pre-reflexive self-awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.749,
    "end": 1559.91,
    "text": "This is where the triple thing comes in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1560.551,
    "end": 1573.746,
    "text": "When the agent does enter a state of knowing the fact that it knows its epistemic capacities and evolves into a phenomenologically metacognitive, metamodelling, or perhaps meta-epistemic organism, which reflects on its being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.785,
    "end": 1578.088,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1578.108,
    "end": 1584.776,
    "text": "So that, I think the issue that I had when writing this was you have to start from the original.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.156,
    "end": 1591.243,
    "text": "If you're using the Metzinger foundation, you have to start with the original basis, which is that the self model itself is a simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.624,
    "end": 1598.052,
    "text": "It's a recapitulation of a data structure, but it's a recapitulation of data structure, which in itself being reflected on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.873,
    "end": 1600.635,
    "text": "And that reflects that can also be reflected on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.655,
    "end": 1604.239,
    "text": "So that's where I'm building in this nature of hierarchical recursion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.637,
    "end": 1606.62,
    "text": " Mm hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.64,
    "end": 1608.464,
    "text": "How does that sound to your ears?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.484,
    "end": 1609.647,
    "text": "And again, what what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.69,
    "end": 1614.119,
    "text": "What does it mean for us to continue to go up these recursive ranks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.139,
    "end": 1620.355,
    "text": "Like, what happens, for example, if I like, is there a point where I just really concretize my sense of self?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1621.381,
    "end": 1624.424,
    "text": " Or does it actually almost become dispersive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.785,
    "end": 1629.71,
    "text": "Because all I realize that's going on is that I'm paying attention and I'm just paying attention to different levels of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.81,
    "end": 1636.237,
    "text": "So I'm kind of curious about what you think might be the phenomenological consequences of going up this hierarchy of reflective recursion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1642.524,
    "end": 1650.072,
    "text": "Yeah, so I don't think I can give a full answer to this question because there might be multiple things going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.659,
    "end": 1665.864,
    "text": " when I'm not just planning my actions or planning how to interact with the environment or whatever, but also reflecting upon my planning, becoming aware that I'm planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.884,
    "end": 1673.477,
    "text": "I might be evaluating this and becoming aware of the fact that I'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.803,
    "end": 1686.04,
    "text": " uncertain about different options, or I might become aware of the fact that I really want to do one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.1,
    "end": 1701.946,
    "text": "And so that this might then lead to further experience experience of certainty or maybe also, or not uncertainty, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.147,
    "end": 1702.367,
    "text": "Or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.853,
    "end": 1710.881,
    "text": " confidence that I'm making a good decision or doubtfulness about the decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1711.342,
    "end": 1720.972,
    "text": "And I think we can then repeat this process and reflect upon this already metacognitive process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.353,
    "end": 1728.76,
    "text": "But the resulting experience that we have might not add",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.077,
    "end": 1758.696,
    "text": " too much so i don't know if if it makes sense to say yeah i'm confident about the confidence that i have in my confidence in my confidence and so yes i mean it sounds you know on one hand one could read that as a genuinely vertical recursion on one hand you can also read it as a kind of uh like the way people talk about the fact that a triple bluff is the same as a single bluff you know we might actually just turn our you know turn our heads onto our tails so to speak and end up actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.676,
    "end": 1778.862,
    "text": " experiencing something it's a it's a curious inquiry um someone needs to model that maybe i need to model um yeah just just um what i wanted to say is that i i think it makes a lot of sense for three levels or or um three recursions and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.905,
    "end": 1808.241,
    "text": " above and beyond that i i really don't have a clear intuition and it's probably an empirical question also to what extent it can improve control and um as i said just from the point point of view of experience we we can mentally build further models for the iterations but they might not have a real functional significance for the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.875,
    "end": 1813.422,
    "text": " for the lower order processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.544,
    "end": 1814.764,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.285,
    "end": 1815.526,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.746,
    "end": 1817.149,
    "text": "We will park the self models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.169,
    "end": 1823.762,
    "text": "I had to do it because it's been a bugbear of mine, but we'll get Thomas on and we can all chat out together and see where we end up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1825.485,
    "end": 1830.094,
    "text": "There's a broader question here about the so called generative passage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.631,
    "end": 1843.406,
    "text": " which is this idea that is really nicely articulated in Maxwell Ramsey's 2022 paper and on colleagues, of course, which is this idea that, okay, we kind of have two things that we are trying to balance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.506,
    "end": 1849.433,
    "text": "One is experiential reality, lived experience, and the other are, in some sense, the tools of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.114,
    "end": 1850.695,
    "text": "That's one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.735,
    "end": 1853.618,
    "text": "The other thing could also be, let's say, neurological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.357,
    "end": 1861.572,
    "text": " And Ramseth and colleagues present three forms of what they call the generative passage or this kind of ways of tying those things together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.133,
    "end": 1863.035,
    "text": "One is ontological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1863.556,
    "end": 1866.783,
    "text": "And so that's not necessarily a subscription to reductionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.164,
    "end": 1869.97,
    "text": "It's not necessarily saying that phenomenal reality is ontological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.95,
    "end": 1872.114,
    "text": " neural structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.675,
    "end": 1875.821,
    "text": "But that's one option, whether it's super big, that's that whole conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.362,
    "end": 1886.001,
    "text": "One is epistemological, which is that the kind of tools that we use in our science can be applied fruitfully, or can be used to describe and explain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.981,
    "end": 1888.024,
    "text": " phenomenal reality, lived experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.424,
    "end": 1896.175,
    "text": "And the last one is methodological naturalization, which I think I've been using a little bit more in my own writing, which doesn't really have a commitment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.295,
    "end": 1905.888,
    "text": "It's quite agnostic about ontological epistemological claims and just says, well, we can do some good explanatory work by thinking about Pondy P schema or predictive processing or whatever it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.729,
    "end": 1915.06,
    "text": "But I'm not going to say anything about whether consciousness is these architectures or neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.192,
    "end": 1920.841,
    "text": " I was curious about, I think Thomas, I don't want to speak on his behalf and you'll be able to say better than I do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.861,
    "end": 1924.506,
    "text": "I feel like he's quite materialist or reductive about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.987,
    "end": 1937.807,
    "text": "And at least this is something that came to my attention from Julian Kiverstein when I spoke to Julian on this podcast, who was very keen to reject that reductionism and forefront",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.513,
    "end": 1942.678,
    "text": " intentional experience and forefront lived experience and say that that's irreducible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.078,
    "end": 1946.142,
    "text": "So I was just curious about where you stand on this generative passage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1946.202,
    "end": 1950.306,
    "text": "And I guess the sauciest question is the ontological passage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.549,
    "end": 1953.19,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.81,
    "end": 1954.591,
    "text": "Deep question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.462,
    "end": 1968.267,
    "text": "So first of all, I think different views on this all make sense and are useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.618,
    "end": 1976.787,
    "text": " There's a lot of uncertainty about how different levels of reality relate to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.228,
    "end": 1988.741,
    "text": "And so to some extent, we just have to follow some assumptions that we make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.901,
    "end": 1995.148,
    "text": "And then there will be different views that are compatible with the models and data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.989,
    "end": 1996.69,
    "text": " that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.95,
    "end": 2009.529,
    "text": "So I'm not claiming that we can say, well, we can, obviously we can reduce conscious experience to brain activity or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.69,
    "end": 2023.549,
    "text": "And it's to some extent also an open question for me, what role computational models actually play in explaining conscious experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.47,
    "end": 2028.474,
    "text": " And well, do they play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.836,
    "end": 2041.13,
    "text": "So I think there's, so the, maybe the simple answer, one simple answer is to say, well, consciousness is so puzzling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.17,
    "end": 2052.945,
    "text": "It's so difficult to grasp its different features and talk about what we are experiencing from moment to moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.904,
    "end": 2055.526,
    "text": " It's difficult to put that into words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.728,
    "end": 2062.735,
    "text": "And computational models can help to make certain ideas a bit more precise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.758,
    "end": 2079.536,
    "text": "And this might then just be, in a very simple way, a use of computational models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.596,
    "end": 2082.78,
    "text": "It's not even an explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.452,
    "end": 2089.34,
    "text": " trying to provide a better description of that which we want to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.681,
    "end": 2096.288,
    "text": "What are the properties, the different features of conscious experience that we need to explain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.029,
    "end": 2108.464,
    "text": "And computational models, I think, can very legitimately be used to provide such more detailed descriptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.95,
    "end": 2127.66,
    "text": " And once you have that, you can, of course, then try to make predictions about the implementation in the brain or make predictions about how conscious experience will change in certain situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2127.8,
    "end": 2133.81,
    "text": "Or you can compare to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.55,
    "end": 2145.424,
    "text": " descriptions of conscious experiences that we have to phenomenological reports from persons in altered states of conscious experience and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.584,
    "end": 2161.283,
    "text": "And then at some point you may wonder, well, maybe these computational models provide more than just a metaphor for this, that is useful to describe complex and puzzling features of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.245,
    "end": 2163.426,
    "text": "Maybe they also,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.132,
    "end": 2184.3,
    "text": " point to the mechanisms and go some way towards explaining how conscious experience arises or why it has the features that it has, even if we cannot maybe explain why there is conscious experience in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.383,
    "end": 2194.054,
    "text": "And to the extent that the computational models that are used also neurobiologically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.388,
    "end": 2195.89,
    "text": " at least not implausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.751,
    "end": 2217.215,
    "text": "And we might be able to find some empirical confirmation or to the extent that empirical neuro biological and data from cognitive and cognitive neuroscience are compatible with these models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.677,
    "end": 2222.742,
    "text": "We might be inclined to make stronger claims about the relationship between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.228,
    "end": 2229.735,
    "text": " conscious experience and computational models and neuro biological processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.236,
    "end": 2251.277,
    "text": "And of course, I'm so my I ideally, we'd have very detailed computational models that can be used to describe, predict, and maybe even control many features of conscious experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.017,
    "end": 2264.869,
    "text": " And ideally, we know how they might be implemented in the brain, and therefore have some really have something like a computational explanation or certain features of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.81,
    "end": 2279.762,
    "text": "But I can also understand if some some people might be more hesitant and saying that, though, now that I'm thinking about it, I'm curious, actually, I have to, I guess I have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.535,
    "end": 2285.345,
    "text": " watch the episode with Julian Kivisty because... It's a long one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.766,
    "end": 2286.768,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.131,
    "end": 2293.082,
    "text": "Yeah, I'd be really interested in what exactly his view on these matters is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.102,
    "end": 2295.186,
    "text": "Yeah, we go pretty deep actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.263,
    "end": 2312.719,
    "text": " yes yeah he was very much striking down the line of the uh irreducibility of conscious experience which i don't think is necessarily exact controversial um but he was very you know he was he was being stubborn about that point i don't think he'd be upset if i said that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.699,
    "end": 2314.201,
    "text": " Yes, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.701,
    "end": 2315.582,
    "text": "Okay, good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2316.463,
    "end": 2317.524,
    "text": "We can remain agnostic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.065,
    "end": 2319.867,
    "text": "The hard problem is the hard problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2319.887,
    "end": 2322.53,
    "text": "And unfortunately, it's the most frequent question that I ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.91,
    "end": 2325.913,
    "text": "And no one has solved it for me yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2326.113,
    "end": 2327.395,
    "text": "And I don't think they will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.955,
    "end": 2337.085,
    "text": "So I'm going to ask a kind of what charmers might say is a less hard problem or an easier problem, which is about the features of consciousness, especially as it's lived by us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2338.807,
    "end": 2342.571,
    "text": "Is all consciousness, self consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.234,
    "end": 2347.657,
    "text": " I would say no, it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.837,
    "end": 2356.506,
    "text": "So I'm not an expert on this topic and I haven't read Thomas's new book yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.228,
    "end": 2364.094,
    "text": "But I intend to and hopefully then I will know a bit more about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.474,
    "end": 2372.743,
    "text": "But I take reports from people who claim to have experienced states of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.922,
    "end": 2381.574,
    "text": " non-subjective experience seriously, or I think we should not reject these reports.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.816,
    "end": 2398.422,
    "text": "And I'm definitely open to the possibility and also find the strategy of trying to look at the simplest form of conscious experience, which may not be a form of self-consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.644,
    "end": 2401.026,
    "text": "I find that quite promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.58,
    "end": 2406.587,
    "text": " Yes, so do I. Does this map onto something that I think you've written about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.627,
    "end": 2407.147,
    "text": "Indeed, you have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.629,
    "end": 2411.092,
    "text": "Subject unity and phenomenal unity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.593,
    "end": 2412.855,
    "text": "Is there a link there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.895,
    "end": 2416.579,
    "text": "Well, maybe we can start with what's the difference between subject unity and phenomenal unity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.163,
    "end": 2427.013,
    "text": "Yeah, so that can become quite complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.652,
    "end": 2431.236,
    "text": " So first of all, subject unity can mean different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.356,
    "end": 2443.328,
    "text": "Some people just mean, well, different experiences that are had by a subject are subject unified if they're had by the same subject of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.969,
    "end": 2446.211,
    "text": "Now, what is a subject of experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.092,
    "end": 2451.697,
    "text": "And some people just identify a subject with an organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.078,
    "end": 2457.203,
    "text": "So in that sense, subject unity would not...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.853,
    "end": 2469.344,
    "text": " entail subjective experience or having a, having some form of self-consciousness would just mean subject unity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.744,
    "end": 2477.752,
    "text": "What would that just mean that there's a conscious organism that has different experiences at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.092,
    "end": 2483.718,
    "text": "So, and these are all subject unified in the sense that they are had by the same subject.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.738,
    "end": 2488.523,
    "text": "But of course, if you have a formal self-consciousness, you might say that this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.617,
    "end": 2508.675,
    "text": " different form of subject unity, maybe one in which your you have different self conscious experience or different different conscious experiences that are all forms of self consciousness and somehow refer to the same same self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.096,
    "end": 2511.617,
    "text": "Something along these lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.919,
    "end": 2518.864,
    "text": "Yeah, so what, going back to the kind of notion that all consciousness is self consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.565,
    "end": 2522.468,
    "text": " It goes back to actually what Mr. Kiverstein said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.488,
    "end": 2524.071,
    "text": "So he's got this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.091,
    "end": 2526.094,
    "text": "I think it's a 2018 paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.114,
    "end": 2527.055,
    "text": "I'll double check that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2528.077,
    "end": 2528.678,
    "text": "No, 2020.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2528.878,
    "end": 2532.043,
    "text": "The Free Energy and the Self, an Ecological Inactive Interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.604,
    "end": 2540.056,
    "text": "He says very clearly, he says, in line with the arguments of the phenomenologists, I will claim that every feeling must be felt by someone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.416,
    "end": 2544.042,
    "text": "It must have mind that's built into it if it is to feel a particular way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.562,
    "end": 2571.295,
    "text": " such a it's such a strong claim and again i haven't read thomas's new book but i do kind of understand this perspective because at least for example let's talk about if one was imagining depersonalization it's a depersonalization experience for who right or if you think about someone who's experiencing a psychedelic experience it isn't so much that perspectivalness itself is eliminated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2571.747,
    "end": 2577.233,
    "text": " It's more that one maybe has this more oceanic sense of self, which is dispersive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2577.693,
    "end": 2582.879,
    "text": "But that still arguably is a qualia for the self, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.999,
    "end": 2587.564,
    "text": "Or for the space of awareness that is endowed with perspectivalness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.265,
    "end": 2591.649,
    "text": "So I'm just curious about whether you can think, and again, this is a tricky question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2591.669,
    "end": 2592.41,
    "text": "It's a big question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2592.99,
    "end": 2601.079,
    "text": "And there probably isn't, we can't probably conceive of this at all, but sort of, well, I guess actually the question I'll start with is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2601.785,
    "end": 2608.558,
    "text": " When I learned about consciousness, for example, I learned that there were three fundamental tenets to a conscious experience, qualia, intentionality, and subjectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.96,
    "end": 2612.405,
    "text": "This is what the British schooling system teaches you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.848,
    "end": 2619.979,
    "text": "When I hear Julian speak about, well, you're always going to have that perspectiveness or intentionality, it's always something for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2620.938,
    "end": 2635.118,
    "text": " Can we, you know, is there a way that we could say, okay, some features, at least all those three that I've just picked up are more fundamental than others and that we can have this very, very minimal conscious experience or minimal phenomenal experience, the MPE, another acronym.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.599,
    "end": 2641.647,
    "text": "And what would you say are the defining characteristics of a minimal phenomenal experience therefore?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2645.12,
    "end": 2673.827,
    "text": " yeah i can only say it's an empirical question so we can speculate about what the minimal form of experience might be but it seems that there's a lot going on in ordinary waking experiences that can get lost in altered states of consciousness but what exactly will remain i i i don't know so thomas um can say more about that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.094,
    "end": 2681.224,
    "text": " Is there a problem with relying on phenomenological reports to inform such questions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2684.548,
    "end": 2697.146,
    "text": "Yeah, so to some extent, there's of course the challenge that these reports are given in retrospect and, what do you say, retrospect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.166,
    "end": 2699.629,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.588,
    "end": 2711.444,
    "text": " then some people say, well, it's a bit paradoxical if you say you have had an experience in which you were not present or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2712.886,
    "end": 2729.97,
    "text": "And one, of course, the mere fact that you can remember such experiences doesn't mean that you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.372,
    "end": 2736.982,
    "text": " you must have had a form of self-consciousness or that there must have been subjectivity in the experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.883,
    "end": 2749.159,
    "text": "And also when people say, well, I realized that I had not been there, that there was no sense of self or no form of self consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.381,
    "end": 2760.075,
    "text": "I realized that when I, when I transitioned, transitioned into, um, the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.646,
    "end": 2763.271,
    "text": " ordinary form of conscious experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.451,
    "end": 2776.073,
    "text": "So while, as it were, the self was returning, I realized, hey, there's something additional coming to my conscious experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.874,
    "end": 2780.581,
    "text": "So it could not have been there before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.601,
    "end": 2784.207,
    "text": "Yeah, that's, that's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.402,
    "end": 2812.827,
    "text": " yeah i guess it makes me think you know um to even have those reports whether that's in the internal speech or external reports requires propositional language and in my conceptualization of the scale of phenomenal self-modeling propositional language is super high up in the epistemic agent it's the way that we plan it's the way that we reflect on our own being and so on and it sometimes makes me think well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2813.38,
    "end": 2825.589,
    "text": " Is there a bias, therefore, when we don't have the capacity for propositional claims, either internally or externally, we're biased to think that that constitutes some form of self-annihilation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.23,
    "end": 2830.039,
    "text": "And the reason why I think that is because testimonies, for example, about flow states,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.019,
    "end": 2856.651,
    "text": " they'll say at least the testimonies won't be as concrete as this but the researchers interpretations which are problematic will say the self disappeared or there was there was a reduced self-awareness that's probably a weaker form of that claim well i think the all that we're really coming to here is that you just need to get a lot more particular about what part of the self model you're talking about and how it's been attenuated or accentuated um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2856.985,
    "end": 2863.552,
    "text": " And actually, I think hopefully for the listeners, what they're kind of gathering is the self is not this kind of single monolithic thing that we take it to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2863.592,
    "end": 2867.216,
    "text": "And maybe that's the influence of Descartes and the tradition that followed from him.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.236,
    "end": 2880.951,
    "text": "But rather, it's a complex hierarchical appearance in many ways, but also potentially an underlying data structure that will oscillate and modulate and change given different contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.606,
    "end": 2881.886,
    "text": " Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.407,
    "end": 2889.296,
    "text": "Let's take that a little bit more now into just sort of... Maybe just one thing to make it slightly more concrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.356,
    "end": 2900.131,
    "text": "So what is, I think, very plausible is to assume that a sense of temporal self-location can get lost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.211,
    "end": 2906.72,
    "text": "So you can have conscious experiences in which there's no time, no temporal experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2907.481,
    "end": 2909.183,
    "text": "You don't experience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.517,
    "end": 2934.31,
    "text": " any now as it were or maybe only now but not as distinguished from future and past and then experiences in which you're not identifying yourself with some place in space so there's no spatial self-location and if i understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.526,
    "end": 2956.52,
    "text": " Thomas correctly, he would suggest that in such minimal phenomenal experience, there certain some potential for certain control processes is still experienced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.361,
    "end": 2961.107,
    "text": "So I mean, maybe we can try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.425,
    "end": 2963.188,
    "text": " illustrate this with attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.208,
    "end": 2977.808,
    "text": "So you can either be in the process of controlling or changing your attention, and have the experience of being in control, having an experience of attentional agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.671,
    "end": 2990.847,
    "text": "And you but you can also have a sense of control of the potential for changing your focus of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.987,
    "end": 2991.027,
    "text": "So"
  },
  {
    "start": 2991.749,
    "end": 3020.17,
    "text": " you know now you're fixating focusing your attention on something or maybe on my voice but you are aware of the fact that you could shift your focus of attention and this is so this potential aspect might be something that in one form or the other could still be present in a minimal phenomenal experience and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.96,
    "end": 3026.428,
    "text": " Thomas can probably describe this more eloquently and in more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.23,
    "end": 3032.458,
    "text": "It also makes me think, what are the prerequisites for attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.9,
    "end": 3039.548,
    "text": "It makes me think that something like temporality or just some dynamic needs to be there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.609,
    "end": 3043.014,
    "text": "Because how are you going to go from one thing to the other without it being over time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.474,
    "end": 3045.818,
    "text": "Which also makes me think there might have to be also over space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.681,
    "end": 3048.402,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3048.82,
    "end": 3072.6,
    "text": " guess we also have covert you know mental attention or covert attention mental attention whether that's going through some space is kind of depends on how you define space that's a really interesting question i guess yeah there's a there's a nice link there you could say okay i've got a function that remains in the minimal phenomenal experience but let me think also about what the necessary features of the experience or the world would have to be for me to have that function",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.002,
    "end": 3081.032,
    "text": " Um, yeah, it makes me think of these, um, so-called pure consciousness events, uh, which I came to know about through John Viveky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.072,
    "end": 3093.689,
    "text": "And he sort of describes how in these pure conscious events, um, so-called adjectival qualia, redness, blueness, sweetness disappear, um, equals adverbial qualia remain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.53,
    "end": 3097.153,
    "text": "And by that, he means now on us here in us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3098.213,
    "end": 3100.537,
    "text": " presentness, whatever, you know, perspectivalness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.117,
    "end": 3102.94,
    "text": "And maybe that's a nice road in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.96,
    "end": 3106.926,
    "text": "But yeah, I will probe that with Mr. Metzinger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.748,
    "end": 3113.556,
    "text": "Well, I've read your papers before and I read them again because I think they're so wonderful and interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.897,
    "end": 3115.6,
    "text": "You have these two with Carl, which I love.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.08,
    "end": 3125.014,
    "text": "And in one of them, you talk about sort of life-mind continuity, which I've also been getting really into because I've been reading my Evan Thompson book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3125.197,
    "end": 3140.515,
    "text": " And in addition to sort of life and mind distinction, you also have a distinction between basic minds and non-basic minds, which I think is important as a prior thing to understand before we get into a sort of life-mind continuity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.036,
    "end": 3146.182,
    "text": "So at just a very basic level, what would you say is the distinction between a basic mind and a non-basic mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3148.665,
    "end": 3155.153,
    "text": "Yeah, so if I remember correctly, I think we mainly make this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.69,
    "end": 3158.753,
    "text": " distinction in terms of representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.833,
    "end": 3169.825,
    "text": "So a basic mind would be one that does not have representations and a non basic mind is one that has representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.666,
    "end": 3170.866,
    "text": "Good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.147,
    "end": 3172.128,
    "text": "And how does that feed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3172.168,
    "end": 3173.129,
    "text": "So how does that fit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3173.209,
    "end": 3180.617,
    "text": "So when Evan Thompson was talking about mind and life continuity, he was kind of seeking underlying",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.682,
    "end": 3187.571,
    "text": " functions, structures, processes that are involved both in the constitution of mind and life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.611,
    "end": 3194.279,
    "text": "So for example, autopoiesis, self-organization, or what else would he have had?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3194.819,
    "end": 3195.781,
    "text": "Operational closure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3196.261,
    "end": 3200.567,
    "text": "These are all things that were coming out of the dynamical systems theory and Varela's work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3200.587,
    "end": 3201.728,
    "text": "And now we've got active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3202.248,
    "end": 3214.328,
    "text": " So I was wondering whether, how does active inference, because I think at one point you say in that paper, I won't misspeak, I think I've got the quote here, all systems possessing a Markov blanket have properties that are relevant for understanding the mind and consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.989,
    "end": 3222.502,
    "text": "If such systems have mental properties, then they can have them partly by virtue of possessing a Markov blanket, and hence your Markovian monism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.043,
    "end": 3227.31,
    "text": "This is, I think, this is the 2020 paper, so not the Life Mind one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.29,
    "end": 3241.329,
    "text": " But it calls to mind a sort of life-mind continuity because active inference postulates anything that exists has a Markov blanket, and it can be seen as if it's parametricizing Bayesian beliefs about the external state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3241.349,
    "end": 3245.475,
    "text": "So everything has a Markov blanket, anything that we can call a thing has a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.495,
    "end": 3249.2,
    "text": "And as you say, anything having a Markov blanket properties are relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.24,
    "end": 3252.184,
    "text": "And I think you've been very careful with your words here for understanding mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.957,
    "end": 3255.34,
    "text": " Why would that be the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.64,
    "end": 3261.626,
    "text": "And also, how is that the case without us resorting to a sort of panpsychism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.088,
    "end": 3280.787,
    "text": "Yeah, that's a good question and really a fair question because I think what we say in that paper can easily be misunderstood and maybe we should have found a better way of conveying what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.341,
    "end": 3284.865,
    "text": " Or I should have found a better way of conveying what I had in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.965,
    "end": 3294.655,
    "text": "So the idea is not that as soon as you have a Markov blanket, you have a mind and it just becomes more complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.177,
    "end": 3307.169,
    "text": "The idea is more that as soon as you have the Markov blanket of your self-organizing system, which conforms to the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.629,
    "end": 3310.032,
    "text": "So there's a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.838,
    "end": 3324.296,
    "text": " And then you can interpret internal states as encoding probabilistic beliefs about external states given blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.458,
    "end": 3332.928,
    "text": "And this is the feature that is also relevant to understanding, I would claim, the mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.889,
    "end": 3339.917,
    "text": "It does not mean that once you have that, you already have a mind in an interesting sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.235,
    "end": 3363.272,
    "text": " But it's just that if you have a mind, then you can describe, you can understand, I would say, mental processes in terms of minimizing variation-free energy and understand them in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.8,
    "end": 3372.967,
    "text": " in terms of computational processes that involve these probabilistic beliefs about external states given blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.728,
    "end": 3385.239,
    "text": "And so what I really wanted to say is that this is not something that comes at a later stage when we have really complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.36,
    "end": 3391.926,
    "text": "But according to the free energy principle, we already have that for very simple self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.699,
    "end": 3421.525,
    "text": " so to contrast this with um inactive approaches that would say well we have these simple systems and they are still there they can be quite autonomous and so on and remarkable and so remarkable in fact that even higher even non-basic minds and in a different sense or maybe i shouldn't say non-basically but so even more complex",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.197,
    "end": 3446.837,
    "text": " systems, complex organisms like us that have minds, many of their properties can be explained, many of their mental properties can be explained by reference to the same dynamics and features that are already present in simple autonomous systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.762,
    "end": 3454.332,
    "text": " And maybe you don't even need to invoke representations to explain these more complex organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.394,
    "end": 3469.656,
    "text": "And I'm suggesting, well, no, because you already have some form of as if representationality or intentionality and even simple self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.799,
    "end": 3475.845,
    "text": "And this as if representationality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.698,
    "end": 3496.706,
    "text": " can then, or you can, making some further assumption, you can argue that in more complex systems, it's not just a useful way of describing them as if they had representations, but they actually have representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.008,
    "end": 3506.22,
    "text": "And so there's something in simple self-organizing systems that's already there, that's also there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.297,
    "end": 3511.783,
    "text": " in more complex organisms that have a mind and consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.224,
    "end": 3533.832,
    "text": "And in order to understand the mind, to the extent that the free energy principle and active inference are useful to understanding the mind, we have to refer to these internal states and how they encode beliefs about external states given blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.373,
    "end": 3536.055,
    "text": "And that's something we already have in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.407,
    "end": 3538.25,
    "text": " very simple self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.81,
    "end": 3547.743,
    "text": "So that's just the idea, which I think, if described in the way in which we did, can be really misleading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.784,
    "end": 3552.671,
    "text": "And I hope this also suggests how it avoids panpsychism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.412,
    "end": 3555.715,
    "text": "But if not, I'm happy to elaborate on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.88,
    "end": 3556.481,
    "text": " No, I think so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.543,
    "end": 3559.506,
    "text": "And to be fair, you make it actually pretty clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3560.307,
    "end": 3563.873,
    "text": "You say that you sort of propose some rhetorical questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.953,
    "end": 3566.397,
    "text": "Does it follow that all systems with a mark of blank have a mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3567.038,
    "end": 3568.28,
    "text": "Are such systems conscious?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3568.901,
    "end": 3570.964,
    "text": "This formalism itself does not answer these questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3571.405,
    "end": 3573.348,
    "text": "So I think you're fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3573.689,
    "end": 3574.53,
    "text": "I think...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.51,
    "end": 3595.708,
    "text": " uh maybe what people might be slightly confused over is this notion of an information geometry if they've ever read this paper so the way that i understood it was you have sort of two informational geometries let's say two ways of uh describing a um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.498,
    "end": 3600.048,
    "text": " a system that has a Markov blanket internal and external states, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.068,
    "end": 3601.051,
    "text": "That coupled system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3601.914,
    "end": 3609.917,
    "text": "And you have the so-called intrinsic geometry, which actually just describes the behavior of the internal state if it, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.808,
    "end": 3614.413,
    "text": " I'll ask whether that includes the particular states, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.533,
    "end": 3615.334,
    "text": "the blanket states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.055,
    "end": 3624.065,
    "text": "And then you have the so-called extrinsic geometry, which are the beliefs that the internal states actually encode about the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3624.085,
    "end": 3629.753,
    "text": "So that's a very rough draw after the distinction between the intrinsic geometry and the extrinsic geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.773,
    "end": 3631.715,
    "text": "It would be great if you could flesh that out a little bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.176,
    "end": 3635.5,
    "text": "But how does that pertain here to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.02,
    "end": 3645.17,
    "text": " mind, because I think you also make it quite clear that that property of the Markov blanketed system itself is relevant to the question of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3647.673,
    "end": 3655.022,
    "text": "Yes, so it is in a sense relevant, but I would say in a rather trivial way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3655.142,
    "end": 3660.788,
    "text": "So yeah, I think this can be really confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.928,
    "end": 3664.272,
    "text": "I'm not sure how useful it is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.652,
    "end": 3671.779,
    "text": " even refer to information geometry to get at these more general conceptual points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.44,
    "end": 3694.765,
    "text": "But so an information geometry is just, you have a space in which every point corresponds to a probability distribution, and then you can, um, you can have different shapes and, um, many falls in, in this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3695.116,
    "end": 3704.784,
    "text": " space, or for example, surfaces, and compute distances between points, distances between probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.665,
    "end": 3709.268,
    "text": "And these distances will not be Euclidean distances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3709.288,
    "end": 3716.415,
    "text": "So it's just a different kind of space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.496,
    "end": 3724.802,
    "text": "And so the internal states, if you interpret them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.272,
    "end": 3734.946,
    "text": " probabilistic beliefs about external states given blanket states, you can identify them with points in the information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.727,
    "end": 3747.183,
    "text": "And then the way in which these beliefs are updated and which they change can then be described as a trajectory through that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.345,
    "end": 3754.013,
    "text": "And you also have a different space of probability distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.718,
    "end": 3759.803,
    "text": " for what one could call the physical dynamics of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.863,
    "end": 3784.506,
    "text": "So if you're not referring to probability distributions encoded by internal states, but about the probabilities of internal states, or maybe paths, then you can also identify them with points in such a space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.482,
    "end": 3793.673,
    "text": " space of probability distributions, but it's a different, these are different probability distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.534,
    "end": 3801.283,
    "text": "And the thing just is that you can then describe trajectories through both of these information geometries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.503,
    "end": 3808.232,
    "text": "And in a way they are two sides of two different sides of the same coin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.853,
    "end": 3811.236,
    "text": "So the idea is that you can describe the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.296,
    "end": 3841.982,
    "text": " physical dynamics of these self-organizing systems equivalently by describing them in terms of the dynamics, the belief dynamics of Bayesian mechanics in terms of changes of probability distributions encoded by internal states rather than in terms of probability distributions over states of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.62,
    "end": 3843.941,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3843.961,
    "end": 3844.162,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3844.542,
    "end": 3863.182,
    "text": "So I think the reason why this might be a bit confusing for people is because then people have heard that all that we're talking about, when we talk about internal states, is this parametrized, if that's the word, beliefs about external states, that's all the internal states are, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.622,
    "end": 3866.245,
    "text": "They just are probably distributions over external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3867.406,
    "end": 3869.168,
    "text": "Okay, so that might",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3869.452,
    "end": 3874.157,
    "text": " be a commitment, an ontological commitment to say that, but let's take that as a kind of starting point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.177,
    "end": 3876.259,
    "text": "That's what we mean by internal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3876.279,
    "end": 3883.466,
    "text": "And then we have an intrinsic geometry, which is mapping the evolution of those beliefs, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3884.467,
    "end": 3885.588,
    "text": "And that's over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3887.771,
    "end": 3896.86,
    "text": "But given that those beliefs just are over the external states, is there not an isomorphism between the intrinsic and the extrinsic insofar as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3897.38,
    "end": 3899.182,
    "text": " When the intrinsic changes, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3899.242,
    "end": 3917.165,
    "text": "when the path of the state of the internal states changes, by necessity, the extrinsic information geometry would have changed because the internal states just are the probabilistic distributions that the extrinsic geometry defines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3918.407,
    "end": 3922.712,
    "text": "So for me, I can't right now see how there's a... I say they're isomorphic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.654,
    "end": 3927.581,
    "text": " I almost think, well, I almost can't see how they're not one and the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3929.364,
    "end": 3930.346,
    "text": "But I might be missing something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3930.547,
    "end": 3931.168,
    "text": "I probably am.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.228,
    "end": 3934.333,
    "text": "I'm always missing something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.354,
    "end": 3938.0,
    "text": "No, I think you're on the right track.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.281,
    "end": 3946.135,
    "text": "So there, yeah, essentially, just two different ways of describing the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3946.84,
    "end": 3951.971,
    "text": " But OK, so what is the utility of that, I guess, is the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.071,
    "end": 3963.195,
    "text": "Because to me, it seems like just a very philosophy of science point, the utility of two different descriptions of the same phenomenon",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3963.665,
    "end": 3987.9,
    "text": " it has to have some utility right like if we're talking about heat let's talk about how it feels to be hot or i can talk about the velocity of particles within a heat bath or within whatever but that's useful because one i can attend to phenomenological facts and the other one i can tend to facts about physics whereas this it just seems like prima facie there are two distinct descriptions but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.1,
    "end": 4002.417,
    "text": " under the blanket, because the internal states really just are probability distributions about external states, there's nothing over and above their evolution beyond that which can be described by the intrinsic information geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4003.318,
    "end": 4010.066,
    "text": "So is there something more to these two types of descriptions which make them distinct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4011.047,
    "end": 4012.369,
    "text": "Or is it just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.851,
    "end": 4014.572,
    "text": " Semantics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.313,
    "end": 4018.378,
    "text": "I don't want to say that because that always sounds very derogatory, and I don't mean to be derogatory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4020.922,
    "end": 4029.896,
    "text": "Yeah, so on the one hand, one could say, yeah, and to some extent, it's just semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.116,
    "end": 4036.306,
    "text": "But that doesn't mean that it's not useful to use one instead of the other description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.426,
    "end": 4041.073,
    "text": "So think about describing a system in terms of representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.032,
    "end": 4048.16,
    "text": " So you can, of course, just describe the vehicles without referring to the content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.581,
    "end": 4061.098,
    "text": "And so you're dispensing with the representational description and just focusing on the physical material realizers of the representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.398,
    "end": 4063.561,
    "text": "And that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.861,
    "end": 4068.107,
    "text": "But you typically get some benefit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.235,
    "end": 4071.698,
    "text": " going to a different level of description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.938,
    "end": 4090.901,
    "text": "So when you're describing a system in terms of representations you have, you can refer to contents, provide a normative description, so the system can have true or false representations, or they can be more or less accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.321,
    "end": 4096.187,
    "text": "And you also have that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.927,
    "end": 4101.775,
    "text": " for the Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.036,
    "end": 4105.301,
    "text": "So in a way, it's just a different way of describing the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.381,
    "end": 4106.403,
    "text": "And you don't need that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.744,
    "end": 4108.426,
    "text": "You can describe the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.486,
    "end": 4120.707,
    "text": "You can stick to your purely physical description and don't need to refer to probabilistic beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.378,
    "end": 4124.521,
    "text": " But this gives you some benefits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.882,
    "end": 4150.288,
    "text": "On the one hand, it reduces complexity because when you're referring to internal states as encoding probabilistic beliefs, you're actually coarse-graining the system and not just talking about, say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.078,
    "end": 4157.707,
    "text": " billions of neurons, but about neural populations that encode different beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.987,
    "end": 4163.214,
    "text": "And so you can reduce the complexity of your description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.815,
    "end": 4180.917,
    "text": "But still, given that, if the free energy principle is correct, you have an equivalent description, it can still be as accurate or almost as accurate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.268,
    "end": 4186.535,
    "text": " but without having to deal with all the unnecessary details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.717,
    "end": 4191.622,
    "text": "So that's one benefit that you get, just a reduction of complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.825,
    "end": 4194.086,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.287,
    "end": 4197.891,
    "text": "I sense that that's a reduction of complexity for the scientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.991,
    "end": 4208.105,
    "text": "I guess really you very much put it nicely in terms of the distinction between the vehicle and the content, which certainly pertains when we're talking about representational systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4208.626,
    "end": 4210.448,
    "text": "I guess my point really here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.525,
    "end": 4216.651,
    "text": " I arguably think that there is no vehicle, the internal state is not a vehicle of anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4217.031,
    "end": 4223.218,
    "text": "And I think this really comes down to actually how you describe it, because the way you describe it is that they encode probabilistic beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.238,
    "end": 4227.362,
    "text": "Whereas I think if you're abandoning the vehicle, you can just say they are probabilistic beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4228.143,
    "end": 4238.815,
    "text": "And if I think if you have the... Sorry, so then it seems like you're dispensing with the physical, purely physical description, and just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4239.301,
    "end": 4243.187,
    "text": " happy to say, well, we only need the Bayesian mechanics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.189,
    "end": 4253.745,
    "text": "I would just say that we are sometimes misled to think that active inference entails a representational approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4254.486,
    "end": 4257.852,
    "text": "And yeah, you can do the descriptions in terms of the Bayesian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4258.673,
    "end": 4263.621,
    "text": "That itself will map onto some physical organisation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4264.883,
    "end": 4267.846,
    "text": " But I don't think it necessarily dispenses with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4268.567,
    "end": 4280.359,
    "text": "It just says that when we as scientists try to carve up these spaces, we are making, well, we are making these very strong distinctions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4280.84,
    "end": 4290.79,
    "text": "And this is something that I've been tackling with literally ever since I discovered active inference and learned about the free energy principle, which is what is unique about the internal states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4291.883,
    "end": 4300.594,
    "text": " Is there something over and above the parametrization of beliefs about external states that are in the internal states that make the thing the thing it is?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4301.335,
    "end": 4307.644,
    "text": "I.e., is all that we are preferred external states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4309.266,
    "end": 4316.355,
    "text": "Or are we a thing that is trying to get to preferred external states, if you can see the difference there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4316.926,
    "end": 4321.47,
    "text": " So I think that, again, comes back to whether we embody a generative model or have a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4321.911,
    "end": 4327.936,
    "text": "And I think I've been leaning in terms of the, just in terms of the physics, towards the idea that we embody a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4327.956,
    "end": 4330.639,
    "text": "All that means is that we are just a bundle of external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4331.76,
    "end": 4340.328,
    "text": "And you can describe the direction, the information travel of those external states in terms of Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4341.048,
    "end": 4346.173,
    "text": "But the internal external distinction is somewhat illusory, because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.47,
    "end": 4349.893,
    "text": " we just are the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4350.554,
    "end": 4352.076,
    "text": "Might sound very sort of Buddhist, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4352.297,
    "end": 4365.174,
    "text": "But yeah, I think maybe that's where we don't necessarily, we're not disagreeing, but maybe where I don't really see the strength of this distinction, because I don't really see the strength of the distinction between the internal and the external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4365.735,
    "end": 4368.278,
    "text": "And arguably, I just see it as an instrumental tool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.219,
    "end": 4370.341,
    "text": "I don't know if that answers your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4372.664,
    "end": 4373.705,
    "text": "Yeah, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.989,
    "end": 4376.329,
    "text": "That's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.748,
    "end": 4381.837,
    "text": " Good point also speaks to what we talked about in the beginning, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.218,
    "end": 4390.553,
    "text": "To what extent there's a factor, the matter whether something is internal or external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.698,
    "end": 4397.946,
    "text": "Yeah, I just think a big mistake that people well, I think a big stumbling block that people have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4398.668,
    "end": 4410.789,
    "text": " although it may also paradoxically be a very useful tool for them, is to think of active inference, and this is more like a meta conversation about how we get educated on these things, think of active inference as a theory that needs a homunculus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4411.951,
    "end": 4420.045,
    "text": "And I'd argue that it's not, but then you have to be very concrete on the fact that the free energy principle and active inference is a theory of physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.187,
    "end": 4423.731,
    "text": "And it's just describing...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4424.74,
    "end": 4429.586,
    "text": " physical manifolds, well, not even physical manifolds, statistical manifolds, whether they're physical, mental, so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4430.547,
    "end": 4437.335,
    "text": "And that, I think, gets you away from the kind of more homunculized predictive coding, predictive processing approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.896,
    "end": 4441.741,
    "text": "And so again, I mean, ultimately, I think it comes down to one's aims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4441.801,
    "end": 4445.526,
    "text": "And I think as far as I'm aware, the math stands up on both fronts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.827,
    "end": 4450.832,
    "text": "And maybe it's a question I need to speak to Karl about, which is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.757,
    "end": 4455.143,
    "text": " So the free energy principle rests upon the Markov blanket distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.086,
    "end": 4466.382,
    "text": "Why do we not just have one unified state space where different things are tending towards different manifolds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.482,
    "end": 4469.547,
    "text": "Why do we need them to be tending towards those manifolds?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4470.32,
    "end": 4473.784,
    "text": " over the parametricization of external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4473.844,
    "end": 4482.213,
    "text": "And I think here the really important point is, and we've come back to it over and over again on this podcast, the free energy principle tells you what things look like they're doing, not necessarily what they are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4482.974,
    "end": 4490.602,
    "text": "And maybe that deflates, to use Carl's favorite word, it deflates some of our worries about really making a strong ontological claim, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4490.642,
    "end": 4491.963,
    "text": "It's just a descriptive thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.984,
    "end": 4495.407,
    "text": "Then that makes me think, well, what's the point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.447,
    "end": 4497.309,
    "text": "But I don't think what's the point, because I think it's important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.349,
    "end": 4500.192,
    "text": "And I think you do get some good stuff out of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4500.661,
    "end": 4523.547,
    "text": " so yeah that's just one thing i would like to add so um that i think there's one perspective one from which we what one can argue that it's not completely arbitrary whether we say we interpret or we describe internal states as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.965,
    "end": 4541.053,
    "text": " probabilistic beliefs and identify them with these beliefs and just focus on this or whether we also think about the other perspective or the way of describing the dynamics of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4541.914,
    "end": 4549.787,
    "text": "Because the same Bayesian mechanics, the same dynamics of belief can be realized in different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.543,
    "end": 4558.637,
    "text": " So you can simulate this on a computer or you can implement it in a living organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.758,
    "end": 4568.333,
    "text": "And I think when we consider the possibility of artificial consciousness, this actually may make a difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.375,
    "end": 4576.146,
    "text": "Because if we're just focusing on the, if we're just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.497,
    "end": 4593.033,
    "text": " seeing internal states as probabilistic beliefs and nothing else, then we cannot make this distinction between different types, different kinds of realizations of variation of free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.214,
    "end": 4604.344,
    "text": "And I think it's an open question and very important question to what extent there can be a conscious experience in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.235,
    "end": 4633.2,
    "text": " computer and a digital computer with a classical architecture or to what extent it needs a biological body or maybe a robot that can interact with the environment and for for this reason i think it's important to keep this to yeah not not to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.906,
    "end": 4658.31,
    "text": " um ignore this distinction between two ways of looking at the system yeah fair enough i guess uh ultimately as well something i do think is important to say is that it depends on how you define beliefs um and that's something that we all like not me and you necessarily but all of us equivocate on the whole time because we're not clear where we're talking about folk psychology beliefs or bayesian beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4658.729,
    "end": 4668.962,
    "text": " And I guess when I'm talking about the internal states just being manifestations of external states, I'm talking about Bayesian beliefs in terms of the beliefs that those internal states have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4668.982,
    "end": 4678.514,
    "text": "When I'm talking about the rejection of the homunculized view of the internal states, in many ways I'm rejecting, I'm not rejecting the Bayesian beliefs that they have or embody or entail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4678.755,
    "end": 4684.382,
    "text": "So I'm rejecting the folk psychology, homuncularized, representational beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4684.447,
    "end": 4686.39,
    "text": " propositional beliefs that we talk about in philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4686.77,
    "end": 4694.221,
    "text": "So I think that's an important thing as well for people to bear in mind that there's often risk in active inference that we equivocate and talk past one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4694.702,
    "end": 4701.072,
    "text": "Again, not you and I generally, but everyone, because we don't get concrete on what we're talking about with respect to beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4701.632,
    "end": 4708.783,
    "text": "But that's a nice, interesting segue because you wrote this paper in 2022 with Carl on AI ethics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.763,
    "end": 4727.413,
    "text": " in computational psychiatry and it actually takes us nicely full circle to mr metzinger professor metzinger's me um because he actually was the first person i ever read in the ego tunnel talking quite explicitly about the ethics of generating artificial intelligence like re in a very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4727.984,
    "end": 4729.306,
    "text": " philosophically robust way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.547,
    "end": 4740.707,
    "text": "Obviously, people have been talking about what were the ethics in terms of job opportunities in terms of, you know, trolley problems when my car might run over a grandmother or a child and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4740.988,
    "end": 4747.92,
    "text": "But I think what Thomas said that was really impactful for me was, we might be actually creating conscious life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4748.281,
    "end": 4752.068,
    "text": "So it's not just the, you know, it's not just the ethical effects on us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.807,
    "end": 4763.02,
    "text": " it's actually the generation of sentience, feeling, consciousness into the universe, an uptick in that, whereby those things start to actually have moral value",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4763.236,
    "end": 4770.669,
    "text": " which are arguably equivalent or perhaps given their greater complexity and depending on how you define your morality, more important than us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4771.19,
    "end": 4777.08,
    "text": "So you can throw out the window your kind of classic Sam Harris worry that AI is just going to stomp on us like we're ants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4777.641,
    "end": 4779.524,
    "text": "That's one ethical issue about us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.625,
    "end": 4784.974,
    "text": "But also, and again, I don't mean that this should happen or will happen, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4785.14,
    "end": 4802.676,
    "text": " arguably you know those ai creatures are gonna have sentience and feelings and consciousness just like us and we have to take their so you know rights or values if they have them if we give them that into account so it's not just a single-sided relationship that's going to emerge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4802.656,
    "end": 4804.237,
    "text": " I'm curious about what you think about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.458,
    "end": 4816.749,
    "text": "Is it a concern that we really have to take seriously that if, for example, we end up making AGI and very importantly, that AGI is conscious, because I think there's a really important point that there's a difference here between intelligence and consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.611,
    "end": 4822.955,
    "text": "What concerns do we have to have not only about ourselves, but also about what we are bringing into the world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4824.616,
    "end": 4832.123,
    "text": "Yeah, I think there are many different and to some extent related questions that are relevant here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.761,
    "end": 4840.531,
    "text": " And one question is, of course, what about the risk of actually creating artificial consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.632,
    "end": 4843.655,
    "text": "What consequences would that have?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.796,
    "end": 4854.148,
    "text": "And should we do it or should we refrain from even attempting to create artificial consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.149,
    "end": 4861.097,
    "text": "And things become more complicated when we also consider the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4862.107,
    "end": 4869.237,
    "text": " there will likely be a lot of uncertainty about whether a given artificial system is conscious or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4869.958,
    "end": 4876.267,
    "text": "So Eric Schwitzgabel has done a lot of very relevant and interesting work on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.288,
    "end": 4881.334,
    "text": "And he describes the problem roughly as follows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.974,
    "end": 4887.422,
    "text": "I'll try to summarize the main ideas, but there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4888.162,
    "end": 4896.616,
    "text": " People who are interested in this can easily find his publications and podcast interviews with Eric Schwitzgabel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4897.738,
    "end": 4902.245,
    "text": "I highly recommend looking these things up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.545,
    "end": 4905.831,
    "text": "The basic problem is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.594,
    "end": 4914.625,
    "text": "There might be situations in which there are artificial systems that may",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.381,
    "end": 4943.278,
    "text": " seem to be conscious and we might in addition also have no way of being certain that they are not conscious so there might be no clear evidence as to whether they are conscious or not even from a scientific point of view given that we don't have a consensus in consciousness science we don't really know what consciousness is there's no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4943.967,
    "end": 4952.535,
    "text": " generally agreed upon theory of consciousness and so on, and many different metaphysical views about consciousness that all have some currency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.356,
    "end": 4959.062,
    "text": "So there's a lot of uncertainty about which systems could be conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.483,
    "end": 4971.814,
    "text": "And as artificial systems become more and more capable and have more and more impressive capabilities,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4972.283,
    "end": 4986.624,
    "text": " cognitive capacities, there will likely be points at which they will seem conscious and also fulfill some indicators of consciousness that we might have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.046,
    "end": 4995.957,
    "text": "But they might still be quite different from human beings, conscious human beings or other conscious animals in many respects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.738,
    "end": 5002.206,
    "text": "So that there will be a lot of uncertainty and there are two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.81,
    "end": 5032.8,
    "text": " types of errors that one could make one is believing that such systems are conscious and maybe also believing that they therefore deserve a moral status maybe because they can feel pain and pleasure um so assigning a moral status to such systems believing that they're conscious although in fact there's nothing going on they're completely unconscious and then there might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.067,
    "end": 5044.039,
    "text": " situations in which we have to make trade offs between the interests of human beings, conscious human beings, and the seemingly conscious artificial systems, which are in fact unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.88,
    "end": 5059.497,
    "text": "So just, if we just think about, uh, um, I mean, just, just, uh, as a slightly silly example, trolley case in which we, we, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.932,
    "end": 5067.363,
    "text": " can save five artificial systems that we believe are conscious, or one conscious human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5068.224,
    "end": 5089.855,
    "text": "And of course, if these systems actually are unconscious, but we just think, well, we should be better safe than sorry, we should not, we should just err on the side of being a bit too liberal, then we might say it would be a good idea to save the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.628,
    "end": 5100.336,
    "text": " the artificial systems, or in other situations in general, just put more weight on their interests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5102.418,
    "end": 5106.762,
    "text": "And in fact, they're completely unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.142,
    "end": 5113.087,
    "text": "And yeah, so that would be, I think, a- Yeah, that's a terrifying idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5113.387,
    "end": 5113.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5114.588,
    "end": 5120.213,
    "text": "And of course, the other case is that the artificial systems that don't seem to be conscious,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5120.783,
    "end": 5148.478,
    "text": " and we firmly believe or we um maybe there's also some uncertainty but um for whatever reason we decide no um these systems are probably not conscious maybe because they don't seem to be conscious but actually they are conscious and then in certain situations we might without thinking much about it sacrifice them or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.302,
    "end": 5163.597,
    "text": " destroy them or whatever, and in fact maybe induce a lot of suffering in these artificial systems, but without knowing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.478,
    "end": 5172.407,
    "text": "So these are two scenarios that we, I think, would like to avoid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.079,
    "end": 5186.797,
    "text": " And Schwitzgeber certainly argues for this, that we should avoid such situations, namely by avoiding to create systems for which there's no certainty about whether they're conscious or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.119,
    "end": 5194.808,
    "text": "And so this is not, it's a bit different from Metzinger's position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.151,
    "end": 5200.656,
    "text": "And the question, of course, is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5201.193,
    "end": 5230.812,
    "text": " is this really feasible or is it realistic that we will in the future only create systems that are either clearly non-conscious or that are clearly conscious and i think in order to get there it would be really useful um to have a handle on some necessary conditions for consciousness that might not be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.45,
    "end": 5234.815,
    "text": " fulfilled by certain classes of artificial systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.616,
    "end": 5244.228,
    "text": "And if, for instance, having a body is required for being conscious, then we could rule out that there's consciousness and a computer simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.309,
    "end": 5249.475,
    "text": "So I'm not claiming that I have a good argument for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.635,
    "end": 5257.947,
    "text": "But it's, I think it's would be extremely desirable to have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.298,
    "end": 5266.166,
    "text": " justified account of necessary conditions for consciousness that are not fulfilled by many artificial systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.107,
    "end": 5282.161,
    "text": "And so that's the line of research that I'm trying to pursue of finding good reasons to believe that there are certain necessary conditions for consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5282.642,
    "end": 5287.967,
    "text": "Of course, the other approach which I must say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5288.234,
    "end": 5316.165,
    "text": " from from a certain point of view seems a lot more compelling is to say well we don't really know what is necessary for consciousness or not we cannot rule out that certain systems are conscious if they don't fulfill certain conditions but we can look at theories of consciousness we can look at work on animal consciousness and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5316.871,
    "end": 5319.174,
    "text": " derive indicators for consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5320.296,
    "end": 5333.114,
    "text": "And that's this preprint from last year by Patrick Butlin, Robert Long, and a whole bunch of other authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.715,
    "end": 5335.778,
    "text": "Eric Schwitz is also one of the co-authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.619,
    "end": 5338.342,
    "text": "And they do exactly that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5338.442,
    "end": 5346.253,
    "text": "They say, well, under the assumption of computational functionalism, we can derive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.942,
    "end": 5356.031,
    "text": " a certain number of indicators from theories of consciousness and can think about how they could be implemented in artificial systems and AIs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5356.151,
    "end": 5362.057,
    "text": "We can also assess to what extent they are already fulfilled by current AIs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5363.159,
    "end": 5367.183,
    "text": "But based on this, it's highly unlikely that current AIs are conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5367.743,
    "end": 5374.35,
    "text": "But if future AIs fulfill many of these indicators, it becomes more likely that they're conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5375.123,
    "end": 5384.036,
    "text": " Each time an artificial system fulfills one of these indicators, the probability that it's conscious rises a little.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5384.777,
    "end": 5391.447,
    "text": "And of course, that's a very elegant approach because you don't have to make any strong metaphysical commitments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5392.149,
    "end": 5402.464,
    "text": "You can just say, well, we don't really know what consciousness is, but we can say what features make it a bit more likely that a system is conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.44,
    "end": 5433.16,
    "text": " and as soon as we have systems that fulfill many of these indicators or many markers of consciousness we might reasonably say well it's highly likely that the system is conscious and we should um assign a moral status to the system but of course then the question is what what happens in the meantime when we have many systems that fulfill some indicators or many but not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.574,
    "end": 5440.945,
    "text": " maybe not so many indicators that we can really be certain that these systems are conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5442.407,
    "end": 5446.013,
    "text": "And how can we avoid these situations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.255,
    "end": 5447.516,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5448.017,
    "end": 5448.718,
    "text": "It's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5448.978,
    "end": 5449.579,
    "text": "It's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5449.96,
    "end": 5455.249,
    "text": "We don't have time for me to put on my philosopher's skeptical hat and, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5456.326,
    "end": 5463.172,
    "text": " and point out all the problems with trying to find behavioral indicators of consciousness, which are so obvious that I don't really need to say them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5463.232,
    "end": 5464.814,
    "text": "But again, that's the philosopher's point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5464.874,
    "end": 5470.779,
    "text": "And this more of a pragmatic point, which is, we are probably gonna have to make that decision at some point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5471.44,
    "end": 5481.088,
    "text": "And so why it's actually kind of interesting, we're setting up a sort of Bayesian process with which to come up with a posterior that a given object is conscious or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5481.108,
    "end": 5484.932,
    "text": "So it's kind of fun that we're inverting the Bayesian process to figure out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5485.372,
    "end": 5486.333,
    "text": "But as you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5486.802,
    "end": 5488.506,
    "text": " your model is only as good as its priors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5489.087,
    "end": 5494.679,
    "text": "And if those behavioral priors or behavioral indicators are wrong, then you are really barking down the wrong tree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5494.739,
    "end": 5499.529,
    "text": "You might be Bayes optimal, but you're Bayes optimal for a dysfunctional purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.998,
    "end": 5500.258,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5500.298,
    "end": 5501.54,
    "text": "That's really, yeah, that's fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5501.58,
    "end": 5507.647,
    "text": "I mean, I'd love to go further, but I'm aware that we are running a bit low on time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5507.847,
    "end": 5511.692,
    "text": "So you mentioned that this is kind of your main focus of research at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5511.732,
    "end": 5516.538,
    "text": "What else can people expect from you coming up next couple of months this year?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5517.319,
    "end": 5522.285,
    "text": "And also how can people get in touch with you if they want to ask you questions or just chat?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5523.747,
    "end": 5524.468,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5524.488,
    "end": 5528.132,
    "text": "Um, so I'm, I have a blue sky account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.091,
    "end": 5536.578,
    "text": " And I think my blue sky handle is Vanya.visa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.419,
    "end": 5540.601,
    "text": "Probably should check.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.621,
    "end": 5544.185,
    "text": "But I also have a Twitter account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5544.205,
    "end": 5545.726,
    "text": "I don't really understand what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5545.746,
    "end": 5546.407,
    "text": "I like Twitter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5548.909,
    "end": 5549.53,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.55,
    "end": 5551.191,
    "text": "So I also have a Twitter account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.231,
    "end": 5557.217,
    "text": "And then my handle is W-A-W-I-E-S-E, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5558.358,
    "end": 5558.878,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5559.955,
    "end": 5576.514,
    "text": " And, um, And what can people look forward to reading or, or hearing from you about, um, and also maybe plug the workshop that you're at now, because that's a really cool, um, thing that you guys are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5577.655,
    "end": 5577.876,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5577.896,
    "end": 5582.641,
    "text": "So I'm currently at, um, the IK in Germany.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.142,
    "end": 5587.326,
    "text": "Um, IK is, um, the interdisciplinary college.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5587.426,
    "end": 5587.887,
    "text": "It's a.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5588.761,
    "end": 5590.824,
    "text": " spring school for cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5592.326,
    "end": 5604.623,
    "text": "It's an entire week with a lot of fascinating courses from AI to neuroscience, neurotechnology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5605.564,
    "end": 5612.454,
    "text": "We also have some more philosophical courses, some more theoretical, some more practical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5612.474,
    "end": 5614.617,
    "text": "It's a really great mixture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5615.103,
    "end": 5636.976,
    "text": " and many fascinating people over here that you can talk to so i highly recommend coming to the ik and guna and um maybe you have show notes or something like that for the podcast maybe you can provide a link to the website everything goes in the description i'll put your blue sky in the description as well i'll make sure i do that thank you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.698,
    "end": 5638.279,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5638.82,
    "end": 5642.606,
    "text": "Maybe, maybe one thing more people can expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5642.946,
    "end": 5650.698,
    "text": "Um, so I signed a contract with MIT press, um, for a book on artificial consciousness working on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.959,
    "end": 5659.993,
    "text": "And also, um, I think I should remind myself that I should be busy working on the manuscript.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.598,
    "end": 5661.319,
    "text": " Fantastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5661.399,
    "end": 5662.1,
    "text": "Well, congratulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5662.761,
    "end": 5665.185,
    "text": "Do people know this already or is this a big reveal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.425,
    "end": 5672.095,
    "text": "Have we done an exclusive break on Active Inference Insights or do people know about this book already?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5674.158,
    "end": 5676.281,
    "text": "I think most people don't know about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5676.302,
    "end": 5679.827,
    "text": "I've just told a few persons about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5680.007,
    "end": 5683.332,
    "text": "But on the other hand, most people don't know me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5683.953,
    "end": 5685.796,
    "text": " Yeah, true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.816,
    "end": 5686.437,
    "text": "No one knows us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5686.917,
    "end": 5688.039,
    "text": "Well, I forget that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5688.199,
    "end": 5694.728,
    "text": "I was just trying to sort of embody a speculative paparazzi-esque person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5694.748,
    "end": 5695.409,
    "text": "I didn't do it very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5696.01,
    "end": 5697.873,
    "text": "Vanya, this was super fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5698.153,
    "end": 5702.299,
    "text": "I feel like there's still a lot to get into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5702.431,
    "end": 5710.04,
    "text": " Um, so maybe when Thomas comes, it would be great to have you on even if, you know, partially for a bit, so we can get deeper into these ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5710.681,
    "end": 5720.213,
    "text": "And, um, thank you for placating me and listening to my ramblings about recursive properties and operations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5720.393,
    "end": 5721.294,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5721.354,
    "end": 5722.976,
    "text": "Thank you very much for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.016,
    "end": 5724.899,
    "text": "And then this was really a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.619,
    "end": 5729.865,
    "text": "So, um, I think we had a nice flow on the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5730.285,
    "end": 5730.666,
    "text": "We did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.946,
    "end": 5731.306,
    "text": "We did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5731.567,
    "end": 5731.847,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5732.249,
    "end": 5733.486,
    "text": " Thank you everyone for watching as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5733.892,
    "end": 5734.277,
    "text": "Take care.",
    "speaker": "SPEAKER_02"
  }
]