[
  {
    "start": 31.323,
    "end": 35.826,
    "text": " Hello and welcome everyone to ACT-INF Lab live stream number 34.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.788,
    "end": 39.649,
    "text": "It's December 7th, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.911,
    "end": 43.212,
    "text": "Welcome to ACT-INF Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.893,
    "end": 49.917,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.378,
    "end": 53.24,
    "text": "You can find us at some of the links here on this page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.421,
    "end": 56.542,
    "text": "This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.923,
    "end": 60.686,
    "text": "So please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.185,
    "end": 68.41,
    "text": " All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.353,
    "end": 78.218,
    "text": "All Act In Flap activities are participatory, so let us know if you want to join in or co-organize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.278,
    "end": 87.845,
    "text": "We have three organizational units, education, communication, and tools, and weekly meetings for each of those units, a ton of interesting projects to get involved in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.093,
    "end": 101.191,
    "text": " coda.io at Active Inference Lab slash Active Lab, you'll find a searchable and sortable site where you can learn more about the past and upcoming live streams that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.666,
    "end": 118.319,
    "text": " today in active stream number 34.1 we're going to be learning and discussing about this fun paper the free energy principle it's not about what it takes it's about what took you there by actual constant in 2021 and in 34.0",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.154,
    "end": 124.855,
    "text": " Dean and I had a great time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.896,
    "end": 132.082,
    "text": "We talked about the paper, so check out the dot zero and of course, read the paper if you wanna learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.862,
    "end": 138.307,
    "text": "Today in 34.1, we can go over some of the key claims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.988,
    "end": 148.996,
    "text": "We can look at some of the examples again and differentiate the Bayesian approach versus the free energy approach and just really take it anywhere that people think is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.036,
    "end": 150.337,
    "text": "So if you're watching live,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.414,
    "end": 155.478,
    "text": " just ask questions in the live chat and we'll be keeping our eye on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.519,
    "end": 162.744,
    "text": "And we will just introduce ourselves, go around, and then we'll take it wherever we take it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.755,
    "end": 177.12,
    "text": " We can introduce ourselves, we can say hi and say maybe something that was exciting about the paper that we remembered or something that we'd like to reduce our uncertainty on by the end of this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.941,
    "end": 192.067,
    "text": "So I'm Daniel, I'm a researcher in California and I'm actually just looking forward to seeing if anyone in the live chat has some questions to ask because there's so many cool adjacencies to this paper and just the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.462,
    "end": 197.243,
    "text": " beginnings of the thread were explored by Dean and I in the dot zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.584,
    "end": 203.406,
    "text": "So exploring the implications and what people see as relevant in this paper, I think will be really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.346,
    "end": 205.907,
    "text": "And I will pass it to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.787,
    "end": 208.248,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.268,
    "end": 208.608,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.688,
    "end": 209.488,
    "text": "I'm Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.529,
    "end": 216.411,
    "text": "I'm just curious, again, to see how as you start pulling on a thread,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.611,
    "end": 222.173,
    "text": " discovering how many things are actually there as opposed to just the threads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.253,
    "end": 226.355,
    "text": "So yeah, I think today should be a pretty interesting day and I'll pass it over to David.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.955,
    "end": 228.576,
    "text": "I'm Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.956,
    "end": 231.577,
    "text": "I live north of Manila.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.619,
    "end": 240.266,
    "text": " I did natural language processing with big computers and studied cybernetic learning theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.326,
    "end": 244.69,
    "text": "And I'm excited that he's given us some simple math.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.87,
    "end": 249.394,
    "text": "Axel Constant is kind of bringing it down to those of us who stalled by the end of Calculus 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 252.296,
    "end": 259.302,
    "text": "Just to sort of lead in question, Dave, in the area of cybernetics, is there any...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.771,
    "end": 279.473,
    "text": " analogous work anyone who said well it's not really about being a cybernetic system it's about how you came to be that cybernetic system like are there any parallels in the cybernetics literature for the kinds of things that are explored in this paper well there are yeah um in terms of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.647,
    "end": 283.99,
    "text": " Not so much necessarily the origins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.11,
    "end": 291.179,
    "text": "Well, yes, in cybernetic learning theory, a branch called conversation theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 292.548,
    "end": 306.794,
    "text": " They completely cut loose the notion of the physical embodiments of systems from the mimetic or functional or conceptual or cognitive aspects of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 306.894,
    "end": 308.615,
    "text": "In fact, even types of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.556,
    "end": 312.397,
    "text": "Very much like what Richard Dawkins did",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.551,
    "end": 326.061,
    "text": " 30 plus years ago on separating genetics from mimetics, which in his case originally was just a proof of principle, not something he wanted to pursue especially, and it has been pursued.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 326.681,
    "end": 342.854,
    "text": "In cybernetic learning theory, the individual is equated to the conversation, is equated with a type of system that originates, that persists, that merges into other systems,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.849,
    "end": 362.741,
    "text": " that may very well function through many bodies, so you have distributed intelligence right out of the gate, as well as internal differentiation, internal self-definition of each individual as a conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.462,
    "end": 369.005,
    "text": "So definitely the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 371.498,
    "end": 375.702,
    "text": " And there's a lot of math, even going way back to the 60s and 70s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 377.323,
    "end": 400.582,
    "text": "There were cyberneticians who took precise quantitative work very seriously and dug down very carefully on quantified attention, quantified uncertainty, resolution of uncertainty, and the qualitative consequences of deciding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.489,
    "end": 421.156,
    "text": " what's really happening, what my plan really is, very much the sort of sudden, abrupt, and often irreversible changes that the world looked at in a lot of depth when catastrophe theory burst upon the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.576,
    "end": 427.659,
    "text": "Sudden catastrophic, perhaps an improvement, but a catastrophic, a sudden, a relatively irreversible change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.126,
    "end": 448.933,
    "text": " and here it is still working on it in deeper and deeper in detail and wider scope so good for mr const dr const pretty interesting it makes me think about like a friendship and how maybe it's not just about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.778,
    "end": 456.826,
    "text": " what the friendship is or what it takes to have a friendship, but it's about the specific conversations that take you there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.068,
    "end": 466.617,
    "text": "So let's just kind of look at the main aims and claims and parts of the paper, and then either of you raise your hand, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.492,
    "end": 473.074,
    "text": " Maybe some others will join and anyone in the live chat, please just ask any question or make a comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.114,
    "end": 473.795,
    "text": "We're just chilling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.715,
    "end": 485.059,
    "text": "So the center topic that's raised and it's a term that's introduced in this paper, not the word, but its usage in this situation is the entailment problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.719,
    "end": 488.921,
    "text": "And just like the dog and the tail, as they say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.793,
    "end": 499.799,
    "text": " The entailment problem is about the relationship, the necessity and the sufficiency relationship, which one is following which and under what situations they're following each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.819,
    "end": 506.904,
    "text": "The entailment problem is the confusion in the entailment relation between free energy minimization and life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.424,
    "end": 512.027,
    "text": "So is free energy minimization necessary for life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.427,
    "end": 513.228,
    "text": "Is it sufficient?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.948,
    "end": 517.611,
    "text": "Those are the core pieces of the entailment problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.593,
    "end": 531.22,
    "text": " And what happens in this paper is a simple dissolution through a trivial toy simplified example of that entailment problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.82,
    "end": 542.466,
    "text": "And we're going to probably walk through it again today, but this numerical example, which is very stripped down, it's not full act-inf, there's no action in the loop, it's just a perceptive example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.326,
    "end": 550.192,
    "text": " And it just shows that free energy minimization does not always lead to the correct choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.133,
    "end": 553.295,
    "text": "It's also conditional upon the priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.434,
    "end": 556.275,
    "text": " In other words, how you got there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.535,
    "end": 559.677,
    "text": "It's about what took you there because the priors don't come from nowhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.737,
    "end": 560.677,
    "text": "They come from the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.318,
    "end": 578.567,
    "text": "So this kind of connects this rigorous logic within the action perception loop, or in this case, just a simplified perception loop, to the often ill or illogical way that things happened to get the way they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.187,
    "end": 583.931,
    "text": " So it's going to be that tension between, is this a rational analysis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.991,
    "end": 587.434,
    "text": "Is it locally rational, but maybe globally irrational?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.955,
    "end": 589.676,
    "text": "All those kinds of topics come up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.377,
    "end": 595.682,
    "text": "And just to skip to the final words of the paper, the claim is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.86,
    "end": 601.885,
    "text": " in this paper that's explored is that free energy minimization is not sufficient for life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.426,
    "end": 609.113,
    "text": "So not that FEP has nothing to say about life, not that Act-Inf is irrelevant, but that free energy minimization is not sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.754,
    "end": 617.342,
    "text": "It turns out that it's necessary to be doing something like free energy minimization to persist in a dissipative world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.283,
    "end": 619.243,
    "text": " but it's not sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.723,
    "end": 620.984,
    "text": "It can't be all that you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.244,
    "end": 626.385,
    "text": "The wheels are necessary for the car to go round and round, round and round, but they're not sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.105,
    "end": 633.587,
    "text": "And then that last sentence, the free energy principle is meant to account for all kinds of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.567,
    "end": 643.69,
    "text": "You, the listener slash reader, the author of the paper, and the system of interest, the organism under study in a unifying fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.99,
    "end": 647.671,
    "text": "So we should also explore like, what is the unifying principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.792,
    "end": 659.877,
    "text": " lens or what is the framing under which the research scholar and the person who's just sort of like, what is the free energy principle and the bacterium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.937,
    "end": 662.238,
    "text": "And what is that unifying principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.338,
    "end": 665.499,
    "text": "And what does the free energy principle have to do with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.781,
    "end": 669.041,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.001,
    "end": 675.964,
    "text": "So Dean, where do you think we should jump in or what would be a fun question or a place to start here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.293,
    "end": 681.615,
    "text": " Well, so I have a little bit of history with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.635,
    "end": 683.416,
    "text": "So what took you there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.516,
    "end": 690.239,
    "text": "So if I'm meeting somebody and they're an expert at something, I don't typically ask, why are you an expert?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.259,
    "end": 691.98,
    "text": "Because that's kind of offensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 692.44,
    "end": 695.622,
    "text": "But to ask, what got you here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.702,
    "end": 699.404,
    "text": "What got you to the place where you now bear this title?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.024,
    "end": 706.407,
    "text": "The weight of that title is an interesting way of going about trying to figure out what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.805,
    "end": 716.096,
    "text": " what logics they have applied in the past to untangle problems and resolve things that maybe somebody",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.185,
    "end": 721.788,
    "text": " with less expertise struggles with or doesn't seem to be able to overcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.808,
    "end": 725.67,
    "text": "So that's where this paper was really helpful to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.23,
    "end": 740.159,
    "text": "Instead of why do I have to do this or why are you such an expert, asking where did you come from and then being specific in terms of so how did you resolve something that I still find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.314,
    "end": 743.856,
    "text": " Difficult to resolve like why do I have to tie my shoes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.416,
    "end": 754.584,
    "text": "And then the expert says well because you're going to trip over your shoelace fall down Well, I haven't tripped over my shoelace instead of going down that path figuring it out in a slightly more sophisticated way and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.31,
    "end": 758.451,
    "text": " Oh, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.751,
    "end": 762.314,
    "text": "I'm not going to read this Blake quote, but of course we have to write it down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.255,
    "end": 770.341,
    "text": "It makes me think about how why, which is an important question, often lends itself towards generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.662,
    "end": 773.244,
    "text": "Like, why are you studying machine learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.805,
    "end": 781.171,
    "text": "Well, it's really important and it's going to become increasingly important and I wanted to have a good job and other people told me it was relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.551,
    "end": 783.193,
    "text": "It kind of generalizes out and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.278,
    "end": 788.183,
    "text": " Whereas what took you there is always going to be a trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.323,
    "end": 789.204,
    "text": "It's kind of a path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.644,
    "end": 791.086,
    "text": "And that's where you get the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.126,
    "end": 796.432,
    "text": "That's more like, well, I met this mentor and then I was curious about this specific topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.452,
    "end": 798.114,
    "text": "And then we did this program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.975,
    "end": 803.941,
    "text": "So what took you there is about the specifics and what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.436,
    "end": 809.139,
    "text": " is broached in why questions is often generalizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.159,
    "end": 811.901,
    "text": "And we know that there's not even a single answer to why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.961,
    "end": 821.428,
    "text": "Like we've talked about Aristotle's whys and about Tinbergen why, like why is always going to be a plurality of answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.188,
    "end": 824.45,
    "text": "Whereas what took you there is gonna be a specific path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.99,
    "end": 826.531,
    "text": "And so that's the tension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.609,
    "end": 851.182,
    "text": " in living systems is we want to understand something general like surely there are some generalizations we can make across single-celled life or across mammals but also we're explaining specific systems so which aspects are going to be generalizable and which ones aren't and i think again free energy principle as a theory of everything",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.202,
    "end": 857.486,
    "text": " and something that does clearly make generalizations across systems, at least apply to different systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.327,
    "end": 874.098,
    "text": "How does this hyper specific trajectory based way of approaching answering a question relate to more of a mean field approximation averaged over multiple categories?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.778,
    "end": 877.881,
    "text": "I think it's that tension that's really interesting to describe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.941,
    "end": 880.522,
    "text": "So one is this general versus specific tension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.463,
    "end": 910.458,
    "text": " and then if we can go to the simple point that's made in the paper that the free energy principle is not concerned with the sufficient conditions of existence but rather with what must have been the case given that you exist so this is related to necessity and sufficiency which we talked about in the dot zero they're similar words so we should use them differently they're different words in other words it's about necessity but not necessarily sufficiency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.431,
    "end": 914.533,
    "text": " And then it's not about what figuring out what it takes to be alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.054,
    "end": 917.055,
    "text": "It's about figuring out what took you there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.695,
    "end": 927.542,
    "text": "So the title is restated and turned around many, many different times because it is such a distillable and simple yet important concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.062,
    "end": 934.067,
    "text": "And I think the piece that I'd like to explore a little more is really the pronoun use of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.051,
    "end": 945.52,
    "text": " I understand why the paper is written from an I perspective, because that's convention with single author philosophy papers, but it's about figuring out what took you there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.561,
    "end": 956.67,
    "text": "So there's a sort of rhetorical element of speaking to a reader, which is returning at the end of the paper, those last few lines about you, me, and the system under study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.691,
    "end": 959.553,
    "text": "But then also it's almost like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.474,
    "end": 971.42,
    "text": " about how the free energy principle is about systems looking at their own timeline and trajectory and perhaps not as much as looking out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.82,
    "end": 982.447,
    "text": "So I'm curious about what does that relational element mean here with the person relating to their past and us as systems relating to other systems, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.268,
    "end": 986.61,
    "text": "Yeah, so the necessity might be you show up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.614,
    "end": 993.157,
    "text": " you attend in order for things to sort of continue on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.657,
    "end": 997.659,
    "text": "But the sufficiency part is how available you are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.699,
    "end": 1010.526,
    "text": "So you can show up and turn all your senses off and be present, but not necessarily be taking in anything, or at least trying to actively avoid taking information in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.586,
    "end": 1013.247,
    "text": "And so that's the part, again, I would agree with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.267,
    "end": 1014.968,
    "text": "That's the part I found really interesting because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.642,
    "end": 1037.173,
    "text": " To not understand or appreciate that there's a difference between what is necessary, I'm here, I'm in part of this live stream now, but then I could be distracted in all different directions, not really be available to what is going on around me is a whole different matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.213,
    "end": 1041.856,
    "text": "And I think that's what Axel has done a really good job of bringing it down to that personal level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.685,
    "end": 1064.679,
    "text": " sufficiency has to be exhaustive to say what's truly sufficient for the bacteria to live it it's going to include things like well you need the laws of physics and you need gravity and you need um just all everything it's like really you're giving almost a bit by bit play by play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.754,
    "end": 1075.037,
    "text": " So sufficiency, it requires an exhaustive account because if you're missing something that's necessary, you didn't capture what was sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.157,
    "end": 1092.403,
    "text": "Necessity allows us to just focus on some aspect that we know is relevant and then talk about the why and the what and the how of necessity while acknowledging that we're just focusing on one piece like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.747,
    "end": 1099.111,
    "text": " one line in that one Kandinsky painting, it's necessary for my interpretation of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.912,
    "end": 1106.216,
    "text": "It's not sufficient because the sufficiency of the interpretation of art would just send you off into the whole universe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.236,
    "end": 1117.885,
    "text": "Maybe you need all of human cultural history, including from cultures that you wouldn't even directly acknowledge for the sufficiency to be garnered in that interpretive setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.025,
    "end": 1120.827,
    "text": "But necessity is a lot easier to point your finger to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.611,
    "end": 1131.794,
    "text": " That relates to what are distinguished as the strong and the weak responses to the entailment problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.954,
    "end": 1134.375,
    "text": "So let's look over at this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.575,
    "end": 1142.157,
    "text": "And again, anyone with any kind of a question, please just ask it because we're chilling and looking forward to your questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.897,
    "end": 1147.499,
    "text": "So this is where in the paper, the entailment problem is specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.106,
    "end": 1174.693,
    "text": " arguments in the literature on the free energy principle give the impression that in order to be alive to count as a living system one must minimize free energy and so there's a few ways to think about this relationship between minimizing free energy and life sorry if you thought it was going to be a discussion on a different topic because that's what this paper is about and it just again it's so simple it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.598,
    "end": 1177.742,
    "text": " a shape in your hand, you're turning it over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.962,
    "end": 1185.256,
    "text": "The shape is simple in some ways, but then the implications of the shape and the way it gets connected to other ideas is really critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.117,
    "end": 1186.217,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.518,
    "end": 1193.561,
    "text": " Axel distinguishes two ways to talk about the relationship, the strong and the weak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.482,
    "end": 1203.506,
    "text": "And as we'll see, they differ not just in their strength, but also essentially in the direction which the arrow is pointing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.146,
    "end": 1210.59,
    "text": "So it's kind of like, it's not like there's a little mountain and a big mountain, but the arrow of elevation is pointing the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.03,
    "end": 1212.411,
    "text": "There's something a little bit different happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.231,
    "end": 1222.314,
    "text": " The strong claim in response to the entailment problem is that minimizing free energy is a sufficient condition for life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.674,
    "end": 1232.816,
    "text": "And that's also called in some earlier work, the overly generous claim, which is kind of a framing that already says that it's probably too generous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.117,
    "end": 1234.717,
    "text": "It's incorrect in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.737,
    "end": 1238.018,
    "text": "And the strong claim is the sufficiency claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.996,
    "end": 1241.477,
    "text": " Minimizing free energy, that's all you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.737,
    "end": 1245.197,
    "text": "It's sufficient to minimize free energy to be a living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.378,
    "end": 1257.2,
    "text": "The implication of the strong claim would be that all we need to do is have that free energy thermometer, and then we could determine who's minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.28,
    "end": 1264.542,
    "text": "We have our meter stick on this left side, and then that would be sufficient to talk about what systems were alive or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.573,
    "end": 1270.894,
    "text": " In contrast, the weak claim is a necessity claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.914,
    "end": 1277.275,
    "text": "If a system is currently alive, it means that it has minimized its free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.336,
    "end": 1286.977,
    "text": "And such a type of claim does not assume the FEP is designed to set the bar for the sufficient conditions of life or meant to predict what things may or may not be alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.958,
    "end": 1293.459,
    "text": "Rather, it limits the scope of the application of the principle to beings that we think are alive now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.779,
    "end": 1316.153,
    "text": " enables us to know the necessary conditions under which those beings can be living i.e can actively resist the loss of structural integrity what took them there so there's a few interesting pieces just they differ in strength these two responses or claims that are generated by the entailment problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.594,
    "end": 1320.219,
    "text": " I wonder what is the scope of the FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.901,
    "end": 1325.53,
    "text": "And is it for systems that we have a priori decided are already alive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.55,
    "end": 1326.833,
    "text": "Are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.839,
    "end": 1330.782,
    "text": " non-living systems under the scope of the FVP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.602,
    "end": 1345.414,
    "text": "So maybe we can try to like do some duplicate the slide and do a little diagramming and Venn diagrams on what does the minimizing free energy circle look like with respect to the life circle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.355,
    "end": 1351.7,
    "text": "And then what is life if we don't have the thermometer over here on the left side?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.517,
    "end": 1355.957,
    "text": " So can I ask a question, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.557,
    "end": 1373.021,
    "text": "Would it be going too far off the rails if I wondered to take this idea and say, okay, so I want to build out, I'm an academic or I'm a trainer and I want to build out a curriculum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.681,
    "end": 1381.543,
    "text": "Knowing this, what does that imply in terms of, well, I know what's the difference between something that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.092,
    "end": 1390.197,
    "text": " surprisal removal, because remember, I'm the one that already knows this, and I'm trying to pass this along to somebody who doesn't know it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.817,
    "end": 1396.761,
    "text": "So I'm trying to guess what surprisal removal or minimization means to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.122,
    "end": 1399.443,
    "text": "I'm supposed to be guessing what life means to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.064,
    "end": 1407.008,
    "text": "I'm supposed to be knowing what is necessary, what absolutely they must know, and what will be sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.509,
    "end": 1410.251,
    "text": "So in that context, how would we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.95,
    "end": 1414.051,
    "text": " How would we order this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.571,
    "end": 1417.212,
    "text": "Let's kind of lay out a few options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.232,
    "end": 1418.213,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1418.533,
    "end": 1426.617,
    "text": "So we have behind the first door, we'll use letters to talk about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.917,
    "end": 1429.378,
    "text": "So we'll have... I'll take the cash, Monty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.498,
    "end": 1430.959,
    "text": "Are you sure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.979,
    "end": 1433.28,
    "text": "I can reveal that one of the doors has nothing behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.405,
    "end": 1444.034,
    "text": " Okay, so we're going to have scenario A, which is there are systems that are minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.574,
    "end": 1446.517,
    "text": "So there are systems outside of that circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.837,
    "end": 1449.52,
    "text": "So there may be systems that are not minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.461,
    "end": 1456.989,
    "text": "But within the set of living things, all of them are minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.055,
    "end": 1461.758,
    "text": " So let's think about what kind of world that is, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.338,
    "end": 1470.745,
    "text": "So then we can have scenario B where there's living systems, there's non-living systems as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.865,
    "end": 1479.412,
    "text": "So we could ask what puts us in one category, living or non-living, but there's living systems that are minimizing free energy and there's ones that are not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.952,
    "end": 1486.057,
    "text": "I think we can say that because if we go with the weak claim,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.819,
    "end": 1510.707,
    "text": " then it's fair to say that b is ruled out because this would say that there's living systems that are not minimizing free energy so we can say like basically weak claim uh disreputes this area the area of that crescent moon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.677,
    "end": 1516.378,
    "text": " that's being sort of invicted against.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.039,
    "end": 1519.019,
    "text": "Is disrepute a word?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.179,
    "end": 1520.619,
    "text": "Disputes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.04,
    "end": 1521.56,
    "text": "We'll go with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.56,
    "end": 1524.501,
    "text": "The weak claim disputes this area of the crescent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.801,
    "end": 1529.342,
    "text": "It's saying, well, all living systems have to be minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.462,
    "end": 1531.143,
    "text": "It's a necessity, but it's not sufficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.943,
    "end": 1539.245,
    "text": "So then a third scenario would be like, they're the exact same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.706,
    "end": 1542.126,
    "text": "So, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.56,
    "end": 1565.832,
    "text": " that would be sort of a well you could have minimizing free energy is a sufficient condition for life so that means that the life circle is we'll have to you can't show a total overlap but the life circle everything that's minimizing free energy is alive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.065,
    "end": 1572.309,
    "text": " So here in A, there are free energy minimizing systems that aren't alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.99,
    "end": 1584.379,
    "text": "Like a ball falling off of a cliff might be minimizing its free energy, just like it's minimizing its potential energy, or a burning candle might be minimizing free energy, but it doesn't have to be alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.619,
    "end": 1590.183,
    "text": "So these are free energy minimizing systems in the crescent of A that are not alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.404,
    "end": 1591.645,
    "text": "In C,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.257,
    "end": 1614.345,
    "text": " we have this perfect relationship between the two things and that is a very strong claim which is that if it's minimizing free energy that's sufficient for being alive and if it's not minimizing free energy it's not alive so this is sort of the the weakest claim is on the left side",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.411,
    "end": 1617.371,
    "text": " Doesn't mean it's useless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.771,
    "end": 1620.252,
    "text": "Doesn't mean it's inadequate, but this is the weakest claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.772,
    "end": 1621.912,
    "text": "This is the necessity claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.013,
    "end": 1641.337,
    "text": "Then we have the strong claim here that minimizing free energy is, well, this is the strongest claim in C, that minimizing free energy is sufficient for life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.137,
    "end": 1644.078,
    "text": "So anything that, you know, if,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.175,
    "end": 1649.198,
    "text": " Doing X is sufficient for greetings blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.978,
    "end": 1651.48,
    "text": "Hello, cool light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.483,
    "end": 1660.148,
    "text": "We're in the slides on 24, just talking about necessity and sufficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.329,
    "end": 1662.81,
    "text": "C is the strongest case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.571,
    "end": 1665.232,
    "text": "It's saying it's sufficient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.109,
    "end": 1672.995,
    "text": " And so you're either going to be minimizing free energy and therefore sufficient to be called alive, or you're doing neither.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.036,
    "end": 1681.842,
    "text": "And then B is a little bit of a middle case that's saying there's some living systems that are not minimizing their free energy, but some are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.423,
    "end": 1686.426,
    "text": "So are there other possible layouts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.626,
    "end": 1691.029,
    "text": "And then Dean, let's return to your question about like educating and how do we think about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.069,
    "end": 1693.932,
    "text": "How do we distinguish these scenarios in an education context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.143,
    "end": 1706.566,
    "text": " Or welcome, Blue, if you would like to say hello or just what makes you excited for this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.668,
    "end": 1710.628,
    "text": "I loved this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1710.769,
    "end": 1711.569,
    "text": "I thought it was great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1712.029,
    "end": 1717.532,
    "text": "And I have been listening along in the live stream, so I'm kind of up to speed with where you guys are and what you're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1717.592,
    "end": 1724.576,
    "text": "But I enjoyed Axel's writing, and I like the fact that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1726.52,
    "end": 1742.971,
    "text": " I can implement the free energy without having to ascribe to panpsychism and also without having to ascribe to the mind-life continuity hypothesis or all of these things that we've been discussing, like the necessity, sufficiency, it's there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.952,
    "end": 1756.02,
    "text": "I think that Axel sets out a really logical argument or set of arguments and doesn't make any claims that aren't justifiable with math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1758.464,
    "end": 1781.657,
    "text": " yes using a simple mathematical example um we'll we'll keep this slide around because we can wonder maybe is there some well another relationship that we could speculate would be like a kind of something like this like life there's systems that are minimizing free energy or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.533,
    "end": 1803.649,
    "text": " and then there's systems that are alive or not and sometimes they overlap but they don't have to overlap but there's some special living systems that are doing it and there's some that aren't and there's some that are neither so this is the most uh we'll just call this one situation d d is the most is the most flexible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.091,
    "end": 1831.848,
    "text": " scenario because you could have a or b i mean well i won't use those letters you could have life free energy minimizing both or neither so d is the most flexible case c is the most restrictive case and then we have two possible nesting relationships where one is nested inside of the other and it's kind of interesting to wonder what kind of world do each of these exist in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.492,
    "end": 1857.229,
    "text": " well where is the mind bubble yes let's should be around the whole slide is that the mind the the modeler is that why there's that relational or personal framing of the paper because the mind is the mapping of these different venn diagrams dean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.407,
    "end": 1865.01,
    "text": " And I think it's really interesting too, Daniel, that in real time, we now have a slide 23 and now a new slide 24.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.791,
    "end": 1877.236,
    "text": "And although we now know the order that they presented themselves to us as, could we have started with 24 and worked our way back to 23?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.757,
    "end": 1885.282,
    "text": " That's when it gets really kind of weird and twisted, but it's also what I think the paper is speaking to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.743,
    "end": 1894.47,
    "text": "If we're actually thinking about this as another example of a post, potentially post-diction way of viewing things historically now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.032,
    "end": 1898.913,
    "text": "Yes, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.884,
    "end": 1908.032,
    "text": " 23, which now it has a little logo on it for those who don't have the slide deck at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.052,
    "end": 1911.437,
    "text": "23 was derived heavily from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.078,
    "end": 1912.278,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.904,
    "end": 1916.145,
    "text": " It was quotes from the paper and then just a visual representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.305,
    "end": 1919.666,
    "text": "Now, that was not in the paper, but it could have been interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.787,
    "end": 1930.67,
    "text": "And then, that's right, through the specifics of who joined when and what we were thinking about when, that's what led to 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.19,
    "end": 1937.752,
    "text": "But maybe we'll add another slide before 23, and then they'll both be a different number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.793,
    "end": 1941.954,
    "text": "But it does bring up an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.83,
    "end": 1950.361,
    "text": " I think we could look at, well, first, Dave, thanks for writing in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.381,
    "end": 1954.47,
    "text": "Do you want to read what you wrote or would you like me to read what you have in the YouTube live chat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.642,
    "end": 1959.905,
    "text": " Yeah, could I expand on it just slightly?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.045,
    "end": 1960.425,
    "text": "Please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.546,
    "end": 1962.328,
    "text": "What I would have posted if I didn't have the big limit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.908,
    "end": 1965.411,
    "text": "Title, Necessary vs. Sufficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.072,
    "end": 1972.34,
    "text": "Two of the original concepts of general systems theory have recently, as of 1975, been resuscitated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.56,
    "end": 1974.763,
    "text": "There's an admirable discussion by Russell Akoff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.464,
    "end": 1994.174,
    "text": " The first of the two concepts is that whereas causal argument considers necessary and sufficient conditions, systematic theory or cybernetic argument deals primarily with a logic of necessary conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.626,
    "end": 2010.154,
    "text": " see Fred Singer's discussion of the producer and product relations and in Sommerhoff this is called goal relations and I'd add this deals with intentional action where there are goals",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.234,
    "end": 2020.56,
    "text": " You know, there's an old painful discussion going back to way before Darwin that the world exists only as push.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.201,
    "end": 2030.147,
    "text": "Galileo wanted to absolutely banish goals of any kind, any value had to be absolutely driven from science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2030.887,
    "end": 2033.589,
    "text": "If you say for the purpose of science, get out, you're not a scientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.466,
    "end": 2043.768,
    "text": " I continue, this notion underlies the more sophisticated treatment of goals and intentions, conceivably partly specified intentions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2044.628,
    "end": 2055.731,
    "text": "Fuzzy goals, goals with ill-defined criteria, which you might or might not be aware of, I would add.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.468,
    "end": 2062.55,
    "text": " The other concept of about the same importance is the presupposition of a systematic universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.071,
    "end": 2074.015,
    "text": "There is a tacit assumption that things, objects, and other elementary entities are interdependent rather than being isolated units, which is the assumption behind the majority of sciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.247,
    "end": 2091.413,
    "text": " Further, as a result of their interdependence, or, with the same meaning, of the supposition that things, objects, and so on are not really unitary, these entities form systems, and it is systems which may be observed and manipulated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.875,
    "end": 2106.943,
    "text": " So the notion that there's one and only one way to approach an argument, one and only one order among real things that are scientifically respectable, utterly wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.064,
    "end": 2109.605,
    "text": "Utterly wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.005,
    "end": 2117.529,
    "text": "If you can't work your argument in at least two different directions, you haven't thought about what your argument is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2118.89,
    "end": 2120.211,
    "text": "You don't know the boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.411,
    "end": 2121.552,
    "text": "You don't know what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2122.446,
    "end": 2124.228,
    "text": " You don't know what a jellyfish is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.249,
    "end": 2129.055,
    "text": "You think you know what a jellyfish is, but you don't know the difference between the inside and the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.375,
    "end": 2130.597,
    "text": "You may end up in the inside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.81,
    "end": 2143.977,
    "text": " So it's almost like if there's only one way to run through the argument, that's when necessity and sufficiency are easily confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.317,
    "end": 2159.048,
    "text": "So if somebody just drives in one lane from the beginning to the end, and I made my case and that's all I have to say, well, then you've implicitly through your actions, your enacted behavior, you've, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.319,
    "end": 2164.88,
    "text": " acted consistently as if what you had to say was sufficient for making your case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.821,
    "end": 2166.901,
    "text": "The prosecution rests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.721,
    "end": 2168.962,
    "text": "And also it was necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.982,
    "end": 2171.342,
    "text": "You think I've included everything necessary and sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.723,
    "end": 2175.544,
    "text": "So that's actually where you get, and here's maybe where we should duplicate the slide again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.99,
    "end": 2179.273,
    "text": " That's an overlap of necessity and sufficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.913,
    "end": 2194.248,
    "text": "But then if you did two parallel arguments, just you did one from start to finish and the other one from start to finish, now you could say, well, both of them are in their own timeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.428,
    "end": 2199.453,
    "text": "They were both necessary, even if they have totally disjoint information that was being used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.854,
    "end": 2204.195,
    "text": " And then what is the relationship of the goals there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.595,
    "end": 2221.018,
    "text": "And that is kind of like Dean's multiple eyes open, giving us the perspective to look at goals when we have multiple realizations, because it does help us distinguish necessity and sufficiency because we literally see, well, it could have been done a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.738,
    "end": 2228.42,
    "text": "So it being done in way one can't be the whole story because we just saw it done in way two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.78,
    "end": 2229.92,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.738,
    "end": 2253.771,
    "text": " sorry daniel you dropped off on me for a second there but so i wanted to ask david a question about yeah dean kind of drops in and out he was giving some funny descriptors of his internet hardware earlier it was pretty funny start again sorry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.008,
    "end": 2259.716,
    "text": " So I agree with what David was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.756,
    "end": 2262.966,
    "text": "And there's a book called The Origins of Order, Project and System.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.712,
    "end": 2279.661,
    "text": " And what the author basically says is that projects are easy to get trapped in goal-directed behavior, whereas where you can also hold up the system, you can see the number, sort of the multitudes of different directions all at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.721,
    "end": 2287.005,
    "text": "And so I was wondering, does that sort of fit in with what David now was trying to speak to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.386,
    "end": 2291.287,
    "text": "Trying to find out the author's name here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.584,
    "end": 2299.028,
    "text": " Well, Stuart Kaufman, who is, I think he has become a little more active recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.088,
    "end": 2302.75,
    "text": "I know they're pushing his book, Origins of Order, really hard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.351,
    "end": 2304.992,
    "text": "That's something I read in like the 80s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.512,
    "end": 2306.032,
    "text": "Who's that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.393,
    "end": 2307.113,
    "text": "This is a new one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.133,
    "end": 2308.274,
    "text": "This is Paul Kahn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2309.034,
    "end": 2309.715,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.279,
    "end": 2312.181,
    "text": " Yeah, okay, K-A-H-N?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.521,
    "end": 2313.603,
    "text": "Yeah, K-A-H-N.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.263,
    "end": 2323.073,
    "text": "And he's basically trying to use the argument that you can look at the Constitution or you can look at the actual laws, and you hold up both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.753,
    "end": 2331.481,
    "text": "One is goal-directed, the project piece, whereas the other one is trying to work from within and around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.322,
    "end": 2358.345,
    "text": " so that's it's that sort of between and inside argument and that's not the same as as projecting yourself to a particular outcome yeah i can't i can't answer that right now but i do want to tell a little quick story uh when i was working as a senior programmer analyst i was organizing this project it was going to take a couple of months and my super is kind of looking over my shoulder and i have the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2358.985,
    "end": 2382.059,
    "text": " criteria and i have a big flow chart and he says oh so dave's this how you're going to do it and i says i haven't decided he said wait a minute what's missing i mean you've you've got the whole thing laid out it looks like it ought to work and says yeah i haven't decided i've only done it one way there's no decisions involved in that i've just stated the requirements i didn't decide how to do it oh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.565,
    "end": 2397.673,
    "text": " ended up using a much better technique that saved us a huge amount of rewrite that nobody would have noticed because they would have said, oh, we have the answer, let's go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2398.694,
    "end": 2405.419,
    "text": "It's almost, it's the zero to one, which we've talked about, and it's also related to act, infer, serve,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.522,
    "end": 2422.551,
    "text": " Infer, you'll have something to infer about when you've acted, whether getting that first draft out or just doing a private voice memo or whatever stigmergy you need, you'll have something interesting to infer if you act, I promise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.291,
    "end": 2426.173,
    "text": "And then maybe you'll be closer to service than you expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.753,
    "end": 2433.057,
    "text": "But infer is still within the realm of like, well, what would be sufficient to get the job done?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.039,
    "end": 2437.141,
    "text": " But if you go, well, what would be necessary to do this one way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.922,
    "end": 2439.143,
    "text": "This is what would be necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.203,
    "end": 2442.586,
    "text": "We could walk from California to New York.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.386,
    "end": 2446.109,
    "text": "That would be necessary for getting to New York.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.329,
    "end": 2448.15,
    "text": "Okay, it's going to take too long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.33,
    "end": 2449.831,
    "text": "I just don't have that kind of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.452,
    "end": 2452.454,
    "text": "What would be another way to do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.174,
    "end": 2460.42,
    "text": "So there is almost a necessity and a sufficiency in action and inference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.718,
    "end": 2472.161,
    "text": " where action has a lot more to do what's needed and inference or thought maybe moves us more towards thinking about what's sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.101,
    "end": 2478.623,
    "text": "Not sure about that, but also thanks for sharing this resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.783,
    "end": 2487.085,
    "text": "And back to what David was saying, in the work that I was doing, I often had people who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.285,
    "end": 2495.328,
    "text": " who are very well versed in setting up all kinds of sophisticated projects, asking me, where's the project in this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.388,
    "end": 2501.67,
    "text": "And me having to jump up and down and wave hands and say, this isn't a project, that's why we're doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.79,
    "end": 2505.512,
    "text": "We don't know how it's going to turn out until we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.992,
    "end": 2507.633,
    "text": "And then we can look back on it and say, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.613,
    "end": 2509.854,
    "text": " Did we minimize free energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.154,
    "end": 2520.281,
    "text": "We weren't using minimizing free energy, but because I wasn't, you know, first in that lexicon yet, but that's essentially what we were doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.261,
    "end": 2524.243,
    "text": "We wouldn't know until we'd arrived that we'd arrived.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.984,
    "end": 2529.847,
    "text": "And that's really uncomfortable for people who are constantly saying, show me the milestones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.508,
    "end": 2533.029,
    "text": "Okay, well, I can show you the stages, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.158,
    "end": 2548.944,
    "text": " And I can show you how identity is now turning into identifying as people are constantly processing who they are as they're on board this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.204,
    "end": 2550.264,
    "text": "But I can't tell you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.974,
    "end": 2568.99,
    "text": " what it's like because it's not necessarily goal directed other than the fact that we want to try to keep it open as long as we can and figure out what logic people are using in order to be able to untangle and pull things out of hats that others don't know how to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.01,
    "end": 2570.451,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.792,
    "end": 2571.012,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.883,
    "end": 2575.226,
    "text": " One other thing that makes me think about is grants applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.267,
    "end": 2583.533,
    "text": "So a grant application might frame things in terms implicitly or explicitly in terms of sufficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.133,
    "end": 2587.997,
    "text": "If you fund me, we're going to fix this disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.417,
    "end": 2592.18,
    "text": "Like this is the grant that will be sufficient for fixing this disease.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.061,
    "end": 2599.645,
    "text": " Whereas saying that it's a necessary step, like we do need to understand how protein one, two, three works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.485,
    "end": 2603.067,
    "text": "It'll be necessary, but it's not the whole picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.127,
    "end": 2604.207,
    "text": "It's not sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2604.988,
    "end": 2612.312,
    "text": "So, so much when we really turn it over is related to necessity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.567,
    "end": 2626.517,
    "text": " because there's so many things that are necessary and so little, save for totally exhaustive examinations of really contrived systems, so rarely do we find sufficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.617,
    "end": 2632.261,
    "text": "Because if you can define sufficiency, you can make that bacteria in the test tube de novo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.362,
    "end": 2636.744,
    "text": "And then life, it's kind of like puts a little twist on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.784,
    "end": 2641.708,
    "text": "Like what would be necessary and sufficient for having a bacteria in a test tube?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.824,
    "end": 2646.246,
    "text": " putting a preexisting bacteria in and having it replicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.087,
    "end": 2660.816,
    "text": "So life, as this paper explores, it sort of threads the needle of necessity and sufficiency because the past is necessary and sufficient for living systems to be in the state that they're in now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.697,
    "end": 2666.04,
    "text": "And so that's like the generalization as well as the minute particulars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.174,
    "end": 2674.658,
    "text": " If anyone wants to ask a question, otherwise, I think it's good to take a second, look at the numerical example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.918,
    "end": 2675.698,
    "text": "Yes, blue first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.919,
    "end": 2686.704,
    "text": "So just like what got us to this point, the past is necessary, but not sufficient, but it just echoes the title.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2686.724,
    "end": 2688.805,
    "text": "Like how did we even get here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.926,
    "end": 2691.147,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.207,
    "end": 2693.508,
    "text": "So let's look at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.724,
    "end": 2716.524,
    "text": " bacteria and then of course we can jump around anywhere else okay so the numerical example is of a sensing and feeling a sentient bacteria not necessarily experiencing and action isn't even in the loop here but it's a sensing bacteria",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.495,
    "end": 2724.823,
    "text": " And so the organism is inferring its prior beliefs about the cause of the observations it makes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.724,
    "end": 2731.691,
    "text": "So it has a prior... Let's just go over the sort of letters again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.491,
    "end": 2735.835,
    "text": "So there's a class of events for the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.336,
    "end": 2736.936,
    "text": "So this is like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.186,
    "end": 2763.975,
    "text": " need a special color or some metadata tag like how can we tag map and how can we tag territory let's just use like one set of colors or one font like map comic sans territory some calligraphy script or something like that for the organism map of the organism now it's our map of the organism's map",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.276,
    "end": 2770.959,
    "text": " A and B are events that are part of the class R. And so R is like the receptor state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.14,
    "end": 2789.85,
    "text": "And then A and B are inferred downstream of a chemical signal, which is S. So S is like for signal and S is whether the actual molecule on the outside is the A or the B. And so this is kind of a discrete binary choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.286,
    "end": 2799.092,
    "text": " It's briefly discussed in the paper, like what happens if there's multiple molecules, or one could imagine that what's being inferred is a continuous variable, like blood sugar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.652,
    "end": 2803.815,
    "text": "But alpha and beta are S. That's the outside stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.496,
    "end": 2809.799,
    "text": "And then A and B are the organism's receptor inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.54,
    "end": 2810.76,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.842,
    "end": 2814.383,
    "text": "Go ahead, and then I'll just go at the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.051,
    "end": 2833.785,
    "text": " Yeah, so just to sort of look at it in figure one or in the formalism block that's in the paper, the organism has a prior and it's the specification of priors that differentiate Bayesian statistics versus frequentist statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.642,
    "end": 2837.663,
    "text": " among a few other pieces, but that's really the key piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.783,
    "end": 2848.068,
    "text": "And so the prior P of R is 80, 20 in favor of A. So a priori before, how did you get there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.468,
    "end": 2854.451,
    "text": "But a priori it's 80% likely that it's A and 20% B before any info comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.427,
    "end": 2858.048,
    "text": " then there's a likelihood mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.448,
    "end": 2864.19,
    "text": "So that's the distribution of the signal conditioned on the receptor state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.69,
    "end": 2877.493,
    "text": "So we're talking about what's the probability of alpha outside conditioned on A and B. And so it's 70 A and 30 for B and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.594,
    "end": 2883.315,
    "text": "So what's interesting about this is that's a pretty noisy signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.747,
    "end": 2896.358,
    "text": " It's really only saying, it's like if it were 50-50, it'd be a useless signal because it wouldn't, knowing it one way, well, it would also depend a little bit on the frequency of alpha and beta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.818,
    "end": 2900.562,
    "text": "But this is a very noisy signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.722,
    "end": 2905.186,
    "text": "Like 30% of the time, the receptor is giving the wrong answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.987,
    "end": 2909.009,
    "text": "So this is a way to show that with multiple signals,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.995,
    "end": 2914.738,
    "text": " uncertainties connected the right way, you can actually tighten your estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.599,
    "end": 2926.987,
    "text": "Because in this example, with an 80% prior on A, and then a 70% likelihood mapping, which is also A, that's more like classic ACT-INF jargon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.088,
    "end": 2934.292,
    "text": "After observing alpha, it turns out that the estimate of alpha is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.749,
    "end": 2947.138,
    "text": " The estimate of state being A conditioned on alpha being observed tightens that prior from 0.8 to 0.9.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.54,
    "end": 2960.865,
    "text": " So there's still a tightening of the prior by a significant amount, even though the mapping between the molecule and the receptor state is somewhat noisy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.665,
    "end": 2964.046,
    "text": "So that's like a Bayesian bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.546,
    "end": 2972.429,
    "text": "It's just applying Bayes' rule to this simple binary outcome that it's doing inference on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.429,
    "end": 2974.61,
    "text": "Blue, any thoughts there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.934,
    "end": 2982.156,
    "text": " Yeah, so this goes back to something that Dean brought up in the dot zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2982.256,
    "end": 2985.797,
    "text": "And it's actually something that Axel wrote in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2986.057,
    "end": 2988.878,
    "text": "Is the prior subjective or objective?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.598,
    "end": 2996.38,
    "text": "And the dysfunctional priors and the survivability of organisms with dysfunctional priors,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2997.24,
    "end": 3003.485,
    "text": " So I just feel like, I mean, I know Axel says it's subjective, but I feel like it's nested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3003.985,
    "end": 3010.711,
    "text": "So I feel like there's, the prior must be a subjective prior over an objective frequency, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3010.751,
    "end": 3014.273,
    "text": "Like, so if I frequently observe, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.214,
    "end": 3017.876,
    "text": " sunshine outside when it's warm or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.277,
    "end": 3021.7,
    "text": "Like if mostly when it's more, when I feel warm, I observe sunshine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.06,
    "end": 3027.725,
    "text": "So when I have these two things linked, like based on that frequency, I then make a subjective assumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3028.525,
    "end": 3033.69,
    "text": "And that's how I feel that the structure of the prior kind of has to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.61,
    "end": 3038.574,
    "text": "Otherwise, like it doesn't make sense to put the math into the prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.495,
    "end": 3042.777,
    "text": "Like in my mind, like if you can't,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3043.718,
    "end": 3051.208,
    "text": " If an objective prior is based on frequencies, but a subjective prior is not, a subjective prior is a guess, but it's a guess over the frequencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.288,
    "end": 3051.569,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.609,
    "end": 3057.397,
    "text": "I feel like there's like an extra layer that needs to be tucked into the subjective prior if you're going to put math there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3059.489,
    "end": 3079.002,
    "text": " one way that that's dealt with empirically and then dean is what's called parametric empirical bays and in parametric empirical bays you kind of start with just the prior being what you observed in the past so if you had eight sunny days and two rainy days that's where that 0.8 and 0.2 prior comes from so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.651,
    "end": 3086.112,
    "text": " It's not a way around specifying a prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.252,
    "end": 3091.113,
    "text": "It just starts your prior in a place that's empirically grounded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.934,
    "end": 3092.174,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.034,
    "end": 3095.055,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.355,
    "end": 3106.378,
    "text": "So I think in the point zero two, I was trying to figure out how the likelihood is really the kind of background that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.602,
    "end": 3109.062,
    "text": " And that's what Blue is kind of talking to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.082,
    "end": 3117.484,
    "text": "And I was wondering about in terms of context, because if I see a black dot on a white background, I think of period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.524,
    "end": 3129.227,
    "text": "Whereas if I see a white dot in a black background with a whole bunch of white dots, I think how many light years away is that concentration of hydrogen, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.887,
    "end": 3132.888,
    "text": "So again, we can decontextualize this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.339,
    "end": 3144.304,
    "text": " But if we do decontextualize, and this is where it gets really hard for me, I get lost in all of the terms, but if we do decontextualize it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.438,
    "end": 3153.063,
    "text": " does that help us in any way understand both the subjective and objective factors in play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.303,
    "end": 3154.964,
    "text": "That's all I'm wondering about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.004,
    "end": 3160.168,
    "text": "And again, I get lost in the number of different ways to be able to describe this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.448,
    "end": 3161.589,
    "text": "That's part of my problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.609,
    "end": 3165.071,
    "text": "I have an upper limit on how much of this stuff I can do at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.091,
    "end": 3167.933,
    "text": "If you want me to focus on days, I can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.013,
    "end": 3170.094,
    "text": "That's hard enough for me to concentrate on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.775,
    "end": 3174.097,
    "text": "But if you actually think about this, okay, so what does this actually...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.637,
    "end": 3202.815,
    "text": " imply in terms of entailment then it gets really really tricky because i can't just focus on one thing at once i got to sort of think about what all the implications of that are and man can never go off in different directions all at the same time so i don't want to be too tangential here but yeah that i i'm still not sure whether the subjectivity in isolation can work i'm not saying it can't i don't know thanks dean blue then dave",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3204.679,
    "end": 3209.662,
    "text": " So in like the empirical parametric base, that would be like an objective prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.822,
    "end": 3213.183,
    "text": "Like, do you have subjectivity in empirical parametric base?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.263,
    "end": 3215.765,
    "text": "Because like, that's what Axel was describing in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3215.805,
    "end": 3218.986,
    "text": "You do, you can have an objective prior based on frequencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.046,
    "end": 3219.687,
    "text": "Like it's 80% of the time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.759,
    "end": 3222.86,
    "text": " you know, sunny and 20% of the time rainy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.92,
    "end": 3227.623,
    "text": "And so you get these frequencies and that's what goes into constructing an objective prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.163,
    "end": 3236.388,
    "text": "But when it comes to like an organism and a choice or even like a scientist conducting an experiment, you know, like why would you even do the experiment in the first place?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3236.568,
    "end": 3237.728,
    "text": "You have a guess, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.748,
    "end": 3240.39,
    "text": "Like you have something that you think will be the outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3240.45,
    "end": 3243.532,
    "text": "And so like a totally subjective prior is like, well, I think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3244.572,
    "end": 3247.135,
    "text": " 60% of the time it's gonna be blah, blah, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.175,
    "end": 3248.917,
    "text": "And like, that's a completely subjective prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3248.977,
    "end": 3259.088,
    "text": "It's just your best guess, which if you're gonna try to really do objective Bayesian analysis, like you need to have a flat prior, not your best guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.848,
    "end": 3264.492,
    "text": " Your prior needs to come from previous observations and not you guessing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3265.072,
    "end": 3272.158,
    "text": "But you could very well not do a very empirical or objective Bayesian analysis and just say, my guess is this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3272.318,
    "end": 3275.761,
    "text": "And then you count, make the observations, observe the frequencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3276.021,
    "end": 3278.403,
    "text": "You go through the entire time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3278.483,
    "end": 3283.747,
    "text": "And then at your next time step, there is that tightening between the previous likelihood and the prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3284.207,
    "end": 3284.848,
    "text": "So that is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3287.089,
    "end": 3299.155,
    "text": " I mean, as far as I understand it, now I'm definitely not an expert, but so I think like the subjectivity and objectivity is, I don't know, I think that there's some link there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.215,
    "end": 3307.498,
    "text": "Like I get it for scientific Bayesian data analysis, like you want to have a flat prior, you want to do objective analysis, you want to use the previous frequencies or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.539,
    "end": 3312.521,
    "text": "But I think that in terms of a mental calculation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.675,
    "end": 3316.578,
    "text": " it's also over frequencies or it's your best guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3316.778,
    "end": 3318.54,
    "text": "Like, what do you think will be the outcome?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.76,
    "end": 3320.141,
    "text": "And it's not always, it doesn't always line up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.181,
    "end": 3320.361,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.682,
    "end": 3322.123,
    "text": "Thanks blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.203,
    "end": 3322.483,
    "text": "Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.546,
    "end": 3325.906,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.267,
    "end": 3326.407,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.233,
    "end": 3334.479,
    "text": " The term decontextualized, I kind of, that shocked me when Professor Jarren started using that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.519,
    "end": 3336.54,
    "text": "I said, decontextualized?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3336.621,
    "end": 3344.227,
    "text": "That's just some sudden jerk opens his mouth and decontextualized his feelings at me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3344.991,
    "end": 3348.612,
    "text": " you know, if I want to know what's going on, I hyper-contextualize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.752,
    "end": 3352.733,
    "text": "I'm particularly attentive to my own prejudices and my own viewpoint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.213,
    "end": 3357.274,
    "text": "You know, think about what goes, you know, Einstein hated the word relativity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.314,
    "end": 3373.938,
    "text": "He wanted to come up with something like hyper-contextualized or the real world or the tensor description where you don't have to ask where are you because you have the structure of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.862,
    "end": 3378.966,
    "text": " What do people mean by decontextualize?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3379.827,
    "end": 3383.651,
    "text": "Is it a term of praise as well as a term of contempt?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.991,
    "end": 3385.853,
    "text": "Or have I just always misunderstood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3385.873,
    "end": 3385.933,
    "text": "Liv?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.22,
    "end": 3392.541,
    "text": " So I love this term, hyper-contextualize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.322,
    "end": 3397.283,
    "text": "And I don't know that I would use it in the way that you use it, Dave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.684,
    "end": 3403.426,
    "text": "I would use it like, I would play out all of the potential, like, what ifs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3403.587,
    "end": 3406.508,
    "text": "Like, let's talk about counterfactuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.568,
    "end": 3410.27,
    "text": "Can we put it into, you know, how many different contexts will it fit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.31,
    "end": 3416.813,
    "text": "And that's when I think about hyper-contextualization, it's like playing out all the potential scenarios for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3419.687,
    "end": 3419.967,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.327,
    "end": 3420.568,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.488,
    "end": 3440.242,
    "text": "Yeah, and building on what Blue just said, so I saw a YouTube video where a guy had figured out a way to make a target move so that no matter where you threw the dart, as long as you were directing it towards the dart board, the target would create",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.345,
    "end": 3445.227,
    "text": " the algorithm would create the target moving so that you hit a bullseye every time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.908,
    "end": 3447.309,
    "text": "And I was a phys ed teacher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.329,
    "end": 3449.73,
    "text": "I was like, oh, this is amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.77,
    "end": 3453.273,
    "text": "And I took it to one of my colleagues who shall remain nameless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.293,
    "end": 3456.254,
    "text": "And I said, we should show this video to the kids.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.695,
    "end": 3457.735,
    "text": "And he was like, why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.755,
    "end": 3460.157,
    "text": "And I said, well, think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.197,
    "end": 3466.781,
    "text": "Every time a person moves their hands to catch the ball, they're making the same kind of adjustment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.821,
    "end": 3468.042,
    "text": "And it was like a light went off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.15,
    "end": 3484.242,
    "text": " A lot of the things that I was coaching were then decontextualized, and the proof was in the fact that when you saw something out of context that was running the same parallel function, you didn't necessarily recognize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.723,
    "end": 3488.306,
    "text": "So this was a really – I love hypercontextualized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.408,
    "end": 3492.629,
    "text": "So I wonder if that's like abstraction or –",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.738,
    "end": 3516.257,
    "text": " de-irrelevant contextualizing you take away the irrelevant part of that setting which is oh it's hands or some other specific system and then that paradoxically gets you to hyper contextualize because it does highlight the parts of the context that matter dave",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.166,
    "end": 3524.529,
    "text": " And there's that famous phrase from 1923, consciousness of abstracting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3526.209,
    "end": 3534.012,
    "text": "Training people to think scientifically, one of the first things you do is get them really aware that they're how much they're missing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.393,
    "end": 3538.714,
    "text": "You're abstracting away from at least 90% of whatever you're looking at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3541.215,
    "end": 3547.858,
    "text": "And since I've got the mic, there was the question of how a fielder catches a baseball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.84,
    "end": 3566.5,
    "text": " fly ball here it comes it's coming out of the sky at you and you know a good fielder knows how to do that you ask him how do you well i just i just go to where the ball's gonna be but he can't tell you how and there were a bunch of people mathematicians and programmers and physiologists or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3566.96,
    "end": 3570.002,
    "text": " And philosophers, how in the world are they doing this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.042,
    "end": 3573.485,
    "text": "It looks like they can't because we can't come up with an algorithm that does it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3573.985,
    "end": 3576.467,
    "text": "And they finally watched them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.227,
    "end": 3584.192,
    "text": "And I guess they got one guy that's high on whatever it is, openness, the big five.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3585.033,
    "end": 3587.074,
    "text": "And they says, well, what are you doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.374,
    "end": 3589.676,
    "text": "How do you know that you're going to catch the ball?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3590.116,
    "end": 3593.979,
    "text": "Oh, I know I'm going to catch the ball when I look at it and it doesn't move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.931,
    "end": 3596.511,
    "text": " It doesn't move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.551,
    "end": 3597.651,
    "text": "Yeah, it just hangs there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3597.671,
    "end": 3603.832,
    "text": "And I put up my mitt, and I know where it's going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.132,
    "end": 3605.273,
    "text": "It's going up my mitt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.953,
    "end": 3606.713,
    "text": "And it's not moving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3607.213,
    "end": 3609.153,
    "text": "And it's in my mitt, and it didn't move then either.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.494,
    "end": 3611.374,
    "text": "That's how they get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.414,
    "end": 3619.055,
    "text": "They figure out what point in the field makes it look like the ball's not going to move as it comes toward there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.155,
    "end": 3619.855,
    "text": "And that's where you go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3620.595,
    "end": 3623.936,
    "text": "And then it just hangs in the field until it's in your mitt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3626.482,
    "end": 3628.243,
    "text": " Classic baseball physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.224,
    "end": 3631.906,
    "text": "The other thought was, have you ever been high on openness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.987,
    "end": 3635.348,
    "text": "But then it's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.528,
    "end": 3636.869,
    "text": "There is a simple algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.889,
    "end": 3640.091,
    "text": "Like if you're looking and it's to the left, then you should go to the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.131,
    "end": 3641.272,
    "text": "If you're looking, it's to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.512,
    "end": 3643.493,
    "text": "And then you're cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.913,
    "end": 3648.236,
    "text": "Active baseball and anticipation and the path of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.256,
    "end": 3648.336,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.206,
    "end": 3652.948,
    "text": " you want to talk about high on openness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3652.988,
    "end": 3656.271,
    "text": "I don't know that it reminds me of our conversations with Adam Saffron.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.331,
    "end": 3656.512,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.592,
    "end": 3669.185,
    "text": "And so like what the psychedelic, like I would like to see like the psychedelic, like comparison with big five, like the integration of those two kind of things in terms of active inference, because I do think that, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3670.246,
    "end": 3674.772,
    "text": " the openness like increases a lot under, under the psychedelic influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3674.812,
    "end": 3681.682,
    "text": "And so it's, it's not, have you been high on openness, but has being high ever made you more open maybe is a different question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.385,
    "end": 3695.412,
    "text": " And well, a few things, there's sort of the rebus, cebus, albus, relaxation of beliefs under psychedelic strengthening, or just the altering of beliefs with Fristin, Karhar Harris, Saffron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.353,
    "end": 3702.917,
    "text": "And what is being, what priors are being opened, which priors are being tightened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.317,
    "end": 3706.499,
    "text": "And that was sort of at the heart of the rebus versus cebus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.699,
    "end": 3707.42,
    "text": "And then the sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.36,
    "end": 3726.466,
    "text": " um hegelian synthesis in albus and then also in terms of how we got here the first two weeks of january was live stream number 13 with adam and colleague on the cybernetic big five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.867,
    "end": 3738.29,
    "text": " And so that actually sort of started our year with thinking about how frameworks that a priori have nothing to do with Act-Inf or FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.69,
    "end": 3747.692,
    "text": "Like big five was a principal component analysis based various partitioning on psychometric data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.032,
    "end": 3755.654,
    "text": "Yet we saw how Act-Inf could help us reimagine that and generalize it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.584,
    "end": 3783.196,
    "text": " while also bringing action into the loop so then it's kind of cool to see how the personality traits come back into play uh Dave and then we're going to return to bays and then we're going to move into the variational free energy well stop me if I already mentioned this but um there's been some uh chronological studies of the way psychedelics are used by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.031,
    "end": 3786.552,
    "text": " as a recruiting tool of violent cults.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3787.793,
    "end": 3799.1,
    "text": "You go to a rally in favor of I will not say whom, and if somebody seems like they're really grooving and really into it, you give them a little ecstasy, and that locks them into the mentality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3800.44,
    "end": 3813.728,
    "text": "And if he's kind of getting fired up, but he's not quite with it, you take him home, you give him some LSD, and you take him through the session, and that moves him out of what he was in and moves him into where he needs to be in order to do the right things in life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3814.73,
    "end": 3822.834,
    "text": " Maybe another little bit of ecstasy now and then over subsequent months to just get him locked back in where he needs to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3823.114,
    "end": 3831.398,
    "text": "Just like Safran was saying, you either get him out of where he is or you get him right deep into where he is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3832.449,
    "end": 3842.393,
    "text": " Well, there's a long history of people engaging in experiences, taking substances to move their psychodynamics one way or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.413,
    "end": 3855.718,
    "text": "I think the active streams verge on it, but we also remind people to be responsible and legal with their behavior and with the one and only brain and mind that they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.914,
    "end": 3866.021,
    "text": " Let's return to the Bayesian maths and then see how that Bayesian bacteria moves into the variational free energy bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.981,
    "end": 3872.025,
    "text": "But I pulled out that one quote from a online statistics resource.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.465,
    "end": 3878.91,
    "text": "So we can, you know, the 0.0 is the frequentest bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.731,
    "end": 3884.314,
    "text": "And so the frequentest is basically looking at the outcome of an experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.913,
    "end": 3890.577,
    "text": " You flip the coin 10 times, it comes up seven heads and three tails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.957,
    "end": 3898.683,
    "text": "Now that's not the most likely possible outcome for a fair coin, but it's totally not an unexpected outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.543,
    "end": 3903.486,
    "text": "So in that case, the frequentist can produce a 95% confidence interval",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.345,
    "end": 3919.431,
    "text": " given the variance granted by the sample size and say, okay, if I get within these two numbers, then I'm going to fail to reject the hypothesis that it's fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.551,
    "end": 3925.494,
    "text": "If I'm outside of those two numbers with my empirical results, I will reject at a given p-value, a given alpha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.154,
    "end": 3931.217,
    "text": "And so for the frequentist, there's no sense in asking about the probability that the coin is fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.497,
    "end": 3932.958,
    "text": "It is either fair or not fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.298,
    "end": 3935.359,
    "text": "So that's like, accept the hypothesis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3936.351,
    "end": 3942.433,
    "text": " implicitly because of the failure to reject or reject the null hypothesis in favor of a specified alternative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.653,
    "end": 3955.617,
    "text": "The frequentist makes statements about the probability of a sample after making an assumption about the population parameter, which is just the kind of averaged out value of the probability of tossing a Hess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.516,
    "end": 3961.279,
    "text": " The Bayesian, in contrast, starts with information about coins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.02,
    "end": 3964.422,
    "text": "So specifies some distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.842,
    "end": 3973.128,
    "text": "So it could be like a bell curve, a Gaussian centered at 0.5, could be a super tight prior, could be a very loose prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.588,
    "end": 3978.732,
    "text": "And then the extreme case of the Gaussian with infinite variance is the uniform distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.372,
    "end": 3982.635,
    "text": "And so that is like a flat across all the possible values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.778,
    "end": 3988.301,
    "text": " That probability assessment of the head's proportion is called the prior probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.621,
    "end": 3993.466,
    "text": "Each person might have their individual assessment based on their personal experience called a subjective prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.067,
    "end": 4000.912,
    "text": "Alternatively, a prior probability distribution might be selected on good properties of the resulting estimates called an objective prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.988,
    "end": 4011.157,
    "text": " I don't know if this is the only way to use subjective and objective in the Bayesian context, but this is just an important difference between frequentism and Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.718,
    "end": 4014.581,
    "text": "So here is our Bayesian bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.342,
    "end": 4025.272,
    "text": "Again, it has some A matrix that's mapping the signal condition on the receptor state, and then it has a prior over those receptor states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.616,
    "end": 4039.042,
    "text": " That Bayesian bacteria then, again, it's a Bayesian perceiving bacteria, we're not bringing action into the loop yet, but we're just assuming like if you had the right estimate, then it would be easier to know what to do correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.542,
    "end": 4051.488,
    "text": "This is called exact Bayes because the exact numbers are plugged in and then there's some exact number that comes out and it's pretty much just granted by Bayes' rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.688,
    "end": 4053.348,
    "text": " What's the issue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.049,
    "end": 4064.133,
    "text": "Well, it's unclear whether living systems have sufficient computational power to accomplish that, especially when there's just massive multivariate landscapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.913,
    "end": 4068.194,
    "text": "So what is the answer in the FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.835,
    "end": 4075.958,
    "text": "Well, instead of doing exact Bayes, there's what's called variational Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.598,
    "end": 4081.14,
    "text": "So here we're going to propose this Q function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.011,
    "end": 4094.056,
    "text": " And the Q function is going to be from a family that is specified a priori, and it is more easily fit than just sort of the exact base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.077,
    "end": 4102.36,
    "text": "And then the way that we compare is not by comparing at the end, the posterior likelihood,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.459,
    "end": 4111.101,
    "text": " but rather we can compare different options by comparing their free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.261,
    "end": 4115.161,
    "text": "And this is how free energy is being defined here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.262,
    "end": 4133.045,
    "text": "It's the negative sum over R, those are the receptor states, A and B, of some Q distribution, and then the natural log of the joint distribution of the states R and the signal alpha",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.437,
    "end": 4138.739,
    "text": " multiplied, then divided by QR.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4139.699,
    "end": 4145.301,
    "text": "And so then in dot zero, we explored a little bit about how that's like the recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.982,
    "end": 4158.066,
    "text": "That's like we're going contingent on alpha, and now we're doing a hyperparameter estimate, like alpha, we're going to A, and then what we're not gonna be exploring here is like a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.506,
    "end": 4161.968,
    "text": "And then we talked about how those map onto perception and action in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.001,
    "end": 4169.325,
    "text": " So then the numerical example shows that, okay, so the Bayesian bacteria, it did the right thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4169.845,
    "end": 4172.387,
    "text": "It didn't go to that rally that Dave was telling it to go to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.087,
    "end": 4185.355,
    "text": "But we can also have a free energy minimizing creature, bacterium, and we're going to see a case in which the free energy minimization does the right thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.035,
    "end": 4189.037,
    "text": "And we're going to see a case where the free energy minimization does the wrong thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.79,
    "end": 4195.434,
    "text": " The difference between these two cases is going to be the prior that's set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.235,
    "end": 4208.444,
    "text": "And so that is the crux of the argument that minimizing free energy is not sufficient to be alive, AKA make the right decisions, because both of these examples are going to minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.025,
    "end": 4212.548,
    "text": "And one of them is going to minimize free energy in the right direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.638,
    "end": 4221.466,
    "text": " and make the right choice because it had appropriate priors, a maladaptive priors can minimize free energy, but still result in the wrong outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.166,
    "end": 4234.598,
    "text": "So in this case, we have the free energy calculation for this 80, 20 prior with a favor of A and contingent on observing alpha,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.646,
    "end": 4241.447,
    "text": " the free energy of this is 0.47, which doesn't have an interpretation as a probability, importantly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.187,
    "end": 4244.868,
    "text": "So we're not within that zero to one bounded space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.548,
    "end": 4255.71,
    "text": "And then in contrast, the representation of B, so that QR setting that to B, that has a free energy of 2.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.11,
    "end": 4261.771,
    "text": "So free energy minimization saves the day in that context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.168,
    "end": 4269.07,
    "text": " However, it's not simply because the free energy was minimized that the right decision was reached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.67,
    "end": 4272.411,
    "text": "Here is a creature with a prior on B of 0.8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.011,
    "end": 4289.395,
    "text": "And then we see that just barely, upon observing alpha, the free energy of representing B after sensing A is 0.96, and the F when representing A after sensing alpha is 1.094.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.656,
    "end": 4311.863,
    "text": " So the Enzing posterior likelihood is 63% in favor of B and 37% in favor of A. So we sort of did move the needle towards A because we observed alpha, but our prior was so far off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.642,
    "end": 4317.327,
    "text": " that just one cycle of free energy minimization still results in the wrong outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.167,
    "end": 4321.631,
    "text": "That's the crux of the numerical example provided in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.572,
    "end": 4327.596,
    "text": "And the only point that it's being made, not this is how you'd model a bacteria with the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.078,
    "end": 4333.923,
    "text": "The point it's making is free energy minimization is not sufficient for life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.125,
    "end": 4336.305,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.715,
    "end": 4340.517,
    "text": " So Daniel, I got a question to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.637,
    "end": 4350.787,
    "text": "So I don't know, because we're just talking about sensing, we're not talking about, you mentioned doing, but is it doing or is it directing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.887,
    "end": 4354.671,
    "text": "So because of the sample sensed,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.942,
    "end": 4362.529,
    "text": " And because of what the math points to, should we think of this kind of analogous to a compass?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.569,
    "end": 4363.85,
    "text": "We're pointed in the right direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4363.87,
    "end": 4368.555,
    "text": "We still haven't actually acted or developed a feeling from the sense yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.675,
    "end": 4372.319,
    "text": "We're still pre-doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.08,
    "end": 4375.062,
    "text": "We're orienting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.362,
    "end": 4378.966,
    "text": "Is that or am I wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.195,
    "end": 4387.979,
    "text": " So if anyone else has a thought after this, I think there's a few aspects to this compass and orienting approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.859,
    "end": 4406.969,
    "text": "So this little toy motif about the recognition model, about having a prior over states in the world and then getting some input, that could be plugged into an action model in a slightly more elaborate case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.169,
    "end": 4410.151,
    "text": "So for example, as written in the caption for figure one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.454,
    "end": 4415.41,
    "text": " More biologically realistic descriptions of behavior require discussion of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.783,
    "end": 4417.423,
    "text": " They require it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.004,
    "end": 4419.525,
    "text": "It's necessary and sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.785,
    "end": 4420.846,
    "text": "You just have to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.547,
    "end": 4425.57,
    "text": "Behavior is the result of a different inference process, that of an action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.77,
    "end": 4428.832,
    "text": "So pi is not here in this bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.533,
    "end": 4436.298,
    "text": "This involves more priors, namely about the transition between hidden states and often about preferred sensory outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.058,
    "end": 4445.084,
    "text": "So in active inference with a partially observable Markov decision process, we've seen how there's like a matrix of the transition frequency B",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.405,
    "end": 4450.328,
    "text": " between the states at one time and the states at the next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.008,
    "end": 4467.8,
    "text": "And then policies are inferred based upon which policies minimize free energy, which ones are going to have the best chance through time of bringing states into alignment with preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.81,
    "end": 4479.255,
    "text": " The other thing that it made me think about with the compass is like the exact base just returns a probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.515,
    "end": 4482.916,
    "text": "And that is sort of like one compass needle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.066,
    "end": 4489.35,
    "text": " giving you just saying, okay, you're going north by northwest or whatever it happens to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.53,
    "end": 4490.931,
    "text": "This is your one estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.712,
    "end": 4499.799,
    "text": "And you could be wildly off, but given where you were, and then just one blip of information, that's where your compass needle is now pointing to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.98,
    "end": 4506.225,
    "text": "Free energy, it's almost like there's two compass needles in this binary choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4507.226,
    "end": 4511.93,
    "text": "And then we're going to select which one has a lower free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.342,
    "end": 4523.784,
    "text": " because we're looking, the fact that this is 0.478 F and this was 2.27, they don't have a natural interpretation, just like entropies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.104,
    "end": 4532.606,
    "text": "You can talk about the difference in entropy, but something having like four doesn't have an interpretation in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.686,
    "end": 4542.748,
    "text": "And so it's kind of maybe like there's two different compass needles and we're looking at the difference between them, or we're going to select the one that has a lower free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.82,
    "end": 4544.0,
    "text": " Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.381,
    "end": 4549.002,
    "text": "Yeah, I don't want to say that orienting isn't a form of doing as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.622,
    "end": 4559.066,
    "text": "It's just that what this shows me is that, I cut out again, but when we're trying to determine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.676,
    "end": 4566.037,
    "text": " A and B with a background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.998,
    "end": 4568.418,
    "text": "We haven't taken an action step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.458,
    "end": 4570.179,
    "text": "We haven't developed a feeling yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.899,
    "end": 4581.304,
    "text": "Do we categorize that differently than if we were to look at this through an active inference lens where we would then push a policy forward, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.104,
    "end": 4586.646,
    "text": "So I'm not sure does the orienting fitting fit into the policy piece or is it pre-policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.686,
    "end": 4588.707,
    "text": "That's what I'm trying to get clear in my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.228,
    "end": 4592.769,
    "text": "Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.182,
    "end": 4623.585,
    "text": " makes me think about the uda observe orient decide act loop and about our recent paper that connected active to the ouda stages orienting i think in this reduced example the um the north pole north star whatever it is is the prior like that is what is oriented relative to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4625.157,
    "end": 4628.239,
    "text": " So that's a purely recognition model sense of orienting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.539,
    "end": 4636.685,
    "text": "Whereas in the physical realized world, orienting has much to do with action and wayfinding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.966,
    "end": 4642.769,
    "text": "But this is sort of in the recognition toy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.85,
    "end": 4650.854,
    "text": "There is still an orientation of the prior, but I'm not 100% sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.894,
    "end": 4651.535,
    "text": "What do you think, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.254,
    "end": 4663.162,
    "text": " What I find interesting is that when I look at this and I see a 0.8 and a 0.2, it's very clear that we're somewhere between 0 and 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.943,
    "end": 4671.009,
    "text": "But when we're actually getting to that wave binding space and we're talking about entailment, one hole over two holes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.938,
    "end": 4674.859,
    "text": " is different than two over one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.56,
    "end": 4683.346,
    "text": "So as soon as we move past one into some of the more, as you say, material realities that we have to face down,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4684.474,
    "end": 4706.812,
    "text": " that's when those actions become material like we can see what the process ontology is but what axel did was he brought the process ontology down to it even even closer to zero point because he was using free energy principle and he's talking about free energy principle and bayesian stuff so again sometimes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.927,
    "end": 4729.101,
    "text": " I have a general sense of this stuff and just enough to get me into trouble and be an insurgent and point at people who are really, really smart and kind of go, I think I know what you're on to, but it doesn't get me deep enough to be able to write a parallel paper to axles and sort of either build them up or tear them down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.785,
    "end": 4731.986,
    "text": " Yeah, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.786,
    "end": 4733.667,
    "text": "That's why I'm asking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.727,
    "end": 4744.873,
    "text": "I don't know where orienting fits in this because I think it fits in the zero to one space and I think it fits in the one to three space as the dimensionality blows out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.174,
    "end": 4749.856,
    "text": "That's back to the subjective objective crossing back and forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.916,
    "end": 4757.021,
    "text": "And again, I just come off sounding like a complete idiot here because there's somebody way smarter than me who can blow my argument up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.261,
    "end": 4758.622,
    "text": "But at least I'm putting it out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.662,
    "end": 4759.242,
    "text": "I'm showing up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4761.013,
    "end": 4767.417,
    "text": " Oh, by being on a live stream and talking about it, you're like 80% of the way to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.437,
    "end": 4770.039,
    "text": "Dave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.96,
    "end": 4777.043,
    "text": "Is there something in this context that would correspond to urgency?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.085,
    "end": 4789.872,
    "text": "And I'm particularly thinking in the terms that Freud was concentrating on when he talked about how to get people to be less neurotic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4789.932,
    "end": 4790.292,
    "text": "He says...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.597,
    "end": 4801.645,
    "text": " The point that a person is in real trouble as a neurotic is when the dominant factor in his life is reducing his anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4802.906,
    "end": 4806.309,
    "text": "And what we want to do is to get him to tolerate his anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4806.669,
    "end": 4808.871,
    "text": "Tolerate, for instance, ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4809.191,
    "end": 4812.314,
    "text": "Not knowing is my wife mad at me or not, but don't get crazy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.134,
    "end": 4815.196,
    "text": "Sometimes you just can't do anything about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.383,
    "end": 4818.425,
    "text": " calm down, tolerate the anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.765,
    "end": 4822.628,
    "text": "Is there something, and I'm just taking that as a case of urgency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4822.748,
    "end": 4825.69,
    "text": "Urgency seems like something that would fit into this literature better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4826.511,
    "end": 4826.671,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4827.592,
    "end": 4827.812,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.794,
    "end": 4834.397,
    "text": "So I just want to, like, so I don't know about urgency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4834.777,
    "end": 4845.086,
    "text": "I'm going to kind of derail off of that and more hook onto this toleration of anxiety or toleration of circumstances that are not preferable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4845.666,
    "end": 4848.988,
    "text": " for like a later, more preferable outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4849.749,
    "end": 4855.572,
    "text": "And so this is something that is taught like, I don't know, in self-development, like a lot, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4855.592,
    "end": 4857.514,
    "text": "Like you have to put yourself out of your comfort zone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4857.874,
    "end": 4865.619,
    "text": "But I mean, also like in like the meditative traditions, like learning to like be with that discomforting feeling and not like, you don't have to like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4865.959,
    "end": 4867.7,
    "text": " get all upset and do anything about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4868.821,
    "end": 4882.332,
    "text": "So I just wonder if that fits, like it's a different thing, different than urgency, but what about like, where's the temporal, there has to be like a loop, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4882.392,
    "end": 4887.856,
    "text": "Like I'm going to tolerate this bad thing for something that I think will be like a more predictive outcome later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.916,
    "end": 4890.038,
    "text": "Like how can I base that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4890.658,
    "end": 4893.641,
    "text": "That would be like an interesting mathematical way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.943,
    "end": 4895.783,
    "text": " thing to try to work out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4896.624,
    "end": 4896.824,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.084,
    "end": 4900.125,
    "text": "I added a slide here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.405,
    "end": 4902.125,
    "text": "Here's the Eisenhower matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.246,
    "end": 4907.447,
    "text": "So the X axis is urgent to not urgent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.587,
    "end": 4910.268,
    "text": "And then the Y axis is important to not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.368,
    "end": 4921.112,
    "text": "So one of the reasons why this is such a useful and well-known tool is it separates urgency from importance because there's things that are urgent, like a chat message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.073,
    "end": 4928.554,
    "text": " that urge you to do something, or they have sort of a short time horizon, but then there's things that are important or not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.495,
    "end": 4939.097,
    "text": "And then there's an orientation when you're figuring out what is in what quadrant, kind of like the Rumsfeld matrix as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4939.757,
    "end": 4943.378,
    "text": "And then that has implications for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.847,
    "end": 4947.148,
    "text": " So let's see, urgency and anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.428,
    "end": 4957.273,
    "text": "Dave, you mentioned, I don't know about the Freudian urgency concept much, but it's of course with Soames, with Friston and the Project for Scientific Psychiatry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.473,
    "end": 4960.935,
    "text": "There's some clear links there, so it wouldn't be unexpected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.955,
    "end": 4965.297,
    "text": "And then the idea that the imperative is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.437,
    "end": 4994.04,
    "text": " is to reduce our uncertainty through updating our model learning and through action so the reduction of anxiety is an imperative and then sometimes it crosses a threshold towards being truly urgent so it's kind of always in the background but then other times it really is urgent but it's always important and then blue i i agree um delayed gratification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.123,
    "end": 5007.308,
    "text": " It's like having the time horizon depth to take the right policy selection today so that your expected free energy is higher in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.028,
    "end": 5014.31,
    "text": "So it's like, would you rather have $1 every day or $1,000 in one year?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.271,
    "end": 5021.813,
    "text": "Depending on how badly you need the money today and what you think you'll do with it in the meantime and all these other things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5023.36,
    "end": 5029.742,
    "text": " one person given their priors might minimize free energy and come to two different conclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.742,
    "end": 5048.887,
    "text": "And I think that's where we return to this subjective versus objective FEP take, which is like a person could rationally evaluate given their subjective priors and choose to take that marshmallow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.427,
    "end": 5053.729,
    "text": " maybe that is just the weighting that they have on their priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.109,
    "end": 5063.754,
    "text": "Or maybe somebody does the opposite and that is just where their priors and that stimuli, that's the action selection that they take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.834,
    "end": 5075.38,
    "text": "And so I'm not sure how all these pieces tie together, but I think it speaks to the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.193,
    "end": 5105.175,
    "text": " the the logic of action and inference and we want to have a logic of action and inference or a framework for it that is broad enough to accommodate like making bad decisions if our action and inference framework is only about tightly constrained scenarios that are addressable then it doesn't really help us as much with real world scenarios",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.206,
    "end": 5116.09,
    "text": " But it will be very cool to see how a lot of these daily phenomena connect to the things that we're talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.712,
    "end": 5122.333,
    "text": "So let's see what else we had in the pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.413,
    "end": 5134.078,
    "text": "And also, if Axel is listening or wants to join for a .2 next week or for a future .3, I think there's probably many things we could ask and what brought you two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5135.051,
    "end": 5138.133,
    "text": " write this paper, and then where do you go after this one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.993,
    "end": 5156.863,
    "text": "But pretty much the paper delivers the mic drop, the coup de grace, with the free energy minimizing bacteria, which has bad priors, or let's just say maladaptive priors, and it minimizes free energy and makes the wrong decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.324,
    "end": 5159.345,
    "text": "So that's where that section concludes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.697,
    "end": 5166.66,
    "text": " Then there's a jump back to the more philosophical framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5167.54,
    "end": 5175.005,
    "text": "So although free energy minimization is not sufficient for life, there might be an entailment relation that goes the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.986,
    "end": 5181.57,
    "text": "If you are alive, it might very well be because you did something like minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.674,
    "end": 5189.057,
    "text": " That entailment relation is that which corresponds to the weak version of the life free energy entailment relation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.398,
    "end": 5204.906,
    "text": "So remember way back when, when we were looking at the relationship between life and minimizing free energy, this example has decimated the strong claim, blown out, make a YouTube reaction video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5206.653,
    "end": 5219.444,
    "text": " but the weak claim is actually supported because it seems like making adaptive decisions is consistent with free energy minimization, just like it would be with making adaptive Bayesian decisions, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.049,
    "end": 5222.311,
    "text": " We can say that it's not sufficient to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.232,
    "end": 5227.175,
    "text": "And then the name of the section, free energy on a wing and a prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.096,
    "end": 5230.478,
    "text": "So yuck, yuck, yuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.058,
    "end": 5239.745,
    "text": "Anyone can give a comment on that, but we just sort of were reminded of two winged creatures that we have talked about only a few weeks ago in 32.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.707,
    "end": 5247.511,
    "text": " There's the winged snowflake and then the Lepidoptera to a flame, the moth to a flame over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.932,
    "end": 5261.6,
    "text": "And about how in this snowflake example, so go to 32 to check it out in more detail, but it's like the snowflakes with wings that act adaptively are going to persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.04,
    "end": 5270.065,
    "text": "And those are the ones that are going to be looking as if they've minimized free energy in selecting the correct action policies, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.472,
    "end": 5273.153,
    "text": " Whereas the ones that don't exist just aren't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.673,
    "end": 5275.893,
    "text": "If it makes bad decisions, it's going to fail to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.514,
    "end": 5295.678,
    "text": "So it's an interesting section and it uses sort of evolutionary logic in a little bit of a different way because the evolutionary answer for everything is just sort of like, that's what was favored by evolution slash selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5297.402,
    "end": 5314.8,
    "text": " uh why does this organ have this shape it's like well that's what was selected on and so that's just that's just why it is that way even though we've talked about timber again other things we know there's multiple whys um but here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5316.792,
    "end": 5324.779,
    "text": " we can now see the adaptivity of priors instead of relative fitness, merely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.939,
    "end": 5326.92,
    "text": "Blue, as we know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5327.461,
    "end": 5329.082,
    "text": "More information here soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.763,
    "end": 5332.345,
    "text": "But the adaptivity of the priors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.547,
    "end": 5339.65,
    "text": " we'll be looking as if it has been minimizing free energy at the population level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.41,
    "end": 5354.636,
    "text": "So whether we frame natural selection as increasing individuals with fitness or increasing the mean fitness of the population, but not necessarily the relative fitness, we can also do the same, but rather with a Malthusian exponent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5355.8,
    "end": 5363.905,
    "text": " or some other kind of economic fitness parameter, we can think about it in terms of the free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5364.025,
    "end": 5364.225,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.446,
    "end": 5376.171,
    "text": "Yeah, I keep falling off here, so I'm going to have to get past all the hidden stuff that you guys talked about when I wasn't staying on the broadcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5376.191,
    "end": 5384.376,
    "text": "But what this points to me is interesting is because back to the previous slide you talked about, my first...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5386.804,
    "end": 5387.424,
    "text": " RIP Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.585,
    "end": 5390.606,
    "text": "Please, F in chat for Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.127,
    "end": 5395.688,
    "text": "He'll rejoin in just a few seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.289,
    "end": 5398.93,
    "text": "Sorry, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5399.11,
    "end": 5399.47,
    "text": "Continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.17,
    "end": 5401.171,
    "text": "Yeah, is it a wing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.451,
    "end": 5403.652,
    "text": "My first question is, is it a wing as wing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5404.369,
    "end": 5407.65,
    "text": " And then second, what does it still serve a function?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5407.67,
    "end": 5408.971,
    "text": "Like, could I use it to fly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.891,
    "end": 5413.132,
    "text": "And so that's where the adaptive piece actually comes in for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5413.172,
    "end": 5417.574,
    "text": "So again, there's two questions, necessity and sufficiency, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.654,
    "end": 5419.854,
    "text": "And you can even see it in the representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.235,
    "end": 5424.116,
    "text": "Is there enough information in the representation that I identify it as wing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5424.496,
    "end": 5425.817,
    "text": "And then the second part of it is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5427.217,
    "end": 5432.879,
    "text": " well then I can see it can carry a moth or I can see it can carry a snowflake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5433.119,
    "end": 5434.48,
    "text": "That's the function that it serves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.54,
    "end": 5437.421,
    "text": "And so that to me, again, is the minimum of two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.801,
    "end": 5447.785,
    "text": "And make sure that we don't blend those two things up because it's the fact that we hold both of them as discrete and each serving a different purpose that helps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5448.125,
    "end": 5456.208,
    "text": "I'm going to jump off prematurely because I'm tired of having to catch up and slow you guys down, but I'll watch the video and see in the point two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5456.468,
    "end": 5456.828,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.848,
    "end": 5457.468,
    "text": "Peace, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.109,
    "end": 5458.409,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5462.93,
    "end": 5464.291,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.151,
    "end": 5468.732,
    "text": "So we walk through much of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.752,
    "end": 5480.736,
    "text": "It's not a very long paper, and it has just one core numerical example, again, with a Bayesian walkthrough, and then two variational Bayes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.994,
    "end": 5492.222,
    "text": " one variational Bayes that basically recapitulates the first Bayesian example of an adaptive prior and then a second counterexample that provides a maladaptive prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.544,
    "end": 5508.515,
    "text": "That is connected to evolution and to the idea that we're only going to see adaptive priors moving forward because if that model of recognition or that action model is maladaptive,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.358,
    "end": 5512.219,
    "text": " it will be seen less and less as time goes on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5512.679,
    "end": 5512.899,
    "text": "Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.66,
    "end": 5522.362,
    "text": "So something that Axel didn't mention in the paper, or maybe didn't mention, or if he did mention it, I didn't catch it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5522.422,
    "end": 5529.745,
    "text": "But so the adaptive priors always fit a certain niche, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5530.005,
    "end": 5533.846,
    "text": "And so like you're only adaptive, you know, if you're like a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5534.864,
    "end": 5537.587,
    "text": " thermophilic bacteria, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5537.607,
    "end": 5542.552,
    "text": "Like you're functional in a hot spring, maybe not in like an ice patch, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5542.772,
    "end": 5551.761,
    "text": "So I think that there's, you know, if you take the thermophilic bacteria out of the hot environment and put it somewhere cold, then it's maladaptive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5551.821,
    "end": 5557.586,
    "text": "Its priors are maladaptive, but only because it's just not fit to the correct niche environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5557.646,
    "end": 5558.767,
    "text": "And so I think that there's this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5559.488,
    "end": 5562.049,
    "text": " you know, the importance of the niche environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5562.129,
    "end": 5574.753,
    "text": "And also it makes me wonder a lot in terms of evolutionary, like conceptually, like, you know, what if it's always, we always think about like the best fit to the niche, but what if it's like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5575.643,
    "end": 5576.964,
    "text": " the best generalists?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5577.144,
    "end": 5580.565,
    "text": "Like, is there like the evolutionary, I mean, I guess that's like the cockroach, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5580.605,
    "end": 5586.587,
    "text": "Like the evolutionary generalists that can go anywhere, be anywhere, survive in any niche, survive on anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5586.947,
    "end": 5589.008,
    "text": "Like, is that the best?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5589.208,
    "end": 5595.911,
    "text": "Like, how does that like, like a prior that fits no niche or fits all niches?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5596.311,
    "end": 5599.852,
    "text": "How does that like play into this evolutionary paradigm?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5599.892,
    "end": 5601.293,
    "text": "I mean, I guess the cockroach will prevail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5603.254,
    "end": 5604.034,
    "text": " Good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5604.134,
    "end": 5608.356,
    "text": "Maybe this is related to our discussion about context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5608.656,
    "end": 5619.86,
    "text": "Having the prior of 8020, and then we observed alpha, but we could have flipped that if it was all of a sudden dipped into the beta ocean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5620.939,
    "end": 5643.256,
    "text": " then that prior would be as wrong as the maladaptive prior was in this paper so whether or not it is adaptive as you point out it is absolutely about the statistical regularities of the niche and that's the fitness of the model fitness of the organism to the generative process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5644.142,
    "end": 5648.073,
    "text": " Is the generative model going to be fit to the generative process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5648.594,
    "end": 5650.238,
    "text": "And then generative processes change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.319,
    "end": 5651.562,
    "text": "Things change out there in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5652.284,
    "end": 5652.504,
    "text": "Dave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5654.423,
    "end": 5679.914,
    "text": " Yeah, if the work on mimetics, going back to Dawkins and the English lady that did a lot more development of that notion, if that can be adapted to free energy, that will give a lot of very detailed discussion of generation after generation of the co-evolution of adaptability and that which is adapting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5680.805,
    "end": 5701.592,
    "text": " the the notion that the brain has been adapted to imitate and to remember and to pass on and to uh recast concepts into many different modalities so to what blue was asking yes agree with that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5704.779,
    "end": 5730.451,
    "text": " can then just maybe look at the last few pieces in the future directions and then i think see if we have any ideas for things to discuss in point two and then other than that just invite everybody who's interested in listening to join us for point two because we've covered much in point one in zero so it's our last journal discussion of 2021 come join and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5734.835,
    "end": 5761.103,
    "text": " share how you got here and then what action selections you're going to take in 22. the last section is free energy minimization as a historical scientific principle so that's a very fascinating idea because it's about anticipatory systems yet it's a historical principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5762.691,
    "end": 5766.133,
    "text": " That's where we get into the difference between pre-diction and post-diction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.313,
    "end": 5771.595,
    "text": "Post-dictive scientific statements are concerned with what must have been the case instead of what will be the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.756,
    "end": 5786.603,
    "text": "A statement such as the minimization of free energy may be necessary if not sufficient characteristic of evolutionary systems, which was from the Friston and Stephan 2007, is probably such a post-dictive statement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.035,
    "end": 5795.999,
    "text": " And then Axel claims that that statement should be interpreted according to the weak claim rather than according to the strong claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.039,
    "end": 5804.982,
    "text": "So interesting that even back then, the necessity and sufficiency was being used and arguably used properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5806.483,
    "end": 5808.624,
    "text": "So then what happened?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5810.605,
    "end": 5813.406,
    "text": "How did we get off the rails?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5815.047,
    "end": 5817.448,
    "text": "Or how did the strong claim come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.392,
    "end": 5837.41,
    "text": " And the paper, I think, makes a powerful argument for the FEP as a postdictive model, but that doesn't mean that it can't be used in an anticipatory way for anticipatory systems moving forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5838.655,
    "end": 5864.946,
    "text": " and doing inference on the consequences of our action which are also in the future so how the uh past and the present and the future are linked that's more of a dot too how are the historical Sciences anticipatory Sciences and uh I don't know is there now Sciences now that's what I call science 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5867.711,
    "end": 5871.472,
    "text": " What else would people like to discuss in dot one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5881.495,
    "end": 5881.715,
    "text": "Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.796,
    "end": 5892.039,
    "text": "So I would like to maybe get into more about the living versus non-living and maybe talk about, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5894.161,
    "end": 5904.275,
    "text": " you know, this idea of maintaining structural integrity, like is that a quality of life or do things always maintain structural integrity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5904.676,
    "end": 5908.281,
    "text": "And like, does the FEP apply when structural integrity is maintained?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5909.591,
    "end": 5910.952,
    "text": " and there's not life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5911.732,
    "end": 5916.575,
    "text": "I mean, it's like, I mean, we talk about like free energy minimization and chemistry all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5916.635,
    "end": 5920.057,
    "text": "Like you form the products that minimizes the free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5920.117,
    "end": 5935.566,
    "text": "And so I know that there's some differences or some, a lot of extrapolation that has to be done to get from thermodynamics to the FEP or not extrapolation, but like it's retrofit is maybe the right word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5936.326,
    "end": 5936.927,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5936.947,
    "end": 5938.708,
    "text": "I would like to maybe see some of that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5940.962,
    "end": 5945.545,
    "text": " Where does FEP apply in situations that are not animate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5945.706,
    "end": 5946.906,
    "text": "Is it computationally?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5946.967,
    "end": 5947.747,
    "text": "Is it relevant?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5947.827,
    "end": 5949.588,
    "text": "Like when we're talking about robotics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5951.79,
    "end": 5953.331,
    "text": "Yeah, that type of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5954.412,
    "end": 5954.652,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.852,
    "end": 5957.254,
    "text": "And is animate the same as sentient?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.175,
    "end": 5966.361,
    "text": "Like animate, sentient, inanimate, not moving, not animated, insentient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5966.381,
    "end": 5966.441,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.086,
    "end": 5976.45,
    "text": " Like, can we just have an Act-Inf model that doesn't have any affordances or where it only has one affordance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.41,
    "end": 5983.113,
    "text": "So it still is doing a recognition model, but then it's policy selection is extremely constrained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.267,
    "end": 5995.393,
    "text": " Or like, so, I mean, I don't even like to like use life and non-life because there are some things that like blur that boundary also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5995.453,
    "end": 5997.094,
    "text": "Like it gets into like, well, what is a virus?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5997.134,
    "end": 5997.914,
    "text": "Is a virus alive?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5998.034,
    "end": 6002.657,
    "text": "And a virus is very exploitative, like has DNA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6002.697,
    "end": 6009.301,
    "text": "Like there's some things, some qualities of viruses that make me feel like they're alive, but they're technically not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6009.981,
    "end": 6010.322,
    "text": "So yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6011.385,
    "end": 6016.487,
    "text": " like what about if we just say DNA containing, but then it's like, it's this test tube full of DNA alive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6016.707,
    "end": 6017.547,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6018.808,
    "end": 6019.188,
    "text": "It's hard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6019.888,
    "end": 6025.13,
    "text": "And so instead of even sentient and animate, like alive and not alive, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6025.951,
    "end": 6026.231,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.731,
    "end": 6036.075,
    "text": "I think that the paper's succinctness and clarity of argument hides a big question, which is okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6036.535,
    "end": 6038.816,
    "text": "So if it's alive, who told you that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6040.845,
    "end": 6049.493,
    "text": " So if we can't go from minimizing free energy to inferring what's alive, then how did we get to here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.115,
    "end": 6051.275,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6051.395,
    "end": 6052.957,
    "text": "Or what does even alive mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6052.977,
    "end": 6055.119,
    "text": "Like, I don't think it's fully defined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6055.139,
    "end": 6060.684,
    "text": "Like if we can't fully define death, like, I mean, how do we fully define life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6060.945,
    "end": 6061.265,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6061.305,
    "end": 6061.986,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6062.046,
    "end": 6064.027,
    "text": "It's this, there's this big sticky thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6065.64,
    "end": 6067.344,
    "text": " I don't know, weird area.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6067.384,
    "end": 6072.435,
    "text": "We kind of instinctually know what is life and what is alive and what is not alive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6074.319,
    "end": 6074.639,
    "text": "Anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6074.92,
    "end": 6075.221,
    "text": "But the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6076.986,
    "end": 6080.989,
    "text": " I mean, are the crystals in bone alive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.849,
    "end": 6089.895,
    "text": "Well, they're part of a bigger system that people usually don't have a problem saying is alive, but then why should what people think matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.835,
    "end": 6103.844,
    "text": "Like, especially if we believe in evolution and we think that our cognition is oriented not necessarily towards like ontological realism, then why should it matter what 1% or 99% or even 100% of people agree upon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6108.207,
    "end": 6114.832,
    "text": " Or even if we zoom, like, way out and get super meta, like, how does life maintain the structural integrity of life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6116.593,
    "end": 6118.514,
    "text": "That's an interesting one to think about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6118.554,
    "end": 6129.822,
    "text": "Like, because, I mean, it's dependent upon the niche environment, which includes many non-alive things, like the crystals that are inside of bone or inside the inner ear, which help us maintain balance, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6129.902,
    "end": 6131.683,
    "text": "So there's all of those things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6132.324,
    "end": 6133.004,
    "text": "Yeah, I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6135.014,
    "end": 6158.628,
    "text": " following with this quote from the point of view of the fep the life cycle is that which corresponds to the thing whose integrity is maintained over evolutionary time so then the ants nest architecture is as much recapitulated as is the casing of the larva as is the larva itself so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6161.243,
    "end": 6187.051,
    "text": " how will we define life I guess we can just add that as a good you know just sort of just something quick to hit at the end of 32 or of 34.2 just you know what is life and then um has Schrodinger's question been answered I mean it's been a few years since 2018 and Ram said it all but has it been answered what is life 1944",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6190.99,
    "end": 6196.113,
    "text": " Okay, so I think we will conclude there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6196.133,
    "end": 6211.079,
    "text": "I hope if you're listening that you would like to join us in the dot two, where we'll talk a little more about this paper and how we got here and then where we're going to go in 22.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.379,
    "end": 6213.54,
    "text": "Anything else, Dave or Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6216.969,
    "end": 6218.996,
    "text": " Okay, thanks for the fun, Convo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6219.839,
    "end": 6220.642,
    "text": "Talk to you all later.",
    "speaker": "SPEAKER_00"
  }
]