[
  {
    "start": 11.206,
    "end": 11.527,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.627,
    "end": 12.93,
    "text": "Hello and welcome, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.95,
    "end": 16.618,
    "text": "This is ACT-INF Org Stream number 3.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.416,
    "end": 20.377,
    "text": " It's November 3rd, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.277,
    "end": 32.441,
    "text": "Our guest of honor is Bijan Kherzi, and we're really looking forward today to talking about the Free Energy Principle, Active Inference, and your experience and recent work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.261,
    "end": 40.944,
    "text": "However, for today, you've requested that I set the stage with a little bit of context on some of the history",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.764,
    "end": 58.164,
    "text": " and development of the active inference institute and by way of doing so set us up for a serendipitous collision in our paths centering around applied organizational active inference and the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.545,
    "end": 72.128,
    "text": " So I connected with the co-founders of the Active Inference Institute, then the Active Inference Lab, which is what it was called until about June 2022 this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.809,
    "end": 77.63,
    "text": "And we connected after hearing Carl Fristen speak with Lex Fridman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.53,
    "end": 103.155,
    "text": " and got excited around some of the opportunities around this developing framework of active inference and the free energy principle the potential that a unifying framework could help us understand perception cognition and action across different kinds of complex and nested systems and then specifically applying those models in the context of especially remote teams and organizations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.056,
    "end": 121.427,
    "text": " And that resulted in our 2020 work, Active Inference and Behavior Engineering for Teams, which additionally added in some systems engineering perspectives, especially related to ontology, lifecycle perspective, continuous delivery, continuous integration, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.608,
    "end": 125.53,
    "text": "Also drawing from an open science and an open source background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.27,
    "end": 129.853,
    "text": "And since then, we've been on a journey",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.069,
    "end": 137.152,
    "text": " We've been learning and applying Active Inference and our structure has developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.793,
    "end": 154.041,
    "text": "Today, we're the Active Inference Institute and we're working on some novel formalizations of our organizational structure and all these other important aspects of successful, which is to say surviving organizations and organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.941,
    "end": 157.983,
    "text": "And that's what led us to find your work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.983,
    "end": 173.372,
    "text": " and immediately resonate with it as some of the finest contemporary examples of experience guided and shaped and situation tested cases of organizational active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.053,
    "end": 186.381,
    "text": "So that is how we came to be excited about this area and use the terms every day and use the ideas and the relationships in our strategy and to come across your work and see it as salient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.991,
    "end": 189.191,
    "text": " Good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.851,
    "end": 190.532,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.872,
    "end": 195.154,
    "text": "Well, first of all, thank you very much for inviting me on this live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.194,
    "end": 199.757,
    "text": "I've been obviously familiar with the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.597,
    "end": 205.98,
    "text": "I think it was through the theoretical neurobiology group of Fritzen that I got signed up to your newsletter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.601,
    "end": 217.687,
    "text": "And I was really intrigued by really the diversity of activities of media products you're generating in order to advance the case actually for the Active Inference Framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.907,
    "end": 237.697,
    "text": " When you once ask, actually, is there any support from a governance point of view, that's really when we started actually engaging, because I always feel that in the area, in particular, not-for-profit, I like to pay my debts and support it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.757,
    "end": 240.439,
    "text": "Now, I do think that actually you're doing an incredible job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.039,
    "end": 246.643,
    "text": "It's clearly still at a very early stage, which is actually equally true for the active interference movement,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.644,
    "end": 250.245,
    "text": " in the respective sciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.706,
    "end": 266.296,
    "text": "So maybe for those who are in the audience not too familiar actually with what really active inference is about, it's really very philosophical and very scientific at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.496,
    "end": 268.518,
    "text": "There's a mathematical framework underlying it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.538,
    "end": 276.581,
    "text": " which has been applied actually in machine learning and actually in Carl Fristen's work, which is the neuroimaging work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.141,
    "end": 290.605,
    "text": "So it is not just a philosophical concept, but it is actually something which has been applied in hard science and based on mathematical formulas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.186,
    "end": 291.766,
    "text": "But when you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.154,
    "end": 315.828,
    "text": " When you really move away from the mathematical model and you move more to a philosophical model, then actually a much more general audience starts understanding that actually active inference is maybe the only way to engage with the world, which is increasingly discontinuous and very distributed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.688,
    "end": 344.798,
    "text": " And I will briefly just say my own path of how I came across actually into the concept and then maybe a more general audience beyond actually neuroscience, machine learning and biology will start understanding how relevant the concept of active inference is, of how you build actually your own world model to navigate and in the world of business where I'm from, how to actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.278,
    "end": 349.005,
    "text": " allocate resources in very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.683,
    "end": 352.444,
    "text": " I call it discontinuous environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.504,
    "end": 356.465,
    "text": "I don't like the word uncertainty because uncertainty is a very subjective concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.605,
    "end": 364.428,
    "text": "And anyone saying that the world is uncertain is more reflection and admission of the very limitations of the world model they have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.089,
    "end": 367.67,
    "text": "And that's really where active inference comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.17,
    "end": 379.054,
    "text": "So my view and my origin actually of engaging with the active inference concept came through looking at corporate governance, looking at the challenges actually boards, leading organizations have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.535,
    "end": 381.188,
    "text": " in engaging with the world which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.734,
    "end": 385.536,
    "text": " as they say, very difficult to predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.317,
    "end": 411.956,
    "text": "And we look at an inferential model, and when you look specifically at the active inference model, you start looking at a system which is actually a wonderful system to look at, and all of a sudden you can break actually a world which seems to be quite difficult to predict into something you can navigate actually in a wonderfully simple way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.917,
    "end": 418.184,
    "text": " And the way I look at it is really at the following six components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.165,
    "end": 426.528,
    "text": " And I deliberately did not prepare presentation A because I'm very bad with presentations to prepare them in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.928,
    "end": 432.551,
    "text": "But I do understand for the audience, sometimes it's much easier to have it visualized in front of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.591,
    "end": 447.157,
    "text": "So I'm trying really in simple ways to visualize for you in your head, and you may close your eyes as you do this, of how you build the active inference framework really bottom up in a very simplistic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.473,
    "end": 454.119,
    "text": " Effectively, there's really two things one has to always look at when you look at the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.699,
    "end": 457.783,
    "text": "There's things you know, and there's things you don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.803,
    "end": 464.51,
    "text": "The second dimension is there are things you control, and there are other things you don't control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.786,
    "end": 467.807,
    "text": " And this is a fact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.987,
    "end": 469.227,
    "text": "There's many things we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.267,
    "end": 473.928,
    "text": "This is the unknown, which is outside and sometimes inside even.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.989,
    "end": 477.169,
    "text": "And there's many things which are beyond our control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.95,
    "end": 484.111,
    "text": "And now we have to build, bottom up, a model which allows us actually to navigate through this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.712,
    "end": 489.393,
    "text": "And the way the active inference model is built is that you're looking at four states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.133,
    "end": 491.874,
    "text": "And I will go into the states in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.714,
    "end": 519.856,
    "text": " you look at actually a wall or a blanket which is actually separating the known from the unknown which is really the inner world from the outer world and you have a very simple first order principle which has no purpose in its own right other than orchestrating this whole thing and orchestrating means we have only one one objective we are pursuing and effectively",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.936,
    "end": 535.061,
    "text": " In social life, you can actually bring down our ultimate objective as we navigate and we deal with uncertainty or unpredictability is we want to minimize surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.841,
    "end": 546.065,
    "text": "And minimize surprise mathematically is really a matter of minimizing the error of probability estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.705,
    "end": 548.686,
    "text": "And I'm coming now to the states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 549.471,
    "end": 552.912,
    "text": " We have an active state, which is really our actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.892,
    "end": 558.614,
    "text": "Our actions actually determine our sensory state, which is what we sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.474,
    "end": 564.736,
    "text": "We have an outer world, the external state, and we have an inner state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.796,
    "end": 566.716,
    "text": "The inner state is really our resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.956,
    "end": 570.638,
    "text": "In the firm context, you may say, actually, what are the firm resources?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.118,
    "end": 576.859,
    "text": "Now, you look at these four states, active, sensory, internal, and external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.32,
    "end": 577.98,
    "text": "Very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.86,
    "end": 584.626,
    "text": " And the internal and the external are really related through a wall, which we call the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.087,
    "end": 596.678,
    "text": "And the Markov blanket does really manage of how we try and minimize our probability estimates through constantly updating our beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.379,
    "end": 597.539,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.777,
    "end": 610.587,
    "text": " And we do this by trying to minimize at every juncture in a very generative way, free energy, free energy and information theory is really just a measure of error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.188,
    "end": 620.076,
    "text": "So once you see this, you see in a very, very simple way to distill this model now, that actually you need to act",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.055,
    "end": 633.546,
    "text": " to create your own sensations, which allow you to actually continuously update your beliefs, what beliefs you have about actually the unknown world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.527,
    "end": 637.329,
    "text": "And this is a very generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.589,
    "end": 647.598,
    "text": "The generative model itself doesn't encode anything, but the generative model is just putting into a very dynamic relationship how these four states are being governed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.627,
    "end": 651.428,
    "text": " And this is really kind of the theory part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.828,
    "end": 662.012,
    "text": "When you look at it from a material and from a practical point of view, you can very quickly see for a firm that actually there shouldn't be any uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.692,
    "end": 672.856,
    "text": "What you need is you need to engage in a very active way with the world, with a very clearly defined prediction model, which generates predictions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.556,
    "end": 677.299,
    "text": " And your actions continuously actually update those predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.76,
    "end": 680.522,
    "text": "And eventually, you will minimize actually the error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.122,
    "end": 689.689,
    "text": "So what that means concrete, what does it mean precisely in the context of strategy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.39,
    "end": 697.516,
    "text": "When you look in organizations, and that's obviously the field where I have a lot of experience as a board member, as a CEO.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.246,
    "end": 708.829,
    "text": " Traditionally, the strategy process, and this is how they teach it at management schools, is very environment driven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.47,
    "end": 716.192,
    "text": "The objective is to say, you've got to analyze the environment in order to define what your strategy is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.421,
    "end": 720.723,
    "text": " And the active inference view is that this is wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.524,
    "end": 728.189,
    "text": "Actually, your strategy is really interpretation-driven, which is effectively by your predictions it's driven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.809,
    "end": 737.756,
    "text": "And then you look for the data points in the environment to either confirm, refute, fine-tune actually your predictions, and eventually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.556,
    "end": 741.659,
    "text": " If you're not right with your predictions, you've got to update your prediction model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 742.22,
    "end": 743.681,
    "text": "So what does that mean precisely?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.962,
    "end": 756.194,
    "text": "When you look now at strategy, there's only one thing as a hyper prior, talking in Bayesian terms, there's only one thing which is important, and that's what's your purpose?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.795,
    "end": 758.176,
    "text": "What's the purpose of the company?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.757,
    "end": 760.639,
    "text": "And if the purpose of the company is clear,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.96,
    "end": 770.271,
    "text": " The top, which is the board, the executive leadership, start generating prediction models of how to best realize this purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.293,
    "end": 778.262,
    "text": "And then it's really for the rest of the organization in a very iterative model to feedback, bottom up the data points,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.923,
    "end": 796.6,
    "text": " and then actually it becomes a very continuous process hence the title of my book is also continuous transformation it's a process which is is is is is becoming integral to the dna of actually being being in the game competing in the marketplace",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.867,
    "end": 802.19,
    "text": " Strategy is no longer about top-down content prescriptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.671,
    "end": 807.515,
    "text": "It's really a top-down, bottom-up, continuous, interactive, generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.175,
    "end": 812.478,
    "text": "So if you look at it, active inference is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.579,
    "end": 818.426,
    "text": " Normatively speaking, really, of course, a theory, but it really is a process model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.766,
    "end": 826.977,
    "text": "It's a process model of how to minimize surprise and uncertainty in a very complex world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.638,
    "end": 830.662,
    "text": "And when you look at biological systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.483,
    "end": 836.606,
    "text": " They have done this in wonderfully self-organizing mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.327,
    "end": 845.392,
    "text": "And I think the challenge for the business world is to reintroduce and bring to life actually self-organizing mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.212,
    "end": 850.495,
    "text": "And the Active Inference Framework is such a framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.715,
    "end": 856.579,
    "text": "And when you look at my work in business administration, I have adapted the Active Inference Framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.139,
    "end": 861.645,
    "text": " to how to make it work and what it means in the context of business organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.389,
    "end": 866.732,
    "text": "Wow, there's a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.061,
    "end": 889.046,
    "text": " Active inference as a process model for minimizing uncertainty in complex worlds and a broader theme of using cutting edge developments in, as evidenced by your book's bibliography, everything from cognitive science of individuals to organizational studies and quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.026,
    "end": 910.58,
    "text": " mechanics all these interesting areas and also really awesome how you framed some of the zeroth principles or the commitments that this first principles framework makes like the separation between things you know and things you don't know things you control and things you don't control and of course all the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.32,
    "end": 915.103,
    "text": " nuancing that can happen, like a continuum of controllability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.804,
    "end": 924.731,
    "text": "So I guess to put it back into the embodied court, what do these top-down expectations and bottom-up signals look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.291,
    "end": 933.318,
    "text": "Are those emails or what are those actual operational details of this type of organizational design?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.219,
    "end": 948.353,
    "text": " Well, first of all, it's a very good question because it's kind of funny also when I did the empirical work supporting actually my theoretical work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.554,
    "end": 951.236,
    "text": "It's really funny how companies...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.117,
    "end": 957.08,
    "text": " try to make the case that they operate actually in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.64,
    "end": 968.746,
    "text": "Now obviously in today's world you have many technology-based tools which allow companies to engage in very distributed environments in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.986,
    "end": 970.627,
    "text": "Slack for example is one of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.371,
    "end": 980.918,
    "text": " where you create actually, you connect actually top down bottom and you engage the bottom in a very interesting way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.359,
    "end": 999.171,
    "text": "As part of my dissertation and the book research, I went into the question you asked right now a little bit deeper, and starting to understand how companies in an age where there's many",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.799,
    "end": 1010.328,
    "text": " technology tools for massive engagement of how they can use actually the button in order to refine their top-down predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.07,
    "end": 1022.98,
    "text": "When you look at the early days, it was kind of all about collective intelligence, collective collaboration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.681,
    "end": 1040.442,
    "text": " how you bring sometimes it was more on a project level at IMD in Lausanne there's two researchers they have created actually a massive intelligence undertaking which was really meant to be able",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.417,
    "end": 1047.802,
    "text": " to define the questions in the first place, which actually the base should respond to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.483,
    "end": 1050.264,
    "text": "So what are the relevant questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.345,
    "end": 1055.149,
    "text": "Because obviously by asking a relevant question, you frame something and you frame a path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1055.469,
    "end": 1062.154,
    "text": "How can you even neutralize this by empowering the base to generate actually what are the right questions to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.696,
    "end": 1084.111,
    "text": " I shouldn't say there is a big movement but there has been a movement and there has been a lot of research on it and actually they're very big companies from Red Bull to Daimler Benz to many big companies which have applied it which is called open strategy and the idea of the open strategy framework was that actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.992,
    "end": 1096.883,
    "text": " The strategic issues which are relevant for the company to compete in the long term should be generated through the base, the employee base of the company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.063,
    "end": 1102.148,
    "text": "And there were obviously various technology tools which were deployed in order to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.029,
    "end": 1106.091,
    "text": "I think all these things had very mixed results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.86,
    "end": 1115.188,
    "text": " because the question is, can you really open to such a big forum, sensitive strategy questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.609,
    "end": 1119.832,
    "text": "So it has been controversial within the respective companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.472,
    "end": 1123.014,
    "text": "Some companies had really some good input",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.675,
    "end": 1127.917,
    "text": " But on the other hand, it raises also expectations in the employee base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.437,
    "end": 1138.021,
    "text": "And if it's too project driven rather than actually really integral to the DNA on a continuous basis, usually these things, they fail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.982,
    "end": 1148.086,
    "text": "One idea I like a lot, having said this, I must admit I haven't implemented it in my own companies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.906,
    "end": 1158.879,
    "text": " I like the idea when you think in a company, the very top is the board of directors and you could see beneath it, obviously the executive leadership team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.52,
    "end": 1164.427,
    "text": "I like very much the idea of creating shadow boards",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.851,
    "end": 1171.774,
    "text": " with younger employees and who face the same agenda the top board is facing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.274,
    "end": 1180.237,
    "text": "And you look at what kind of discussion points, what kind of agenda items, what kind of action recommendations come from the base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.697,
    "end": 1186.32,
    "text": "And I think if you do this in a structured way, it's a great way of incentivizing actually the high potential in the company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.04,
    "end": 1199.645,
    "text": " But also, I think what you're doing is actually you really engage the base to think strategically and to challenge the top with exactly the very same topics they're facing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.685,
    "end": 1204.507,
    "text": "And by the way, that may generate actually future agenda points as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.927,
    "end": 1205.488,
    "text": "So I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.428,
    "end": 1208.929,
    "text": " The idea has to be definitely to open up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.009,
    "end": 1210.23,
    "text": "There's no question about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.331,
    "end": 1213.232,
    "text": "But probably to do it in a more focused way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.472,
    "end": 1217.094,
    "text": "That's why I think the shadow board is a really great thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.314,
    "end": 1221.396,
    "text": "I just communicated on this on LinkedIn this week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.694,
    "end": 1237.582,
    "text": " But I think what is much more important, and this is what the Active Inference Framework, and that's why I believe the Active Inference Institute is doing an invaluable job",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.522,
    "end": 1248.829,
    "text": " By starting to understand, actually, what active inference and practical application really means, we have to change fundamentally the way we communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.67,
    "end": 1254.794,
    "text": "And the biggest problem you have in organizations, any organization, is the communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.862,
    "end": 1272.447,
    "text": " And whenever I look at the top-down, bottom-up Bayesian brain, you obviously understand that an organization will never ever be able to work that efficiently connecting the top and the bottom nervous system in a way to operate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.888,
    "end": 1276.349,
    "text": "But we have to approximate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.229,
    "end": 1282.451,
    "text": "And all of a sudden, when you start understanding the Bayesian brain in neuroscience,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.396,
    "end": 1295.223,
    "text": " and you apply the active inference framework to social organism, man-made artifacts, you all of a sudden start understanding how much friction there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.083,
    "end": 1298.504,
    "text": "And myself as a business leader, CEO, chairman,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.871,
    "end": 1302.672,
    "text": " I'm only dedicated to one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.712,
    "end": 1306.012,
    "text": "And from there, everything flows brilliantly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.052,
    "end": 1318.336,
    "text": "And I think this is the essence of great and future-oriented leadership in this continuous market environment is take the friction out between the bottom and the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.136,
    "end": 1321.657,
    "text": "And there's far too much friction in all the organizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.377,
    "end": 1325.578,
    "text": "And that leads many times to the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.198,
    "end": 1328.541,
    "text": " that you have very valuable intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.621,
    "end": 1331.244,
    "text": "All the intelligence in an organization is at the very bottom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.684,
    "end": 1333.386,
    "text": "There is no intelligence at the top.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.267,
    "end": 1337.131,
    "text": "And the top is only as intelligent as the bottom is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.871,
    "end": 1342.957,
    "text": "So a very key, almost categorical imperative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.897,
    "end": 1372.859,
    "text": " for firm performance for a company's performance and competitiveness is really how do you bring the bottom-up intelligence all the way up and only on that basis will you develop smart prediction models great predictions and bring them back to the bottom to challenge them and evolve them it's a generative process so i think what we need to finally say goodbye to and this is the key message of the active inference framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.459,
    "end": 1381.568,
    "text": " We need to say goodbye that you can drive competitiveness, a future strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.472,
    "end": 1384.013,
    "text": " by content prescriptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.813,
    "end": 1386.314,
    "text": "Put it in the right process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1386.794,
    "end": 1394.157,
    "text": "Define a very clear purpose and follow a first order principle to orchestrate everything, which is free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.557,
    "end": 1400.66,
    "text": "As I said before, in information theoretical terms, free energy is nothing but a measure of error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.68,
    "end": 1407.243,
    "text": "So all we want to do is measure the error between our predictions and the present states we notice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.023,
    "end": 1409.724,
    "text": "And once you follow that process,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.504,
    "end": 1411.985,
    "text": " you set free an organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.685,
    "end": 1416.427,
    "text": "I gave an example in my book, which is about actually when you do the budget.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.107,
    "end": 1423.01,
    "text": "And right now, again, in October, November is the budgeting period for companies to set the budget for the next year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.81,
    "end": 1427.292,
    "text": "Again, you're facing knowns and unknowns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.792,
    "end": 1429.953,
    "text": "You're facing issues you control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.973,
    "end": 1431.814,
    "text": "There's other issues you don't control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.214,
    "end": 1435.436,
    "text": "And the management team is challenged to put a budget together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.016,
    "end": 1438.397,
    "text": "The only way they can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.771,
    "end": 1452.316,
    "text": " Deal with the unknown is by defining actions they believe can generate the right stimuli to actually update their prediction models in a continuous way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.696,
    "end": 1459.639,
    "text": "So when I look at the budget, of course I have to look at the numbers, but I'm really not interested in the numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1460.119,
    "end": 1469.503,
    "text": "I'm looking at the underlying assumptions and the hypotheses, and I'm looking at the action model and the precise actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.643,
    "end": 1481.306,
    "text": " The management team is looking to undertake, to optimize actually their predictions and to gain more and more control and to turn the unknown into the known.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.946,
    "end": 1485.067,
    "text": "And that's all it is about as we navigate through this world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.407,
    "end": 1489.749,
    "text": "Be more in control, know more and have less of the unknown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.369,
    "end": 1491.829,
    "text": "And that's a continuous process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.869,
    "end": 1500.332,
    "text": "And I think if anyone gets it and gets the active inference framework, then I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.528,
    "end": 1508.011,
    "text": " we will no longer talk about uncertainty in business in the way we talk about it today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.452,
    "end": 1515.275,
    "text": "We are really talking more about model uncertainty, but there is no such thing as uncertainty in an objective way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.295,
    "end": 1527.281,
    "text": "A lot to add there, but really interesting how you highlighted the necessity of uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.975,
    "end": 1543.957,
    "text": " appropriate communications and pointed to communications as one of the biggest areas of challenge and, coincidentally, also one of the areas for which, for digital organizations, the affordances are entirely stated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.938,
    "end": 1569.846,
    "text": " and the wiring diagram of the organization so to speak the effective and the functional causal edges to use some analogies from neuroimaging those edges are composable often digitally and increasingly with augmented and digital collaborators and so that space of wiring is vast",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.894,
    "end": 1581.781,
    "text": " it's faster than building a physical building or object because it can exist with many different counterfactuals and in kind of imagined spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.961,
    "end": 1599.953,
    "text": "So how do we go from this insight and maybe even some imperatives or heuristics like to reduce the friction between the bottom and the top as you described towards a given or particular organizational structure in a certain context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.813,
    "end": 1604.854,
    "text": " There have been models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.914,
    "end": 1626.489,
    "text": "I think one company, Zappos, has been doing this more in a holographic way, trying to really... The way I see it in very simplistic terms, looking at organizational models and organizational forms,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.975,
    "end": 1641.345,
    "text": " If we do agree as a working assumption that the world is discontinuous and distributed, then I do believe that organizational structures need to be much more distributed and much less centralized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1642.085,
    "end": 1651.312,
    "text": "And I think we need to break up companies and bring them into smaller units and empower them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.033,
    "end": 1655.775,
    "text": "And they will be much more performing because what we're doing is we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.816,
    "end": 1665.844,
    "text": " minimizing or optimizing in a certain way the pathway between bottom-up intelligence and stimuli going actually to top-down predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.964,
    "end": 1667.746,
    "text": "And that should be the ultimate objective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.046,
    "end": 1669.647,
    "text": "How can we minimize the friction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.707,
    "end": 1678.195,
    "text": "And sometimes the friction is really a function of how we simplify organization and forms of organizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.555,
    "end": 1680.357,
    "text": "What's very interesting when you look",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.567,
    "end": 1693.636,
    "text": " There is kind of, and it comes really from prehistoric times before even language appeared, when actually people communicated in forms of touching each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1694.471,
    "end": 1699.054,
    "text": " that the maximum number of a community is 150.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.855,
    "end": 1704.638,
    "text": "That's where you can distinguish pistachios in certain ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.378,
    "end": 1711.843,
    "text": "And that's kind of a magic number, which has been actually, I guess these are the very origins as some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.623,
    "end": 1724.291,
    "text": " Researchers in the language field have informed me, but I think it's funny to see that there's a number of companies which look at the 150 to 200 as the magic number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.051,
    "end": 1729.915,
    "text": "And that's when actually an organizational entity should be no bigger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.62,
    "end": 1736.945,
    "text": " And if a company has 50,000 employees, then it should be really in much smaller units and empower them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.425,
    "end": 1739.727,
    "text": "And I think that's what I'm doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.767,
    "end": 1749.175,
    "text": "My company is obviously not that big, but in my company, I have four companies which are quite distinct companies, but I think that's the strengths because they form one unity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.795,
    "end": 1751.717,
    "text": " but they remain very, very distinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.358,
    "end": 1760.346,
    "text": "And I can see that they are much more performing if they were just business units as part of a bigger thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.446,
    "end": 1765.671,
    "text": "So they have very autonomous and very respective leadership structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.311,
    "end": 1773.619,
    "text": "And I do believe, to your point, looking at the form of organization,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.08,
    "end": 1775.9,
    "text": " is very critical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.94,
    "end": 1789.649,
    "text": "And I do think, having said so, there have been many researchers before who have been looking at neuroscience, the structure of the brain, transferring it actually to organizational science, and it has been certainly true for biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.969,
    "end": 1798.094,
    "text": "But I'm always fascinated looking into biology, how our...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.164,
    "end": 1814.899,
    "text": " First of all, how perception is very space-specific and how we have a tendency to generalize and obviously make it very human-centric, the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.76,
    "end": 1822.908,
    "text": "And once we get to the point that we start understanding that the world is not human-centric,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.238,
    "end": 1842.459,
    "text": " then actually I think we will be much more open to be enriched by the insights and the inspiration the biological world can give us and to actually become aware of the very limitations we have and how we can actually navigate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.24,
    "end": 1848.084,
    "text": " with uncertainty, and there the active inference framework will come in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.684,
    "end": 1866.378,
    "text": "And I think the problem we have as a human species is that we are the only species which has this outstanding power of learning, but we have so many limitations which are very severe, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.181,
    "end": 1876.563,
    "text": " Kind of, we are empowered on the one side with learning, but we are completely handicapped on the other side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.663,
    "end": 1878.684,
    "text": "We can't see electromagnetic waves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.284,
    "end": 1896.67,
    "text": "So there's many interesting theories, and some of them I really like, that our objective, or if you look at the very essence of evolution, has never been about seeing the truth as it is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.862,
    "end": 1906.889,
    "text": " Our existence and our epistemic for raging and exploration is not about approximating truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.57,
    "end": 1911.113,
    "text": "Actually, most of the time we do ignore the truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.893,
    "end": 1918.278,
    "text": "It's all about fitness payoffs because we want to survive and we want to procreate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.179,
    "end": 1920.4,
    "text": " And it's all about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.86,
    "end": 1922.541,
    "text": "And that drives our behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.561,
    "end": 1929.286,
    "text": "And you start not looking at things the way they are, as much as actually our engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.326,
    "end": 1937.931,
    "text": "We see a desktop, but behind the desktop are pixels and many different things which actually create our perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.951,
    "end": 1939.933,
    "text": "But what we're seeing is definitely not the truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.313,
    "end": 1947.378,
    "text": "So I think unless we get to the point where we say goodbye to this very classical notion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.938,
    "end": 1955.785,
    "text": " And that's why I bring also my book, the relation and the juxtaposition between classical physics and quantum physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.726,
    "end": 1965.754,
    "text": "We have to move to quantum physics and we need to actually start understanding the world does not operate according to classical laws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.295,
    "end": 1968.637,
    "text": "It really operates according to quantum law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.017,
    "end": 1973.882,
    "text": "And once you start doing it, I think you have to embrace that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.606,
    "end": 1983.691,
    "text": " our existence, but the way we control, not control the known and the unknown in a completely new way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.312,
    "end": 1994.919,
    "text": "And my contribution in the Active Inference Framework is really to say, this is something which is immensely valuable to redefining what strategy means in the business world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.699,
    "end": 1997.32,
    "text": "I know we're at the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.621,
    "end": 2002.324,
    "text": "That's why I'm sure the audience engaging with us today is a very small audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.064,
    "end": 2018.113,
    "text": " But I'm, and I have to say, as you could see, also, with my theoretical introduction to the active inference framework, it is so abstract, for many people, for us, it's so natural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.453,
    "end": 2021.235,
    "text": "And we see the mathematical formulas behind it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.815,
    "end": 2023.296,
    "text": "And we see the consistency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.157,
    "end": 2024.317,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.778,
    "end": 2033.563,
    "text": " Forming a book, writing a book, even for the business community, makes it almost a book nobody can read and nobody can understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.343,
    "end": 2053.777,
    "text": "But I'm absolutely of the conviction that this book, that the work of the Active Inference Institute, and Carl Friston has been our great source of inspiration for all of this, is setting free a movement, and I'm absolutely convinced it's just a matter of time, that this becomes in a very significant way mainstreamed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.455,
    "end": 2057.715,
    "text": " Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.055,
    "end": 2059.075,
    "text": "Well, a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.856,
    "end": 2086.001,
    "text": "You add there the recurrent mention of the distributed systems and strategy in distributed systems reminds me of my earlier graduate school work on foraging decision-making in ants, where no single nestmate knows how many seeds the colony has, how many seeds there are out there, what's the humidity, what's the water loss rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.841,
    "end": 2106.377,
    "text": " none of the relevant information and yet it embodies through behavior development evolution ecology it embodies a solution to the regularities of that niche which includes like abiotic challenges and biotic challenges and then you connected to epistemic foraging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.997,
    "end": 2134.096,
    "text": " which is what we use to describe when actions are undertaken with the imperative primarily of reducing uncertainty and gaining information and the free energy imperative has a dual epistemic and pragmatic component so under conditions of high certainty epistemically the pragmatic component can be dialed in in the special case converging on utility learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.676,
    "end": 2148.178,
    "text": " And then in scenarios with a flatter landscape where there's less of a sharpness or a need for pragmatism, there's an exploratory landscape where the epistemic value and the novelty can be generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.638,
    "end": 2158.9,
    "text": "And so there's just so much there in thinking about distributed systems in biology and in organizations, which after all are biological too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.56,
    "end": 2163.221,
    "text": "So what are your closing thoughts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.109,
    "end": 2174.735,
    "text": " No, I think we covered certainly for an audience to get an insight of active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.915,
    "end": 2183.32,
    "text": "Applying it, I like very much your last contribution because I'm fascinated by the work you have done with ants and even the brains of ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.5,
    "end": 2189.063,
    "text": "I mean, you're going down to a level which is almost quantum in a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.864,
    "end": 2194.869,
    "text": " I can only reiterate that I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.526,
    "end": 2222.772,
    "text": " really would love to see, and hence this interview is my contribution also, of really firmly establishing the Active Inference Institute as a great force for a whole new way of being inspired by biology, neuroscience, to embrace the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.832,
    "end": 2227.053,
    "text": " With a completely different mindset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.713,
    "end": 2237.557,
    "text": "And I think the world is today in a state where it's so obvious that actually we are overwhelmed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.564,
    "end": 2250.027,
    "text": " whether it's from a geopolitical point of view, whether it's from an economic point of view, and eventually from a psychological point of view, because the dynamics have become very complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.087,
    "end": 2250.347,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.767,
    "end": 2265.251,
    "text": "Because technology has empowered every person to have actually a beyond imaginable impact on the whole, one individual potentially, to be, I don't like the word disruptive, but to generate discontinuities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.972,
    "end": 2270.046,
    "text": " And that makes it actually increasingly difficult to construct an algorithm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.894,
    "end": 2284.463,
    "text": " with not only what variables are part of it, but how do the variables relate and what is their respective weighting in the algorithm to start developing actually a way moving forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.623,
    "end": 2298.713,
    "text": "And I am of the conviction, and I see it reading the mainstream newspapers, I don't read really newspapers, but looking at actually through the voices which come through from the leaders in various forums,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.39,
    "end": 2310.614,
    "text": " They are overwhelmed and they have reached the very limitations of defining, articulating, communicating their very world model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.174,
    "end": 2313.695,
    "text": "I think actually they haven't got a world model any longer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.715,
    "end": 2318.997,
    "text": "And because they haven't got it, they are confronted with uncertainty and unpredictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.837,
    "end": 2325.399,
    "text": "And I do believe that the time is so ripe for actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.801,
    "end": 2336.776,
    "text": " bringing more awareness to the fact of how we have to work on our models, world models, reality models, whatever you want to call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.818,
    "end": 2342.104,
    "text": "And more importantly, what processes should be in place to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.069,
    "end": 2348.574,
    "text": " to actually update those models and make them better and better going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.135,
    "end": 2356.903,
    "text": "And I can start, and I have to say they're wonderful examples, which have really, and I want to give this as a closing remark as an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.463,
    "end": 2361.307,
    "text": "When you look at the gaming world, I'm obviously coming from the gaming world as an entrepreneur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.836,
    "end": 2366.478,
    "text": " you have traditionally reward functions in a game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.798,
    "end": 2369.24,
    "text": "So let's take a very simple shooter game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.0,
    "end": 2375.564,
    "text": "In a shooter game, the agent is rewarded who shoots most of the planes and eventually is the winner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.604,
    "end": 2377.345,
    "text": "Let's assume that's the logic of the game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.405,
    "end": 2382.728,
    "text": "When you look at the free energy minimization powered agent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.615,
    "end": 2389.476,
    "text": " He has or she has no clue about what the reward function of the game is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.036,
    "end": 2390.417,
    "text": "Zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.257,
    "end": 2399.018,
    "text": "All the agent does is the agent starts playing the game and has only one first order principle, which is to minimize surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.719,
    "end": 2406.0,
    "text": "So eventually the agent starts learning in order to survive, which is the hyper prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.153,
    "end": 2410.635,
    "text": " you need to behave in a certain way in order not to get shot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.975,
    "end": 2413.796,
    "text": "And you have to engage in certain behavioral traits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.897,
    "end": 2417.878,
    "text": "So now you have two agents in one game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.119,
    "end": 2419.339,
    "text": "The game is a shooter game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.74,
    "end": 2423.521,
    "text": "There is a reward function powered agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.562,
    "end": 2430.505,
    "text": "And there is a free energy or surprise minimization powered agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.665,
    "end": 2434.547,
    "text": "The free energy agent will always win, always.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.782,
    "end": 2437.743,
    "text": " Because it takes a little bit longer to train it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.683,
    "end": 2442.985,
    "text": "But eventually, you don't need to know the reward function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.045,
    "end": 2446.386,
    "text": "And the reward functions are outdated by the time you communicate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.866,
    "end": 2448.787,
    "text": "And companies need to understand this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.528,
    "end": 2450.608,
    "text": "Liberalize yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.088,
    "end": 2460.112,
    "text": "Free yourself, actually, from all that friction you're creating with PowerPoint presentations, with top-down communications which fossilize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.175,
    "end": 2465.402,
    "text": " the mindset and the intelligence, which is at the bottom of the company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.943,
    "end": 2471.132,
    "text": "Just put a self-organizing process governed by the free energy principle in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.973,
    "end": 2474.658,
    "text": "And once you have a clearly defined purpose, which is timeless,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.311,
    "end": 2479.853,
    "text": " You create your prediction models and the journey can start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.494,
    "end": 2485.597,
    "text": "And you will see there's no more any such thing as uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.117,
    "end": 2491.62,
    "text": "It's only a way of how uncertainty minimizing your models are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.96,
    "end": 2492.921,
    "text": "And that's the only thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.728,
    "end": 2517.099,
    "text": " amazing well for those who are listening all the way we expect and prefer that you will get involved or otherwise allocate your regime of attention to active inference and the active inference institute and hopefully participate in some way thanks for this awesome conversation we really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.453,
    "end": 2527.561,
    "text": " have so much to learn from each other and from our niche and from the unknown unknowns and from the bottom and from all around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.061,
    "end": 2529.622,
    "text": "So awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.143,
    "end": 2530.983,
    "text": "And till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.204,
    "end": 2531.524,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.205,
    "end": 2533.826,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.506,
    "end": 2535.207,
    "text": "Much appreciated.",
    "speaker": "SPEAKER_00"
  }
]