[
  {
    "start": 6.152,
    "end": 20.885,
    "text": " hello and welcome it's july 29th 2023 and we're here in session three discussion of the course physics is information processing at the active inference institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.826,
    "end": 27.95,
    "text": " We're having a follow-up discussion on Chris Fields' third lecture on quantum reference frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.211,
    "end": 31.873,
    "text": "And we're looking forward to your participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.453,
    "end": 37.316,
    "text": "So if you're watching along live and you've been invited to the calendar event, it's not too late to jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.277,
    "end": 46.258,
    "text": " If you're watching on YouTube, you can write any questions or comments in the live chat with Dean and Andrew here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.759,
    "end": 57.261,
    "text": "We're going to be looking at some of the key points and taking it in a few different directions, sharing our reference frames, making a shared one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.821,
    "end": 64.402,
    "text": "So Andrew, it'd be awesome to have you zoom in a little bit on the slide and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.728,
    "end": 92.004,
    "text": " feel free to to take us through some of the key points so that we can um see a little bit how you're seeing it thank you that looks good yep okay so let's let's start by reviewing um the last lecture from a couple weeks ago and then we can open up the discussions if there's any questions that appear in the live chat we can address those all right so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.23,
    "end": 117.078,
    "text": " lecture two chris introduced this idea of uh the information processing between system a and b you know where they interact via qubits on a boundary and they have um reference frames that give meaning to this com to this communication you want to think of uh you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 117.967,
    "end": 124.791,
    "text": " information processing as a communication channel, the way Shannon thought about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.552,
    "end": 127.492,
    "text": "So that was in lecture two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.353,
    "end": 139.899,
    "text": "And lecture three, a couple of weeks ago, tried to make this more explicit by emphasizing the idea that this has to be physically embodied somewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.439,
    "end": 140.74,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.14,
    "end": 146.803,
    "text": "And I think that because we are so used to information being fungible,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 148.929,
    "end": 151.25,
    "text": " in no small part because of the internet and everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.47,
    "end": 164.554,
    "text": "It's a little hard to understand at first when the claim is made that you have a QRF that is non-fungible or you have a piece of quantum information that's non-fungible or things like the no-cloning theorem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.794,
    "end": 170.436,
    "text": "We're so used to information being fungible to it being zeros and ones that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 172.678,
    "end": 195.608,
    "text": " it's a bit of a change in in in mindset at first but that's exactly what lecture three um introduced this was all old stuff right um could you maybe just unpack that a little bit what would it mean for information to be fungible or what's that stance like and then what does it mean for information to be non-fungible and what is that stance like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.98,
    "end": 199.421,
    "text": " Yeah, I'm about to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.741,
    "end": 203.782,
    "text": "So let me scroll down the slides because that's addressed here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.822,
    "end": 206.203,
    "text": "So maybe I should have kept this in the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 206.263,
    "end": 212.305,
    "text": "But anyways, session two talked about how information theory makes this simple and obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.906,
    "end": 220.628,
    "text": "And in session three, we talk about reference frames and mechanistically how all of this works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.869,
    "end": 225.67,
    "text": "So yeah, let's address that question of the difference between",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.171,
    "end": 257.089,
    "text": " between hold on one second let me use my mouse to scroll down here okay so that's that's a little faster right okay so um can you restate your question uh daniel yeah what would it mean for information to be fungible or non-fungible people might be familiar with that in the economic setting with non-fungible tokens and all of that but what are we talking about with informational fungibility",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.07,
    "end": 264.212,
    "text": " I think it basically comes down to whether you can replicate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.232,
    "end": 268.234,
    "text": "I mean, it's basically the difference between classical and quantum information, as far as I know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 270.875,
    "end": 275.057,
    "text": "Fungible information is everything that you can basically turn into a message of zeros and ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 278.378,
    "end": 283.84,
    "text": "It's, you know, how you transmit it may be different, you know, the channel, the physical hardware and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.88,
    "end": 285.161,
    "text": "But at the end of the day,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.869,
    "end": 291.672,
    "text": " It's something that you can write on a boundary and something that you can transmit as zeros and ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.953,
    "end": 298.897,
    "text": "Whereas quantum information, you literally have to send the piece of hardware, the QRF.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.698,
    "end": 301.219,
    "text": "At least that's how I understand it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 301.379,
    "end": 311.086,
    "text": "So a simple answer might be that it's information encoded in a piece of software versus a piece of hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.106,
    "end": 313.728,
    "text": "But I don't think that analogy is perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 314.605,
    "end": 315.105,
    "text": " But what do you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.026,
    "end": 316.826,
    "text": "Yeah, Dean, what do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.607,
    "end": 320.348,
    "text": "Oh, here's what I'm curious about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.189,
    "end": 323.25,
    "text": "And again, you guys can help me with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.87,
    "end": 326.492,
    "text": "As opposed to reference frames, I oftentimes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.615,
    "end": 330.156,
    "text": " default to frame of reference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.216,
    "end": 337.482,
    "text": "And I know that in one of the live streams, what I tried to bring out was the idea that there was an ice cream cone looking at an ice cream truck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.123,
    "end": 343.167,
    "text": "And the question was always whether or not, which one of those two entities is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.347,
    "end": 346.29,
    "text": "One is in the foreground and one is in the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.33,
    "end": 357.579,
    "text": "And in this slide that Ander has up, the question is, is the non-fungibility because only A and B can decide whether",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 358.069,
    "end": 376.716,
    "text": " the VA as seen by B, the A is deeper into that image based on our frame of reference and the B is closer or is the B the one that's actually deeper and the A is the one that's in the foreground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.076,
    "end": 387.42,
    "text": "And I was wondering whether the idea of non-copy ability is because of that depth of field aspect that cannot be determined unless it's literally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 387.901,
    "end": 411.526,
    "text": " handed over the way that chris was describing it i think i think that's basically accurate i think um i'm not sure i can answer the question but i think i have the feeling that chris well chris said this in the lecture that i mean at the end of the day the krf is somewhere in your your nervous system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.415,
    "end": 417.017,
    "text": " You bring up a good point, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.337,
    "end": 420.879,
    "text": "It looks like this slide is a bit of an optical illusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.24,
    "end": 427.384,
    "text": "Whether you see A or B deeper, I guess it depends on something going on inside your head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.325,
    "end": 433.809,
    "text": "This picture is so symmetrical that if you focus enough on it, you can change your opinion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.99,
    "end": 449.225,
    "text": " Well, just to even connect that to what we're talking about, the classical fungible information on the holographic screen, on the blanket, and then the quantum cognitive rotation is those two images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.366,
    "end": 475.051,
    "text": " are on the screen identical and then whether it gets a quantum rotation such that the three points of the axes are closer to us than the intersection on that kind of tetrahedron or the other way around whether the ballerina is rotating one way or the other that's not on the boundary so the information about the depth of field",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.131,
    "end": 495.19,
    "text": " is part of the qrf or part of the enactment of the qrf and it's not written on the boundary and that goes back to the preparation question and not just the measuring yeah like in the preparation if your whole enculturation or the last five minutes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.3,
    "end": 517.755,
    "text": " it was entrained or you were holding an object that predisposed you to think that the vertex of the intersection was further away, that's the preparation that sets your prior so that when you get this ambiguous artifact, you rotate it into the most natural position cognitively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.736,
    "end": 520.817,
    "text": "And that's the preparation that sets you up for measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.897,
    "end": 522.878,
    "text": "No measurement can happen without a preparation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.4,
    "end": 525.0,
    "text": "What do you think, Andrew?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.009,
    "end": 527.589,
    "text": " Uh, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.79,
    "end": 527.87,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 527.89,
    "end": 528.05,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 529.23,
    "end": 530.411,
    "text": "Everything you said makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.071,
    "end": 538.715,
    "text": "Um, so, uh, perhaps let me, uh, let me recall what I said around the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.975,
    "end": 556.284,
    "text": "Uh, there was a, in, in this whole spirit or philosophy of making, emphasizing that information is physical, you know, from QV, this whole thing, um, one of the glaring omissions in, in physics was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.762,
    "end": 580.969,
    "text": " the embodiment of the reference frame, which was treated as an abstraction, you know, in classical physics, such as by Galileo, but maybe even Einstein, even if he, my hunch is that he did have more of this instinct of, you know, particularly in all those thought experiments of trying to chase the light ray, you are chasing the light ray, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.029,
    "end": 586.091,
    "text": "So at the end of the day, but I mean, this is a whole process of making",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.727,
    "end": 615.326,
    "text": " observer on the reference frame more and more explicit and more and more physical because at the end of the day it has to right if if you start with this assumption that um solipsistic assumption almost that you know all you see and you know is part of the same material uh ether that you are then you know then you are part of the universe that and you're observing something that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.124,
    "end": 644.293,
    "text": " is out there uh so you need to make include a theory of what it means for you to be observing that right and at the end of the day the observer has to be physical that's what was emphasized by by chris at the beginning of this lecture so this jump from treating the reference frame as an abstraction to a real physical entity and yeah these are these these people have uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.362,
    "end": 666.5,
    "text": " talk a lot about in these papers that are quoted there, but I should also remark if folks want to see this, it's coming up in high energy theory also in recent work of Saskind and others where they talk about quantum reference frames very explicitly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.101,
    "end": 672.746,
    "text": "So I don't have the citations off the bat, but it's definitely becoming an important thing in the last 20 years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.195,
    "end": 681.637,
    "text": " this attempt to really explicitly treat the reference frame and the observer as a quantum entity, as a physical entity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.898,
    "end": 684.378,
    "text": "OK, so this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.979,
    "end": 692.321,
    "text": "That's what I just said, OK, the jump from treating things reference frames as abstractions to physical objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.404,
    "end": 701.604,
    "text": "And because we cannot make",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.799,
    "end": 705.14,
    "text": " perfect copy of quantum information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.88,
    "end": 709.541,
    "text": "We say that these are unique, unclonable, and unfungible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.161,
    "end": 719.423,
    "text": "So in order to recreate an experiment perfectly, this is addressed as the part of fungibility or not, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.623,
    "end": 732.206,
    "text": "Can Alice, if you have some sort of quantum experiment and Alice and Bob are, you know, it's the usual EPR thought experiment or whatever, Alice and Bob are separated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.132,
    "end": 733.772,
    "text": " by light years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.273,
    "end": 743.417,
    "text": "Is it enough if they want to recreate the same exact, the same experiment for Alice to send string of zeros and ones?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.637,
    "end": 751.281,
    "text": "Well, if you had an experiment where that's enough, then you can recreate it with fungible information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 751.341,
    "end": 758.444,
    "text": "If not, then you need to somehow send non-fungible information, which really implies sending a piece of hard work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 763.05,
    "end": 785.964,
    "text": " um can i can i add another uh another piece here look on the previous uh slide so this looks really technical and scientific but let's think about alice's laboratory is alice's brain mind and bob's analogously alice is thinking about what to say and then says it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.664,
    "end": 790.488,
    "text": " And that information might be written in a chat form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.528,
    "end": 791.729,
    "text": "It might be said verbally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.789,
    "end": 794.972,
    "text": "It might be transmitted through a digital or analog signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.992,
    "end": 799.996,
    "text": "But at some point, it's going through this classical informational interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.036,
    "end": 803.779,
    "text": "And then Bob's laboratory is perceiving and unpacking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.52,
    "end": 816.905,
    "text": " And the question of semantic alignment is such that if Alice gives a shopping list of 10 items, if there's semantic alignment, Bob would be able to go to the store and then find those 10 items.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.666,
    "end": 822.488,
    "text": "And it made me think of the dictionary definition of left and right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.788,
    "end": 829.131,
    "text": "So this gets back to our discussion of whether the vertex on these axes is coming towards us or away from us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.591,
    "end": 831.772,
    "text": "So I looked up the dictionary definition of left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.647,
    "end": 841.66,
    "text": " on, towards, or relating to the side of a human body or of a thing that is to the west when the person or that thing is facing north.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.509,
    "end": 846.59,
    "text": " So that's, I guess, one attempt to anchor what it means to be left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.71,
    "end": 850.192,
    "text": "The second definition is the left-hand part, side, or direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.332,
    "end": 852.952,
    "text": "And you could imagine there's an analogous definition for right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.533,
    "end": 866.577,
    "text": "The point is you can't describe verbally leftness and rightness or chirality in general because its referent is an embodied perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.668,
    "end": 882.759,
    "text": " And so if Alice said, okay, you're going to go down the street and then turn left at the stop sign, how would Alice communicate to Bob what leftness meant at that stop sign versus rightness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.7,
    "end": 886.942,
    "text": "And that's this question of flipping left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.938,
    "end": 913.065,
    "text": " And the way that the quantum formalism accommodates that is through the wick rotation and the quantum cognitive events where the fungible, transmittable, holographic information gets rotated into the imaginary axis with the formalisms that enable it to be rotated at all, but that means you could rotate it left, quote, or rotate it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.946,
    "end": 916.646,
    "text": "Yeah, I think that's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.649,
    "end": 919.749,
    "text": " That's a very good explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.31,
    "end": 921.85,
    "text": "I don't know if I have much to add.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.93,
    "end": 928.033,
    "text": "Dean, you wanted to say something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.193,
    "end": 947.962,
    "text": "I don't know the answer to this, but to take what Daniel just said, to take the basic concept of being able to take something that for all intents and purposes can appear one way or another, and then turn that into how Chris closed the last lecture with,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.284,
    "end": 957.466,
    "text": " we are seeing ourselves as both being entangled and also being separatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.106,
    "end": 969.629,
    "text": "How did we go literally from a three-dimensioned vertex to we're both entangled and we're not living in a paradox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.089,
    "end": 971.41,
    "text": "That's just the way it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.97,
    "end": 972.57,
    "text": "We're also...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.642,
    "end": 977.904,
    "text": " removing ourselves or separating ourselves at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.384,
    "end": 988.208,
    "text": "That's what I would like to know, because somewhere between three arbitrary lines and complexity is not a paradox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.069,
    "end": 994.271,
    "text": "Something has to be happening, and I'm not exactly sure how that transition plays out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.341,
    "end": 1000.822,
    "text": " Anybody want to enlighten me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.742,
    "end": 1004.643,
    "text": "Can you repeat your question, please?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.683,
    "end": 1005.763,
    "text": "Well, how do we go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.783,
    "end": 1016.727,
    "text": "At this point of the reference frame description of saying you can't copy it, all you can do is pass it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.827,
    "end": 1026.57,
    "text": "Because we think things could be flipped based on internal reference frames, internal meanings, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.031,
    "end": 1035.574,
    "text": " Donald Kenkel- turtle models, the thing we choose for context yada yada yada goes all the way out to the conclusion of end of chris's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.594,
    "end": 1049.919,
    "text": "Donald Kenkel- conversation with us in the in number three where he said bottom line is is that it's not a paradox that as things become more and more complex, then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.855,
    "end": 1062.664,
    "text": " it wants to get to a place of entanglement, alignment, a sense of agreement, and at the same time, wants to remain separate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.085,
    "end": 1065.246,
    "text": "So between those two things,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.327,
    "end": 1076.376,
    "text": " A whole lot has happened, and I don't think we've skipped over it, but we certainly haven't opened it up and really looked at it closely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.537,
    "end": 1080.34,
    "text": "And I'm just curious what's in between those two scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.441,
    "end": 1081.821,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.881,
    "end": 1086.406,
    "text": "I think we're going to cover that towards the end of the talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.543,
    "end": 1088.203,
    "text": " but I agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.884,
    "end": 1096.907,
    "text": "I don't know how you see this related to QRS or the stuff we just talked about, but I think it's the big question in this lecture, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.987,
    "end": 1107.171,
    "text": "That was like, where does this tension between increasing complexity and wanting to predict what the environment is doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1107.191,
    "end": 1112.893,
    "text": "One requires entanglement and the other one requires separability, at least colloquially speaking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.913,
    "end": 1115.494,
    "text": "I think this tension",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.738,
    "end": 1140.34,
    "text": " is um basically what the free energy principle comes down to right daniel what do you think you have the free energy and you have the e minus ts and one is prediction error i mean not exactly e minus ts right that would be through dynamics but you know what i mean one is prediction error and the other one is what was it i can't remember",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.151,
    "end": 1165.184,
    "text": " i'll definitely look forward to to the the technical unpacking that that you'll get to soon but but i was reminded of the william blake quotation do what you will this life's a fiction and is made up of contradiction so let's modify that um project what you will rotate what you will space times a fiction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.215,
    "end": 1176.907,
    "text": " Not that it's false, but that it's a projected fictionalization, that it doesn't have the ontological primacy that the topology of communication does, and is made up of contradiction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.428,
    "end": 1181.853,
    "text": "Yes, and it's made up of this tension between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.181,
    "end": 1213.123,
    "text": " fitting and not overfitting between aligning and the principle of unitarity and differentiating and becoming through others we become ourselves and that type of articulation and recognizing that two complementary forces like convex and concave come into existence at once like a zero to two jump is not an issue or or a stumbling block",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.187,
    "end": 1216.768,
    "text": " it's that we wouldn't have it any other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.549,
    "end": 1219.769,
    "text": "Couldn't have it any other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.03,
    "end": 1222.57,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.77,
    "end": 1223.011,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.551,
    "end": 1224.831,
    "text": "We'll get there towards the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1225.632,
    "end": 1227.632,
    "text": "You can almost even call it a duality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.652,
    "end": 1229.693,
    "text": "It's not far-fetched.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1229.713,
    "end": 1236.336,
    "text": "I mean, it's the sort of thing that I think most people would be happy to take for granted, such, you know, supersymmetry, like you have...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1237.455,
    "end": 1241.858,
    "text": " two kinds of particles, but the same amount of them, and dualities that are all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1241.898,
    "end": 1256.388,
    "text": "So I think it's fairly, it's not unreasonable to just accept that there is a tension between increasing complexity, which you want AME to be separable for, and accuracy of prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.668,
    "end": 1267.175,
    "text": "Now, how this is related to emergent space and this QRS stuff, I don't want to make very part",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.844,
    "end": 1268.484,
    "text": " fetch claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1268.544,
    "end": 1278.648,
    "text": "We'll talk about emergent space later in the course, but for now, let's say a few more words about QRFs, and then we'll get to the complexity stuff towards the end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1280.669,
    "end": 1288.912,
    "text": "So QRFs are almost building blocks, if you want, for information processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.953,
    "end": 1294.114,
    "text": "Here, it's very useful to recall the definition that I feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.274,
    "end": 1295.775,
    "text": "I think we have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.148,
    "end": 1326.441,
    "text": " mentioned before of information as being differences that make a difference that's probably the best flow definition of information i've heard and i think i think it does a lot of work i mean it's almost mathematical but anyways we need to unpack it a little more and and see so for a difference to make a difference what do you want out of qrf right and surprisingly i mean not surprisingly but reassuringly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.193,
    "end": 1329.255,
    "text": " I think would be the word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1330.336,
    "end": 1340.043,
    "text": "You need a QRF to have sensory action and a default state, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.324,
    "end": 1345.928,
    "text": "This is sort of like where your Bayesian prior distribution is encoded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1346.589,
    "end": 1351.953,
    "text": "These three things will give you a building block for any information processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.654,
    "end": 1356.837,
    "text": "And that ties together with all the work in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.592,
    "end": 1382.897,
    "text": " energy literature and perception action loops and and whatnot um so before we see mathematically how a qrf is defined uh i think it's more illustrative and i think chris went exactly on the right order when when he presented this a couple weeks ago seeing uh examples from nature",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.88,
    "end": 1386.802,
    "text": " These are actual pieces of hardware that are effectively QRFs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.563,
    "end": 1393.567,
    "text": "And it's remarkable how they map to... Well, I'll skip ahead a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1393.727,
    "end": 1406.936,
    "text": "But when you get to the mathematical definition of a QRF as a quantum system that you can specify with this category theory diagram, you have incoming arrows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1407.461,
    "end": 1409.462,
    "text": " into a node that then expands, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.582,
    "end": 1417.207,
    "text": "And this roughly corresponds to measurement and preparation degrees of, not degrees of freedom, degrees of freedom would be the same, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.267,
    "end": 1422.471,
    "text": "When you attach it to the boundary, but measurement and preparation stages, I guess, would be the better word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.852,
    "end": 1428.134,
    "text": "But anyways, let me go back to these examples, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.455,
    "end": 1433.198,
    "text": "And Daniel, you're the biologist here, so correct me if I say anything wrong here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1433.578,
    "end": 1433.878,
    "text": "You have...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.185,
    "end": 1464.578,
    "text": " a cartoon picture of the bacteria i think and this is a very simple sort of thing right it navigates in the direction of food and and that's it right so it is a very simple rudimentary example of a curette you have the sensory uh stage here i guess the degrees of freedom i guess the degrees of freedom",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.712,
    "end": 1492.071,
    "text": " um it's not obvious here what the boundary is that's one thing uh but it is a good enough picture to see the resemblance to here we have the measurement which in this in this case you're trying to measure concentration of food you have your node here c which is your prior distribution for concentration of food",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.121,
    "end": 1504.63,
    "text": " And finally, you have the output, the preparation stage, which is your, you know, the rest of this chemical network that will control and steer this bacteria, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.69,
    "end": 1513.436,
    "text": "So there's here, you want to call it the action degrees of freedom that will steer this bacteria in the direction of food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.437,
    "end": 1517.099,
    "text": "And likewise with cell division, this I understand even less.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.799,
    "end": 1519.561,
    "text": "The network appears more complicated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1520.603,
    "end": 1532.682,
    "text": " uh but i think it's fair to say that at the end of the day all these chemical networks that appear super complicated somehow have to be mapped to this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.205,
    "end": 1536.486,
    "text": " category theoretical diagram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1536.727,
    "end": 1538.729,
    "text": "That's all there is to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.229,
    "end": 1552.262,
    "text": "You're going to have the sensory input and the action output, and you're going to have the default chemical concentration, which amounts to this node over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.586,
    "end": 1558.969,
    "text": "You remember this from last lecture, right, Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.497,
    "end": 1579.925,
    "text": " yeah and the cone cocoon we explored also in in live stream 17 on the bayesian semantic information flow but i'll kind of add a point about these biological systems um in relationship to to artificially specified systems and what that helps us understand about perception cognition action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.645,
    "end": 1598.88,
    "text": " So the cone-co-cone diagram has this bowtie architecture or this kind of like two pyramids touching point to point where there's a preparation and a measurement which can be different dimensionalities or different scopes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.641,
    "end": 1604.925,
    "text": "Like it could be multi-input, multi-output or multi-input, single output, vice versa and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.705,
    "end": 1607.187,
    "text": "But they come through this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.148,
    "end": 1611.43,
    "text": " eye of the needle with C prime here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.13,
    "end": 1623.117,
    "text": "Now contrast that kind of architecture represented here abstractly with what we see in the bacterial process and in the cell division process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.838,
    "end": 1636.286,
    "text": "These have that kind of a bow tie perception, cognition, action architecture or measurement cognitive integration preparation architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.768,
    "end": 1660.975,
    "text": " In contrast, we see, for example, an artificial neural network where the input and the output layers are usually lower dimensional, maybe an image coming in with several hundred pixels and a single output like a classifier coming out the other end, but a dimensional explosion in those internal cognitive layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.855,
    "end": 1666.376,
    "text": " But in biological systems, it's actually exactly the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.636,
    "end": 1682.181,
    "text": "For example, many, many, many receptors on the cell surface, on the holographic boundary, the sensorium of the cell, but then there are these common secondary messengers that many pathways converge upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.143,
    "end": 1712.863,
    "text": " So that reflects the kind of radically different architecture that a QRF embodies as opposed to the approach taken by disembodied intelligence frameworks, which use dimensional explosion internally to try to categorize and classify and find edge cases versus this dimensional winnowing that is reflective of these embodied intelligences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.925,
    "end": 1739.102,
    "text": " And if I may make a tangential comment here also, I think the good thing about these two examples is that they also showcase the fact of how the deep implications of a scale-free biology, if you want to call it this way, we tend to think of these sorts of processes such as here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1740.557,
    "end": 1746.859,
    "text": " only happening at the level of the nervous system in animals, or as you said, neural networks, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.939,
    "end": 1748.96,
    "text": "We tend to associate this with neural networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.78,
    "end": 1767.425,
    "text": "And perhaps evolution has steered us in a way that endowed us with nervous systems to make these things, maybe these are higher up in the layers, but really there is, you know, that's a bit of an arbitrary distinction that we make, you know, the processes going on at the cellular level",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.286,
    "end": 1781.99,
    "text": " even if they don't appear to have anything to do with the nervous system, my understanding is that there are some generic properties that are the same, and everything that has to do with information processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.27,
    "end": 1792.193,
    "text": "It manifests maybe slightly different when it comes to explicit nerves, but at the end of the day, it's the same generic process going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.253,
    "end": 1793.853,
    "text": "Would you say that's right, Daniel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1797.029,
    "end": 1808.296,
    "text": " The ontological claim is that it's the same generic process happening, whereas the more instrumentalist claim is that we can model it with some shared abstractions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.638,
    "end": 1814.439,
    "text": "Yeah, okay, so we can continue, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.459,
    "end": 1824.325,
    "text": "So, from, you know, I don't have a whole lot to say, Daniel,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1825.391,
    "end": 1831.756,
    "text": " said quite a bit about, at the end of the day, QRF is, you can visualize it as this diagram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.136,
    "end": 1842.724,
    "text": "And, you know, you can think of it as, if you are more familiar with the picture of a neural network and ways on a neural network and so on, that's the way to think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.626,
    "end": 1848.288,
    "text": "Now, let's continue with explicit embodiment, if you wish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.249,
    "end": 1854.373,
    "text": "So, QRFs in the formalism have to be attached to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1855.624,
    "end": 1856.505,
    "text": " A boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1857.165,
    "end": 1858.306,
    "text": "Boundary degrees of freedom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.566,
    "end": 1860.747,
    "text": "And I should add another remark here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.827,
    "end": 1874.956,
    "text": "I think, and personally, to me also, the hard part about this quantum pre-energy principle formalism intuition is what you said at the beginning, is the fact that it's topological, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1874.976,
    "end": 1878.799,
    "text": "So very often it's not clear what the boundary degrees of freedom are, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.899,
    "end": 1882.041,
    "text": "Because we tend to think of boundaries as, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.672,
    "end": 1888.114,
    "text": " geometrical, and certainly the classical FEP treats them as geometrical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1889.595,
    "end": 1898.879,
    "text": "But that's not the case here in the quantum pre-energy formalism, where we have emergent space, as will be talked about in later sessions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.999,
    "end": 1902.3,
    "text": "But that's just one quick remark to make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.32,
    "end": 1911.184,
    "text": "At the end of the day, though, even if it's topological, we're going to have real degrees of freedom that these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.055,
    "end": 1915.937,
    "text": " QRF is attaching to this cone-cocoon diagram.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.918,
    "end": 1925.244,
    "text": "And you're going to have measurement operators that yield classical outcomes, plus and minus one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.425,
    "end": 1940.395,
    "text": "And then you can think of this QRF, or more abstractly, this cone-cocoon diagram as a neural network, if it was acting on those bander qubits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1941.983,
    "end": 1946.446,
    "text": " And then back propagating some sort of action signal preparation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.568,
    "end": 1949.869,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.19,
    "end": 1963.678,
    "text": "Let's not forget that Landauer's principle and so on requires that we are mindful of energy constraints on computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.919,
    "end": 1967.861,
    "text": "And that gives us the following picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.105,
    "end": 1983.394,
    "text": " Number one, we're going to have to use energy from the environment to fuel our computation, to fuel our observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.255,
    "end": 1989.999,
    "text": "That means that right away you cannot use the entirety of your boundary to gather information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1990.52,
    "end": 1996.504,
    "text": "It necessitates an allocation of resources, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.434,
    "end": 2013.118,
    "text": " Here E is the observed environment and the blue portion is a thermodynamical sector where you extract free energy and dump heat in order to run this computational process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.738,
    "end": 2019.199,
    "text": "And then furthermore, you can have a memory sector where you write things on the boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.3,
    "end": 2025.941,
    "text": "And this takes up energy also, writing information onto the boundary by Landauer's principle will take up information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2027.993,
    "end": 2034.135,
    "text": " And Chris called this the minimal interest in Observer because it has a memory sector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.915,
    "end": 2038.016,
    "text": "And why minimal here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.117,
    "end": 2045.699,
    "text": "Minimal interest implies that we have more than one layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.319,
    "end": 2048.98,
    "text": "Here, the process of writing things into the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.021,
    "end": 2066.524,
    "text": " into a memory sector requires us to have a clock so that we can label those memories in time okay so we do have time as part of this formalism just not space yet okay the time has to be internal to the observer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.847,
    "end": 2090.987,
    "text": " Just one piece on that that Chris mentioned, and as you echoed, time here is an attribute of some cognitive systems in terms of their internal understanding so that they can sort memories and understand what came earlier or later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.108,
    "end": 2099.437,
    "text": " It's not something that's a priori defined externally, which is the case in the kind of space-time first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.798,
    "end": 2101.901,
    "text": "Now, how do we fit communication into here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.203,
    "end": 2127.521,
    "text": " We flip that, we're talking about the topology of communication as ontologically primal, and now certain kinds of sophisticated agents, it's not like necessarily true of a rock or a metronome or a particle of a gas, but some kinds of cognitive systems are such that they are able to generate an internal clock concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.59,
    "end": 2133.192,
    "text": " And that doesn't have to be the same thing as what's happening on the wall with Kronos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.272,
    "end": 2140.136,
    "text": "This can reflect a purely internal time, Kairos, that enables observers or interactors that have different clock structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.656,
    "end": 2149.881,
    "text": "And then Landauer's principle helps us arbitrage or connect the informational demands to the energetic or the metabolic demands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.161,
    "end": 2150.401,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.482,
    "end": 2157.345,
    "text": "So when I first listened to the lecture, I thought when the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.218,
    "end": 2168.225,
    "text": " term or phrase trade-off was raised, I traditionally have thought of trade-off as kind of a binary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.286,
    "end": 2175.511,
    "text": "If I'm picking this, I'm trading off against all the other things that I didn't pick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.352,
    "end": 2179.875,
    "text": "So one or the other, or others, plural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.576,
    "end": 2188.222,
    "text": "But when I saw this, and especially when I heard it in the context of things like degrees of freedom,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.925,
    "end": 2194.927,
    "text": " I began to wonder whether it is because it could sit on either side of that boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.947,
    "end": 2210.171,
    "text": "It could be a priori or it could be ad hoc or post hoc, a trade-off, which prior to this conversation, I just assumed that a trade-off was one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.052,
    "end": 2214.053,
    "text": "But essentially what this implies is it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.972,
    "end": 2227.495,
    "text": " it's still a kind of a degree of how much weight you put into it, and then you kind of cross a threshold, and then you've made your pick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.316,
    "end": 2229.856,
    "text": "You've completed your trade-off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.296,
    "end": 2235.838,
    "text": "Or did I, again, did I misinterpret what I was hearing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.898,
    "end": 2243.18,
    "text": "If it's topological as opposed to the more conventional space-time perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.952,
    "end": 2251.593,
    "text": " Is this, can a trade-off be both ad hoc and post hoc, seemingly at the same time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.914,
    "end": 2259.135,
    "text": "Very interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.215,
    "end": 2262.915,
    "text": "Let us just let it float and continue on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.135,
    "end": 2263.355,
    "text": "Enter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.356,
    "end": 2272.517,
    "text": "All right, because again, if it's, I'll just say this, if it can be that trade-off,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.745,
    "end": 2276.608,
    "text": " that would really move us out of the classical realm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.569,
    "end": 2283.792,
    "text": "That would essentially say that any time we've made a pick, we really haven't made a pick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.813,
    "end": 2297.262,
    "text": "There's still a whole bunch of other things that are going to happen that can change whatever that action is that we thought we carried out or enacted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.942,
    "end": 2300.203,
    "text": "If we're talking about an internal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.914,
    "end": 2329.625,
    "text": " internality state which is what i think we want i think we want to be able to change our minds let me take that one way dean um the the analytical equations of the action perception loop don't tell us in implementation like if we're going to write it in code whether we should",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.031,
    "end": 2355.56,
    "text": " use action first procedurally to update our observations or whether we enable our observations to to wag the dog and then select action at the end of the loop so is it a perception action loop or is an action perception loop and those enable a kind of um seesaw",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.3,
    "end": 2380.402,
    "text": " where sometimes we want what we learn to change what we do, and other times we want what we do to change what we learn, and having that kind of a fulcrum or a pivot, and then again to connect it to the vertex popping in and out, the analytical formalisms inscribed on the screen of the FEP, like the textbooks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.929,
    "end": 2399.115,
    "text": " they're ambiguous whether we lead with action and have inference follow, or whether we lead with inference and have action follow, or lead with action and have inference follow, whichever one of the combinations there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.775,
    "end": 2408.939,
    "text": "And then that trade-off or runoff is broken by specific embodied cognitive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.719,
    "end": 2438.979,
    "text": " that that trade-off about the um the procedural primacy of perception or action can't be broken generically right it certainly makes for a lot of waste heat if you're not careful it'd be exhausting a lot anyway",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.182,
    "end": 2467.766,
    "text": " okay so um so i i see i i don't know if we can um talk about intent um much with this formalism but we can take a very descriptive uh approach to it and um go down here a little more uh actually before i don't want to get ahead of myself uh what i mean by that is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2472.392,
    "end": 2476.636,
    "text": " Whether we can put intent or not in this hierarchy, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.896,
    "end": 2493.69,
    "text": "I don't know if it matters a whole lot, but at least we can talk about it operationally and descriptively and say, just like when you have a clock, the clock is just there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.191,
    "end": 2497.613,
    "text": "If you don't have the clock, you don't have the memory, and that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.393,
    "end": 2500.415,
    "text": "And likewise here, if we don't have attention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.08,
    "end": 2528.073,
    "text": " attention control compartment we just cannot have we cannot play with all these QRFs that are non-commutative at the same time so if there is no attention control system to begin with we don't we cannot talk about a system that has non-commutative QRFs meaning here one one presumably goes to memory sectors the other one goes to environment sectors and so on uh so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.509,
    "end": 2546.053,
    "text": " So this is certainly a necessity of the fact that we have different sectors of the boundary being allocated to different purposes, such as environmental observation and memory and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.413,
    "end": 2559.396,
    "text": "Within the environment, it's worth remarking that here, if you think deeply about first principles and what it means to observe an entity,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.351,
    "end": 2588.77,
    "text": " um well you still come down to these differences that make a difference sort of thing right which involves whenever you're looking at the environment to if you're going to identify a system you need sort of a background that tells you that puts the system in context right so that you can identify the system as something distinct i think this again is something that we have talked about in previous uh discussions where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.594,
    "end": 2598.92,
    "text": " The easiest picture here is something like the speed gauge in your car, where P is the gauge itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.94,
    "end": 2606.325,
    "text": "It tells you the speed, but it's meaningless without the reference system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.006,
    "end": 2616.612,
    "text": "Outside of the thing that stays invariant, the context, the background, that gauge moving means nothing to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.359,
    "end": 2633.044,
    "text": " So we come back to this idea of if we think of information as differences that make a difference in terms of first principles, this environment sector that we saw earlier has to be further broken down into pointer and reference states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.725,
    "end": 2639.286,
    "text": "Again, this is covered in depth in Chris's papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.167,
    "end": 2644.288,
    "text": "I'm thinking particularly of free energy for generating quantum systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2647.072,
    "end": 2664.946,
    "text": " And again, just to reiterate, this attention control staff compartment, which is, by the way, very reminiscent to the hierarchy that was earlier with the clock arising higher up in the hierarchy, deeper into the layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.007,
    "end": 2672.011,
    "text": "Likewise, whenever we have, so whenever you're writing something into a memory, you need to have that clock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2672.531,
    "end": 2676.134,
    "text": "Whenever you are deploying uncommunicative reps, you're going to need",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2677.548,
    "end": 2680.01,
    "text": " attention control compartment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2680.451,
    "end": 2682.652,
    "text": "And we just described this operationally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2683.913,
    "end": 2687.236,
    "text": "If you didn't have it, then the agent would not be what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.556,
    "end": 2690.559,
    "text": "It could not deploy those noncommutative QRFs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.081,
    "end": 2693.741,
    "text": "So marching on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.424,
    "end": 2702.188,
    "text": "We'll just end here with the QRF alignment and the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.749,
    "end": 2703.89,
    "text": "Just a few more words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2704.69,
    "end": 2705.431,
    "text": "This is possibly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.195,
    "end": 2730.793,
    "text": " the most interesting picture in this in this uh presentation and just we can recall here uh the possibilities for care of alignment and how free energy comes into play in this in this um formalism so is that we call we call a the trivial interaction we call this a thermal interaction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.212,
    "end": 2761.071,
    "text": " and and then you have a bunch of possibilities right and depending on each possibility you're going to see things as uh notes or as in the paper says non-local hidden variables the last situation is what we call alignment when we have qrfs of the same size perfectly aligned okay so i can't quite recall i think this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.622,
    "end": 2772.566,
    "text": " this would be the situation where you have noiseless classical computation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2772.886,
    "end": 2779.149,
    "text": "You just have A and B just interacting, you know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.269,
    "end": 2788.473,
    "text": "And also, this is the situation where, correct me if I'm wrong, Daniel, this is entanglements, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2788.733,
    "end": 2792.995,
    "text": "Asymptotically, once all the curves are aligned, you have entanglement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2793.857,
    "end": 2798.841,
    "text": " And now we can tie back maybe two gains earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.462,
    "end": 2805.006,
    "text": "So these two slides conclude the discussion, basically, and then we can open it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.847,
    "end": 2821.54,
    "text": "So given these possibilities for how QRFs can be aligned, QRFs deployed by AMD can be aligned, and how in each situation you're going to get noise or whatever, then what does...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.663,
    "end": 2847.565,
    "text": " free energy principle say in this quantum setting well minimizing variational free energy leads you to entanglements okay so if theorem here if you are in the picture of me here and the qrfs are are aligned uh a and b are going to be intact",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.532,
    "end": 2870.379,
    "text": " Now, there is a tension between this tendency towards alignment, as the free energy principle will carry you, and observed reality, which is that we're not just a blob of entangled particles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2870.539,
    "end": 2881.604,
    "text": "There is separability, and systems are at tension between maintaining separability and at the same time being correlated enough",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.974,
    "end": 2886.236,
    "text": " to the environment so as to be able to predict a company.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.476,
    "end": 2892.378,
    "text": "And now we can maybe go into a more philosophical discussion on the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.459,
    "end": 2909.205,
    "text": "I should also say, in the last month, just like I talked earlier about TRFs, Lenny Susskind, whose recent paper that talks about TRF, it led me into a rabbit hole of looking into his recent work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2910.14,
    "end": 2912.522,
    "text": " And he's talked a lot about complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.802,
    "end": 2915.744,
    "text": "I'm being very speculative here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.804,
    "end": 2921.567,
    "text": "So if someone can pull me up, that would be good in the comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.128,
    "end": 2929.612,
    "text": "But just to skimming through some of his papers, I saw a monograph in 2018 where he talks about complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.693,
    "end": 2933.835,
    "text": "He puts forward the second law for complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2935.094,
    "end": 2937.255,
    "text": " in quantum systems and increase complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.995,
    "end": 2940.696,
    "text": "And it is very reminiscent of what's going on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2940.836,
    "end": 2954.901,
    "text": "You have a tension between systems tending to entanglement and the other side of the free energy function, if you wish, where systems increase in complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.721,
    "end": 2960.483,
    "text": "And that necessarily requires that A and B are separate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.983,
    "end": 2964.104,
    "text": "So, Daniel, do you have any comments at this point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.715,
    "end": 2967.816,
    "text": " Yeah, there's a lot to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.836,
    "end": 2979.502,
    "text": "I like that you showed the four possibilities in the image above and said it was one of the most interesting figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.023,
    "end": 2982.204,
    "text": "I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.245,
    "end": 2989.928,
    "text": "And how to connect this to the classical FEP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.212,
    "end": 3018.395,
    "text": " and also how to see the quantum FEP not as just a second story built on top of the classical FEP, which would be kind of like a historical chronological understanding of the theoretical apparatus, but it's almost like the quantum FEP was like a basement we didn't know about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.117,
    "end": 3045.149,
    "text": " because it it gives a broader context and though it appeared conceptually several years later in the timeline we understand that doesn't give it a secondary um status so what it really means for the classical FEP to be kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.399,
    "end": 3076.261,
    "text": " a special case of this um actually more generic setting there's just a lot i'm very uncertain maybe i can i can i i can wrap it up uh and then if dean or you want to say something um we can continue with that but let me conclude and this is all i have to say for today um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.856,
    "end": 3090.087,
    "text": " I think, I mean, I'm sure Chris will explain this more in coming sessions and lectures, but I think the main key difference is in the emergence of space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3090.848,
    "end": 3095.872,
    "text": "How it might emerge from something more fundamental, maybe a tensor network or who knows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.033,
    "end": 3100.196,
    "text": "But that's the big difference, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3100.256,
    "end": 3104.14,
    "text": "And I suppose the quantum free energy principle generalizes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3105.203,
    "end": 3108.066,
    "text": " classical free energy principle because it doesn't have this spatial embedding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.046,
    "end": 3121.877,
    "text": "Now, this, to me personally and also to folks in the audience who are asking questions, is probably the hardest part to wrap your head around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3121.897,
    "end": 3130.965,
    "text": "And I foresee interest in those discussions and lectures that deal with the concept of emergent space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3132.165,
    "end": 3145.65,
    "text": " Because every time you try to, and I've done this myself, I've been thinking about how you could apply this formalism to better known pictures or compare it, for instance, with thermal equilibrium, with relaxation with thermal equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3145.67,
    "end": 3148.231,
    "text": "And then you start thinking about, okay, what is the boundary and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3148.972,
    "end": 3150.132,
    "text": "It's far from obvious, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.152,
    "end": 3154.874,
    "text": "Because again, you have to remind yourself that the definition is topological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3155.811,
    "end": 3164.421,
    "text": " So in that regard, I think it might be worth talking about one of the questions that came up that I thought was good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.203,
    "end": 3169.426,
    "text": "And then I can call it a day on this end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.328,
    "end": 3176.054,
    "text": "So this question, and I think it was the first question asked since the last lecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3177.163,
    "end": 3180.726,
    "text": " Can you just read the full question and then read the full answer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.746,
    "end": 3181.967,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.127,
    "end": 3183.328,
    "text": "It's number 28 here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3183.448,
    "end": 3184.089,
    "text": "Can you guys see it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.289,
    "end": 3185.91,
    "text": "Should I zoom in a little bit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.171,
    "end": 3188.433,
    "text": "It's pretty small, but reading it will be good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.213,
    "end": 3200.883,
    "text": "Okay, so this question, I think, I've asked myself this question too, maybe in a different way, but basically it gets to the point of what I was saying earlier, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3202.724,
    "end": 3205.747,
    "text": "That it would be nice to see how we can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3206.608,
    "end": 3233.938,
    "text": " use this quantum free energy principle formalism to recover maybe familiar settings such as relaxation to thermal equilibrium yeah the heat equation but that's far from always how you do it if your definition is topological right so the question says what happens when the agent becomes identical to the environment when the model has been improved so much that it does not differ from the environment is this a stadium impossible would it be thermoamical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3234.494,
    "end": 3236.736,
    "text": " equilibrium, maximum entanglement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.436,
    "end": 3257.97,
    "text": "Okay, so clearly it's not thermodynamical equilibrium, but I think what the person is asking, if I'm understanding this correctly, they're wondering, okay, so if the free energy principle drives A and B towards entanglement, then is it fair to say that they have, that any distinction between them has dissolved, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.99,
    "end": 3259.451,
    "text": "That they have merged into the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3262.598,
    "end": 3271.088,
    "text": " And that has to do with this whole definition of philosophical debate of thing-ness that Carl Christen is a proponent of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.749,
    "end": 3273.931,
    "text": "What it means for two things to be separate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3273.951,
    "end": 3277.295,
    "text": "So let's see what Chris said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.513,
    "end": 3288.478,
    "text": " Kristen has pointed out that the limit of the classical FEP, the limit of perfect prediction, corresponds to generalized synchrony between system and environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.599,
    "end": 3292.201,
    "text": "Each sends messages that the other can perfectly predict.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.043,
    "end": 3298.686,
    "text": "Now, however, it's clear, and I'm not reading anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.726,
    "end": 3300.828,
    "text": "I'm making a quick remark here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3300.848,
    "end": 3302.069,
    "text": "I'll continue in a second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.01,
    "end": 3305.772,
    "text": "In the classical FEP, it's clear",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3307.426,
    "end": 3317.708,
    "text": " that A and B, even if they are in the perfect limit of the FEP, they remain different entities, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3317.788,
    "end": 3328.671,
    "text": "Because you have that, if you wish, that extra layers of differentiation coming from their spatial embedding, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3328.931,
    "end": 3330.891,
    "text": "In the classical FEP, that is clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3331.251,
    "end": 3334.032,
    "text": "But they haven't, even if they are getting synchronized,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3335.1,
    "end": 3337.821,
    "text": " they have not lost their separate identities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.841,
    "end": 3344.563,
    "text": "You can always say, well, this is the one that was to the left, and this is the one that was to the right, pun intended in the earlier discussion, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.443,
    "end": 3355.566,
    "text": "You have that extra resource for separating them, if you wish, by virtue of the spatial embedding, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3355.586,
    "end": 3362.528,
    "text": "The spatial embedding is giving you this extra information that allows you to keep track of AMB separately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3363.459,
    "end": 3364.24,
    "text": " Okay, so I'll continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.28,
    "end": 3368.262,
    "text": "This notion depends on the system and its environment being separated and has distinguished somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3369.303,
    "end": 3373.606,
    "text": "In classical formulations, they are separated in ordinary 3D space, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.626,
    "end": 3375.447,
    "text": "they occupy different locations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.707,
    "end": 3378.289,
    "text": "So they are different because they occupy different locations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3378.549,
    "end": 3383.513,
    "text": "But if you don't have that geometrical background, then how do you know that they're different, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3384.093,
    "end": 3385.494,
    "text": "Okay, so I continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3386.283,
    "end": 3390.105,
    "text": " The quantum formulation is background-free, meaning it assumes no space-time embedding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.305,
    "end": 3396.489,
    "text": "System and environment do not have different locations, even though they have different sets of degrees of freedom in the overall Hilbert space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.37,
    "end": 3402.752,
    "text": "Here, the limit of the FEP is maximum entanglement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3403.693,
    "end": 3406.334,
    "text": "This does not mean that the system and its environment are identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.354,
    "end": 3408.515,
    "text": "They aren't, since they have different degrees of freedom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3409.216,
    "end": 3412.998,
    "text": "So this just addresses the question I just posed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.798,
    "end": 3415.099,
    "text": "It means that their joint state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.902,
    "end": 3444.773,
    "text": " is not separable okay um into a system s and environment t their states are no longer conditionally independent this is distinct from thermal equilibrium which means that they have the same temperature while remaining separable uh and that their interaction can be characterized as the change of thermal fluctuations ie noise so i i guess this is a nice format for things that are to come but i i do think that this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3446.064,
    "end": 3454.816,
    "text": " whole idea of emergent space is going to be possibly one of the most important in the course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.401,
    "end": 3462.246,
    "text": "And it's going to help stick out between the classical and the quantum formulations for sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3464.704,
    "end": 3467.307,
    "text": " Dean, what's your take on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.327,
    "end": 3473.673,
    "text": "What I saw was that when you have that kind of alignment, that perfect alignment, that was one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.693,
    "end": 3478.518,
    "text": "That was D in that diagram, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.698,
    "end": 3484.704,
    "text": "That was one state of a complex state that included an A and a B and a C and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.365,
    "end": 3506.592,
    "text": " probably a whole bunch of other ways that yeah right so that one state where you've got this kind of entanglement isn't isn't into perpetuity like you don't get there and then stay there and that's where i think the question of separability and complexity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.382,
    "end": 3517.245,
    "text": " It still works because just because you momentarily got into a place that we define here as D doesn't mean you stay there indefinitely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.085,
    "end": 3522.826,
    "text": "You could be swapping around to B and C and A in the next instant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.887,
    "end": 3528.288,
    "text": "So that's that at least that holds the complexity piece up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.025,
    "end": 3537.01,
    "text": " That moment, for however long that moment is, where XA and XB are aligned, isn't permanent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.01,
    "end": 3540.172,
    "text": "So it's not predictable in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.492,
    "end": 3542.253,
    "text": "Therefore, it is complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.534,
    "end": 3550.198,
    "text": "I still don't know how we get, though, that the closer we get to agreement, the more complex things are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.979,
    "end": 3556.282,
    "text": "Unless we're just talking about D in this array of A, B, C, and D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.925,
    "end": 3560.786,
    "text": " That goes back to that quantum reference frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.146,
    "end": 3584.098,
    "text": "I think, like I said, again, maybe I'm interpreting this wrong, but when I message pass, the reason why I have to literally give it over to the other person and let them have it, I can't have them copy what I'm doing, is because there has to be, I guess that reinforces the separability piece of this as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.819,
    "end": 3586.82,
    "text": "The fact that I can't give them a copy that I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.401,
    "end": 3597.309,
    "text": " can only give them the information and then they've got to sort of unpack it in their own way of taking it off the boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.95,
    "end": 3601.653,
    "text": "But again, I struggle with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.374,
    "end": 3610.861,
    "text": "I'm guilty as charged, but what I'm trying to do is trying to come up with my own narrative so that what Chris is saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.881,
    "end": 3626.246,
    "text": " make sense to me as opposed to make sense to the world which is what chris is trying to do i'll try with another speculative fiction so um there's a screen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.611,
    "end": 3651.464,
    "text": " between let's just say the stage and the audience or whatever it's a holographic screen and on each side of the screen there's some embodied object so that means that it must have um vol it's a volume enclosing object because points and lines and planes are only abstractions every real physical object encloses volume and now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.404,
    "end": 3657.73,
    "text": " a light is going to be coming from behind each object facing the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.29,
    "end": 3659.151,
    "text": "And that's this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.317,
    "end": 3688.531,
    "text": " uh cone that we're seeing from each side it's like the shadow cast by the object so if the object was a sphere then it would be projecting down to a circle onto the screen if the shape were a cube it could be projecting down and so where the light is positioned is the um perspective that that cognitive entity is taking on its qrf",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.591,
    "end": 3690.631,
    "text": " those lights could move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.671,
    "end": 3693.212,
    "text": "So now we have this situation where the two spotlights are moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.673,
    "end": 3695.153,
    "text": "Maybe the shapes are staying the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.233,
    "end": 3696.374,
    "text": "Maybe they're changing too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.134,
    "end": 3703.697,
    "text": "And it's like two searchlights scanning across this B oval.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3705.317,
    "end": 3709.099,
    "text": "And sometimes they are perfectly locked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.179,
    "end": 3717.322,
    "text": "I mean, there could be a situation where they're perfectly aligned or there could be situations where they're totally disjoint",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.97,
    "end": 3729.539,
    "text": " And each of those situations have different implications for what one entity sees",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.99,
    "end": 3758.665,
    "text": " when it looks at the screen maybe like the shadow is the only part where you can see because the rest of it is too blinding or something like that and so then if we're in case a here where um maybe b doesn't have a projection or maybe b's projections totally somewhere else then a is in this solipsistic i'm the active agent interacting within an inert world setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.276,
    "end": 3780.134,
    "text": " And D is like potentially the computer engineer's classical dream or asymptote, which is like all the data going through the USB cable is just being perfectly noiselessly received.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.415,
    "end": 3785.819,
    "text": "And then we also get these B and C cases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.193,
    "end": 3790.22,
    "text": " But A is kind of like the inner world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.743,
    "end": 3792.906,
    "text": "D is like the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.042,
    "end": 3803.964,
    "text": " perfect communication channel, and then to connect it just to Friston's concept of generalized synchrony, as we've talked about many times, generalized synchrony doesn't mean lockstep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.484,
    "end": 3812.285,
    "text": "Two agents could reduce their uncertainty about each other, not by doing the same thing at every time step, but for example, by turn-taking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.725,
    "end": 3822.347,
    "text": "And I think that points the way to how we get reduction of variational free energy, reduction of prediction error, surprise, and so on, without",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.949,
    "end": 3837.398,
    "text": " especially spatial temporal enmeshment, but not necessarily even informational identity enmeshment, because you could have two things that through their alignment become actually differentiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.098,
    "end": 3847.764,
    "text": "And that could increase the mutual information between two metronomes, not just to have them going in the same direction, but to have them going in opposite directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.365,
    "end": 3851.447,
    "text": "The mutual information in those two settings is gonna be high,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.406,
    "end": 3863.534,
    "text": " So it's not the case that generalized synchrony means that things are becoming blurred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.136,
    "end": 3875.764,
    "text": "We could actually also have integrated information through increased articulation, not just decreased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.844,
    "end": 3877.125,
    "text": "And then...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.402,
    "end": 3905.872,
    "text": " life finds a way or cognition finds a way on this trade-off frontier of in our pursuit of unitarity will we blur to unify or will we differentiate to unify but those are the paths we have we don't have the um backwards ratchet yeah yeah makes sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.934,
    "end": 3941.206,
    "text": " any other ladder slides enter uh no that's it uh so chris made a few more remarks at the end about uh language here uh but he mentioned that he's gonna talk more about this in the coming lecture so we'll just leave it up to him yeah there could be some very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3942.602,
    "end": 3960.846,
    "text": " powerful and interesting linguistic opportunities for updating our speaking to reflect what we are learning here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.846,
    "end": 3964.887,
    "text": "I don't know what those necessarily are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.614,
    "end": 3988.887,
    "text": " whether it's a syntactic or a semantic thing or whether it's a narrative thing but how to actually re-enter some of these formalisms into our folkish understanding could just be immensely powerful and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.195,
    "end": 4013.1,
    "text": " we could have a lot of integrity between the natural language way that potentially were already showing up for engagement and some of these formalisms that get to first principles about interacting entities and boundary conditions and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.701,
    "end": 4017.461,
    "text": "Dean, any penultimate thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.616,
    "end": 4019.017,
    "text": " Not really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.037,
    "end": 4029.448,
    "text": "I'm going to go back and listen to the, I'm going to listen to Chris's comments again about this common cause and the fine tuning assumption and whether that's sort of a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.41,
    "end": 4056.714,
    "text": " metaphorically a dialing in or what what he what he means exactly by the fine tuning in the in the context of this conversation today what you just kind of said about are we dulling something here or are we sculpting something to make it more fittable like i'm going to go and now and go back and listen to what he talks about in terms of fine tuning and maybe update my priors around that so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.942,
    "end": 4087.683,
    "text": " are any last uh thoughts or maybe scroll over to the um schedule of the course again just so we can close on that yeah we're halfway through we just completed the third discussion section now so we've had three lectures and three discussions it's all downhill from here um by the way this was the first midterm you guys both did well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.332,
    "end": 4115.978,
    "text": " um we're gonna head into four or like session four with these last three how agents use multiple communication channels and that's going to get connected to the quantum fvp how space time emerges from communication which is something that we've brought up a bunch it's been in the background but but making that explicit it's going to be exciting and then section six i think is just going to be such a jumping off point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.506,
    "end": 4146.436,
    "text": " because the scope and the intensity of what is transpiring is extreme so connecting it to biology which is to say life more fully and where we go in in 23 and beyond that's going to be awesome so any last words enter uh no i just think of what you said um very i would i would say it's going to be uphill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.937,
    "end": 4149.46,
    "text": " in terms of how interesting it's going to get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4149.48,
    "end": 4153.865,
    "text": "I feel in a good sense, meaning that we're planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4155.373,
    "end": 4155.693,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.753,
    "end": 4163.636,
    "text": "Well, I encourage people to check out the course website and submit questions that they'd like to see addressed by Chris.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.737,
    "end": 4167.498,
    "text": "Also to register and join these participatory discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.538,
    "end": 4168.739,
    "text": "There'll be three more of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4169.519,
    "end": 4180.243,
    "text": "So if you want to join, share your QRF, be part of the publication of all of these works that we'll compile at the end and just get your...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.764,
    "end": 4195.7,
    "text": " exoskeleton in the game with what is happening here it'd be really awesome to hear more voices and and to have more on board okay thank you dean and andrew till next time",
    "speaker": "SPEAKER_00"
  }
]