[
  {
    "start": 2.107,
    "end": 5.654,
    "text": " All right, welcome back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7.277,
    "end": 12.367,
    "text": "We're in the second discussion on chapter three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 13.129,
    "end": 19.862,
    "text": "So does anyone just have any quote or question or anything to kind of begin with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.928,
    "end": 94.685,
    "text": " Any thoughts where we can just start to look at the written questions from before?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 99.299,
    "end": 101.385,
    "text": "Or some page or figure from three?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 120.687,
    "end": 138.186,
    "text": " A basic sort of disorienting thing, I guess, in the diagram at the top of page 44, where it shows external states, internal states, action states, and sensory states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.206,
    "end": 149.158,
    "text": "I'm confused about what are realistic examples of influence on that direct arrow between active states and sensory states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.408,
    "end": 154.615,
    "text": " Like, again, I understand active state or the point of active state generally is to impact upon the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.675,
    "end": 165.129,
    "text": "And like, eventually we see the effects of that in sensory states, but I guess the direct double arrow between the active states and sensory state seems confusing to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.735,
    "end": 170.095,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.916,
    "end": 178.386,
    "text": "It doesn't have to have any influence in the real system, but it's, it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 179.513,
    "end": 206.466,
    "text": " it could but i think in a if we if the sensors and actuators of the system are separate then that edge may have no effect but in principle it exists because the the the states are not like pre-tagged it's always just based upon the choice the internal state",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 207.577,
    "end": 209.66,
    "text": " So a causal edge here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 209.68,
    "end": 223.858,
    "text": "In sketching out the specific system, you would quickly determine whether it's something causal in the system or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 225.4,
    "end": 228.083,
    "text": "We'll see if it comes up in any of the examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.965,
    "end": 230.306,
    "text": "Susan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 233.43,
    "end": 233.77,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.072,
    "end": 235.913,
    "text": "So can you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.568,
    "end": 248.983,
    "text": " I'm really unclear in what are the boundaries between the external and internal states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.064,
    "end": 253.87,
    "text": "In other words, specifically, what is action in this context?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 256.272,
    "end": 259.116,
    "text": "And I'm wrestling with speech acts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.771,
    "end": 265.857,
    "text": " Not doing something is still an action on your environment if you think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.18,
    "end": 269.441,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.801,
    "end": 279.511,
    "text": "Well, one aspect of action that is not really looked at in the textbook is deciding when to act.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.432,
    "end": 288.9,
    "text": "Like in the kind of simplest format of the action perception loop, there's just a perception and an action every single time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.42,
    "end": 299.129,
    "text": " So like the choice to like wait versus to do something at all, sometimes that's brought in as like a null action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 299.189,
    "end": 300.431,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.571,
    "end": 304.775,
    "text": "Yeah, just like an action that kind of like keeps you where you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 304.815,
    "end": 306.597,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.137,
    "end": 312.222,
    "text": "There can be a nested model where the top is a binary decision, you know, make a move or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.422,
    "end": 315.645,
    "text": "Within make a move, there's just the four moves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.847,
    "end": 317.267,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.669,
    "end": 343.018,
    "text": " is is that have anything to do with the um transition function the um the the transition function is describing how the state the hidden states change through time so it's the beatrix",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.804,
    "end": 364.329,
    "text": " We're getting an observations and then the a kind of match the observations to the hidden states so from the thermometer readings to the temperature in the room, and then the transition function is the temperature of the room changing per delta T just per time interval.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 366.211,
    "end": 367.333,
    "text": "The temperature in the room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 368.835,
    "end": 370.677,
    "text": "underlying changing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 373.171,
    "end": 378.316,
    "text": " And the formulas on the right there, that's actually for the transition functions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.236,
    "end": 379.557,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.717,
    "end": 393.73,
    "text": "So then the three here, which is B, is saying it's the distribution of the state at the next time point conditioned upon the state at the current time point and the policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.61,
    "end": 403.178,
    "text": "So it's like the temperature in the room at the next time point is conditioned upon the current temperature in the room and whether I'm turning on the air conditioner or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.664,
    "end": 405.046,
    "text": " Okay, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.066,
    "end": 412.216,
    "text": "And then which policy is like selecting which slice of B gets applied as the transition function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.238,
    "end": 413.979,
    "text": "And one last question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 414.84,
    "end": 429.942,
    "text": "So is this model just saying that there was a move made and there was a, and that's a set, is that, you know, as I'm seeing two different, is that perception action or is that just a different action repeating?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.491,
    "end": 435.495,
    "text": " in the picture, you know, just looking at the, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.396,
    "end": 438.398,
    "text": "Like the fact that there's two threes here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 440.159,
    "end": 443.963,
    "text": "No, actually, because you've got the upper and the lower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.263,
    "end": 446.846,
    "text": "So is that the higher high road, low road?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.046,
    "end": 447.466,
    "text": "No?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 448.107,
    "end": 456.675,
    "text": "So 4.3, the top graph is the discrete time model, and the lower graph is the continuous time model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 457.336,
    "end": 457.676,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.016,
    "end": 459.878,
    "text": "And then in...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 462.018,
    "end": 464.501,
    "text": " Here's just the discrete time model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 465.443,
    "end": 465.603,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.963,
    "end": 467.485,
    "text": "Just the top half of figure 4.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 467.585,
    "end": 467.786,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.47,
    "end": 478.179,
    "text": "So here again, we see the B and it's the hidden state at the next time point, tau plus one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.461,
    "end": 479.561,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.581,
    "end": 482.305,
    "text": "Conditioned upon the current state and the policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.007,
    "end": 485.99,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.01,
    "end": 486.27,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.702,
    "end": 500.477,
    "text": " And I think as we kind of may have alluded to earlier, there's like this representation of the generative model, which is the partially observable Markov decision process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 501.619,
    "end": 506.925,
    "text": "And then there's this particular partition representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 508.086,
    "end": 514.654,
    "text": "So here we have the kind of hinting at a circularity and the flows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.769,
    "end": 517.452,
    "text": " because the dot on top is the derivative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 518.773,
    "end": 531.107,
    "text": "So the flows across these four states, which we can associate from the perspective of these internal states as the sensory action and external.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 532.448,
    "end": 544.101,
    "text": "And then there's this form, which is more like a branching tree a little bit, because here the observations are a dead end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 561.648,
    "end": 571.201,
    "text": " I don't exactly remember what we got to last week, but I think we looked at figure 3.2 with the scatter plots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 573.805,
    "end": 578.412,
    "text": "Does anyone want to ask a question, or should we just try to go through these?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.327,
    "end": 589.427,
    "text": "Okay."
  },
  {
    "start": 594.048,
    "end": 598.553,
    "text": " Oh, I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 598.573,
    "end": 599.594,
    "text": "That was a hiccup by accident.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.614,
    "end": 600.195,
    "text": "I apologize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 601.557,
    "end": 601.817,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.157,
    "end": 602.358,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.378,
    "end": 603.439,
    "text": "Let's look through some of these.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.461,
    "end": 611.908,
    "text": "What's the difference between the terms Bayesian brain hypothesis, predictive processing, predictive coding, actin inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 612.689,
    "end": 615.653,
    "text": "So it's discussed in several places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 616.914,
    "end": 619.397,
    "text": "Here's one reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 620.002,
    "end": 646.077,
    "text": " these terms can be just kind of broadly used to refer to very similar uh theories and kinds of models or if you really get down to the last mile they could differ um bayesian brain hypothesis hypothesis suggesting it's something that could be tested and falsified for a given system like you can hypothesize that the brain is doing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.563,
    "end": 655.352,
    "text": " Bayesian computation or is doing something that can be modeled with Bayesian computation, you could hypothesize that and have criteria for why you would accept that hypothesis or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.372,
    "end": 658.616,
    "text": "And then you might as well do that and then find out for not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 659.096,
    "end": 672.57,
    "text": "So this is testable hypothesis describing whether brains, which are just some systems in the world, but a tiny subset of systems do Bayesian computation, however they do it or whatever their distributions are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 673.242,
    "end": 703.148,
    "text": " um active inference probably a lot of ways to define it in a broader sense it could just refer to models that have action included within the scope of inference like models that do sense making and action selection or to be more specific we might be talking about active inference models like perception action models under the free energy principle which is kind of chapter three high road and then predictive processing and predictive coding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.685,
    "end": 727.667,
    "text": " Again, these are sometimes used like interchangeably, but to get technical about it, predictive processing is the kinds of architectures that will get visited in this textbook where there's a multi-scale model and higher levels are making predictions about lower levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 728.018,
    "end": 734.985,
    "text": " And the entire processing architecture has to do with predictions, hence predictive processing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 736.046,
    "end": 747.296,
    "text": "Predictive coding kind of nuances that a little bit and highlights that the messages that are being passed encode predictions and prediction errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.739,
    "end": 754.363,
    "text": "So you have predictive processing systems that do predictive coding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 755.677,
    "end": 781.212,
    "text": " you could also design one that had like one or the other so they're all really related but they're not exactly exactly the same term if one defines preferred states as expected states",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 783.554,
    "end": 787.702,
    "text": " then one can say that living organisms must minimize the surprise of their sensory observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 788.663,
    "end": 789.966,
    "text": "I'm not clear on the ontology here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 790.106,
    "end": 794.754,
    "text": "Is it that preference is the same as expectation or that formally we can use them in the same equation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 800.665,
    "end": 806.035,
    "text": "There's a lot of partial related questions here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.777,
    "end": 838.755,
    "text": " i'm not sure i don't remember if we looked at this one last week when we're talking about the variable called preference c it's a distribution over observations i think last week we talked about how expectation can be used in kind of two senses one is the expectation is like about an event that hasn't happened yet",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 839.005,
    "end": 842.33,
    "text": " And that's a conversational usage of what we expect to happen in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.991,
    "end": 847.217,
    "text": "Also, a given distribution can have the expectation calculated of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.257,
    "end": 854.588,
    "text": "That's the fancy E. And that's the same thing as saying the central tendency or the mean of that distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.534,
    "end": 864.523,
    "text": "In the case of pragmatic value in expected free energy equation 2.6,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 865.87,
    "end": 871.861,
    "text": " Yes, when we talk about preference, we're talking about an expectation about observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.883,
    "end": 882.782,
    "text": "But just saying expectation alone is almost not a complete sentence because it's like saying, well, I'm talking about the mean, but the mean of what variable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.872,
    "end": 897.628,
    "text": " So there's settings where it's clear from context what it means and that we're talking about the same variable, but you could also imagine a situation where you're talking about the central tendencies or the future possibilities of other variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 898.409,
    "end": 914.389,
    "text": "So it's not that the terms are simply identical by definition, it's that in certain kinds of generative models, they're described the same way to highlight that there isn't the proposal of like a reward function, but rather there's a direct surprise bounding on expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 914.504,
    "end": 915.065,
    "text": " Aaron?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 917.969,
    "end": 919.031,
    "text": "Yeah, well, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.391,
    "end": 923.297,
    "text": "This isn't exactly a refinement of this question, but it's related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.317,
    "end": 942.064,
    "text": "I guess like I have been struggling with how to think about, I guess, the distinction between priors and preferences in contexts where you, in advance of receiving some observation, have reason to expect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 942.179,
    "end": 948.649,
    "text": " and I think in the narrow sense, that conditions will be other than you would prefer, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.789,
    "end": 967.136,
    "text": "So if the weather report this morning says it's going to be 115 in the afternoon and I, you know, my car breaks down and I gotta, before I open the car door to get out on the side of the road, I expect it to be uncomfortable and challenging to my body's need for homeostasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 967.657,
    "end": 970.161,
    "text": "I guess like in a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 972.284,
    "end": 997.549,
    "text": " Maybe it's not an ontological distinction, but I am struggling with under what conditions is reasonable to substitute a distribution that describes preferred states into a context where you would be talking about a distribution that describes your belief about states prior to getting more information about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 997.63,
    "end": 999.113,
    "text": " Yeah, great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.794,
    "end": 1001.357,
    "text": "So let's just say we're talking about temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1001.477,
    "end": 1007.789,
    "text": "So our C preference distribution is going to be like homeostasis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.55,
    "end": 1013.8,
    "text": "It's just a Gaussian distribution around 37 C.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.235,
    "end": 1016.778,
    "text": " So we're going to talk about that as our preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.279,
    "end": 1018.26,
    "text": "Now, it's also a prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1019.001,
    "end": 1020.903,
    "text": "That's why these things are like not complete sentences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.963,
    "end": 1024.187,
    "text": "It's not that there's one variable, just only and always called prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1024.888,
    "end": 1030.535,
    "text": "Because any distribution that could be updated, you might be talking about the prior distribution of that distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.776,
    "end": 1040.066,
    "text": "So hence, it's like when talking about like beliefs, it's like about which one of these priors, prior distribution about which one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.487,
    "end": 1042.369,
    "text": "Now, when people don't further...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1042.687,
    "end": 1072.153,
    "text": " define which prior they're talking about usually they're talking about d the prior on hidden states so let's just say that um we're in the desert and we we have an accurate thermometer so our a matrix is is just the identity matrix just the ones on the diagonal so we're just getting accurate thermometer readings um we prefer 37 in terms of our homeostasis",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1072.792,
    "end": 1075.015,
    "text": " but our prior belief is that it's gonna be 50.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1077.839,
    "end": 1084.749,
    "text": "And then we get a thermometer reading of 50, and then that's consistent with the hidden state estimate of the temperature being 50.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.274,
    "end": 1100.352,
    "text": "So there's totally no issue with preferences over observations interfering with the sense-making process, because C doesn't come into play with A or D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.103,
    "end": 1115.151,
    "text": " However, the C does shape action through a pragmatic value, but C doesn't play a role in sensemaking or in estimating future time steps at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1148.729,
    "end": 1150.553,
    "text": " Is there a minimal example of a thing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1157.369,
    "end": 1160.997,
    "text": "Is it correct to say a thing is the temporary persistence of a Markov blanket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.621,
    "end": 1167.953,
    "text": "Perhaps that it's the persistence of something that can be modeled with a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1170.633,
    "end": 1181.089,
    "text": " Gareth J. Are all things, then just non equilibrium steady state processes well considered one way they're at an equilibrium point to allow them to be measured.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1182.831,
    "end": 1189.241,
    "text": "Gareth J. But by virtue of our scenario overall big dissipative the fact that they're existing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.301,
    "end": 1191.865,
    "text": "Gareth J. Is non equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1195.591,
    "end": 1201.799,
    "text": " Do we need to be more strict in saying these things are only self-evidencing things rather than things in the colloquial sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.342,
    "end": 1206.865,
    "text": "Totally depends on what's being discussed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.067,
    "end": 1216.618,
    "text": "If it's an inner particle, then it may not be providing any extra information to say that it's self-evidencing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.998,
    "end": 1222.425,
    "text": "Like to say that rock is fulfilling predictions that it expects to be there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1223.789,
    "end": 1227.613,
    "text": " First issue, you may not be adding any richness to the account.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.714,
    "end": 1238.004,
    "text": "And second off, you're proposing a map that's indicating some causal capacities for the rock that are unrealistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1239.125,
    "end": 1253.661,
    "text": "Whereas when you start getting into that squirrel is acting like XYZ, then you are creating parsimonious accounts of behavior that can't be accounted with simpler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1254.451,
    "end": 1259.16,
    "text": " and you are making maps that have features that that system might actually have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1262.305,
    "end": 1274.788,
    "text": "So the squirrel self-evidencing, it's probably more of a value add in terms of the account, and it's probably more plausible mechanistically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.497,
    "end": 1291.122,
    "text": " What is the counterpart in an active agent to conserve versus dissipative physical systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1298.111,
    "end": 1300.394,
    "text": "What is the analogy to friction in a cognitive system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1300.454,
    "end": 1301.815,
    "text": "How strong is this analogy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.379,
    "end": 1306.761,
    "text": "That's an interesting question to explore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.861,
    "end": 1313.449,
    "text": "One possibility is like, what is heat and what is work in Bayesian mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1314.762,
    "end": 1324.934,
    "text": " like if all of the information of the observation were used for belief updating, that would be like extracting 100% of the efficiency of the fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1325.996,
    "end": 1335.387,
    "text": "If you perfectly burnt the fuel, the maximum extractable heat as work would be like from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.852,
    "end": 1342.481,
    "text": " the hydrocarbon down to whatever the terminal product of burning was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1342.681,
    "end": 1348.771,
    "text": "Like you could burn the candle and extract all the heat from the candle or like how they test how much calories are in food.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.512,
    "end": 1353.118,
    "text": "Like you just burn it and there's a maximum of energy to extract.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.32,
    "end": 1362.994,
    "text": "So then by analogy, there's like a maximum amount of information to extract from a given signal, like described by its entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.037,
    "end": 1378.49,
    "text": " So there might be something like how much of the entropy of the signal is going into belief updating versus how much is being partitioned to like dissipative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1381.953,
    "end": 1385.637,
    "text": "But I'm not sure about friction specifically because friction isn't just the same as heat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1393.244,
    "end": 1393.504,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1393.838,
    "end": 1395.08,
    "text": " Chapter 3, High Road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1397.884,
    "end": 1403.611,
    "text": "Starts from the premise that to survive any living organism has to maintain itself in a suitable set of preferred states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1405.294,
    "end": 1409.239,
    "text": "These preferred states are first and foremost defined by niche-specific evolutionary adaptations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.14,
    "end": 1415.087,
    "text": "However, as we will see later in advanced organisms, these can also extend to learned cognitive goals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1416.721,
    "end": 1424.874,
    "text": " I'm curious about the applicability of active inference to social structures such as economic systems, firms, self-organizing groups, and government systems, amongst others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.236,
    "end": 1433.067,
    "text": "One can argue that social systems have preferred states created from both evolutionary niche and learned cognitive mechanisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1433.248,
    "end": 1435.631,
    "text": "Has active inference yet been applied to these sorts of systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1438.877,
    "end": 1442.863,
    "text": "Yeah, cool that some people have added some links.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1448.918,
    "end": 1452.284,
    "text": " Yes, applied to a limited extent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1461.582,
    "end": 1467.433,
    "text": "Ali explains in the intro video Markov blanket is a boundary in the state space, not necessarily a spatial temporal boundary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.73,
    "end": 1484.815,
    "text": " If we were talking about a spatial temporal state space like GPS coordinates comma time, then a boundary in the GPS comma time space would be a state space boundary corresponding to a spatial temporal boundary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.655,
    "end": 1499.234,
    "text": " But if our state space were talking about something that wasn't spatial temporal, then the Markov blanket is not necessarily spatial temporal, even in the map, even before getting into the map territory stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1500.516,
    "end": 1505.824,
    "text": "What allows the agent to be statistically separated from its boundary as observed through its blanket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1505.844,
    "end": 1510.07,
    "text": "So I take it the blanket is a lens through which the agent observes their environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1511.913,
    "end": 1512.173,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1514.376,
    "end": 1514.937,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1517.245,
    "end": 1519.448,
    "text": " Would this lens be defined by their affordances?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1521.811,
    "end": 1522.091,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1522.391,
    "end": 1526.256,
    "text": "Just like on the inbound, it's kind of like glasses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.716,
    "end": 1528.218,
    "text": "Like they're a real, like a lens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.739,
    "end": 1531.282,
    "text": "And then like light comes in and gets focused in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.402,
    "end": 1535.267,
    "text": "But then also if it were a light source, it would diffract out the other way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.287,
    "end": 1541.554,
    "text": "It's not exactly the same because inbound perception isn't exactly the same as outbound action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1541.675,
    "end": 1545.379,
    "text": "But it is like a two-way lens that has...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.764,
    "end": 1571.839,
    "text": " communication across interface susan wait on mute but then yes susan oh sorry um so i was listening to one of the uh videos and i've heard um kristen say that markov blankets were you know were really just about computational models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.148,
    "end": 1576.191,
    "text": " What do you have to say about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.98,
    "end": 1591.853,
    "text": "Like he meant that they were being introduced as a computational tool rather than like an ontological claim about reality or what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1591.873,
    "end": 1594.897,
    "text": "Okay, that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.917,
    "end": 1595.297,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.8,
    "end": 1602.147,
    "text": "Like, let's just say we had 10 variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1603.19,
    "end": 1606.816,
    "text": " We could test a model that every variable influenced each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1606.836,
    "end": 1615.31,
    "text": "And every three-way combination matters uniquely and every five-way and seven and nine-way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.33,
    "end": 1623.182,
    "text": "It's like we could test kind of the fullest possible model, but that's more parameters to estimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1624.805,
    "end": 1630.294,
    "text": "So it reduces the statistical power per parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1630.696,
    "end": 1654.695,
    "text": " so this is a fundamental trade-off in statistical modeling which is like um the fewer variables you include for a given sample size the more statistical power you have however you run the risk of partitioning variants inappropriately whereas the more variables you include",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1655.485,
    "end": 1662.892,
    "text": " that may come closer into alignment with what is like believed to be kind of like a very multi-causal nexus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.454,
    "end": 1673.183,
    "text": "So it can kind of feel nice and appropriate to enable the possibility of intersections mattering for causality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1673.223,
    "end": 1682.252,
    "text": "However, that can make the causal state spaces very large, diluting the statistical power to detect anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1684.055,
    "end": 1695.175,
    "text": " And so models are chosen to be at a trade-off point between strongly explaining too few factors and weakly explaining too many factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1696.257,
    "end": 1706.957,
    "text": "And that's why how many parameters are included in that kind of best performing trade-off model, that kind of parameter estimation is about the map, not about the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1729.988,
    "end": 1733.532,
    "text": " does the distinction between active learning and active inference have to do with these important things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1733.552,
    "end": 1745.466,
    "text": "I don't remember exactly which paper the active learning was, but I remember that, again, sometimes the term is used in a narrow or a broad sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1745.646,
    "end": 1749.01,
    "text": "In a broad sense, active learning and active inference are the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1749.631,
    "end": 1752.835,
    "text": "They could both be used to describe a system that's active and learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1753.936,
    "end": 1755.658,
    "text": "But then if you really get into it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.162,
    "end": 1761.207,
    "text": " A paper might say, well, we're using this to mean this specifically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1761.708,
    "end": 1766.793,
    "text": "So without the link, I don't remember exactly what was meant by active learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1769.496,
    "end": 1772.84,
    "text": "Are internal state parameters referring to the edge of the Markov state space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.683,
    "end": 1779.587,
    "text": "No, they're referring to the inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1783.094,
    "end": 1788.92,
    "text": " Markov blanket is the edge like the crust around the internal state parameters?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1800.573,
    "end": 1808.621,
    "text": "Is there any identification for the edge of a Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.641,
    "end": 1810.283,
    "text": "Like whichever",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1811.343,
    "end": 1814.789,
    "text": " whatever variable you're going to point to and say, that's the one that I'm going to call internal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1816.051,
    "end": 1821.339,
    "text": "So that's just, that's a choice by the modeler, which one is going to be called internal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1821.359,
    "end": 1828.291,
    "text": "Then all of the crust around it, all of the envelope that encloses it is the blanket of that state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.593,
    "end": 1837.806,
    "text": "But if you had chosen a different state to choose as internal, you would have ended up getting a different set of blanketing nodes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1845.008,
    "end": 1867.928,
    "text": " kind of like let's just say um you know we're we're doing google maps and so we're gonna say um for this trip from a to b this is the first street this is the last mile and then this is like the space between but if you had chosen a different journey maybe the street that was in the in between for the first journey is going to be the first mile for this other journey",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1882.15,
    "end": 1886.416,
    "text": " In advanced organisms, preferred states can also extend to learned cognitive goals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.019,
    "end": 1894.008,
    "text": "And in advanced organisms like human, they can achieve preferred states by increasing the abstract social cultural strategies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1894.108,
    "end": 1902.22,
    "text": "My question is, if they are cast in terms of active inference, must all of these preferred states and strategies be ultimately linked to survival in some way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1903.843,
    "end": 1907.989,
    "text": "Or in the case of advanced organisms, can free energy be related to something other than survival?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1914.095,
    "end": 1920.142,
    "text": " If acting that way was incompatible with existence, you wouldn't see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.183,
    "end": 1926.829,
    "text": "If acting that way was deleterious to fitness, you'd see it less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1930.593,
    "end": 1936.98,
    "text": "So that's the kind of evolution-like component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1938.057,
    "end": 1953.94,
    "text": " which is like, it doesn't mean that every single phenomena was necessary and sufficient for existential success, but certainly measuring something means that it wasn't incompatible with existence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1958.51,
    "end": 1987.605,
    "text": " So then by the time that we're talking about organisms that might be with all kinds of different cognitive phenomena, especially if they're going to be like a new or changing niche, you could have maladaptive, you have a ball rolling downhill, and you could just be observing the last five minutes of a maladaptive trajectory of the ball rolling downhill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1987.889,
    "end": 2017.035,
    "text": " so like past returns do not guarantee future returns or whatever they say can markup blankets be considered as decoupling an agent in an environment yes you could think of it as how they are coupled which is to say how they are decoupled like how they are articulated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.893,
    "end": 2023.059,
    "text": " The joint is both how things are connected and how they're separated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.032,
    "end": 2036.235,
    "text": "Can surprise only be diminished through action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2037.977,
    "end": 2047.748,
    "text": "So here's a quote from chapter two, pointing to the two ways that discrepancy is addressed in active inference, change of mind or change the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2048.183,
    "end": 2067.88,
    "text": " So if we're in the temperature situation, we prefer to be homeostatic and the temperature is higher than we expect, then we can either take affordances that we believe are going to bring the temperature back into alignment with our observation preferences, that's pragmatic value, change the world,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2068.366,
    "end": 2078.119,
    "text": " Or we could learn and come to dissipate the discrepancy just by updating what we expect things to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.321,
    "end": 2085.669,
    "text": "However, for like a physiological prior, those may not be learnable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.654,
    "end": 2092.218,
    "text": "Huh?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.079,
    "end": 2093.8,
    "text": "I guess...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.826,
    "end": 2115.585,
    "text": " uh what happens if the observations uh were surprising and then they fall back into um non not surprising um values like the temperatures spiked up unexpectedly but then it just came back down to normal yes that's a good question so like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.797,
    "end": 2125.188,
    "text": " a related question is like, what updating strategies are adaptive under what patterns of environmental regularity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.45,
    "end": 2136.763,
    "text": "So if the environment was like very slowly changing, then a very slow changing belief updating might be appropriate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.132,
    "end": 2141.637,
    "text": " If the environment were very rapidly changing, then you might want to track it more rapidly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.177,
    "end": 2149.585,
    "text": "If the environment had like one in 10 times, let's just say there was like just erroneous measure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2150.466,
    "end": 2166.143,
    "text": "So if it was like a noisy environment where sometimes you got like wild measurements, but then they were just like part of noise, then you would have something like a Kalman filter, which is basically what's happening here in the temperature example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.785,
    "end": 2182.239,
    "text": " This kind of looks like CO2 measurements in the environment too, but it's kind of like you have these noisy measurements coming in, and then the Coleman filter is basically saying, how can we smooth this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2184.242,
    "end": 2191.17,
    "text": "In the extreme case, it smooths just taking the moving average in this extreme slow case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.19,
    "end": 2197.497,
    "text": "In the extreme fast case, the smoothing is just tracing exactly what you're getting, but then there's somewhere in between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.831,
    "end": 2201.296,
    "text": " that like smooths out some of the noise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.12,
    "end": 2208.626,
    "text": "Could you put this under the umbrella of the action of updating your own beliefs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.793,
    "end": 2220.723,
    "text": "Yeah, like moving a belief distribution could be understood as a cognitive action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2221.784,
    "end": 2224.328,
    "text": "Like if you had the choice to do it or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.033,
    "end": 2233.004,
    "text": " or if you had the mental action to attend, if you had the, you have mental action on the dial of how much to pay attention to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2234.206,
    "end": 2240.935,
    "text": "Zero attention to it means it's gonna have no impact on your beliefs because if you don't pay attention to something, it's as if it didn't happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2240.955,
    "end": 2249.287,
    "text": "100% attention to it means you're gonna update your beliefs 100% to exactly whatever the last thing that was said was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.468,
    "end": 2254.534,
    "text": "So then that would open up an internal policy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.898,
    "end": 2261.545,
    "text": " possibility of how much should I attend to this environment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.407,
    "end": 2272.218,
    "text": "So then in a noisier environment, you would want to reduce your attention to make your smoothing slower, to average out more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.718,
    "end": 2284.673,
    "text": "Whereas if you were in a more precise environment with like more relevant or salient information, you'd want to increase your attention to maximize information gained.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2288.062,
    "end": 2306.596,
    "text": " But then when we're measuring supplies and the temperature spikes up and then it spikes back down, I guess you could say that spike itself is a surprise, but then now your price for the temperature is kind of normalized again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.636,
    "end": 2311.926,
    "text": "So, yeah, I guess, you know, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.948,
    "end": 2319.354,
    "text": " it could be a little bit confusing on how you think about, you know, supplies is only minimized through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.554,
    "end": 2324.6,
    "text": "But in this case, it kind of feels like it was minimized just from the environment itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.663,
    "end": 2329.004,
    "text": "Yeah, interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2329.044,
    "end": 2329.405,
    "text": "Susan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.81,
    "end": 2343.28,
    "text": "So is there a specific parameter or computation to account for the capacity constraints?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.833,
    "end": 2347.497,
    "text": " Amy Dabbs, And like cognitive capacity or cognitive control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.557,
    "end": 2357.788,
    "text": "Amy Dabbs, You know, people slip into a state of overwhelm they're going to change state so yeah this would be a back to the transition, but I didn't know if it was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.372,
    "end": 2369.2,
    "text": "David Larson, That that's really interesting I mean let's get you down and explore it because I think that's what we're not going to find that in the minimal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.698,
    "end": 2371.539,
    "text": " P. O. Mdp.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2371.94,
    "end": 2374.042,
    "text": "Maybe just a set change, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.182,
    "end": 2374.402,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2374.423,
    "end": 2384.335,
    "text": "But if we if we let's just say that we we imagine two internal states that the agent can be in one or legit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2384.355,
    "end": 2395.508,
    "text": "What about So how about instead of too cold just right and just hot?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.348,
    "end": 2403.255,
    "text": " there's an internal model that basically is this epistemic, is this too boring?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.136,
    "end": 2404.656,
    "text": "Just right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.057,
    "end": 2406.058,
    "text": "Or is this too much?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2406.798,
    "end": 2414.266,
    "text": "That doesn't mean that that's the ultimate truth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.626,
    "end": 2421.713,
    "text": "You could have a temperature estimating agent that actually thinks that there's rooms that are too hot, but actually it could do just fine to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.654,
    "end": 2425.917,
    "text": "Just because it's the agent's estimate doesn't mean that it is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2426.386,
    "end": 2448.242,
    "text": " that but so there's there's the um the agent is doing um estimate it's getting challenge on the y-axis and then it's estimating how difficult is this content and then it's doing some estimate and then like the the accurate estimator",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.661,
    "end": 2474.719,
    "text": " would have um basically would would have would know when it was in boring just right or too hard whereas you could have an optimistic estimator that you know skews to one way or the other way and then each of those three states might be associated with um like maybe in the in the just right phase maybe that's when there's a feeling like there's the highest amount of potential control",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.138,
    "end": 2483.286,
    "text": " But then if something's too easy or too hard, somebody might feel like there's no point in exerting cognitive control because it won't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.448,
    "end": 2487.29,
    "text": "Well, it'll matter if you have ADHD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.31,
    "end": 2492.095,
    "text": "So, yeah, managing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2492.115,
    "end": 2493.636,
    "text": "I mean, it's the energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.977,
    "end": 2496.579,
    "text": "It's the entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.081,
    "end": 2499.282,
    "text": "It comes back to the entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.683,
    "end": 2504.487,
    "text": "Yeah, too ordered or too complex?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.091,
    "end": 2508.094,
    "text": " Yep, it does not have this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.115,
    "end": 2511.859,
    "text": "Yeah, that would be good to add to that graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.299,
    "end": 2512.94,
    "text": "The flow graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.141,
    "end": 2516.064,
    "text": "Too redundant or too novel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2517.245,
    "end": 2517.345,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.054,
    "end": 2530.12,
    "text": "How is Markov blanket a restatement of the classical action perception cycle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.503,
    "end": 2549.921,
    "text": " There's probably a lot of ways to... It's a bit of a restatement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.264,
    "end": 2557.452,
    "text": "Perhaps because... That's so funny.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.472,
    "end": 2563.742,
    "text": "Like, cybernetic agent is like... I was expecting more that looked like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2565.365,
    "end": 2566.266,
    "text": "But hey...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.634,
    "end": 2590.093,
    "text": " mean so for for many decades i mean this is more similar than not to what we've just been discussing with predictive processing and active inference incoming sensors with a reference prediction and then the differential goes on to influence the actuator",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2590.782,
    "end": 2617.026,
    "text": " that acts upon the external system which then responds and then passes another sensor observation um so conceptually like no one really disagrees that observations are coming in actions are going out and there's like causation on both sides or you know so the reason why the markov blanket is a bit of a restatement is because this cybernetic loop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.428,
    "end": 2646.76,
    "text": " was phrased before the Bayesian causal graph literature of the 1990s like with Judea Pearl so active inference restates the classic action perception cycle in terms of the causal graphs that have existed since the 1990s I will say I want to say that uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2647.313,
    "end": 2655.13,
    "text": " The cybernetic viable systems models come a long way too, so don't throw the baby out with the bathwater.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.994,
    "end": 2659.399,
    "text": "No, definitely not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.666,
    "end": 2670.745,
    "text": " Dave Douglas is a working lot with American cybernetic society and and I think the combining our journal work with the.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.088,
    "end": 2679.801,
    "text": "International Society for system science and cybernetics like it will reveal many, many.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2681.536,
    "end": 2708.657,
    "text": " yeah this these are these are like it's just here it's like well the circle is kind of conceptual but now we have a technical definition for that boundary in terms of causal graphs Markov blanket or in terms of category theory but um like Robert Rosen's ecology I don't know how useful the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2709.312,
    "end": 2734.442,
    "text": " wikipedia's but he developed a lot of category theory ecology models again ones that that presage a lot of what were like here but it's just it's just that it's it's a schematic so it's very evocative",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2736.515,
    "end": 2742.724,
    "text": " What's really different now is there are open source software packages and first principles formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.207,
    "end": 2756.864,
    "text": "That's like, this is literally, far more similar than not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.486,
    "end": 2762.472,
    "text": "Even this looks like those Markov blanket scatter plots in the chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.734,
    "end": 2766.517,
    "text": " There's more similarities than not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.663,
    "end": 2779.474,
    "text": "Hence, trying to get them all together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2785.241,
    "end": 2791.969,
    "text": "Living systems resolve fundamental biological problems by exerting active control over their states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2792.742,
    "end": 2802.177,
    "text": " is the way to understand why automatic mechanisms are active in thinking that these are still involved in calculating EFE, but the time horizon is small.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2802.697,
    "end": 2806.123,
    "text": "Is there another concept of passive control or is all control active?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2808.927,
    "end": 2810.97,
    "text": "Take the example of touching a hot kettle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.723,
    "end": 2852.297,
    "text": " probably a lot of ways to think about this one um but the automatic mechanisms being active like I I don't think that they always need to have planning like for example secreting insulin and glucagon",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2852.615,
    "end": 2863.749,
    "text": " and hormone regulation of blood sugar, that could just be reflexive actions, like as something gets to here, then more of this hormone is secreted, and then as it goes down, more of that hormone is secreted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.409,
    "end": 2868.655,
    "text": "So that's still active control, but it's just reflexive active control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2869.836,
    "end": 2877.205,
    "text": "Is there a concept of passive control that's almost like action without action, or like the ability to control something without acting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.147,
    "end": 2886.923,
    "text": " Kieran Stonewall- Which you could probably design a situation where that does happen like where by not by non action the agents has the other system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2887.384,
    "end": 2896.02,
    "text": "Kieran Stonewall- aligned with its preferences, but suffice to say it wouldn't be doing so by virtue of actions that it took i'm Aaron.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2898.481,
    "end": 2904.408,
    "text": " David Price- yeah I guess riffing on this and i'm in the chapter and a few other places in discussion on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.928,
    "end": 2911.936,
    "text": "David Price- The the concept of like temporal depth of a system and like its ability to plan has come up and I guess like this is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.557,
    "end": 2922.548,
    "text": "David Price- This is partly in this question we're talking about like some actions that a system undertakes are informed by that temporal depth, but some actions that the same system undertakes are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.304,
    "end": 2930.673,
    "text": " really shallow, like removing your hand from the hot kettle, you don't need to see very many steps in the future to understand that's like the highest value thing you can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.435,
    "end": 2945.79,
    "text": "But so I guess that does that that also implies something about there being like a heterogeneity in the thickness of consideration of actions that the agent is driving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.974,
    "end": 2950.836,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2951.036,
    "end": 2951.877,
    "text": "Like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2952.025,
    "end": 2978.826,
    "text": " the organism is a multi-scale phenomena so even in the same moment like it might the best map of what I was doing one hour ago might have been um regulating uh oxygen homeostasis over a second time scale but then you know food over a day-long time scale but then like financial you know well-being over a year so you could make multiple time scales of action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2980.358,
    "end": 2983.161,
    "text": " Even a slow action is happening in a moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2987.406,
    "end": 2993.813,
    "text": "And then the kind of no planning model, first off, it's the computationally simplest, so it's a great starting point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2994.594,
    "end": 3004.946,
    "text": "And then you can look for deviations and then ask, do we need additional phenomena to account for what we're seeing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.328,
    "end": 3008.29,
    "text": "Like birds flocking,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.046,
    "end": 3011.731,
    "text": " like the famous models don't involve any planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3012.032,
    "end": 3013.615,
    "text": "It just involves the visual field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3014.196,
    "end": 3016.42,
    "text": "And basically it's like, if they're too close, like you pull back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3016.5,
    "end": 3019.366,
    "text": "And then if they're like too far, you move towards them or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3021.109,
    "end": 3027.882,
    "text": "So then if you do a model and you find that you can replicate the statistics of this empirical flock,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3028.385,
    "end": 3033.914,
    "text": " There's no need to invoke planning, but then maybe there's a residual with some real system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3033.934,
    "end": 3039.182,
    "text": "It's like, oh, actually, you know, let's try, let's see if planning could explain that variance gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.843,
    "end": 3040.163,
    "text": "Susan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.654,
    "end": 3047.575,
    "text": "Wait, unmute then, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.313,
    "end": 3079.772,
    "text": " um oh gosh i was looking at one of your slides and and uh so i it i i totally lost my train of thought but i will say that i saw a video back on the the swarm and the studies show that a large percentage of the of the swarm is just following you know whoever is closest to them so you can't ever think this thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.866,
    "end": 3106.452,
    "text": " yeah that's that's this is a very funny in the ants like I I don't I think it's a little bit sensationalist to call them lazy but it was it's like most nestmates at most moments are just standing there that's excess capacity or could it you know when if nestmates die or something if there's like an alarm and so it's like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.377,
    "end": 3121.259,
    "text": " If flocking is the goal, then... Yeah, well, I think there's a link back to the cognitive capacity and level of extraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.541,
    "end": 3131.896,
    "text": "In other words, if I don't understand more than two dimensions, then I can only reconfigure two dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.878,
    "end": 3135.021,
    "text": "Maybe every thought, but anyway, just a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.835,
    "end": 3175.487,
    "text": " Yeah, Hector, he's been sharing some resources about the development that happens in a child between like the ages of four and seven as they're separating out like beliefs from knowledge, where they'll do the experiment, like a little character sees somebody put a ball into a box, then the character leaves the room and then the ball is moved and the character comes back and then you ask like, where does the character think the ball is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.311,
    "end": 3179.335,
    "text": " And then it's kind of like theory of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3179.915,
    "end": 3184.261,
    "text": "Like you have to understand that, well, the ball is really in a different place, but they think it's here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3185.642,
    "end": 3195.334,
    "text": "So then that, um, that it's the holding up of multiple possible beliefs about where that ball is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3196.755,
    "end": 3204.765,
    "text": "But if you didn't have the capacity to entertain and like to juxtapose the memory of the ball moving with when they left the room and all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3206.095,
    "end": 3235.697,
    "text": " then you would collapse down to either the ball being you know to to incorrect answer to that question but then what's interesting about it is like one day the child will not be able to do it and then like two weeks later the child will be able to do that and then that capacity will never leave them for their life just like on a random day when they're five years old yeah okay cool well fun",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3236.2,
    "end": 3264.655,
    "text": " chapter three interesting high road um hope we got to some good topics uh chapter four is is kind of like where the high and low road are gonna they're gonna merge back together and chapter four is gonna be the um the formal treatment as they say of degenerative models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3264.905,
    "end": 3292.448,
    "text": " that's going to include some kind of like background material on the causal graphs and then come to like figure 4.3 which is like the rosetta stone image with a discrete time and the continuous time generative models so these are two possible architectures that treat time differently that have the kind of top-down characteristics that were discussed on the high road",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3293.575,
    "end": 3296.725,
    "text": " and have that low road construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.249,
    "end": 3300.396,
    "text": "So, thank you all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3300.657,
    "end": 3301.539,
    "text": "See you next time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3302.863,
    "end": 3303.385,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.846,
    "end": 3304.047,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3305.15,
    "end": 3305.391,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_00"
  }
]