[
  {
    "start": 3.068,
    "end": 5.152,
    "text": " All right, hello, welcome everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6.254,
    "end": 14.069,
    "text": "It's October 3rd, 23, and we're in Cohort 5 in our second discussion of Chapter 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 16.273,
    "end": 20.541,
    "text": "We'll jump over to the Cohort 5 questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.084,
    "end": 24.368,
    "text": "It's not too late to add more, just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.495,
    "end": 50.288,
    "text": " please feel free to copy in anything that you'd like us to explore but before we get to any of the questions is there just any kind of top of mind piece about chapter one or some specific passage or some figure or something that anybody wants to share about chapter one before we jump into the question specifically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.23,
    "end": 76.414,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.434,
    "end": 76.694,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 78.738,
    "end": 79.86,
    "text": "Let's go into the questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.88,
    "end": 82.925,
    "text": "We'll just go through them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.965,
    "end": 89.697,
    "text": "And again, you can continue to add more or upvote them as we continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 94.285,
    "end": 96.489,
    "text": "Question about modeling as action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.79,
    "end": 98.753,
    "text": "It seems that modeling...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.053,
    "end": 106.343,
    "text": " is still abstract and based on observing and making effort to understand dynamics, dimensions, behaviors of given systems, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 106.363,
    "end": 116.417,
    "text": "modeling still seems theoretical, possibly distinct from applying models and interacting with systems in the wild.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.12,
    "end": 120.323,
    "text": "Of course, observing and documenting are also actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.383,
    "end": 127.052,
    "text": "However, the systems and behaviors being observed would be the primary actors expressing a rich, complex range of acting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.319,
    "end": 131.724,
    "text": " In Cohort 4, Chapter 1 discussion arose a question about observing versus acting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.845,
    "end": 135.849,
    "text": "I guess it's well documented they are inextricably intertwined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.017,
    "end": 144.44,
    "text": "What are anyone's thoughts on this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.232,
    "end": 155.233,
    "text": "For me,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 156.361,
    "end": 173.949,
    "text": " The perception action loop seems to be more in line with how we're making policy decisions and not necessarily at this point about how we're mapping, how we're moving.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 175.531,
    "end": 178.015,
    "text": "And so I don't know if that's not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 179.075,
    "end": 198.536,
    "text": " Yeah, if we can kind of avoid conflating those two, just to get the gist of where we're at in the book, for me, seems to be cogent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 200.978,
    "end": 201.339,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.24,
    "end": 202.36,
    "text": "Jesse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.38,
    "end": 202.72,
    "text": "Jesse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 208.117,
    "end": 209.8,
    "text": " I'm still on the phone for, like, the last day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.704,
    "end": 221.663,
    "text": "Yeah, that reminds me of, like, Maxwell's Demon, you know, in a certain respect, where even through making those choices, you know, it's an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.104,
    "end": 228.537,
    "text": "So even the generating of the model and making that decision, it's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.557,
    "end": 228.657,
    "text": "Yeah."
  },
  {
    "start": 231.083,
    "end": 252.602,
    "text": " that's also very um interesting point um it seems like the the questioner recognizes that um making a model is something that a person can do like a researcher or scientist may do it so if you're thinking from the perspective of the modeler of course modeling is an action um applying a model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 254.0,
    "end": 258.444,
    "text": " that could be both abstracted and still an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 258.484,
    "end": 266.052,
    "text": "I mean, you could abstract away from the rat in the tea maze, like an example that we'll come back to, or a frog jumping out of the hands, which we'll come back to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.112,
    "end": 271.217,
    "text": "You can abstract that situation and model it, and then you could apply that model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.857,
    "end": 283.028,
    "text": "But once you're in the map, as opposed to the territory, then there might be things that the territory could do, like the rat could jump out of the maze, but your model might not reflect that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.008,
    "end": 303.531,
    "text": " um and this is also a very rich question about observing versus acting we can revisit but action is not just overt gross bodily movement action is conceived of very broadly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 303.764,
    "end": 328.995,
    "text": " uh in arbitrary spaces and so there's several ways that even in a situation that might be seen as a passive a passive observational setting there are several ways which action comes into play so visually isocating is a situation that's been modeled a lot in active inference so looking through a visual scene",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.296,
    "end": 337.987,
    "text": " There is still an active policy selection ongoing about where the eyes move, but that's still bodily in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 338.007,
    "end": 350.562,
    "text": "But even more cognitively, perception is augmented by attention, and attention in active inference is modeled by an internal policy decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.677,
    "end": 378.675,
    "text": " kind of like where to shine the internal spotlight or how diffuse or how focused to shine the attention spotlight that's modeled as an internal or covert policy so there's definitely a lot of ways in which action and perception intertwine through the loop and otherwise and um this is ironically or not a theoretical question about modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.55,
    "end": 380.852,
    "text": " being theoretical or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.813,
    "end": 399.698,
    "text": "Whereas once somebody puts something on paper and gets into the process of iterated modeling, then it just becomes resolved in the actual what it is that they're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.718,
    "end": 407.008,
    "text": "And once you put the model on a piece of paper or computer, it still may be theoretical, but it is also embodied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.655,
    "end": 423.073,
    "text": " so just to clear to clarify something restraint would be considered an action is that correct restraint not taking action choosing to not take action",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 423.863,
    "end": 448.622,
    "text": " that's a that's a great question there are several um ways in which uh timing your take is modeled often uh kind of like a null action is provided as an affordance so the rat is in the teammates they can go up down left right or stay and then through time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.547,
    "end": 451.269,
    "text": " it might select staying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.929,
    "end": 455.633,
    "text": "So it's like selecting an action, but it's kind of like a null action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.834,
    "end": 470.507,
    "text": "So in one conversational sense, you could say it didn't do anything, but because the model must update every time step, you have to provide an affordance that does nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 472.71,
    "end": 475.512,
    "text": "So the selection is the action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 476.033,
    "end": 476.213,
    "text": "Go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 477.897,
    "end": 489.514,
    "text": " David Manning, doesn't a no action really make more sense there's there's two ways that no action can be it's not it's either not modeled or it's intentionally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 490.295,
    "end": 495.622,
    "text": "David Manning, masked and so once you get into nested miles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 496.924,
    "end": 502.011,
    "text": "David Manning, No action makes more sense as an intentional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 503.293,
    "end": 504.495,
    "text": "David Manning, negation of action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 508.981,
    "end": 511.725,
    "text": " So where would indecision lie?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 511.745,
    "end": 516.911,
    "text": "Or would that just be, you know, how would you frame indecision in that context?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 520.416,
    "end": 525.582,
    "text": "Okay, so first to the, let's say we're writing out a number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 526.083,
    "end": 529.007,
    "text": "So this is our action space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 529.768,
    "end": 532.171,
    "text": "Writing out a number that's, you know, we're writing out our favorite number.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.291,
    "end": 536.136,
    "text": "We expect to prefer it to be, you know, this number that we love.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.2,
    "end": 540.687,
    "text": " And this could be modeled as a single level model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.729,
    "end": 544.873,
    "text": "So then the affordances would be all the numbers that you could write down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.735,
    "end": 551.784,
    "text": "Or it could be like a nested model where we're going to write down like the hundreds place and then the tens place and the ones place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.345,
    "end": 559.356,
    "text": "And so like all the decisions you can make about the ones place are nested within the tens place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.336,
    "end": 586.795,
    "text": " um so that's that's the kind of nested architectures or you could make it a single layer model to um reference andrew's point indecision and then let's just say we include we have one model where you can write down zero through nine those are so every click of the model it must decide zero through nine another model you could say zero through nine or pause",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 587.753,
    "end": 602.033,
    "text": " And so that model, depending on how the parameters are set, so essentially how the cognitive diversity is in that moment, maybe one agent just waits, waits, waits, waits, waits, waits, waits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.654,
    "end": 606.339,
    "text": "Another agent writes down a three in the hundreds place and then waits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.123,
    "end": 615.212,
    "text": "Indecision, you could kind of unpack that in a few different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 615.884,
    "end": 620.929,
    "text": " One agent might have very high precision that they know that they want to wait.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.97,
    "end": 630.618,
    "text": "So that would be indecisive in a way about what number it would be, but they would be highly precise about what policy they wanted to engage in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.979,
    "end": 644.271,
    "text": "Another flavor of indecisiveness would be if the different options, different affordances were kind of equally or similarly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.652,
    "end": 674.224,
    "text": " salient so that kind of indecisiveness is like there's multiple options and i'm not sure which one to pick but these are all these are great comments and and it just shows how even um behavioral settings that are like almost too simple to to believe like just writing down a single digit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.048,
    "end": 689.698,
    "text": " They give us a handle into different cognitive phenomena, memory, attention, preference, decisiveness, all these different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.231,
    "end": 709.358,
    "text": " So that's why simple toy examples are used in the textbook because even very simple behavioral settings can give clear, it's like a example in a grammar book,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.992,
    "end": 739.193,
    "text": " to just exhibit sentence structure these are like simple sentences of cognitive well-formed settings that help us practice fluency in the active ontology Francis I was thinking about the uh way that actions and observing are not actually different and I think for me one of the differences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.73,
    "end": 749.023,
    "text": " between indecision and inaction is inaction is kind of intentional, maybe I'm waiting to learn something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.744,
    "end": 763.062,
    "text": "But when I'm truly stuck, and this does happen to me, indecision, I feel almost like I'm not actually perceiving anything either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.863,
    "end": 769.551,
    "text": "I just, I'm in distraction mode, I'm not actually picking up anything that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.02,
    "end": 799.487,
    "text": " going to move me forward um yeah very interesting that's a um almost a uh analytical auto ethnography or analytical auto phenomenology like entering in at our own experience and then digging or trying to investigate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.48,
    "end": 820.851,
    "text": " like starting with what is it like to dot dot dot yes yeah and then like but what is it like to that's a very high level cognitive phenomena like a pendulum or um a simulated entity we don't need to appeal to it having like a higher order self-concept",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.472,
    "end": 827.119,
    "text": " So that's the double edge of entering in at the level of our own experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.84,
    "end": 832.065,
    "text": "On one hand, what else could be more tangible and immersive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.686,
    "end": 845.522,
    "text": "On the other hand, the kind of phenomena that we might be dealing with are not necessarily like the basal or the atomic or the essential phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 846.413,
    "end": 862.247,
    "text": " But that's the fun is to then explore how could we compose what it's like at a higher level from, and there doesn't need to be only one account and certainly not early in that research question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.887,
    "end": 867.071,
    "text": "So then just thinking divergently and building up different ways that it could be modeled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.152,
    "end": 875.678,
    "text": "Understanding modeling as action, like scientific modeling as real action in the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 875.742,
    "end": 905.631,
    "text": " also it it just it opens many doors it just helps see um scientific pluralism in a new light like models are proposed maps of territories so building different maps comparing different maps that's model selection model comparison cool boxes aphorism uh all our models are wrong but some of them are useful exactly never been more true Christoph",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.99,
    "end": 914.5,
    "text": " Rafal Dittwald, It was just kind of kind of wondering like if action in the sort of active infant setting can be really understood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 915.021,
    "end": 919.428,
    "text": "Rafal Dittwald, Much more technically in the sort of you know, thinking about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 919.849,
    "end": 923.254,
    "text": "Rafal Dittwald, In a sort of more like a graphical way in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.895,
    "end": 934.251,
    "text": "Rafal Dittwald, There was some there was some sort of state machine that you know represent representation of the internal states of an agent and whenever there was any kind of transition in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 935.311,
    "end": 937.261,
    "text": " That's essentially an action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.925,
    "end": 938.809,
    "text": "Something is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 939.312,
    "end": 941.845,
    "text": "And what is the meaning of the action is completely arbitrary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 942.348,
    "end": 949.056,
    "text": " we may, in our model, we may assign the meaning of that action to be some kind of mental transition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.857,
    "end": 952.32,
    "text": "It could be essentially, as we discussed, a null action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.641,
    "end": 957.387,
    "text": "I do believe that not doing anything is very different from doing nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 957.767,
    "end": 963.094,
    "text": "Doing nothing, it's a very active state, and it's not easy to be doing nothing consistently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 963.274,
    "end": 965.757,
    "text": "It requires a tremendous amount of practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 965.737,
    "end": 992.976,
    "text": " um so but it's up to us to effectively assign the meanings to this but from the perspective of the formalism that really is kind of just a just just a state transition and there's some sort of you know uh effect that is being emitted by by the model by doing the state transition that is some some something can be observed um from the perspective of someone looking at the other model as it's kind of running so when we're when we're updating the state",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.745,
    "end": 995.466,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.506,
    "end": 1003.899,
    "text": "Two ways in which we'll see action as a variable in a graphical model or in a state machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.919,
    "end": 1017.298,
    "text": "Here, in more of the particular partition representation style, action is just, as you said, the variable that's emitted by the cognitive entity of interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.699,
    "end": 1020.263,
    "text": "So it's what goes back into just like perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1020.303,
    "end": 1024.549,
    "text": "It's not taking on some philosophical baggage of like being experienced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1024.529,
    "end": 1047.499,
    "text": " um it's just the incoming statistical dependencies and in that view action is the outgoing statistical dependencies and then what we'll come to in chapter um four is action um here symbolized with pi for policy action is just what possible um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.93,
    "end": 1054.616,
    "text": " affordance, what action selected intervenes how in the causal process of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1055.837,
    "end": 1064.666,
    "text": "So yes, it ends up being operationalized with a variable in a model once it comes to this stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.509,
    "end": 1071.933,
    "text": "You can also generalize learning as action, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1071.953,
    "end": 1077.739,
    "text": "So you can say action is extrinsically oriented or intrinsically oriented.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1082.427,
    "end": 1108.215,
    "text": " learning as as action like um i just searched for sam beth smith because um yes various mental or cognitive processes have been slash can be understood as action like if you have some belief distribution you could understand that movement as being a movement in a space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.533,
    "end": 1110.817,
    "text": " And so hence an action in a space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.858,
    "end": 1120.052,
    "text": "And Chris Fields and Mike Levin have talked about intelligence as competence in navigating arbitrary state spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.635,
    "end": 1125.481,
    "text": "And so none of that requires overt bodily action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.982,
    "end": 1128.606,
    "text": "That's not the only kind of action being discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1128.626,
    "end": 1132.853,
    "text": "And then once you open up the door to thinking about internal action,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.221,
    "end": 1142.498,
    "text": " using control theory, then that's been applied to attention that's been applied to learning as action and other cognitive phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.563,
    "end": 1145.844,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.284,
    "end": 1146.825,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.845,
    "end": 1147.667,
    "text": "Great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.55,
    "end": 1152.175,
    "text": "Um, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.019,
    "end": 1161.647,
    "text": " about our discussion on variational free energy as lower bound of a posterior distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1162.489,
    "end": 1166.194,
    "text": "I found a good primer of ways of deriving evidence lower bound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.415,
    "end": 1176.91,
    "text": "ELBO is how some in the Bayesian statistics and statistical physics world, that's another like synonym for variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.773,
    "end": 1184.642,
    "text": "If anyone with a stronger computational bound would be willing to walk less proficient of us through the guide, it'd be greatly appreciated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.01,
    "end": 1185.952,
    "text": " I'll post a link in the notes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.152,
    "end": 1188.818,
    "text": "If anyone is interested in learning it, comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.581,
    "end": 1192.485,
    "text": "I also posted in math learning group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.026,
    "end": 1197.335,
    "text": "Math learning group is just kind of... It's another math learning space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.076,
    "end": 1199.84,
    "text": "People can read through it and peruse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1199.86,
    "end": 1201.082,
    "text": "There's no side group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.804,
    "end": 1204.128,
    "text": "There's also currently no other meeting time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1204.89,
    "end": 1205.972,
    "text": "But...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.952,
    "end": 1230.154,
    "text": " in some past times people on the more uh basic or fundamental math learning side of the picture or more on the like rigor and their improving side they've wanted to kind of specifically focus on the math so um perhaps comments on that question or or um you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.91,
    "end": 1260.917,
    "text": " write more here or write a comment or anything if you want to explore that more but looks good and we'll come to some of these like mathematical technical things like they will come up in the coming chapters but it's great that that someone's thinking also ahead about this in chapter one cool well um if anybody has more questions they can just paste them",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1262.028,
    "end": 1281.7,
    "text": " in this cohort five section, we can look to the overall questions on chapter one and kind of look at some of the most upvoted questions and just kind of review these questions that have been posed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.72,
    "end": 1288.491,
    "text": "Some of them are totally core great points, or someone can just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.517,
    "end": 1296.085,
    "text": " raise their hand and please feel free to just add any point or ask any question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.145,
    "end": 1297.146,
    "text": "Andrew, and then anyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1298.167,
    "end": 1303.093,
    "text": "Yeah, I just thought of a question I can add it to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1303.493,
    "end": 1316.588,
    "text": "One thing I'm curious about the whole active inference paradigm and its associated concepts, Bayesian mechanics and whatnot is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1316.838,
    "end": 1340.112,
    "text": " whether there's a good idea of what's really state of the art and sort of loosely held beliefs versus things that are really cementing and propagating as like pretty darn sure this is the way we should think about various phenomena.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1342.842,
    "end": 1349.991,
    "text": " So what are the loosely held beliefs in this space versus the strongly held ones?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1350.011,
    "end": 1350.292,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.672,
    "end": 1351.353,
    "text": "Great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.373,
    "end": 1356.339,
    "text": "There's a lot to say on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.58,
    "end": 1364.53,
    "text": "And I hope as through time, we'll continue to develop better answers to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.902,
    "end": 1377.113,
    "text": " I'm thinking of how to reflect what has been happening very rapidly in the last few years to address your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1377.433,
    "end": 1380.898,
    "text": "I'll just give kind of one historical note just to kind of plant the seed there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.64,
    "end": 1395.495,
    "text": "Carl Friston and colleagues in the late 1900s working on neuroimaging and fMRI in the neuroimaging unit at UCL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.475,
    "end": 1400.067,
    "text": " And so that's the development of the statistical parametric mapping or SPM toolkit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.568,
    "end": 1404.518,
    "text": "And so that's the most widely used neuroimaging sensor fusion toolkit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.598,
    "end": 1407.566,
    "text": "That's what made Carl Frist and most cited neuroscientists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.227,
    "end": 1410.092,
    "text": "At the beginning of the 2000s,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1411.152,
    "end": 1424.685,
    "text": " Carl Friston and colleagues begins developing what was the free energy principle, which was this idea that there could be a unified imperative or a unified principle for all that cognitive systems do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.265,
    "end": 1427.327,
    "text": "Unified imperative for perception and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.108,
    "end": 1439.218,
    "text": "And in some papers between 2006 to around 2012, there were a lot of initial forays",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.363,
    "end": 1460.7,
    "text": " as far as i understand there's no major branch that was like totally repudiated however there were different equations where you know a tilde had to be unpacked or a term had to be added um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.895,
    "end": 1480.798,
    "text": " between around the the 2010 to 2020 decade there were increased applications which provided a different kind of support or belief confirmation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1481.133,
    "end": 1490.928,
    "text": " which is to say it wasn't just about the analytical formalisms, like transforming well between each other, but also brought in like a level of explaining and predicting empirical data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.929,
    "end": 1495.775,
    "text": "And for example, the work of Ryan Smith in computational psychiatry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1496.737,
    "end": 1508.895,
    "text": "And during that decade, also there was a cohort of graduate students and other researchers like Maxwell Ramstad, Axel Constant et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.875,
    "end": 1531.356,
    "text": " who were beginning to say well free energy principle for the brain which was like Carl Friston's very well cited 2010 paper it's like well it's not just about the brain we can expand this to think about like ecosystems and and so that kind of brought in like this multi-scale modeling angle",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.336,
    "end": 1546.645,
    "text": " And then over the last few years, much of which you can find reflected in the live streams, some of the specific angles that connected to physics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1547.148,
    "end": 1555.021,
    "text": " which is now known as Bayesian mechanics, but Bayesian mechanics was not a term used in this way several years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.942,
    "end": 1574.252,
    "text": "But Bayesian mechanics brought in a new level of rigor and grounding, and it recontextualized some of those formalisms that had been proposed going back to 2006 and everything,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.295,
    "end": 1600.392,
    "text": " it recast those in terms of the generalization direction in physics and put Bayesian mechanics as a mechanics, but not a reductionistic or material accounts, but a mechanics of Bayesian systems and put that alongside",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.333,
    "end": 1605.018,
    "text": " Newtonian mechanics, thermoinformational and quantum mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.399,
    "end": 1613.388,
    "text": "Livestream 49 with Dalton Sokdividevel has some of that discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.249,
    "end": 1621.859,
    "text": "And on the quantum side, Livestream 40 series with Chris Fields and also Chris Fields' ongoing physics course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.04,
    "end": 1631.07,
    "text": "Those represent some of the most ongoing developments in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.219,
    "end": 1660.872,
    "text": " re-understanding free energy principle as principle active inference as implementation approach and then Bayesian mechanics as how that happens and again that didn't necessarily repudiate earlier work it helped understand its um scope though",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.497,
    "end": 1687.939,
    "text": " then in more targeted areas people occasionally do write sort of review pieces which we can talk about but um you know the state of the field is is in some ways what people say here and in the literature that's assembled",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.328,
    "end": 1708.392,
    "text": " Yeah, so to synthesize what you're saying, essentially the newer research is reconceptualizing and clarifying earlier stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1708.54,
    "end": 1725.621,
    "text": " um and so so helping put it on more solid epistemic foundations so so really the new stuff is pretty uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1726.529,
    "end": 1728.592,
    "text": " there's a lot of truth behind it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1728.712,
    "end": 1746.681,
    "text": "It's not sort of tentative exploration in terms of like the Bayesian mechanics seems to really be getting a foothold in the physics world rather than being sort of tentative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1749.293,
    "end": 1775.487,
    "text": " I I would agree with that I think that's that's for each person to evaluate I'll just point to this 2010 for the the 2010 first in paper that I um mentioned there this is like a very provocative early positioning with like the free energy principle and then understanding how out of the free energy principle potentially various special case cognitive phenomena",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.07,
    "end": 1795.652,
    "text": " but still vast and broad phenomena like model selection and evolution could be described um as a special case of free energy principle um in the setting of the action perception Loop now there's been subsequent developments on like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1796.493,
    "end": 1814.873,
    "text": " what do we mean by the action perception Loop um what about the arrow that can that can plausibly connect you know across the blanket like so some details have been coming into better focus but but but also it's only been like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.912,
    "end": 1839.055,
    "text": " months to low numbers of years that tends to potentially only small orders of magnitude more numbers of people have even been able to reckon with the quantum formalism or basic mechanics or g theory so ongoing Susan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1843.27,
    "end": 1862.95,
    "text": " To follow up on Andrew's question, yeah, I'll start with reading kind of the summary of Chapter 2, which I thought we were going to be going over Chapter 2, but it offers kind of a generalized summary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1862.93,
    "end": 1886.136,
    "text": " theory of active inference is a theory of how living artifacts and i you know i i kind of put their organisms underwrite their existence by minimizing surprise variational free energy via perception and action and what i take away um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1887.685,
    "end": 1901.847,
    "text": " from the more I read about it, which I like, because so much of psychology tends to be, and decision management, it tends to be prescriptive, but taken out of context",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1902.012,
    "end": 1928.982,
    "text": " it's more wrong than right so what i kind of like about the um what i'm reading is that it's not trying to be prescriptive it's trying to give us a framework to uh to explore how individuals can build models and how we can build models that are more closely resembles reality",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1930.177,
    "end": 1932.019,
    "text": " So for what that's worth.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1934.682,
    "end": 1936.425,
    "text": "That's a great point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.025,
    "end": 1937.886,
    "text": "Thank you, Ramor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1938.067,
    "end": 1944.554,
    "text": "I love this historical element, and I'll just point to one more kind of piece of recent history.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.255,
    "end": 1955.728,
    "text": "In 2019, Carl Friston wrote this long monograph, A Free Energy Principle for a Particular Physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.995,
    "end": 1960.461,
    "text": " Particular is a little bit of a pun, double entendre.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.343,
    "end": 1962.725,
    "text": "It's a specific physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.825,
    "end": 1965.068,
    "text": "If you want to make a different physics, you can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1965.969,
    "end": 1967.892,
    "text": "There's Newtonian physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.912,
    "end": 1969.194,
    "text": "There's relativistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.214,
    "end": 1971.037,
    "text": "There's all these different physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1971.057,
    "end": 1972.999,
    "text": "And so this is just one specific physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.019,
    "end": 1978.107,
    "text": "So if you have some qualm with it, you can version and modify it, or you can develop a different physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.148,
    "end": 1983.354,
    "text": "But also, it's not just a specific physics or a peculiar one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.394,
    "end": 1985.277,
    "text": "It's about physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1985.645,
    "end": 1995.435,
    "text": " a particle it's about the cognitive particle or just like the generalized particle and so it was this paper in 2019",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.5,
    "end": 2022.756,
    "text": " that really signaled an inflection point with like we're going to be talking about the particle which is like the blanket and the internal States that's going to be like figure and it's going to be partitioned off from ground or the niche or the environment so it's like if that partition can't be made between the system of interest blanket and internal States the particular States here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.845,
    "end": 2031.984,
    "text": " If that can't be partitioned off from the niche, you don't have a noun or a thing to point at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.107,
    "end": 2039.665,
    "text": "That's almost tautological, but if you can make a distinction, there's a difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2040.252,
    "end": 2068.116,
    "text": " so that's a thing and that's going to be the particular states and then there's some some sub partitioning of of certain um pieces that we might call our attention to or develop formalisms around but it was in 2019 and then it was a reading group with maxwell and others that had that brought a relatively lot of attention to um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.349,
    "end": 2090.678,
    "text": " the physics here and then that um that was kind of incubated in the 2019 era led to dalton and others really um strengthening the physics side and connections christoph",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.932,
    "end": 2099.259,
    "text": " I think there's an interesting development happening right now in that space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.279,
    "end": 2106.79,
    "text": "You mentioned that if you can't draw a boundary around the thing, if you can't make a blanket, then you don't really have a thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2106.99,
    "end": 2115.302,
    "text": "And I think it's some work that is yet to be published that Maxwell Ramstad mentioned a couple of times on various podcasts recently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.342,
    "end": 2117.104,
    "text": "They're formalizing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2117.084,
    "end": 2128.815,
    "text": " the notion of essentially a fuzzy blanket where there is some kind of like index into the blanket, that blanket-ness of the blanket, like how fuzzy it really is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.855,
    "end": 2144.931,
    "text": "And, you know, my prediction is that it's going to turn out to be something along the lines of that the distinction is always somewhat arbitrary, that at a certain scale, you have a thing and a certain scale, there is no thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.198,
    "end": 2154.538,
    "text": " you know, almost like the Buddhist concept of no self is going to show up in the mathematics of it, that depending how we look at the system, the internal states really are a thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2154.618,
    "end": 2162.575,
    "text": "And from a certain perspective and from a different perspective, that thing just simply disappears if you're still really looking for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2163.056,
    "end": 2166.042,
    "text": "It's like when you start to look for the boundary of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.022,
    "end": 2187.912,
    "text": " um I don't know a cell you're gonna find that that boundary is becoming fuzzier and fuzzier the closer you look right uh the the more jagged and fractal and and harder to define what exactly is the internal states from from the from from the external state so um it's a it's an interesting it's very interesting to see how that stuff developed you know like when in in the beginning I think the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2187.892,
    "end": 2190.095,
    "text": " There were a lot of ideas how to draw the boundary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.576,
    "end": 2199.287,
    "text": "It was just kind of like a hard boundary that you have to have this distinction that has to be very strong between the internal states and external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2199.988,
    "end": 2202.772,
    "text": "And now it's slowly dissolving as the mathematics develops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2203.233,
    "end": 2208.82,
    "text": "And I think this reflects the fact that mathematics is ultimately an intuitive discipline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2208.8,
    "end": 2230.167,
    "text": " um you know this principle the principle is true and you can you can sort of see it for yourself but actually properly formalizing that mathematically in such a way that it's actually airtight in all cases that always takes a long long time you know calculus was full of holes for i don't know like a long time like probably until uh um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.94,
    "end": 2242.492,
    "text": " uh, until, um, Whitehead and, uh, what's the, I forget the, I forget the other guy, uh, Principia Mathematica came along and started formalizing things and so on and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.772,
    "end": 2248.798,
    "text": "And I think the same process kind of has, has been happening in the, um, in, in the free energy principle space as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2249.258,
    "end": 2256.846,
    "text": "That a lot of these ideas started, started off a little bit, um, you know, based on certain mathematical assumptions that now have been revised, like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.826,
    "end": 2267.362,
    "text": " Ergodicity used to be somewhere there, and I think now they reformulated some of the ideas without it, and it's becoming much more airtight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2267.864,
    "end": 2269.57,
    "text": "And that's just a natural progression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.018,
    "end": 2271.619,
    "text": " Great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.659,
    "end": 2272.54,
    "text": "Thank you, Christoph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.56,
    "end": 2274.443,
    "text": "Yeah, just a few piece on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.644,
    "end": 2288.967,
    "text": "Here's a 2022 paper, perhaps not the only or the total work, but the blanket index was proposed, which is kind of like a zero to one continuum about like fuzzy or dynamical or wandering blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.527,
    "end": 2298.662,
    "text": "But being able to recognize from empirical data and not have the particular partition be in a priori.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.642,
    "end": 2308.203,
    "text": " that then dictates the subsequent analysis, but enable the discovery of things to be part of the analysis process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.283,
    "end": 2308.964,
    "text": "Those are great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.084,
    "end": 2318.625,
    "text": "And then also, especially with Chris Fields' work on the quantum information sciences and Mike Levin's work on polycomputing,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.875,
    "end": 2326.942,
    "text": " there is also the increased focus on the observer playing a fundamental role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.523,
    "end": 2332.587,
    "text": "You can't take a view from nowhere on what computation or what cognition something is performing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.087,
    "end": 2335.389,
    "text": "If it's encrypted to you, it's going to look like noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2335.97,
    "end": 2337.811,
    "text": "If it's not encrypted, you might understand what it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.872,
    "end": 2347.6,
    "text": "And then exactly like what you said about the spatial and temporal scale, if your timescale is 100 years, then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.913,
    "end": 2355.626,
    "text": " an E. coli lives and dies as a statistical noise, and you would not be able to perceive that as a thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2356.147,
    "end": 2362.881,
    "text": "Whereas if it was a picoseconds time interval, you wouldn't perceive action occurring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.763,
    "end": 2369.554,
    "text": "And so 100%, it's about zooming in and zooming out and finding salience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.534,
    "end": 2397.482,
    "text": " spatial and temporal scales of analysis which comes back to the modeling as action there's just no model without a modeler and there's no observed without the observer and and so some of these points are and and then you pointed to some more technical discussions on ergodicity and and requirements around that but these um um we're reading the first textbook of active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2397.614,
    "end": 2403.338,
    "text": " which realistically is not so much longer than for example, step-by-step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2404.094,
    "end": 2408.299,
    "text": " It is different, but this is not a massive textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.339,
    "end": 2413.526,
    "text": "However, what Sanjeev Namjoshi is doing is incredibly comprehensive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2414.287,
    "end": 2430.388,
    "text": "And may his textbook coming out within the coming 12 to 18 months or whatever it is, that will speak to this question in a way that the textbook that we're discussing here doesn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.622,
    "end": 2454.891,
    "text": " doesn't um lay it on so thick but um yeah these are these are epic discussions and and this is just like being in the game to even enter the slipstream to try to understand these and also like to understand where it's like okay eroticity just like all right it is that that is how it is and people are working on those questions um Susan",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.837,
    "end": 2471.896,
    "text": " Yeah, it's definitely upending a lot of economic and other affordable models that just don't suit the world anymore.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2472.617,
    "end": 2480.128,
    "text": "I'm curious to explore with what you mean, Christophe, am I saying that correctly?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2481.19,
    "end": 2484.675,
    "text": "Christophe, when you're talking about airtight,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2485.465,
    "end": 2491.572,
    "text": " So when you talk about airtight in mathematics, can you expand on that just a bit?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2493.574,
    "end": 2498.4,
    "text": "So let me give you an example for mathematics that's kind of vivid from my education.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2498.42,
    "end": 2505.788,
    "text": "The first time I encountered Fourier analysis, it's a beautiful piece of mathematics, but there's a problem with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.808,
    "end": 2511.675,
    "text": "It just does not converge at the ends of the intervals in a lot of really simple cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2511.655,
    "end": 2516.326,
    "text": " And it took quite a lot of work to actually make that work mathematically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.606,
    "end": 2529.175,
    "text": "You have to get into Schwarz's family of rapidly decreasing functions and generalize the notion of functions, the distributions, and so on and so forth, and bring",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2529.155,
    "end": 2548.108,
    "text": " Mateusz Piorkowski- Bringing that incredible mathematical rigor you can actually make for your transform airtight, so to speak, that you can finally really stop making the hand way the argument that Oh, you know, like I have this limit of some kind of Gaussian.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2548.088,
    "end": 2552.656,
    "text": " Um, Gaussian function that in the limit actually approaches the direct delta.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.157,
    "end": 2560.249,
    "text": "But there is a there's a precise way of defining that in terms of forces rapidly decreasing functions and so on so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.131,
    "end": 2563.735,
    "text": "Um, and then you actually get a formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.715,
    "end": 2586.803,
    "text": " for which you act you you get proper results all the time but it never really stopped anybody from making tremendous use of um Fourier transformers it was right like with these little holes which is new they were there and engineers would be aware of them and that that that never really stopped anybody uh it's it's validity you know the the validity of the idea was not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2586.783,
    "end": 2593.652,
    "text": " was not questioned just because there were certain cases in which it would break down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.573,
    "end": 2598.237,
    "text": "And especially that intuition behind these sort of limits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.257,
    "end": 2599.859,
    "text": "And calculus is another good example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2599.879,
    "end": 2612.335,
    "text": "I think, you know, Russell and Whitehead, they got to formalizing mathematics precisely because they were worried about this, you know, this notion of a limit in calculus, if I remember my history correctly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2612.315,
    "end": 2637.411,
    "text": " um what what do you mean when you know something is this this um something tends to be it tends tends to become infinitely small what what does it actually mean precisely like it it's always been kind of like a hundred way argument um but it never stopped mathematics from just working right like there is a there is a certain um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2638.488,
    "end": 2646.253,
    "text": " Anatoliy Gruzd, Geometry to it that you can just simply see and symbolically in some sense non constructive mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2646.503,
    "end": 2672.072,
    "text": " is is always like that unless you have a completely constructive system computational system effectively and you derive something from from an axiomatic foundation then your your mathematics is is is quite likely going to be full of full of some holes and you can you can get in some really interesting philosophical arguments like why is it even possible that we can do something like that to without having this precise computation to jump over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.052,
    "end": 2677.898,
    "text": " the threshold and say like, well, you know, I kind of I have this intuition that this is actually going to work out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2678.318,
    "end": 2678.819,
    "text": "And it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.499,
    "end": 2681.141,
    "text": "And it's a it's a fascinating question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2681.361,
    "end": 2695.795,
    "text": "But that's I think this is the kind of process that we're what we're seeing is this kind of thing where we started off with intuitive ideas that came from a lot of experience of applying mathematics in this kind of setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2696.936,
    "end": 2697.857,
    "text": "Then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.837,
    "end": 2717.297,
    "text": " various attempts to formalize that using the mathematical tools that were available um at a time finding certain cases where these tools were insufficient and you know re-deriving this form this this formalism again and again until until it becomes um uh you know uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.83,
    "end": 2720.915,
    "text": " Again, like I'll use the same term or title.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.539,
    "end": 2724.223,
    "text": "I hope I hope that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.303,
    "end": 2724.764,
    "text": "Absolutely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2725.125,
    "end": 2733.885,
    "text": "Actually, I'm very sensitive to what Andrew brought up in terms of, you know, what is the underlying beliefs and I actually, you know, constantly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2733.865,
    "end": 2750.676,
    "text": " um I'm trying to understand ideologies because they're they're underneath beliefs and in fact one of the statements I wrote down from chapter two was which was you know an assumption was whether we adjust our beliefs or our data",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2750.656,
    "end": 2773.069,
    "text": " depends on the confidence with which we hold the beliefs i think that kind of speaks to what you're saying in terms of confidence levels um and um you know and and so you know when we kind of unpack the the surprise the variational surprise and consider that that is really about uncertainty",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2773.049,
    "end": 2787.511,
    "text": " if we can build that mathematical model that more accurately aligns with reality, then whether that be on an individual basis or a group basis or a nation basis, doesn't matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2787.611,
    "end": 2789.754,
    "text": "I mean, we're going to start getting better results.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2789.834,
    "end": 2797.105,
    "text": "So yeah, that's a great explanation of math, being a non-math person.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2797.386,
    "end": 2797.746,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2798.568,
    "end": 2799.529,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.965,
    "end": 2802.067,
    "text": " This was great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.147,
    "end": 2802.648,
    "text": "I love this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.668,
    "end": 2807.212,
    "text": "Like, like we might be able to have an intuition, like, okay, what if you take a Gaussian?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.252,
    "end": 2812.117,
    "text": "So like a, a bell curve distribution, you just make it sharper and sharper and sharper and sharper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2812.157,
    "end": 2815.0,
    "text": "It's like, can we just say that it's a spike?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.98,
    "end": 2822.987,
    "text": "It's like, well, maybe not necessarily, but in a given application that might work perfectly well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.147,
    "end": 2828.993,
    "text": "And then those like sort of intuition looking across the grand Canyon and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.715,
    "end": 2839.067,
    "text": " no could we jump across it could we build a bridge or is this like an incrossable gap those are the research questions um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2840.33,
    "end": 2867.181,
    "text": " adjusting our belief or the the data this is in reference to the two ways that free energy can be minimized so the two ways in which surprisal can be bounded which is change the world through action or change the mind through updating the cognitive model which might be considered learning or perception or attention depending on on which way so here's sensory data coming in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.228,
    "end": 2892.24,
    "text": " don't want to have our thumb on the sensory scale like that's kind of like a trivial and ultimately um less effective way to let's just say um weigh the amount that we want to weigh well yeah there's a trivial way to make that happen which is just change the number on the scale so we take the thumb off the scale sensory data we don't directly control",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2892.997,
    "end": 2903.326,
    "text": " What are the two ways that the particular state can then come to bound its surprise or minimize its surprise?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2903.927,
    "end": 2908.011,
    "text": "Change your mind, change the internal states, or change the world through action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.972,
    "end": 2913.976,
    "text": "Those are called the autonomous states, just the internal and the active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.257,
    "end": 2918.14,
    "text": "So that's an example of like a subset of the particular states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.66,
    "end": 2921.603,
    "text": "It's two out of the three particular states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.718,
    "end": 2927.787,
    "text": " But then we can talk about particular states to differentiate the thing from its niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.711,
    "end": 2931.002,
    "text": "So that's these three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.995,
    "end": 2955.235,
    "text": " then you might want to talk about just the blanket states just the two in the middle perception in action or you might want to talk about the autonomous states just action and internal states because those are the controllable ones in an optimal setting if you can control it to think and control it to do and then your actions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.468,
    "end": 2962.196,
    "text": " through the niche end up influencing your observations and hopefully lining them with your preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.256,
    "end": 2963.358,
    "text": "That's pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.207,
    "end": 2971.548,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.469,
    "end": 2974.111,
    "text": "And figure one and two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.151,
    "end": 2984.884,
    "text": "Figure one, one kind of grounds us in this fundamental agent world interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.185,
    "end": 2990.271,
    "text": " So this is even simpler than the four-fold partition that we see here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.291,
    "end": 2999.603,
    "text": "This is just kind of the two-fold partition, just figure from ground or like agent from niche, agent-based modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.325,
    "end": 3014.382,
    "text": "And then figure one, two lays out quite literally like the roadmap on how we're going to get to active inference in the coming chapters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.581,
    "end": 3017.545,
    "text": " The low road is a how question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.347,
    "end": 3025.798,
    "text": "It starts with Bayesian statistics, and it's going to work up towards Bayesian cognitive models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3026.579,
    "end": 3031.326,
    "text": "But Bayesian cognitive models could be of any kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.346,
    "end": 3041.501,
    "text": "You could interpret a program as a Bayesian cognitive model, or there's nothing about an arbitrarily constructed Bayesian model that makes it adaptive in the niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3042.222,
    "end": 3043.103,
    "text": "But that's the how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.893,
    "end": 3053.497,
    "text": " And then coming from the high road, which is chapter three, we have this persistence or repeated measurements imperative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.517,
    "end": 3055.843,
    "text": "Things that can't be repeatedly measured",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.427,
    "end": 3060.05,
    "text": " are going to be understood to be noise and not signal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3060.551,
    "end": 3063.434,
    "text": "They're just not persistent long enough to be measured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.195,
    "end": 3075.188,
    "text": "So as an observer, it isn't a thing in our data if it's changing at a timescale faster than our persistence can understand or slower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.25,
    "end": 3087.383,
    "text": "And then when that gets turned back on the agent itself, as long as you're re-measuring your body temperature to be in a homeostatic range, you're alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3087.548,
    "end": 3096.189,
    "text": " And so that's how the survival or self-organization or self-evidencing is understood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3096.229,
    "end": 3101.743,
    "text": "But this doesn't uniquely suggest a how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.96,
    "end": 3129.418,
    "text": " might be different ways to develop self-organized self-evidencing surprise minimizing markov blanketed systems but the roadmap of this textbook is that in chapter two we're going to learn about the how and about how bayesian statistics and updating can be used to develop models of perception action",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3130.647,
    "end": 3159.456,
    "text": " and then you know refresh how systems can be understood as embodying this principle of persistence because we're talking about systems that do exist even if they're only proposed to exist and then those two roads come together in active inference and then right in chapter four we're going to be talking about the generative models of active inference which use this how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3160.094,
    "end": 3187.688,
    "text": " for this why and there they are um yeah in the last minutes anyone have any other thoughts on one or about like where we're heading in the coming weeks i do have one question about um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.866,
    "end": 3192.814,
    "text": " kind of tying into my earlier comment on Bayesian mechanics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3194.016,
    "end": 3211.009,
    "text": "Do you have a feel of whether we touch on the connection mentioned in Bayesian mechanics between, I believe it's called entropy maximization as like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3211.495,
    "end": 3240.793,
    "text": " the external view and I think the textbook is mostly this sort of internal view but whether we touch on that other piece at all great comment so um the work of Dalton and Maxwell and others um in check out live stream 49 um or the guest stream with uh with Dalton let's see what number that was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3242.36,
    "end": 3245.444,
    "text": " GuestStream 23, Rebooting the Free Energy Principle Literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.765,
    "end": 3257.939,
    "text": "In this work, as you alluded to, it came to be understood and demonstrated that the free energy principle is like the view from the outside on persistence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3258.42,
    "end": 3266.41,
    "text": "And then the constrained maximum entropy principle, CMEP, is like the view from the observer perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.39,
    "end": 3284.753,
    "text": " which is like we should kind of be like maximally agnostic about what that thing is going to do but but no more agnostic than that and then um the view from the inside um is the free energy principle and they unpack this in this work um it's not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.015,
    "end": 3307.939,
    "text": " John Kane- heavily addressed in this textbook as it was more of a recently breaking and more technical point, but these discussions help connect FEP with CME P. John Kane- cool well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3309.505,
    "end": 3334.332,
    "text": " um people can make any final comments otherwise this was an awesome discussion on one and then in the coming two weeks we'll be heading into the low road with chapter two so in the last minutes does anyone have any other comments that they want to make just about heading out of chapter one or heading into chapter two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3336.083,
    "end": 3352.283,
    "text": " I have one, like there's something interesting that I ran into recently that I think to me it's very much related to active inference, but it's a bit of a sort of wide, I suppose, relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3352.464,
    "end": 3358.031,
    "text": "I recently ran into a bunch of interesting literature on the subject of insight meditation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3358.751,
    "end": 3363.998,
    "text": "So essentially Buddhist traditions from the Theravada tradition or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3364.282,
    "end": 3369.469,
    "text": " more recent stuff like Mahasi Sayadaw's Manual of Insight and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3370.11,
    "end": 3391.057,
    "text": "And ultimately, everything that Gautama Buddha was trying to teach people and all these meditation teachers that came after him are trying to teach is effectively a method for building a generative model of the mind from the inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3391.798,
    "end": 3393.36,
    "text": "And it's extraordinarily simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.745,
    "end": 3401.917,
    "text": " It really is about paying attention to what's happening in the mind and then having a vocabulary to label what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3402.437,
    "end": 3416.918,
    "text": "I am thinking, I am intending, I am looking, I am moving, I am feeling this, I am thirsty, I am cold, I am feeling pressure or pain or pleasure and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3416.898,
    "end": 3432.031,
    "text": " And the entire system is based around literally noticing that this is what's happening and constructing ever more sophisticated models of what's actually happening with the mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3432.912,
    "end": 3440.838,
    "text": "And interestingly, the only thing that there is for a person to do to acquire all these skills is just observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3441.499,
    "end": 3446.263,
    "text": "Because the basic premise is that there is nothing you can do to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3447.475,
    "end": 3448.957,
    "text": " make your mind do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3449.697,
    "end": 3459.489,
    "text": "It will do things on its own and all you can do is to kind of notice that this is what has happened and then hold an intention that this is what you would like to happen more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.69,
    "end": 3474.565,
    "text": "And if you hold that intention and you sort of project positive energy towards the outcomes you want, over time this reinforces the occurrence of these events more often.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.606,
    "end": 3475.947,
    "text": "So you become more mindful,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.927,
    "end": 3483.841,
    "text": " the mental states that you want to cultivate increase, the mental states that are unwholesome diminish, and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3484.301,
    "end": 3497.985,
    "text": "But it's really fascinating if you start thinking about this in terms of literally constructing a generative model that I have a model of what my mind might be doing, and in every moment of perception when something is happening, it hits the model and I can see like, oh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3497.965,
    "end": 3518.742,
    "text": " these are you know of all this of all these internal of all these states that I have mapped out this is um this is this is what's happening here so this relationship between you know the mathematical theory and something that you can actually phenomenologically investigate by yourself by you know just sitting quietly and and looking at what your mind is doing is is really fascinating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.97,
    "end": 3520.391,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.054,
    "end": 3523.883,
    "text": "We're at the end of our time, so I will close it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.963,
    "end": 3525.027,
    "text": "But awesome discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.308,
    "end": 3529.061,
    "text": "Thank you, Cohort 5, and looking forward to seeing you in the coming weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.081,
    "end": 3531.328,
    "text": "And please add questions, add writings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.569,
    "end": 3537.369,
    "text": "If this sparks something in you, just add questions and insights, and we will go from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3537.549,
    "end": 3539.134,
    "text": "So thank you and farewell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3539.777,
    "end": 3540.318,
    "text": "See you, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.519,
    "end": 3541.101,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]