[
  {
    "start": 5.017,
    "end": 9.503,
    "text": " Welcome back everybody to the sixth episode of Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.244,
    "end": 13.548,
    "text": "I am back today with another fantastic guest, Adam Saffron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.329,
    "end": 19.316,
    "text": "Adam is a postdoctoral research fellow at Johns Hopkins Center for Psychedelic and Consciousness Research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.037,
    "end": 28.523,
    "text": " With deep roots in the active inference framework, Adam's work has explored the nature of preferences and motivation, mindfulness, consciousness, agency, and psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.103,
    "end": 34.406,
    "text": "In addition to this, he might well be our only guest thus far who has written a paper titled What is Orgasm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.907,
    "end": 37.348,
    "text": "And deadlifted 280 kilos for multiple reps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.389,
    "end": 39.99,
    "text": "In sandals, might I add.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.911,
    "end": 44.073,
    "text": "Note, by the way, that these two domains need not be related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.813,
    "end": 47.795,
    "text": "Adam, thank you so much for joining me and welcome to the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.747,
    "end": 50.588,
    "text": " So good to see you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.208,
    "end": 52.57,
    "text": "And I'm really glad you could join us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.61,
    "end": 59.977,
    "text": "And as I said, I mean, I'm always blown away by the diversity of interests and research topics that our guests bring to the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.457,
    "end": 63.68,
    "text": "So it'd be great because I think we're going to have a wealth of things to cover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.441,
    "end": 65.642,
    "text": "The first thing I wanted to ask",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.454,
    "end": 67.814,
    "text": " is about the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.495,
    "end": 81.317,
    "text": "You write in one of your papers, bodies represent near ideal initial systems for learning and inference with this prototypical object and causal system providing basis for further modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.177,
    "end": 86.878,
    "text": "I wanted to ask, was I being interested in what Jacob Howie called the evidential boundary?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.418,
    "end": 93.96,
    "text": "Where can we kind of circle off the internal and the external with respect to Markov blankets and active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.58,
    "end": 99.322,
    "text": " So I wanted to get your take on whether you thought that, what do you think of the body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.482,
    "end": 110.126,
    "text": "Is it a prior that we could say the mind, the cognitive system, it's incorporating in its sort of predictive schema?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.546,
    "end": 117.169,
    "text": "Or is it itself an object of inference that the mind, you know, conducts probabilistic reasoning over?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.536,
    "end": 121.836,
    "text": " Yes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.237,
    "end": 129.783,
    "text": "To which one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.164,
    "end": 139.531,
    "text": "In that particular paper, I'm trying to provide a count of basically how core knowledge gets loaded into mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.232,
    "end": 146.357,
    "text": "We need something like core knowledge, but what's a biologically plausible account of how we might arrive at it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.897,
    "end": 166.613,
    "text": " And so then the idea is you're basically using the body as basically a way of structuring learning curricula to make them tractable for a computationally bound system with limited learning opportunities, like making the most with the least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.173,
    "end": 177.018,
    "text": " And the idea is you create basically the body acts as a near ideal training wheel system to figure out where the conditions for inference are fruitfully constrained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.718,
    "end": 181.24,
    "text": "And then you can use that in the structural learning process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.8,
    "end": 182.12,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.701,
    "end": 189.284,
    "text": "And so you can think of it as, so the body would be both in a way an evolutionary prior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.924,
    "end": 207.167,
    "text": " And that the specific ways in which it's some, you know, like for instance, like the Rolf Pfeiffer, I think speaks really well to this in terms of like the way that the limited shoulder, the range of what the mobility of the shoulder joint, for instance, already would make your arm go out in front of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.708,
    "end": 222.021,
    "text": " and then like be more likely to grab things and where they're like well look right there at the right distance for me to both manipulate them and to observe them and so those would be the kind of like evolutionary priors you might expect but it's like in the bootstrapping process would be um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.704,
    "end": 228.886,
    "text": " You could also think of it, though, as like core knowledge to get to there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.906,
    "end": 237.409,
    "text": "It would be maybe not necessarily an evolutionary prior, but a very reliably learnable posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.189,
    "end": 239.389,
    "text": " So, or an empirical prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.57,
    "end": 260.614,
    "text": "So, you know, I think depending on like, but it might be so reliably learned and so canonized eight ways from Sunday that it might as well be an evolutionary prior, even though there is like this mediation by the learning that takes place, but it's basically in the bag because you did it because nature did it so well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.494,
    "end": 291.014,
    "text": " um so whether you would call it a prior or a posterior um depends on your perspective and some other people who've um kind of talked to the body as a prior like uh micah allen had a good paper uh the the body is prior talking about the way in which for instance um our interoceptive states as particularly stubborn predictions would help to make sure that like the whole like generative model is basically uh orbiting around allostasis and so like so yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.275,
    "end": 303.721,
    "text": " Does it make intellectual sense to you to carve a dividing line like an evidential boundary, or is it more elegant to just say it's philosophically vague?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.64,
    "end": 328.499,
    "text": " So I guess like in that tradition of like the, so like the body as first prior, um, there's also like the work with like, um, uh, Anna Chianitsa and, um, others where it's like us starting like mentalizing homeostasis where it's like you're, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.912,
    "end": 338.937,
    "text": " part of this learning curriculum is multi-agent and coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.477,
    "end": 346.182,
    "text": "Like we're starting within someone else's bodies and then even when we're on the outside, we might as well be because we're so dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.902,
    "end": 347.683,
    "text": "And so like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.8,
    "end": 369.977,
    "text": " And within also this Rolf Pfeifferian context, or this roboticist and the overlap with Rodney Brooks also, similar kind of thinking, but the world is its own best model, or like emergencies and a lot of the lifting being done by morphological intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.978,
    "end": 381.643,
    "text": " You know, even when you're on the outside of the womb, you're intensely coupling with others in an extended mind sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.243,
    "end": 383.104,
    "text": "So it's like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.691,
    "end": 394.716,
    "text": " It seems like you definitely, you can't just take it like at the body boundary, then the mind stops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.777,
    "end": 399.258,
    "text": "Yeah, this is a really interesting avenue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.278,
    "end": 406.061,
    "text": "I've been thinking about Clark and Chalmers' 98 Extended Mind Hypothesis paper in the lens of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.922,
    "end": 409.723,
    "text": "And I've been sort of informed in my thinking by two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.004,
    "end": 413.785,
    "text": "I've already mentioned one of them on the earlier podcast, which is Manuel de Landa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.574,
    "end": 417.635,
    "text": " and his most recent book, what's it called?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.675,
    "end": 418.735,
    "text": "Material Phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.755,
    "end": 421.975,
    "text": "He gives a sort of mechanistic account of vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.235,
    "end": 428.436,
    "text": "And he critiques the inactivist tradition on this count that basically what they want to call an intrinsic relation, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.616,
    "end": 431.437,
    "text": "the coupling itself is constitutive of the identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.097,
    "end": 436.378,
    "text": "So in the coupling between agent and arena, you actually form the definition of agent arena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.418,
    "end": 441.019,
    "text": "He criticizes that, that what actually that really is is a causal extrinsic relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.039,
    "end": 442.499,
    "text": "So that's one strand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.079,
    "end": 444.54,
    "text": " And then the other is Thomas Metzinger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.341,
    "end": 448.543,
    "text": "And Thomas did a podcast with Professor Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.244,
    "end": 460.111,
    "text": "And he spoke about how the notion of inaction might be quite misleading because it kind of implies that there might be a subtle reivocation of a Cartesian ego where you have A enacting B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.528,
    "end": 472.837,
    "text": " So I want to kind of pick your brain on that because it's interesting you brought up extended cognition and the fact that the mind might, its identity might go beyond the remits of the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.178,
    "end": 486.387,
    "text": "Are we in danger there of invoking what Delander calls an intrinsic relation where really what we're looking at is just causal connections and we shouldn't actually be mistaking that for identity relations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.619,
    "end": 490.239,
    "text": " I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.259,
    "end": 501.687,
    "text": "In that paper, I imagine I antagonize more than a few people and actually going Neo-Cartesian in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.929,
    "end": 519.476,
    "text": " quasi-homuncular and Peter-esque as essential ways of understanding agents and their relations to the world in terms of the way they're situated, and that having an internalized representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.815,
    "end": 533.069,
    "text": " pegged according to this reference frame of an observer from an egocentric perspective would do a lot of heavy lifting in the process of structure learning and making things tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.621,
    "end": 546.005,
    "text": " The, yeah, so it's like, I guess, yeah, you might have to like loop around a few times, you know, in terms of getting me to doc properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.045,
    "end": 557.05,
    "text": "But, uh, I guess the way I'm thinking it's like, like mind as model has to be like extended and it's like the, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.618,
    "end": 570.246,
    "text": " The ways in which the affordance landscape is so dependent on these couplings to go to internalists is, in a way, missed the point about what lets you do anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.167,
    "end": 577.031,
    "text": "But I do have sympathies for the internalist account in terms of making room for things like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.911,
    "end": 587.662,
    "text": " re-presentation so that you can do things like offline learning and imaginative planning and like, you know, basically like the world is its own best model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 587.682,
    "end": 596.171,
    "text": "Whenever possible, it's morphological compute, you know, emergent, you know, from the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.946,
    "end": 600.687,
    "text": " the couplings of the organism and its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.507,
    "end": 607.309,
    "text": "Don't just push your predictions down to the lowest level of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.749,
    "end": 608.889,
    "text": "Push them out into the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.149,
    "end": 611.59,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.75,
    "end": 615.131,
    "text": "That, I guess, was the question I wanted to come to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.311,
    "end": 617.512,
    "text": "So it's all very nicely interwoven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.492,
    "end": 618.952,
    "text": "You're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.072,
    "end": 621.913,
    "text": "You evoke this notion of the kind of quasi-homuncular systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.013,
    "end": 627.815,
    "text": "And you mentioned the frame problem, which is a really interesting problem to me, which is kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.407,
    "end": 632.511,
    "text": " How can we be intelligent in an ignorant manner?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.632,
    "end": 640.217,
    "text": "How can we zero in on personal information in the world, given the preponderance of sense data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.678,
    "end": 642.059,
    "text": "Intelligent in an ignorant manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.119,
    "end": 643.18,
    "text": "I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.36,
    "end": 644.761,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.842,
    "end": 645.322,
    "text": "It's not mine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.442,
    "end": 646.563,
    "text": "I'll shout out John Verveke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.603,
    "end": 650.386,
    "text": "I mean, he's the one who's kind of outlined the frame problem to me more than anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.358,
    "end": 658.699,
    "text": " This is kind of a leading question because I have a sense of how you're going to answer it, given what you just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.6,
    "end": 668.423,
    "text": "But can the frame problem be solved by just kind of a single conscious homunculus at the tip of the prefrontal cortex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.983,
    "end": 679.567,
    "text": "And if not, how deep do these, or how deep do you imagine that these quasi-homuncular or all these mindless cognitive agents, as Manuel de Landa would call them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.947,
    "end": 682.008,
    "text": " How deep do they go towards the skin?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.052,
    "end": 690.693,
    "text": "I'm sorry, I know I've gone right into the deep end on these, but why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.053,
    "end": 691.814,
    "text": "No, no, it's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.637,
    "end": 706.282,
    "text": "So it seems like the extended and active nature of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.433,
    "end": 716.564,
    "text": " of minds helps to curtail like frame problems and that you're always like in the world in particular ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.105,
    "end": 722.472,
    "text": "And if like you're coupling with the environment is creating basically like is basically like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.513,
    "end": 733.796,
    "text": " in a way, creating an enslaving center manifold for the whole system that you always have to keep coming back to to stay on top of this action perception cycle and on top of this interchange.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.218,
    "end": 754.75,
    "text": " The full scope of relevance is if you're always being brought back home and grounded in this common task of cybernet control, that seems to take some of the... I don't know if it quite defangs the frame problem, but it helps to curtail it a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.77,
    "end": 758.973,
    "text": "But in terms of also taking the range of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.998,
    "end": 781.188,
    "text": " you know potential relevant affordances it's still you know a big space um but still you know the idea of like orbiting it around um an agent's model of itself and its interaction with the world um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.51,
    "end": 812.051,
    "text": " don't know how far um homuncular for instance representation gets you with respect to that but in a way it um the idea of like basically one of the core things that you're modeling is the livid body the idea of the center of your experience this um uh you know so the homunculi i guess we will so i guess unpack homunculi so like the the thing that people are worried about would be right a homuncular regress where just like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.651,
    "end": 816.292,
    "text": " there's a little man in the head that's doing the observing and he'd explain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.152,
    "end": 835.437,
    "text": "The reason I start to push on this issue of trying to resurrect homunculi and things like Cartesian theaters is the idea is that the folk intuition is coupled to the phenomenology in a way that actually might reflect the data structures, might actually reflect the principles of the controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.598,
    "end": 847.88,
    "text": " And so the importance of taking your perception and giving it a coherent perspectival reference frame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.341,
    "end": 856.903,
    "text": "So something theater-esque in terms of having the right geometric relations of the things of the world and their relationship to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.603,
    "end": 878.657,
    "text": " But then also, for instance, though, the idea of an observer that helps, that watches the screen, the sense of your embodiment as a central data structure, being in close communication with basically the systems by which you would do visual perceptual synthesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.437,
    "end": 887.586,
    "text": " Because what your body is doing will inform what you're likely to be, what it means, what's coming in on your retina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.767,
    "end": 894.192,
    "text": "Or the visuospatial, the somatospatial should tell you about the visuospatial and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.953,
    "end": 898.936,
    "text": " And it's interesting that in robotics, these are actually the primary data structures they use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.956,
    "end": 911.384,
    "text": "So like in the collaborations I've done with like Tim Verbeelen and Ozan Katal, like in their latent SLAM systems, one of the primary things for situating the robot in the world is basically a conjunction of views and poses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 912.124,
    "end": 917.227,
    "text": "And they're almost like one data structure in that it's one of the best",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.728,
    "end": 924.389,
    "text": " Where I'm looking, where my sensors are oriented are going to be highly informative for what I'm looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.429,
    "end": 927.65,
    "text": "And also just the way my body is configured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.33,
    "end": 934.551,
    "text": "I don't think this isn't quite brought into their systems, but the range of relevant affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.151,
    "end": 936.351,
    "text": "What am I likely to be seeing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.391,
    "end": 942.112,
    "text": "Well, what your body is doing will be highly relevant to that also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.152,
    "end": 945.333,
    "text": "And so the mutual information should be very strong, closely coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.253,
    "end": 946.433,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.617,
    "end": 954.141,
    "text": " Yeah, it kind of brings me back to the first question, I guess, which is, I mean, I could probably reword that now using the terms you've just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.181,
    "end": 961.286,
    "text": "I mean, I think internal and external and active inference can be considered a kind of relative misnomer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.767,
    "end": 971.453,
    "text": "Because, you know, I like Maxwell's rewording of it as tracking and tracked or modeling and modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.553,
    "end": 975.135,
    "text": "I think that's quite an effective way of reshifting the focus here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.696,
    "end": 977.337,
    "text": "So I guess the way of rewording that question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.752,
    "end": 998.169,
    "text": " You know, are we, in invoking a homunculus in the Cartesian theater, are we a risk therefore of kind of thinking that there's a genuine ontological homunculus, which is conducting variational Bayesian inference and has a model over which it does computations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.009,
    "end": 1005.855,
    "text": "I think like that rubs a lot of people the wrong way, because for a lot of people, it's just dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.187,
    "end": 1023.934,
    "text": " And so, you know, do these kinds of questions actually call into question the more fundamental dichotomy of tracking and tracked and distinct ontologies, distinct entities in the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.815,
    "end": 1026.295,
    "text": "Potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.315,
    "end": 1033.398,
    "text": "And so, yeah, maybe I'm asking for too much, but I want to have it all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.478,
    "end": 1034.899,
    "text": "I want to have, I don't know what you say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.919,
    "end": 1036.34,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.532,
    "end": 1065.453,
    "text": " inactive couplings in the streets and like revisions and a couple of good sheets you know like um the you know to the extent possible like you know there's even no need to appeal to like some sort of model representation for much of what i'm describing this like mutual contextualization of like these different sensory systems in terms of they're already coordinated just by having a certain situation on the body itself and in the world and the way like the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.814,
    "end": 1070.676,
    "text": " The information is cascading in the context of the inactive coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.216,
    "end": 1076.179,
    "text": "And so there's a sense, you know, the model of the agent is extended into the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.64,
    "end": 1078.561,
    "text": "Its mind is extended already there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.921,
    "end": 1083.204,
    "text": "And a lot of like the work I'm talking about, like the homunculus is the body itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1083.264,
    "end": 1086.266,
    "text": "There's no need for like an initial representation of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.266,
    "end": 1112.41,
    "text": " I do, though, suggest we might have, though, such basically a data structure, you would say, and maybe even potentially involving... I put this forward basically as a kind of prediction that nothing rides on in the sense of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.202,
    "end": 1116.363,
    "text": " If I'm wrong, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.183,
    "end": 1118.643,
    "text": "But if I'm right, could be interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.363,
    "end": 1133.847,
    "text": "But the specific idea is that there might be subnetworks of the brain that actually have a geometric organization about them in terms of you would even have within cortical hub structures potentially a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.788,
    "end": 1144.292,
    "text": " geometric correspondences through the manifold activity in those networks and what's being represented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.792,
    "end": 1152.416,
    "text": "So you could even get like homuncular in terms of like the network is almost little person-like on some portions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.776,
    "end": 1162.662,
    "text": "And the reason you might want to do this is that within geometric deep learning, like if you give a network the same geometry, essentially not so like a physical network in terms of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.226,
    "end": 1170.269,
    "text": " Well, I guess it would be there in the connective intervention, but it could be just like a dynamic emergent pattern of effective connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.73,
    "end": 1182.296,
    "text": "But if the network, though, has the same structure as that which it is representing or modeling or trying to track, you end up getting potentially orders of magnitude greater efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.69,
    "end": 1184.53,
    "text": " Yeah, that's really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.97,
    "end": 1186.031,
    "text": "That's really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.151,
    "end": 1199.134,
    "text": "So it's possible that there could be, in addition to most of what we're doing is effortless mastery, and the long killer story, you never need representation, you never need internalized model, and you would want that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.695,
    "end": 1201.375,
    "text": "That's quicker, more efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.775,
    "end": 1211.738,
    "text": "But you might also, on top of that, for the sake of things like imaginative planning, things like having more nuanced control of the sensory motor engagement,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.418,
    "end": 1228.662,
    "text": " you might also have re-presentations of this and potentially even shockingly Cartesian accounts, like in terms of highly centralized and even kind of looking with a geometry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.222,
    "end": 1234.005,
    "text": " that would be of a similar shape to the body itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.085,
    "end": 1236.706,
    "text": "Yeah, that's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.047,
    "end": 1246.492,
    "text": "I mean, these strange loops, as Hofstadter would call them, are seemingly never-ending, the body having loops of itself, the body having loops of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.992,
    "end": 1252.934,
    "text": " I mean, it comes back to, I think, kind of the cybernetic good regulator theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.054,
    "end": 1262.998,
    "text": "And like, is that saying, you know, there's this kind of confusion is out saying that all good regulators have a model of the world or are a model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.038,
    "end": 1264.138,
    "text": "And I think, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.39,
    "end": 1265.73,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.77,
    "end": 1268.993,
    "text": "I mean, I don't know whether you think that's still a live question in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.053,
    "end": 1278.499,
    "text": "I mean, to be honest, to be completely candid and yes, I'm a relative layman with a year's experience of thinking about active inference and not understanding the maths and the physics, but that's okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1279.36,
    "end": 1288.106,
    "text": "I think there's still a kind of question there, which is, and Carl, to be honest, was quite neutral on it when I asked him, which is like, what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.666,
    "end": 1290.168,
    "text": "What are internal states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.754,
    "end": 1293.055,
    "text": " Um, yes, internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.075,
    "end": 1300.359,
    "text": "So it makes sense that internal states have or embody, have embodied beliefs about the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.039,
    "end": 1303.8,
    "text": "I mean, that is at the heart of like a likelihood mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.221,
    "end": 1305.341,
    "text": "So fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.722,
    "end": 1307.322,
    "text": "But is that it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.342,
    "end": 1315.286,
    "text": "Uh, is that when we're going to give them is these beliefs and what is it to embody a sub personal belief?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.747,
    "end": 1317.047,
    "text": "Is it just an instantiate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.087,
    "end": 1320.329,
    "text": "Like, I think people find it very difficult to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.175,
    "end": 1325.257,
    "text": " basically move away from the physical mechanics to the statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.897,
    "end": 1327.858,
    "text": "And I think there needs to be a bridging mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.898,
    "end": 1345.207,
    "text": "So I don't know if you had any thoughts just on like the broader way that a sort of layman audience, including myself could make those intuitive or those non-intuitive distances between statistics and physics or the physical material world a bit more intuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.227,
    "end": 1345.968,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.721,
    "end": 1368.463,
    "text": " to, it's like, we're working with this account of like, you know, blankets of blankets of blankets and, um, I guess the way I'm interpreting is like, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.106,
    "end": 1408.238,
    "text": " Internal states, coarse-graining external states, and then nested within their internal states, coarse-graining external states, so on and so forth, in a hierarchy or a heterarchy of nested-blanketed structures, giving you these multiple levels of resolution that you can unpack as needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.718,
    "end": 1410.679,
    "text": "And so I guess the thing I'm wondering is whether, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.788,
    "end": 1433.117,
    "text": " I wonder whether it seems like none of it works without the inactivist principles, without the structuring of what's happening by intelligent morphologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.558,
    "end": 1446.045,
    "text": " Or without just the nature of the coupling of the system and its world providing the grounding and the semantics and the interest, none of it gets off the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.026,
    "end": 1455.951,
    "text": "But the story still, it can be told just at the level of the system and its extended phenotype as this one single...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.092,
    "end": 1479.192,
    "text": " model and like where do you draw this boundary what's internal what's external it's like it depends on the scale you're thinking about it right um and so i guess the place where i wonder is we're gonna need internalism is when we get to consciousness yes like like so so like so i you know i guess you might even call me like a kind of like panpsychist of a stripe in psyche in terms of understood as like mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.813,
    "end": 1493.464,
    "text": " But then when you get to basically consciousness in terms of something like a system where we might say there is something that it feels like to be that system, and that can do things like imagine, for instance, and dream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.005,
    "end": 1506.634,
    "text": "For that and those elements of experience, it seems like we're going to have to at some point invoke enough... We're going to need a blanket of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.475,
    "end": 1520.824,
    "text": " a set of attractors that are internal and can basically break free of the immediate engagement with the world because that's part of our experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.344,
    "end": 1525.648,
    "text": "And so like for people, I think to actually like account for phenomenology, to account for like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.588,
    "end": 1537.236,
    "text": " you know, like a lot of the things that matter to us, you know, eventually getting to, you know, things like agency, even like free will, we're going to need to, at some point, go internalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.757,
    "end": 1548.365,
    "text": "But like in that process, though, you know, it's just, but still the story for most of evolution, you know, but still like if you go in that direction, though,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.085,
    "end": 1559.595,
    "text": " and you lose sight of the inactivist principles, well, then you basically find yourself in the same places that I guess you could say the mainstream machine learning goes astray sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.316,
    "end": 1573.548,
    "text": "You think you're going to handle the problem just with scale or raw compute, or you don't understand the kinds of learning curriculum you would need to bootstrap intelligent systems or how they would need to be deployed to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.949,
    "end": 1593.795,
    "text": " achieve goals in the world um so uh yeah so i again like i think i end up like occupying a very awkward position that's like you know the um radical and activists will be like you know you don't need to invoke these things and like um uh uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1594.855,
    "end": 1600.417,
    "text": " Cognitiveness might be like, you're leaning way too hard in saying that embodiment is necessary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.437,
    "end": 1604.799,
    "text": "But I think that is the case, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.899,
    "end": 1612.242,
    "text": "I think everyone was kind of right in just emphasizing the count of what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.802,
    "end": 1613.422,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.062,
    "end": 1618.924,
    "text": "I mean, I haven't staked my personal claim, but I don't disagree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.984,
    "end": 1623.526,
    "text": "And I think that nuance is always going to be right in some fundamental sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.72,
    "end": 1652.863,
    "text": " all theories are wrong because they're just wrong to different degrees all metaphors are wrong some metaphors are useful right exactly I mean I was wondering you know it's funny that it's not funny it's interesting that you say that the inactivist principles are necessary it'd be great to have like a pure internal although I can't label people but like someone like Jakob Howie who you know if he was here might again I'm not putting words in his mouth so be curious to see what he thinks might ask whether it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.842,
    "end": 1664.731,
    "text": " conceivable that a kind of compute only system could do variational Bayesian inference given its priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.811,
    "end": 1678.184,
    "text": "I mean, I think another useful distinction actually to unpack for our audience and something that I found really, really useful is this distinction between having a sort of epistemically viable model of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.292,
    "end": 1682.294,
    "text": " So you are actually, you know, it's descriptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.154,
    "end": 1688.597,
    "text": "It accounts for the sensations that it's observing or its sensations it's receiving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.417,
    "end": 1691.878,
    "text": "And the normatively viable model of the world, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.118,
    "end": 1698.341,
    "text": "one where you aren't just dispersing into the heat bath, but you can maintain your own sort of autopoetic organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.242,
    "end": 1707.186,
    "text": "And I'm wondering whether you think it's conceivable to any degree, whether both sides of that equation could be fulfilled by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.231,
    "end": 1712.256,
    "text": " a kind of sheltered off super intelligent homunculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.979,
    "end": 1717.001,
    "text": "Sheltered off and never comes into contact?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.802,
    "end": 1722.267,
    "text": "Well, I mean, so it comes into contact vicariously through the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.929,
    "end": 1726.952,
    "text": "So I'll permit active and sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.973,
    "end": 1737.519,
    "text": " But again, vicariously, it has to do this kind of variational Bayesian inference based on its model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.639,
    "end": 1741.402,
    "text": "And we can kind of get into the maths of that a little bit, of where that model comes from in the first place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.623,
    "end": 1752.249,
    "text": "Might not be quite what I think we're driving at, but one thing I would wonder in terms of saying, no, you don't need...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.843,
    "end": 1774.826,
    "text": " um you know things like uh active learning to be like intel to you don't need to like invoke things like extended mind concepts you don't need to invoke things like niche construction but like in theory like you could do everything just from like uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.429,
    "end": 1794.096,
    "text": " A smart enough Bayesian observer, I guess, would that be like the complete class theorem is like, well, yes, almost has to be the case, but that in theory, you could do it, that the inactivist elements that are being appealed to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.696,
    "end": 1807.559,
    "text": " Like if you were going like in theory, if you want to like build like a, like an AGI or something, uh, you wouldn't need to, but then I guess the question is like, if that in theory, though, like in theory, like a three layer neural network can compute anything, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.819,
    "end": 1810.26,
    "text": "It just might have to be so big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.3,
    "end": 1811.56,
    "text": "It doesn't fit in like the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.1,
    "end": 1815.141,
    "text": "And so it's like, if that in theory can't become in practice,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.881,
    "end": 1830.326,
    "text": " given available compute available to systems we would feasibly be able to create, that it becomes, I think, a little bit moot, although still interesting, about that case of, is it a matter of in principle or in practice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.986,
    "end": 1838.449,
    "text": "Yeah, it's where philosophy has its limits, perhaps, where conceivability arguments have their limits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.509,
    "end": 1841.69,
    "text": "A question that popped up into my mind is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.052,
    "end": 1849.883,
    "text": " bootstrapping up intelligent or, you know, kind of in vitro intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.927,
    "end": 1855.332,
    "text": "I think one question I've always had is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.42,
    "end": 1864.046,
    "text": " the priors that are encoded in a genitive model kind of make sense in this normatively viable sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.767,
    "end": 1867.429,
    "text": "So people just think of homeostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.049,
    "end": 1876.236,
    "text": "We have these kinds of prior expectations about the states that we expect to be in and we'll act accordingly to confirm that model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.025,
    "end": 1884.29,
    "text": " I think people might have a bit of a difficulty applying the same logic to perceptual inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.11,
    "end": 1894.256,
    "text": "So perceptual inference, you know, this idea that basically you're inverting Bayes, you are trying to derive the state from the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.377,
    "end": 1904.923,
    "text": "I guess the question that I have is if that's a sort of P of X given Y, your probability of the state given the observation, obviously that's done",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.144,
    "end": 1912.266,
    "text": " through some form of the variational bays, people might be asking, well, where does the P of X comes from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.306,
    "end": 1924.21,
    "text": "Where does your prior of states before observations, I think what might be the detensor in POMDPs, where does that come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.35,
    "end": 1930.952,
    "text": "Is that encoded in the phenotype in the same way that homeostatic imperatives might be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.972,
    "end": 1932.352,
    "text": "Hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.655,
    "end": 1939.237,
    "text": " Or is it the, the D matrix or the, like, you know, I think it's the, yeah, I think it's the D matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1939.297,
    "end": 1946.02,
    "text": "Again, I'm not a computationist, but your specific initialization within the environment and like getting the ball rolling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.82,
    "end": 1947.44,
    "text": "Yes, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.56,
    "end": 1947.881,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.901,
    "end": 1949.121,
    "text": "So it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.413,
    "end": 1961.675,
    "text": " It seems like we know that without the inductive biases, none of it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.695,
    "end": 1963.235,
    "text": "The structural learning is just impossible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.476,
    "end": 1976.1,
    "text": "Without the evolutionary priors, without some sort of intelligent initialization, I guess the place where I tend to have a heterodox view",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.9,
    "end": 1980.021,
    "text": " And it's like, well, I grant we need something like core knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.041,
    "end": 1982.642,
    "text": "We need, basically, those are our priors to lean on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.822,
    "end": 2002.008,
    "text": "I tend to think that natural selection had fat fingers when it came to doing the design, both in terms of potential complexity mismatches between inherited information and then what comes afterwards, but also due to not just in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.056,
    "end": 2012.459,
    "text": " People will sometimes refer to the difference in complexity between the genome and the connectome, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2013.039,
    "end": 2019.224,
    "text": "But obviously, the genome, the epigenome, and there's a lot more inheritance in that, just in the cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2019.404,
    "end": 2022.026,
    "text": "There's a lot of heritable elements that go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.566,
    "end": 2024.688,
    "text": "But even then, there does seem to be some difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.388,
    "end": 2028.15,
    "text": "You've squeezed through the bottleneck of an ovum,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.991,
    "end": 2035.793,
    "text": " And so from this one cell, you've reconstituted the rest in this kind of like auto-encoding, like you get to pass through a bottleneck here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.574,
    "end": 2046.417,
    "text": "And somehow, but from this, you're now going to reconstitute a network of functional relations and effective connections, like a full brain's connectome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.057,
    "end": 2052.319,
    "text": "And is there enough in there to specify things the way you might need to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.119,
    "end": 2077.113,
    "text": " Um, the way I tend to like, kind of think about it as like, so one heuristic is, um, you know, the more, so like what, um, kind of knowledge might, what might be needs, what might be the nature of the representation or just the instantiation of the algebra, then the more complex it is, the less likely it is that that is in a more direct sense, uh, uh, specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.133,
    "end": 2077.953,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.413,
    "end": 2079.334,
    "text": "So it's like, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.454,
    "end": 2096.159,
    "text": " If we're talking about, for instance, you can think of, there's a prior encoded, for instance, in the frog brain of the superior colliculus of, potentially, based on sensitivities to luminance, it might help people zoom in on eyes, potentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2096.359,
    "end": 2097.68,
    "text": "That could be an example of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.46,
    "end": 2104.307,
    "text": " or the priors about where you expect light to be coming from in general, and this helps to make things trackable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.727,
    "end": 2111.535,
    "text": "But then let's say you're talking about some of good old-fashioned evolutionary psychology, like at the other extreme, like a cheater detection module.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.398,
    "end": 2113.919,
    "text": " well, how the heck would you do that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.939,
    "end": 2114.599,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.139,
    "end": 2137.47,
    "text": "So it's like how likely is it that you could basically, in this learning curriculum, have these lessons occur and have this knowledge be acquired early enough, and the simpler it is, the more likely it could be there early, that there's a meaningful degree of canalization that is actually part of natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.89,
    "end": 2138.811,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.291,
    "end": 2139.811,
    "text": "In general, the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.152,
    "end": 2160.616,
    "text": " Another claim I've been making is that in order to pull this off, a lot of it was indirect, even for a lot of the core knowledge people will appeal to, that you basically just needed to create a tractable learning curriculum to get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.116,
    "end": 2164.817,
    "text": "And what natural selection was primarily doing was sculpting learning curricula.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.097,
    "end": 2176.105,
    "text": " using the body and its positioning as a large source of leverage on this to help reliably acquire the knowledge you need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.545,
    "end": 2178.106,
    "text": "But it's still though acquired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.126,
    "end": 2192.217,
    "text": "And how much the adaptation is able to do that would be the simpler it is, the more likely you could meaningfully make that a canalization pathway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.677,
    "end": 2192.997,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.017,
    "end": 2193.137,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.257,
    "end": 2194.138,
    "text": "That that's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.278,
    "end": 2195.639,
    "text": "That's a, that's a great way of looking at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.899,
    "end": 2196.299,
    "text": "It's funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.339,
    "end": 2202.083,
    "text": "I, my undergrad was in linguistics, um, and linguistics was the, was the hotbed for all of this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.183,
    "end": 2207.166,
    "text": "You know, I mean, Chomsky really, um, Chomsky and Chomsky Darwin's Darwin problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.206,
    "end": 2219.293,
    "text": "I mean, this is like what he was talking about in the nineties and he had to sort of pare down what universal grammar was because the big question was, okay, you can account for, you know, perhaps principles and parameters can account for the complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.054,
    "end": 2226.257,
    "text": " and creativity of language learning, but how the hell are these hundreds of parameters going to be encoded in the genome?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2228.951,
    "end": 2234.034,
    "text": " In the versions of Chomsky and thinking where he's going minimalist, talking about something like... Yeah, recursion, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.395,
    "end": 2238.217,
    "text": "But then if it's just something like merge, it's like, well, sure, that seems very plausible, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.577,
    "end": 2239.418,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.658,
    "end": 2249.945,
    "text": "Even quickly in evolution, the ways that's been suggested, and part of what corresponds to these phase transitions we see where all of a sudden new orders are coming on pretty compressed intervals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.501,
    "end": 2250.701,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.721,
    "end": 2261.907,
    "text": "But, but yeah, but if you're going to like, you know, at the other limit, like things like, I guess like, uh, I don't know, Pinkerian, like, so then it's like, Oh, I, that I'm not sure biology can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.527,
    "end": 2264.588,
    "text": "Well, I think he may, I think he made that concession.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.229,
    "end": 2268.55,
    "text": "Um, Chomsky at least, I'm not sure about Steven Pinker, but Chomsky certainly does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.59,
    "end": 2271.732,
    "text": "And as you say, as the minimus program with merge, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.671,
    "end": 2277.359,
    "text": " But yeah, I think a lot of linguists might argue that he's kind of abandoned that nativist project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.84,
    "end": 2279.803,
    "text": "But anyway, we need not go in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.823,
    "end": 2281.145,
    "text": "I'll try and get him on the pod, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.367,
    "end": 2283.128,
    "text": "Sticking on sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.062,
    "end": 2311.102,
    "text": " evolution my background is not in evolutionary biology or psychology so i'm super keen to learn um again just to take a quote of yours um you say much of the functional significance of specific connections in complex neural networks may be inherently difficult to predict due to the sensitivity of brackets chaotic self-organizing systems to initial conditions so when i hear that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.901,
    "end": 2324.743,
    "text": " I think, sure, like it certainly makes sense in terms of initial volatility, probably having more of an effect on self-organization than once you have a kind of robust phenotype.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.603,
    "end": 2339.846,
    "text": "But why, therefore, is there a convergence within a species, a phenotype to kind of a homogeneity if there is this kind of vulnerability to chaos?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.97,
    "end": 2349.191,
    "text": " It seems like a good amount of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.991,
    "end": 2367.12,
    "text": "I mean, that a good, you know, to get, so you're having a system which has, that's massively recurrent in terms of like, it's like in the system as it develops, it feeds back on itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.42,
    "end": 2370.221,
    "text": "And then that influences how it feeds back on itself and that influences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.581,
    "end": 2373.163,
    "text": "And so there's this potential for amplifications to take you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.843,
    "end": 2377.928,
    "text": " in a lot of different directions, but natural selection doesn't want you to go in any given direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.188,
    "end": 2379.229,
    "text": "It wants that homogeneity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.249,
    "end": 2383.333,
    "text": "It wants you to be like well fit to be, you know, to have high fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.734,
    "end": 2390.301,
    "text": "It wants you to be fit to your, the niches you're likely to be encountering and to be able to, you know, survive and,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.403,
    "end": 2394.625,
    "text": " proliferate your forms in those circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.685,
    "end": 2397.508,
    "text": "And so, you know, you don't want to be just like open-ended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.528,
    "end": 2398.669,
    "text": "You want that homogeneity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.209,
    "end": 2408.998,
    "text": "But the process, because it feeds back on the self, will be, it should have this potential for astronomical bifurcation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.058,
    "end": 2410.84,
    "text": "So how do you like rein it in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.86,
    "end": 2414.103,
    "text": "You know, there seems like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.833,
    "end": 2425.794,
    "text": " And so, you know, you could just say like, you know, well, that's what the inductive biases are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.194,
    "end": 2428.895,
    "text": "And so, you know, let there be inductive biases and it was good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.195,
    "end": 2430.576,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.656,
    "end": 2448.702,
    "text": "But well, which ones and how, and so I wonder the extent to which like a choke points for, um, coordination among sub elements of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.322,
    "end": 2469.64,
    "text": " such as, for instance, any kind of place you could identify something like a bow tie motif, any place where you can get something like a large sale convergence divergence, which in general you would expect because you need small worldness for the sake of just efficiently getting a system to be integrated or to have a system be integrated at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.961,
    "end": 2470.801,
    "text": "You want to be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.602,
    "end": 2474.705,
    "text": " have the different components function together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.226,
    "end": 2480.932,
    "text": "But if everything's connected to everything, that's both chaos and it's very inefficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.972,
    "end": 2493.344,
    "text": "So the idea of these places where things from broad extents will pass through and then providing basically an opportunity for enslavement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.046,
    "end": 2499.71,
    "text": " Some of this could just be network motifs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.73,
    "end": 2519.645,
    "text": "You look at, for instance, convergence onto hub structures that have high centrality, but also things like if you take the value signals, things like dopamine or serotonin, and you have those also have the conditions of their release correspond to organism scale events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.626,
    "end": 2532.018,
    "text": " then that could help basically give coordination to the overall system in reliable ways for this task of helping the organism make it through the world, helping the system to function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.038,
    "end": 2542.309,
    "text": "So it's like these codependencies and choke points, these places where you'll get functional convergence,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.21,
    "end": 2558.181,
    "text": " I suspect that's important for keeping that divergence from happening too much, this integration into organismic significance with respect to cybernetic control of the agent pursuing his goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.261,
    "end": 2566.387,
    "text": "And if that basically, by virtue of whether we're talking about value signals that would then shape connections,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.049,
    "end": 2583.586,
    "text": " or the structure of the architecture itself, if that is positioned such that the whole system can be so enslaved, that should basically help these bifurcations in a way be not bugs, but features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.207,
    "end": 2597.018,
    "text": " and that it's certainly sources of solenoidal flow and explorations and engaging local pockets of high-temperature search, but then you rein it back in for staying on top of the action-perception cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.639,
    "end": 2604.184,
    "text": "To come back to consciousness, for me, it's basically iterative state estimation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.385,
    "end": 2621.688,
    "text": " with the goal being basically I want to know a rough and ready estimate of the relationship between the system and the world generated quickly enough that I can meaningly inform and be informed by action perception cycles on the time scale of their formation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.108,
    "end": 2627.709,
    "text": "And so I can nuance that engagement, provide some extra skillful control and surfing uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.209,
    "end": 2628.69,
    "text": "So it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.651,
    "end": 2650.764,
    "text": " If the primary task of the system is this inactive coupling, I feel like that helps to tame and harness chaos rather than having a thing bifurcate in all the hyper-astronomical number of dimensions it could go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.056,
    "end": 2652.296,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.456,
    "end": 2652.756,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.776,
    "end": 2652.916,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.956,
    "end": 2655.777,
    "text": "There's a lot that, I mean, yeah, let's, uh, let's do the consciousness thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.818,
    "end": 2661.979,
    "text": "Um, I was going to jump psychedelics, but why don't we start even more fundamental consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.519,
    "end": 2667.801,
    "text": "Uh, anyone who's watched the first five episodes or four episodes knows that I love consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.361,
    "end": 2669.822,
    "text": "Uh, it was kind of my foray into all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.562,
    "end": 2674.503,
    "text": "So what you've given me there is a function of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.123,
    "end": 2677.244,
    "text": "It's guiding action perception loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.344,
    "end": 2680.165,
    "text": "It's, it's, it's kind of a likelihood mapping state estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.966,
    "end": 2691.452,
    "text": " Okay, but as you can imagine, the follow-up question is going to be why does it come with its phenomenal characteristics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.972,
    "end": 2694.673,
    "text": "Is there something that's intrinsic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.134,
    "end": 2703.438,
    "text": "Is there something that's adaptive to those phenomenal characteristics which facilitate, improve, augment the function that you just laid out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.341,
    "end": 2711.083,
    "text": "I think, you know, people could still, you know, like, you know, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.486,
    "end": 2721.051,
    "text": " Why can't these functions all take place in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.311,
    "end": 2723.294,
    "text": "Why must they feel like anything at all?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.307,
    "end": 2731.33,
    "text": " I don't think that concern is removed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.43,
    "end": 2749.521,
    "text": "I think it loses some of its force if the nature of the data structure is considered as being specifically the generation of a visuospatial and somatospatial field of experience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.577,
    "end": 2767.016,
    "text": " precision weighted or having like with biases rather like different areas of salience and emphasis based on organismic need and like if you're basically taking like basically the the the thing you are estimating is the sensorium itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.318,
    "end": 2779.068,
    "text": " It's sort of like, well, it feels like something because like the emphasis on the feels, like what the data structure is is specifically an inversion of a generative model over the sensorium of an embodied embedded agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.569,
    "end": 2782.171,
    "text": "So that's actually what the process is specifically doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.692,
    "end": 2788.097,
    "text": "Now you can still say, well, why couldn't you do the state estimation of the system in the world in the dark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.718,
    "end": 2789.058,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.072,
    "end": 2793.993,
    "text": " You know, I think it's that objection, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.353,
    "end": 2798.955,
    "text": "So the claim is that that objection holds more for theories of consciousness that forget we have bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.075,
    "end": 2810.499,
    "text": "So you could still levy it, but I think it's like slightly addressed by making the primary explanandum the appearance of a world to a lived body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.659,
    "end": 2818.403,
    "text": " If that is the primary explanatum and you're specifically saying, how might dynamics compute that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.143,
    "end": 2824.106,
    "text": "Then I think it takes that on a little bit more, the why should there be something it feels like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.426,
    "end": 2826.967,
    "text": "Because what you're specifically trying to explain is the feels itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.888,
    "end": 2828.108,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.548,
    "end": 2835.872,
    "text": "They sound to me quite convergent with Mark Soames' sort of affects driven account of qualia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.792,
    "end": 2848.843,
    "text": " this being that sort of these fundamental effective states are sort of guides in a way to allostatic behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.624,
    "end": 2852.386,
    "text": "So whether that's the resolution of uncertainty,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.307,
    "end": 2878.375,
    "text": " um information gain um testing model parameters or actually just minimizing variational free energy see that for me was one of the first functional explanations of consciousness that really made me think oh that's that's kind of viable because i can't conceive of a feeling without it being felt um and so what i've been looking for is these kind of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.591,
    "end": 2882.073,
    "text": " it's almost like a synthetic a priori of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.133,
    "end": 2884.374,
    "text": "It's almost like a transcendental argument for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.734,
    "end": 2890.078,
    "text": "Does anything like circle back on itself so as to make consciousness a prerequisite for the function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.719,
    "end": 2905.989,
    "text": "And I think where you and Mark are converging here is quite promising, which is that now someone like David, what, someone like 1995 David Chalmers might go, well, you could just have like an offline signal that says things are uncertain and let's resolve that uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.309,
    "end": 2907.029,
    "text": "Granted,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.066,
    "end": 2915.91,
    "text": " But then I take quite seriously this older phenomenological Heideggerian idea that we're beings that take a stance on our own existence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.611,
    "end": 2919.792,
    "text": "And that's got to be felt to some degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.973,
    "end": 2928.217,
    "text": "So I'm wondering what you think of that spiel and perhaps where there's points of convergence with Marx's theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.427,
    "end": 2933.748,
    "text": " I'd say very strong points of convergence, but also divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.268,
    "end": 2941.271,
    "text": "The convergence is like he's bringing in life-mind continuity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.851,
    "end": 2948.774,
    "text": "He's bringing in the necessary interestedness of the system and also the primary nature of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.821,
    "end": 2965.99,
    "text": " of affect and of saying like, and like you're saying like this synthetic opera, like, like what do we need to even co coherently conceive of this thing where like, what's foundational or like, if you were to doubt it, the whole like game falls apart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.25,
    "end": 2966.87,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.15,
    "end": 2967.31,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.33,
    "end": 2970.833,
    "text": "So unless you have, like, unless we get the fields in there, we're not getting anywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.393,
    "end": 2981.319,
    "text": "And unless we get like the, um, you know, and so the, the, I guess the thing I would suggest is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2983.48,
    "end": 3012.362,
    "text": " as a point of divergence would be, I wonder if the specific systems, so I guess like for me, I don't necessarily take unconscious feelings to be an oxymoron, but, you know, so we can use words differently, but sometimes I'll think of like one way of thinking of like emotions and feelings, almost like a very abstract action perception cycle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3012.998,
    "end": 3015.802,
    "text": " Whereas the emotions are the global state changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.222,
    "end": 3020.908,
    "text": "I think by the time you get to that level of abstraction, the difference between action and perception falls apart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3021.309,
    "end": 3030.5,
    "text": "But in a way though, the change in organismic mode to be adaptive for a particular class of situations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.121,
    "end": 3040.525,
    "text": " Whatever that is, that seems to be roughly something like emotion would correspond to this and where the organismic mode could extend beyond the organism in terms of the emotion and just like contained within it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.166,
    "end": 3050.35,
    "text": "But the feeling part potentially being some sort of inference on top of that process, some sort of tracking of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.89,
    "end": 3058.874,
    "text": "Now, we can use words in any way, but like I would personally, so that's the way I think of it and the way I describe thinking of it in that entropy paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.554,
    "end": 3064.137,
    "text": " And then I wonder whether we can have both unconscious and conscious feelings and emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.778,
    "end": 3071.522,
    "text": "So like a level where like, you know, we go back down to the individual cell and the cell is like changing into like a sporulated mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.903,
    "end": 3074.044,
    "text": "And maybe that's like it becoming afraid or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.664,
    "end": 3077.546,
    "text": "Or it like extends a pillus to like exchange a chromosome with someone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.087,
    "end": 3080.688,
    "text": "You know, or rather that chromosome, a chromatid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.029,
    "end": 3082.41,
    "text": "And that's like maybe like a lust mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.87,
    "end": 3085.111,
    "text": "Or like it releases, you know, exotoxins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.152,
    "end": 3088.494,
    "text": "Or that's like an aggression mode or something, like a rage mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.214,
    "end": 3097.502,
    "text": " And so I like the idea of the work of Damasio, who Mark engaged with in beautiful ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.062,
    "end": 3102.746,
    "text": "I love this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.766,
    "end": 3107.691,
    "text": "I think it's essential for understanding the actual cybernetic significance of feelings and emotions to actually be coherent about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.331,
    "end": 3125.805,
    "text": " to actually talk about life-mind continuity and to recognize this is an older story than even nervous systems in terms of the harmonics or the eigenmodes of the organism to be adaptive, having those to give them an overall coherent shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.586,
    "end": 3134.552,
    "text": "But for the specific systems that Mark talks about, I wonder whether they have what it takes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.333,
    "end": 3143.042,
    "text": " to do the kind of like re-presentation game, whether they're potentially doing their functioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.504,
    "end": 3149.649,
    "text": "So he'll emphasize like the pericardial ductal gray and as being this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.57,
    "end": 3163.863,
    "text": " integration around organismic need and the way that affects in order for these eigenmode shifts to be coherent so that you're not eating and doing care at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.243,
    "end": 3166.885,
    "text": "That would be a bad idea in a lot of circumstances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.945,
    "end": 3169.728,
    "text": "You don't want mothers to eat their pups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.088,
    "end": 3170.609,
    "text": "You don't want this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.231,
    "end": 3178.435,
    "text": " picking and the, I think, I don't know if he says color coding, but this like categorical breakdown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.675,
    "end": 3178.875,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.275,
    "end": 3183.639,
    "text": "I'm totally with him functionally, but it still seems like those could happen in the dark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.439,
    "end": 3184.659,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.96,
    "end": 3197.709,
    "text": "And so the thing I'm wondering is in order for them to be given something like phenomenality that we experienced with the conscious feelings, I'm wondering whether that requires something like, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.08,
    "end": 3202.161,
    "text": " basically a re-representation into cortical circuits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.921,
    "end": 3210.843,
    "text": "And maybe even within somatospatial and visuospatial modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.264,
    "end": 3215.065,
    "text": "So I make what's considered to be a bizarre claim,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.905,
    "end": 3232.314,
    "text": " that those might actually be all we have and all other modalities are basically kind of synesthetically cross-mapped into those to be given spatial and temporal spatial coherence so that they actually can be modeled and you can do this like state estimation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.335,
    "end": 3239.619,
    "text": "So the idea is like your interoceptive states might actually be to be experienced have to be spatialized as a kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.259,
    "end": 3248.221,
    "text": " texture or as a kind of like, I feel I have to temporalize and spatialize that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.261,
    "end": 3253.582,
    "text": "And maybe part of the way you do it is to enfold them into another modality as part of the inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.762,
    "end": 3269.926,
    "text": "So, but the, yes, I guess the difference with Mark is I'm wondering whether his account is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.417,
    "end": 3286.369,
    "text": " like right on on the functional level, but the systems though, that would actually, but still though, the systems he's emphasizing would be necessary but not sufficient conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.849,
    "end": 3298.238,
    "text": "In order to obtain sufficiency, they need to basically enslave cortical circuits and that those might actually be the constitutive causal, the constitutive realizers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.039,
    "end": 3321.481,
    "text": " of experience potentially by virtue of the fact that like and again we i guess we get to like things like small worldness um networks that are basically co-located enough that they can converge on attractors and achieve coherence on the right time scale the idea of like if you're like way so the idea is like if you're way far away from like let's say like some sort of rhythmic attractor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.343,
    "end": 3339.773,
    "text": " is established that's calculating something like your sensorium or is entailing something like the inversion of your sensorium, on the timescales at which that sensorium is inverted, there might be an in and an out in terms of who is able to get their message in at a time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.353,
    "end": 3351.04,
    "text": "And it's possible that the systems he's identifying could be on the outside of it in terms of the timescales at which that causal closure occurs while still being completely necessary for their functioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.72,
    "end": 3352.5,
    "text": " I just don't think we know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.54,
    "end": 3363.584,
    "text": "And so the evidence is, you know, he would then push back and then say like, you know, oh, well, um, the, uh, let's see, uh, well, no, you know, I, I lesioned the insula and the emotions are still there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.964,
    "end": 3366.345,
    "text": "So there's your, and it's like, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.005,
    "end": 3368.446,
    "text": "Um, but, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.795,
    "end": 3393.207,
    "text": " I guess in a way, you might say that somewhat supports that quasi-synesthetics account I just said, but I find the lines of evidence that are cited to be notable, but none of them are quite convincing to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.707,
    "end": 3394.968,
    "text": "So for instance,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.457,
    "end": 3398.138,
    "text": " uh, like hydrocephalic, uh, children.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.779,
    "end": 3404.123,
    "text": "Like, you know, they're still showing these rich emotive displays, but the issue is though, uh, we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.723,
    "end": 3404.863,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.883,
    "end": 3406.684,
    "text": "Like it could be unconscious emotional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.724,
    "end": 3406.844,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.885,
    "end": 3407.665,
    "text": "We can't ask them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.925,
    "end": 3408.886,
    "text": "We don't know what it's like from the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.906,
    "end": 3418.573,
    "text": "Or then you might point to like, um, like decorticate rodents showing like, you know, rich, like, you know, adaptive emotional, uh, responses and, and sophisticated behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.173,
    "end": 3421.095,
    "text": "But once again, we don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3421.115,
    "end": 3421.595,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.675,
    "end": 3428.819,
    "text": " Or you might like drop an electrode and then stimulate these subcortical areas and then you get experience and the person reports to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.019,
    "end": 3431.9,
    "text": "But then the problem is, well, the cortex is intact then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.48,
    "end": 3439.084,
    "text": "And so how do you know if when you drop that electrode, like you stimulate the hypothalamus and then you got some sort of rage response or a lust response,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.844,
    "end": 3441.005,
    "text": " Was it that that was the realizer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.646,
    "end": 3462.944,
    "text": "Or is it, as I'm suggesting, that that was basically part of, you know, it was causally important for the whole thing to work, but not necessarily constitutive of the process that computes or realizes the quails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.264,
    "end": 3463.764,
    "text": "This is cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.904,
    "end": 3464.365,
    "text": "This is cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.47,
    "end": 3470.331,
    "text": " Yeah, I feel like there are two things going on, and I'd like to sort of see if we can converge them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.631,
    "end": 3484.274,
    "text": "So one is a kind of structural functional description, which is augmenting or just providing color to Mark's view, which is that we need these kind of recursive loops back to the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.334,
    "end": 3489.895,
    "text": "It needs to enslave, you know, these subcortical structures need to enslave the cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.835,
    "end": 3493.396,
    "text": "Now, someone listening might go, but that's just a further description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.244,
    "end": 3521.504,
    "text": " functional structural anatomical explanation on the other hand you invoke kind of proto back to the homunculi these kind of proto-conscious agents we've got like whether that's a cell a cluster of cells and so on and you've spoken as well about how you know one of your your account of consciousness you know can be cast as a convergence of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.645,
    "end": 3525.509,
    "text": " active inference, and integrated information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.052,
    "end": 3536.423,
    "text": "Integrated information theory got some, well, it got some bad press earlier this year for being pseudoscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.825,
    "end": 3539.827,
    "text": "For those listening just on audio, I am doing speech marks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.045,
    "end": 3547.788,
    "text": " But one of the claims was that it was pandering in some sense to panpsychism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.109,
    "end": 3559.055,
    "text": "And perhaps an acute listener might be thinking, oh, Adam is maybe pandering a touch to panpsychism with his idea of lustful neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.345,
    "end": 3565.267,
    "text": " Where do your sympathies lie if we take this sort of broader philosophical position?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.448,
    "end": 3578.353,
    "text": "Where do your sympathies lie with panpsychism and let's just say more kind of, I think they're called conscious realist positions such as that of Donald Hoffman, for example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.453,
    "end": 3612.514,
    "text": " I'll regret saying this, but I think you could call me a panpsychist of sorts still in that of the sense of anything that somehow managed to think, and coming back to the good regulator theorem, on some level had to entail some sort of modeling information, whether it was the system and its interaction with the environment was the model or is a model that within it has models, but has to have some sort of tracking or predictive information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.035,
    "end": 3625.962,
    "text": " that allows it to basically resist the most temporarily, defy the second law while serving in everything it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.082,
    "end": 3632.646,
    "text": "But basically that, you know, you getting all mixed up and becoming maximally probable, a maximum entry distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3633.107,
    "end": 3634.267,
    "text": "Like, how'd you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.768,
    "end": 3636.529,
    "text": "You did something to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.549,
    "end": 3641.252,
    "text": "Sort of intelligence, some sort of thing like Amali, some sort of predictive information had to have been there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.752,
    "end": 3646.813,
    "text": " For you to pull off something a little bit like Maxwell Demon-esque, you know, to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.393,
    "end": 3658.976,
    "text": "And so, in that sense, I'd say I'm a pan-psychist in that, like, anytime we're pointing to things, anytime there's attractors, you might want to say there's something mind-like going on, something a little bit intelligent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.697,
    "end": 3661.097,
    "text": "But the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.757,
    "end": 3666.439,
    "text": " And you might even want to say some psychological kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.479,
    "end": 3673.342,
    "text": "We were talking about the individual cells, rage or lust.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.422,
    "end": 3677.864,
    "text": "Even those might be good ways of thinking about them in terms of describing their cybernetic significance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3678.005,
    "end": 3685.088,
    "text": "It's a coherent global change of state with a certain semantics that's linked to this modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.508,
    "end": 3688.79,
    "text": "And so if you think of mind as modeling,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3689.31,
    "end": 3696.113,
    "text": " And then as modeling with interest in a value-laden way, you might call that sentience then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3696.673,
    "end": 3700.815,
    "text": "But I guess I want to reserve this word consciousness for the, it feels like something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.595,
    "end": 3706.537,
    "text": "And there's something that it feels like from the inside to be that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.058,
    "end": 3714.341,
    "text": "And so all these systems would have a kind of dual aspect part to them because they would entail an information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3714.941,
    "end": 3736.416,
    "text": " and so you can say it's like well you know maybe everything that exists it's just like that's the way of describing the dual aspect nature of them um i think you can make a case for that but i still want though like um basically um okay so in and so in greater world modeling theory the the thing i attempted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.216,
    "end": 3766.031,
    "text": " was to take the major theories, specifically focusing on integrated information theory and the global workspace theory, and then basically use, you could say, probability theory or machine learning or the free energy principle with this idea of the system modeling its environment probabilistically as now providing the semantics and removing the question begging from these theories in terms of, or some of it, of why there should be something that it's like to be a complex of integrated information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.651,
    "end": 3771.354,
    "text": " or to have fame in the brain and to be within a global workspace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.735,
    "end": 3772.675,
    "text": "And so why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.176,
    "end": 3791.168,
    "text": "Well, if what that global workspace is doing is it's something like a very efficient architecture for some auto-encoding hierarchy, if it's like an arena for Bayesian model selection allowing for this iterative state estimation, well, then the questions are somewhat less bagged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.228,
    "end": 3794.15,
    "text": "Or if integrated information theory is describing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.831,
    "end": 3803.715,
    "text": " The nature of networks that can do interesting forms of compute, it's like, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.815,
    "end": 3814.101,
    "text": "Necessary conditions, likely this integrated information theory, they have these axioms that they look at that apply purportedly to all conscious experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.781,
    "end": 3818.664,
    "text": "And then they try to identify these, they postulate mechanisms that could realize them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.384,
    "end": 3830.346,
    "text": " And then the idea is if you start out going from these axioms that Kersh has all experience, you then create a precise and specific mapping to particular mechanisms that would allow for their realization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.966,
    "end": 3833.587,
    "text": "Now you can say this system's conscious and that one isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.967,
    "end": 3836.288,
    "text": "And maybe even this system is conscious in that way and not that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.188,
    "end": 3848.15,
    "text": "And I think it's really promising, but the issue I take is basically losing the explanandum of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.889,
    "end": 3855.19,
    "text": " our sensorium, our sense world, our embodied experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.89,
    "end": 3875.073,
    "text": "And so if what a complex of integrated information is doing is it's basically describing a system set up for a certain type of dynamics within it that could enable a certain type of message passing and inference and belief propagation and inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.633,
    "end": 3878.934,
    "text": "And specifically with the thing being entailed by such a system would be the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3879.934,
    "end": 3887.736,
    "text": " efficient inversion of a generative model over the sensorium of an body about an agent, now we're getting somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.296,
    "end": 3899.998,
    "text": "So the idea is saying, okay, so I guess I'm sympathetic to both sides in viewing integrated information theory as having some elements which are unsatisfactory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.982,
    "end": 3913.093,
    "text": " But, you know, I don't think it was particularly, I don't think what happened was particularly helpful in terms of neuroscience and, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.775,
    "end": 3918.675,
    "text": " for a variety of reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.775,
    "end": 3919.716,
    "text": "So the basic approach is this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.416,
    "end": 3935.119,
    "text": "What if you take the existing theories, the major ones, cross-reference their claims, look for points of overlap, and try to use basically degree of convergence and the forms of convergence and the coherence of those stories to adjudicate among different claims?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.58,
    "end": 3936.78,
    "text": "And so that was the basic method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.7,
    "end": 3945.142,
    "text": "And so you could think of, for instance, integrated information theory will talk about potentially there's a posterior hot zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.982,
    "end": 3947.603,
    "text": " as the substrate of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.324,
    "end": 3950.786,
    "text": "And, you know, for instance, I say that sounds about right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.346,
    "end": 3974.244,
    "text": "That for instance, like, you know, if basically the posterior, if you take these different sensory hierarchies all coming together into one multimodal hierarchy, and if you can get basically across that system, its ability to loop back on itself in a very powerful way, in a very, you know, both integrated but also differentiated way,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.325,
    "end": 3985.13,
    "text": " then you could think of that as basically that that could entail the inversion of a generative model over the sensorium of an embodied by the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.53,
    "end": 3986.391,
    "text": "Maybe that's what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.991,
    "end": 3997.696,
    "text": "You could also potentially think of this complex of information that has both integration where the network properties are set up to facilitate both integration and differentiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.356,
    "end": 4002.779,
    "text": "That actually has a lot of correspondences to workspaces, which balance integrated segregated functioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.579,
    "end": 4007.54,
    "text": " And so the ideas like that post-Seer hot zone could be thought of as a fairly global workspace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.421,
    "end": 4013.663,
    "text": "And with devils in details of exactly the kind of workspace it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.443,
    "end": 4017.564,
    "text": "And with me having some specific proposals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.384,
    "end": 4023.406,
    "text": "So then like, for instance, OK, so the workspace theory, they might come in with the claim like, no, no, you need the front of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.206,
    "end": 4026.207,
    "text": "And so the question is, well, what are we talking about exactly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.227,
    "end": 4026.967,
    "text": "Are we talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.948,
    "end": 4033.485,
    "text": " phenomenal consciousness, like the actual generation of your experiences from moment to moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.284,
    "end": 4041.328,
    "text": " Or are we talking about your knowledge of experience, your knowledge of your experience, your awareness of your ability to report on them and contextualize it in different ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.628,
    "end": 4043.609,
    "text": "Well, then you're probably right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4043.849,
    "end": 4045.59,
    "text": "The Bobo workspace theory is probably right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.91,
    "end": 4048.071,
    "text": "You need to get the frontal lobe in the mix to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.892,
    "end": 4053.995,
    "text": "Although at that point, though, by the time you're talking about things like that, you might even need more than the frontal lobe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.155,
    "end": 4060.258,
    "text": "We actually might be in an extended mind account in terms of what actually goes in to be self-reflective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.58,
    "end": 4068.548,
    "text": " We use the environment to offload memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.568,
    "end": 4074.275,
    "text": "The global workspace or play space might not even be Skullbound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.036,
    "end": 4075.536,
    "text": "But still, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.717,
    "end": 4088.507,
    "text": " The approach I took was basically to say that the different theories were bringing important contributions that all these brilliant people, these are all brilliant people who've given a lot of thought and have something important to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.527,
    "end": 4091.289,
    "text": "Then the question is, are they maybe using words differently?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.39,
    "end": 4097.374,
    "text": "In that debate earlier between integrated information theory and the global workspace theory, you had this recent adversarial collaboration signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.395,
    "end": 4097.535,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.973,
    "end": 4101.634,
    "text": " But it's not clear they were using the word consciousness in the same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.515,
    "end": 4106.817,
    "text": "Integrated information theory is talking about experience and phenomenality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.837,
    "end": 4109.818,
    "text": "Global workspace theory, sometimes it's like illusionist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.858,
    "end": 4113.54,
    "text": "Sometimes it's more of like a higher order thought type theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.56,
    "end": 4122.504,
    "text": "And they're oftentimes, not necessarily, but it's usually they're talking about, you'd say like conscious access as opposed to phenomenal consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.632,
    "end": 4130.501,
    "text": " So then the idea is that if you try to be more like, what are the precise claims that people are making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.922,
    "end": 4137.293,
    "text": "And you dig into them, a lot of the conflict might just be people not communicating enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.995,
    "end": 4161.474,
    "text": " and say like oh i meant this by that term and you meant that oh and instead there'd be just like one way we use words it might be that like the different ways we were using words had different trade-offs and maybe like to come together we have to like add qualifiers so instead of like we try to say this one word means this one thing maybe we use like um we need to use like two or three words to specify which world we're in and what we're talking what what our reference are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.094,
    "end": 4171.081,
    "text": " And then the claim I make is that once you do that, a good amount of the conflict actually is not as much as it seems like it needs to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4171.261,
    "end": 4178.987,
    "text": "Like you're actually significantly, like these different theories are actually to an important degree and a useful degree talking about different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4179.367,
    "end": 4179.567,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.028,
    "end": 4180.208,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.248,
    "end": 4180.448,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.488,
    "end": 4188.194,
    "text": "Well, you know, maybe there's a psychological account of the fact that scientists like, you know, they might pretend that they believe in collaborative thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.175,
    "end": 4202.751,
    "text": " work but there is there's a tendency or an inclination towards adversarial boundaries which are often incredibly constraining so no it's a good point and I think it's a good point as well about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.005,
    "end": 4229.626,
    "text": " much language really shapes again i don't mean this in some sapir wolf deterministic way but shapes the way that we view these um these models the way we view these debates i mean i think the most i think for me it comes back to to what you're talking about like right at the beginning that i could look at a rock and say well there's something kind of intelligent going on there it's tracking something you know it's doing some kind of variational bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.246,
    "end": 4237.81,
    "text": " I think the two most important words for someone coming into the free energy principle depends on the definition of free energy principle you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.171,
    "end": 4240.372,
    "text": "But my two favorite are looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4241.092,
    "end": 4252.619,
    "text": "So anything that has a Markov blanket and a non-equilibrium steady state attractor will look like it's conducting Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.339,
    "end": 4255.18,
    "text": "And the question of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.552,
    "end": 4280.978,
    "text": " what it is doing the process theory really gets opened up once you go oh the free energy principle is just you know it might well just be a descriptive tool and then we talk about active inference predictive processing variational message passing but i think this this looks like notion is often um forgotten and it's important to keep it in the back of our mind that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.504,
    "end": 4302.614,
    "text": " yes there is something quite miraculous about the coherence of a stone um but i guess every theory has its miracles um and the frailty principle is not it's it's not devoid of its axioms do you think that's a kind of reasonable thing to say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.198,
    "end": 4304.658,
    "text": " I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.698,
    "end": 4315.686,
    "text": "In general, what we're trying to do is minimize the number of deus ex machina, as we need to call it, and the number of miracles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.167,
    "end": 4320.15,
    "text": "You mentioned there were synthetic operatory categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.89,
    "end": 4323.292,
    "text": "You need something to build with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.312,
    "end": 4329.917,
    "text": "Also, in terms of what we're talking about with evolutionary priors and inductive biases, you need to start somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.657,
    "end": 4331.518,
    "text": "Something must be granted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.038,
    "end": 4353.357,
    "text": " you know but but like but let's try to like do the most we can with the least and so um and but but still those things that you um are granted you know in a way like there's a sense in which like you know they might be like they're the preconditions for proceeding at all and those are the miracles we need to go on and so there's like we end up like uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.399,
    "end": 4365.245,
    "text": " It's like for the case of like, yeah, like a rock and you get to say like, you know, yeah, it looks, yeah, I had a section I put into like the, like original and, and, and left it in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4365.685,
    "end": 4369.147,
    "text": "Maybe unfortunately, like the, like the, like the IWMT paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.868,
    "end": 4383.256,
    "text": "And I, I felt crazy writing it, but you know, and I think like, if I like emphasize this, like looks as if like, it feels less crazy and then say the rock is engaging in Bayesian inference to exist, you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.637,
    "end": 4391.459,
    "text": " I guess you could say there's a sense in which that's how it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.16,
    "end": 4395.901,
    "text": "At that point, I guess you're almost in a quasi-tautology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.821,
    "end": 4400.563,
    "text": "Here's the phase-space description of the rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4401.303,
    "end": 4412.627,
    "text": "I guess you could say if you keep looking at it, well, I guess the rock, though, it might be we need something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.295,
    "end": 4415.977,
    "text": " It might not work for the rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.799,
    "end": 4428.469,
    "text": "You need something where that density of the thing, that you can point to it, and there's a combination of the solenoidal flow and gradient flow where the thing is picking itself back together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.489,
    "end": 4430.571,
    "text": "Like a drop of oil.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.591,
    "end": 4432.493,
    "text": "Yeah, like a drop of oil that grabs itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.573,
    "end": 4432.974,
    "text": "Yeah, that, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.587,
    "end": 4440.97,
    "text": " So once you do that, isn't that kind of like, I guess that's Carl's 2019 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.531,
    "end": 4445.513,
    "text": "Then it's like a sense of like, you can say like, well, that actually is Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.114,
    "end": 4448.876,
    "text": "And there's like where you expect to find it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.916,
    "end": 4450.697,
    "text": "There's a thing like as a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4451.137,
    "end": 4454.02,
    "text": "And then if you just look at its action, it's doing Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.62,
    "end": 4456.942,
    "text": "And then either like, well, is that a tautology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.362,
    "end": 4457.622,
    "text": "Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.303,
    "end": 4461.585,
    "text": "But it's a damn interesting tautology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.605,
    "end": 4461.825,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.946,
    "end": 4473.11,
    "text": " Yeah, yeah, no, it's, uh, I remember hearing Carl first on Lex Friedman's podcast talking about a drop of oil, kind of my first proper exposure to free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.15,
    "end": 4482.373,
    "text": "And I just, I just couldn't think, I didn't believe that drops of oil or rocks or molecules could be so interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.303,
    "end": 4489.265,
    "text": " And you're right, science, I don't know who said it, but science is about making the familiar unfamiliar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.985,
    "end": 4495.707,
    "text": "And we're certainly making rocks and drops of oil pretty unfamiliar when we're talking about them conducting variational Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.988,
    "end": 4497.688,
    "text": "There's somebody who might be interesting to talk to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4497.728,
    "end": 4500.189,
    "text": "He wrote a paper on the world as neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.229,
    "end": 4504.611,
    "text": "And so I think he would potentially get to this issue of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.249,
    "end": 4520.821,
    "text": " Is there just, like, a way in which, like, you could just make, like, the ontological claim, like, the rock is... Like, he would do, I think, a good job of, like, making a case for that potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4520.841,
    "end": 4521.201,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.662,
    "end": 4522.442,
    "text": "I'll check out the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.482,
    "end": 4529.268,
    "text": "I mean, yeah, I mean, for me, this... The question that I literally started this podcast with still stands, which is if we take the drop of oil...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.192,
    "end": 4535.446,
    "text": " it's it's it's kind of yes can be seen as calculating a posterior um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4538.021,
    "end": 4540.542,
    "text": " But what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.562,
    "end": 4542.143,
    "text": "Like, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.183,
    "end": 4554.909,
    "text": "Like, what is doing the calculation and what's it doing a, like, what's the P of itself given its environment is just really high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.929,
    "end": 4561.232,
    "text": "I mean, once you sort of break that down, it just becomes, it seems to me to just return back to a descriptive account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.252,
    "end": 4561.772,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.037,
    "end": 4566.658,
    "text": " rather than a process theory of what the drop of oil is actually doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.738,
    "end": 4580.463,
    "text": "So I think where a lot of active influence confusion comes from is that we struggle conceptually to get away from a Cartesian ego model when we're thinking about how we are and how the world is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.443,
    "end": 4592.954,
    "text": " So it's, it's tempting perhaps to think that there's a little homunculus within the drop of oil, grabbing itself together and maximizing model evidence for itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.254,
    "end": 4606.406,
    "text": "But that was, by the way, I'm not saying that either, but it's, um, it might be tempting for some let's, um, let's get psychedelics because you're at Johns Hopkins, which is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.487,
    "end": 4628.543,
    "text": " the kind of place to be in terms of psychedelic research i think a useful place to start not only for myself but for our audience is people might have a sense of the history of psychedelics in science um and the long history and the taboo and the fact that now these experimental studies are taking place and the taboo is lifting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.344,
    "end": 4636.849,
    "text": " Perhaps you could kind of give a brief history, if possible, of the history of psychedelics in science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.989,
    "end": 4642.592,
    "text": "You don't have to go back to shamanic cultures, but if you feel so inclined, I shan't stop you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.913,
    "end": 4644.613,
    "text": "I mean, that actually is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.904,
    "end": 4669.903,
    "text": " I'm working on a paper right now of the deep history of psychedelics, going both back to shamanic cultures but before in terms of the evolution of the signaling systems that they appear to primarily act upon, in particular the 5-HT2A serotonin receptors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.724,
    "end": 4674.447,
    "text": "Psilocybin is an agonist of that receptor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.887,
    "end": 4676.208,
    "text": " That particular receptor class.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.849,
    "end": 4697.002,
    "text": "There's a paper I just recently revised and resubmitted called ALBIS, or Altered Beliefs Under Psychedelics, which basically it's providing, I guess you might say, a heterodox account of psychedelics with an active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.403,
    "end": 4700.745,
    "text": "I read the preprint, so I'm familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.765,
    "end": 4700.845,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.701,
    "end": 4708.583,
    "text": " So I guess we'll get to that in a bit, but that's where the focus has been.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.403,
    "end": 4719.387,
    "text": "But the current paper would be like, why is it that we have psychedelic experiences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.787,
    "end": 4727.93,
    "text": "You might say, maybe in a deflationary sense, you could say like Pinker would talk about music is cognitive cheesecake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4728.81,
    "end": 4737.055,
    "text": " If you try to look for an adaptive story about music, you could try, but it's just like, no, there isn't really one that's that meaningful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.055,
    "end": 4742.778,
    "text": "The adaptive story of cheesecake is like, it's a super stimulus that's created because of this, this, and the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4743.358,
    "end": 4745.379,
    "text": "But there is no evolutionary account of cheesecake.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.399,
    "end": 4746.44,
    "text": "It's a latecomer to the scene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.02,
    "end": 4752.123,
    "text": "And so it's a deflationary account of music would be like, there's no specific music adaptations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.643,
    "end": 4755.105,
    "text": "It's just like a super stimulus we create for ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.785,
    "end": 4760.368,
    "text": " you know, because of other things that we need and other aspects of our cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.828,
    "end": 4778.258,
    "text": "And so with psychedelics, you could say like, you know, these drugs just happen to be like, you know, a super stimulus that's like created, you know, maybe by plants to defend themselves against predators in terms of, you know, you don't want to quite, you know, you have to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4780.499,
    "end": 4794.003,
    "text": " either repel, and so maybe breaking the good regulation, like making the thing do anomalous inference could be a good way of repelling your predators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4795.104,
    "end": 4800.725,
    "text": "Or you might want to potentially entice in terms of there's some symbioses that exist in terms of things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.966,
    "end": 4801.946,
    "text": "Was it reindeer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.886,
    "end": 4810.033,
    "text": " I don't know if this has been established, but like, you know, possibly like by consuming things like, was it like, was it lichen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.053,
    "end": 4816.859,
    "text": "I forget what it is, but like fungi, like it might like help them to be more like exploratory in certain parts of their like seasonal cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.559,
    "end": 4822.684,
    "text": "And so then there's like a symbiotic relationship and you're actually enticing the organism to come in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.658,
    "end": 4829.122,
    "text": " But actually, that's a very live question of the deep history of psychedelics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.142,
    "end": 4846.033,
    "text": "And the place I'm trying to go in this upcoming paper is to argue that it seems like the receptor system itself might have evolved, I'm claiming, actually in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.733,
    "end": 4847.974,
    "text": "So the count of psychedelics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.491,
    "end": 4853.032,
    "text": " in the free energy principle that I think that's most well known would be called the Rebus model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.673,
    "end": 4855.093,
    "text": "Relaxed beliefs under psychedelics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.713,
    "end": 4858.795,
    "text": "And the idea being that psychedelics are relaxing your Bayesian priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.375,
    "end": 4869.939,
    "text": "And so with your prior expectations relaxed, you are now free to think different thoughts and be updated by the world, experience it more profoundly, and be changed by it more profoundly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.539,
    "end": 4876.702,
    "text": "And so I've been trying to nuance that account and saying that that might be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.449,
    "end": 4886.878,
    "text": " part of what happens as part of like very high degrees of 5H2A agonism, and that you do get something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4887.479,
    "end": 4893.586,
    "text": "But that might not be the cybernetic significance of the 5H2A system as a control parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.003,
    "end": 4899.204,
    "text": " In many ways, it might actually be exactly the opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.504,
    "end": 4908.227,
    "text": "They first evolved with a gene duplication event around the Cambrian explosion, around with the advent of jawed fishes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4908.467,
    "end": 4921.27,
    "text": "One of the speculations I make is actually, and this might be predator-prey arms races, where someone can basically, if you can specifically bite, then this now adds fuel to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.69,
    "end": 4927.013,
    "text": " a certain fire of like, I can now go up and precisely swim and bite and kill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4927.514,
    "end": 4937.04,
    "text": "And now you have an interest in being able to have that strong prediction that you use to basically enslave your inaction and achieve that goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.061,
    "end": 4948.348,
    "text": " And the stronger you can get a prediction, the more, you know, potentially within limits, the more reliably you'll converge on that goal as opposed to doing something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4949.028,
    "end": 4953.191,
    "text": "But then you might also have an interest on the side of prey of not being the person bitten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4953.951,
    "end": 4965.038,
    "text": "And so this idea of like turbocharging the organism, doubling down on the priors potentially as a way of allowing for specific goal pursuit, that might've been the original story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.559,
    "end": 4967.1,
    "text": "But where does this like rebus account come in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.58,
    "end": 4991.689,
    "text": " One of the speculations I'm making, it's a paper I'm writing in collaboration with Sue Carter, who studies oxytocin mechanisms, and there's a follow-up paper I'm writing before the other one is published with Matt Johnson, but is that actually orgasm and birthing might have been the original psychedelic experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4993.416,
    "end": 5002.376,
    "text": " And that actually, so you're basically relaxing the priors about the bounds of yourself and having greatly elevated plasticity and capacity for updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.837,
    "end": 5004.039,
    "text": "Why would you want something like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5005.199,
    "end": 5027.431,
    "text": " Those would be two cases where you'd want it, whether it's basically allowing a mother to care for the child long enough to help it to get past these early milestones, and also allowing potentially mating pairs to stay together long enough to help these hungry children to the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5029.528,
    "end": 5056.935,
    "text": " shit okay let's get into that then so what would the the kind so there's some coupling going on here in terms of this kind of turbo charging it's psych it's in a sense it's kind of psychologically adaptive to have really relaxed belief over yourself over kind of your self-model maybe even your autobiographical self-model um so as to facilitate um the advent of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5057.853,
    "end": 5078.783,
    "text": " another person into your life right so like people just qualitatively talk about how they now feel like this child is their purpose they're kind of secondary to this child in their life so what's the kind of what's the causal pathway and what's the chronology in this is it is it a genetic adaptation that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5081.32,
    "end": 5106.058,
    "text": " occurs kind of simultaneously with like modern childbirth is or whatever that looks like or is it um does it predate it and then get sort of exacted by um birthing start yeah birthing or does it come later down the line i don't know actually how you would examine that but what are you kind of claiming in that regard",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.607,
    "end": 5118.872,
    "text": " So the specific mechanistic pathways that were catalyzed in which ways, we got no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.252,
    "end": 5124.294,
    "text": "So for instance, there's all sorts of things that could contribute, like for instance,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.068,
    "end": 5129.13,
    "text": " There seems to be, for instance, the 2A receptor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.791,
    "end": 5134.574,
    "text": "In general, it's actually fairly insensitive relative to something like the 1A receptor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.115,
    "end": 5150.227,
    "text": "But if you take it and expose it to reduced blood pH or elevated acidity through something like hyperventilation or things like carbon dioxide or lactic acid accumulating,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.968,
    "end": 5151.889,
    "text": " then it gets potentiated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5152.39,
    "end": 5163.44,
    "text": "And so, for instance, during sexual activity, during birth, there will be a lot of heavy breathing over an extended period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.041,
    "end": 5166.643,
    "text": "And is that actually an accumulation of carbon dioxide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.663,
    "end": 5169.867,
    "text": "And actually, that's part of a mechanism of potentiating these receptors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5170.247,
    "end": 5170.547,
    "text": "Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5170.607,
    "end": 5171.188,
    "text": "We have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.708,
    "end": 5173.77,
    "text": "Could it involve something like endogenous DMT?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.12,
    "end": 5175.481,
    "text": " Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.661,
    "end": 5176.522,
    "text": "We have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5176.862,
    "end": 5181.648,
    "text": "Could it involve, as Sue is arguing, oxytocin and vasopressin in different combinations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.329,
    "end": 5183.03,
    "text": "Quite possibly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.231,
    "end": 5187.716,
    "text": "But we're just beginning that now in terms of the specific pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.497,
    "end": 5193.082,
    "text": "But in terms of when this might have occurred and some more things that could have been important...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5193.883,
    "end": 5205.552,
    "text": " I'm wondering if there were a couple waves of strong selection, one probably with the advent of mammalian reproduction and mammalian care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5206.392,
    "end": 5214.898,
    "text": "So once you're now having to, like we were going to earlier, don't eat your child, care for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5215.959,
    "end": 5220.783,
    "text": "And you've seen a lot of rodent species, it's actually a little bit tenuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5221.363,
    "end": 5222.223,
    "text": " That process, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.623,
    "end": 5224.324,
    "text": "Like the runt of the litter often gets eaten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5225.744,
    "end": 5230.906,
    "text": "You're not that far from the atavistic state of kind of like, eh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.686,
    "end": 5238.789,
    "text": "So to get this interest, I think Pat Churchland will actually talk about an extension of self-grooming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5240.509,
    "end": 5244.391,
    "text": "So for instance, you can maybe think of actually relaxing body maps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.231,
    "end": 5260.956,
    "text": " and then making them plastic for a time on the occasion of birthing or like for instance like during nursing and then like basically if you then include um the pup into the body or your offspring your body maps like that could get an account like that off the ground",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.177,
    "end": 5270.267,
    "text": " Or then once, for instance, to the degree you get parental investment, but this would then be like a mammalian story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.828,
    "end": 5276.455,
    "text": "In any of those species, there might have been strong selection on these proto-psychedelic pathways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.176,
    "end": 5291.24,
    "text": " And then for humans, it would be like all the things coming together in terms of having these big brains, extremely vulnerable, hungry offspring, which you have to care for for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5291.961,
    "end": 5302.724,
    "text": "Oftentimes also needing more than one because part of it also of the care is providing protection within the social hierarchy, teaching them things, two heads being better than one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.104,
    "end": 5312.028,
    "text": " And so having the bonding of the parents for the child and the parents to each other, now the selection pressure might be really strong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.488,
    "end": 5313.248,
    "text": "What was selected?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5314.529,
    "end": 5319.11,
    "text": "Something involving oxytocin, potentially, in connection with DMT, with other couples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.391,
    "end": 5319.911,
    "text": "We got no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5320.191,
    "end": 5320.871,
    "text": "But wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.411,
    "end": 5327.774,
    "text": "And then I guess the one more thing that could happen, not just in humans, but maybe particularly in humans,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.658,
    "end": 5331.629,
    "text": " It's our ability to, like, what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5331.689,
    "end": 5333.596,
    "text": "Jonathan talks about, like, the hive mind switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5334.318,
    "end": 5347.242,
    "text": " like our ability to actually have collective effervescence and to come into a group, a sense of group identity for the sake of basically doing things according to fashion, including beating out other groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5347.982,
    "end": 5350.723,
    "text": "And so there seems to have been strong selection on that in the human case also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.763,
    "end": 5362.767,
    "text": "And so the claim would be that these basically pressures for intersubjective coupling being particularly strong in humans might have been a source of why, for instance,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.348,
    "end": 5371.513,
    "text": " psychedelic experiences, we're probably not the only species to have them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.574,
    "end": 5388.766,
    "text": "But the idea being that at least the reasons that we know that we are sensitive to them, some of that could be because of that history of selection, because of those challenges of bonding between mating pairs, between parents and children, and potentially between tribe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.427,
    "end": 5392.249,
    "text": "Yeah, that is really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.884,
    "end": 5422.295,
    "text": " um it brings two things to mind um one is i don't know whether you've ever heard of the obstetrical dilemma um which is basically this idea that when humans went from being quadrupedal to bipedal the hips of the mother narrowed and what was happening is that there was a lot of uh stillborn deaths a lot of childbirth deaths because the hips were narrowing but the size of the baby's head stayed the same so a lot of children were dying and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.328,
    "end": 5423.749,
    "text": " childbirth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.909,
    "end": 5425.713,
    "text": "A lot of mothers are dying in childbirth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.214,
    "end": 5433.029,
    "text": "And so there was an evolutionary trade-off between early birth and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.971,
    "end": 5462.997,
    "text": " bipediality and so what actually happens is that children start to get born younger pregnancy is reduced in time to permit the narrowness of the hips that allows for bipediality which in turn sets the stage for caregiving and the fact that a child can't just pop out of the womb like a gazelle and go running so that's the one thing that comes to mind I'm going to include that in the next paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.04,
    "end": 5464.84,
    "text": " Or give me a shout out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.38,
    "end": 5481.245,
    "text": "Um, and then the second, and then the second thing that makes me think of is maybe this care domain, this fundamental need to expand body models, self models could be this kind of consciousness, synthetic a priori we were looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.965,
    "end": 5483.486,
    "text": "Maybe there's an adaptive pressure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.184,
    "end": 5491.746,
    "text": " to feel this kind of selfless love, agape, whatever you want to call it towards your offspring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.447,
    "end": 5501.089,
    "text": "So as you know, for evolutionary reasons, so that you are a caring altruistic caregiver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.07,
    "end": 5508.912,
    "text": "That's I think potentially very important for like, so this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.851,
    "end": 5523.466,
    "text": " In the evolution of cognitive modernity, there seems to be a kind of like chicken egg story or a slight dilemma where, you know, so like Chomsky, like, you know, talks about language for the service of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5524.026,
    "end": 5530.113,
    "text": "But like, and so I guess that he somewhat sidesteps his dilemma by saying like language is just useful for structuring thought right from the get-go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5531.474,
    "end": 5539.698,
    "text": " But let's say you aren't quite thinking that way, and language is about communication at first, or you think you need that to get language use off the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.519,
    "end": 5546.982,
    "text": "Well, then the question is, but if you need language use, who are you communicating to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5547.322,
    "end": 5552.205,
    "text": "Something that could basically scaffold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5556.284,
    "end": 5584.746,
    "text": " So in terms of the elaboration of forms of consciousness and maybe even potentially the precision and the, I don't know if you'd say richness, but even consciousness, phenomenal consciousness in its qualities, its ability to represent precise things, it seems like in kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5594.048,
    "end": 5615.25,
    "text": " It seems like if there's a use to being able to feel your feelings in a way where you can reflect on them, in a way where they can meaningfully impact your behavior, if that is helping to basically provide some of the selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5618.143,
    "end": 5625.569,
    "text": " for certain, I don't know if this thought works, but for certain complexifications of consciousness, that that could potentially help other places where you might have chicken egg problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5625.589,
    "end": 5626.91,
    "text": "Like it's a source of pre-adaptation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.851,
    "end": 5628.652,
    "text": "I guess is what I'm wondering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.613,
    "end": 5630.193,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.213,
    "end": 5632.335,
    "text": "I think that's exactly the line I was kind of shooting down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5632.976,
    "end": 5636.619,
    "text": "I mean, this is, yeah, wonderful, wonderful ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.759,
    "end": 5645.426,
    "text": "I guess another question that comes to mind is when people think about psychedelics, they probably don't think about relaxed Bayesian priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.826,
    "end": 5646.427,
    "text": "They think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.929,
    "end": 5675.695,
    "text": " tripping for want of a better word the thing about hallucinations visions auditory um hallucinations as well so in terms of the sort of adaptive self-organizational um yeah uh functional utility of psychedelics that all makes sense where on earth do uh the sort of uh magic dwarves or uh recurrent patterns or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5676.115,
    "end": 5677.696,
    "text": " whatever Terence McKenna was talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.956,
    "end": 5682.437,
    "text": "What's going on there, and how does that complexify this story?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5683.538,
    "end": 5704.405,
    "text": "So before we get to machine elves, part of the heterodox psychological view, rather the heterodox active inference view on psychedelics, would be that potentially those types of phenomena as hallucinations or some forms of, you might say, psychotomimetic cognition, or like the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.605,
    "end": 5710.249,
    "text": " You know, the entertaining of a thought that you would not normally entertain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5710.669,
    "end": 5716.994,
    "text": "You might think to be crazy under other circumstances, but that is there live in your mind that you can maybe think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.834,
    "end": 5724.879,
    "text": "In some ways, it seems to have like almost the shape of a schizophrenic delusion or like a proto psychotic delusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.321,
    "end": 5736.072,
    "text": " So, you could potentially argue for these as a relaxation of high-level constraining beliefs, allowing those to be free-form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5736.592,
    "end": 5740.116,
    "text": "But you could also think of those as particularly strong priors also.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5740.657,
    "end": 5752.02,
    "text": " that you're imposing onto the world and not rather you're now saying, I think this is there, this is my expectation and I am not gonna let that be contradicted by sense data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5752.46,
    "end": 5758.441,
    "text": "And so there's an interpretation also in terms of a strengthening of belief of those phenomena you mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.801,
    "end": 5762.122,
    "text": "And one of the points I'm trying to make in the paper is I don't think we know how to think about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5763.563,
    "end": 5778.852,
    "text": " It's probably some complex admixture of relaxed and strengthened beliefs, both directly and indirectly, in different combinations, where I'm trying to say that rather than ever saying psychedelics do X,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5779.893,
    "end": 5793.986,
    "text": " I want to replace that with this psychedelic, this particular compound at roughly this range of doses does this to this kind of person with these kinds of settings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5794.887,
    "end": 5810.23,
    "text": " And the idea of saying that like, but the idea of like taking inspiration from Rebus is like relaxably speaking an essential feature in some ways and looking to adjusting of your priors and your mind is this like belief ecosystem as a fruitful way of like contextualizing psychedelic functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5810.731,
    "end": 5816.756,
    "text": " but then saying moving beyond relaxed beliefs, talking about both strengthened and relaxed in direct and indirect ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5817.277,
    "end": 5831.469,
    "text": "But to come along to DMT elves, that would be like an example of like, so you can say, you can maybe think of that in a relaxed belief story and that for instance, elves do not exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5832.21,
    "end": 5848.217,
    "text": " And now I've relaxed certain aspects of my ontology, and now I've made room for these imaginings to arrive in a vivid form because I relaxed beliefs at this high level of certain core schemas that tell me what I should expect in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5848.718,
    "end": 5852.98,
    "text": "Now I've made room for psychedelic elves, for instance, or entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5853.88,
    "end": 5858.783,
    "text": " You could also tell a story, though, that these are actually kind of coming back to core knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5859.623,
    "end": 5865.086,
    "text": "Things like agenthood or agency are things like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.519,
    "end": 5875.645,
    "text": " but maybe not even core knowledge, like just early lessons in the learning curriculum and ongoing ones of just, we expect agents in the world because that's the primary thing we're encountering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.665,
    "end": 5877.106,
    "text": "That's our primary niche is each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5877.666,
    "end": 5883.391,
    "text": "And so then basically for the beliefs, so like in a strengthened account, you could say, let's say you're strengthening your beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.211,
    "end": 5889.696,
    "text": "Maybe that you're getting a direct strengthening of these priors for agency detection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.436,
    "end": 5891.558,
    "text": " Are they evolutionary priors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5892.158,
    "end": 5893.38,
    "text": "Are they developmental priors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.201,
    "end": 5894.661,
    "text": "We have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5895.663,
    "end": 5905.194,
    "text": "In my thinking, they tend to be more developmental, but it's a spectrum of how much evolution shaping went into them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.535,
    "end": 5908.939,
    "text": "As our conversation earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.605,
    "end": 5918.669,
    "text": " Um, yeah, also I, I stumbled across, uh, you saying just these words, which really caught my eye archetypes as core priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5919.469,
    "end": 5923.29,
    "text": "And I thought, oh, that's fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5923.33,
    "end": 5924.411,
    "text": "What a lovely way to put it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.731,
    "end": 5925.671,
    "text": "I mean, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5925.731,
    "end": 5928.452,
    "text": "So I, this is just, this is really, really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5928.472,
    "end": 5931.373,
    "text": "Um, really exciting, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5932.234,
    "end": 5937.796,
    "text": "So, so just to piece together the scaffold together, the chronology, the causality, the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5938.956,
    "end": 5942.157,
    "text": " Let's just try and put it all back together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5942.278,
    "end": 5956.784,
    "text": "So if the original psychedelic experience, let's say, was childbirth or orgasm, how does this end up... Is it just a coincidence that this ends up in plants?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5960.086,
    "end": 5962.447,
    "text": "And if it is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.013,
    "end": 5976.349,
    "text": " is it informative that it was happening in childbirth or, um, orgasm, or is that just kind of a, as I was saying, like a coincidental feature of the activation of this receptor?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.891,
    "end": 5977.971,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5978.854,
    "end": 5987.782,
    "text": " Because the argument that you said there was earlier, which is that it's a kind of defense mechanism or a kind of attractor towards symbiosis is quite convincing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5988.663,
    "end": 5999.813,
    "text": "I guess we have to fold into all of this, the shamanic cultures, and then the kind of more modern therapeutic lens on psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6001.114,
    "end": 6005.238,
    "text": "Is there a way of coalescing those seemingly disparate strands?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.454,
    "end": 6024.679,
    "text": " So for plants, there's the impact that these signaling molecules, these different ones, would have on the plant itself and then on the other systems that would interact with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6025.339,
    "end": 6033.922,
    "text": "So for instance, the 1A and the 2A receptors will tend to have different impacts on cytoskeleton dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.702,
    "end": 6037.864,
    "text": " And so let's say you want to do something like a phototaxis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6038.745,
    "end": 6052.293,
    "text": "That actually, it seems, will involve some, if I'm remembering correctly, I should remember this precisely, but there might even be like, you can think of it like changing the cytoskeleton dynamics to allow for greater fluidity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6052.914,
    "end": 6057.697,
    "text": "You can maybe think of that as like a kind of belief relaxation for morphogenetic inference of the plant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6058.277,
    "end": 6064.904,
    "text": " So it's like, you can, you can think of the plant as like, you know, you know, doing a photo taxes and you say, no, I'm here now I'm there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6064.924,
    "end": 6071.33,
    "text": "You know, maybe you think of that as like a kind of like, um, uh, updating for the plant itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6072.248,
    "end": 6083.351,
    "text": " And maybe that's even part, very speculatively, of why you fight it in something like a cactus, where that's actually kind of a harder thing because you're blockier and something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.091,
    "end": 6085.912,
    "text": "But then the other aspect would be the defense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6086.052,
    "end": 6093.914,
    "text": "Another reason you might have it in something like a cactus is because if you're in the middle of the desert and you're juicy, you're extra tasty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6094.174,
    "end": 6095.194,
    "text": "There isn't a lot of game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6095.214,
    "end": 6095.775,
    "text": "There aren't a lot of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6097.375,
    "end": 6123.773,
    "text": " know contenders in town for things to eat there's actually plenty everywhere but still you're you're a target and you're stationary um by and large you know so then like you know the which predators were they targeting it's like like insects um you know oh what's happening to the belief dynamics in the insect and so you know at that level you know maybe you know it's largely a uh um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6126.093,
    "end": 6139.22,
    "text": " a rebus account of these 5C2A agonists for the insects, potentially in terms of changing their normal behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6139.24,
    "end": 6143.062,
    "text": "I'm not sure how you would think of it there, but the idea of someone nibbles on you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6144.523,
    "end": 6152.169,
    "text": " It might be good for them to go away, become more exploratory, and maybe even mate like crazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6152.809,
    "end": 6155.912,
    "text": "You actually see stuff like this in locusts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6156.152,
    "end": 6163.578,
    "text": "They're colonized by hallucinogenic fungi, which can be part of their mating cycle and is part of this period of intense mating they undergo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6164.278,
    "end": 6168.061,
    "text": " And so, you know, the question is like, why not just poison them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6168.421,
    "end": 6171.004,
    "text": "You know, maybe it's just like, this was like the best poison you came up with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6171.024,
    "end": 6174.246,
    "text": "It was good enough and it just did the job and it arrived by some means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6174.847,
    "end": 6181.032,
    "text": "And just the form of poisoning is taking the model the organism has by which it is adaptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6181.572,
    "end": 6188.578,
    "text": "You relax that model, but that's not necessarily a good thing for that insect, especially, you know, with its body weight, you know, it's eating a lot of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6189.218,
    "end": 6193.382,
    "text": "And so the idea of that insect, if its models are really altered,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6194.082,
    "end": 6203.95,
    "text": " And if those models are trying to constrain all the different ways that system can bifurcate to be more homogenous as response in adaptive ways, you don't come out necessarily ahead by doing that adaptively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6203.97,
    "end": 6209.474,
    "text": "And so that's just the way insects figured out or their plants figured out how to protect themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6210.135,
    "end": 6212.297,
    "text": "And the point is the attack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6213.177,
    "end": 6214.558,
    "text": "But maybe it's not even an attack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6215.759,
    "end": 6217.22,
    "text": "Maybe it's like you want...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6221.019,
    "end": 6226.663,
    "text": " It's fine if you nibble on me, just don't nibble too much, but just go away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6227.343,
    "end": 6234.829,
    "text": "And then if we have this nice relationship of you don't bother me too much,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.03,
    "end": 6238.692,
    "text": " you know, maybe I even like you to be around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6238.712,
    "end": 6240.653,
    "text": "Maybe I even like that I facilitated your mating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6240.954,
    "end": 6243.316,
    "text": "And I like that your genes are more prevalent than the next generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6244.016,
    "end": 6247.299,
    "text": "So yeah, I guess, and then coming to, you know, shamans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6247.579,
    "end": 6251.382,
    "text": "Well, before, before you do just, I'm curious about what you think about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6251.402,
    "end": 6255.826,
    "text": "Cause just like add maybe a technical instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.866,
    "end": 6259.569,
    "text": "I'm curious about what you think from a rebus account in the, in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6260.49,
    "end": 6266.274,
    "text": " Because you mentioned exploratory behavior there, or epistemic foraging, which I thought was really an interesting allusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.155,
    "end": 6287.63,
    "text": "Because in both cases you offered there, there's a move towards epistemic behavior, either whether it's mating, or go away in an aversive manner, or go away and, like the reindeer example, spread me around, basically, in a kind of weird way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.394,
    "end": 6312.073,
    "text": " right yeah yeah well that's worse go forth right and what that screams to me is so it's just in in the sense of like the actual computational modeling in pom dp schemes is an emphasis over expected utility would be sort of high precision over your b and c schema um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6313.291,
    "end": 6318.493,
    "text": " and an E as well, your priors over action, your habits, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6319.593,
    "end": 6339.439,
    "text": "And maybe what's happening here, again, it's a completely nascent thought that I haven't given much, obviously, fall to, is that you're relaxing your prior beliefs about the consequences of your action, thereby making every single possible action policy equal in terms of epistemic utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6340.1,
    "end": 6358.148,
    "text": " which means that you then do some sort of Janesian maximization of entropy, which makes the best, in terms of just the expected free energy formula, makes the best action policy that which maximizes information gain and or test model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6359.208,
    "end": 6369.553,
    "text": "So I'm wondering whether that speaks to you in terms of a kind of technical unpacking of what might be happening at a very low level here with insects and cacti.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6372.768,
    "end": 6377.832,
    "text": " It would fit well with changing migration patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6378.833,
    "end": 6380.254,
    "text": "I think it would fit really well with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6381.054,
    "end": 6386.999,
    "text": "In terms of thinking of human use cases, it seems like it's a mixture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.099,
    "end": 6394.404,
    "text": "For instance, sometimes specifically would be for...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6395.825,
    "end": 6401.348,
    "text": " you know, breaking out of some state you're caught in, like you go to the shaman and this is part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.828,
    "end": 6409.512,
    "text": "But, but oftentimes it would be like with a very specific interest in mind, like, um, who someone cursed my cow, who is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6409.932,
    "end": 6414.675,
    "text": "You know, or, or like, but, or, or sometimes it would be like, um, uh, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.198,
    "end": 6433.347,
    "text": " So sometimes it seems like it is a good amount about like the epistemics in terms of like trying to maximize learning and breaking you free from like the thing that is usually owning you from within, you know, like your usual way of achieving your goals, keeping you stuck in a certain pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6433.867,
    "end": 6438.269,
    "text": "And then it's like, you need to learn something different, but how are you gonna learn something different if you're always doing the same thing again and again?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.969,
    "end": 6443.492,
    "text": "And so I think that fits for a lot of the, like a lot of the healing uses",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6444.432,
    "end": 6448.293,
    "text": " that accompany like an ayahuasca ceremony, that seems like a good description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6448.853,
    "end": 6460.396,
    "text": "But there are like other use cases, like for instance, like in these Amazonian tribes, like it's actually like specifically pragmatic in that like they do it to get the hunting party together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6461.076,
    "end": 6464.837,
    "text": "And like they're about to go to war with a specific other tribe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6465.378,
    "end": 6470.239,
    "text": "Well, then you could also make a case of like, you know, is it that like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6471.4,
    "end": 6491.839,
    "text": " their like their goal of what they want to do when they encounter the other tribe you want that to be presented in a very vivid form that imagining you want that counterfactual to be hyper precise so that becomes actual or is it um more like a matter of like this kind of collective effervescence from earlier and you actually want to read this account so that before you go into battle you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6492.239,
    "end": 6499.441,
    "text": " You're basically, you know, all one body coordinating together, fighting, you know, having each other's backs or both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6499.981,
    "end": 6508.143,
    "text": "And you want, you know, an early stage of something rebus-like and then maybe a later stage of something more involving belief strengthening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6508.183,
    "end": 6518.106,
    "text": "So it's like sometimes you're letting go of the pragmatics and sometimes you're actually like holding it on to the pragmatic values specifically zooming into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6520.007,
    "end": 6544.727,
    "text": " It seems like, at least in the human case, there is no singular account, but in terms of what you're saying about things like the case of migration patterns and an animal being changed, that seems like relaxing the pragmatics and allowing the epistemics to more optimization for that, that could be a really important part of that, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6544.867,
    "end": 6545.047,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6545.933,
    "end": 6546.273,
    "text": " Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6546.674,
    "end": 6553.418,
    "text": "Yeah, I mean, we haven't got too much time left, but I guess two more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6553.878,
    "end": 6555.439,
    "text": "One, totally trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6555.459,
    "end": 6556.9,
    "text": "The other one, not trivial at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6556.92,
    "end": 6558.201,
    "text": "So I'll start with the non-trivial one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6560.082,
    "end": 6565.586,
    "text": "At Johns Hopkins, you're really at the heart of the current uptick in psychedelic research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6566.547,
    "end": 6575.173,
    "text": "Are you, well, just to frame this, I sense from an external perspective, there was a great deal of excitement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6576.293,
    "end": 6578.855,
    "text": " you know, starting five, six, seven years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6579.875,
    "end": 6591.282,
    "text": "And maybe now there's a slight conservatism that's crept in and saying, okay, the psychedelics might not be the panacea that we hoped it might have been seven or eight years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6591.482,
    "end": 6592.663,
    "text": "Again, I'm not on the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6592.703,
    "end": 6594.764,
    "text": "I don't know, but that's just my instinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6596.565,
    "end": 6604.57,
    "text": "What are your kind of predictions, expectations, level of optimism with respect to psychedelic therapy in the next 10, 20, 30 years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6607.496,
    "end": 6613.193,
    "text": " Um, I have some, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6615.871,
    "end": 6639.343,
    "text": " So if we can avoid the very live possibility of backlash as adverse outcomes happen inevitably and they will be more notable, like with driverless cars, even if on net they're saving lives, you will note those cases where it just slams into a person and that'll change everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6639.383,
    "end": 6643.205,
    "text": "And so it doesn't take many people to have some really bad experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6644.185,
    "end": 6670.271,
    "text": " um they even see like with the recent like uh matthew perry like what happened with him oh yeah and that really is um actually really deeply responsible for everyone involved because um i don't want to say that you know like ketamine's you know uh not a mixed uh like it's powerful medicine and but uh and in that case like um you see the shape of it there's already like people are interpreting this as oh ketamine is dangerous and already this is causing people to call for more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6671.932,
    "end": 6678.957,
    "text": " of a pullback, but he was also on a good dose of an opiate, probably had some drinking system, and was in a hot tub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6681.038,
    "end": 6685.921,
    "text": "So it's like, did he die of respiratory depression and then drown?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6688.703,
    "end": 6696.389,
    "text": "So things like that could happen, and it doesn't take many of those for the psychedelic renaissance to really be pulled back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.989,
    "end": 6702.699,
    "text": " and try to make these potential life-changing medicines and interventions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6703.764,
    "end": 6712.67,
    "text": " Oh, by the way, whenever I'm speaking, it's outside of a Hopkins position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6713.851,
    "end": 6726.219,
    "text": "So speaking from the outside, they have a particular role, I'd say, in the psychedelic renaissance of doing largely conservative work within a mainstream medical model and trying to say, can we push forward that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6726.779,
    "end": 6731.823,
    "text": "And how can we approach these medicines safely and responsibly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6732.623,
    "end": 6736.707,
    "text": " And so they tend to be, I'd say, more conservative in what they're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6736.947,
    "end": 6738.268,
    "text": "And it's a very valuable function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.009,
    "end": 6743.093,
    "text": "And in general, they try to be very careful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6743.133,
    "end": 6744.694,
    "text": "I'm a little less careful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6746.195,
    "end": 6756.725,
    "text": "So some of the open questions and challenges we have is what...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6759.864,
    "end": 6762.745,
    "text": " I guess you say business models or how can we scale psychedelic therapy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6763.246,
    "end": 6769.609,
    "text": "So one of the problems with like a psilocybin intervention is they're amazingly expensive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6770.469,
    "end": 6773.211,
    "text": "And so the question is like, how can we get like broad access to them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6773.251,
    "end": 6779.074,
    "text": "You need some sort of like group therapy and like a different model than the ones we currently use just to make the economics work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6779.594,
    "end": 6782.375,
    "text": " to make this an available one, a widely available intervention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6783.096,
    "end": 6804.787,
    "text": "The other question is if you remove some of the expectancy effects you would get from the places where these interventions were done and having it done at Johns Hopkins or the Good Friday experiment in Harvard, there's a certain trust and authority which is interacting with this as part of leading up to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6804.807,
    "end": 6807.268,
    "text": "That's part of the expectation that you will be so changed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6807.928,
    "end": 6812.291,
    "text": " And so if you then try to have clinics opening up everywhere, do you get the same effect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6812.351,
    "end": 6818.274,
    "text": "Because you'll have the reports as some of the five most meaningful experiences in a person's life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6818.774,
    "end": 6820.295,
    "text": "A few sessions, your life has changed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6820.776,
    "end": 6831.922,
    "text": "And to what extent can we still get outcomes like that as we move into basically scaling and having more institutions and more context and do so safely?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6832.642,
    "end": 6836.144,
    "text": "One of the things I'm actually very excited about is I have some friends in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6837.185,
    "end": 6843.428,
    "text": " pharmaceuticals who are basically creating analogs of these psychedelic compounds to try to change their properties slightly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.088,
    "end": 6848.27,
    "text": "And so one of them is like, for instance, shortening their duration of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6848.29,
    "end": 6849.451,
    "text": "Like, well, why'd you want to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.311,
    "end": 6858.835,
    "text": "Well, let's say like you could show up for a therapist and you can do basically MDMA therapy and be sober again in two hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6860.415,
    "end": 6869.818,
    "text": " And so that would both allow you basically to do it more flexibly, and do it more times potentially, and with less risk from the dose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6869.918,
    "end": 6875.239,
    "text": "Because things like excitotoxicity will be a function of both the dose and the duration of effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6875.719,
    "end": 6881.461,
    "text": "And so if you reduce that duration of effect, things like metabolic strains, you would reduce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6881.501,
    "end": 6885.141,
    "text": "So those advances, I think, are going to be a complete game changer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6887.482,
    "end": 6896.592,
    "text": " these short-acting, powerful compounds, I think psychiatry will not be the same once those are on the scene, and just countless lives will be saved and transformed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6896.953,
    "end": 6897.533,
    "text": "Fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6897.994,
    "end": 6900.296,
    "text": "So, yeah, and so there's a lot of, like, things are very fraught, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6900.537,
    "end": 6905.402,
    "text": "You know, we could have something like a couple bad outcomes could cause, like, a chill on the whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6906.323,
    "end": 6909.926,
    "text": " But the promise, if we could just make it through this crucible, I think it's unbelievable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6910.526,
    "end": 6911.027,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6911.327,
    "end": 6912.107,
    "text": "Well, that's exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6912.548,
    "end": 6929.66,
    "text": "And then my super trivial question, especially even more trivial given that response, is ayahuasca is famously kind of an enigma because it's... You may correct me on my biochemistry here, but isn't it...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6930.661,
    "end": 6940.55,
    "text": " DMT mixed with a plant among the hundreds of thousands of plants that are found or could be found in the Amazon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6942.171,
    "end": 6951.019,
    "text": "What's your Joe Rogan-esque thoughts on how on earth they managed to synthesize ayahuasca?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.898,
    "end": 6955.823,
    "text": " You have your edible TMT, but that'll be broken down in a hot minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6956.503,
    "end": 6960.848,
    "text": "And so you need to find basically this monominoxidase inhibitor to keep it going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6961.469,
    "end": 6964.953,
    "text": "But among all the different things you could have tried, how did they find the right one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6965.573,
    "end": 6967.776,
    "text": "The shamans will totally tell you the plants told us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6968.637,
    "end": 6969.317,
    "text": "That's how they did it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6969.337,
    "end": 6969.998,
    "text": "That doesn't help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6972.1,
    "end": 6986.256,
    "text": " I guess, you know, I'm hoping, I don't know, maybe we should get like Joe Heinrich on the job and like basically some sort of computational model of like the process of like trying out the permutations of like what shamans do normally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6986.276,
    "end": 6987.057,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6987.837,
    "end": 7013.342,
    "text": " uh maybe it's actually tractable in terms of like if you see just what they're doing it's like yeah they were going to find that given what they were doing in like over over 200 years you would expect this percent that they found it so i would expect something kind of like that or maybe the plants told them or maybe the plants told me yeah maybe adam that was that was amazing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7014.269,
    "end": 7015.23,
    "text": " I'm kind of mind blown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7017.032,
    "end": 7017.672,
    "text": "That was awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7017.933,
    "end": 7018.613,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7019.554,
    "end": 7027.963,
    "text": "I mean, with every guest, I always feel like I learn just infinite sums of new information, which makes this so much fun for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7029.064,
    "end": 7030.285,
    "text": "But no, I really thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7030.305,
    "end": 7031.586,
    "text": "I know you're a busy man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7031.766,
    "end": 7035.05,
    "text": "And so I'm very grateful for you giving me two hours of your time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7037.671,
    "end": 7038.211,
    "text": " It was a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7039.151,
    "end": 7041.492,
    "text": "We're going to keep digging away at these questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7043.233,
    "end": 7047.895,
    "text": "But yeah, for me and the Institute, yeah, it was an absolute pleasure on my part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7047.955,
    "end": 7048.535,
    "text": "So thank you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7049.195,
    "end": 7049.535,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7050.136,
    "end": 7051.316,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  }
]