[
  {
    "start": 2.039,
    "end": 22.123,
    "text": " okay it's July 29th 24 and we're in the first of the applying active inference sessions for the third week of the cohort six and Andrew is going to give some overviews and share from his recent tutorial so go for it perfect um thanks Daniel and um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 22.441,
    "end": 37.513,
    "text": " As I mentioned to the other session attendees today, I did have a bit of a full workday, so not fully prepped to to run through all this, but I am happy to present what I have and just kind of bear with me a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.036,
    "end": 43.065,
    "text": "I presented this tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.99,
    "end": 52.446,
    "text": " about a week and a half ago, July 17th at University of Pennsylvania for the 10th International Conference on Computational Social Science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.21,
    "end": 56.254,
    "text": "Wonderful experience doing that, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.314,
    "end": 62.185,
    "text": "Super cool to see some other folks doing active inference research at that conference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.266,
    "end": 73.467,
    "text": " And super great to meet some folks there, including Brennan Klein, who I believe has had some degree of affiliation with the Institute in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.848,
    "end": 80.781,
    "text": "And he is also a PI MDP package developer, one of many.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 81.318,
    "end": 84.303,
    "text": " got into contact with them while I was developing this tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.363,
    "end": 87.208,
    "text": "So it's just excellent having him in the room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 87.248,
    "end": 94.861,
    "text": "It seems I did their package some amount of justice in putting together this tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.203,
    "end": 98.567,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.547,
    "end": 101.792,
    "text": " The intention of this tutorial was multifold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.714,
    "end": 108.904,
    "text": "One, I myself am an intern at the Institute, and so I'm still learning a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 109.986,
    "end": 116.657,
    "text": "That said, I've been involved long enough to where I've been itching to learn much more about coding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 116.637,
    "end": 124.588,
    "text": " more directly as opposed to reading the textbook inside and out, as I have been for at least a year now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.628,
    "end": 128.393,
    "text": "I've been involved with the textbook group and facilitating meetings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.573,
    "end": 139.168,
    "text": "So a learning experience for me, a teaching experience in the sense of presenting it at a conference, as well as hopefully developing it as a resource for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.148,
    "end": 160.208,
    "text": " other folks at the Institute who might be coming at active inference from maybe an angle that they don't have a lot of prior experience with, say, reinforcement learning, the logic of which is very relatable to active inference and building simulations that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.049,
    "end": 164.352,
    "text": "And then finally, the theme of the conference was social science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.473,
    "end": 169.037,
    "text": "And so I wanted to develop a multi-agent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.135,
    "end": 194.687,
    "text": " model and i spent a little bit of time looking at at kind of popular uh agent-based modeling paradigms uh in that that people still kind of use and study in social sciences today uh so agent-based modeling being again this is one of those moments from you know kind of adaptively figuring out how to go about this but um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 196.962,
    "end": 199.024,
    "text": " Yeah, let's jump to the slides maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.849,
    "end": 205.69,
    "text": "So there we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 206.951,
    "end": 215.98,
    "text": "Yeah, I want to develop a multi-agent simulation that basically recreates a popular social science paradigm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.621,
    "end": 223.307,
    "text": "In this case, it's creating in number of agents, however you prefer to set it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.287,
    "end": 229.795,
    "text": " It groups them together, connects them via like network logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.897,
    "end": 232.999,
    "text": "The code I wrote has two different options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.019,
    "end": 239.327,
    "text": "You can either make, say, in groups of M agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.387,
    "end": 244.153,
    "text": "So you could have like four groups of five agents or otherwise, however you want to set that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.735,
    "end": 251.843,
    "text": "As I was discussing briefly with one of the other attendees today,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 251.823,
    "end": 272.498,
    "text": " I work in education, so I particularly like this paradigm because I think about students in our classrooms, the schools that I work for, and the idea of like, okay, what's a good way of facilitating them learning, learning to cooperate with one another, but at the same time, not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.085,
    "end": 279.68,
    "text": " not get too dependent upon relying upon each other for putting together a group project or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 280.02,
    "end": 288.9,
    "text": "They should be able to learn in such a way that they develop both a sense of personal efficacy, but also being able to work within a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.88,
    "end": 298.714,
    "text": " And so the paradigm has to do with something like collective problem solving, where you have agents and networks, they're collectively solving a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.774,
    "end": 305.904,
    "text": "The problem is based in what's called an NK landscape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 306.925,
    "end": 311.732,
    "text": "And it's basically just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.4,
    "end": 320.249,
    "text": " basically agents seek to find the best solution to an abstract or hypothetical problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.529,
    "end": 330.962,
    "text": "You have a whole ranking system where there are a series of potential solutions represented in some number of bits or digits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 332.044,
    "end": 342.377,
    "text": "And then there's some degree, some kind of complexity parameter that you can use such that whenever you increase it, it's as if,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.475,
    "end": 346.86,
    "text": " changing your problem a little bit can dramatically change how good it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.92,
    "end": 350.038,
    "text": "One quick way of saying it is like, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.368,
    "end": 356.794,
    "text": " If you want to design a car, if you remove the wheels, it's going to be a terrible car.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 357.815,
    "end": 368.045,
    "text": "You just changed one piece of it, and yet the entire solution, the entire schematic that you've built for your car is junk now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 368.846,
    "end": 369.967,
    "text": "So that's the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.007,
    "end": 378.996,
    "text": "There are these solutions agents are trying to solve that have a lot of interdependencies between the different parts of the solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.444,
    "end": 381.906,
    "text": " So let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.926,
    "end": 390.258,
    "text": "So the tutorial, it related to different themes with the conference, agent-based modeling, which I've kind of already touched on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 390.278,
    "end": 395.525,
    "text": "And it highly relates to Active Inference in the sense that we're building agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.545,
    "end": 396.967,
    "text": "Agents are in an environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.748,
    "end": 402.435,
    "text": "Agents interact with one another and the environment itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.415,
    "end": 405.92,
    "text": " like that's your overall kind of simulation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.44,
    "end": 416.513,
    "text": "And the way that this has traditionally been done in computational social science is to use software like NetLogo is a very popular one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.554,
    "end": 419.557,
    "text": "But the idea is to just write a script for your simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.577,
    "end": 426.487,
    "text": "It has its own kind of syntax and variables and so on specifically for NetLogo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 426.507,
    "end": 428.389,
    "text": "So it works really well whenever you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.369,
    "end": 436.379,
    "text": " You can write the code a certain way and then you can easily create buttons and interface options whenever you go to run your simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.439,
    "end": 438.181,
    "text": "All of it's kind of really integrated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 439.743,
    "end": 443.428,
    "text": "But that said, it doesn't allow too much on the back end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.468,
    "end": 446.351,
    "text": "It doesn't allow for too much complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.371,
    "end": 450.276,
    "text": "And so usually the agents are not really integrated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.695,
    "end": 455.879,
    "text": " They're not agents in any way that we've learned about agents in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.1,
    "end": 460.663,
    "text": "They're more like a non-adaptive thermostat, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.184,
    "end": 463.726,
    "text": "If it's too hot, they warm things up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.926,
    "end": 466.689,
    "text": "If it's too, you know, and vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.069,
    "end": 467.95,
    "text": "So that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.99,
    "end": 471.413,
    "text": "Regardless of circumstance, they don't learn anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.433,
    "end": 472.654,
    "text": "They're just kind of hard coded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.074,
    "end": 480.28,
    "text": "And so my whole plan here was to recreate that popular, the NK landscape parallel problem solving paradigm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.597,
    "end": 488.3,
    "text": " but using active inference agents such that agents kind of have something like autonomous decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 489.223,
    "end": 493.797,
    "text": "And let's see if we can find something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.671,
    "end": 495.692,
    "text": " It represents that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.813,
    "end": 500.219,
    "text": "I supplied some definitions of how we tend to think about agent-based modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 500.68,
    "end": 515.16,
    "text": "Again, I wrote this for an audience who might not have any awareness of what active inference is, but it's still a computational social science audience, and so they will be presumably familiar with agent-based modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 515.14,
    "end": 524.752,
    "text": " I include some guidelines on just modeling really anything agent-based modeling, but otherwise four common principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.812,
    "end": 530.559,
    "text": "The first one, verisimilitude, which is basically just to say, are we making realistic assumptions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.601,
    "end": 537.027,
    "text": "Whenever we set up a model, an agent, and we have to make a series of assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.228,
    "end": 539.19,
    "text": "And so do we...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.828,
    "end": 542.872,
    "text": " Does the audience, do the readers, do they agree with those assumptions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.892,
    "end": 543.894,
    "text": "Are they reasonable to make?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.934,
    "end": 547.198,
    "text": "Is there any kind of empirical support for the assumptions you're making?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 549.0,
    "end": 555.99,
    "text": "If not, then suddenly we have some very faulty scaffolding for the entire simulation that's to come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.931,
    "end": 559.154,
    "text": "That said, we also need robustness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 559.795,
    "end": 567.085,
    "text": "Tiny changes to the model presumably should not lead to dramatic changes in the final outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.065,
    "end": 579.758,
    "text": " Otherwise, what you've done is that you've created a simulation or a model that's a little overfit that really works well for a particular circumstance, but not so much for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 580.598,
    "end": 582.902,
    "text": " just about anything else you'd wanna use it for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.962,
    "end": 586.268,
    "text": "Reproducibility is really important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.288,
    "end": 588.832,
    "text": "I wanted to be very transparent in making this tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.872,
    "end": 590.175,
    "text": "I made all the slides available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 590.195,
    "end": 591.397,
    "text": "All the code is available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.437,
    "end": 600.092,
    "text": "We have added the GitHub for this tutorial to the active inference applications or implementations on the CODA.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.072,
    "end": 602.314,
    "text": " I can share that again with you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.735,
    "end": 615.967,
    "text": "And then finally, number four, non-triviality, which would just be ideally we would actually extract insights from doing agent-based modeling or in our case, active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.809,
    "end": 625.597,
    "text": "If we end up just creating a simulation that shows us something that we already know from a ton of other literature doesn't come off as particularly useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.717,
    "end": 629.961,
    "text": "It can be in the sense that it's reconfirming something from another angle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 630.143,
    "end": 638.196,
    "text": " But I don't know where we're at as far as the cost versus the benefits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 638.902,
    "end": 644.21,
    "text": " Yeah, the idea of underfitting versus overfitting versus producing balanced models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 645.552,
    "end": 649.638,
    "text": "This is just fitting a polynomial function to a sine wave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 649.678,
    "end": 653.284,
    "text": "And so the overfit model is great until it isn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.304,
    "end": 659.854,
    "text": "It skyrockets and predicts that y will reach up to 400,000 there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 660.715,
    "end": 668.166,
    "text": "So anyway, many of you will probably be familiar with this already.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 668.382,
    "end": 674.151,
    "text": " the idea of over versus under fitting in computational social science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.511,
    "end": 680.961,
    "text": "There's been a term that I argue exists in the literature over the past ten plus years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.143,
    "end": 688.753,
    "text": "People have identified there is a kind of beautiful simplicity to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 688.733,
    "end": 706.853,
    "text": " to using that logo to make these kind of hard coded agents, because the point overall presumably is to try and see, OK, whenever you take these hard coded agents and have them interact, there are emergent behaviors and properties that come come out of running that simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.973,
    "end": 718.386,
    "text": "But it's really foregoing a lot of, you know, we have such incredibly simple assumptions that we're using whenever we make",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 718.518,
    "end": 730.991,
    "text": " simulations like that, there's kind of been a call in the literature for making kind of more rich, something like cognitive models where agents can make their own autonomous decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 731.892,
    "end": 734.254,
    "text": "Here we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.115,
    "end": 737.638,
    "text": "And so there's been a push for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.698,
    "end": 744.745,
    "text": "So having mechanisms for, say, like memory, decision making,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 745.535,
    "end": 761.637,
    "text": " And and being able to act and react in different ways actually inferring the agents being able to infer kind of for themselves, what is going on, as opposed to a flat agent who just does X, if y else do Z kind of kind of logic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.022,
    "end": 783.229,
    "text": " And there's been a lot of references to interdisciplinary work, which also I think is very much up the alley of active inference in the sense of, you know, we're looking at neuroscience, we're looking at information theory and cybernetics, we're looking at biology, we're looking at reinforcement learning, machine learning, we're looking at many different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.93,
    "end": 789.717,
    "text": "And a lot of kind of rich conversation that comes out of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.697,
    "end": 807.722,
    "text": " So and then in addition, the kind of benefit to social scientists is that what happens whenever you're engaging in more like on the ground work where you actually want to design interventions or policies that that impact",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.192,
    "end": 832.056,
    "text": " ideally people's beliefs, not in a kind of pure social engineering kind of way, but what happens whenever people are engaging in self-damaging behaviors, or in my case, what happens whenever I would like to just design a new way of doing group projects that maybe better foster learning for the students where they can learn to work on their own and with others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.272,
    "end": 837.906,
    "text": " The kind of hard-coded agents in NetLogo, they don't learn anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.966,
    "end": 840.392,
    "text": "There's no change in their beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.873,
    "end": 842.497,
    "text": "Technically, they have zero beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.717,
    "end": 848.712,
    "text": "There are a couple lines of code that tell them to do X if Y, otherwise do Z.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.692,
    "end": 866.228,
    "text": " So, you know, this general description, all of you familiar with active inference will be familiar with a lot of this language of cognitive modeling, perception and action, generative or generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.545,
    "end": 870.57,
    "text": " I try to describe this as like we're kind of looking at models in a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.01,
    "end": 883.344,
    "text": "So it's like, you know, we have the typical environment and then the agents are within it, but now within the agents, you know, is an entire generative model itself rather than a couple of hard-coded roles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.265,
    "end": 890.872,
    "text": "And, you know, there are other aspects here that we've touched on in the textbook group before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.892,
    "end": 894.016,
    "text": "There's the whole explore-exploit trade-off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.356,
    "end": 895.978,
    "text": "I kind of detail how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.161,
    "end": 899.406,
    "text": " how that is implicated in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.446,
    "end": 913.387,
    "text": "There's been different discussions over what the authors meant in the textbook or what that means whenever they say that exploitation and exploration is like naturally balanced in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.407,
    "end": 920.818,
    "text": "And I try to provide a little bit of clarity to that in addition to the fact that many computational social scientists who are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.883,
    "end": 950.89,
    "text": " uh wanting to do cognitive modeling are usually working with reinforcement learning based models and so they are familiar with uh this this explore exploit trade-off kind of issue um the point is not that active inference magically balances those two things it's that they're both kind of included uh as as terms whenever minimizing particularly expected free energy in the forms of epistemic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.87,
    "end": 952.452,
    "text": " and pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.513,
    "end": 961.246,
    "text": "That said, an agent could still only ever encounter pragmatic value or only ever encounter epistemic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.807,
    "end": 969.739,
    "text": "The point is that both of those terms are within the same function, whereas in reinforcement learning, a common way of doing it is to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 970.343,
    "end": 991.812,
    "text": " kind of hard code rule uh for what defines those two things and it's kind of left up to your own decision making on that like Epsilon greedy behaviors where you just say okay with probability one minus Epsilon you do an exploitative action um and and with probability",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.792,
    "end": 1001.093,
    "text": " uh vara epsilon you do an exploratory action so it's the the point is that the agent here by minimizing free energy is kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.343,
    "end": 1006.489,
    "text": " choosing for itself which kind of behavior to go for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.509,
    "end": 1008.811,
    "text": "And there can be a blend.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1008.851,
    "end": 1010.193,
    "text": "It doesn't have to be one or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1010.213,
    "end": 1013.957,
    "text": "It can choose an action that will have both epistemic and pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.977,
    "end": 1021.746,
    "text": "So I think it's just conceptually a new way of maybe even thinking about what defines these kinds of behaviors in the first place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.127,
    "end": 1024.989,
    "text": "I find it personally very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1027.052,
    "end": 1030.135,
    "text": "I go a bit, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.583,
    "end": 1036.61,
    "text": " I go a bit into reinforcement learning, but I've already kind of touched on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1037.131,
    "end": 1042.238,
    "text": "One of the attendees here, Zach, brought up POMDPs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.358,
    "end": 1045.622,
    "text": "And those are used in reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.662,
    "end": 1050.389,
    "text": "They're what we'll be looking at today and in the tutorial generally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.449,
    "end": 1059.902,
    "text": "But the main idea here is that we're looking at an agent has",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.574,
    "end": 1066.644,
    "text": " beliefs about latent states of the environment that they can only infer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1066.664,
    "end": 1078.784,
    "text": "They engage in actions in order to attempt to pursue their preferences or goals or realize their priors over preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.605,
    "end": 1086.396,
    "text": "And then that action is sent into the environment, which then itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.882,
    "end": 1089.987,
    "text": " produces a new observation for the agent based on that action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.007,
    "end": 1096.177,
    "text": "The agent then takes in that observation to update their beliefs about the hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.998,
    "end": 1104.59,
    "text": "So we also have Markov decision-making process, which is the same thing, but a little bit more simplified.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.611,
    "end": 1106.173,
    "text": "The agent has no,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.153,
    "end": 1123.403,
    "text": " latent states to infer um it's just a very direct they act the environment tells them the true state of the world and it's just back and forth so you have those two things um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.154,
    "end": 1136.347,
    "text": " You know, I discussed epsilon greedy behavior transition active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1138.231,
    "end": 1150.453,
    "text": "You know, I kind of describe active inference is like, well, it's kind of it's kind of filling in some of the gaps that reinforcement learning generally seems to miss in my view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.687,
    "end": 1153.553,
    "text": " I don't mean to pit these fields against each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1153.573,
    "end": 1162.25,
    "text": "I think that there's a lot of valuable communication that can come from trying to interface between the two of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1162.29,
    "end": 1166.198,
    "text": "But that said, specifically for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.178,
    "end": 1181.217,
    "text": " agent-based modeling and something like cognitive agent-based modeling, active inference provides just a lot more for informing what should those initial assumptions that we're making when we set up a simulation, when we build an agent, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.197,
    "end": 1204.335,
    "text": " like i think it provides a lot more material in in support for those kinds of assumptions that we're making i think that it's it's it's pulling from uh decades now of of uh research into neuronal dynamics uh into psychology and other fields such that you know i i don't i don't at all need to say that it's kind of the end-all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1204.315,
    "end": 1205.178,
    "text": " be all of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.298,
    "end": 1211.179,
    "text": "I think what it does do is provide a very nice framework that reinforcement learning is missing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.721,
    "end": 1214.41,
    "text": "Reinforcement learning is usually focused upon",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.812,
    "end": 1217.797,
    "text": " task optimization in most research that I see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.478,
    "end": 1227.812,
    "text": "The point would not to be to emulate humans, it would be to emulate super humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1227.832,
    "end": 1242.355,
    "text": "You don't want humans, you want some kind of AI tool or assistant who can do the absolute best job possible, which makes plenty of sense for trying to optimize different kinds of processes and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1242.335,
    "end": 1259.464,
    "text": " For someone like me who's interested in social science and computational psychiatry, I'm looking for a little bit more realism as opposed to building super robots, even though you can kind of do both with these same tools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.125,
    "end": 1266.115,
    "text": "So active inference, as we know, supplies a neural process theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.517,
    "end": 1281.674,
    "text": " That said, I didn't want to scare everyone by suddenly talking about neurosciences if you have to be an expert in that, because as Friston and others say in the textbook, the idea is not to emulate the entire brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.754,
    "end": 1287.341,
    "text": "It's to find the generative model that describes the problem the brain is trying to solve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.681,
    "end": 1294.549,
    "text": "So that helps us to kind of stay, kind of balance things, so to speak, between...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.529,
    "end": 1304.151,
    "text": " the active inference approach and maybe what agent-based modeling is attempting to do, which is to make things as simple as possible, but no simpler than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.004,
    "end": 1313.112,
    "text": " which algorithms and which architectures for approaching cognitive agent-based modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.133,
    "end": 1315.916,
    "text": "So we have the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1315.956,
    "end": 1326.949,
    "text": "This supplies explicitly a belief-based framework for engaging in agent-based modeling, which is perfect for the social scientists who claim that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1326.929,
    "end": 1334.457,
    "text": " You know, we're lacking the ability to make agent based models that maybe are directed at people's beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.698,
    "end": 1350.034,
    "text": "That's yet another reason why I think active inference kind of supplies like this is a belief based framework that is precisely what we're trying to to look at a lot of the time, in addition to the various dynamics that are playing out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.79,
    "end": 1354.114,
    "text": " Again, exploration-exploitation balance, kind of touched on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.574,
    "end": 1364.084,
    "text": "Agents are self-evidencing, which is they're trying to realize what they already believe, so to speak, and so they can engage in perception or action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1364.144,
    "end": 1365.926,
    "text": "They can change their mind or they can change the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.927,
    "end": 1371.232,
    "text": "And then variational Bayesian inference, as we know from the textbook group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.915,
    "end": 1380.342,
    "text": "Surprise, Bayesian surprise is often intractable whenever it comes to working with...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.811,
    "end": 1394.5,
    "text": " you know, continuous cases in the integrals or otherwise just the amount of computation involved or being unable to find the analytical solution in certain cases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.483,
    "end": 1407.98,
    "text": " Oh yeah, and then, as I mentioned, with the whole kind of super humans development approach from reinforcement learning with active inference there's this notion of false inference so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.081,
    "end": 1414.952,
    "text": "The whole point of introducing that is simply to say we're not trying to necessarily make super humans we're trying to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.932,
    "end": 1428.554,
    "text": " to kind of better replicate what a human might do or some other sentient organism or otherwise, including just the idea of optimality is relative to the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.614,
    "end": 1441.615,
    "text": "Someone with, say, post-traumatic stress disorder has their own particular generative model and certain kinds of outcome behaviors that you see from them, while they might not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.595,
    "end": 1446.88,
    "text": " appear to be optimal for the current social situation they're in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.96,
    "end": 1454.827,
    "text": "If someone suffers from symptoms, I say all of this as someone who also does research on PTSD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.008,
    "end": 1471.281,
    "text": "Quick disclosure, but it might not be optimal for the actual situation that that person is in, but it is optimal as far as how their generative model is currently functioning as far as parameters and values go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.261,
    "end": 1492.645,
    "text": " um so that that's that kind of realism element here um then the less active inference agents are highly competitive if you're trying to develop them for task optimization um so i just decided a little bit of research on that um and then the model architectures they're often used in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1492.625,
    "end": 1505.352,
    "text": " reinforcement learning like MDPs and POMDPs are also heavily used in the discrete cases for active inference agents as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1509.77,
    "end": 1511.514,
    "text": " Supplied some further reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.554,
    "end": 1517.108,
    "text": "Three hours sounds like a long time, but there's a ton to cover here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.669,
    "end": 1528.234,
    "text": "I appreciated talking to a couple folks who do active inference at that conference, and they said they did not know how they could have fit everything into...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.214,
    "end": 1552.956,
    "text": " three hours and they they said honestly they think i did about the the best that one can do or something along those lines which was a big um compliment and and i felt really good about that because i was a little stressed on how do you fit everything in any case uh further reading uh for folks who are interested and so there's further reading on active inference in relation to free energy principle reinforcement learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.936,
    "end": 1558.677,
    "text": " LLMs, which there's been research on combining",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.062,
    "end": 1561.405,
    "text": " active inference agents with LLMs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.565,
    "end": 1565.39,
    "text": "You can use LLMs as if it were the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1565.55,
    "end": 1576.785,
    "text": "It can kind of report in natural language what it kind of thinks about the observation it just saw and why it's choosing the action it's choosing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.505,
    "end": 1585.035,
    "text": "So it's kind of like having the code for the agent coalesce with these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.015,
    "end": 1590.942,
    "text": " chat GPT or otherwise prompts that kind of keep that sequence going along the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.58,
    "end": 1619.73,
    "text": " just a quick comment on that Andrew yeah absolutely single even single successful examples of the active inference syntax and semantics go in in like this multi-agent setting go an immense distance towards using augmented coding methods and saying okay that was four clusters of five edit it to do six clusters of nine or now add this like that gets things going in in a huge way so it's like kind of see the point that he's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.71,
    "end": 1646.055,
    "text": " pitching but also think about the bigger distribution you'll see adjacent possibles and many of those are like directly promptable right now sure yeah no no uh very very good point like to have that degree of integration um i think is is awesome and it's really exciting right now too um yeah no thank you thanks for that note um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1647.453,
    "end": 1649.816,
    "text": " I'll just kind of keep pushing on a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1650.758,
    "end": 1654.183,
    "text": "So again, this is for social scientists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.203,
    "end": 1669.926,
    "text": "So here's some, you know, example kind of theory building examples of how active inference has been applied to the social sciences, examples towards development of treatments or other kinds of interventions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1669.946,
    "end": 1675.013,
    "text": "You can think of like kind of policy interventions, too, at a broader scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1676.377,
    "end": 1682.528,
    "text": " Here, just general examples of active inference and changing contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1682.788,
    "end": 1686.074,
    "text": "And these are only three examples out of many of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.194,
    "end": 1692.445,
    "text": "And I would argue that it seems like many of them involve changing context just to show how agents adapt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1692.425,
    "end": 1694.909,
    "text": " to a change in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1695.49,
    "end": 1698.354,
    "text": "But I think it's just worthwhile to have a look at them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.414,
    "end": 1707.088,
    "text": "And many social scientists are especially interested in things like, say, multi-armed bandit problems or cooperative joint action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1707.128,
    "end": 1709.371,
    "text": "So I want to include those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.894,
    "end": 1713.758,
    "text": "Some other example work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.396,
    "end": 1726.566,
    "text": " Daniel Friedman, of course, being one of the major co-authors of the active inference paper and the ongoing research for that simulation, as well as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.12,
    "end": 1733.75,
    "text": " Another simulation, a couple of its co-authors also developed the PyMDP package.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1733.77,
    "end": 1746.869,
    "text": "It's actually from reading the epistemic communities under active inference paper that I wanted to contact the folks who have been working on the PyMDP package because I was curious how they did that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.889,
    "end": 1755.321,
    "text": "But both of these papers were a big inspiration for me in trying to figure out as a new active inference coder, how do I make",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.301,
    "end": 1762.555,
    "text": " you know, networks of agents as opposed to just making single agents, which I'd done up to the point where I read this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1764.819,
    "end": 1769.749,
    "text": "So worthwhile to have a look at those for anyone who wants to get into multi-agent modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1770.455,
    "end": 1775.582,
    "text": " more learning resources for the social sciences and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.164,
    "end": 1782.13,
    "text": "I would recommend these to really anyone, including folks at the Institute for sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.151,
    "end": 1792.084,
    "text": "There's also the entire Constructing Cultural Landscapes course that was delivered for the most part last year with the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1793.466,
    "end": 1795.348,
    "text": "So that's also a more verbal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.75,
    "end": 1811.818,
    "text": " uh verbally kind of delivered um series of courses that that relate this study of say culture and society to active inference uh but many of these other resources have more to do with coding like looking at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.798,
    "end": 1816.746,
    "text": " Sanjeev's upcoming Fundamentals of Active Inference textbook and the like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.766,
    "end": 1817.847,
    "text": "A lot of good stuff here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.89,
    "end": 1837.317,
    "text": "I did use a series of images from the textbook, always citing them, of course, but it's kind of like trying to move from this traditional rules-based modeling to inference-based modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.651,
    "end": 1845.855,
    "text": " I recognize that I'm just getting to the point where you know this would have been roughly an hour into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.021,
    "end": 1873.075,
    "text": " the presentation as i gave it at the conference and which would also mean that there would be two more hours uh following that and we have 21 minutes and for our session here and then also i think there are other things that folks wish to discuss so maybe what i'll do now is just kind of shift into what i would say are some of the core components of putting together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1873.51,
    "end": 1877.055,
    "text": " an agent, like just a single agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.657,
    "end": 1888.47,
    "text": "And then that way anyone who's here today or watching this being streamed or the recording of it maybe can refer to the code if they would like to dig further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.51,
    "end": 1901.948,
    "text": "But for building an active inference agent, which this is one of the figures in the textbook again, it's POMDP, what we'll do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.704,
    "end": 1910.487,
    "text": " This is kind of the idea of what, from my perspective, how you might want to design an agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.956,
    "end": 1912.758,
    "text": " You want to define the states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.979,
    "end": 1914.14,
    "text": "What are they uncertain about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.662,
    "end": 1917.445,
    "text": "What are the hidden states that they're trying to infer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1918.546,
    "end": 1920.549,
    "text": "What are the observations that they come across?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1921.37,
    "end": 1924.134,
    "text": "Those observations are being generated by the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.155,
    "end": 1933.386,
    "text": "So think about the environment and what kind of observations that it kind of sends out that the agent can then come into contact with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.366,
    "end": 1960.268,
    "text": " uh defining controls which are something like that the actions that are available to the agent um but there's a you know there's different language there's actions there's there's controls and there's policies and so the way i've kind of interpreted that as a policy is like a sequence of actions that an agent can take an action is an action is just like a single unit like action available to the agent and then um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1960.72,
    "end": 1966.867,
    "text": " a control is like an action that necessarily does something to the environment that actually controls something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.947,
    "end": 1972.414,
    "text": "Because if you look at some simulations, there will be actions available to the agent that don't actually do anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.454,
    "end": 1981.324,
    "text": "They just need to kind of be there to make the state transitions model that a POMDP has work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.265,
    "end": 1983.707,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.092,
    "end": 1986.977,
    "text": " which really simplifies the computation in that case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.458,
    "end": 2000.962,
    "text": "Anyway, once we define those three things, states, observations, and controls, we would want to define these different probability distributions in the generative model of the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.982,
    "end": 2008.075,
    "text": "So it has an A matrix, B, C, D, and E matrices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.055,
    "end": 2010.399,
    "text": " And so we'll get into that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.419,
    "end": 2022.322,
    "text": "And then after that, we can define the environment, which we've already been thinking about because we're thinking about actions and observations, each of which have a direct relationship with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.007,
    "end": 2030.637,
    "text": "Then after that, you define an active inference loop, like you'll have already defined and built your agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.591,
    "end": 2041.885,
    "text": " then you compose an active inference loop where you actually have the loop of an agent committing actions, receiving observations and so on from there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.905,
    "end": 2056.388,
    "text": "And then ideally when running some kind of active inference simulation or any kind of agent-based modeling simulation, you want to have some kind of utilities that you've written out to help you plot, to record and plot",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.368,
    "end": 2058.89,
    "text": " or otherwise the results of your simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.99,
    "end": 2076.186,
    "text": "You can run the simulation various times with different parameter settings and then compare the results for each time you ran it to see what makes more sense or what is more accurate or whatever makes sense to you whenever you're testing your models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2077.267,
    "end": 2082.011,
    "text": "But yeah, why do this if you can't see the results and gain insights, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.031,
    "end": 2086.375,
    "text": "And so that's the significance of comparison and revision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2086.355,
    "end": 2104.228,
    "text": " So the agents that I had everyone build were, this is kind of my attempt to illustrate what that looks like as far as an active action perception or active inference loop goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.17,
    "end": 2110.736,
    "text": " So we can start, let's say here, an agent explores or exploits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.436,
    "end": 2116.662,
    "text": "Those are just kind of pseudo clever names for the actions available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.842,
    "end": 2125.611,
    "text": "But to explore means to work on developing a better solution than what the agent already has available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2126.732,
    "end": 2129.575,
    "text": "An exploit is to steal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.555,
    "end": 2159.106,
    "text": " kind of steal the solution of a neighbor this is referring back to trying to engage in parallel problem solving to solve a problem uh based on an in-kind landscape right so so they can either try and improve their own solution kind of like studying or they can steal their neighbor's solution uh one that is better than what the agent currently has but they get to choose right it's not hard-coded in the original simulation it's hard-coded",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2159.086,
    "end": 2165.734,
    "text": " to such that agents will necessarily steal a better solution if one is available to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.754,
    "end": 2169.859,
    "text": "And it's also a fully observable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.999,
    "end": 2173.723,
    "text": "They always know that there's another solution that's better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.265,
    "end": 2182.073,
    "text": "So in this case, like we have a partially observable environment, I think it's a little less realistic or excuse me,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.998,
    "end": 2204.382,
    "text": " one that i built i think it makes certain assumptions that are a little bit more realistic how do you know that everyone's solutions are better or worse than yours um you have to kind of study and understand their solution to a complex problem in order to adopt it for yourself and recreate it for yourself just at you know so anyway there are different ways that could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.362,
    "end": 2215.724,
    "text": " But it's so that this is the general just they have actions available to them was actions are sent into the environment which processes the action returns in this case, two different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.426,
    "end": 2225.644,
    "text": "Observations based on two different what are called observation modality, so you can think of them as kind of observation categories, and so the agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2225.624,
    "end": 2233.113,
    "text": " will see, based on their action, if they were kind of attending to themselves or their neighbor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.355,
    "end": 2237.079,
    "text": "If you attend to yourself, the idea is that you're studying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2237.179,
    "end": 2252.458,
    "text": "And so there's kind of a linkage here between exploring and observing yourself or exploiting and observing your neighbor, whose answer you just stole if you exploited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.181,
    "end": 2264.224,
    "text": " And then they get to see if the new answer, whether they explored or exploited, if it was actually better than their previous answer or solution that they had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.664,
    "end": 2271.358,
    "text": "And finally, they use that information to both infer the hidden state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.338,
    "end": 2289.145,
    "text": " um if if they were attending to themselves or their neighbor is a little counterintuitive but uh the idea is it's always the way that i have the agent's program it's always going to be one for one they're always going to know for sure if they explored it will lead to them having observed themselves",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.125,
    "end": 2304.467,
    "text": " and they'll believe the hidden state is, oh, I'm attending to myself and I'm seeing improvements, or not seeing improvements, whichever observation outcome there is for improved versus non-improvement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.447,
    "end": 2314.002,
    "text": " And then it incorporates learning, which is another concept that we'll have learned from the textbook group, especially chapter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.042,
    "end": 2317.748,
    "text": "I think it's first is largely introduced to chapter four, maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2317.888,
    "end": 2324.198,
    "text": "And then there's a lot more detail on it in later chapters, especially the second half of the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.218,
    "end": 2327.383,
    "text": "So that's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.363,
    "end": 2331.669,
    "text": " I don't want to take up too much more of the time, and I think I've spoken quite a bit here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.749,
    "end": 2337.237,
    "text": "But just so you know, there are you know, there's a lot more in-depth information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.257,
    "end": 2346.57,
    "text": "And I used latex and all of that to recreate a lot of the formulas involved here that we'll also see in the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2346.55,
    "end": 2369.858,
    "text": " um but it's just you define your states define your observations and define the controls for the agent and then they get linked together so to speak through all these different matrices so the a matrix will be conditional probabilities of your observations given all states b matrix will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.838,
    "end": 2383.915,
    "text": " uh you know what will the next state be based on a combination of the current state as well as an action that i do so if i'm hungry right now if i believe i'm hungry right now and i go eat food uh the next",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.485,
    "end": 2391.719,
    "text": " hidden state at the next time step presumably might be that I am now satiated or will be satiated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.94,
    "end": 2393.262,
    "text": "That's a way of thinking about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.322,
    "end": 2399.214,
    "text": "C matrix are your preferences to be realized or your priors over observations to be realized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.234,
    "end": 2403.743,
    "text": "Your D matrix, probably the simplest one, is just at the beginning of each",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2403.723,
    "end": 2407.188,
    "text": " step, you have a belief of what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.248,
    "end": 2414.738,
    "text": "They're like your priors over hidden states at the initial point of the simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2415.479,
    "end": 2417.361,
    "text": "You need a starting point, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.742,
    "end": 2423.169,
    "text": "And then finally, the E-matrix, which you don't necessarily have to define in PyMVP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2423.349,
    "end": 2431.941,
    "text": "I can't quite recall what the case is in RxInfer, but the idea is that the agent starts off with some beliefs about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2431.921,
    "end": 2436.972,
    "text": " kind of which action they have available is better versus others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2437.292,
    "end": 2443.686,
    "text": "And oftentimes you can just, oftentimes this is initialized to be uniform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2443.936,
    "end": 2454.557,
    "text": " Maybe you intend for the agent to learn a task, and so you yourself don't know what the better action to take is, and neither does the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.637,
    "end": 2466.079,
    "text": "And the idea is to start them with uniform beliefs over actions such that you can then apply the learning rules so they will kind of update what they think is better on their own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.65,
    "end": 2478.549,
    "text": " And then there's direct, you know, these direct code references, like just as, you know, we see this kind of S superscript ATT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2478.709,
    "end": 2488.385,
    "text": "Like I basically, I try to keep it consistent S ATT, like I aim to keep these things consistent across the tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.405,
    "end": 2493.653,
    "text": "And that way, if it's unclear what something means, you can double back, but once you catch on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.633,
    "end": 2499.078,
    "text": " to the nomenclature that suddenly becomes easier to kind of follow things along.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.438,
    "end": 2502.561,
    "text": "So I included, again, code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.581,
    "end": 2520.518,
    "text": "I included some outputs to help understand because PyMDP uses a kind of intricate way of using NumPy arrays as object arrays, and it allows storing kind of these, you know, irregularly shaped arrays.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.46,
    "end": 2524.643,
    "text": " whenever composing these different variables for your model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.964,
    "end": 2539.639,
    "text": "But the point is, you know, you can construct an A matrix, B matrix, C, D, E, introduce learning, just what kind of what that is about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2539.739,
    "end": 2543.102,
    "text": "Usually it occurs not at every time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.443,
    "end": 2549.009,
    "text": "You know, it's kind of like, oh, you have to take in an entire experience before you necessarily learn something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.029,
    "end": 2550.37,
    "text": "That's sort of the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.35,
    "end": 2555.2,
    "text": " or one of the ideas behind actual implementation of learning roles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.164,
    "end": 2562.655,
    "text": "Learning, we're about out of time, I'm so sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2562.955,
    "end": 2584.963,
    "text": " yeah and then once you have those things a b c d e and then um there are priors over a which are used for updating a um you can plug them into this agent constructor that the pi mdp package uses and there's a little bit of detail on the other arguments that i included um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2585.517,
    "end": 2588.381,
    "text": " But that's about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.481,
    "end": 2609.449,
    "text": "And then from there, it'll go into these kind of core functions of how the agent infers states based on observations, how it learns, which is just where it updates its variables, a, b, or d. I will note that I will be extending this tutorial in future for things related to model fitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2609.429,
    "end": 2618.519,
    "text": " At the time that I was developing this tutorial, I was using kind of like the standard PyPy version of PyMDP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.739,
    "end": 2633.535,
    "text": "I did not at that moment in time realize that there have actually been an incredible amount of updates to that package that are really exciting related to model fitting, to other ways of doing inference like sophisticated inference, just a lot of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.655,
    "end": 2637.439,
    "text": "So this is as of now is kind of a living document.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2637.459,
    "end": 2638.44,
    "text": "It's not quite",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.42,
    "end": 2639.141,
    "text": " finished.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2639.742,
    "end": 2660.414,
    "text": "But it's good enough to kind of get you to a point where you can develop an agent using PyMVP and then with the later code that we don't have time to go into, putting them into networks and then having them run through the active inference loop so they can attempt to solve the problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.395,
    "end": 2666.503,
    "text": "You know, kind of what that looks like is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.07,
    "end": 2668.35,
    "text": " this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.871,
    "end": 2686.414,
    "text": "So my kind of personal, you know, my sort of finding is that, you know, the way I have the simulation coded right now, I would, I would really want to find different ways of grouping students together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.454,
    "end": 2693.424,
    "text": "As opposed to say, a fully connected network of students, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.444,
    "end": 2695.867,
    "text": "Like everyone work with everyone, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.568,
    "end": 2696.828,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.192,
    "end": 2702.277,
    "text": " That's what I did here, a random network, but it's fully connected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.317,
    "end": 2703.599,
    "text": "So it's not really random at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.659,
    "end": 2708.866,
    "text": "It's everyone's, everyone can take each other's answers as they want or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2709.647,
    "end": 2714.954,
    "text": "And basically the agents during, I have them go through two stages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.314,
    "end": 2722.864,
    "text": "So during the first stage, they do eventually find the best solution and many of them kind of coalesce around it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.526,
    "end": 2727.27,
    "text": "But that said, they learn,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.25,
    "end": 2729.535,
    "text": " to not rely upon themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.936,
    "end": 2744.027,
    "text": "So by the end of the simulation, with one denoting exploitation and zero denoting exploration, the agents really rely upon just exploiting each other over and over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2744.127,
    "end": 2745.951,
    "text": "And that carries over",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.201,
    "end": 2748.305,
    "text": " going forward into the next simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2748.345,
    "end": 2760.649,
    "text": "And because they're all trying to just steal the answers of their neighbor rather than relying on themselves to try and come up with a new solution or experimenting or studying,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.815,
    "end": 2776.748,
    "text": " um they don't even by the end after many time steps they don't actually even reach the optimal solution they just kind of plateau it's not a bad solution per se but still they plateau there and it only",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.728,
    "end": 2802.583,
    "text": " kind of further reinforces like to not rely upon themselves and it's i could guess that that's like well you have 29 neighbors that you could take their answer instead of doing your own work why not do that um but uh it's you know in any case it's just this adds a lot more to trying to understand the paradigm because the original paper that produced this paradigm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.698,
    "end": 2810.195,
    "text": " They do not say fully connected networks are the best, but they do say that it does often lead to really good solutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.616,
    "end": 2815.588,
    "text": "And here, this actually is a way of looking at, like, how does this impact agents themselves?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.129,
    "end": 2818.735,
    "text": "Are these kinds of practices, do they have longevity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.276,
    "end": 2821.281,
    "text": "Or do agents just kind of learn to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.97,
    "end": 2829.717,
    "text": " exploit one another to the detriment of the overall group actually by the end, because they might not reach the optimal solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.797,
    "end": 2849.275,
    "text": "So more ideally, the simulation would be run many times with changing the seed each time to see if maybe it's just by happenstance that these were the results, but I did run it several times and I frequently find the same result, but for the sake of a tutorial, we only do it once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.476,
    "end": 2851.977,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.957,
    "end": 2853.801,
    "text": " I think I'll stop things there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2853.821,
    "end": 2861.696,
    "text": "I do want to apologize to everyone for taking so much time, but I really appreciate your patience with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2861.756,
    "end": 2874.741,
    "text": "I hope it was useful or interesting in some way, and I'll be sure to post the link to the GitHub in the chat presently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.817,
    "end": 2882.58,
    "text": " I did have a few questions, if you were open to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.564,
    "end": 2890.93,
    "text": "You said that you were looking for a good solution to the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.272,
    "end": 2896.577,
    "text": "But in searching for the solution, how do we know that the problem is well defined?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.378,
    "end": 2901.403,
    "text": "Inside of a lot of interpretability work, especially for reinforcement learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.328,
    "end": 2906.192,
    "text": " We're not ever allowed to say, this is what you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.693,
    "end": 2909.435,
    "text": "You're never allowed to tell the agent, this is the problem you want to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.936,
    "end": 2913.56,
    "text": "We can only reinforce certain behaviors that seem to solve this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.34,
    "end": 2929.416,
    "text": "So we run into a lot of problems, especially using like classical reinforcement learning, like a PPO and throw a transformer at it in order to solve a problem that is mostly aligned with the problem we want to solve, but slightly misaligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.936,
    "end": 2936.385,
    "text": " The classical example is whenever you have an agent moving right to the end of a video game to get a star, like Mario Bros or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.126,
    "end": 2942.533,
    "text": "But the agent never learns to want the star, despite that giving it the reward inside of this occasion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.013,
    "end": 2944.736,
    "text": "It only learns move right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.877,
    "end": 2956.872,
    "text": "How do you go about the problem of explaining the problem with active inference around it using the POMPD or DP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.687,
    "end": 2959.988,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.028,
    "end": 2961.051,
    "text": "Thanks for your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.291,
    "end": 2963.036,
    "text": "And I hope I'm understanding it well enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.339,
    "end": 2971.999,
    "text": "But I mean, in this case, so the agent maybe I should have left the slides up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.019,
    "end": 2972.661,
    "text": "I apologize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.922,
    "end": 2976.531,
    "text": "But so it's whenever we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.967,
    "end": 2982.033,
    "text": " If you recall, the agent can receive two different kinds of observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.273,
    "end": 2986.358,
    "text": "And so one of them is if it's attending to itself or to a neighbor, that's all well and good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.378,
    "end": 2992.745,
    "text": "The other one is if it's observing an improvement or no improvement in its solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.805,
    "end": 2996.089,
    "text": "So it's kind of like you can imagine just like a spreadsheet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.109,
    "end": 2998.712,
    "text": "It's like one column or this potential solutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2998.772,
    "end": 3002.957,
    "text": "And each one of them has a kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.937,
    "end": 3024.321,
    "text": " they're called fitness values it's like they're exploring a fitness landscape but you can almost almost just think of it as like a ranking uh you know there are solutions all necessary solution all solutions are necessarily like better or worse than than other solutions so it's like a kind of ranking scheme um and so the agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.301,
    "end": 3032.169,
    "text": " in their C matrix are programmed here to prefer an improvement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.189,
    "end": 3037.635,
    "text": "And so they get that they don't know what the optimal solution is from the start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.735,
    "end": 3041.018,
    "text": "They don't know necessarily how to get there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.519,
    "end": 3043.821,
    "text": "They don't even know what its fitness value is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.861,
    "end": 3044.802,
    "text": "They don't know any of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.902,
    "end": 3052.35,
    "text": "But as long as they know that they're going in the right or wrong kind of direction, which is that itself is very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.33,
    "end": 3071.385,
    "text": " very relatable to reinforcement learning right the the sense of like here's a reward signal like you you got a plus one or a minus one uh in this case the agent is just getting a improvement or no improvement it prefers per that c matrix the yeah the improvement and it dis prefers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.365,
    "end": 3072.406,
    "text": " No improvement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.688,
    "end": 3077.532,
    "text": "So that's kind of the simplest way of getting at that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.552,
    "end": 3097.153,
    "text": "And then what I think differentiates active inference agents from reinforcement learning models as far as interpretability goes, that we do have kind of like these words like preferences and habits and goals and so on, like all those are kind of baked into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.133,
    "end": 3119.597,
    "text": " the the the formulae that underlie active inference such that we can more directly interpret you know um maybe something as if the agent wants something or it's choosing this because of that or or otherwise that I think is kind of we I don't know if we necessarily get that kind of uh clear interpretability",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.577,
    "end": 3121.579,
    "text": " from reinforcement learning models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3122.921,
    "end": 3125.724,
    "text": "It's probably debatable, but that's my perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3127.567,
    "end": 3128.548,
    "text": "I hope that was useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.748,
    "end": 3132.272,
    "text": "Just to shortly restate it, there's one and a half points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.513,
    "end": 3136.698,
    "text": "First is the big picture is Goodhart's law is a challenge that's open.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3137.499,
    "end": 3142.084,
    "text": "Setting a measure and then having a proxy that measures that can become the proximate target of optimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.965,
    "end": 3149.533,
    "text": "The relationship between the proxy and the underlying state can diverge and that's what partially observable means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.513,
    "end": 3156.442,
    "text": " Active inference benefits because the preference distribution is semantically interpretable over the observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.743,
    "end": 3159.066,
    "text": "So let's just say we have the maze on the right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3159.627,
    "end": 3164.834,
    "text": "So then we have a belief about location and a belief about whether we have gotten to the prize or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.515,
    "end": 3169.881,
    "text": "We could say we looking at this model, we have a flat preference on location.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.642,
    "end": 3176.77,
    "text": "So assuredly, pragmatic value is not coming from location as a proxy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3177.914,
    "end": 3205.052,
    "text": " that relates being able to control what is epistemic and pragmatic value and to limit pragmatic value calculations to only things that are loaded up on c and localize the epistemic value only to the uncertainty distributions i think i understand you're saying that like in classical reinforcement learning you have your loss which is not of assigned in variables to the environment because the uh pragmatics are assigned to the environment because the variables there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.285,
    "end": 3207.074,
    "text": " that means that we can get around this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.235,
    "end": 3210.452,
    "text": "Well, not around it, like you said, good hearts, but it's going to be better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.12,
    "end": 3242.127,
    "text": " is that what you mean i'm sorry i was trying to understand from this from this perspective reinforcement learning is like okay you're going to take all the policy space and you're going to propose this auxiliary function called reward and then you're going to use that as a single ranker but that is going to need to implicitly tie together epistemic and pragmatic value and it's also potentially computed in a like uninterpretable way with respect to which policies have what qualities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3242.107,
    "end": 3244.13,
    "text": " Okay, thank you guys both so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3249.379,
    "end": 3249.539,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.502,
    "end": 3261.178,
    "text": "I just want to thank everyone here for this impromptu presentation, but it's exciting to see that it's maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.547,
    "end": 3265.572,
    "text": " going to be at least a little bit useful for folks at the Institute as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.773,
    "end": 3271.721,
    "text": "So there's a lot of cleaning that maybe needs to be done on the tutorial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.801,
    "end": 3282.315,
    "text": "Maybe there are some excessive slides at the beginning because, again, it was intended to completely introduce every active inference in the first place to social scientists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.335,
    "end": 3291.267,
    "text": "So there's probably some fat that can be trimmed using it as a resource for folks here or obviously here for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3291.247,
    "end": 3294.07,
    "text": " But yeah, I just want to thank everyone again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.09,
    "end": 3300.737,
    "text": "This was really fun to kind of rehash this and also do a speed run of it, I suppose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3300.897,
    "end": 3303.02,
    "text": "But I didn't quite clear it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.12,
    "end": 3304.662,
    "text": "But yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.682,
    "end": 3306.464,
    "text": "We'll do a future model stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.944,
    "end": 3311.749,
    "text": "And in that one, you could give the jump into the reduced version of the slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3312.85,
    "end": 3314.853,
    "text": "And you could just flip through them so people can pause.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.133,
    "end": 3318.857,
    "text": "Then we'll look at the notebook, the advantage of the notebook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.512,
    "end": 3320.853,
    "text": " No one needs to install anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.893,
    "end": 3322.955,
    "text": "You can just hit run and get to the output.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.975,
    "end": 3330.603,
    "text": "And then also we'll work on getting the script based version up and that include more logging and interpretability analysis in the script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3332.865,
    "end": 3333.646,
    "text": "All that tracks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3334.487,
    "end": 3334.767,
    "text": "Chill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.348,
    "end": 3335.828,
    "text": "Good idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3336.309,
    "end": 3336.849,
    "text": "Thanks, Dan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.129,
    "end": 3339.632,
    "text": "And then abstract it and move it into RxInfern.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3342.475,
    "end": 3344.817,
    "text": "That may or may not be the move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3344.837,
    "end": 3345.938,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.038,
    "end": 3348.861,
    "text": "I like the folks, you know, developing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.904,
    "end": 3374.443,
    "text": " imdp quite a bit and i'm very excited about you know the new features they're adding and uh so i'm gonna keep working with that but you know that said um we'll see we'll see what's going on i have a quick question uh regarding um going through the rest of the last week we went over chapter one right so would chapter two be next week or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.588,
    "end": 3393.58,
    "text": " so the times alternate between cohort six and seven so when in doubt just check the schedules page just look for the date and the time that you're looking at but yes cohort seven will continue with chapter two and then chapter two and then the third week will be that kind of open one and then in cohort six",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.728,
    "end": 3395.934,
    "text": " we'll do chapter seven for two weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3396.556,
    "end": 3400.085,
    "text": "And then like that will be perfect for another deep dive on the discrete time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.105,
    "end": 3404.277,
    "text": "Wait, so I'll have about two weeks to get through chapters three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3404.558,
    "end": 3405.239,
    "text": "That's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.741,
    "end": 3407.024,
    "text": "You have three weeks, but yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.044,
    "end": 3408.107,
    "text": "Three weeks, wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.19,
    "end": 3409.651,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.712,
    "end": 3413.121,
    "text": "Well, I guess I should take my time a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.983,
    "end": 3414.144,
    "text": "Cool."
  },
  {
    "start": 3414.344,
    "end": 3417.312,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.513,
    "end": 3417.934,
    "text": "Thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.716,
    "end": 3418.937,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.137,
    "end": 3419.398,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  }
]